{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-agrees-to-pay-175-million-dollars-to-settle-six-class-action-lawsuits-over-mccamish-cyber-incident-2693919-2025-03-15",
      "headline": "Infosys agrees to pay $17.5 million to settle lawsuits over US cyber incidentInfosys first disclosed the cyber incident in a stock exchange filing in November 2023. The company said it was working with a cybersecurity products provider to resolve the issue and had launched an independent investigation to assess its impact."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-hits-3000-for-first-time-trade-tensions-and-fed-bets-drive-rally-glbs-2693649-2025-03-14",
      "headline": "Gold hits $3,000 for first time: Trade tensions and Fed bets drive rallyGold surged past $3,000 an ounce for the first time, driven by trade tensions, recession fears, and Fed rate cut bets. Analysts expect further gains, with prices potentially reaching $3,050 in 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-correction-mutual-fund-inflows-10-month-low-amfi-data-3-alternate-investment-options-2693634-2025-03-14",
      "headline": "Mutual fund inflows at 10-month low: Here are 3 alternate investment optionsThe total assets under management (AUM) of the mutual fund industry fell 4%, from Rs 66.98 lakh crore in January to Rs 64.26 lakh crore in February."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/elon-musk-tesla-unsigned-letter-donald-trump-administration-tariff-threats-trade-war-risks-retaliation-cost-ev-industry-2693577-2025-03-14",
      "headline": "Elon Musk's Tesla warns of tariff risks in letter to Trump administrationIn an unsigned letter to the Donald Trump-led administration, his ally Elon Musk's Tesla has cautioned that the US President's trade war could expose the automaker to retaliatory tariffs and increase the cost of making electric vehicles in America."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-production-low-cost-model-y-shanghai-china-price-war-sale-drop-india-entry-2693558-2025-03-14",
      "headline": "Tesla planning low-cost Model Y in China. Will India get it too?Production will take place at Tesla's Shanghai factory, its largest production hub, and mass production is expected to begin in 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/intel-share-price-jump-15-percent-wall-street-investors-welcome-new-ceo-lip-bu-tan-2693524-2025-03-14",
      "headline": "Intel shares jump 15% as investors welcome new CEO Lip-Bu TanIntel shares closed at $23.70, jumping 14.60% as investors placed their bet on the newly announced CEO. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/holi-2025-stock-ideas-these-2-shares-piramal-pharma-ptc-india-could-deliver-up-to-16-percent-gains-2693471-2025-03-14",
      "headline": "Holi 2025 stock ideas: These 2 shares could deliver up to 16% gainsFor Holi 2025, Bajaj Broking has recommended two stocks that could see a 16% upside in the next 12 months amid a market correction that has seen Sensex and Nifty on a downward trend.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-sensex-nifty-outlook-can-domestic-triggers-lift-dalal-street-sentiment-next-week-nse-bse-2693468-2025-03-14",
      "headline": "Sensex, Nifty outlook: Can domestic triggers lift market sentiment next week?Sensex dropped 200.85 points, closing at 73,828.91, while Nifty lost 73.30 points. The market remained volatile, with Nifty closing below 22,400 after fluctuating throughout the session."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/us-stock-market-wall-street-indices-slip-as-trump-eu-tariff-threat-sparks-concerns-2693356-2025-03-13",
      "headline": "Wall Street indices slip as Trump's EU tariff threat raises concernsAt the opening bell, the S&P 500 dipped 0.9 points, or 0.09%, at the open to 5,594.45​, the Dow Jones Industrial Average dropped 70.9 points, or 0.17%, at the open to 41,280.05 and Nasdaq Composite fell 49.9 points, or 0.28%, to 17,598.565."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/found-old-share-certificates-at-home-chandigarh-man-here-is-how-you-can-encash-them-2693296-2025-03-13",
      "headline": "Old share certificates in your drawer? Here's how you can encash themThe stock value of old shares can be calculated by multiplying the number of stocks held by the current market price. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/check-sbi-latest-lending-rates-for-march-2025-mclr-and-base-rate-2693293-2025-03-13",
      "headline": "Check SBI's latest lending rates for March 2025: MCLR and base rateThe updated MCLR rates will directly influence interest rates on various financial products, including home loans, personal loans, and other credit facilities offered by the bank."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-close-for-holi-march-14-nse-bse-holiday-trading-equity-2693243-2025-03-13",
      "headline": "BSE, NSE holiday: Is stock market closed for Holi on March 14, 2025?Since there is some uncertainty over whether Holi 2025 falls on Friday or Saturday, it is important to check the official list of stock market holidays for clarity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/policies-are-a-nightmare-zerodha-ceo-nithin-kamath-on-why-life-insurance-is-getting-tougher-2693227-2025-03-13",
      "headline": "Policies are a nightmare: Nithin Kamath on why life insurance is getting tougherSince the onset of COVID-19, insurance companies have faced an increase in claims, which has led them to reassess their underwriting policies and tighten their approval process."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/closing-bell-sensex-nifty-bse-nse-dalal-street-auto-it-stocks-drag-markets-2693194-2025-03-13",
      "headline": "Sensex, Nifty erase early gains to end lower; Auto, IT stocks weigh on marketsThe S&P BSE Sensex lost 200.85 points to end at 73,828.91, while the NSE Nifty50 was down by 73.30 points to close at 22,397.20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dalal-street-sensex-nifty-market-correction-make-sense-to-stop-investing-in-mutual-funds-expert-advice-2693167-2025-03-13",
      "headline": "Does it make sense to stop investing in mutual funds amid market correction?Sensex and Nifty are down nearly 15% from their September all-time highs as volatility continues to make its presence felt, and market correction is the flavour being served on Dalal Street. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/march-15-advance-tax-deadline-are-you-required-to-pay-2693153-2025-03-13",
      "headline": "March 15 advance tax deadline: Are you required to pay?Salaried individuals, freelancers, and businesses must pay advance tax if their total tax liability (after TDS/TCS) exceeds Rs 10,000 in FY 2024-25."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/how-to-calculate-advance-tax-and-pay-it-before-filing-your-itr-deadline-march-15-steps-2693128-2025-03-13",
      "headline": "Filing your advance tax? Here's how to calculate itAdvance tax is applicable when the total tax liability for a financial year exceeds Rs 10,000. It is computed based on the estimated income for the year and paid in instalments as per the due dates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-your-upi-linked-to-an-inactive-mobile-number-this-is-how-npci-protects-you-2693107-2025-03-13",
      "headline": "Is your UPI linked to an inactive mobile number? Here's how NPCI protects youBy March 31, 2025, all banks and payment service providers (PSPs) offering UPI services must update their databases to remove inactive or recycled mobile numbers. The move aims to reduce errors and prevent fraud caused by mobile number churn."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/starlink-india-entry-partnership-spacex-bharti-airtel-reliance-jio-what-it-means-for-india-telecom-sector-2693090-2025-03-13",
      "headline": "Airtel and Jio team up with SpaceX to bring Starlink: What it means for telcosSpaceX is still awaiting permission from the government to officially launch Starlink's services in the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-form-16-necessary-for-itr-filing-what-to-do-if-you-do-not-have-it-2693072-2025-03-13",
      "headline": "Is Form 16 necessary for ITR filing? What to do if you don't have it?Form 16 provides details of the deducted tax amount and submission date and helps in ITR filing by ensuring accurate income and tax details, reducing the chances of errors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/extra-work-from-home-wfh-days-at-infosys-needs-manager-nod-report-2693017-2025-03-13",
      "headline": "Extra work from home days at Infosys needs manager's nod: ReportThis comes as the Bengaluru-based IT company rolled out a new mandate on Monday, which requires its employees to work from the office at least 10 days a month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mtnl-share-price-rise-18-percent-today-after-this-announcement-check-here-asset-monetisation-2692996-2025-03-13",
      "headline": "Explained: Why MTNL share price rose 18% todayOver the past year, the stock has gained 18.61%. Year-to-date (YTD), the stock has declined by 15.66%. In the last six months, the stock has dropped 23.25%  and in the last three months, it has fallen 25.95%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/lip-bu-tan-new-intel-ceo-march-18-ai-semiconductor-2692980-2025-03-13",
      "headline": "Who is Lip-Bu Tan, industry veteran named Intel CEO?Lip-Bu Tan, who officially takes over on March 18, has extensive experience in the chip sector and is known for investing in promising tech startups."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-why-sensex-and-nifty-are-struggling-after-gaining-in-early-trade-2692977-2025-03-13",
      "headline": "Explained: Why Sensex, Nifty are giving up early gains almost every dayStock market today: Despite multiple signals pointing to a strong opening, the Sensex and Nifty couldn't hold on to early gains. Right now, they are barely 0.10% higher."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-gains-nearly-200-points-nifty-above-22500-indusind-bank-gains-over-2-2692961-2025-03-13",
      "headline": "Sensex, Nifty gain momentum on inflation relief, IndusInd Bank falls 2%The S&P BSE Sensex gained 250.89 points to 74,280.65, while the NSE Nifty50 added 59.70 points to 22,530.20 as of 10 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/narayana-murthy-slams-freebies-culture-job-creation-innovative-entrepreneurs-remove-poverty-india-2692954-2025-03-13",
      "headline": "Not freebies, job creation will omit poverty from India: Narayana MurthyInfosys co-founder Narayana Murthy has slammed the freebies of culture, saying that job creation by innovative entrepreneurs will help eliminate poverty from India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-on-march-13-infosys-bel-ola-electric-tata-motors-and-more-2692948-2025-03-13",
      "headline": "Stocks to watch today: Infosys, BEL, Ola Electric, Tata Motors and moreStocks to watch today (March 13): Infosys, Tata Motors, and Bharat Electronics Limited are likely to be in focus today as domestic markets gear up for a mildly positive start."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-opening-prediction-on-march-13-3-key-factors-to-watch-dalal-street-expectation-2692943-2025-03-13",
      "headline": "Will Sensex, Nifty recover today? 3 things to know ahead of stock market openingStock market opening prediction today: Sensex and Nifty are likely to open higher after positive US and domestic retail inflation data. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/income-tax-deadline-only-3-days-left-to-pay-last-instalment-of-advance-tax-march-15-2692712-2025-03-13",
      "headline": "Income tax deadline: Only 3 days left to pay last instalment of advance taxMaking timely payments is crucial when it comes to tax compliance to avoid penalties and interest. Also, meeting deadlines ensures last-minute stress and a smooth tax filing process. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-on-edge-inflation-eases-but-global-retaliation-hits-stocks-hard-glbs-2692795-2025-03-12",
      "headline": "Wall Street on edge: Inflation eases, but global retaliation hits stocks hardAfter jumping to a big early gain on an encouraging inflation update, Wall Street gave back much of it after other countries announced their retaliations following President Donald Trump's latest escalation in his trade war.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-opens-higher-as-softer-inflation-data-boosts-investor-confidence-tesla-leads-market-surge-2692768-2025-03-12",
      "headline": "Wall Street opens higher as softer inflation data boosts investor confidenceAt the opening bell, the S&P 500 rose 52.8 points, or 0.95%, to 5,624.84 and the Dow Jones Industrial Average was up by 144.0 points, or 0.35%, to 41,577.5. The Nasdaq Composite also witnessed a rise of 275.3 points, or 1.58%, to 17,711.41."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/equity-mutual-fund-inflows-fall-26-percent-in-february-amid-market-volatility-2692736-2025-03-12",
      "headline": "Equity mutual fund inflows fall 26% in February amid market volatilityMarket fluctuations impacted mutual fund inflows across categories, with equity and hybrid funds seeing a decline. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/retail-inflation-eases-to-7-month-low-in-february-2692648-2025-03-12",
      "headline": "Retail inflation eases to 7-month low of 3.61% in FebruaryRetail inflation in February has cooled to a seven-month low, and it has also fallen below the RBI's medium-term target for the first time in six months. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tds-rules-changing-from-april-1-higher-tax-free-limits-on-fd-interest-lottery-insurance-commission-mutual-funds-2692626-2025-03-12",
      "headline": "TDS rules from April 1: Higher tax-free limits on FD interest, lotteryTo benefit senior citizens, the government has doubled the TDS threshold for interest income from Rs 50,000 to Rs 1 lakh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-nifty-marginally-lower-it-stocks-infosys-tumble-2692622-2025-03-12",
      "headline": "Sensex, Nifty end marginally lower as IT stocks tumble; Infosys falls over 4%The S&P BSE Sensex ended 72.56 points lower at 74,029.76, while the NSE Nifty50 settled 27.40 points lower at 22,470.50. All the other broader market indices also ended in negative territory."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/temasek-takes-a-bit-of-haldirams-buy-10-percent-stake-for-1-billion-dollar-2692580-2025-03-12",
      "headline": "Temasek takes a bit of Haldiram's, buys 10% stake for $1 billion: ReportTemasek, which has already invested in Manipal Hospitals and fast-food giant Devyani International (operator of KFC and Pizza Hut in India), is now looking to cash in on the growing snacks market with its Haldiram's bet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/air-india-rolls-out-premium-economy-fares-starting-at-rs-599-for-a-limited-time-2692556-2025-03-12",
      "headline": "Air India rolls out premium economy fares starting at Rs 599 for a limited timeThese premium economy fares are above regular economy fares on domestic flights for a limited time. Prices vary based on routes and demand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-top-7-billionaires-lose-34-billion-amid-stock-market-slump-2692540-2025-03-12",
      "headline": "India's top 7 billionaires lose $34 billion amid stock market slumpMukesh Ambani, India's richest person, lost $3.13 billion this year, though he still remains India's richest man with a net worth of $87.5 billion."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/dalal-street-falls-sensex-nifty-3-factors-behind-stock-market-correction-2692512-2025-03-12",
      "headline": "Sensex falls over 400 points. 3 factors behind today's stock market slumpStock market today: At around 12:42 pm, the S&P BSE Sensex was down 439.77 points to 73,662.55 and the Nifty50 was trading 150.50 points lower at 22,347.40. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-are-some-investors-hnis-choosing-fixed-deposits-over-sips-2692474-2025-03-12",
      "headline": "Why are some investors choosing fixed deposits over SIPs?Many stock market experts suggest that mid-cap and small-cap stocks are currently expensive, which has triggered a correction in the last six months."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/sidhu-moose-wala-little-brother-holi-pic-2694313-2025-03-16",
      "headline": "Sidhu Moose Wala's little brother's Holi pic goes viral. Seen yet?A viral photo of Sidhu Moose Wala's little brother, Shubhdeep, dressed in traditional attire with Holi colours on his cheeks, has captured the hearts of fans on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/all-of-us-are-dead-actor-lomon-on-india-i-think-of-taj-mahal-and-bengal-tigers-2694255-2025-03-16",
      "headline": "All Of Us Are Dead actor Lomon on India: I think of Taj Mahal and Bengal TigersSouth Korean actor Lomon, known for his role in All of Us Are Dead, discussed his latest project Family Matters and shared insights on his career and inspirations in an exclusive interview with India Today Digital."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/hina-khan-discoloured-nails-not-nailpaint-sideeffect-of-chemotherapy-2694210-2025-03-16",
      "headline": "Hina Khan shares pic of discoloured nails: Most common side effect of chemotherapyTelevision actor Hina Khan opened up about the side effects of chemotherapy on her nails, sharing a glimpse of the discolouration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/saira-banu-says-she-shouldnt-be-called-ar-rahmans-ex-wife-were-not-divorced-only-separated-2694208-2025-03-16",
      "headline": "Saira Banu says she shouldn't be called AR Rahman's ex-wife: We're not divorcedSaira Banu, wife of AR Rahman, clarifies that they are separated but not divorced, addressing recent rumours. She cites her health issues as a reason and wishes Rahman well."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/priyanka-chahar-choudhary-ankit-gupta-unfollow-each-other-stmp-2694198-2025-03-16",
      "headline": "Priyanka Chahar Choudhary-Ankit Gupta unfollow each other, fans speculate break-upTelevision actors Priyanka Chahar Choudhary and Ankit Gupta, known for their chemistry on Udaariyaan, have unfollowed each other on Instagram, sparking rumours about their relationship status."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ar-rahman-health-update-son-ameen-dehydartion-composer-discharged-2694173-2025-03-16",
      "headline": "AR Rahman discharged from hospital, son shares health updateAR Rahman's son Ameen shared an update on the music maestro's health, explaining his hospitalisation was due to dehydration. He assured fans that Rahman is now recovering well. India Today Digital has learnt that the composer has also been discharged."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/aamir-ali-plays-holi-with-girlfriend-ankita-kukreti-sanjeeda-shaikh-divorce-2693960-2025-03-15",
      "headline": "Watch: Actor Aamir Ali plays Holi with girlfriend Ankita KukretiTelevision actor Aamir Ali was seen celebrating Holi with his girlfriend Ankita Kukreti.  The couple's public appearance comes after Aamir confirmed his relationship status in a recent interview."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ted-lasso-starring-jason-sudeikis-show-renewed-for-fourth-season-apple-tv-2693905-2025-03-15",
      "headline": "Ted Lasso returns: Jason Sudeikis show renewed for fourth seasonApple TV+ has renewed Ted Lasso for a fourth season with Jason Sudeikis leading the charge once more. The new season will introduce Ted coaching a women's football team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/shawn-mendes-says-thank-you-india-shares-lollapalooza-performance-glimpse-photo-dump-2693841-2025-03-15",
      "headline": "Singer Shawn Mendes says 'dhanyawad' to India after Lollapalooza performanceSinger Shawn Mendes visited India for Lollapalooza 2025 and is currently in the nation, expressing his gratitude through social media post. He especially appreciated Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/comedian-zakir-khan-hosts-hasan-minhaj-indore-treat-2693783-2025-03-15",
      "headline": "Stand-up comic Zakir Khan treats Hasan Minhaj with delicious Indore foodZakir Khan hosted Hasan Minhaj in Indore, introducing him to the city's street food culture and hinting at a future collaboration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kim-soo-hyun-removed-prada-brand-ambassador-kim-sae-ron-death-2693694-2025-03-14",
      "headline": "Kim Soo-hyun removed as Prada's brand ambassador amid Kim Sae-ron scandal: ReportK-drama star Kim Soo-hyun has reportedly been removed as luxury brand Prada's brand ambassador following his alleged involvement in actor Kim Sae-ron's death scandal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-potato-lab-review-kang-taeoh-lee-sunbin-lead-netflix-quirky-comedy-2693681-2025-03-14",
      "headline": "The Potato Lab review: Kang Tae-oh, Lee Sun-bin lead this quirky comedyReleased-Sat Mar 01, 2025The Potato Lab is a fun K-drama set in a picturesque mountain valley. While it offers laughs and visual appeal, it sometimes lacks depth and originality."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/exploring-age-gaps-in-k-dramas-my-dearest-nemesis-moon-gayoung-choi-hyunwook-2686740-2025-03-14",
      "headline": "Exploring age gaps in K-dramas: Why do they cause so much buzz?K-dramas often feature age differences between lead actors, sparking debate among fans. While such gaps are common in real life, they draw more attention on screen. In this K-Fix, we will find out why do they matter so much."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/meghan-markle-returns-with-podcast-about-successful-women-days-after-cooking-show-2693652-2025-03-14",
      "headline": "Meghan Markle returns with podcast about successful women days after cooking showMeghan Markle, Duchess of Sussex, has announced her new stint. She will now be launching a podcast, narrating the stories of successful women. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ashish-chanchlani-celebrates-holi-apoorva-mukhija-returns-instagram-india-got-latent-2693645-2025-03-14",
      "headline": "Ashish Chanchlani celebrates Holi with director Abhishek KapoorAmid the India's Got Latent controversy, social media influencers Ashish Chanchlani and Apoorva Mukhija seemed to be moving forward in their respective journeys. Chanchlani stepped out to celebrate Holi, while Mukhija made her Instagram comeback, expressing gratitude to her fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/hema-malini-seen-with-a-script-for-reality-show-on-indian-idol-fans-react-2693602-2025-03-14",
      "headline": "Hema Malini seen with a 'script for reality show' on Indian Idol, fans reactA Reddit post suggested the scripted nature of Indian Idol as actor Hema Malini was seen holding a detailed script during a recent episode. The revelation has sparked reactions online, questioning the authenticity of reality shows."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/video/k-drama-star-lomon-on-family-matters-taj-mahal-speaks-in-hindi-india-all-of-us-are-dead-exclusive-2693616-2025-03-14",
      "headline": "K-drama star Lomon on Family Matters, Taj Mahal, India, All of Us are Dead | ExclusiveK-drama star Lomon sits down with India Today's Bhavna Agarwal to talk about his latest release, Family Matters, now streaming on Channel K. He has a special message for Indian fans as well. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kim-soo-hyun-agency-confirms-he-dated-kim-sae-ron-denies-his-role-in-her-death-official-statement-2693538-2025-03-14",
      "headline": "Kim Soo-hyun's agency confirms he dated Kim Sae-ron, denies his role in her deathSouth Korean actor Kim Soo-hyun has been facing a lot of backlash for his alleged involvement in pushing his former girlfriend Kim Sae-ron to the brink of death. His agency has now clarified that the two were indeed dating. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/amitabh-bachchan-confirms-his-kaun-banega-crorepati-return-amid-retirement-rumours-2693526-2025-03-14",
      "headline": "Amitabh Bachchan confirms his KBC return amid retirement rumoursAmid speculation of Shah Rukh Khan or Aishwarya Rai hosting the next season of Kaun Banega Crorepati, Amitabh Bachchan has confirmed his return as the host. The veteran actor expressed gratitude for the love and support he received over the past 25 years."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-lex-fridman-podcast-reflects-on-2002-godhra-riots-misinformation-that-they-were-biggest-ever-2694337-2025-03-16#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "PM Modi reflects on 2002 Godhra riots: Misinformation that they were biggest everPM Modi pointed out that Gujarat had a long history of violence \"long before I was in the picture.\" He described how riots occurred in the state almost every year, but noted that there have been no riots since 2002."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/baloch-rebels-release-first-visuals-of-attack-on-pakistan-military-convoy-2694318-2025-03-16#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Baloch insurgents release first visuals of attack on Pakistan military convoyThe Majeed Brigade, along with another BLA's unit, Fateh Squad, targeted a military convoy, comprising eight buses, one of which was completely destroyed in the explosion in Balochistan's Noshki, said the BLA in an official statement earlier in the day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-narendra-modi-reflects-on-growing-up-in-poverty-in-conversation-with-us-podcaster-lex-fridman-2694289-2025-03-16#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Collected chalk to clean my white shoes: PM reflects on growing up in povertyPrime Minister Narendra Modi shared memories of his childhood in poverty, recalling how he polished his shoes with chalk. He reflected on Vadnagar's rich history, highlighting its Buddhist heritage and excavation projects that revealed its cultural significance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/indians-abroad/story/how-ranjani-srinivasan-fled-us-amid-deportation-row-recalls-turmoil-2694264-2025-03-16#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How student Ranjani Srinivasan dodged immigration agents twice before fleeing USAs federal immigration agents turned up at her doorsteps for two consecutive days, Ranjani Srinivasan from Columbia University, who deported herself from the US last week after a fellow Palestinian student was detained, said she had to make \"a quick decision\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/lex-fridman-says-he-was-on-45-hour-water-fasting-to-prepare-for-pm-modi-interview-2694286-2025-03-16#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Lex Fridman says he was on 45-hour water fasting to prepare for PM's interviewWhen asked where his mind goes during fasting, PM Modi explained how ancient the practice is and how it has transformed his life, helping him \"think out of the box\" and heightening his senses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nirmala-sitharaman-has-also-used-tamil-rupee-symbol-mk-stalin-backs-budget-move-2694307-2025-03-16#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Nirmala Sitharaman has also used Tamil rupee symbol: MK Stalin backs Budget moveTamil Nadu Chief Minister MK Stalin defended the use of the Tamil letter for 'ru' in the state's budget, citing Nirmala Sitharaman's past use of it. He called criticism of the move unnecessary and linked it to promoting Tamil. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-lex-fridman-podcast-pakistan-cross-border-terrorism-peace-overtures-2694310-2025-03-16#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "PM shreds Pakistan in podcast, says every peace attempt was met with betrayalIn a podcast with American podcaster Lex Fridman, Prime Minister Narendra Modi lashed out at Pakistan, saying it had been waging a proxy war against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/mohammed-shami-daughter-playing-holi-illegal-shahabuddin-razvi-2694252-2025-03-16#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Cleric who slammed Shami over roza now criticises his daughter for playing HoliThe cleric who had slammed Mohammed Shami for not keeping fast during Ramzan has criticised the pacer's daughter for playing holi. He said that it was a crime and against Shariat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/uk-news/story/oxford-historian-research-india-uk-home-office-husband-academic-legal-challenge-2694249-2025-03-16#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Oxford historian facing deportation from UK after research in India. Here's whyA 37-year-old Indian historian from Oxford University is facing deportation threats from the UK after the Home Office ruled that she exceeded the number of days permitted to live and conduct research in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-ukraine-zelenskyy-russia-vladimir-putin-kyiv-moscow-ukraine-war-peace-plan-2694292-2025-03-16#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "What would PM Modi tell Putin, 'brother' Zelenskyy on Ukraine war? He sharesPrime Minister Narendra Modi, in his podcast interview with Lex Fridman, said he would tell the presidents of Ukraine and Russia that it was not the time for war and no resolution would come on the battlefield."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjp-mla-asha-nautiyal-calls-for-banning-non-hindus-from-kedarnath-temple-2694245-2025-03-16#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Uttarakhand BJP MLA's 'ban non-Hindus at Kedarnath' remark sparks rowBJP MLA Asha Nautiyal claimed non-Hindu individuals were harming the Kedarnath temple's sanctity and supported restricting their entry to the site."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/missing-indian-student-sudiksha-konanki-clothes-found-on-beach-chair-report-2694234-2025-03-16#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Missing Indian student Sudiksha Konanki's clothes found on beach chair: ReportSudiksha Konanki had arrived in the Caribbean for spring break and was last seen on the morning of March 6 with Joshua Riibe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/ropeway-to-kedarnath-hemkund-sahib-will-you-take-this-stairway-to-heaven-valley-of-flowers-cable-car-govindghat-doneprayag-2693940-2025-03-16#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ropeway to Kedarnath: Will you take this Stairway to Heaven?Better connectivity due to a railway line and two cable car projects in Uttarakhand will help both tourists and locals, but it could forever change the essence of the pilgrimage experience to Kedarnath."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-the-taxman-will-now-pause-before-making-customs-or-gst-arrests-2694294-2025-03-16#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why the taxman will now pause before making customs or GST arrestsThe Supreme Court makes it mandatory for arrests under customs and GST laws to meet the same standards of constitutional propriety that apply to other cases."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-delhi-capitals-axar-patel-preview-2694233-2025-03-16#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "DC Preview: Delhi Capitals enter Axar Patel era to end title droughtIPL 2025: Delhi Capitals, captained by Axar Patel, will begin their campaign on March 24 against Lucknow Super Giants with the aim of ending their 17-year-long wait to win the title. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mammootty-team-dismisses-cancer-rumours-break-for-ramzan-2694326-2025-03-16#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Mammootty's team dismisses cancer rumours: He is on vacation, is fasting for RamzanMalayalam superstar Mammootty's team shared that the actor is on vacation for Ramzan fasting and will resume work soon. This comes after rumours of him being diagnosed with cancer started doing the rounds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/gurugram-woman-claims-uber-pets-costs-5-times-more-than-regular-uber-go-rides-viral-linkedin-post-2694265-2025-03-16#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Gurugram woman claims Uber Pets costs 5 times more than regular rides in viral postIn a now-viral post on LinkedIn, a Gurugram-based woman claimed that Uber Pets charges over five times the price of a usual ride.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/trending/weekly-quiz-459-14-03-2025#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Question Time: India Today News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-china-ties-pm-modi-xi-jinping-ladakh-standoff-border-tensions-podcast-2694263-2025-03-16#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How will friendship with Xi Jinping help resolve India-China ties? PM respondsHighlighting that discords were natural between two neighbouring countries like India and China, Prime Minister Narendra Modi called for dialogue to ensure a stable and cooperative relationship between both countries."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-military-convoy-attacked-baloch-insurgents-claim-90-killed-2694202-2025-03-16#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Baloch insurgents claim 90 killed in attack on Pakistani military convoyBaloch insurgents claim 90 Pakistani soldiers were killed in an attack on a Pakistani military convoy on Sunday by the Baloch Liberation Army."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-climate-change-hurts-maharashtras-alphonso-farmers-2694296-2025-03-16#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How climate change hurts Maharashtra's Alphonso farmersGrowers in the Konkan belt blame the fall in production of the GI-tagged Alphonso mangoes on unsuitable weather."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-rivalry-pm-narendra-modi-lex-fridman-podcast-2694290-2025-03-16#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Results reveal who is better: PM Modi on India-Pakistan cricket rivalryPrime Minister Narendra Modi commented on sports and the famous India-Pakistan cricket rivalry on the Lex Fridman podcast. PM Modi also opened up on who he feels is the best footballer of all time. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/us-president-trump-launches-strikes-on-iran-backed-yemen-houthis-hell-will-rain-down-2694139-2025-03-16#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US strikes on Yemen's Houthis kill 31, Trump warns 'Your time is up'Trump also issued a stern warning to Iran, the main supporter of the Houthis, demanding an immediate end to its backing of the group. He cautioned that any threat to the United States would have serious consequences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-lex-fridman-podcast-recalls-time-when-donald-trump-threw-off-security-for-a-walk-with-him-at-howdy-modi-2694261-2025-03-16#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "PM says Trump more prepared in new term, recalls time with him at 'Howdy Modi'During an interview with Lex Fridman, Prime Minister Narendra Modi recalled suggesting to US President Donald Trump that they take a lap around the stadium to greet attendees at the \"Howdy Modi\" event in Houston.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mammootty-team-dismisses-cancer-rumours-break-for-ramzan-2694326-2025-03-16",
      "headline": "Mammootty's team dismisses cancer rumours: He is on vacation, is fasting for RamzanMalayalam superstar Mammootty's team shared that the actor is on vacation for Ramzan fasting and will resume work soon. This comes after rumours of him being diagnosed with cancer started doing the rounds."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/video/ranveer-singh-deepika-padukone-twin-in-all-black-at-the-airport-watch-2694317-2025-03-16",
      "headline": "Ranveer Singh-Deepika Padukone twin in all black at the airport. WatchRanveer Singh and Deepika Padukone were spotted at the airport today. The couple chose to twin and wore all-black outfits, accessorising them with their shades."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/veer-pahariya-says-boney-kapoor-was-in-tears-after-watching-sky-force-exclusive-2694282-2025-03-16",
      "headline": "Veer Pahariya recalls Boney Kapoor's response to Sky Force: He was in tearsActor Veer Pahariya shared an emotional moment from his film Sky Force's screening, where veteran producer Boney Kapoor was moved to tears by its climax. Veer revealed that Kapoor's unbiased appreciation of the film provided him with a significant confidence boost in his acting journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/krrish-4-delayed-budget-700-crore-siddharth-anand-marflix-exit-director-karan-malhotra-out-2694241-2025-03-16",
      "headline": "Krrish 4 delayed: Siddharth Anand exits, Rakesh Roshan to not direct filmKrrish 4 is reportedly facing production changes with Siddharth Anand and his banner Marflix's exit, along with that of director Karan Malhotra who Anand got on board. Rakesh Roshan also confirmed passing on the directorial role."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/bcci-nca-doctor-nitin-patel-resigns-vvs-laxman-2694346-2025-03-16",
      "headline": "BCCI Sports Science head resigns, NCA expected to see major changesBCCI's newly inaugurated Centre of Excellence (COE) is set to undergo staff changes after Nitin Patel resigned as head of the Sports Science and Medical team. Additionally, several coaches, including those from NCA, may move on in the coming months.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-delhi-capitals-abishek-porel-axar-patel-rishabh-pant-2694341-2025-03-16",
      "headline": "Dehli Capitals will miss Rishabh Pant: Abishek Porel nostalgic ahead of new seasonDelhi Capitals wicketkeeper-batter Abishek Porel has said that the team will miss Rishabh Pant. In an interview with Sports Today, Porel drew similarities between the captaincies of Rishabh and Axar Patel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-delhi-capitals-axar-patel-preview-2694233-2025-03-16",
      "headline": "DC Preview: Delhi Capitals enter Axar Patel era to end title droughtIPL 2025: Delhi Capitals, captained by Axar Patel, will begin their campaign on March 24 against Lucknow Super Giants with the aim of ending their 17-year-long wait to win the title. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-chennai-super-kings-regret-rr-2694324-2025-03-16",
      "headline": "MS Dhoni reveals IPL moment he regrets the most: That was a big mistakeMS Dhoni revealed the IPL moment he regrets the most ahead of the start of the 2025 campaign. Dhoni is all set to play his 18th IPL campaign and will be part of CSK once again. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-shardul-thakur-lsg-training-photo-2694320-2025-03-16",
      "headline": "Shardul Thakur to LSG? All-rounder sparks rumours after photo goes viralMumbai all-rounder Shardul Thakur's photos wearing the Lucknow Super Giants training kit have gone viral. The photos sparked rumours about whether he was going to join the injury-stricken side for the upcoming edition of the tournament.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-karun-anir-exclusive-delhi-capitals-second-stint-2694306-2025-03-16",
      "headline": "IPL 2025: 'Mature' Karun Nair eager to grab opportunities in second DC stintIn an exclusive interaction with India Today, Karun Nair hopes he can bring in the maturity he has gained in recent times to the IPL during his second stint with the Delhi Capitals. Karun spent 2 seasons with Delhi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-delhi-capitals-karun-nair-comments-2694293-2025-03-16",
      "headline": "Karun Nair backing on domestic form to conquer IPL 2025Vidarbha batter Karun Nair was roped in by Delhi Capitals ahead of the IPL 2025. Nair hoped to translate his domestic form into the IPL this season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-rivalry-pm-narendra-modi-lex-fridman-podcast-2694290-2025-03-16",
      "headline": "Results reveal who is better: PM Modi on India-Pakistan cricket rivalryPrime Minister Narendra Modi commented on sports and the famous India-Pakistan cricket rivalry on the Lex Fridman podcast. PM Modi also opened up on who he feels is the best footballer of all time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/mohammed-shami-daughter-playing-holi-illegal-shahabuddin-razvi-2694252-2025-03-16",
      "headline": "Cleric who slammed Shami over roza now criticises his daughter for playing HoliThe cleric who had slammed Mohammed Shami for not keeping fast during Ramzan has criticised the pacer's daughter for playing holi. He said that it was a crime and against Shariat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/laliga-real-madrid-carlo-ancelotti-72-hours-rest-villareal-win-2694244-2025-03-16",
      "headline": "Real Madrid won't play again without 72 hours of rest: Boss Carlo AncelottiReal Madrid boss Carlo Ancelotti claimed that his team will never play a game again without a 72-hour rest period. Real Madrid defeated Villareal on Saturday 2-1, but the game happened 66 hours after their shootout win in the Champions League against Atletico Madrid. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-schedule-fixtures-dates-2694235-2025-03-16",
      "headline": "Delhi Capitals Complete Schedule: Full DC Fixtures, Venues, Match DatesDelhi Capitals IPL 2025 Full Schedule, DC Squad: Axar Patel's Capitals will be looking to end their title drought when they get their campaign underway on March 24 against Lucknow Super Giants. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-delhi-capitals-karun-nair-comments-2694293-2025-03-16",
      "headline": "Karun Nair backing on domestic form to conquer IPL 2025Vidarbha batter Karun Nair was roped in by Delhi Capitals ahead of the IPL 2025. Nair hoped to translate his domestic form into the IPL this season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-rivalry-pm-narendra-modi-lex-fridman-podcast-2694290-2025-03-16",
      "headline": "Results reveal who is better: PM Modi on India-Pakistan cricket rivalryPrime Minister Narendra Modi commented on sports and the famous India-Pakistan cricket rivalry on the Lex Fridman podcast. PM Modi also opened up on who he feels is the best footballer of all time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/mohammed-shami-daughter-playing-holi-illegal-shahabuddin-razvi-2694252-2025-03-16",
      "headline": "Cleric who slammed Shami over roza now criticises his daughter for playing HoliThe cleric who had slammed Mohammed Shami for not keeping fast during Ramzan has criticised the pacer's daughter for playing holi. He said that it was a crime and against Shariat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/laliga-real-madrid-carlo-ancelotti-72-hours-rest-villareal-win-2694244-2025-03-16",
      "headline": "Real Madrid won't play again without 72 hours of rest: Boss Carlo AncelottiReal Madrid boss Carlo Ancelotti claimed that his team will never play a game again without a 72-hour rest period. Real Madrid defeated Villareal on Saturday 2-1, but the game happened 66 hours after their shootout win in the Champions League against Atletico Madrid. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-schedule-fixtures-dates-2694235-2025-03-16",
      "headline": "Delhi Capitals Complete Schedule: Full DC Fixtures, Venues, Match DatesDelhi Capitals IPL 2025 Full Schedule, DC Squad: Axar Patel's Capitals will be looking to end their title drought when they get their campaign underway on March 24 against Lucknow Super Giants. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-yuzvendra-chahal-kuldeep-yadav-india-team-return-2694226-2025-03-16",
      "headline": "Yuzvendra Chahal 'happy' for Kuldeep Yadav, not thinking about India returnYuzvendra Chahal said he is happy to see Kuldeep Yadav excel in the Indian team and hailed him as the best wrist-spinner in the world at the moment. Chahal also said he isn't thinking about the Indian team return at the moment. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/f1-2025-lewis-hamilton-ferrari-australian-grand-prix-2694211-2025-03-16",
      "headline": "Lewis Hamilton rues missing big chance at Australian GP in lacklustre Ferrari debutLewis Hamilton reacted to a lacklustre debut for Ferrari and lamented missing out on a big chance during the Australian Grand Prix on Sunday, March 16. Hamilton struggled during the tricky race and finished 10th in the end. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sachin-tendulkar-100th-hundred-international-career-on-this-day-2694199-2025-03-16",
      "headline": "On This Day: Sachin Tendulkar creates history with 100th hundred of his careerOn this day in 2012, Sachin Tendulkar scored his 100th international hundred during an Asia Cup tie against Bangladesh. Tendulkar reached the landmark at the Sher-e-Bangla National Stadium in Mirpur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2025-delhi-capitals-marizanne-kapp-final-video-2694195-2025-03-16",
      "headline": "Watch: Distraught DC all-rounder breaks down after Delhi Capitals lose finalWPL 2025: Mariznne Kapp broke down in tears and was consoled by her teammates Alice Capsey and Jemimah Rodrigues after Delhi Capitals lost to Mumbai Indians in the final on Saturday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/f1-2025-lando-norris-australian-gp-win-reaction-2694185-2025-03-16",
      "headline": "F1: Lando Norris happy with winning start despite 'stressful' Australian GPLando Norris said he was happy to start the F1 2025 season with a win but admitted that the Australian GP was stressful for him. Norris was able to hold off Max Verstappen to secure the win on Sunday, March 16. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2025-rcb-nat-sciver-brunt-mumbai-indian-stats-2694181-2025-03-16",
      "headline": "RCB's record chase, Nat Sciver-Brunt's dream run and more statsWPL 2025: The 22 matches in the Women's Premier League saw plenty of records being broken. The tournament came to a close with Mumbai Indians (MI) lifting the title for the second time at the Brabourne Stadium in Mumbai on Saturday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/f1-lando-norris-wins-season-opening-race-lewis-hamilton-10th-in-ferrari-debut-2694168-2025-03-16",
      "headline": "F1: McLaren's Norris wins Australian GP, Hamilton 10th in Ferrari debutLando Norris started the F1 2025 campaign in fine fashion as he fended off Max Verstappen to win the Australian GP on Sunday, March 16. The race, which was affected by rain, also saw Lewis Hamilton's poor weekend come to an end as he finished 10th on his Ferrari debut. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/indian-wells-carlos-alcaraz-jack-draper-semi-final-2694159-2025-03-16",
      "headline": "Carlos Alcaraz's three-peat dream crashes in semis against Jack DraperIndian Wells Masters 2025: Jack Draper became the third player after Rafael Nadal and Andy Murray to beat Carlos Alcaraz when he won 6-1, 0-6, 6-4 in the semi-final on Saturday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/f1-2025-lando-norris-australian-gp-win-reaction-2694185-2025-03-16",
      "headline": "F1: Lando Norris happy with winning start despite 'stressful' Australian GPLando Norris said he was happy to start the F1 2025 season with a win but admitted that the Australian GP was stressful for him. Norris was able to hold off Max Verstappen to secure the win on Sunday, March 16. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2025-rcb-nat-sciver-brunt-mumbai-indian-stats-2694181-2025-03-16",
      "headline": "RCB's record chase, Nat Sciver-Brunt's dream run and more statsWPL 2025: The 22 matches in the Women's Premier League saw plenty of records being broken. The tournament came to a close with Mumbai Indians (MI) lifting the title for the second time at the Brabourne Stadium in Mumbai on Saturday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/f1-lando-norris-wins-season-opening-race-lewis-hamilton-10th-in-ferrari-debut-2694168-2025-03-16",
      "headline": "F1: McLaren's Norris wins Australian GP, Hamilton 10th in Ferrari debutLando Norris started the F1 2025 campaign in fine fashion as he fended off Max Verstappen to win the Australian GP on Sunday, March 16. The race, which was affected by rain, also saw Lewis Hamilton's poor weekend come to an end as he finished 10th on his Ferrari debut. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/indian-wells-carlos-alcaraz-jack-draper-semi-final-2694159-2025-03-16",
      "headline": "Carlos Alcaraz's three-peat dream crashes in semis against Jack DraperIndian Wells Masters 2025: Jack Draper became the third player after Rafael Nadal and Andy Murray to beat Carlos Alcaraz when he won 6-1, 0-6, 6-4 in the semi-final on Saturday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-vs-pakistan-christchurch-t20i-kyle-jamieson-2694148-2025-03-16",
      "headline": "New-look Pakistan hammered in T20I series openerNZ vs PAK: New Zealand beat Pakistan by nine wickets in the series opener at the Hagley Oval to take a 1-0 lead in the series. Kyle Jamieson won the Player of the Match award with figures of 4-1-8-3. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-bcci-family-restriction-rule-ipl-2025-2694144-2025-03-16",
      "headline": "Don't want to sit alone and sulk: Kohli on BCCI's family restriction ruleVirat Kohli said that the presence of families on tours helps cricketers take responsibility for their game in a better way when they are going through tough times. Kohli was a part of India's Champions Trophy-winning squad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-vs-pakistan-lowest-score-christchurch-2694135-2025-03-16",
      "headline": "Pakistan slump to their lowest T20I total vs New Zealand in ChristchurchNZ vs PAK: Pakistan were bowled out for 91 in 18.4 overs, their lowest score against New Zealand in T20Is. For the first time, Pakistan were bowled out for a score of under 100 in a T20I against the Black Caps. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2025-final-meg-lanning-mumbai-indians-vs-delhi-capitals-2694129-2025-03-16",
      "headline": "Not all fairytales have happy endings, some have agony. Ft. Meg LanningWPL 2025: Meg Lanning finished as the losing captain for the third time on the trot in the tournament after Mumbai Indians beat the Delhi Capitals by eight runs in the final on Saturday at the Brabourne Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2025-winners-mumbai-indians-beat-delhi-capitals-2694099-2025-03-15",
      "headline": "Mumbai Indians win WPL crown after Harman special, Delhi crumble once againDelhi Capitals crumbled under pressure once again, losing their third title match in three seasons. MI captain Harmenpreet Kaur starred with a stunning 66-run knock as Mumbai won the summit clash by 8 runs.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-virat-kohli-chhole-bhature-rcb-summit-2694091-2025-03-15",
      "headline": "Virat Kohli's dig at broadcasters: No need to discuss my favourite chhole bhatureVirat Kohli took a dig at the broadcasters at the RCB Innovation Lab Indian Sports Summit. Kohli said that the analysts should focus on cricket and not discuss what his favourite place to eat chhole bhature in Delhi was.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-ishan-kishan-srh-practice-game-video-abhishek-sharma-2694078-2025-03-15",
      "headline": "Ishan Kishan upstages Abhishek Sharma in SRH intra-squad match, hits blazing 64Ishan Kishan played a blazing knock of 64 runs in the latest intra-squad match in the SunRisers Hyderabad side. Kishan was bought by SRH for Rs 11.25 crore in the mega-auction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-final-mumbai-indians-vs-delhi-capitals-nat-sciver-brunt-500-runs-record-2694068-2025-03-15",
      "headline": "WPL 2025 Final: Sciver-Brunt first to breach 500-run mark in single seasonNat Sciver-Brunt became the first player to surpass 500 runs in a single WPL season, achieving the milestone during the 2025 final against Delhi Capitals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/virat-kohli-retirement-test-odi-cricket-2694047-2025-03-15",
      "headline": "Virat Kohli: I might not have another Australia tour in meVirat Kohli sparked retirement rumours on Saturday, March 15 after he said that he might not have another tour of Australia in him. The senior batter said that he was at peace with whatever happened on the recent tour Down Under.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-virat-kohli-rcb-retirement-u-turn-olympics-2694023-2025-03-15",
      "headline": "Virat Kohli to play in 2028 Olympics? India star on possible retirement U-turnVirat Kohli has joked that he might come out of T20I retirement to play in the LA Olympics in 2028. The senior Royal Challengers Bengaluru batter said that to be an Olympic champion would be a magnificent feeling."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}