{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-prices-climb-again-will-the-rally-continue-till-dhanteras-should-you-buy-gold-2802173-2025-10-13",
      "headline": "Gold prices climb again. Will the rally continue till Dhanteras?Gold is once again on the rise, drawing attention from investors and festive buyers alike. With prices touching record levels and global uncertainty at play, many are now wondering if the momentum will carry through to Dhanteras."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/disappointed-tata-capital-market-debut-5-reasons-why-not-to-worry-2802122-2025-10-13",
      "headline": "Disappointed with Tata Capital market debut? 5 reasons why you shouldn't worryTata Capital IPO: The shares opened at Rs 330 on listing day, roughly 1% above the IPO price of Rs 326—a flat, polite start for what was billed as the biggest public issue of the year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/tata-capital-share-price-1-percent-premium-rs-330-bse-nse-flat-debut-stock-market-2802109-2025-10-13",
      "headline": "Tata Capital share price: 2025's biggest IPO makes flat debut on stock marketTata Capital shares listed at Rs 330 on both the NSE and the BSE, opening at a premium of just 1% over its issue price. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-fall-stock-market-falling-rising-volatility-2802104-2025-10-13",
      "headline": "Sensex tumbles nearly 400 points: Why is the stock market falling today?Across Asia, markets opened lower, and India wasn't spared either. Profit booking after last week's gains and cautious sentiment ahead of key domestic events like the Tata Capital listing, Q2 earnings, and inflation data added to the drag."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/lg-electronics-share-price-listing-date-latest-gmp-profit-for-investors-expected-gains-2802093-2025-10-13",
      "headline": "LG Electronics IPO set for a bumper listing tomorrow? Check latest GMPLG Electronics IPO was open for subscription from October 7 to October 9 and saw strong participation across all investor categories."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-down-over-300-points-nifty-below-25200-indigo-airtel-among-top-gainers-2802084-2025-10-13",
      "headline": "Sensex, Nifty fall amid US-China tariff tensions; focus on Tata Capital listingThe S&P BSE Sensex fell over 300 points in early trade, while the NSE Nifty50 slipped around 100 points amid mild profit booking after last week's gains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/tata-capital-ipo-share-price-listing-gmp-today-market-debut-profit-investors-gains-2802063-2025-10-13",
      "headline": "Tata Capital share listing today: Will investors see profit from biggest IPO in 2025?The Rs 15,511.87 crore IPO, which opened for subscription on October 6 and closed on October 8, received bids for 65.33 crore shares against 33.34 crore shares on offer, subscribing 1.96 times overall."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/what-is-a-will-importance-how-to-make-it-in-india-personal-finance-types-legal-help-2801990-2025-10-13",
      "headline": "What's in a Will? Understanding the power of your last wordFrom Bollywood dramas where brothers turn against each other to real-life stories of families dragged into courtrooms, most of these disputes begin with one missing document, a will."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/why-indians-still-prefer-buying-homes-during-auspicious-months-real-estate-buying-2801783-2025-10-12",
      "headline": "Why Indians still prefer buying homes during auspicious monthsBuying a home in India is more than just a financial decision — it is an emotional milestone. For many, choosing the right time to invest is as important as picking the right property, with festivals and auspicious dates playing a big role."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/crypto-crash-wipes-out-19-billion-after-trumps-100-china-tariffs-spark-sell-off-2801593-2025-10-11",
      "headline": "Crypto crash wipes out $19 billion after Trump's 100% China tariffs spark sell-offThe cryptocurrency market suffered a historic crash after US President Donald Trump announced 100% tariffs on China and new export controls on software."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/bira-91-crisis-name-change-regulatory-nightmare-internal-conflict-unpaid-salaries-2801525-2025-10-11",
      "headline": "Crisis brews at Bira 91: How a name change shook the popular beer brandFrom beer icon to regulatory nightmare, Bira 91's journey shows how a minor administrative tweak can spiral into financial chaos, employee unrest, and investor anxiety."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/tata-capital-vs-lg-electronics-ipo-strategy-after-stock-market-listing-2801500-2025-10-11",
      "headline": "LG Electronics vs Tata Capital IPO: What should be your strategy post-listing?Two IPOs, two very different strategies. Tata Capital offers steady long-term growth, while LG Electronics promises quick listing gains. Read on to plan post-listing moves and investment approach carefully."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/lg-electronics-ipo-allotment-status-listing-gains-gmp-october-14-2801482-2025-10-11",
      "headline": "LG Electronics IPO allotment is finally out. How much listing gain you can expect?Investors who received allotments may be sitting on potential listing gains of Rs 5,000–Rs 6,000 per lot, depending on market sentiment at the time of debut. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ashok-kumar-pal-senior-reliance-power-executive-and-anil-ambani-aide-arrested-by-ed-in-money-laundering-case-2801353-2025-10-11",
      "headline": "Anil Ambani aide and senior Reliance Power executive arrested by EDThe arrest of Ashok Pal, who serves as the executive director at Reliance Power, is related to a suspected fake bank guarantee racket worth Rs 68.2 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-history-nehru-jinnah-bose-allied-to-save-steel-company-trusts-rift-news-noel-tata-2801102-2025-10-10",
      "headline": "Tata History: When Nehru, Jinnah, and Bose allied to save steel companyStarting as a company trading in cotton and opium, the Tata Group has weathered colonial economic warfare, nationalist politics, labor upheaval, and insurgent crises. But it has always emerged stronger through vision, sacrifice, and resilience. In the final episode of our series on the group, we revisit two storms that threatened to sink the Tata brand and image. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-328-points-higher-nifty-above-25250-cipla-sbi-lead-gains-2801059-2025-10-10",
      "headline": "Sensex, Nifty end higher as financial stocks rally; Cipla, SBI among top gainersSensex ends 328 points higher, Nifty above 25,250; Cipla, SBI lead gains"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/convenience-or-debt-trap-the-hidden-cost-of-bpnl-easy-credit-and-festive-offers-2800924-2025-10-10",
      "headline": "Convenience or debt trap? The hidden cost of BPNL, easy credit and festive offersEvery festive season, easy credit makes everything—from gadgets to holidays—look affordable. But behind the glitter of BNPL schemes and \"no-cost EMIs\" lies a growing debt trap that's quietly eroding financial freedom."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-trusts-internal-rift-trustee-vijay-singh-calls-is-unprecedented-different-era-report-2801034-2025-10-10",
      "headline": "Tata Trusts trustee Vijay Singh calls internal rift unprecedented: ReportVijay Singh, who serves as a trustee and vice-chairman of Tata Trusts, said that the act of voting on internal matters went against the long-standing principles followed during Ratan Tata's leadership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wework-india-slips-5-in-debut-trade-amid-valuation-governance-concerns-2801006-2025-10-10",
      "headline": "WeWork India slips 5% in debut trade amid valuation, governance concernsCorporate governance firm InGovern warned investors of WeWork India's fragile financials, negative cash flow, high lease liabilities, and the absence of fresh capital infusion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/buy-borrow-die-the-wealth-cheat-code-the-rich-do-not-share-explains-ca-2800989-2025-10-10",
      "headline": "Buy, borrow, die: The wealth cheat code the rich don't share, explains CAEver wondered how wealthy families keep growing their wealth while others struggle with taxes and inflation? CA reveals a simple three-step strategy: Buy, Borrow, Die. Have a look."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tara-sutaria-veer-pahariya-red-carpet-debut-manish-malhotra-diwali-bash-2802161-2025-10-13",
      "headline": "Tara Sutaria, Veer Pahariya's hand-in-hand entry wins hearts at Manish Malhotra's bash Actors Tara Sutaria and Veer Pahariya made their first red carpet appearance together at Manish Malhotra's Diwali bash. The two were clicked posing hand-in-hand for the paparazzi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-admits-it-was-his-misunderstanding-that-led-to-issues-with-arijit-singh-2802166-2025-10-13",
      "headline": "Salman Khan admits it was his misunderstanding that led to issues with Arijit Salman Khan addressed his rumoured feud with Arijit Singh on 'Bigg Boss 19'. The actor clarified that the misunderstanding was on his side, not Arijit's. Both confirmed continued collaboration in recent and upcoming films."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rishab-shetty-kantara-climax-shoot-exhaustion-swollen-leg-15-drafts-prequel-script-2802157-2025-10-13",
      "headline": "Rishab Shetty filmed Kantara Chapter 1 climax despite swollen legs, exhaustion Kantara: Chapter 1's climactic scene was shot by Rishab Shetty despite severe physical challenges, showcasing his unwavering dedication. The film's prequel involved an extensive creative process with numerous drafts, highlighting the depth behind this cinematic journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/deepika-8-hour-shift-demand-she-should-get-what-she-wants-says-shalini-pandey-2802137-2025-10-13",
      "headline": "Deepika's 8-hour shift demand: She should get what she wants, says Shalini Pandey Shalini Pandey praises Deepika Padukone's commitment to mental health and work reforms. The discussion highlights ongoing industry changes supporting new mothers and professional balance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-blasts-abhinav-kashyap-on-viral-claims-go-after-your-own-brother-2802139-2025-10-13",
      "headline": "Salman Khan blasts Abhinav Kashyap on viral claims: Go after your own brother Salman Khan responded to Abhinav Kashyap's public accusations during 'Bigg Boss 19'. Kashyap earlier alleged career sabotage and called Khan and his family 'criminals'. The dispute traces back to disagreements after the release of 'Dabangg' (2010)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/abhishek-bachchan-wins-best-actor-award-70th-filmfare-awards-i-want-to-talk-2802133-2025-10-13",
      "headline": "Abhishek dedicates Best Actor Award to Aishwarya, Aaradhya in emotional speech Abhishek Bachchan won his first Best Actor in a Leading Role (Male) award at the 70th Filmfare Awards for his performance in 'I Want To Talk.' The actor delivered an emotional speech, thanking his wife Aishwarya and daughter Aaradhya, highlighting their support and sacrifices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/vijay-sethupathi-trolls-praveen-gandhi-evicted-bigg-boss-tamil-9-2802128-2025-10-13",
      "headline": "Bigg Boss Tamil 9 highlights: Praveen Gandhi evicted, says he's not a loser Vijay Sethupathi showcased his sarcastic side while interacting with Bigg Boss Tamil 9 contestants. Director Praveen Gandhi was the first to be evicted, with unexpected twists like water tank removal adding spice to the show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/reese-witherspoon-debuts-as-novelist-harlan-coben-co-authors-2802111-2025-10-13",
      "headline": "Reese Witherspoon debuts as novelist, Harlan Coben co-authors Hollywood actor Reese Witherspoon has ventured into writing with her debut novel 'Gone Before Goodbye', co-authored with thriller writer Harlan Coben. The gripping story highlights a strong female surgeon navigating a high-stakes world, aiming to inspire young girls to pursue careers in medicine."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/ishit-bhatt-kbc-17-controversy-parenting-manners-social-media-debate-2802057-2025-10-13",
      "headline": "Video of young KBC contestant's behaviour goes viral, users question parenting Young Ishit Bhatt's conduct on KBC 17 sparked strong reactions online. Many viewers criticised his overconfidence and questioned parental guidance, while others called for restraint and balanced judgement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/babil-khan-mental-health-journey-instagram-post-family-support-2802107-2025-10-13",
      "headline": "Babil Khan discusses battle with depression months after viral video Babil Khan has opened up about his struggles with depression in a recent Instagram post, months after an emotional video went viral. His family and team have since reassured fans about his wellbeing and clarified earlier misunderstandings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/keira-knightley-on-being-unaware-of-rowling-boycott-while-joining-potter-audiobook-2802092-2025-10-13",
      "headline": "Keira Knightley on being unaware of Rowling boycott while joining Potter audiobook Actor Keira Knightley revealed that she was unaware of the fan boycott against 'Harry Potter' due to JK Rowling's transgender comments. The controversy deepens as Emma Watson defends the trans community while Rowling criticises her co-stars."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kantara-box-office-rs-600-crore-global-rishab-shetty-film-success-2802083-2025-10-13",
      "headline": "Kantara box office crosses Rs 600 crore globally in 11 days Rishab Shetty's 'Kantara: Chapter 1' crossed Rs 600 crore globally after a strong second weekend in theatres. The film's success revived the Karnataka box office ahead of Diwali releases."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-breaks-silence-on-arriving-late-on-sikandar-set-opens-up-on-broken-rib-2802062-2025-10-13",
      "headline": "Salman Khan breaks silence on arriving late on Sikandar set, opens up on broken rib Actor Salman Khan responded to AR Murugadoss's allegations of late arrivals on 'Sikandar' set. The actor defended his commitment and highlighted production challenges faced during the shoot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/sarah-paulson-breaks-down-outside-diane-keaton-home-after-her-death-2802046-2025-10-13",
      "headline": "Emotional Sarah Paulson breaks down outside Diane Keaton's home after her death Diane Keaton's close friend and actor Sarah Paulson was seen emotional outside her home, paying tribute to the beloved star amidst requests for family privacy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-sneha-epic-birthday-dinner-pics-that-scream-luxury-2802043-2025-10-13",
      "headline": "Allu Arjun's wife Sneha shares epic birthday dinner pics that scream luxury Sneha Reddy posted intimate birthday dinner photos with Allu Arjun. The couple's monochrome looks and candid moments attract attention."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-ssmb29-shoot-delhi-mahesh-babu-ss-rajamouli-2802033-2025-10-13",
      "headline": "Priyanka Chopra falls for Delhi's magic ahead of SSMB 29 shoot in city Priyanka Chopra has returned to Delhi, sharing glimpses of her busy schedule as she shoots for the highly anticipated film 'SSMB 29' with SS Rajamouli and Mahesh Babu. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kajol-twinkle-khanna-two-much-prime-video-too-much-noise-2801840-2025-10-13",
      "headline": "All stars, no spark: Kajol, Twinkle's Two Much is too much noise Kajol and Twinkle Khanna's celebrity chat show 'Two Much' promised laughs, gasps, and celebrity revelations. Three episodes in, here's why we think the show is just too much noise and no real substance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/diane-keaton-bond-justin-bieber-becomes-fans-favourite-memory-ghost-song-2802030-2025-10-13",
      "headline": "Diane Keaton's bond with Justin Bieber becomes fans' favourite memory Diane Keaton, the legendary actor known for iconic roles, is also known for her heartwarming friendship with pop star Justin Bieber. Their unique bond, highlighted by her role in Bieber's music video 'Ghost', has touched fans worldwide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/marvel-wonder-man-trailer-yahya-abdul-mateen-hollywood-satire-2802028-2025-10-13",
      "headline": "Wonder Man trailer: Yahya Abdul-Mateen II takes centre stage in Marvel's satire Marvel Studios has unveiled the trailer for 'Wonder Man', a new series starring Yahya Abdul-Mateen II that blends superhero themes with sharp Hollywood satire. The show explores identity and fame through the journey of a struggling actor turned reluctant hero, offering a fresh take distinct from the original comics."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/irctc-scam-court-orders-framing-of-cheating-charges-against-lalu-yadav-wife-rabri-and-son-tejashwi-2802136-2025-10-13",
      "headline": "Lalu Yadav, Rabri, Tejashwi to face trial in IRCTC scam in big court setbackLalu Yadav has been accused of criminal misconduct and conspiracy in manipulating tenders and land deals in the IRCTC scam, while Rabri Devi and Tejashwi face charges of cheating and conspiracy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/karur-stampede-has-shaken-national-conscience-says-supreme-court-as-it-transfers-probe-to-cbi-2802142-2025-10-13",
      "headline": "Karur stampede: Supreme Court orders CBI probe, blasts High Court over SIT orderThe Supreme Court transferred the Karur stampede case to the CBI, citing serious ramifications and fundamental rights concerns. A three-member supervisory committee, led by ex-judge Ajay Rastogi, will monitor the probe. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/hamas-hands-over-first-seven-hostages-to-red-cross-as-part-of-gaza-ceasefire-plan-news-agency-ap-2802138-2025-10-13",
      "headline": "First hostages return home after 2 years in Hamas captivity, cheers in Tel Aviv  Live UpdatesEitan Mor, Gali and Ziv Berman, Matan Angrist, Omri Miran, Guy Gilboa Dalal, and Alon Ahel were the first ones to be handed over to the Red Cross as part of the Gaza ceasefire plan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/story/ambience-dlf-promenade-and-emporio-malls-may-shut-due-to-unprecedented-water-crisis-in-vasant-kunj-2801999-2025-10-12",
      "headline": "These 3 top Delhi malls may shut down in coming daysThree of South Delhi's most prominent malls, DLF Promenade, DLF Emporio, and Ambience Mall in Vasant Kunj, are on the brink of closure due to a severe water crisis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/travel/story/women-travel-revolution-india-new-report-2802020-2025-10-13",
      "headline": "She plans, she books, she travelsA new report by Booking.com reveals that women are increasingly taking the lead in travel planning across Indian households."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/lalu-yadav-irctc-scam-delhi-court-frame-charges-tejashwi-rabri-devi-bihar-elections-2802160-2025-10-13",
      "headline": "You abused your position: What court said while charging Lalu Prasad in IRCTC scamA Delhi court has framed corruption, cheating, and conspiracy charges against Lalu Yadav, Rabri Devi, and Tejashwi Yadav, after the CBI accused the family of manipulating IRCTC tenders and illegal land transfers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/gaza-peace-summit-live-deal-signing-hostage-release-israel-hamas-palestine-egypt-donald-trump-netanyahu-war-2802032-2025-10-13",
      "headline": "Live: Hamas hands over 7 hostages to Red Cross, Trump watches live streamHamas is releasing the first group of remaining hostages held captive in Gaza. The International Committee of the Red Cross (ICRC) said on Monday that it had begun a multi-phase operation for the release of hostages in Gaza and Palestinian prisoners held by Israel, as part of a key prisoner exchange under the breakthrough ceasefire following two years of war. Palestinians are awaiting the release of hundreds of prisoners held by Israel. Stay tuned to India Today for the latest updates as this pivotal day for the Middle East unfolds."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/cough-syrup-deaths-ed-conducts-raids-at-7-chennai-sites-tied-to-coldrif-maker-drug-control-officials-2802076-2025-10-13",
      "headline": "ED raids 7 Chennai sites linked to Coldrif maker, drug control officialsThe ED raided seven Chennai sites linked to Sreesan Pharma and Tamil Nadu drug control officials over the Coldrif cough syrup deaths that killed 22 children in Madhya Pradesh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/ishit-bhatt-kbc-17-controversy-parenting-manners-social-media-debate-2802057-2025-10-13",
      "headline": "Video of young KBC contestant's behaviour goes viral, users question parentingYoung Ishit Bhatt's conduct on KBC 17 sparked strong reactions online. Many viewers criticised his overconfidence and questioned parental guidance, while others called for restraint and balanced judgement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-2nd-test-day-4-live-score-shubman-gill-bumrah-jadeja-kuldeep-2802061-2025-10-13",
      "headline": "Day 4 Live: West Indies fight back in Delhi, frustrate India at LunchIndia (IND) vs West Indies (WI), 2nd Test Day 4 Live Score Updates: West Indies are batting well and have nearly wiped off the deficit after being followed-on. Have India made a huge mistake and given the visitors the ideal conditions to bat on?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-halts-india-pakistan-war-tariffs-brokers-israel-hamas-ceasefire-glbs-2802029-2025-10-13",
      "headline": "I'm good at solving wars: Denied Nobel, Trump now eyes Afghan-Pak conflictDonald Trump dismissed claims he sought a Nobel Prize, and again claimed credit for averting war between India and Pakistan through tariffs. He set off for Israel and Egypt to celebrate the US-brokered ceasefire and hostage deal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/tcs-ceo-says-no-new-h-1b-hires-planned-company-to-focus-on-local-us-workforce-2802151-2025-10-13",
      "headline": "TCS CEO says no new H-1B hires planned, company to focus on local US workforceTata Consultancy Services (TCS) is taking a clear stance on its US hiring strategy, with CEO K Krithivasan confirming that the company will not bring in new H-1B hires this financial year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/google-maps-science-einstein-theory-of-relativity-satellites-2801895-2025-10-13",
      "headline": "How Einstein is the reason your Google Maps knows where you areGlobal Positioning System (GPS) satellites continuously beam down ultra-precise timestamps, each message essentially saying, \"It was 12:00:00.000001 when I sent this.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/abhishek-bachchan-wins-best-actor-award-70th-filmfare-awards-i-want-to-talk-2802133-2025-10-13",
      "headline": "Abhishek dedicates Best Actor Award to Aishwarya, Aaradhya in emotional speechAbhishek Bachchan won his first Best Actor in a Leading Role (Male) award at the 70th Filmfare Awards for his performance in 'I Want To Talk.' The actor delivered an emotional speech, thanking his wife Aishwarya and daughter Aaradhya, highlighting their support and sacrifices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israeli-man-roei-shalev-girlfriend-mapal-adam-shot-dead-in-hamas-attack-nova-music-festival-dies-by-suicide-2802031-2025-10-13",
      "headline": "Israeli man who saw his girlfriend killed by Hamas sets himself on fire, diesAt least 378 people, including 344 civilians were killed on October 7, 2023, when Hamas-led Palestinian militants crossed from Gaza into Israel and attacked the Nova open-air music festival and nearby communities. This unprecedented attack prompted Israel to wage its ongoing war against Hamas in Gaza."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/indian-woman-claims-her-gold-chain-was-snatched-in-chicago-viral-video-sparks-concerns-2802113-2025-10-13",
      "headline": "Indian woman claims her gold chain was snatched in Chicago, video sparks concernsAn Indian woman claimed that her gold chain was snatched in broad daylight in downtown Chicago."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/katy-perry-justin-trudeau-seen-kissing-on-yacht-confirm-dating-rumours-2801831-2025-10-12",
      "headline": "Katy Perry, Justin Trudeau seen kissing on yacht amid dating rumoursPopstar Katy Perry and former Canadian Prime Minister Justin Trudeau were seen kissing and cuddling on a yacht in California. These new viral pictures, which seemingly confirmed their dating rumours, came months after their first public outing in Montreal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/priyanka-gandhi-demands-probe-into-kerala-techies-alleged-rss-sexual-abuse-suicide-2802012-2025-10-12",
      "headline": "Priyanka Gandhi seeks probe after Kerala techie's suicide due to 'RSS sexual abuse'Congress leader Priyanka Gandhi Vadra has demanded a full investigation after Kerala IT professional Anandu Aji was found dead, leaving a final social media post alleging repeated sexual abuse by multiple RSS members."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/kerala/story/suresh-gopi-resignation-c-sadanandan-master-bjp-kerala-politics-kerala-minister-income-drop-2801896-2025-10-12",
      "headline": "Union Minister Suresh Gopi offers to resign, cites drop in incomeUnion Minister Suresh Gopi expressed his wish to resign from his post, citing a decline in income and recommending BJP leader C Sadanandan Master as his replacement."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/toddler-raped-found-dead-tripura-accused-lured-her-pretext-of-outing-2802073-2025-10-13",
      "headline": "Man takes 14-month-old Tripura girl on outing; rapes and buries her in fieldThe alleged rape took place on Saturday, following which she was \"murdered and buried in a paddy field in the area\", said Officer-in-Charge of Panisagar police station, Sumanta Bhattacharjee."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/mount-everest-visible-from-bihar-astronaut-shows-how-himalayas-look-from-space-2801850-2025-10-12",
      "headline": "Mount Everest visible from Bihar: Astronaut captures it from spaceThis awe-inspiring perspective comes just as a separate video showing Mount Everest visible from Bihar captured attention across social media, igniting fresh fascination with the world's tallest peak."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/study-abroad/story/harvard-flags-10-college-degrees-losing-their-market-value-2802145-2025-10-13",
      "headline": "10 college degrees that no longer pay off, says Harvard reportHarvard economists highlight that the value of some traditional degrees, like computer science, engineering, and business, declines over time due to fast-changing job skills. Continuous upskilling is essential, as not all degrees guarantee long-term career returns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/prashant-kishor-raghopur-seat-contest-election-poll-debut-jan-suraaj-candidate-list-rjd-tejashwi-yadav-2802060-2025-10-13",
      "headline": "PK vs Tejashwi Yadav in Bihar polls? Jan Suraaj to end suspense todayThe Jan Suraaj Party will unveil its second Bihar Assembly candidate list today at 2 pm, ending speculation over Prashant Kishor's poll debut from Tejashwi Yadav's home turf Raghopur."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/wolf-attacks-injure-five-bahraich-villages-forest-teams-search-2802051-2025-10-13",
      "headline": "Fear stalks Bahraich again: Wolves maul 5 villagers, forest teams launch huntSince September 9, six people, comprising four children and an elderly couple, have died, and 30 others were injured in wolf attacks in Bahraich. Chief Minister Yogi Adityanath has ordered a high-level rescue and containment operation, allowing lethal action only if capture attempts failed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tara-sutaria-veer-pahariya-red-carpet-debut-manish-malhotra-diwali-bash-2802161-2025-10-13",
      "headline": "Tara Sutaria, Veer Pahariya's hand-in-hand entry wins hearts at Manish Malhotra's bashActors Tara Sutaria and Veer Pahariya made their first red carpet appearance together at Manish Malhotra's Diwali bash. The two were clicked posing hand-in-hand for the paparazzi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-admits-it-was-his-misunderstanding-that-led-to-issues-with-arijit-singh-2802166-2025-10-13",
      "headline": "Salman Khan admits it was his misunderstanding that led to issues with ArijitSalman Khan addressed his rumoured feud with Arijit Singh on 'Bigg Boss 19'. The actor clarified that the misunderstanding was on his side, not Arijit's. Both confirmed continued collaboration in recent and upcoming films."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harmanpreet-kaur-fans-slammed-india-vs-australia-womens-world-cup-poor-captaincy-2802143-2025-10-13",
      "headline": "Harmanpreet Kaur slammed by fans after India's record loss to Australia: Time to go Harmanpreet Kaur is facing severe backlash after India's record World Cup defeat to Australia. Fans questioned her captaincy and poor batting form, demanding leadership changes as India's campaign continues to lose direction."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/womens-world-cup-india-vs-australia-alyssa-healy-press-conference-2802098-2025-10-13",
      "headline": "Alyssa Healy admits Smriti-Pratika had Australia scared in Vizag Women's World Cup, India vs Australia, Alyssa Healy press conference: Australia captain has admitted that she was hanging on for her dear life when India were piling on runs in Vizag. Healy said that sometimes as a captain you only hope that somehow things will get under control."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/womens-world-cup-india-vs-australia-amol-mazumdar-press-conference-2802070-2025-10-13",
      "headline": "India working on batting issues, will fix dot ball problem: Amol Mazumdar Women's World Cup 2025: The Indian team is trying to fix is dot ball percentage issues, stressed head coach Amol Mazumdar after back to back defeats in the tournament. Mazumdar said that there would be big discussions about it before India's next match against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-match-analysis-2802053-2025-10-13",
      "headline": "IND vs AUS: How India blunted out even before Australia clash Women's World Cup, IND vs AUS: India were tactically off the mark and poorly planned, resulting in a three-wicket loss to Australia. With plenty to reflect on, they now have thinking to do ahead of their clash against England on October 19 in Indore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-2nd-test-day-4-live-score-shubman-gill-bumrah-jadeja-kuldeep-2802061-2025-10-13",
      "headline": "Day 4 Live: West Indies fight back in Delhi, frustrate India at Lunch India (IND) vs West Indies (WI), 2nd Test Day 4 Live Score Updates: West Indies are batting well and have nearly wiped off the deficit after being followed-on. Have India made a huge mistake and given the visitors the ideal conditions to bat on?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-alyssa-healy-2802039-2025-10-13",
      "headline": "How Alyssa Healy pulled off an all-time classic for Australia Alyssa Healy unfurled a sensational 142, a knock marked by both genius and grit, as she capitalised on India's inexperienced bowling attack to help Australia pull off an all-time classic at a packed Vizag Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/alyssa-healy-century-australia-thrilling-womens-world-cup-win-press-conference-2802015-2025-10-13",
      "headline": "Alyssa Healy on breaking free from rough patch: I was frustrated, out of rhythm Women's World Cup: Alyssa Healy roared back to form with a stunning 142 off 107 balls, guiding Australia to a thrilling three-wicket win over India in the Women's World Cup clash at Visakhapatnam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-india-need-to-finish-better-amol-muzumdar-on-loss-to-australia-2802014-2025-10-13",
      "headline": "After batting collapse vs AUS, India coach says team has settled, flexible order After the loss to Australia, India coach Amol Muzumdar said that his side's batting order is settled but can be flexible if needed. India failed to capitalise on their momentum and lost to the Aussies in the end. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-nahida-akter-backs-nigar-sultana-ahead-of-south-africa-clash-2802001-2025-10-13",
      "headline": "Nahida Akter backs Nigar Sultana amid batting woes ahead of South Africa clash Bangladesh spinner Nahida Akter has defended captain Nigar Sultana amid poor batting form in the Women's World Cup 2025. The team remains hopeful of a strong comeback in their next match against South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-2nd-test-day-4-live-score-shubman-gill-bumrah-jadeja-kuldeep-2802061-2025-10-13",
      "headline": "Day 4 Live: West Indies fight back in Delhi, frustrate India at Lunch India (IND) vs West Indies (WI), 2nd Test Day 4 Live Score Updates: West Indies are batting well and have nearly wiped off the deficit after being followed-on. Have India made a huge mistake and given the visitors the ideal conditions to bat on?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-alyssa-healy-2802039-2025-10-13",
      "headline": "How Alyssa Healy pulled off an all-time classic for Australia Alyssa Healy unfurled a sensational 142, a knock marked by both genius and grit, as she capitalised on India's inexperienced bowling attack to help Australia pull off an all-time classic at a packed Vizag Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/alyssa-healy-century-australia-thrilling-womens-world-cup-win-press-conference-2802015-2025-10-13",
      "headline": "Alyssa Healy on breaking free from rough patch: I was frustrated, out of rhythm Women's World Cup: Alyssa Healy roared back to form with a stunning 142 off 107 balls, guiding Australia to a thrilling three-wicket win over India in the Women's World Cup clash at Visakhapatnam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-india-need-to-finish-better-amol-muzumdar-on-loss-to-australia-2802014-2025-10-13",
      "headline": "After batting collapse vs AUS, India coach says team has settled, flexible order After the loss to Australia, India coach Amol Muzumdar said that his side's batting order is settled but can be flexible if needed. India failed to capitalise on their momentum and lost to the Aussies in the end. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-nahida-akter-backs-nigar-sultana-ahead-of-south-africa-clash-2802001-2025-10-13",
      "headline": "Nahida Akter backs Nigar Sultana amid batting woes ahead of South Africa clash Bangladesh spinner Nahida Akter has defended captain Nigar Sultana amid poor batting form in the Women's World Cup 2025. The team remains hopeful of a strong comeback in their next match against South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-w-vs-aus-w-amol-muzumdar-eyes-bowling-depth-dot-ball-concerns-2802009-2025-10-12",
      "headline": "India head coach eyes bowling depth, addresses dot ball concerns post AUS lossIndia women's cricket team head coach Amol Muzumdar has said that the team will look to add bowling depth heading ahead in the tournament after their 3-wicket defeat against Australia in the Women's World Cup 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-2025-harmanpreet-kaur-on-india-batting-collapse-sixth-bowler-issue-vs-australia-2802003-2025-10-12",
      "headline": "Batting woes, 6th bowler issue: Harmanpreet Kaur says India has much to fixIndia captain Harmanpreet Kaur said that the late batting order collapse let the team down in their agonising loss to Australia in Vizag on Sunday, October 12. Australia secured a record win after chasing down 331 in 49 overs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/alyssa-healy-142-powers-australia-sree-charani-chase-womens-world-cup-india-2802002-2025-10-12",
      "headline": "How Alyssa Healy negated Sree Charani threat to down IndiaWomen's World Cup, IND vs AUS: Alyssa Healy scored a match-winning 142 to lead Australia to a record run-chase of 331 against India, carefully targeting bowlers around key threat Sree Charani."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-womens-world-cup-alyssa-healy-smriti-mandhana-report-2801984-2025-10-12",
      "headline": "Alyssa Healy storm hits Vizag, sinks India in record chaseCaptain Alyssa Healy smashed a jaw-dropping 142 as Australia pulled off the highest-ever chase in women's ODI history, hunting down 331 against hosts India in front of a roaring crowd at the ACA-VDCA Stadium on a Super Sunday to remember."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/florian-wirtz-premier-league-adaptation-liverpool-record-signing-2801909-2025-10-12",
      "headline": "Premier League: Florian Wirtz's slow Liverpool start defended by NagelsmannGermany coach Julian Nagelsmann called for patience with Liverpool's Florian Wirtz as he struggles to adapt to the Premier League. The German midfielder is yet to record a goal or assist in his first seven league matches after arriving from Bayer Leverkusen for a club-record fee."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-ready-for-tough-spin-challenge-against-bangladesh-tumi-sekhukhune-2801943-2025-10-12",
      "headline": "South Africa ready for tough spin challenge against Bangladesh: Tumi SekhukhuneSouth Africa seamer Temi Sekhukhune has said that they're wary of the Bangladesh spin challenge ahead of their clash in the Women's World Cup 2025 in Visakhapatnam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/womens-world-cup-sa-vs-ban-tumi-sekhukhune-full-pre-match-press-conference-2801962-2025-10-12",
      "headline": "Not dwelling too much on win over India, every game important for us: SekhukhuneSouth Africa seamer Tumi Sekhukhune said that they will not dwell too much on their thrilling victory against India and treat every game equally ahead of their fixture against Bangladesh in Visakhapatnam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/aiff-adopts-supreme-court-approved-constitution-excluding-controversial-clauses-2801959-2025-10-12",
      "headline": "AIFF adopts new constitution, leaves out two clauses for SC clarification: ReportThe All India Football Federation has adopted the Supreme Court-approved constitution, leaving two contentious clauses pending. This move comes amid a FIFA deadline and ahead of the upcoming AIFF elections, creating uncertainty around governance reforms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/florian-wirtz-premier-league-adaptation-liverpool-record-signing-2801909-2025-10-12",
      "headline": "Premier League: Florian Wirtz's slow Liverpool start defended by NagelsmannGermany coach Julian Nagelsmann called for patience with Liverpool's Florian Wirtz as he struggles to adapt to the Premier League. The German midfielder is yet to record a goal or assist in his first seven league matches after arriving from Bayer Leverkusen for a club-record fee."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-ready-for-tough-spin-challenge-against-bangladesh-tumi-sekhukhune-2801943-2025-10-12",
      "headline": "South Africa ready for tough spin challenge against Bangladesh: Tumi SekhukhuneSouth Africa seamer Temi Sekhukhune has said that they're wary of the Bangladesh spin challenge ahead of their clash in the Women's World Cup 2025 in Visakhapatnam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/womens-world-cup-sa-vs-ban-tumi-sekhukhune-full-pre-match-press-conference-2801962-2025-10-12",
      "headline": "Not dwelling too much on win over India, every game important for us: SekhukhuneSouth Africa seamer Tumi Sekhukhune said that they will not dwell too much on their thrilling victory against India and treat every game equally ahead of their fixture against Bangladesh in Visakhapatnam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/aiff-adopts-supreme-court-approved-constitution-excluding-controversial-clauses-2801959-2025-10-12",
      "headline": "AIFF adopts new constitution, leaves out two clauses for SC clarification: ReportThe All India Football Federation has adopted the Supreme Court-approved constitution, leaving two contentious clauses pending. This move comes amid a FIFA deadline and ahead of the upcoming AIFF elections, creating uncertainty around governance reforms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-west-indies-delhi-test-kuldeep-yadav-ryan-ten-doeschate-2801953-2025-10-12",
      "headline": "Kuldeep Yadav's mystery spinner element makes him dangerous: Ryan ten DoeschateIndia assistant coach Ryan ten Doeschate has said that the mystery spinner element makes Kuldeep Yadav a dangerous bowler after his fine performance in the Delhi Test. Kuldeep picked up five wickets against West Indies on Sunday, October 12."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-wi-india-follow-on-west-indies-delhi-test-2025-ryan-ten-doeschate-2801942-2025-10-12",
      "headline": "IND vs WI: Did India plan to bat again in Delhi Test? Ten Doeschate respondsIndia's assistant coach Ryan ten Doeschate said that the hosts thought about batting again before enforcing the follow-on on West Indies during the Delhi Test. India bowled out West Indies for 248 in the first innings but struggled to get wickets in the second one. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shaun-pollock-mistakes-shan-masood-india-captain-lahore-test-pak-vs-sa-2801911-2025-10-12",
      "headline": "Shan Masood, captain of India: Shaun Pollock makes big blunder on commentaryDuring live coverage of the opening Test between Pakistan and South Africa at Lahore's Gaddafi Stadium, former South Africa all-rounder Shaun Pollock mistakenly described Shan Masood as the 'captain of India.' The clip of the incident has been going viral on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-women-record-330-vs-australia-2025-womens-world-cup-2801919-2025-10-12",
      "headline": "IND vs AUS: Mandhana, Pratika power India to their highest total in Women's World CupSmriti Mandhana and Pratika Rawal's opening stand helped India record their highest-ever total in Women's World Cups in the clash against Australia. The hosts, however, suffered a late collapse which allowed the Aussies to comeback into the contest. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-wi-jayden-seales-fined-for-hitting-yashasvi-jaiswal-with-ball-in-delhi-2801898-2025-10-12",
      "headline": "Jayden Seales fined for 'dangerous' throw at Yashasvi Jaiswal in DelhiWest Indies pacer Jayden Seales has been sanctioned with a 25% match fee deduction and awarded a demerit point by the ICC after his throw struck India's Yashasvi Jaiswal on the pad in the second Test in Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/valentin-vacherot-wins-shanghai-masters-beating-cousin-arthur-rinderknech-2801902-2025-10-12",
      "headline": "Grandpa and Grandma would be proud: Vacherot in tears after beating cousin RinderknechValentin Vacherot claimed his maiden ATP Tour title at the 2025 Shanghai Masters, defeating cousin Arthur Rinderknech. His historic win as the lowest-ranked Masters 1000 champion highlights a remarkable journey filled with emotion and resilience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ramiz-raja-controversial-comment-babar-azam-pakistan-south-africa-test-lahore-2801891-2025-10-12",
      "headline": "Ramiz Raja's bizarre comment on Babar Azam in Lahore Test goes viralPAK vs SA, 1st Test: Ramiz Raja was heard making a bizarre comment when Babar Azam sent one LBW decision upstairs on Day 1 of the opening Test against South Africa at Gaddafi Stadium."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}