{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/muhurat-trading-guide-timings-history-what-to-expect-diwali-2024-2624463-2024-10-28",
      "headline": "Muhurat trading guide: Timings, history, and what to expect on Diwali 2024Muhurat trading is a unique session conducted by Indian stock exchanges on Diwali, rooted in the belief that this 'auspicious hour' is a time to attract prosperity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-nifty-jump-on-banking-boost-end-five-day-losing-streak-icici-bank-2624403-2024-10-28",
      "headline": "Sensex, Nifty jump on banking boost, end 5-day losing streakThe S&P BSE Sensex added 602.75 points to close at 80,005.04, while the NSE Nifty50 gained 158.35 points to close at 24,339.15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ian-bremmer-explains-why-china-economic-crisis-is-reshaping-its-foreign-policy-exclusive-2624350-2024-10-28",
      "headline": "Economic crisis forcing China to adjust foreign policy: Ian BremmerIan Bremmer explained why China is showing less willingness to engage in confrontational behaviour and is actively seeking to reduce tensions with key partners. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/afcons-infrastructure-ipo-day-2-subscription-status-gmp-subscribe-or-skip-review-2624275-2024-10-28",
      "headline": "Afcons Infrastructure IPO: Day 2 subscription status, GMP. Subscribe or skip?The Afcons Infrastructure IPO comprises a fresh issue of 2.7 crore shares valued at Rs 1,250 crore and an offer for sale (OFS) of 9.03 crore shares worth Rs 4,180 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-rises-900-points-nifty-gains-update-what-is-behind-stock-market-rally-icici-bank-shares-2624243-2024-10-28",
      "headline": "Sensex rises 900 points. What's behind the stock market rally?Stock market update: The BSE Sensex climbed 827.37 points to 80,229.53, adding over Rs 3 lakh crore in market capitalisation. On the other hand, the Nifty50 rose 225.30 points to 24,406.10."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/waaree-energies-share-price-falls-3-percent-after-strong-stock-market-debut-2624230-2024-10-28",
      "headline": "Waaree Energies share price falls 3% after bumper debut. Here's whyWaaree Energies listing: Shares of Waaree Energies opened at Rs 2,550, at a premium of 69.66% over its issue price of Rs 1,503 on the Bombay Stock Exchange (BSE)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indigo-share-price-declines-q2fy25-results-interglobe-aviation-buy-hold-sell-brokerage-recommendations-2624221-2024-10-28",
      "headline": "IndiGo share price tumbles over 10% after Q2 results. Buy, hold or sell? IndiGo share price: The shares crashed as much as 13% on Monday, reaching a low of Rs 3,778.50. At 10:54 am, shares of the company were trading 7.66% lower to Rs 4,030.35."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/waaree-energies-listing-strong-debut-share-price-rs-2550-bse-bombay-stock-exchange-2624206-2024-10-28",
      "headline": "Waaree Energies shares make strong market debut with 70% premiumWaaree Energies share price: Shares of Waaree Energies opened at Rs 2,550, a premium of 69.66% over its issue price of Rs 1,503 on the Bombay Stock Exchange (BSE)"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/idfc-first-bank-shares-fell-10-percent-in-early-trade-today-reason-fall-in-q2-profit-2624204-2024-10-28",
      "headline": "Explained: Why IDFC First Bank shares fell 10% in early trade todayThe bank's stock has fallen by 25% year-to-date in 2024, with a current market capitalisation of Rs 49,034 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-ril-shares-down-50-percent-on-trading-apps-bonus-issue-reliance-stock-2624192-2024-10-28",
      "headline": "Reliance share price showing 50% fall on trading apps today. Here's whyRIL share price: Reliance shares opened at Rs 1,338, which appeared to be 49.61% lower than Friday's closing price of Rs 2,655.45 on the Bombay Stock Exchange (BSE). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-bell-sensex-nifty-open-in-green-led-by-a-rally-in-financial-and-bank-stocks-2624179-2024-10-28",
      "headline": "Sensex, Nifty open in green led by a rally in financial and bank stocksThe S&P BSE Sensex was up 902.40 points to 80,304.76, whiile the Nifty50 was up 251.35 points to 24,432.15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jiohotstar-website-delhi-developer-sells-domain-uae-jainam-jeevika-dubai-kids-2623668-2024-10-26",
      "headline": "Twist in JioHotstar drama, Dubai siblings claim they bought domain from developerThe JioHotstar.com controversy has taken a new turn as the Delhi developer, who bought the domain much to the annoyance of Reliance Industries, seems to have sold it to two Dubai-based children -- Jainam and Jivika."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/itr-filing-deadline-corporate-taxpayers-extended-november-15-2623581-2024-10-26",
      "headline": "ITR filing deadline for corporate taxpayers extended till November 15ITR filing deadline: The extension applies to taxpayers covered under sub-Section (1) of Section 139 of the Income-tax Act, 1961."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/waaree-energies-ipo-latest-gmp-dips-stock-market-debut-listing-expectations-investors-2623572-2024-10-26",
      "headline": "Waaree Energies IPO: GMP drops before listing; should investors worry?Waaree Energies listing expectations: With the company set to debut on October 28, Waaree Energies' GMP currently stands around Rs 1,320, reflecting a potential listing premium of 88% over the IPO issue price."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/rs-220-crore-bank-fraud-case-ed-raids-pharma-company-sharon-bio-medicine-limited-2623480-2024-10-26",
      "headline": "ED raids in Mumbai, Haryana against pharma company in Rs 220-crore fraud caseDuring the search operations in Mumbai and Haryana's Yamunanagar, movable assets including bank funds, Demat accounts valued at Rs 14.53 crore were seized or frozen."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/afcons-infrastructure-ipo-day-1-check-latest-subscription-gmp-expected-listing-gains-2623281-2024-10-25",
      "headline": "Afcons Infrastructure IPO Day 1: Check latest subscription, GMP Afcons Infrastructure's IPO aims to raise Rs 5,430 crore and consists of a fresh issue of 2.7 crore shares, totalling Rs 1,250 crore, and an offer for sale of 9.03 crore shares, amounting to Rs 4,180 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-downturn-sensex-nifty-dalal-street-losing-streak-foreign-investor-exodus-dull-q2-earnings-2623206-2024-10-25",
      "headline": "Sensex, Nifty continue losing streak amid ongoing FII exodus, dull Q2 earnings At the closing bell, the Sensex was down 662.87 points at 79,402.29, while the NSE Nifty50 settled 189.55 points lower at 24,209.85. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/waaree-energies-ipo-listing-view-will-it-double-your-money-gmp-here-what-experts-say-2623194-2024-10-25",
      "headline": "Waaree Energies IPO: Will it double your investment? Here's what experts sayWaaree Energies IPO attracted significant interest from investors and was subscribed 79.44 times by the end of the bidding process on October 23, 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-dips-800-points-investors-traders-volatile-market-strategy-2623124-2024-10-25",
      "headline": "Sensex falls 800 points: Should investors buy the dip or hold back?Stock market bloodbath: This year's pre-Diwali period has been especially challenging for benchmark indices, with the Sensex and Nifty heading toward their steepest October decline since the Covid-driven crash in 2020."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-rs-10000-crore-will-tito-shantanu-naidu-who-gets-what-2623105-2024-10-25",
      "headline": "Ratan Tata's estate worth Rs 10,000 crore: Who gets what in his will Ratan Tata died on October 9 in Mumbai and left a Rs 10,000 crore will, which includes provisions for his near and dear ones. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/digital-arrest-racket-india-today-sting-operation-digital-scam-cybercrime-2624637-2024-10-28",
      "headline": "Fake cops, warrants, Rs 10 lakh surety: India Today busts digital arrest racketIndia Today's special investigation team conducted a sting operation to uncover a racket of digital arrest scammers.  The fraudsters came in touch with our reporter, claiming that a parcel in his name was found with 400 grams of drugs."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/israel-parliament-law-unrwa-banned-gaza-war-ceasefire-strikes-lebanon-middle-east-tensions-2624738-2024-10-29",
      "headline": "Israel bans UN's Palestinian aid agency amid Gaza war, truce talks resumeThe Knesset members who drafted the law cited the involvement of a handful of thousands of UNRWA staffers in the October 7, 2023, attack on southern Israel and a few staffers' membership in Hamas and other armed groups."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/kerala/story/kerala-news-kasaragod-temple-festivals-fireworks-accident-injured-toll-2624744-2024-10-29",
      "headline": "Over 150 injured, 8 critical, in fireworks accident at Kerala temple festivalThe injured were shifted to several hospitals in Kasaragod, Kannur, and Mangaluru, where they are receiving treatment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/rodri-becomes-first-manchester-city-player-to-win-ballon-dor-2624681-2024-10-29",
      "headline": "Rodri becomes first Manchester City player to win Ballon d'OrSpain's Rodri became the first Manchester City footballer to win the Ballon d'Or on Monday, October 28. In a glitzy ceremony in Paris, Rodri beat the Real Madrid duo of Vinicius Jr. and Jude Bellingham to clinch his maiden award. The Premier League and Euro 2024 champion became the first midfielder since Luka Modric to win the Ballon d'Or title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/beauty/story/can-saffron-priced-at-rs-3-lakh-per-kg-solve-all-your-skincare-problems-2624346-2024-10-29",
      "headline": "Can saffron priced at Rs 3 lakh per kg solve all your skincare problems?Saffron can work wonders for your skin, but it's also one of the world's most expensive spices. When it comes to skincare, are you in the mood to splurge or save?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/shaina-nc-maharashtra-assembly-polls-mumbadevi-mumbai-seats-shiv-sena-eknath-shinde-mahayuti-alliance-2624675-2024-10-28",
      "headline": "Shaina NC joins Shiv Sena after Eknath Shinde's party fields her on BJP ticketShaina NC was keen to contest from Worli in Mumbai, but the seat was ultimately given to Shiv Sena's Rajya Sabha MP and former Congress leader Milind Deora."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/ballon-dor-2024-vinicius-jr-on-finishing-second-behind-rodri-2624750-2024-10-29",
      "headline": "Vinicius Jr breaks silence after finishing second behind RodriBallon d'Or 2024: Real Madrid's Brazilian star Vinicius Jr took to social media to break his silence after finishing second in the prestigious award voting behind Spain and Manchester City midfielder Rodri.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/next-census-2025-expanded-data-collection-religion-sect-sources-2624608-2024-10-28",
      "headline": "Next census in 2025 with expanded data collection on religion, sect: SourcesThe nationwide census will begin in 2025 and end in 2026, said government sources. The census cycle will now occur in 2035, 2045, and 2055, departing from the traditional ten-year schedule. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/watch-athlete-slams-diljit-concert-organisers-for-damaging-jln-stadium-facilities-2624602-2024-10-28",
      "headline": "Delhi stadium a mess after Diljit concert, athlete shares video of damageIndia's middle-distance runner Beant Singh has slammed the organisers of the Diljit Dosanjh concert. Diljit's concert left the Jawaharlal Nehru Stadium in a terrible state as training facilities were vandalised by the crowd."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/elevating-your-career-with-iim-kozhikodes-advanced-operations-analytics-and-supply-chain-management-programme-2621116-2024-10-22",
      "headline": "Elevating Your Career with IIM Kozhikode's Advanced Operations Analytics and Supply Chain Management ProgrammeElevate your career with IIM Kozhikode's comprehensive programme, designed to equip professionals with the latest tools and strategies in operations management and data analytics. Gain hands-on experience through live sessions, capstone projects, and industry-relevant assignments, while accessing the prestigious IIMK Executive Alumni network. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/kerala/video/video-pinarayi-vijayan-unharmed-after-convoy-collides-in-thiruvananthapuram-2624597-2024-10-28",
      "headline": "Video: Cars in Pinarayi Vijayan's convoy collide after scooter makes sudden turnKerala Chief Minister Pinarayi Vijay is unharmed after the escort vehicle he was travelling in was involved in a collision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/vinicius-jr-real-madrid-boycott-ballon-dor-award-ceremony-2624698-2024-10-29",
      "headline": "Vinicius Jr, Real Madrid boycott Ballon d'Or ceremony after snubVinícius Jr., along with fellow Real Madrid nominees Jude Bellingham, Kylian Mbappé, Dani Carvajal, and club president Florentino Pérez, skipped the 2024 Ballon d'Or ceremony held in Paris on October 28."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/how-indias-map-has-evolved-over-2000-years-2624435-2024-10-28",
      "headline": "From ancient India to British rule: The 2000-year journey of the Indian mapFrom the expansive Mauryan Empire, which laid the brass tacks for a unified India, to the culturally rich Gupta Empire, maps reveal a vibrant history. The Indian maps from the time of the Mughal and British empires further illustrate the complexities of territorial evolution in the latter period."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/joe-biden-early-ballot-cast-kamala-harris-democrats-delaware-reelection-bid-dropped-2624742-2024-10-29",
      "headline": "Joe Biden, who dropped out of race in July, casts early ballot for Kamala HarrisUS President Joe Biden, who dropped his reelection bid in July after massive concerns about his health, cast an early ballot in his home state of Delaware."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/canada-news/story/canada-vancouver-food-bank-turn-away-first-year-international-students-indians-high-cost-of-living-immigrants-trudeau-2624507-2024-10-28",
      "headline": "On the brink, Canada food bank to turn away international studentsA Canadian food bank is turning away from first year international students, who come to it in high numbers amid high food prices and rising unemployment. The Greater Vancouver Food Bank has been slammed for its move to deny free food to new international students."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/vijay-makes-his-opening-political-move-in-tamil-nadu-victor-or-disruptor-in-2026-opinion-2624497-2024-10-28",
      "headline": "Opinion: Vijay makes opening political move in Tamil Nadu. Victor or Disruptor in 2026?On Sunday in Vikravandi, 150 km south of Chennai, before a crowd that was around 3 lakh people according to estimates, Vijay's one-liners could well have been written for his several reel avatars."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/food/story/the-problem-in-your-plate-why-an-indian-home-cooked-meal-is-not-always-healthy-2623289-2024-10-28",
      "headline": "The Problem in Your Plate: Why an Indian home-cooked meal is not always healthyJust because food is homemade doesn't mean it's automatically healthy. Contrary to popular belief, home-cooked meals aren't always nutritious and can work against your health goals."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/swapna-patker-sanjay-raut-ex-aide-sunil-raut-vikhroli-mumbai-maharashtra-assembly-polls-2624735-2024-10-29",
      "headline": "Witness in ED case against Sanjay Raut faces his brother in Vikhroli poll contestSwapna Patker had accused his former aide and Shiv Sena (UBT) leader Sanjay Raut of threatening and abusing her after the latter was arrested in connection with the Patra Chawl redevelopment scam case in 2022."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ola-ceo-bhavish-aggarwal-comedian-kunal-kamra-electric-vehicles-service-centre-2624545-2024-10-29",
      "headline": "Kunal Kamra's 'ready to work at service centre' jibe at Ola CEO, has these demandsKunal Kamra and Ola's Bhavish Aggarwal earlier had a heated conversation on X when the former pointed out the piling up of Ola Electric scooters outside what appeared to be an Ola store."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/abhinav-arora-defamation-case-youtubers-anti-hindu-stress-mathura-court-2624696-2024-10-28",
      "headline": "Mother of child spiritual orator files case against 'anti-Hindu' YouTubersThe complaint was filed by Abhinav Arora's mother against the YouTubers, who uploaded videos which were \"maliciously designed\" to mock and defame Abhinav's religious beliefs, \"who is a follower of Sanatana Dharma\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/story-two-attacks-israels-aerial-bombing-irans-missile-hits-2624555-2024-10-28",
      "headline": "Story of two attacks: Israel's aerial bombing vs Iran's missile hitsSatellite images of Israel's first direct confrontation with Iran indicate that while the strikes were precise, Israel chose to avoid hitting high-value targets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/congress-candidates-announcement-list-maharashtra-jharkhand-assembly-polls-2624728-2024-10-29",
      "headline": "Congress replaces candidate for third time in Maharashtra, fields 2 in JharkhandThe Congress has announced four candidates in Maharashtra, including a replacement on Kolhapur North seat, and two in Jharkhand for the upcoming Assembly polls in both states next month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/ballot-boxes-burnt-washington-oregon-states-cops-arson-us-president-election-updates-2624739-2024-10-29",
      "headline": "Ballot boxes burnt in US's Washington and Oregon, cops suspect arsonThree ballot boxes were damaged in a separate fire in Oregon and some in Washington, and officials said the two blazes resembled a third fire at a Vancouver ballot box on October 8 that did not damage any ballots."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/c295-transport-aircraft-vadodra-facility-game-changer-india-explained-five-points-atmanirbhar-bharat-tata-airbus-2624262-2024-10-28",
      "headline": "Why C295 aircraft project is a game changer for India. Know in 5 pointsThe C295 facility in Gujarat is the first private factory from which planes, ready to take to the skies, will be rolled out. From enhancing India's defence capabilities, creating jobs and positioning India as an exporter, the Tata-Airbus C295 project is a game changer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-daughter-malti-marie-hindi-theek-hoon-nick-jonas-2624764-2024-10-29",
      "headline": "Priyanka Chopra's daughter Malti says 'theek hoon' in new videoPriyanka Chopra shared a cute video of her daughter Malti Marie conversing in Hindi with Nick Jonas. The video is now going viral on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/arjun-kapoor-finally-confirms-he-is-single-malaika-arora-breakup-2624747-2024-10-29",
      "headline": "Actor Arjun Kapoor finally addresses breakup rumours with Malaika AroraActor Arjun Kapoor finally opened up about his relationship status at a Diwali party, addressing rumours of a split with Malaika Arora."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/sobhita-dhulipala-joins-fiance-naga-chaitanya-and-family-at-anr-award-ceremony-2624623-2024-10-28",
      "headline": "Sobhita Dhulipala joins fiance Naga Chaitanya and family at ANR Award ceremonySobhita Dhulipala and Naga Chaitanya celebrated the 100th birth anniversary of his grandfather, Telugu cinema legend Akkineni Nageswara Rao, during which actor Chiranjeevi received the ANR Award."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/actor-shamita-shetty-slams-indigo-over-off-loaded-bags-airline-responds-2624609-2024-10-28",
      "headline": "Actor Shamita Shetty slams IndiGo over off-loaded bags, airline respondsShamita Shetty criticised Indigo Airlines on social media after her luggage was offloaded without communication. IndiGo responded, claiming they attempted to contact her."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/rodri-luis-suarez-spanish-players-to-win-ballon-dor-2024-2624762-2024-10-29",
      "headline": "Who was the last Spanish player to win Ballon d'Or before Rodri?Rodri is the first Spanish player to win the Ballon d'Or since 1960 when Barcelona's Luis Suarez - not to be confused with his Uruguayan namesake - won the award. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/ballon-dor-2024-vinicius-jr-on-finishing-second-behind-rodri-2624750-2024-10-29",
      "headline": "Vinicius Jr breaks silence after finishing second behind RodriBallon d'Or 2024: Real Madrid's Brazilian star Vinicius Jr took to social media to break his silence after finishing second in the prestigious award voting behind Spain and Manchester City midfielder Rodri.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/matthew-wade-international-retirement-australia-coach-pakistan-t20s-2624741-2024-10-29",
      "headline": "Matthew Wade retires from international cricket, joins Australia coaching staffAustralian wicketkeeper-batter Matthew Wade has announced his retirement from all forms of international cricket and will step into coaching from T20I series against Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/vinicius-jr-real-madrid-boycott-ballon-dor-award-ceremony-2624698-2024-10-29",
      "headline": "Vinicius Jr, Real Madrid boycott Ballon d'Or ceremony after snubVinícius Jr., along with fellow Real Madrid nominees Jude Bellingham, Kylian Mbappé, Dani Carvajal, and club president Florentino Pérez, skipped the 2024 Ballon d'Or ceremony held in Paris on October 28."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/rodri-becomes-first-manchester-city-player-to-win-ballon-dor-2624681-2024-10-29",
      "headline": "Rodri becomes first Manchester City player to win Ballon d'OrSpain's Rodri became the first Manchester City footballer to win the Ballon d'Or on Monday, October 28. In a glitzy ceremony in Paris, Rodri beat the Real Madrid duo of Vinicius Jr. and Jude Bellingham to clinch his maiden award. The Premier League and Euro 2024 champion became the first midfielder since Luka Modric to win the Ballon d'Or title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pickleball-revolution-world-ranking-tournament-india-basics-andre-agassi-2624676-2024-10-28",
      "headline": "Pickleball's rise hits India in with first world-ranking tournament Pickleball's popularity soared globally, captivating fans and players alike, including former tennis stars. With India embracing the sport, recent tournaments showcased its rapid growth and accessibility, proving that age is no barrier to enjoying this engaging game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ramandeep-looks-to-make-a-mark-with-india-my-role-model-is-andre-russell-2624666-2024-10-28",
      "headline": "Ramandeep looks to make a mark with India: My role model is Andre RussellKolkata Knight Riders' Ramandeep Singh is ready to shine for India in the tour of South Africa. Ramandeep, who sees Andre Russell as his role model said that he wanted to prove himself at the international level by taking whatever chances he gets.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/will-beat-australia-in-australia-pakistan-white-ball-captain-mohammad-rizwan-2624642-2024-10-28",
      "headline": "Will beat Australia in Australia: Rizwan drops tall claimNewly appointed Pakistan captain Mohammad Rizwan has backed Pakistan cricket team to win the white-ball series in Australia. Rizwan, who was announced as the captain on October 28 will be put to Test Down Under in November."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-manager-merry-go-round-erik-ten-hag-sacking-jose-mourinho-louis-van-gaal-2624631-2024-10-28",
      "headline": "Manchester United's manager merry-go-round: How the last few names faredSince Sir Alex Ferguson's retirement, Manchester United has struggled to find a manager capable of restoring their dominance. The revolving door of managers, most recently Erik ten Hag, underscores the club's ongoing battle with consistency and success."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-erik-ten-hag-potential-manager-replacement-xavi-ruben-amorim-2624605-2024-10-28",
      "headline": "Manchester United's potential Ten Hag replacement, ft. Xavi, Ruben AmorimManchester United's managerial search begins as Erik ten Hag exits, ending a challenging tenure. With Ruud van Nistelrooy as interim, top candidates like Xavi, Gareth Southgate, and Ruben Amorim have emerged, bringing fresh hope to Old Trafford."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/watch-athlete-slams-diljit-concert-organisers-for-damaging-jln-stadium-facilities-2624602-2024-10-28",
      "headline": "Delhi stadium a mess after Diljit concert, athlete shares video of damageIndia's middle-distance runner Beant Singh has slammed the organisers of the Diljit Dosanjh concert. Diljit's concert left the Jawaharlal Nehru Stadium in a terrible state as training facilities were vandalised by the crowd."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ramandeep-looks-to-make-a-mark-with-india-my-role-model-is-andre-russell-2624666-2024-10-28",
      "headline": "Ramandeep looks to make a mark with India: My role model is Andre RussellKolkata Knight Riders' Ramandeep Singh is ready to shine for India in the tour of South Africa. Ramandeep, who sees Andre Russell as his role model said that he wanted to prove himself at the international level by taking whatever chances he gets.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/will-beat-australia-in-australia-pakistan-white-ball-captain-mohammad-rizwan-2624642-2024-10-28",
      "headline": "Will beat Australia in Australia: Rizwan drops tall claimNewly appointed Pakistan captain Mohammad Rizwan has backed Pakistan cricket team to win the white-ball series in Australia. Rizwan, who was announced as the captain on October 28 will be put to Test Down Under in November."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-manager-merry-go-round-erik-ten-hag-sacking-jose-mourinho-louis-van-gaal-2624631-2024-10-28",
      "headline": "Manchester United's manager merry-go-round: How the last few names faredSince Sir Alex Ferguson's retirement, Manchester United has struggled to find a manager capable of restoring their dominance. The revolving door of managers, most recently Erik ten Hag, underscores the club's ongoing battle with consistency and success."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-erik-ten-hag-potential-manager-replacement-xavi-ruben-amorim-2624605-2024-10-28",
      "headline": "Manchester United's potential Ten Hag replacement, ft. Xavi, Ruben AmorimManchester United's managerial search begins as Erik ten Hag exits, ending a challenging tenure. With Ruud van Nistelrooy as interim, top candidates like Xavi, Gareth Southgate, and Ruben Amorim have emerged, bringing fresh hope to Old Trafford."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/watch-athlete-slams-diljit-concert-organisers-for-damaging-jln-stadium-facilities-2624602-2024-10-28",
      "headline": "Delhi stadium a mess after Diljit concert, athlete shares video of damageIndia's middle-distance runner Beant Singh has slammed the organisers of the Diljit Dosanjh concert. Diljit's concert left the Jawaharlal Nehru Stadium in a terrible state as training facilities were vandalised by the crowd."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/bruno-fernandes-erik-ten-hag-sacked-manchester-united-2624572-2024-10-28",
      "headline": "Fernandes wants fans to remember good things Erik ten Hag did for Man UnitedManchester United captain Bruno Fernandes has asked the fans to remember Erik ten Hag for the good things he did at the club. Ten Hag resigned from his position after the team's latest defeat against West Ham on Sunday, October 27.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hardik-pandya-hails-brother-krunal-for-ranji-hundred-leading-from-front-2624553-2024-10-28",
      "headline": "Hardik Pandya hails brother Krunal for Ranji hundred: Leading from frontHardik Pandya posted a special Instagram story for his brother Krunal Pandya as he scored a hundred in Baroda's Ranji Trophy match against Odisha. Baroda beat Odisha by an innings and 98 runs to register their 3rd straight win of the season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-vs-barcelona-federico-valverde-reacts-we-will-rise-again-defeat-laliga-2624512-2024-10-28",
      "headline": "Real Madrid's Valverde opens up on El Clasico defeat: We will rise againAfter Real Madrid's crushing 4-0 El Clasico loss to Barcelona, Federico Valverde promised Los Blancos fans a swift redemption, confident in his team's resilience and determined to restore their La Liga dominance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/the-curious-case-of-prithvi-shaw-from-being-next-sachintendulkar-to-going-out-of-favour-2624482-2024-10-28",
      "headline": "The curious case of Prithvi Shaw: From being next Tendulkar to going out of favourOnce hailed as the next Sachin Tendulkar, the enigma called Prithvi Shaw is now out of favour even with his state team. What went wrong with this prodigious talent?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/whoever-raises-voice-will-get-sidelined-basit-ali-on-gary-kirstens-resignation-2624466-2024-10-28",
      "headline": "Whoever raises voice will get sidelined: Basit Ali on Gary Kirsten's resignationBasit Ali reacted on Gary Kirsten's resignation from his post as the Pakistan team's head coach in white ball cricket. He pointed out that PCB chief Mohsin Naqvi is a powerful man and whosoever will raise their voice will get sidelined."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/erik-ten-hag-quits-manchester-united-head-coach-west-ham-defeat-rudd-van-nistelrooy-2624453-2024-10-28",
      "headline": "Erik ten Hag quits as Manchester United manager after West Ham defeatErik ten Hag has left his role as Manchester United manager after the side's unfortunate defeat to West Ham in the Premier League, which has left them only 3 spots away from relegation. United confirmed in their statement that assistant manager, Rudd van Nistelrooy will take over the role."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammad-rizwan-calls-it-great-honour-to-be-captain-of-pakistans-odi-side-2624434-2024-10-28",
      "headline": "Mohammad Rizwan calls it 'great honour' to be captain of Pakistan's ODI sideMohammad Rizwan has been appointed Pakistan's new ODI and T20I captain, taking over from Babar Azam after a series of disappointing World Cup performances. Rizwan called it a great honour and understood that it would be a huge responsibility for him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/ballon-dor-ceremony-live-streaming-where-to-watch-channel-nominees-vinicus-jr-rodri-2624436-2024-10-28",
      "headline": "Ballon d'Or Ceremony: Live streaming, nominees and all you need to knowThe Ballon d'Or 2024 debate intensifies as football's new generation, led by Vinicius Jr, Jude Bellingham, and Rodri, contends for the prestigious award. Each brings a unique blend of club and international success, making this race electrifying."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/whoever-raises-voice-will-get-sidelined-basit-ali-on-gary-kirstens-resignation-2624466-2024-10-28",
      "headline": "Whoever raises voice will get sidelined: Basit Ali on Gary Kirsten's resignationBasit Ali reacted on Gary Kirsten's resignation from his post as the Pakistan team's head coach in white ball cricket. He pointed out that PCB chief Mohsin Naqvi is a powerful man and whosoever will raise their voice will get sidelined."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/erik-ten-hag-quits-manchester-united-head-coach-west-ham-defeat-rudd-van-nistelrooy-2624453-2024-10-28",
      "headline": "Erik ten Hag quits as Manchester United manager after West Ham defeatErik ten Hag has left his role as Manchester United manager after the side's unfortunate defeat to West Ham in the Premier League, which has left them only 3 spots away from relegation. United confirmed in their statement that assistant manager, Rudd van Nistelrooy will take over the role."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammad-rizwan-calls-it-great-honour-to-be-captain-of-pakistans-odi-side-2624434-2024-10-28",
      "headline": "Mohammad Rizwan calls it 'great honour' to be captain of Pakistan's ODI sideMohammad Rizwan has been appointed Pakistan's new ODI and T20I captain, taking over from Babar Azam after a series of disappointing World Cup performances. Rizwan called it a great honour and understood that it would be a huge responsibility for him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/ballon-dor-ceremony-live-streaming-where-to-watch-channel-nominees-vinicus-jr-rodri-2624436-2024-10-28",
      "headline": "Ballon d'Or Ceremony: Live streaming, nominees and all you need to knowThe Ballon d'Or 2024 debate intensifies as football's new generation, led by Vinicius Jr, Jude Bellingham, and Rodri, contends for the prestigious award. Each brings a unique blend of club and international success, making this race electrifying."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/pm-modi-reacts-to-el-clasico-talks-real-madrid-vs-barcelona-fandom-in-india-2624421-2024-10-28",
      "headline": "PM Modi reacts to El Clasico, talks Real Madrid vs Barcelona fandom in IndiaPrime Minister Narendra Modi hailed the rivalry between Real Madrid and FC Barcelona in his latest speech at Vadodra. Speaking about relations between India and Spain. PM Modi said that India also had a massive football culture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-vs-south-africa-taijul-islam-captaincy-najimul-shanto-2624416-2024-10-28",
      "headline": "Taijul Islam ready to take Bangladesh Test captaincy if Najmul Shanto quitsBangladesh's seasoned spinner Taijul Islam expresses readiness to assume Test captaincy if Najimul Shanto steps down. Speculations arise as Shanto considers relinquishing the role post South Africa series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/salima-tete-leads-revamped-indian-team-in-womens-asian-champions-trophy-2624380-2024-10-28",
      "headline": "Salima Tete leads revamped Indian team in women's Asian Champions TrophyHockey India has revealed its 18-member women's team for the upcoming Asian Champions Trophy in Bihar. The tournament, featuring six nations, will take place from November 11 to 20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/selfless-ms-dhoni-reveals-reason-behind-batting-at-no-8-for-csk-in-ipl-2024-2624377-2024-10-28",
      "headline": "'Selfless' MS Dhoni reveals reason behind batting at No. 8 for CSK in IPL 2024MS Dhoni revealed that his decision to bat at No. 8 in IPL 2024 was to give teammates like Jadeja and Dube the chance to shine ahead of the T20 World Cup. Despite batting lower, Dhoni thrilled fans with explosive cameos and hinted at an IPL 2025 return."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}