{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-eyes-india-entry-for-third-time-why-ev-giants-last-two-attempts-failed-2681614-2025-02-18",
      "headline": "Tesla eyes India entry for third time. Why EV giant's last two attempts failedTesla has made two previous attempts to enter the Indian market, both of which ended in failure.  Here's a look at the reasons behind its past setbacks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-begins-hiring-in-india-here-is-the-list-of-job-openings-and-locations-elon-musk-pm-modi-meeting-2681601-2025-02-18",
      "headline": "Tesla begins hiring in India: Here's the list of job openings and locationsTesla has posted 13 job openings on its LinkedIn page, covering both customer-facing and back-end roles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-lower-despite-it-stock-gains-metal-banking-drag-2681589-2025-02-18",
      "headline": "Sensex, Nifty open lower despite IT stock gains; metal, banking dragThe S&P BSE Sensex lost 105.42 points to 75,891.44, while the NSE Nifty50 was down by 57.15 points to 22,902.35 as of 9:30 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-begins-hiring-in-india-planning-entry-ev-carmaker-after-pm-modi-recent-us-trip-elon-musk-2681581-2025-02-18",
      "headline": "Tesla hints at India entry with jobs post days after PM Modi meets Elon MuskTesla has begun hiring in India and has posted several job openings. This comes shortly after Tesla CEO Elon Musk met with Prime Minister Narendra Modi during his recent visit to the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-tips-dalal-street-continues-to-be-volatile-what-should-investors-do-expert-view-2681557-2025-02-18",
      "headline": "Dalal Street continues to be volatile: What should investors do? Dalal Street volatile: The S&P BSE Sensex gained 57.65 points to settle at 75,996.86, while the NSE Nifty50 added 30.25 points to close at 22,959.50. Despite this recovery, overall market sentiment remains cautious as investors react to various global and domestic factors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-a-change-of-name-caused-bira-a-loss-of-rs-80-crore-check-details-2681372-2025-02-17",
      "headline": "How a change of name caused Bira a loss of Rs 80 crore. Check details Ahead of its IPO, B9 Beverages Private Ltd, the owner of Bira beer, changed its name to B9 Beverages Ltd, causing several compliance hurdles and sales disruptions.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-2025-10-faqs-you-should-know-2681326-2025-02-17",
      "headline": "New Income Tax Bill: 10 FAQs you should knowNew Income Tax Bill 2025 explained: The current income tax bill which was enacted in 1961, and came into effect in 1962, consisted of 512,535 words and 819 sections. On the contrary, the new bill consists of 259,676 words, 23 chapters and 536 sections."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-gains-600-points-nifty-recover-losses-to-end-marginally-higher-amid-volatility-2681266-2025-02-17",
      "headline": "Sensex, Nifty recover losses to end marginally higher amid volatilityThe S&P BSE Sensex gained 57.65 points to close at 75,996.86, while the NSE Nifty50 added 30.25 points to end at 22,959.50. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/pfrda-warns-against-nps-apy-scams-issues-guidelines-to-stay-protected-2681238-2025-02-17",
      "headline": "Regulatory body warns against rising NPS scams, issues these guidelines The Pension Fund Regulatory and Development Authority (PFRDA) has cautioned subscribers of the National Pension Scheme (NPS) and Atal Pension Yojayna (APY) regarding fraudulent calls demanding money to release pension funds. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-mulls-over-setting-a-reserve-fund-for-stable-epfo-interest-rates-2681191-2025-02-17",
      "headline": "Government may set up reserve fund for stable EPFO interest rates: ReportThe labour and employment ministry is conducting an internal study to explore the creation of an interest stabilisation reserve fund under the EPFO, sources said familiar with the matter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pm-svanidhi-scheme-know-about-eligibility-and-rs-30000-credit-cards-2680106-2025-02-17",
      "headline": "PM SVANidhi scheme: Know about eligibility and Rs 30,000 credit cardsPM SVANidhi scheme eligibility: Finance Minister Nirmala Sitharaman in her Budget 2025 speech announced providing credit cards under the PM SVANidhi scheme."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-your-money-safe-in-co-operative-banks-safe-rbi-latest-curbs-on-new-india-co-operative-bank-raise-concern-2681213-2025-02-17",
      "headline": "Is your money safe in co-operative banks safe? RBI's latest curbs raise concernConcerns over New India Co-operative Bank's financial stability and a potential Rs 122 crore scam prompted the RBI to take strict action. This incident has added to the growing list of cooperative banks facing regulatory action."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/amit-trivedi-global-artists-ed-sheeran-dua-lipa-coldplay-india-purely-business-exclusive-2680888-2025-02-18",
      "headline": "Amit Trivedi: Global artists performing in India is nothing but pure businessIndia has become a hotspot for global artists to perform, drawing big names like Coldplay, Ed Sheeran, and Dua Lipa. Music composer Amit Trivedi believes their choice is driven by business interests, as they seek lucrative opportunities in the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bridgerton-4-first-look-benedict-sophies-love-story-takes-centre-stage-2681436-2025-02-17",
      "headline": "Bridgerton 4 first look: Benedict-Sophie's love story takes centre stageThe fourth season of Bridgerton is set to spotlight Benedict Bridgerton's romance with Sophie Baek. New characters like Katie Leung's Lady Araminta Gun will add intrigue to the season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/legends-of-shiva-amish-tripathi-get-real-about-lord-shiva-in-discovery-show-2681343-2025-02-17",
      "headline": "Legends of Shiva: Amish Tripathi gets real about Lord Shiva in his latest showAuthor and producer Amish Tripathi returns as host of Legends of Shiva with Amish, a new show on Discovery Channel, exploring Lord Shiva beyond myths. Unveiled at the New Delhi Book Fair, it promises a deep dive into mythology coinciding with Maha Kumbh 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/amortage-review-jisoos-album-shakes-things-up-like-an-earthquake-2681277-2025-02-17",
      "headline": "Amortage review: Jisoo's album shakes things up like an 'earthquake'Jisoo's new EP, Amortage, released on February 14, 2025, marks her evolution as a solo artist. The EP blends pop and R&B to explore love's many facets, featuring English tracks and her own songwriting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bhabiji-writer-manoj-santoshi-battles-cancer-shilpa-shinde-takes-care-of-him-2681295-2025-02-17",
      "headline": "Bhabiji writer Manoj Santoshi battles cancer, Shilpa Shinde takes care of himActor Kavita Kaushik made an emotional post on social media, highlighting screenwriter Manoj Santoshi's struggle with liver cancer. She also mentioned actor Shilpa Shinde and thanked her for taking care of him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-witch-review-park-jinyoung-roh-jeong-eui-shine-in-slow-burning-psychological-mystery-2681258-2025-02-17",
      "headline": "The Witch review: Jinyoung, Jeong-eui shine in slow-burning psychological mysteryReleased-Sat Feb 15, 2025The Witch review: The Witch, a new K-drama starring Jinyoung and Jeong-eui, captivates with its psychological mystery and slow-burning narrative. The series, based on a popular webtoon, blends mystery, romance, and suspense, leaving viewers intrigued by the enigmatic characters and their complex interactions, says our review. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rashami-desai-on-love-hate-bond-with-sidharth-shukla-we-would-communicate-through-eyes-2681270-2025-02-17",
      "headline": "Rashami Desai on love-hate bond with Sidharth Shukla: We'd communicate through eyesActor Rashami Desai, who had worked with the late Sidharth Shukla on 'Dil Se Dil Tak' and 'Bigg Boss 13', was reminded of her relationship with him on comedian Bharti Singh's podcast. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/stray-kids-felix-arm-fracture-in-car-accident-misses-fan-meet-2681229-2025-02-17",
      "headline": "Stray Kids' Felix suffers fracture after car accident, misses group's fan meetFelix, a member of the boy band Stray Kids, suffered an arm fracture in a minor car accident, causing him to miss the band's fifth fan meeting."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/south-korean-actor-kim-sae-ron-suicide-comeback-to-films-2681202-2025-02-17",
      "headline": "South Korean actor Kim Sae-ron wanted to make a comeback to films, open a cafeSouth Korean actor Kim Sae-ron, who was found dead in her apartment on Sunday, had wished to make a comeback to the entertainment world, revealed a friend recently. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/gajraj-rao-renuka-shahane-dupahiya-prime-video-teaser-2681147-2025-02-17",
      "headline": "Gajraj Rao, Renuka Shahane's Dupahiya to bring laughter and chaos to Prime VideoPrime Video's Dupahiya is set in a crime-free village where the first-ever theft of a motorbike creates chaos and drama. Starring Gajraj Rao and Renuka Shahane, the comedy series starts streaming on March 7."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/south-korean-actor-kim-sae-ron-found-dead-at-24-2680949-2025-02-16",
      "headline": "South Korean actor Kim Sae-ron, 24, found deadSouth Korean actor Kim Sae-ron, known for her roles in Bloodhounds and The Man from Nowhere, was found dead at her home in Seoul. She was 24. Authorities are investigating the circumstances of her death, with no signs of foul play reported yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-white-lotus-season-3-review-lisa-parker-posey-and-jason-isaacs-show-is-predictable-but-entertaining-2680925-2025-02-16",
      "headline": "The White Lotus S3 review: Predictable? Yes. Addictive? Also, yesReleased-Mon Feb 17, 2025The White Lotus Season 3 review: The White Lotus returns with a new season set in Thailand, offering a fresh cultural backdrop while retaining its biting satire on the ultra-rich. The series continues to entertain with its dark humour and ensemble cast, though its formula is starting to feel familiar. Read our full review. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-begins-hiring-in-india-planning-entry-ev-carmaker-after-pm-modi-recent-us-trip-elon-musk-2681581-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Tesla hints at India entry with jobs post days after PM Modi meets Elon MuskTesla has begun hiring in India and has posted several job openings. This comes shortly after Tesla CEO Elon Musk met with Prime Minister Narendra Modi during his recent visit to the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/new-delhi-station-stampede-railway-rpf-fire-services-40-minute-delay-distress-call-probe-report-2681559-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "40-minute delay in Delhi stampede response? What Railways, fire officials sayNDLS Stampede: The stampede at the New Delhi railway station was triggered due to an announcement that a special Kumbh train would arrive at platform 16 after an earlier announcement that it would come on platform 12, triggering confusion among passengers, an RPF report said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/gyanesh-kumar-chief-election-commissioner-jammu-and-kashmir-rajiv-kumar-election-commission-2681543-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Meet new poll body chief Gyanesh Kumar: Ex-bureaucrat, key player in J&K reformsGyanesh Kumar, a 1988-batch Kerala cadre IAS officer, was appointed India's 26th Chief Election Commissioner (CEC) and his term will run till January 26, 2029."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/canada-plane-crash-delta-airlines-plane-crashes-at-airport-several-feared-injured-2681533-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'It's upside down': Plane flips on landing at Canada airport, 18 injuredA Delta Air Lines plane flipped upside down upon landing at Canada's Toronto Pearson Airport on Monday, injuring 18 of the 80 people on board."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/the-growing-craze-for-mahurat-deliveries-in-india-2681549-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Born at the 'right' time: The growing craze for Mahurat Deliveries in IndiaMore and more people are opting for Mahurat Deliveries, believing that in an uncertain world, they can influence their baby's fate and ensure an 'auspicious', 'blessed' future."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/uttar-pradesh-woman-found-dead-in-jhansi-4-year-old-daughter-accuses-father-of-hanging-her-2681537-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Papa killed mummy': 4-year-old's drawing leads UP cops to arrest man for murderA 27-year-old woman was found dead under suspicious circumstances in Jhansi, with her family accusing her husband and in-laws of murder. The woman's 4-year-old daughter accused her father of killing her mother by hanging her. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/the-quiet-struggle-of-growing-up-hindu-in-america-and-why-silence-is-no-longer-an-option-2681294-2025-02-17?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "The quiet struggle of growing up Hindu in US, and why silence is no more an optionHindus in the US have long been told we are \"the good immigrants\", but it is a double-edged sword. The people who praise us as hard-working immigrants turn on us when we become too successful. The time for quiet gratitude is over. We must own our identity, and speak out when we are misrepresented. Build political and institutional power. Make it clear that we are stakeholders in America's future, and aren't going anywhere."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/high-level-of-faecal-bacteria-in-ganga-at-prayagraj-green-court-summons-officials-2681452-2025-02-17?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "High level of faecal bacteria in Ganga at Prayagraj as millions take Kumbh dipThe National Green Tribunal (NGT) has raised concerns about rising faecal bacteria levels in the Ganga at Prayagraj, especially during the Maha Kumbh Mela. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/gaurav-kapoor-jokes-about-stand-up-comedy-ranveer-allaahbadia-apology-2681555-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Viral video: Comic Gaurav Kapoor roasts YouTuber Ranveer Allahbadia over apologyComedian Gaurav Kapoor, cashing in on the controversy, joked about Ranveer Allahbadia in his recent stand-up comedy special. He said that Ranveer's apology came just two hours after the controversy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-first-glimpse-of-indias-jersey-out-features-pakistan-name-2681449-2025-02-17?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "First glimpse of India's Champions Trophy jersey, features 'Pakistan' imprintThe Indian cricket team unveiled their new jersey for the ICC Champions Trophy 2025 which interestingly has the hosts' Pakistan name printed on it."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ludhiana-police-cracks-murder-case-aap-leader-anokh-mittal-girlfriend-contract-killer-arrest-2681478-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Punjab woman's murder solved, AAP leader husband caught for hiring killersLudhiana Police arrested AAP leader Anokh Mittal and his girlfriend, accusing them of hiring contract killers to murder Mittal's wife. According to the police, the AAP leader agreed to pay Rs 2.5 lakh for the crime, with Rs 50,000 paid in advance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/disease-is-not-a-joke-what-has-a-stand-up-comic-got-to-do-with-it-2681209-2025-02-17?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Disease is not a joke, what's a stand-up comic got to do with it?Diseases are to be discussed at a symposium sponsored by big pharmaceutical companies where doctors fly in on tickets paid for by the big pharmaceutical companies. Is that Kashmiri comic a doctor, a pharmacist, or a journalist?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-exclusive-himani-mor-marriage-love-story-2681441-2025-02-17?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "From casual chats to lifelong vows: Neeraj Chopra recalls love story with HimaniSpeaking to India Today, Neeraj Chopra opened up about his love story with wife Himani Mor. Neeraj tied the knot with Himani, a former tennis player, in an intimate ceremony in Shimla in January. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indias-got-latent-row-supreme-court-to-hear-ranveer-allahbadias-plea-today-2681583-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India's Got Latent row: Supreme Court to hear Ranveer Allahbadia's plea todayRanveer Allahbadia approached the Supreme Court on Friday, seeking clubbing of multiple FIRs against him over obscene remarks on India's Got Latent show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/the-odyssey-matt-damon-first-look-poster-christopher-nolan-film-2681590-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "The Odyssey: Matt Damon's first look poster from Christopher Nolan's film outMatt Damon plays the Odysseus in Christopher Nolan's The Odyssey. The first-look poster of the film was unveiled recently."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/novak-djokovic-jannik-sinner-doping-ban-favouritism-2681556-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Novak Djokovic calls out 'favouritism' shown in Jannik Sinner doping banNovak Djokovic slammed WADA for showing \"favouritism\" in Jannik Sinner's doping case, criticising the lenient three-month ban that allows the World No.1 to compete in Grand Slams, calling it unfair treatment compared to other doping cases."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/fan-arrives-on-horseback-to-watch-chhaava-shouts-jai-bhavani-in-theatre-2681569-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Fan arrives on horseback to watch Chhaava, shouts 'Jai Bhavani' in theatreA Nagpur man, dressed as Sambhaji Maharaj, arrived on horseback to watch Chhaava, chanting slogans in the theatre. Vicky Kaushal's film has sparked massive fan celebrations, crossing Rs 100 crore at the box office."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/gurugram-woman-zomato-job-interview-experience-deepinder-goyal-reacts-viral-linkedin-post-2681279-2025-02-17?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Gurugram woman's story of not getting a job at Zomato has Deepinder Goyal's attentionIn a now-viral LinkedIn post, a Gurugram-based woman, who applied for a job at Zomato, shared her interview experience. She didn't land the role, but her story got CEO Deepinder Goyal's attention. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-food-drug-administration-employees-reviewing-elon-musks-brain-implant-company-neuralink-fired-doge-workforce-purge-2681558-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Drugs body employees reviewing Elon Musk's Neuralink fired in DOGE workforce purgeThe cuts included about 20 people in the FDA's office of neurological and physical medicine devices, several of whom worked on Neuralink, according to the sources."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/manu-bhaker-bbc-sportswoman-of-the-year-paris-olympics-khel-ratna-2681548-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Manu Bhaker named BBC Sportswoman of the YearManu Bhaker, India's shooting sensation, won the BBC Indian Sportswoman of the Year after securing two historic bronze medals at the Paris Olympics, becoming the first Indian female shooter to achieve multiple Olympic podium finishes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/why-elon-musk-likes-genghis-khan-mongol-conqueror-who-fathered-hundreds-of-kids-mars-chengez-khan-2681411-2025-02-17?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why Elon Musk likes Genghis Khan, the conqueror who fathered hundreds of kidsTesla and SpaceX chief Elon Musk has always tried to conquer, be it the electric car industry or space, the final frontier. Musk has also fathered a number of children. His recent admission that he likes Genghis Khan shouldn't come as a surprise. The legendary Mongol was one of the biggest conquerors who fathered hundreds of kids, and is said to have his DNA in 16 million living descendants."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nepal-student-suicide-in-odisha-pm-kp-oli-sends-2-officers-to-counsel-students-2681399-2025-02-17?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "PM Oli reacts to Nepal woman student's suicide in Odisha university amid outrageNepal Prime Minister KP Sharma Oli addressed the death of Nepali student Prakriti Lamsal in Odisha. The Nepali Embassy sent officials to counsel students, offering them the choice to stay in their hostel or return home.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/bangladesh-political-crisis-sheikh-hasina-muhammad-yunus-government-student-protest-deaths-2681456-2025-02-17?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "I shall return, that's why Allah kept me alive: Sheikh Hasina attacks YunusSheikh Hasina criticised the Muhammad Yunus-led interim government, vowing to return and ensure justice for victims. She denied police involvement in protester deaths, asserting post-mortems would confirm her claims. Hasina also defended police actions during the unrest."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/mumbai/story/mumbai-andheri-station-passenger-fell-rescued-railway-cop-video-2681391-2025-02-17?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Watch: Man falls into gap between train and platform, rescued by alert copA Railway Protection Force personnel saved a 40-year-old passenger who slipped while boarding a moving train at Andheri station. The dramatic rescue was captured on CCTV, showing the officer pulling the man to safety.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/radhika-apte-bafta-reality-with-breast-pump-champagne-2681600-2025-02-18",
      "headline": "Radhika Apte shares 'BAFTA reality' with breast pump and champagneRadhika Apte shares her \"BAFTA reality,\" breast-pumping in a washroom with champagne in hand. The Sister Midnight star thanks her team for their support as she balances motherhood and work."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/the-odyssey-matt-damon-first-look-poster-christopher-nolan-film-2681590-2025-02-18",
      "headline": "The Odyssey: Matt Damon's first look poster from Christopher Nolan's film outMatt Damon plays the Odysseus in Christopher Nolan's The Odyssey. The first-look poster of the film was unveiled recently."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/chhaava-box-office-collection-day-4-vicky-kaushal-nears-rs-150-crore-2681588-2025-02-18",
      "headline": "Chhaava box office Day 4: Vicky Kaushal's film roars towards Rs 150 crore markChhaava box office collection: Vicky Kaushal's film earned Rs 24 crore on Monday. The historical drama is receiving the maximum footfall in Maharashtra. It is expected to cross the Rs 150 crore mark today. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-huge-crowd-kingdom-sets-viral-video-2681575-2025-02-18",
      "headline": "Vijay Deverakonda greets fans with folded-hands on Kingdom sets. Viral video outVijay Deverakonda is currently shooting for his upcoming film, Kingdom, at Visakhapatnam. A huge crowd gathered at the shooting spot to catch a glimpse of the actor."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-rohit-sharma-virat-kohli-relax-nets-session-mohammed-shami-autographs-2681607-2025-02-18",
      "headline": "Watch: Rohit, Kohli relax after nets, Shami signs autographs for fansIndia skipper Rohit Sharma and Virat Kohli were spotted unwinding after a training session in Dubai ahead of the Champions Trophy, while pacer Mohammed Shami delighted fans by taking time to sign autographs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/manu-bhaker-sportswoman-of-the-year-mary-kom-presents-award-2681595-2025-02-18",
      "headline": "Mary Kom presents Manu Bhaker with BBC Sportswoman of the year awardIndian boxing legend Mary Kom presented the BBC Indian Sportswoman of the Year award to Paris Olympics shooting sensation Manu Bhaker on February 17, honouring her remarkable achievements, including two historic bronze medals at the Games, solidifying her legacy in Indian sports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-virat-kohli-perform-like-champion-childhood-coach-batting-from-2681572-2025-02-18",
      "headline": "Virat Kohli will perform like a champion: Childhood coach backs India starChampions Trophy: Virat Kohli's childhood coach, Rajkumar Sharma, has dismissed concerns over the star batter's form, backing him to deliver a \"champion\" performance in the upcoming Champions Trophy despite recent struggles in international cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/novak-djokovic-jannik-sinner-doping-ban-favouritism-2681556-2025-02-18",
      "headline": "Novak Djokovic calls out 'favouritism' shown in Jannik Sinner doping banNovak Djokovic slammed WADA for showing \"favouritism\" in Jannik Sinner's doping case, criticising the lenient three-month ban that allows the World No.1 to compete in Grand Slams, calling it unfair treatment compared to other doping cases."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-shubman-gill-india-vice-captain-mvp-opening-batter-2681554-2025-02-18",
      "headline": "Why vice-captain Shubman Gill will be India's MVP in Champions TrophyVice-captain Shubman Gill has stepped up in ODIs for India in a big way in the past few years and could prove to be India's MVP during the upcoming Champions Trophy in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/manu-bhaker-bbc-sportswoman-of-the-year-paris-olympics-khel-ratna-2681548-2025-02-18",
      "headline": "Manu Bhaker named BBC Sportswoman of the YearManu Bhaker, India's shooting sensation, won the BBC Indian Sportswoman of the Year after securing two historic bronze medals at the Paris Olympics, becoming the first Indian female shooter to achieve multiple Olympic podium finishes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-suresh-raina-reveals-indias-masterstroke-to-win-champions-trophy-2013-2681529-2025-02-18",
      "headline": "Raina reveals masterstroke which helped India win Champions Trophy 2013Former India cricketer Suresh Raina revealed India's masterstroke which helped them emerge victorious in the ICC Champions Trophy 2013 under the leadership of MS Dhoni."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-smriti-mandhana-danni-wyatt-hodge-wpl-2025-rcb-w-vs-dc-w-2681497-2025-02-17",
      "headline": "Captain, star batter, and now coach: Smriti Mandhana juggles roles in WPL 2025Royal Challengers Bengaluru women opener Danielle Wyatt Hodge credited her captain Smriti Mandhana for coaching her during their match winning century partnership against Delhi Capitals (DC-W) in Women's Premier League. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/cricket-rajesh-kannur-indias-homeless-cricket-hero-interview-2681474-2025-02-17",
      "headline": "Rajesh Kannur: India's homeless cricket hero dreams of a better futureRajesh Kannur, who won the Player of the Tournament award after India's triumph in the Physical Disability Champions Trophy in Sri Lanka earlier this year, spoke to India Today, calling for support. The cricketer has battled against the odds to pursue his passion and dreams of building a home for his family in a better future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-rcb-vs-delhi-capitals-score-smriti-mandhana-points-table-2681459-2025-02-17",
      "headline": "Fiery Smriti Mandhana and bowlers help RCB hammer DC, top table earlyWPL 2025, RCB vs DC: Smriti Mandhana smashed a 47-ball 81 as Royal Challengers Bengaluru chased 142 in just 16.2 overs. With two wins in as many matches, RCB are on top of the points table early in the season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-afghanistan-mohammad-nabi-odi-retirement-son-hassan-eisakhil-2681450-2025-02-17",
      "headline": "40-year-old Afghan star dreams of playing with son, hints at extending career Champions Trophy 2025: Mohammad Nabi, who had announced last year that he would retire from ODIs after the tournament, has now hinted at extending his 50-over career. Nabi revealed that his dream is to play for Afghanistan alongside his 18-year-old son, Hassan Eisakhil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-suresh-raina-reveals-indias-masterstroke-to-win-champions-trophy-2013-2681529-2025-02-18",
      "headline": "Raina reveals masterstroke which helped India win Champions Trophy 2013Former India cricketer Suresh Raina revealed India's masterstroke which helped them emerge victorious in the ICC Champions Trophy 2013 under the leadership of MS Dhoni."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-smriti-mandhana-danni-wyatt-hodge-wpl-2025-rcb-w-vs-dc-w-2681497-2025-02-17",
      "headline": "Captain, star batter, and now coach: Smriti Mandhana juggles roles in WPL 2025Royal Challengers Bengaluru women opener Danielle Wyatt Hodge credited her captain Smriti Mandhana for coaching her during their match winning century partnership against Delhi Capitals (DC-W) in Women's Premier League. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/cricket-rajesh-kannur-indias-homeless-cricket-hero-interview-2681474-2025-02-17",
      "headline": "Rajesh Kannur: India's homeless cricket hero dreams of a better futureRajesh Kannur, who won the Player of the Tournament award after India's triumph in the Physical Disability Champions Trophy in Sri Lanka earlier this year, spoke to India Today, calling for support. The cricketer has battled against the odds to pursue his passion and dreams of building a home for his family in a better future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-rcb-vs-delhi-capitals-score-smriti-mandhana-points-table-2681459-2025-02-17",
      "headline": "Fiery Smriti Mandhana and bowlers help RCB hammer DC, top table earlyWPL 2025, RCB vs DC: Smriti Mandhana smashed a 47-ball 81 as Royal Challengers Bengaluru chased 142 in just 16.2 overs. With two wins in as many matches, RCB are on top of the points table early in the season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-afghanistan-mohammad-nabi-odi-retirement-son-hassan-eisakhil-2681450-2025-02-17",
      "headline": "40-year-old Afghan star dreams of playing with son, hints at extending career Champions Trophy 2025: Mohammad Nabi, who had announced last year that he would retire from ODIs after the tournament, has now hinted at extending his 50-over career. Nabi revealed that his dream is to play for Afghanistan alongside his 18-year-old son, Hassan Eisakhil."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}