{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-salaried-indians-need-personal-finance-reset-2026-labour-codes-impact-2845893-2026-01-03",
      "headline": "Why salaried Indians need a personal finance reset in 2026Rising living costs, changing job patterns and sweeping labour law reforms are urging salaried Indians to rethink how secure their finances really are."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/companies/story/gig-economy-debate-zomato-blinkit-eternal-deepinder-goyal-2845626-2026-01-02",
      "headline": "Ban gig work and you don't solve inequality: Eternal CEO Deepinder GoyalEternal founder Deepinder Goyal argued that the gig economy debate is less about wages and more about discomfort with inequality, warning that bans and over-regulation could erase livelihoods instead of fixing systemic gaps."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-573-points-higher-nifty-hits-fresh-high-ntpc-up-5-percent-2845552-2026-01-02",
      "headline": "Sensex closes 573 points higher, Nifty hits fresh high; NTPC up 5%The S&P BSE Sensex added 573.41 points to close at 85,762.01, while the Nifty50 jumped 182 points to end at 26,328.55​​​​​​​. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cigarette-prices-to-rise-from-february-1-new-tax-calculation-explained-brand-name-cost-cess-2845490-2026-01-02",
      "headline": "Cigarettes to cost more from February 1. Here's how new rates will be decidedThe new levies on tobacco and pan masala will be imposed over and above the applicable GST rates. These measures will replace the GST compensation cess, which is currently charged at varying rates on sin products."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/revised-itr-filing-window-closed-tax-refund-eligiblity-2845428-2026-01-02",
      "headline": "Missed the revised ITR filing deadline? Know what happens to tax refundIn most cases, refunds are issued within a few weeks to a few months. Delays may occur due to mismatches in TDS details, bank account validation issues, or cases selected for scrutiny."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/itc-share-price-update-brokerage-targets-views-buy-sell-hold-2845403-2026-01-02",
      "headline": "ITC shares tumble 4%, down 13% in 2 days: Buy the dip or stay away?The sharp sell-off comes after the finance ministry revised the taxation structure for cigarettes, effective February 1, 2026. Here is all you need to know. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/mcx-share-price-crash-explained-stock-split-ex-split-adjustment-2845396-2026-01-02",
      "headline": "MCX shares crash 80% in early deals, but the fall is not what it seemsMCX shares fell by more than 80% on trading screens on Friday, hitting an intraday low of Rs 2,192 on the BSE. This was compared with Thursday's closing price of Rs 10,988.60. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/devyani-international-share-price-sapphire-foods-merger-shares-in-focus-kfc-pizza-hut-india-2845368-2026-01-02",
      "headline": "Devyani International and Sapphire Foods India shares in focus. Here's whyDevyani International shares were trading at Rs 152.80, up Rs 5.37 or 3.64% during the morning session as of 9:39 am. In contrast, Sapphire Foods India shares were trading lower at Rs 253.95, down Rs 8.75 or 3.33%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-nifty-auto-shares-rise-fmcg-itc-godfrey-phillips-2845357-2026-01-02",
      "headline": "Sensex, Nifty open higher driven by auto, metal stocks as FMCG continues to fallThe S&P BSE Sensex was up 172.34 points to 85,360.94, while the NSE Nifty50 rose 44.10 points to 26,190.65 as of 9:26 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-silver-price-today-precious-metals-start-2026-after-record-2025-gains-2845353-2026-01-02",
      "headline": "Gold, silver price today: How have precious metals started 2026?Gold and silver prices moved higher on Friday, recovering part of the losses seen late last week, even as investors looked back at the historic gains these metals delivered through 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-founder-10-minute-delivery-unsafe-gig-workers-explained-deepinder-goyal-2845337-2026-01-02",
      "headline": "Is 10-minute delivery really unsafe? Zomato CEO answers after gig workers strikeWhile delivery services on platforms such as Zomato and Blinkit were largely unaffected on New Year's Eve, questions around whether 10-minute delivery models put pressure on riders gained traction on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/deepinder-goyal-defends-gig-economy-as-zomato-blinkit-unaffected-by-gig-workers-strike-2845287-2026-01-01",
      "headline": "If system was unfair...: Deepinder Goyal as Zomato unaffected by gig workers' strikeZomato and its quick-commerce arm Blinkit recorded their highest-ever single-day orders on New Year's Eve, delivering over 75 lakh orders despite a nationwide gig workers' strike. Founder and CEO Deepinder Goyal said such scale shows a system seen as unfair cannot consistently attract or retain workers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/special-report-indias-economy-faces-trump-tariffs-and-trade-impasse-entering-2026-ytvd-2845174-2026-01-01",
      "headline": "Special Report: India's Economy Faces Trump Tariffs and Trade Impasse Entering 2026In this Special Report, an unidentified speaker analyses the state of the Indian economy as the nation steps into 2026. While highlighting a 'stupendous 2025' marked by major reforms like GST simplification and the Jan Vishwas Bill, the report warns that India enters the new year 'playing on a strong economic pitch, but also on a sticky wicket'. Key challenges identified include the ongoing trade impasse with the US, punitive 'Trump tariffs' of 50%, and a depreciating rupee which breached the 91 mark against the dollar. The programme notes that while GDP growth remains robust at 8%, high food inflation and sluggish job creation persist. With five state elections due in 2026, the report also flags concerns over rising state debts due to populist spending, even as all eyes turn to the upcoming Union Budget in February to restore confidence and boost private investment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/commercial-lpg-cylinder-prices-hiked-new-year-domestic-lpg-rates-no-change-oil-companies-atf-2845096-2026-01-01",
      "headline": "Commercial LPG cylinder price hiked by Rs 111 on New Year, highest since June 2025On New Year's Day, the price of a 19-kg commercial LPG cylinder was increased by Rs 111 — the steepest hike in six months, — with effect from today. The price of a 14.2-kg domestic LPG cylinder, however, remains unchanged."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-end-lower-itc-godfrey-phillips-crash-tobacco-cess-move-2845086-2026-01-01",
      "headline": "Sensex, Nifty end lower as ITC, Godfrey Phillipss crash on tobacco cess moveThe S&P BSE Sensex fell 32 points to close at 85,188.60, while the NSE Nifty50 was up by 16.95 points to end at 26,146.55. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/silver-gold-stocks-real-estate-best-investment-2026-money-compound-wealth-creation-2845060-2026-01-01",
      "headline": "Silver vs gold vs stock vs real estate: What can deliver most gains in 2026Should it be gold, which has just seen its strongest year since 1979? Or silver, which has surged over 150%, marking one of its best-ever annual performances?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/centre-draft-rules-four-labour-codes-wages-working-hours-women-workers-feedback-45-days-2844974-2026-01-01",
      "headline": "Inside draft labour code rules. What the fine print says on wages, working hoursThe draft Rules relate to the Code on Wages, the Code on Social Security, the Industrial Relations Code and the Code on Occupational Safety, Health and Working Conditions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/itc-godfrey-phillips-shares-fall-tobacco-stocks-down-excise-duty-health-national-security-cess-2026-2844941-2026-01-01",
      "headline": "ITC, Godfrey Phillips shares tank up to 16%: Why are tobacco shares falling todayShares of Godfrey Phillips India Ltd fell sharply in early trade, sliding nearly 16%. Shares of ITC Ltd also came under pressure, falling around 9% during early trade. The stock slipped to about Rs 362.70, touching its 52-week low."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-openinh-bell-sensex-opens-180-points-higher-nifty-abover-26150-itc-down-2-percent-2844928-2026-01-01",
      "headline": "Sensex opens 180 points higher, Nifty above 26,150; ITC down 2%The S&P BSE Sensex was up 104.21 points to 85,324.81, while the NSE Nifty50 gained 28.60 points to 26,158.20 as of 9:25 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/is-stock-market-open-today-bse-mcx-holiday-new-year-2026-commodity-nse-list-holidays-2844921-2026-01-01",
      "headline": "Stock market holiday today? Check if NSE and BSE are closed for New Year 2026Major international stock markets across China, Hong Kong, Japan, Singapore, France, Germany, the UAE, the UK and the US are closed on New Year's Day."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sara-ali-khan-shares-snowy-vacation-pics-after-new-year-celebration-2846183-2026-01-04",
      "headline": "Sara Ali Khan shares snowy vacation pics after New Year celebration: Aisi Jannat Sara Ali Khan shared glimpses from her peaceful winter vacation after celebrating New Year at the Pataudi Palace, posting candid moments with family and snow-filled views."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/archana-puran-makes-divorce-joke-during-london-trip-leaves-parmeet-sethi-laughing-2846166-2026-01-03",
      "headline": "Archana Puran makes divorce joke during London trip, leaves Parmeet Sethi laughing Archana Puran Singh jokingly spoke about divorcing Parmeet Sethi during their London New Year trip after his \"dad joke\" left her unimpressed, a moment that became the highlight of her latest family vlog."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/blackpink-jisoo-turns-31-rose-lisa-and-jennie-share-rare-pics-to-celebrate-2846158-2026-01-03",
      "headline": "BLACKPINK's Jisoo turns 31: Rose, Lisa and Jennie share rare pics to celebrate BLACKPINK's Jisoo celebrated her 31st birthday with heartfelt wishes and unseen photos shared by Rosé, Lisa and Jennie on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shakti-kapoor-recalls-parents-reaction-to-his-villain-roles-they-scolded-me-2846155-2026-01-03",
      "headline": "Shakti Kapoor recalls parents' reaction to his villain roles: They scolded me Shakti Kapoor shared that his parents were so disturbed by his early villain roles that they walked out of the theatre and scolded him for choosing such characters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/haq-on-ott-has-seen-a-truly-overwhelming-response-director-suparn-varma-2846139-2026-01-03",
      "headline": "Haq on OTT has seen a truly overwhelming response: Director Suparn Varma Haq Suparn S Varma has expressed his excitement over the overwhelming response the film is receiving after its Netflix release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dhurandhar-rakesh-bedi-on-why-akshaye-khanna-villain-is-more-loved-than-the-hero-2846131-2026-01-03",
      "headline": "Dhurandhar's Rakesh Bedi on why Akshaye Khanna's villain is more loved than the hero Rakesh Bedi has praised Akshaye Khanna's performance in Dhurandhar, saying his quiet nature and lovable villain role made a strong impact on audiences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khans-nephew-ayaan-agnihotri-gets-engaged-to-tina-rijhwani-2846103-2026-01-03",
      "headline": "Salman Khan's nephew Ayaan Agnihotri gets engaged to Tina Rijhwani, shares pics Salman Khan's nephew Ayaan Agnihotri has announced his engagement to girlfriend Tina Rijhwani, sharing dreamy proposal photos on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/anil-kapoor-buys-copyrights-for-nayak-2001-film-may-get-sequel-2846085-2026-01-03",
      "headline": "Anil Kapoor buys copyrights for Nayak; 2001 film may get sequel: Report Anil Kapoor has reportedly bought the rights to his 2001 cult film Nayak and is keen on producing a sequel nearly 25 years after its release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jana-nayagan-trailer-out-vijay-farewell-film-is-high-on-mass-politics-2846083-2026-01-03",
      "headline": "Jana Nayagan trailer out: Vijay's farewell film high on mass appeal, politics Makers unveiled the trailer of Vijay's Jana Nayagan. The 2-minute, 52-second trailer offers the first clear look at Vijay's farewell film, even as speculation continues over its links to Bhagavanth Kesari.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/govindas-niece-recalls-2024-shooting-incident-says-there-were-200-cops-at-hospital-2846079-2026-01-03",
      "headline": "Govinda's niece recalls 2024 shooting incident, says there were 200 cops at hospital Govinda's niece, Ragini Khanna, has recounted the 2024 incident when the actor accidentally shot himself, revealing that there were 200 cops at the hospital and 50 outside his home."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/karan-johar-to-return-with-family-drama-kabhi-khushi-kabhie-gham-2-on-cards-2846071-2026-01-03",
      "headline": "KJo to return with family drama in the lines of Kabhi Khushi Kabhie Gham: Report Karan Johar is reportedly set to return to the director's chair in 2026 with his eighth film, a large-scale family drama backed by Dharma Productions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/suriya-and-jyotika-praise-dhurandhar-call-ranveer-singh-starrer-a-masterpiece-2846059-2026-01-03",
      "headline": "Suriya and Jyotika praise Dhurandhar, call Ranveer Singh starrer a masterpiece Dhurandhar has received strong praise from Suriya and Jyotika, with the actor calling the film a \"masterpiece\" and applauding director Aditya Dhar and the cast."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ashish-vidyarthi-wife-rupali-injured-in-road-accident-actor-shares-update-2846043-2026-01-03",
      "headline": "Ashish Vidyarthi, wife Rupali injured in road accident, actor shares update Veteran actor Ashish Vidyarthi and his wife Rupali Barua suffered minor injuries in a late-night accident in Guwahati. Vidyarthi addressed concerns on social media, confirming both are safe and under medical care."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/khosla-ka-ghosla-2-begins-in-delhi-anupam-kher-says-550th-film-is-interval-point-2846048-2026-01-03",
      "headline": "Khosla Ka Ghosla 2 begins in Delhi: Anupam Kher says 550th film is interval point Anupam Kher has begun work on his 550th film, Khosla Ka Ghosla 2, marking a historic milestone in his decades-long acting career. The actor described the moment as an \"interval point,\" expressing gratitude and optimism as he revisits the iconic role."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/twinkle-khanna-celebrates-birthday-with-perfumes-not-cake-in-marakesh-with-akshay-2846023-2026-01-03",
      "headline": "Twinkle Khanna celebrates birthday with perfumes, not cake, in Marakesh with Akshay Twinkle Khanna celebrated her 52nd birthday on December 29 in Marakesh, choosing a perfume-blending experience with her family at the Musée du Parfum. She shared a video on social media also featuring her husband Akshay Kumar. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/the-50-premiere-date-announced-farah-khan-features-on-new-reality-show-2846034-2026-01-03",
      "headline": "The 50 premiere date announced, Farah Khan features on new reality show The 50, Colors TV's upcoming reality show, has officially announced its premiere date and is being promoted as India's biggest reality series. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-tamil-9-parvathy-kamrudin-attack-sandra-in-car-task-fans-condemn-2845979-2026-01-03",
      "headline": "Bigg Boss Tamil 9: Parvathy, Kamrudin attack Sandra in car task; fans condemn Tensions escalated in Bigg Boss Tamil 9 as Parvathy and Kamrudin forcefully pushed Sandra during the intense car task, leading to her suffering a seizure. The incident sparked widespread condemnation from viewers, celebrities, and fellow contestants, demanding strict action against the duo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/gandhi-talks-silent-film-vijay-sethupathi-arvind-swamy-aridhi-rao-hydari-release-jan-2026-2845960-2026-01-03",
      "headline": "Gandhi Talks: January release for Vijay Sethupathi, Arvind Swamy's film Gandhi Talks, featuring Vijay Sethupathi, Arvind Swamy, Aditi Rao Hydari and Siddharth Jadhav, is set to release on January 30, 2026 as a rare silent film in contemporary Indian cinema, with AR Rahman's music providing the narrative voice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nupur-sanon-engaged-to-boyfriend-stebin-ben-after-romantic-yacht-proposal-2845943-2026-01-03",
      "headline": "Nupur Sanon engaged to boyfriend Stebin Ben after romantic yacht proposal Nupur Sanon has announced her engagement to longtime boyfriend and singer Stebin Ben. The couple shared dreamy proposal photos on social media on Saturday. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/we-are-going-to-run-venezuela-trump-says-us-oil-companies-to-go-in-to-caracas-2846154-2026-01-03",
      "headline": "We are going to run Venezuela: Trump after US's overnight strikes, Maduro captureTrump said the US would not allow another leader to take over Venezuela without safeguarding the interests of its people. He added that the US presence would continue in Venezuela during the transition period."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/venezuela-caracas-explosions-us-tensions-live-updates-blasts-donald-trump-2845935-2026-01-03",
      "headline": "Live: Plane carrying Venezuelan President Maduro arrives in New York Venezuela Attack Live Updates: President Donald Trump said the US would \"run\" Venezuela for the time being following overnight US strikes that led to the capture of Venezuelan President Nicolas Maduro. Earlier, Trump shared a picture of a handcuffed and blindfolded Maduro aboard a US warship that was heading towards New York to face a criminal trial. Several countries, including those in Latin America, Europe, Russia and China condemned US's strikes on Venezuela and called for de-escalation of tensions. The strikes in Venezuela come amid heightened pressure from the US, which has recently targeted alleged drug-smuggling boats, even as Caracas signalled openness to talks on counter-narcotics cooperation. Follow indiatoday.in for live updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mustafizur-rahman-released-kolkata-knight-riders-bcci-ipl-2026-2846112-2026-01-03",
      "headline": "Mustafizur Rahman breaks silence after being released by Kolkata Knight RidersKolkata Knight Riders have released Bangladesh pacer Mustafizur Rahman ahead of IPL 2026, following a directive from the BCCI prompted by political and social backlash surrounding his inclusion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-attack-donald-trump-nicolas-maduro-venezuela-us-panama-glbs-2846190-2026-01-04",
      "headline": "Date, Drugs, Elections: How a 36-year-old US operation resembles Venezuela attackA US strike that captured Venezuela's president echoes Washington's 1989 Panama invasion, with clear parallels in drug charges, disputed elections, and US-backed regime change."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/why-us-attacked-venezuela-nicolas-maduro-captured-oil-drugs-allegations-trump-strikes-explainer-2846075-2026-01-03",
      "headline": "Why did US attack Venezuela? Inside the long road to Maduro's captureThe US strike on Venezuela that led to President Nicolás Maduro's capture did not happen overnight. It was the climax of years of confrontation over power, oil, elections and alleged criminal activity — tensions that finally tipped into military action."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-weather-forecast-january-4-clear-skies-cold-wave-north-india-update-devendra-tripathi-imd-2846081-2026-01-03",
      "headline": "Clear skies across India, stronger cold wave in north likely on Jan 4India will see mostly clear skies on January 4, with no major rainfall expected across the country. However, weather expert Devendra Tripathi warns of a strengthening cold wave and dense fog in northern and eastern states."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/nicolas-maduro-wife-dragged-from-bedroom-us-raid-venezuela-military-base-2846147-2026-01-03",
      "headline": "Maduro, wife dragged from bedroom during US raid at Venezuela military baseVenezuelan President Nicolas Maduro and his wife were captured by the US forces in the middle of the night as they slept at a residence within the Ft. Tiuna military installation, as per a report by CNN."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/shashi-tharoor-kkr-mustafizur-rahman-bangladesh-unrest-hindu-atrocities-dipu-das-khokon-das-2846070-2026-01-03",
      "headline": "Who are we punishing? Tharoor after KKR releases Bangladesh's Mustafizur RahmanCongress MP Shashi Tharoor said cricket should not be \"mindlessly politicised\" over attacks on minorities in Bangladesh, reacting to Kolkata Knight Riders's decision to release Bangladeshi pacer Mustafizur Rahman from the squad following a BCCI directive."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-salaried-indians-need-personal-finance-reset-2026-labour-codes-impact-2845893-2026-01-03",
      "headline": "Why salaried Indians need a personal finance reset in 2026Rising living costs, changing job patterns and sweeping labour law reforms are urging salaried Indians to rethink how secure their finances really are."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/maduro-us-capture-venezuela-who-is-wife-cilia-flores-lawyer-tv-host-narco-charges-new-york-donald-trump-2846138-2026-01-03",
      "headline": "Lady Macbeth: Who's Maduro's powerful wife, a TV star with narco links?Nicknamed 'Lady Macbeth' for her ambition and influence, Venezuelan President Nicolas Maduro's wife, Cilia Flores, has long been seen as the power behind the regime in Caracas. With the US capturing Maduro and Flores, her journey from lawyer and TV figure to a part of a narco-terrorism case is under global scrutiny."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/what-if-putin-captures-zelenskyy-indian-origin-ro-khanna-on-trumps-venezuela-strike-2846188-2026-01-04",
      "headline": "What if Putin captures Zelenskyy? Indian-origin US lawmaker slams TrumpUS lawmaker Ro Khanna criticised Trump's Venezuela strike as an illegal war of choice, warning it risks dangerous global precedents and ignores domestic priorities, as Democrats question the legality and strategy of the operation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/mustafizur-rahman-bangladesh-hindu-killing-t20-world-cup-ipl-bcci-2846175-2026-01-03",
      "headline": "After Mustafizur IPL exit, Bangladesh wants its T20 World Cup games out of IndiaThe Bangladesh government has directed its cricket board to approach the ICC over getting their T20 World Cup games outside of India. The move comes after the BCCI asked KKR to release Mustafizur Rahman from the Indian Premier League."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/visuals/time-tide-tamil-gods-kings-and-grammar-sangams-shift-from-sacred-to-secular-part-10-329-03-01-2026",
      "headline": "Time, Tide & Tamil Part 10 | Gods, Kings & Grammar: Sangam's Shift from Sacred to SecularWhat concerns us here is not geography or geology, but grammar — how a civilisation understood itself before it theologised itself."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/find-everything-your-baby-needs-this-holiday-season-on-amazons-everyday-essentials-2842500-2025-12-27",
      "headline": "Find everything your baby needs this holiday season on Amazon's Everyday EssentialsAs part of the New Year selections, the specially curated New Year Store —available until 31 December 2025—brings up to 50% off across a wide selection of everyday essentials."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/delhi-riots-case-supreme-court-verdict-umar-khalid-sharjeel-imam-bail-pleas-january-5-2846082-2026-01-03",
      "headline": "Supreme Court verdict on Umar Khalid, Sharjeel Imam bail pleas on Jan 5Umar Khalid, Sharjeel Imam, and others have challenged a September 2 order of the Delhi High Court, which denied them bail in the case related to the alleged \"larger conspiracy\" behind the February 2020 violence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-shami-india-vs-new-zealand-squad-vijay-hazare-2846078-2026-01-03",
      "headline": "What more can he do? Mohammed Shami's coach lashes out at Agarkar after ODI snubIndia's ODI squad vs New Zealand: Mohammed Shami was snubbed from the Indian ODI squad once again. Despite showing good form, the selectors decided to not include the fast bowler in the Indian ODI squad against New Zealand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dhurandhar-rakesh-bedi-on-why-akshaye-khanna-villain-is-more-loved-than-the-hero-2846131-2026-01-03",
      "headline": "Dhurandhar's Rakesh Bedi on why Akshaye Khanna's villain is more loved than the heroRakesh Bedi has praised Akshaye Khanna's performance in Dhurandhar, saying his quiet nature and lovable villain role made a strong impact on audiences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/trending/weekly-quiz-557-02-01-2026",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-says-us-will-be-very-strongly-involved-in-venezuelas-oil-industry-after-nicolas-maduros-capture-2846137-2026-01-03",
      "headline": "US to be strongly involved in Venezuelan oil industry: Trump after Maduro's captureVice President JD Vance backed the move, citing alleged drug trafficking, \"stolen oil\" and US indictments against Maduro, while praising American special forces involved in the operation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/science/story/indore-water-contamination-deaths-bhagirathpura-sewage-bacteria-narmada-supply-2846132-2026-01-03",
      "headline": "This bacteria was behind the Indore water tragedy that killed 10A lethal mix of sewage and drinking water in Indore's Bhagirathpura has claimed multiple lives and hospitalised hundreds. Authorities investigate how faecal bacteria infiltrated the Narmada pipeline through a structural failure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/supermoon-2026-india-wolf-moon-peak-time-visibility-first-supermoon-of-year-2026-see-pics-india-ahmedabad-bengaluru-2846145-2026-01-03",
      "headline": "Wolf Moon 2026: Year's first supermoon lights up skies. See picsThe first supermoon of 2026 reached its peak illumination on January 3, appearing 30 per cent brighter in the night sky. Indian skywatchers caught the best views during moonrise as the Wolf Moon took on a stunning orange hue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jana-nayagan-trailer-out-vijay-farewell-film-is-high-on-mass-politics-2846083-2026-01-03",
      "headline": "Jana Nayagan trailer out: Vijay's farewell film high on mass appeal, politicsMakers unveiled the trailer of Vijay's Jana Nayagan. The 2-minute, 52-second trailer offers the first clear look at Vijay's farewell film, even as speculation continues over its links to Bhagavanth Kesari.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/trafficked-forgotten-specially-abled-indian-died-fighting-foreign-war-mandeep-kumar-forcibly-recruited-russian-army-human-trafficking-2846111-2026-01-03",
      "headline": "Trafficked and forgotten: How a specially-abled Indian died fighting a foreign warMandeep Kumar, a specially-abled man from Punjab, was allegedly trafficked and forced to fight in the Russian Army, dying months before his identity was confirmed. With no official help, his brother travelled to Russia to uncover the truth, raising serious questions about human trafficking, accountability and state apathy."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/anti-hasina-student-leaders-threaten-police-shayestaganj-confess-arson-si-santosh-killing-bangladesh-viral-video-2846044-2026-01-03",
      "headline": "We set thana on fire, burnt SI Santosh to death: Anti-Hasina leaders threaten copA viral video from inside a Bangladesh police station shows leaders of the Anti-Hasina movement openly threatening officers and boasting of an arson attack on a police station and murder of Hindu officer Santosh Chowdhury. They were demanding the release of a former Chhatra League leader. The footage, the leader's audacity and the detainee's release, has triggered outrage over the rule of law under Muhammad Yunus."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-u19-secure-25-run-dls-victory-over-south-africa-in-opening-youth-odi-2846178-2026-01-04",
      "headline": "Vaibhav Suryavanshi gets lucky break, India-U19 beat South Africa by 26 runs via DLS India U19 overcame early setbacks and adverse weather to defeat South Africa by 25 runs via the DLS method in the first Youth ODI. Harvansh Pangalia and RS Ambrish's crucial partnership laid the foundation, while South Africa's chase was interrupted by lightning."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/indian-super-league-2025-26-season-confirmed-aiff-dates-next-week-rules-financial-support-2846176-2026-01-03",
      "headline": "ISL return confirmed: Indian football body to announce start date next week AIFF's confirmation that the ISL will go ahead ends weeks of uncertainty, but questions remain over fees, format and club finances as the federation races to finalise plans for the delayed 2025–26 season."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/mustafizur-rahman-bangladesh-hindu-killing-t20-world-cup-ipl-bcci-2846175-2026-01-03",
      "headline": "After Mustafizur IPL exit, Bangladesh wants its T20 World Cup games out of India The Bangladesh government has directed its cricket board to approach the ICC over getting their T20 World Cup games outside of India. The move comes after the BCCI asked KKR to release Mustafizur Rahman from the Indian Premier League."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/damien-martyn-health-update-family-statement-meningitis-2846157-2026-01-03",
      "headline": "Damien Martyn's family issues statement on Australia legend's meningitis battle Damien Martyn's family has issued a statement on the Australian legend's health after his battle with meningitis. Martyn was put in an induced coma after his condition worsened on Boxing Day. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-nitish-reddy-under-scanner-aakash-chopra-india-nz-odi-squad-2846150-2026-01-03",
      "headline": "Rishabh Pant, Nitish Reddy roles questioned by ex-cricketer ahead of IND vs NZ Former cricketer Aakash Chopra questioned the roles of Rishabh Pant and Nitish Kumar Reddy in the Indian squad ahead of the New Zealand series. India will play three ODIs against New Zealand, starting from January 11. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-bangladesh-cricket-ties-bcci-tour-doubt-diplomatic-tensions-mustafizur-rahman-2846146-2026-01-03",
      "headline": "India's Bangladesh tour to be put on hold amidst Mustafizur Rahman controversy: Report Following Mustafizur Rahman's exit from the IPL, the BCCI are planning to put India's tour of Bangladesh on hold. India were scheduled to travel to Bangladesh in September this year and the schedule was revealed by Bangladesh cricket board on January 2. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/iga-swiatek-krygios-sabalenka-battle-of-the-sexes-2846134-2026-01-03",
      "headline": "Swiatek on Kyrgios vs Sabalenka: There's no need for Battle of the Sexes Tennis star Iga Swiatek is not a fan of 'Battle of the Sexes'. Reacting to the intergender match between Nick Kyrgios and Aryna Sabalenka, Swiatek said that the game did not do anything for tennis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mustafizur-rahman-released-kolkata-knight-riders-bcci-ipl-2026-2846112-2026-01-03",
      "headline": "Mustafizur Rahman breaks silence after being released by Kolkata Knight Riders Kolkata Knight Riders have released Bangladesh pacer Mustafizur Rahman ahead of IPL 2026, following a directive from the BCCI prompted by political and social backlash surrounding his inclusion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-injury-news-asian-games-athletics-federation-india-2846096-2026-01-03",
      "headline": "Neeraj Chopra taking break, recovering from injuries ahead of Asian Games India's star javelin thrower Neeraj Chopra is currently focusing on his rehabilitation, revealed Athletics Federation of India spokesperson Adille Sumariwalla. He revealed that Neeraj's poor show in last year's world championships was due to two injuries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-shami-india-vs-new-zealand-squad-vijay-hazare-2846078-2026-01-03",
      "headline": "What more can he do? Mohammed Shami's coach lashes out at Agarkar after ODI snub India's ODI squad vs New Zealand: Mohammed Shami was snubbed from the Indian ODI squad once again. Despite showing good form, the selectors decided to not include the fast bowler in the Indian ODI squad against New Zealand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/lockie-ferguson-injury-new-zealand-t20-world-cup-pace-bowling-hopes-2846076-2026-01-03",
      "headline": "New Zealand pacer Lockie Ferguson doubtful for T20 World Cup after injury setback New Zealand fast bowler Lockie Ferguson faces a race against time to be fit for the ICC Men's T20 World Cup after a calf injury forced him to withdraw from franchise commitments, disrupting his build-up and casting doubt over his readiness for the global tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/namibia-t20-world-cup-squad-announced-focus-youth-experienced-players-2846040-2026-01-03",
      "headline": "Gerhard Erasmus to lead young Namibia side during T20 World Cup 2026Namibia has announced a 15-member squad for the men's T20 World Cup to be held in India and Sri Lanka in February–March next year. The team, led by Gerhard Erasmus and supported by consultant Gary Kirsten, features a blend of experienced players and emerging talent, and faces a group including India, Pakistan, Netherlands, and USA."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/david-warner-goes-past-rohit-sharma-virat-kohli-unbeaten-hundred-big-bash-league-sydney-thunder-2846064-2026-01-03",
      "headline": "David Warner goes past Rohit Sharma, equals Virat Kohli after unbeaten ton in BBLDavid Warner smashed an unbeaten 130 in the BBL to move past Rohit Sharma and draw level with Virat Kohli on nine T20 centuries, producing the highest score of the season for Sydney Thunder."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-mohammed-shami-ignored-new-zealand-odi-series-2846058-2026-01-03",
      "headline": "Mohammed Shami ignored again as pacer misses out on India vs New Zealand seriesDespite his fine and consistent form on the domestic circuit, Mohammed Shami has been ignored again by the BCCI for the Indian squad for the upcoming three-match ODI series against New Zealand. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-ipl-mustafizur-rahman-kkr-shashi-tharoor-2846054-2026-01-03",
      "headline": "Shashi Tharoor slams BCCI after KKR releases Mustafizur Rahman from IPLKolkata Knight Riders terminated Mustafizur Rahman's contract ahead of the IPL 2026 season, a decision that drew sharp criticism from Congress MP Shashi Tharoor. He hit out at the BCCI over the move."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/bcci-drops-mustafizur-rahman-from-kkr-squad-amid-anti-hindu-violence-in-bangladesh-ytvd-2846047-2026-01-03",
      "headline": "BCCI Drops Mustafizur Rahman from KKR Squad Amid Anti-Hindu Violence in BangladeshIn a major development ahead of IPL 2026, the BCCI has instructed the Kolkata Knight Riders (KKR) to release Bangladeshi pacer Mustafizur Rahman from their squad. BCCI Secretary Devajit Saikia confirmed the directive, citing 'recent developments' and the ongoing anti-Hindu violence in Bangladesh. The decision follows a political storm where BJP leader Sangeet Som called KKR owner Shah Rukh Khan a 'traitor' for buying the player during the auction. The bulletin also covers the upcoming squad announcement for the India vs New Zealand ODI series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-odi-squad-new-zealand-series-pant-shreyas-bumrah-hardik-gill-2846045-2026-01-03",
      "headline": "Shreyas Iyer, Mohammed Siraj return as India name squad for New Zealand ODIsIndia vs New Zealand: Captain Shubman Gill and vice-captain Shreyas Iyer have returned to the ODI setup as India announced their 15-man squad for the three-match ODI series against New Zealand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/steve-smith-retirement-plans-final-ashes-test-sydney-cricket-ground-2846020-2026-01-03",
      "headline": "Steve Smith shares retirement plans ahead of fifth Ashes Test in SydneyAustralia's stand-in captain Steve Smith has opened up on his retirement plans ahead of the fifth Test of the Ashes 2025-26 in Sydney. Smith also reflected on his recent batting form and his evolving role as a senior figure within the squad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-ben-stokes-issues-stark-warning-to-england-teammates-final-test-2846033-2026-01-03",
      "headline": "Ashes: Ben Stokes issues stark warning to England teammates ahead of final TestEngland captain Ben Stokes has urged unity and selflessness within his squad ahead of the final Ashes Test at the Sydney Cricket Ground, calling on players to place the team's interests above individual ambitions as the series draws to a close."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-glenn-maxwell-reserve-wicketkeeper-t20-world-cup-2026-2846031-2026-01-03",
      "headline": "Glenn Maxwell as wicketkeeper in T20 World Cup? Australia chief selector reactsAustralia chief selector George Bailey has hinted that Glenn Maxwell could act as a reserve wicketkeeper for Australia during the T20 World Cup 2026. Maxwell has never donned the gloves during his international career for Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-century-vijay-hazare-trophy-odi-squad-call-up-ishan-kishan-jharkhand-2846029-2026-01-03",
      "headline": "Sanju Samson makes case for ODI call-up, slams century vs Ishan Kishan's JharkhandSanju Samson makes a strong case for a call-up in India's ODI side with a century in the Vijay Hazare Trophy fixture against Jharkhand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/bcci-secretary-devjit-saikia-confirms-directive-asking-kkr-to-drop-bangladeshi-pacer-mustafizur-rahman-ytvd-2846025-2026-01-03",
      "headline": "BCCI Secretary Devjit Saikia Confirms Directive Asking KKR To Drop Bangladeshi Pacer Mustafizur RahmanBCCI Secretary Devjit Saikia has confirmed that the board instructed Kolkata Knight Riders (KKR) to release Bangladeshi pacer Mustafizur Rahman from their squad. Speaking to India Today, Saikia cited 'recent developments' and diplomatic tensions as the primary reasons for the directive, assuring the franchise that a replacement player would be permitted. The bulletin features comprehensive analysis from Sports Editor Vikrant Gupta, who terms the decision a 'corrective measure' following public outrage and backlash against KKR co-owner Shah Rukh Khan. Additionally, political leaders Sangeet Som and Anand Dubey express support for the move, highlighting national sentiments and the safety of Hindus in Bangladesh. Former cricketer Madan Lal also weighs in, stating that while politics in sports is unfortunate, national interests must come first."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhav-suryavanshi-youngest-india-u19-captain-youth-odi-world-record-2845998-2026-01-03",
      "headline": "Vaibhav Suryavanshi shatters record books despite failure in 1st match as captainVaibhav Suryavanshi made history in Benoni by leading India U19 at just 14 years old, setting a new world record for youth cricket captaincy. His appointment came amid injuries to regular leaders, and he now stands as the youngest captain in Youth ODI history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/tottenham-hotspur-transition-challenges-thomas-frank-admits-struggles-fan-discontent-2845987-2026-01-03",
      "headline": "Thomas Frank finds it 'difficult to enjoy' being Tottenham Hotspur head coachThomas Frank has admitted he is not enjoying his time at Tottenham Hotspur after a difficult start to his tenure, with supporters increasingly frustrated by recent performances. Despite the pressure, the manager says his focus remains on long-term progress, pointing to the scale of the club's transition and signs of defensive improvement as reasons for optimism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/devdutt-padikkal-vijay-hazare-trophy-fourth-century-karnataka-ind-vs-nz-odi-squad-call-up-2845974-2026-01-03",
      "headline": "Padikkal extends Vijay Hazare century barrage, hits 4th 100 in five inningsDevdutt Padikkal's century spree in the Vijay Hazare Trophy shows no signs of slowing down. With four hundreds in five innings, the Karnataka opener has firmly pushed himself into India's ODI selection debate."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2026-mustafizur-rahman-kkr-release-madan-lal-dont-mix-politics-sports-2845958-2026-01-03",
      "headline": "Politics should not be mixed with sports: Madan Lal on Mustafizur Rahman's IPL chaosFormer India cricketer Madan Lal claims the BCCI was arm-twisted into forcing KKR to release Mustafizur Rahman. He warns politics is intruding into sport, leaving players unfairly caught amid sensitive cross-border tensions and controversies debates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hardik-pandya-34-run-over-parth-rekhade-vidarbha-68-ball-100-vijay-hazare-trophy-2845947-2026-01-03",
      "headline": "Hardik Pandya misses 6 sixes in an over, slams 68-ball 100 in Vijay HazareHardik Pandya slammed a 68-ball century for Baroda in the Vijay Hazare Trophy 2025–26. During his innings he took on Vidarbha's Parth Rekhade, hitting him for 34 runs in an over."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mayank-yadav-bowling-fitness-progress-lucknow-super-giants-ipl-injury-update-2845941-2026-01-03",
      "headline": "Injury-prone pace sensation Mayank Yadav attains 90 percent bowling fitness: ReportsMayank Yadav is close to regaining full bowling fitness after a prolonged injury layoff, a development that has lifted hopes of a strong comeback with Lucknow Super Giants this season."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-arm-twisted-into-removing-bangladesh-mustafizur-rahman-from-ipl-madan-lal-2845925-2026-01-03",
      "headline": "BCCI arm-twisted into removing Bangladesh's Mustafizur Rahman from IPL: Madan LalFormer India cricketer Madan Lal has stated that sports should not be mixed with politics, reacting to the BCCI's request for KKR to release Bangladesh pacer Mustafizur Rahman from their squad ahead of the 2026 Indian Premier League season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-food-poisoning-punjab-vijay-hazare-trophy-match-absence-2845916-2026-01-03",
      "headline": "Shubman Gill misses Punjab's Vijay Hazare Trophy game due to food poisoningIndia captain Shubman Gill missed Punjab's Vijay Hazare Trophy match due to food poisoning. His condition is minor, and he is expected to play in the upcoming New Zealand ODI series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kkr-release-mustafizur-rahman-bangladesh-pacer-ipl-2026-bcci-instruction-2845907-2026-01-03",
      "headline": "After BCCI directive, KKR release Bangladesh cricketer Mustafizur RahmanThree-time champions Kolkata Knight Riders have released Bangladesh pacer Mustafizur Rahman from their squad for the Indian Premier League 2026 season following a directive from the Board of Control for Cricket in India. The development comes amid recent off-field considerations, prompting the league's governing body to ask the franchise to part ways with the left-arm seamer."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}