{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/paytm-new-upi-onboard-approval-national-payments-corporation-of-india-one97-communications-2621562-2024-10-23",
      "headline": "Paytm gets approval from National Payments Corporation to onboard new UPI usersThe approval is subject to adherence to all NPCI procedural guidelines and circulars, including guidelines and circulars issued specifically on risk management, brand guidelines for app and QR, multi-bank guidelines, among others."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-disney-mega-media-merger-approved-competition-commission-of-india-published-report-2621353-2024-10-22",
      "headline": "Reliance-Disney merger approved, parties agree not to bundle cricket ad slotsA detailed order approving the mega media assets merger of Reliance Industries and Walt Disney was published by the Competition Commission of India on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/imf-projection-for-india-holds-gdp-growth-steady-at-7-percent-for-fy25-65-percent-for-fy26-2621332-2024-10-22",
      "headline": "IMF holds India's GDP growth steady at 7% for FY25, 6.5% for FY26The International Monetary Fund (IMF) suggests that the initial demand surge following the pandemic is now easing, with the economy returning to a more normal state."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/worried-ai-might-replace-you-survey-will-change-your-mind-adecco-global-workforce-of-future-2024-2621289-2024-10-22",
      "headline": "Worried AI might replace you? This survey will change your mindThe latest findings from Adecco Group's 'Global Workforce of the Future 2024' report offer a contrasting view of how artificial intelligence (AI) is influencing workplaces, compared to common perceptions. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/not-just-smog-but-onions-too-will-leave-you-teary-eyed-this-diwali-2621250-2024-10-22",
      "headline": "Not just smog but onions too will leave you teary-eyed this DiwaliOnions are currently selling for Rs 60-80 per kg in retail markets, and the impact of weather disruptions is likely to keep prices elevated. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-q2-results-net-profit-jumps-389-percent-to-rs-176-crore-revenue-jumps-rs-4799-crore-2621199-2024-10-22",
      "headline": "Zomato Q2 results: Profit soars 389% to Rs 176 crore, revenue jumps 68%Zomato Q2 results: The strong bottom-line performance can be attributed to rising food delivery margins and the quick commerce segment, which is nearing break-even. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-crashes-over-900-points-nifty-drops-below-crucial-support-level-2621167-2024-10-22",
      "headline": "Sensex crashes over 900 points, Nifty drops below crucial support levelThe S&P BSE Sensex lost 930.55 points to end at 80,220.72, while the NSE Nifty50 was down 309 points to close at 24,472.10. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-meltdown-today-sensex-down-930-points-nifty-plunges-s-2621159-2024-10-22",
      "headline": "Stock market meltdown: Why Sensex tanked over 900 points todayStock market today: At the closing bell, Sensex plunged 930.55 points to 80,220.72, while the Nifty fell 309 points to 24,472.10. The sharp decline wiped out over Rs 9 lakh crore in the BSE's market capitalisation, leaving many investors reeling."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/has-adar-poonawalla-hit-bulls-eye-with-dharma-productions-acquisition-50-percent-stake-karan-johar-2621119-2024-10-22",
      "headline": "Has Adar Poonawalla hit bull's eye with Dharma Productions acquisition?Dharma Productions, established in 1976 by producer Yash Johar and now overseen by his son Karan Johar, has played a significant role in shaping Hindi cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-chief-madhabi-puri-buch-cleared-investigation-no-action-resignation-government-sources-2621050-2024-10-22",
      "headline": "Opposition's charge against Sebi chief false: Government sourcesSerious allegations of conflict of interest and financial misconduct were levelled against the Sebi chief by US short-seller Hindenburg Research and the Congress party. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ambuja-cement-acquires-orient-cements-for-rs-8100-crore-details-here-2621030-2024-10-22",
      "headline": "Ambuja Cement acquires Orient Cements for Rs 8,100 crore. Details here Ambuja Cement aims to increase its cement production capacity to 100 million tonnes per annum (MTPA) by FY25, with the acquisition adding about 30 MTPA to its total."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/mazagon-dock-shipbuilders-share-price-falls-sharply-stock-split-retail-investors-explained-2621024-2024-10-22",
      "headline": "Mazagon Dock Shipbuilders share price down nearly 9%. Know whyMazagon Dock Shipbuilders stock price: Shares of the company were trading 8.52% lower at Rs 4,268.85 on the Bombay Stock Exchange (BSE) at 12:39 pm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-share-price-down-7-percent-despite-q2fy25-profit-at-rs-930-crore-details-here-2621000-2024-10-22",
      "headline": "Paytm share price plunges 7% despite Q2 profit growth. Here's whyPaytm share price today: The digital payment firm's share price plunged sharply despite the company posting a net profit in the second quarter of the ongoing financial year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-q2fy25-results-strong-growth-revenue-profit-rs-930-crore-2620986-2024-10-22",
      "headline": "Paytm showcases strong growth in revenue, delivers profit of Rs 930 crore in Q2Paytm Q2 results: The quarter also witnessed a steady rise in revenue and contribution profit, reflecting the success of Paytm's strategy of scaling payments and expanding its financial services offerings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-motor-india-stock-market-listing-dalal-street-debut-hold-sell-book-profit-long-term-gains-2620955-2024-10-22",
      "headline": "Hyundai Motor makes weak D-Street debut. Hold for long-term gains or sell now?Hyundai Motor India stock market listing: A long-term ride to profits or time for investors to hit the brakes after its lacklustre debut?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-marginally-higher-led-by-gains-in-bank-and-it-stocks-2620936-2024-10-22",
      "headline": "Sensex, Nifty open marginally higher led by gains in bank and IT stocks The S&P BSE Sensex gained 153.24 points to 81,304.51, while the NIfty50 added 36.80 points to 24,817.90 "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-motor-india-ipo-stock-market-listing-discount-weak-dalal-street-debut-2620933-2024-10-22",
      "headline": "Hyundai Motor India, India's biggest IPO, disappoints on stock market debut Hyundai share market listing: The IPO, which closed with an overall subscription of 2.37 times, saw tepid interest from retail investors, who subscribed to just 50% of their allotted shares."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-ipo-stock-market-bse-nse-share-allotment-investor-2620905-2024-10-22",
      "headline": "Hyundai IPO set for muted stock market debut on BSE, NSEHyundai India Share Price Listing: The IPO, which opened on October 15, faced a slow start, particularly from retail investors, who subscribed to just 50% of their allotted shares."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-prices-surge-past-usd-69000-cryptocurrency-ethereum-whats-driving-rally-us-elections-trump-2620680-2024-10-21",
      "headline": "Bitcoin prices surge past $69,000: What's driving the rally? Bitcoin touched $69,408.1 (roughly Rs 58,35,227) on international exchanges on Monday, marking a recovery after the cryptocurrency was in a price slump for the last three months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-q2-results-net-profit-jumps-21-yoy-to-rs-546-crore-2620612-2024-10-21",
      "headline": "Bajaj Housing Finance Q2 results: Net profit jumps 21% YoY to Rs 546 croreThe revenue from operations also saw a significant rise, with the company reporting Rs 2,410 crore for Q2FY25."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/brics-summit-prime-minister-narendra-modi-china-xi-jinping-bilateral-talks-russia-lac-disengagement-agreement-2621599-2024-10-23",
      "headline": "PM's bilateral with China's Xi at Brics Summit today, days after border truce Live UpdatesThis is PM Modi and Xi Jinping's first formal meeting in five years and also comes just days after India said it reached a truce with China to resume patrolling in disputed areas along the LAC in eastern Ladakh, ending a four-year military standoff."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-under-construction-building-collapse-heavy-rain-waterlogging-deaths-trapped-rescue-operations-2621256-2024-10-22",
      "headline": "5 dead, many trapped as under-construction building collapses in BengaluruAn under-construction building collapsed in Bengaluru amid heavy rain in the city, in which five people have died. Several others are feared trapped as rescue operations are underway."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-state-department-india-meaningful-accountability-investigation-khalistani-terrorist-gurpatwant-singh-pannun-murder-plot-2621584-2024-10-23",
      "headline": "Meaningful accountability from India in Pannun murder plot probe, says USThe latest remarks come a week after State Department spokesperson Matthew Miller said that Washington was \"satisfied\" following a meeting with an Indian inquiry committee set up to probe the Pannun case."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/uddhav-sena-congress-sharad-pawar-mahavikas-aghadi-ncp-seat-sharing-maharashtra-2621321-2024-10-22",
      "headline": "Maha Vikas Aghadi finalises seat-sharing for Maharashtra polls: SourcesThe Congress is likely to contest 104, Uddhav Thackeray's Sena will be allotted 96 seats, and Sharad Pawar's NCP is expected to field candidates in 88 constituencies, sources said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/are-you-drinking-too-much-water-intoxication-2621010-2024-10-23",
      "headline": "Are you drinking too much... water?Drinking water and staying hydrated is beneficial, but drinking too much water can pose risks to your health, potentially leading to water intoxication."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/e-coli-outbreak-mcdonalds-us-states-colorado-quarter-pounder-hamburgers-dead-injured-infection-2621581-2024-10-23",
      "headline": "McDonald's burgers tied to E Coli outbreak in US that killed 1, sickened dozensThe E coli outbreak, linked to one of McDonald's most popular menu items, has killed one person and at least 49 people were reportedly sick after eating the Quarter Pounder hamburger."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/cyclone-dana-odisha-west-bengal-rescue-team-operation-rain-flood-schools-shut-ndrf-2621609-2024-10-23",
      "headline": "Cyclone Dana: Odisha, Bengal begin evacuations, over 30 rescue teams on standby LIVE UPDATESCyclone Dana Update: 20 NDRF teams in Odisha and 14 teams in West Bengal are on standby and educational institutions have been shut, as Cyclone Dana will likely make landfall in Odisha's Puri and Bengal's Sagar Island on Thursday evening."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/story/wayanad-lok-sabha-bye-election-priyanka-gandhi-vadra-nomination-papers-congress-rahul-gandhi-2621564-2024-10-23",
      "headline": "Priyanka Gandhi to file nomination for Wayanad bypolls today, mark political debut Live UpdatesPriyanka Gandhi has been pitted against the BJP's Navya Haridas and senior Communist Party of India (CPI) leader Sathyan Mokeri in the Wayanad Lok Sabha bye-election slated to take place on November 13."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-putin-bilateral-meeting-india-russia-relations-translation-brics-summit-2621217-2024-10-22",
      "headline": "Our ties so close, you wouldn't need translation: Putin's quip makes PM laughPrime Minister Narendra Modi and Russian President Vladimir Putin held a bilateral meeting on the sidelines of the Brics Summit in Kazan. This is PM Modi's second visit to Russia in three months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/elevating-your-career-with-iim-kozhikodes-advanced-operations-analytics-and-supply-chain-management-programme-2621116-2024-10-22",
      "headline": "Elevating Your Career with IIM Kozhikode's Advanced Operations Analytics and Supply Chain Management ProgrammeElevate your career with IIM Kozhikode's comprehensive programme, designed to equip professionals with the latest tools and strategies in operations management and data analytics. Gain hands-on experience through live sessions, capstone projects, and industry-relevant assignments, while accessing the prestigious IIMK Executive Alumni network. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/video/video-worker-rescued-after-under-construction-building-collapses-in-bengaluru-2621613-2024-10-23",
      "headline": "Video: Worker rescued after under-construction building collapses in BengaluruFive people died after an under construction building collapsed in Hennur area in Bengaluru amid heavy rain in the city on Tuesday. Several others are still trapped under the debris of the building. This video shows the rescue personnel rescuing a worker trapped under the debris of the building."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/vikash-yadav-ex-raw-official-lawyer-gurpatwant-singh-pannun-murder-plot-us-charge-2621343-2024-10-22",
      "headline": "Made scapegoat: Lawyers of ex-RAW official charged by US in Pannun murder plotSpeaking to India Today TV, Vikash Yadav's lawyers RK Handoo and Aditya Choudhary said that there was no truth to the allegations levelled against him and that he was being made a scapegoat in international politics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/priyanka-gandhi-meet-greet-with-wayanad-locals-before-filing-nomination-lok-sabha-bypoll-2621601-2024-10-23",
      "headline": "Video: Priyanka Gandhi meet and greet with Wayanad residents before nominationPriyanka Gandhi will be filing her nomination from Wayanad after the seat fell vacant following Rahul Gandhi's decision to retain the Rae Bareli Lok Sabha seat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/heres-a-guide-to-luxury-gifting-for-this-festive-season-2620628-2024-10-21",
      "headline": "Here's a guide to luxury gifting for this festive seasonLuxury Indian gifting is about more than the gift itself, it should be an experience"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/hezbollah-leader-hashem-safieddine-hasan-nasrallah-heir-dead-says-israeli-military-strikes-2621565-2024-10-23",
      "headline": "Hashem Safieddine, Hasan Nasrallah's likely heir, is dead: Israeli militaryThe Israeli military said Safieddine was killed in a strike carried out three weeks ago in Beirut's southern suburbs, its first confirmation of his death. Earlier this month, Israel said he had probably been eliminated."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/celebrity/story/ektaa-kapoor-altbalaji-issues-clarification-in-pocso-case-shobha-kapoor-2621481-2024-10-22",
      "headline": "Ektaa Kapoor's response after Pocso case against her over web seriesEktaa Kapoor's ALTBalaji Telefilms released a statement following a case against the producer and her mother, Shobha Kapoor, under the Pocso Act."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/yash-confirms-kgf-3-prashanth-neel-after-toxic-and-ramayan-2621598-2024-10-23",
      "headline": "Yash confirms KGF 3: Prashanth Neel and I will come up with something massiveYash, in a recent interview, confirmed that KGF: Chapter 3 will be made in the years to come. He said that the project is in discussion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-the-supreme-court-ruling-empowers-children-against-early-marriage-2621297-2024-10-22",
      "headline": "How the Supreme Court ruling empowers children against early marriageThe Court has made state governments responsible for ensuring the law against child marriage becomes a practical tool for protecting children's rights"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/uk-billionaire-calls-for-imran-khans-release-detention-casts-dark-shadow-2621552-2024-10-23",
      "headline": "UK billionaire calls for Imran Khan's release: 'Detention casts dark shadow'British billionaire Richard Branson shared an old photo with former Pakistan Prime Minister Imran Khan and called for his immediate release from prison."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/why-you-like-shalini-passi-her-world-and-her-fabulousness-2621593-2024-10-23",
      "headline": "Why you like Shalini Passi, her world, and her fabulousnessShalini Passi is fiery and fantastic. In Fabulous Lives vs Bollywood Wives, she becomes the meat and the might of the show. One I-don't-give-a-damn-moment at a time! "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-virat-kohli-magical-82-mcg-t20-world-cup-2022-on-this-day-2621600-2024-10-23",
      "headline": "Virat Kohli's MCG masterclass helps India down Pakistan in game for agesOn October 23, 2022, Virat Kohli delivered one of the most iconic performances in T20 World Cup history, leading India to an improbable four-wicket victory over arch-rivals Pakistan at the Melbourne Cricket Ground. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/brics-summit-pm-narendra-modi-xi-jinping-dinner-concert-vladimir-putin-russia-kazan-video-2621557-2024-10-23",
      "headline": "Watch: PM Modi, China's Xi attend dinner concert hosted by Putin for Brics leadersPrime Minister Narendra Modi and Chinese President Xi Jinping on Tuesday were seen sharing space at the dinner concert hosted for Brics nation's leaders by Russian President Vladimir Putin in Kazan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/shiv-sena-maharashtra-polls-eknath-shinde-to-contest-from-kopri-pachpakhadi-2621543-2024-10-22",
      "headline": "Shinde Sena releases list of 45 candidates for Maharashtra pollsChief Minister Eknath Shinde has decided to contest from the Kopri-Pachpakhadi seat, as per the list of candidates released on Tuesday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/odisha-government-day-menstrual-leave-order-women-staff-casual-leaves-mohan-charan-manjhi-2621561-2024-10-23",
      "headline": "Odisha announces 1 day of menstrual leave per month for women staffWomen employees of the Odisha government will now get an additional 12 days of casual leave (CL) annually, apart from the 15 days they get currently."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sidharth-malhotra-protects-kiara-advani-from-crowd-after-manish-malhotras-diwali-party-watch-2621642-2024-10-23",
      "headline": "Sidharth protects wife Kiara from crowd after Manish Malhotra's Diwali partySiddharth Malhotra and Kiara Advani were mobbed after Manish Malhotra's Diwali party. Kiara will star in War 2 and a new love story with Sidharth, blending romance and fantasy.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/yash-toxic-postponed-actor-explains-complications-and-challenges-2621628-2024-10-23",
      "headline": "Yash's Toxic postponed, actor explains 'complications and challenges' Kannada actor Yash confirmed the release of his upcoming film Toxic has been delayed. The film was set to hit the theatres in April 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/neelam-kothari-chunky-panday-bike-accident-burnt-her-leg-wanted-to-kill-him-2621614-2024-10-23",
      "headline": "Neelam Kothari 'wanted to kill' Chunky Panday after he lost control of bike on setActor Neelam Kothari recalls an accident with Chunky Panday while filming the 1987 film Aag Hi Aag, during which she burned her leg. She is currently seen in the third season of Fabulous Lives of Bollywood Wives, streaming on Netflix."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/what-makes-prabhas-the-beloved-family-hero-despite-his-mass-action-image-happy-birthday-prabhas-2621577-2024-10-23",
      "headline": "What makes Prabhas the beloved family hero despite his mass action image?As Prabhas celebrates his 45th birthday today, October 23, here's decoding what makes him a pan-Indian family hero, irrespective of all the larger-than-life action roles that he's known to take on the screen. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/mikel-arteta-concerned-riccardo-calafiori-arsenal-injury-2621641-2024-10-23",
      "headline": "Mikel Arteta concerned after Riccardo Calafiori joins Arsenal injury listArsenal's injury woes deepened after Riccardo Calafiori was forced to leave the pitch during their win over Shakhtar Donetsk in the second half, with manager Mikel Arteta calling the situation \"not great news.\""
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyer-calls-out-fake-news-about-him-missing-ranji-trophy-2621615-2024-10-23",
      "headline": "Shreyas Iyer calls out social media user for spreading fake newsShreyas Iyer, fresh off a century against Maharashtra, has dismissed reports of a shoulder injury ruling him out of the next Ranji match. Shreyas criticised the social media user for spreading false information and confirmed his availability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-india-vs-new-zealand-pune-test-2621612-2024-10-23",
      "headline": "Kohli's 254* rocks South Africa: Last time India played a Test in Pune IND vs NZ: Virat Kohli scored an unbeaten 254 when India last played a Test match in Pune against South Africa back in October 2019. India's Test against New Zealand in Pune starts on October 24. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/india-vs-germany-preview-head-to-head-squads-harmanpreet-singh-new-delhi-2621362-2024-10-23",
      "headline": "India aim for Olympics 2024 revenge against Germany as hockey returns to DelhiHockey makes a grand return to New Delhi with India set to face Germany in a 2-Test series after a decade. India will be aiming for revenge against Germany for their Olympics heartbreak in what is expected to be a thrilling series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-tour-of-australia-squad-october-28-pujara-in-fray-2621608-2024-10-23",
      "headline": "India squad for Australia likely on October 28: Will Pujara get another chance?The Indian cricket selectors are set to announce the squad for the Test series against Australia, with Cheteshwar Pujara's potential inclusion being a focal point. Despite not playing since last year, Pujara's recent domestic performance could secure him a spot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-virat-kohli-magical-82-mcg-t20-world-cup-2022-on-this-day-2621600-2024-10-23",
      "headline": "Virat Kohli's MCG masterclass helps India down Pakistan in game for agesOn October 23, 2022, Virat Kohli delivered one of the most iconic performances in T20 World Cup history, leading India to an improbable four-wicket victory over arch-rivals Pakistan at the Melbourne Cricket Ground. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vienna-open-dominic-thiem-retires-luciano-darderi-2621594-2024-10-23",
      "headline": "Thiem bows out of professional tennis after losing in Vienna OpenFormer World No.1 Dominic Thiem lost in straight sets to Luciano Darderi in the Vienna Open. Thiem lost the match 6-7 (6), 2-6 at the Vienna Stadhalle Arena. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/champions-league-real-madrid-beat-dortmund-5-2-vinicius-hat-trick-2621590-2024-10-23",
      "headline": "Vinicius treble helps Real Madrid to overcome Dortmund 5-2 Real Madrid fought back from two goals down as Vinicius Jr grabbed a hat-trick in a thrilling 5-2 win over visitors Borussia Dortmund in the Champions League on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ban-vs-sa-dhaka-test-kyle-verreynne-wiaan-mulder-dane-piedt-kagiso-rabada-2621554-2024-10-23",
      "headline": "BAN vs SA: Kyle Verreynne rates Dhaka hundred as 'best innings of his career'South Africa wicketkeeper batter Kyle Verreynne rated his hundred in the first Test against Bangladesh as the best knock of his career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mitchell-santner-set-to-lead-new-zealand-in-white-ball-series-vs-sri-lanka-2621538-2024-10-22",
      "headline": "Mitchell Santner set to lead New Zealand in white ball series vs Sri LankaNew Zealand all-rounder Mitchell Santner has been named the interim captain for the white-ball series against Sri Lanka in November."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-virat-kohli-magical-82-mcg-t20-world-cup-2022-on-this-day-2621600-2024-10-23",
      "headline": "Virat Kohli's MCG masterclass helps India down Pakistan in game for agesOn October 23, 2022, Virat Kohli delivered one of the most iconic performances in T20 World Cup history, leading India to an improbable four-wicket victory over arch-rivals Pakistan at the Melbourne Cricket Ground. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vienna-open-dominic-thiem-retires-luciano-darderi-2621594-2024-10-23",
      "headline": "Thiem bows out of professional tennis after losing in Vienna OpenFormer World No.1 Dominic Thiem lost in straight sets to Luciano Darderi in the Vienna Open. Thiem lost the match 6-7 (6), 2-6 at the Vienna Stadhalle Arena. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/champions-league-real-madrid-beat-dortmund-5-2-vinicius-hat-trick-2621590-2024-10-23",
      "headline": "Vinicius treble helps Real Madrid to overcome Dortmund 5-2 Real Madrid fought back from two goals down as Vinicius Jr grabbed a hat-trick in a thrilling 5-2 win over visitors Borussia Dortmund in the Champions League on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ban-vs-sa-dhaka-test-kyle-verreynne-wiaan-mulder-dane-piedt-kagiso-rabada-2621554-2024-10-23",
      "headline": "BAN vs SA: Kyle Verreynne rates Dhaka hundred as 'best innings of his career'South Africa wicketkeeper batter Kyle Verreynne rated his hundred in the first Test against Bangladesh as the best knock of his career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mitchell-santner-set-to-lead-new-zealand-in-white-ball-series-vs-sri-lanka-2621538-2024-10-22",
      "headline": "Mitchell Santner set to lead New Zealand in white ball series vs Sri LankaNew Zealand all-rounder Mitchell Santner has been named the interim captain for the white-ball series against Sri Lanka in November."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ill-tell-virat-rohit-sharma-obliges-to-fans-request-while-giving-autograph-pune-2621542-2024-10-22",
      "headline": "I'll tell Virat: Rohit Sharma obliges to fan's request while giving autographRohit Sharma delighted fans with his humble gesture, signing an autograph and promising to pass along a heartfelt message to Virat Kohli. Moments like these show how cricket stars go the extra mile to connect with their passionate supporters beyond the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/diego-forlan-uruguay-open-manchester-united-atletico-madrid-2621499-2024-10-22",
      "headline": "Former Manchester United star Diego Forlan set to make tennis debut in Uruguay Former Uruguay and Manchester United player Diego Forlan will compete in doubles at the professional Uruguay Open tennis tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-rohit-sharma-ind-vs-nz-pune-test-2621495-2024-10-22",
      "headline": "IND vs NZ: Gautam Gambhir, Rohit Sharma inspect Pune pitch ahead of 2nd TestIndia head coach Gautam Gambhir and captain Rohit Sharma were seen inspecting the pitch during their practice session at the Maharashtra Cricket Association Stadium, Pune ahead of second Test vs New Zealand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/video/aim-is-to-build-core-group-for-world-cup-and-olympics-2028-coach-craig-fulton-2621426-2024-10-22",
      "headline": "Aim is to build core group for World Cup and Olympics 2028: Coach Craig FultonIndian men's hockey coach Craig Fulton shared on Tuesday that he has begun working on developing a new core group of players, with long-term goals focused on the World Cup 2026 and the 2028 Los Angeles Olympics. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/new-zealand-confident-about-their-plans-ahead-of-pune-test-daryl-mitchell-2621441-2024-10-22",
      "headline": "New Zealand confident about their plans ahead of Pune Test: Daryl MitchellNew Zealand all-rounder Daryl Mitchell opened up on the team's approach on the spinning surfaces of India and revealed that  they're confident of their plans keeping in mind the threats every pitch will pose."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/manoj-tiwary-gautam-gambhir-rohit-sharma-ind-vs-nz-bengaluru-test-2621427-2024-10-22",
      "headline": "Lacking common sense: Manoj Tiwary takes dig at Rohit Sharma-Gautam Gambhir comboFormer India cricketer Manoj Tiwary slammed the Indian head coach Gautam Gambhir and captain Rohit Sharma for lacking common sense during the first Test against New Zealand in Bengaluru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-name-squad-for-bangladesh-odi-series-zadran-and-mujeeb-ruled-out-2621420-2024-10-22",
      "headline": "Afghanistan name squad for Bangladesh ODI series: Zadran and Mujeeb ruled outAfghanistan annouced a 19-member squad for the three-match ODI series against Bangladesh, starting November 6 in the UAE. Opening batter Sediqullah Atal and left-arm wrist-spinner Noor Ahmad are the two new additions to the team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/sultan-of-johor-cup-india-continue-unbeaten-run-with-4-2-win-over-malaysia-2621419-2024-10-22",
      "headline": "Sultan of Johor Cup: India continue unbeaten run with 4-2 win over MalaysiaThe Indian Junior Men's Hockey Team showcased their dominance with a 4-2 victory over Malaysia, securing their third consecutive win in the Sultan of Johor Cup. This victory places them at the top of the points table, reinforcing their status as strong title contenders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/new-zealand-confident-about-their-plans-ahead-of-pune-test-daryl-mitchell-2621441-2024-10-22",
      "headline": "New Zealand confident about their plans ahead of Pune Test: Daryl MitchellNew Zealand all-rounder Daryl Mitchell opened up on the team's approach on the spinning surfaces of India and revealed that  they're confident of their plans keeping in mind the threats every pitch will pose."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/manoj-tiwary-gautam-gambhir-rohit-sharma-ind-vs-nz-bengaluru-test-2621427-2024-10-22",
      "headline": "Lacking common sense: Manoj Tiwary takes dig at Rohit Sharma-Gautam Gambhir comboFormer India cricketer Manoj Tiwary slammed the Indian head coach Gautam Gambhir and captain Rohit Sharma for lacking common sense during the first Test against New Zealand in Bengaluru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-name-squad-for-bangladesh-odi-series-zadran-and-mujeeb-ruled-out-2621420-2024-10-22",
      "headline": "Afghanistan name squad for Bangladesh ODI series: Zadran and Mujeeb ruled outAfghanistan annouced a 19-member squad for the three-match ODI series against Bangladesh, starting November 6 in the UAE. Opening batter Sediqullah Atal and left-arm wrist-spinner Noor Ahmad are the two new additions to the team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/sultan-of-johor-cup-india-continue-unbeaten-run-with-4-2-win-over-malaysia-2621419-2024-10-22",
      "headline": "Sultan of Johor Cup: India continue unbeaten run with 4-2 win over MalaysiaThe Indian Junior Men's Hockey Team showcased their dominance with a 4-2 victory over Malaysia, securing their third consecutive win in the Sultan of Johor Cup. This victory places them at the top of the points table, reinforcing their status as strong title contenders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/one-thing-i-am-worried-about-sarfaraz-khan-brad-hogg-suspects-weakness-vs-bounce-2621414-2024-10-22",
      "headline": "One thing I am worried about Sarfaraz Khan: Brad Hogg suspects weakness vs bounceBard Hogg suspected Sarfaraz Khan's weakness against bounce with his hands keeping low while facing the pacers. His remarks came ahead of the impending Border Gavaskar Trophy series, with chances of Sarfaraz facing the likes of Pat Cummins, Josh Hazledwood and Mitchell Starc. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-rawalpindi-harry-brook-pitch-assessment-3rd-test-2621411-2024-10-22",
      "headline": "God knows! Harry Brook's cheeky assessment of pitch for Rawalpindi Test Pakistan vs England: Star batter Harry Brook said he expects the Rawalpindi pitch to be vastly different from how it was in 2022. England are heading into the series finale after losing the second Test on a dry pitch in Multan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dance-group-quick-style-reviews-virat-kohlis-moves-after-viral-video-2621364-2024-10-22",
      "headline": "Dance group Quick Style reviews Virat Kohli's moves after viral collaborationQuick Style members reviewed Virat Kohli's dance moves after their collaboration from last year, which sent the fans into frenzy. The members said that Kohli was really down to earth and danced more than they expected. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-new-zealand-2nd-test-ryan-ten-doeschate-press-conference-pune-2621342-2024-10-22",
      "headline": "No point sugarcoating, Sarfaraz and KL Rahul fighting for a spot: DoeschateSpeaking to the press in the lead-up to the second Test in Pune, India's assistant coach Ryan ten Doeschate said India have a healthy headache when it comes to their batting unit. He said Sarfaraz Khan and KL Rahul are fighting for the No. 6 spot in the XI. Shubman Gill, who missed the first Test due to a stiff neck, will return to the second Test in Pune, starting October 24. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}