{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/government-to-ban-all-money-based-gaming-transactions-under-online-gaming-bill-sources-2773674-2025-08-19",
      "headline": "Centre to ban all money-based gaming transactions under new bill: SourcesUnder the proposed Regulation & Promotion of Online Gaming Act, banks and financial institutions will not be allowed to process or transfer funds for real-money online games."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-up-370-points-nifty-above-24950-adani-ports-tata-motors-among-top-gainers-2773517-2025-08-19",
      "headline": "Sensex, Nifty close higher on GST buzz, easing global tensionsThe S&P BSE Sensex gained 370.64 points, while the NSE Nifty50 rose 103.70 points to settle at 24,980.65. Broader markets also ended in the green, with mid- and small-cap stocks outperforming."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/pm-viksit-bharat-rozgar-yojana-who-can-get-rs-15000-and-other-benefits-2773508-2025-08-19",
      "headline": "PM Viksit Bharat Rozgar Yojana: Who can get Rs 15,000 and other benefitsFirst-time employees under Part A can receive a one-time incentive equal to about one month's basic pay, up to Rs 15,000, paid in two instalments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/two-retirees-rs-2-crore-each-yet-one-runs-out-of-money-early-ca-explains-why-2773436-2025-08-19",
      "headline": "Two retirees, Rs 2 crore each, yet one runs out of money early. CA explains whyTwo retirees may have the same Rs 2 crore in savings, but their financial journeys can differ drastically. A CA explains how market timing and sequencing risk can decide who runs out of money first."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-reform-overhaul-two-slab-structure-done-deal-or-not-2773431-2025-08-19",
      "headline": "Are next-gen GST reforms a done deal?The next-gen GST overhaul could redefine India's tax landscape, but consensus among states and revenue concerns will decide its fate. For now, GST 2.0 is a promise, not a done deal. Read to know why."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-u-explained-check-eligibility-deadline-and-penalties-for-updated-returns-2773383-2025-08-19",
      "headline": "ITR-U explained: Check eligibility, deadline, and penalties for updated returnsThe Central Board of Direct Taxes (CBDT) has made it simpler for taxpayers to correct errors in their income tax returns through the updated ITR-U. Here's a guide on who can file, the deadline, and possible penalties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-you-should-wait-until-october-for-big-purchases-explains-expert-2773330-2025-08-19",
      "headline": "Why you should wait until October for big purchases, explains expertIf you've been planning to buy a car, air conditioner, or other expensive items, it might be wise to hold off for a few weeks. Expert says waiting until October could save you money thanks to upcoming GST reforms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/lower-gst-better-than-income-tax-relief-for-your-wallet-savings-2773328-2025-08-19",
      "headline": "Why lower GST is better for your wallet than income tax reliefUnlike income tax, which applies only to those earning above a certain threshold, GST is an indirect tax levied on almost every transaction, covering nearly everything you buy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-semiconductor-complex-fire-1989-impact-and-indigenous-chip-production-plan-2773326-2025-08-19",
      "headline": "How the SCL fire in Mohali sabotaged India's chip dreamsThe blaze caused losses estimated at Rs 75 crore in 1989, but the true cost the nation would pay would be known decades later."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/ola-electric-share-price-rising-today-explained-2773263-2025-08-19",
      "headline": "Explained: Why Ola Electric shares rose 7% in early tradeOla Electric's rising share price appears to be a result of renewed investor optimism, driven by the company's ambitious EV targets and gigafactory plans, but sustaining momentum will depend on market share recovery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-opens-over-150-points-higher-nifty-above-24900-ril-jumps-nearly-2-2773238-2025-08-19",
      "headline": "Sensex, Nifty gain as GST reforms buzz keeps investor sentiment bullishAt 9:21 am, the S&P BSE Sensex climbed 150.78 points to 81,424.53, while the NSE Nifty50 gained 38.15 points to 24,915.10. Most broader market indices also traded in the green during early deals, indicating improved investor sentiment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/next-generation-gst-reforms-will-reduce-tax-burden-boost-growth-chief-economic-advisor-2773229-2025-08-19",
      "headline": "Next-generation GST reforms will reduce tax burden, boost growth: CEAChief Economic Advisor Dr. V Anantha Nageshwaran said the GST overhaul, coupled with earlier tax cuts, will lower consumer costs, ease inflation, and boost disposable incomes, calling it a transformative step in India's eight-year tax reform journey"
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-diplomat-season-3-release-date-out-new-teaser-flawed-president-2773734-2025-08-19",
      "headline": "The Diplomat Season 3 release date out: New teaser introduces a flawed PresidentThe new teaser of 'The Diplomat Season 3' has been released along with the date announcement. Global diplomacy and foreign negotiations get tougher this time, led by a flawed President in the White House."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-boman-irani-mourn-achyut-potdar-death-3-idiots-actor-2773706-2025-08-19",
      "headline": "Achyut Potdar dies: Aamir Khan, Boman Irani pay last respects to 3 Idiots co-starActors Aamir Khan and Boman Irani mourned the death of veteran actor Achyut Potdar. They paid their last respects to their '3 Idiots' co-star."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dhanashree-verma-yuzvendra-chahal-court-divorce-proceedings-tshirt-controversy-2773694-2025-08-19",
      "headline": "Dhanashree Verma on divorce with Yuzvendra Chahal: I started howling in courtChoreographer Dhanashree Verma shared that she had an emotional breakdown during her divorce proceedings with cricketer Yuzvendra Chahal. She also reacted to her ex-husband's controversial T-shirt that said 'Be Your Sugar Daddy.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mammootty-comeback-mahesh-narayanan-film-september-release-2773578-2025-08-19",
      "headline": "Actor Mammootty to resume shoot after taking a break due to health complicationsMalayalam actor Mammootty, who had recently faced some health complications, has recovered completely and will be joining the sets of his upcoming film with Mahesh Narayanan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/shruti-haasan-south-stars-humble-god-fearing-compared-to-bollywood-rajinikanth-coolie-2773666-2025-08-19",
      "headline": "Shruti Haasan says South stars are more humble, God-fearing, compared to BollywoodShruti Haasan discusses the cultural and psychological differences between South Indian cinema and Bollywood. She reflects on how humility and spirituality shape her approach to acting and her career choices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bosco-martis-shah-rukh-khan-national-award-win-bollywood-without-him-would-not-be-same-2773696-2025-08-19",
      "headline": "Bosco Martis on SRK's National Award win: Bollywood without him would not be sameChoreographer Bosco Martis reflected on Shah Rukh Khan's National Award win. In an exclusive interaction with India Today, he stated how the industry will never be the same without him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/apoorva-mukhija-cryptic-response-ex-boyfrioend-utsav-dahiya-cute-little-red-flag-song-2773577-2025-08-19",
      "headline": "Influencer Apoorva Mukhija reacts to ex-partner's hate songInfluencer Apoorva Mukhija indirectly reacted to the song 'Cute little red flag' by her ex Utsav Dahiya, on Monday, August 18. In the song, Dahiya accused the influencer of lying, cheating, and using their relationship for content. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepika-padukone-100-day-shoot-atlee-pan-india-film-all-you-need-to-know-2773661-2025-08-19",
      "headline": "Deepika Padukone to begin 100-day shoot for Atlee's film - all you need to knowActor Deepika Padukone will commence a 100-day shoot for Atlee's film. The pan-India project would feature Padukone in an action-packed warrior avatar. She is paired opposite actor Allu Arjun in the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/thama-teaser-desi-vampire-story-ayushmann-rashmika-diwali-2025-2773497-2025-08-19",
      "headline": "Thama hidden gems: Moments you might have missed in Ayushmaan-Rashmika's film teaserThe Thama teaser introduces a unique desi vampire romance starring Ayushmann Khurrana and Rashmika Mandanna. The film promises a fresh take on horror and is set to release this Diwali. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pala-suresh-kerala-mimicry-artist-dies-aged-53-2773640-2025-08-19",
      "headline": "Malayalam actor Pala Suresh dies of cardiac arrest at 53Suresh Krishna, popularly known as Pala Suresh, reportedly had a heart condition and was undergoing treatment at Kottayam Medical College. He was found in an unresponsive state at his residence and was pronounced dead upon arrival at the hospital."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/salman-khan-sonali-bendre-prem-preeti-reunion-exclusive-bigg-boss-19-premiere-2773572-2025-08-19",
      "headline": "Exclusive: Salman, Sonali's Prem-Preeti reunion on Bigg Boss 19 - Here's all we knowActor Salman Khan will be joined by his 'Hum Saath-Saath Hain' co-star Sonali Bendre at 'Bigg Boss 19' premiere. Sonali will be present at the show to promote her new reality series 'Pati Patni Aur Panga'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/explained-direct-action-day-noakhali-riots-at-the-heart-of-the-bengal-files-2773665-2025-08-19",
      "headline": "Explained: Direct Action Day, Noakhali riots at the heart of The Bengal FilesAs Vivek Agnihotri's film 'The Bengal Files' sparks debate, a look back at the violence of Direct Action Day and the Noakhali riots that shaped Bengal's partition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priya-bapat-on-bollywood-journey-stereotype-maharashtrian-identity-andhera-prime-video-2773635-2025-08-19",
      "headline": "Andhera actor Priya Bapat urges filmmakers not to typecast her in BollywoodActor Priya Bapat, in an exclusive conversation with India Today, spoke about being stereotyped in Bollywood. Proud of her Maharashtrian roots, the actor discussed how she wants to be seen beyond her identity. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/zakir-khan-madison-square-garden-performance-just-soften-global-borders-for-indian-comedy-2773463-2025-08-19",
      "headline": "Indian comedy's global debut? Zakir Khan may have just set the stageZakir Khan's historic Hindi comedy show at Madison Square Garden marks a proud moment for Indian stand-up on the global stage. This breakthrough signals a new era where Indian humour, rooted in culture and relatability, is set to become a major cultural export like Bollywood."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-confirmed-contestants-ashnoor-gaurav-awez-nagma-2773617-2025-08-19",
      "headline": "Bigg Boss 19 confirmed contestants include Ashnoor Kaur, Gaurav Khanna and moreBigg Boss 19 is set to start on August 24 with Salman Khan as the host. The season features 15 confirmed celebrity contestants, which includes names like Gaurav Khanna, Ashnoor Kaur and Awez–Nagma."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/taarak-mehta-ka-ooltah-chashmah-welcome-new-family-asit-kumarr-modi-teases-fun-gokuldham-2773521-2025-08-19",
      "headline": "Taarak Mehta to welcome new family, Asit Kumarr Modi teases more fun at Gokuldham'Taarak Mehta Ka Ooltah Chashmah' team is set to welcome a new family to the Gokuldham society. The show's creator, Asit Kumarr Modi, promised more entertainment. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-jimin-enjoys-beach-day-with-v-after-missing-movie-weeks-clip-2773573-2025-08-19",
      "headline": "BTS' Jimin enjoys beach day with V after his absence from Movie Weeks clip. WatchBTS ARMY were left stunned and emotional after a newly released band's Movie Weeks clip excluded Jimin's solo segment, prompting widespread disappointment and debate across social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/vishal-bhardwaj-recalls-working-with-priyanka-chopra-on-kaminey-sets-2773528-2025-08-19",
      "headline": "Vishal Bhardwaj says he wrote poem on tissue for Priyanka Chopra to lift her moodFilmmaker Vishal Bhardwaj fondly recalls writing a poem on a tissue to cheer up Priyanka Chopra during the shooting of their film 'Kaminey', which completed 16 years of release on August 14. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rukmini-vasanth-role-kantara-chapter-1-dram-come-true-2773512-2025-08-19",
      "headline": "Rukmini Vasanth says bagging a role in Kantara Chapter 1 was a dream come trueActor Rukmini Vasanth joined the cast of 'Kantara: Chapter 1'.  She described the opportunity as a dream come true as she shared the excitement and challenges of keeping the project a secret."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/government-to-introduce-bills-in-lok-sabha-tomorrow-on-removal-of-pm-chief-minister-arrested-for-30-days-2773799-2025-08-19",
      "headline": "Centre to bring bills on removal of PM, chief ministers arrested on serious chargesThe government is set to introduce bills regarding the removal of the Prime Minister and chief ministers arrested for 30 days, tomorrow in Lok Sabha."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mumbai-monorail-breaks-down-amid-heavy-rain-passengers-stuck-inside-train-being-evacuated-2773692-2025-08-19",
      "headline": "Video: Mumbai monorail breaks down amid heavy rain, 582 rescued after 4 hoursThe monorail services in Mumbai was disrupted amid heavy rain between Chembur and Bhakti Park. The passengers dialled the BMC helpline number following which fire brigade officials arrived at the scene. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/india-profiteering-from-russian-crude-us-treasury-secretary-scott-bessent-renews-attack-2773699-2025-08-19",
      "headline": "India profiteering from Russian crude: US Treasury Secretary renews attackIn the past 10 days, US Treasury Secretary Scott Bessent has repeatedly targeted India for its energy trade with Russia."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/mumbai/story/mumbai-heavy-rains-waterlogging-imd-red-alert-bmc-school-offices-holiday-work-from-home-2773291-2025-08-19",
      "headline": "Mumbai gets 300 mm rain in a day, Devendra Fadnavis warns next 48 hours critical  Live UpdatesAccording to Flightradar, 253 outbound and 163 inbound flights at Mumbai Airport were delayed, while Central Railway trains ran 20-30 minutes late."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/will-pakistan-army-chief-field-marshal-asim-munir-test-a-nuclear-weapon-2773618-2025-08-19",
      "headline": "Will Field Marshal Munir test a nuclear weapon?Army, Allah, America and the circumstances that will lead Field Marshal Asim Munir to invoke the fourth A - Atomic Weapons. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/government-approves-rs-62000-crore-deal-for-97-indigenous-light-combat-aircraft-2773785-2025-08-19",
      "headline": "Government approves Rs 62,000-crore deal to buy 97 Light Combat Aircraft Mark 1AThe new order will help the Indian Air Force phase out its ageing MiG-21 fleet, which is set to be retired in the coming weeks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jammu-and-kashmir-reorganisation-bill-restoring-statehood-lok-sabha-parliament-2773751-2025-08-19",
      "headline": "Omar Abdullah's cryptic Harry Potter meme amid J&K statehood bill buzzJammu and Kashmir Chief Minister Omar Abdullah appeared to have reacted cryptically to speculation about a bill to restore the region's statehood, sharing a Professor Snape dialogue: 'I can't take any more of this'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/narendra-modi-set-for-sco-summit-how-fragile-border-peace-tests-india-china-thaw-2773605-2025-08-19",
      "headline": "Modi set for SCO Summit, how fragile border peace tests India-China thaw\"Differences must not become disputes nor competition conflicts,\" external affairs minister S. Jaishankar has emphasised to his visiting Chinese counterpart Wang Yi"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/passengers-stuck-inside-the-mumbai-monorail-recalls-their-ordeal-of-being-stuck-for-over-an-hour-2773754-2025-08-19",
      "headline": "It was terrible, we were all so scared: Passengers recall Mumbai monorail chaosPassengers claimed that they were stuck for over an hour inside the crowded rake before being rescued. They also claimed that the train was overloaded with passengers as it arrived after a gap of 30 minutes. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/government-to-ban-all-money-based-gaming-transactions-under-online-gaming-bill-sources-2773674-2025-08-19",
      "headline": "Centre to ban all money-based gaming transactions under new bill: SourcesUnder the proposed Regulation & Promotion of Online Gaming Act, banks and financial institutions will not be allowed to process or transfer funds for real-money online games."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/prime-minister-narendra-modi-meets-chinese-foreign-minister-wang-yi-meets-after-high-level-talks-in-delhi-2773678-2025-08-19",
      "headline": "Steady progress in ties guided by respect, says PM on meeting China's Wang YiPrime Minister Narendra Modi on Tuesday met Chinese Foreign Minister Wang Yi in New Delhi after his talks with NSA Ajit Doval and External Affairs Minsiter S Jaishankar. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ncert-releases-special-module-on-operation-sindoor-for-classes-3-to-12-2773735-2025-08-19",
      "headline": "NCERT releases special module on Operation Sindoor for classes 3 to 12The NCERT module mentions that Operation Sindoor, launched in May this year, was India's \"strong and clear response to the cowardly attack\" on tourists in Pahalgam in April. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/mumbai-rain-memes-jokes-x-users-reactions-viral-posts-gifs-weather-update-2773684-2025-08-19",
      "headline": "As Mumbai drowns in rain, X users ride the wave with memesMumbai Rain Memes: As Mumbai reeled under heavy rains and waterlogging, social media users turned the chaos into comedy. From lost chappals floating across the suburbs to jokes about office commutes, memes flooded the timelines."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-bloc-vice-president-pick-sudershan-reddy-jurist-salwa-judum-telangana-caste-census-important-cases-explained-2773537-2025-08-19",
      "headline": "Sudershan Reddy the jurist: From Salwa Judum verdict to Telangana caste censusFrom striking down Chhattisgarh's Salwa Judum militia, aimed at countering Naxalite activities with local tribal recruits, as unconstitutional, to criticising the Union government in 2011 for its laxity in investigating black money cases, the Opposition's VP pick, Sudershan Reddy, has been a jurist known for his firm stands. Most recently, as an expert, Reddy steered the Revanth Reddy-led Telangana caste census."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-squad-asia-cup-t20-shubman-gill-jasprit-bumrah-2773502-2025-08-19",
      "headline": "Shubman Gill vice-captain, Jasprit Bumrah in as India announce Asia Cup squadShubman Gill has been named vice-captain to Suryakumar Yadav as India announced their 15-member squad for the upcoming Asia Cup in the UAE. The eight-team tournament will be held from September 9 to 28, with India placed in Group A alongside Oman, Pakistan, and the UAE."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/howrah-pet-licensing-pet-owners-foreign-mixed-breed-dogs-west-bengal-2773743-2025-08-19",
      "headline": "Howrah to make dog licences mandatory for foreign and mixed-breed pets soonHowrah Municipal Corporation will soon introduce a mandatory licencing system in September for owners of foreign and mixed-breed dogs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/explained-direct-action-day-noakhali-riots-at-the-heart-of-the-bengal-files-2773665-2025-08-19",
      "headline": "Explained: Direct Action Day, Noakhali riots at the heart of The Bengal FilesAs Vivek Agnihotri's film 'The Bengal Files' sparks debate, a look back at the violence of Direct Action Day and the Noakhali riots that shaped Bengal's partition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/maharashtra/video/video-two-locals-swim-through-flooded-thane-underpass-to-rescue-people-stuck-in-car-2773748-2025-08-19",
      "headline": "Video: Two locals swim through flooded Thane underpass to rescue people stuck in carTwo people stuck inside their car in a waterlogged underpass near Narivali in Thane district on Monday were rescued by two locals who swam into the middle of the underpass to rescue them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sudershan-reddy-india-bloc-vice-president-pick-andhra-not-tamil-nadu-opposition-throws-a-twist-in-veep-battle-2773441-2025-08-19",
      "headline": "With Sudershan Reddy, INDIA bloc's googly in vice-presidential contest with NDASources said the decision to field a candidate of \"great credibility outside the political sphere\" was intended to make it harder for regional parties to oppose."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/the-living-dead-of-democracy-has-election-commission-failed-bihar-2773445-2025-08-19",
      "headline": "The 'living dead' of democracy: Has EC failed Bihar?Rahul Gandhi's tea with 'the dead' is a metaphor: Bihar's citizens were held to the strictest standards to prove they were alive. Declaring them dead needed just a shrug"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/gen-z-is-bringing-parents-to-job-interviews-letting-them-talk-to-managers-study-2773591-2025-08-19",
      "headline": "Gen Z is bringing parents to job interviews, letting them talk to managers: StudyA new study shows 77% of Gen Z jobseekers bring parents to interviews, with many letting them negotiate salaries, email managers, and even intervene in workplace conflicts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/features/story/h-1b-ban-next-india-us-ties-frosty-due-to-trump-comments-maga-talks-of-ban-on-h-1b-visa-2773614-2025-08-19",
      "headline": "India-US ties frosty due to Trump comments, MAGA talks of ban on H-1B VisaEven as US President Donald Trump has ratcheted up his tariff talk against India, his MAGA base is drumming up for one more step to hit India — modify or ban H-1B Visa so that fewer Indians can get jobs in the US."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/mumbai/story/mumbai-rain-weather-update-helicopter-emergency-landing-lonavala-alert-flooding-fog-2773610-2025-08-19",
      "headline": "Pune-based builder's chopper with 6 aboard makes emergency landing amid rain, fogA private helicopter with six people on board made a safe emergency landing on a narrow road near Lonavala in Pune due to poor visibility from heavy rain and fog. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/dragons-classroom-why-chinas-takeover-of-uk-schools-should-worry-indian-parents-2773499-2025-08-19",
      "headline": "Dragon's classroom: Why China's takeover of UK schools should worry Indian parentsChinese investors are buying up Britain's venerable but often financially fragile private schools at an unprecedented rate, and it's time we asked the uncomfortable question: Is this just business, or is it a strategic move by the Chinese Communist Party?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-diplomat-season-3-release-date-out-new-teaser-flawed-president-2773734-2025-08-19",
      "headline": "The Diplomat Season 3 release date out: New teaser introduces a flawed PresidentThe new teaser of 'The Diplomat Season 3' has been released along with the date announcement. Global diplomacy and foreign negotiations get tougher this time, led by a flawed President in the White House."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-boman-irani-mourn-achyut-potdar-death-3-idiots-actor-2773706-2025-08-19",
      "headline": "Achyut Potdar dies: Aamir Khan, Boman Irani pay last respects to 3 Idiots co-starActors Aamir Khan and Boman Irani mourned the death of veteran actor Achyut Potdar. They paid their last respects to their '3 Idiots' co-star."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dhanashree-verma-yuzvendra-chahal-court-divorce-proceedings-tshirt-controversy-2773694-2025-08-19",
      "headline": "Dhanashree Verma on divorce with Yuzvendra Chahal: I started howling in courtChoreographer Dhanashree Verma shared that she had an emotional breakdown during her divorce proceedings with cricketer Yuzvendra Chahal. She also reacted to her ex-husband's controversial T-shirt that said 'Be Your Sugar Daddy.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mammootty-comeback-mahesh-narayanan-film-september-release-2773578-2025-08-19",
      "headline": "Actor Mammootty to resume shoot after taking a break due to health complicationsMalayalam actor Mammootty, who had recently faced some health complications, has recovered completely and will be joining the sets of his upcoming film with Mahesh Narayanan. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/asia-cup-2025-india-squad-selection-fantastic-sunil-gavaskar-exclusive-2773788-2025-08-19",
      "headline": "India have picked a fantastic squad for the Asia Cup: Sunil GavaskarSunil Gavaskar praised India's Asia Cup 2025 squad, lauding its depth in batting and bowling versatility. He also backed Shubman Gill's vice-captaincy, calling it a sign of India grooming their next leader."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-india-government-decision-ind-vs-pak-sunil-gavaskar-2773771-2025-08-19",
      "headline": "Sunil Gavaskar on India vs Pakistan at Asia Cup: Players will go by government decisionSunil Gavaskar believes that the players should not be criticised for their participation at the Asia Cup and highlights that they are only following the directives of the BCCI which are given the green light by the Indian government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammad-kaif-on-axar-patels-removal-from-vice-captaincy-2773757-2025-08-19",
      "headline": "Axar Patel deserves an explanation for removal from vice-captaincy: Mohammad KaifFormer India cricketer-turned commentator Mohammad Kaif has said that Axar Patel deserves an explanation from the team management for his removal from the vice captaincy of the T20I side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-shubman-gill-vice-captain-inclusion-good-decision-sunil-gavaskar-exclusive-2773752-2025-08-19",
      "headline": "Shubman Gill destined to lead India after Asia Cup vice-captaincy: GavaskarSunil Gavaskar has backed Shubman Gill's appointment as India's Asia Cup vice-captain, calling it a step towards his future captaincy. Gavaskar praised Gill's form, leadership skills, and temperament, stressing his inevitable rise as an all-format leader."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-withdraws-us-open-mixed-doubles-illness-2773742-2025-08-19",
      "headline": "Jannik Sinner pulls out of inaugural US Open mixed doubles competitionWorld No 1 Jannik Sinner has withdrawn from the US Open mixed doubles event due to illness. The Italian star had retired from his final against Carlos Alcaraz in Cincinnati Masters on Monday, August 18. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wasm-akram-oline-gambling-probed-complained-reports-illegal-promotion-2773717-2025-08-19",
      "headline": "Wasim Akram accused of promoting online gambling app: ReportsFormer Pakistan captain Wasim Akram faces a legal complaint in Lahore for allegedly endorsing a foreign online betting app, with authorities confirming an investigation under the Electronic Crimes Act 2016 after social media evidence surfaced."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-shubman-gill-all-format-captain-inclusion-vice-captain-aakash-chopra-2773709-2025-08-19",
      "headline": "Shubman Gill India's next all-format captain? Chopra on Asia Cup inclusionShubman Gill's return as India's vice-captain sparks debates ahead of the Asia Cup, with Aakash Chopra seeing him as a future all-format leader, but his spot in the playing XI remains a tricky puzzle."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-on-shreyas-iyers-asia-cup-2025-snub-2773697-2025-08-19",
      "headline": "R Ashwin shocked by Shreyas Iyer's Asia Cup snub: What wrong has he done?Former India all-rounder Ravichandran Ashwin has questioned the selectors for not picking Shreyas Iyer in the squad for the Asia Cup 2025. Iyer wasn't selected despite a strong show in the IPL and the Syed Mushtaq Ali Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-jitesh-sharma-comeback-suryakumar-yadav-2773698-2025-08-19",
      "headline": "Comeback man Jitesh Sharma gets big vote of confidence from team managementAsia Cup 2025: Captain Suryakumar Yadav and chief selector Ajit Agarkar backed Jitesh Sharma's inclusion, saying the wicketkeeper-batter deserved to return to the T20I fold after a b breakthrough IPL season with Royal Challengers Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-south-africa-1st-odi-keshav-maharaj-cairns-2773677-2025-08-19",
      "headline": "Keshav Maharaj spins South Africa to emphatic win in ODI series openerAUS vs SA: Keshav Maharaj's brilliant spell of 5 for 33 powered South Africa to a commanding 98-run win over Australia in the first ODI at Cairns. Aiden Markram, Temba Bavuma and Matthew Breetzke shone with the bat before Maharaj ripped through Australia's middle order. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-india-squad-shafali-verma-renuka-singh-talking-points-2773632-2025-08-19",
      "headline": "Shafali snubbed, Renuka returns: Talking points from India Women's World Cup squadIndia named their 15-member squad for the Women's ODI World Cup 2025, with Harmanpreet Kaur as captain and Smriti Mandhana as vice-captain. The tournament begins on September 30, and with home advantage, India will chase their first-ever title after twice finishing runners-up.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-shubman-gill-all-format-captain-inclusion-vice-captain-aakash-chopra-2773709-2025-08-19",
      "headline": "Shubman Gill India's next all-format captain? Chopra on Asia Cup inclusionShubman Gill's return as India's vice-captain sparks debates ahead of the Asia Cup, with Aakash Chopra seeing him as a future all-format leader, but his spot in the playing XI remains a tricky puzzle."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-on-shreyas-iyers-asia-cup-2025-snub-2773697-2025-08-19",
      "headline": "R Ashwin shocked by Shreyas Iyer's Asia Cup snub: What wrong has he done?Former India all-rounder Ravichandran Ashwin has questioned the selectors for not picking Shreyas Iyer in the squad for the Asia Cup 2025. Iyer wasn't selected despite a strong show in the IPL and the Syed Mushtaq Ali Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-jitesh-sharma-comeback-suryakumar-yadav-2773698-2025-08-19",
      "headline": "Comeback man Jitesh Sharma gets big vote of confidence from team managementAsia Cup 2025: Captain Suryakumar Yadav and chief selector Ajit Agarkar backed Jitesh Sharma's inclusion, saying the wicketkeeper-batter deserved to return to the T20I fold after a b breakthrough IPL season with Royal Challengers Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-south-africa-1st-odi-keshav-maharaj-cairns-2773677-2025-08-19",
      "headline": "Keshav Maharaj spins South Africa to emphatic win in ODI series openerAUS vs SA: Keshav Maharaj's brilliant spell of 5 for 33 powered South Africa to a commanding 98-run win over Australia in the first ODI at Cairns. Aiden Markram, Temba Bavuma and Matthew Breetzke shone with the bat before Maharaj ripped through Australia's middle order. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-india-squad-shafali-verma-renuka-singh-talking-points-2773632-2025-08-19",
      "headline": "Shafali snubbed, Renuka returns: Talking points from India Women's World Cup squadIndia named their 15-member squad for the Women's ODI World Cup 2025, with Harmanpreet Kaur as captain and Smriti Mandhana as vice-captain. The tournament begins on September 30, and with home advantage, India will chase their first-ever title after twice finishing runners-up.\r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}