{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-142-points-higher-nifty-above-24500-bel-gains-2-percent-2794982-2025-09-29",
      "headline": "Sensex opens 142 points higher, Nifty above 24,500; BEL gains 2%The S&P BSE Sensex added 114.15 points to 80,540.61, while the NSE Nifty50 gained 36.45 points to 24,691.15 as of 9:24 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/arattai-zoho-ipo-stock-market-debut-founder-sridhar-vembu-says-listing-clash-company-vision-bharat-2794978-2025-09-29",
      "headline": "Will Zoho go public? Sridhar Vembu says listing may clash with company's visionIn a post on X, Zoho founder Sridhar Vembu said that some of Zoho's key projects, such as its messaging app Arattai, would have never been built under the financial pressures faced by public companies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/lic-gst-exemption-boosts-life-insurance-inflows-1100-crore-2794971-2025-09-29",
      "headline": "LIC sees Rs 1,100 crore inflows on Day 1 of GST-free life cover: ReportLife Insurance Corporation of India (LIC) collected over Rs 1,100 crore in inflows on the first day following the removal of GST on individual life insurance policies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/insurance-sector-issues-india-mis-selling-claim-rejection-irdai-report-star-health-care-health-neil-borate-2794566-2025-09-29",
      "headline": "Insured, but where is the protection?Despite the recent reform of zero GST, insurance remains an opaque industry where customers struggle to understand what they're actually buying."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/home-buying-festive-season-griha-pravesha-important-documents-real-estate-legal-checks-2794915-2025-09-29",
      "headline": "Buying home this festive season? Top things to check before Griha PraveshaFamilies often see this period as the most auspicious time to make a big investment like a home, but experts warn that it is also the stage when due diligence becomes most important."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nirav-modis-brother-in-law-maiank-mehta-pardoned-in-rs-13000-crore-pnb-scam-case-2794352-2025-09-27",
      "headline": "Nirav Modi's brother-in-law Maiank Mehta pardoned in Rs 13,000 crore PNB scam caseA special CBI court granted pardon to Maiank Mehta, brother-in-law of fugitive diamantaire Nirav Modi, in the Rs 13,000 crore Punjab National Bank fraud case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/what-to-expect-from-the-national-stock-exchange-in-the-next-5-years-india-today-conclave-2794051-2025-09-26",
      "headline": "What to expect from the National Stock Exchange in the next 5 years?Ashish Chauhan, CEO of NSE Chauhan, said the rise in investors and market size over the last decade gives a clear idea of the potential ahead. In 2014, India had just 1.67 crore unique investors. Today, there are about 12 crore investors. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/50-tariffs-and-growth-why-india-must-focus-on-reform-not-retaliation-2794039-2025-09-26",
      "headline": "50% tariffs and growth: Why India must focus on reform, not retaliationAt the India Today Conclave Mumbai 2025, experts called for reforms, investment-led growth, and targeted support for vulnerable sectors to navigate challenges from steep US tariffs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/india-stock-market-advantage-vs-global-india-today-conclave-mumbai-ashish-chauhan-nse-ceo-2794031-2025-09-26",
      "headline": "Explained: Why Dalal Street has an edge over global stock marketsAt the India Today Conclave in Mumbai, Ashish Chauhan, CEO of the National Stock Exchange of India (NSE), explained why India's markets and economy hold a stronger position for the future compared to others."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-50-tariffs-to-growth-why-india-needs-reforms-not-retaliation-2794011-2025-09-26",
      "headline": "From 50% tariffs to growth: Why India needs reforms, not retaliationAs the US slaps steep tariffs on Indian goods, the debate is shifting from retaliation to reform. Experts at the India Today Conclave Mumbai 2025 say India should use this moment to push for deeper reforms that fuel investment and boost domestic demand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/how-to-invest-in-pharma-and-it-stocks-during-current-slowdown-2793962-2025-09-26",
      "headline": "How to invest in pharma and IT stocks during current slowdownWith the US announcing fresh tariffs on branded drugs and uncertainty around H-1B visa rules, both sectors are experiencing headwinds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-talks-advance-amid-tariff-and-energy-discussions-2793911-2025-09-26",
      "headline": "India-US trade talks advance amid tariff and energy discussionsIndia-US trade discussions are gaining momentum, with both nations exploring ways to enhance economic cooperation, address tariffs, and boost energy trade."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/amitabh-bachchan-mammootty-india-vs-pakistan-asia-cup-final-2794983-2025-09-29",
      "headline": "India lifts Asia Cup: Amitabh Bachchan to Mammootty, celebs congratulate team India defeated Pakistan by five wickets in the Asia Cup 2025 final. Amitabh Bachchan, Mammootty, Anil Kapoor, Preity Zinta and several other celebrities publicly celebrated the win by posting congratulatory messages."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-new-photo-dump-features-nick-jonas-malti-marie-ishaan-khatter-dia-mirza-2794970-2025-09-29",
      "headline": "Priyanka Chopra's new photo dump features Nick, Malti, Ishaan Khatter, Dia Mirza Priyanka Chopra shared her New York photo dump featuring Nick Jonas, daughter Malti, and industry friends, calling it \"a little fall moment with the people you love.\" She spent quality time with Ishaan Khatter and Dia Mirza."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jr-ntr-says-kantara-chapter-1-would-be-humanly-impossible-without-rishab-shetty-2794969-2025-09-29",
      "headline": "Jr NTR says Kantara Chapter 1 would be humanly impossible without Rishab Shetty Jr NTR praised Rishab Shetty's extraordinary vision and hard work during the Telugu pre-release event of 'Kantara: Chapter 1'. Despite his recent injury, he expressed deep admiration for the film's scale and cultural significance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/ranbir-kapoor-43rd-birthday-daughter-raha-kisses-family-moments-alia-bhatt-2794961-2025-09-29",
      "headline": "43 kisses to best papa Ranbir: Raha's birthday gift and Alia Bhatt's Insta wish Ranbir Kapoor celebrated his 43rd birthday with a special promise from his daughter Raha. Alia Bhatt shared a few glimpses of his birthday from their short holiday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/angad-bedi-best-evening-with-friends-sachin-tendulkar-virender-sehwag-2794952-2025-09-29",
      "headline": "Angad Bedi spends best evening with Sachin Tendulkar, Virender Sehwag and friends Angad Bedi enjoyed one of the most memorable evenings in the best company of cricketing legends, Sachin Tendulkar and Virender Sehwag. Neha Dhupia, his actor-wife, left a hilarious comment on his Instagram post."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/awez-darbar-evicted-bigg-boss-19-audience-votes-2794868-2025-09-28",
      "headline": "Awez Darbar gets evicted from Bigg Boss 19 Digital influencer Awez Darbar has been evicted from 'Bigg Boss 19'. He, along with Pranit More, Ashnoor Kaur, Gaurav Khanna, Neelam Giri and Mridul Tiwari, were nominated for eviction this week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/actor-veer-sharma-brother-shoriya-sharma-kota-fire-death-apartment-death-rajasthan-pushkal-in-sony-sabs-shrimad-ramayan-2794858-2025-09-28",
      "headline": "8-year-old TV actor Veer Sharma, brother die in apartment fire in Rajasthan's Kota A sudden fire broke out in a flat in Kota's Transport Nagar area on Sunday, claiming the lives of two children -- eight-year-old television actor Veer Sharma and his 16-year-old brother, Shoriya Sharma."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranbir-kapoor-cuts-huge-cake-on-43rd-birthday-greets-paps-2794833-2025-09-28",
      "headline": "Ranbir Kapoor cuts huge cake on 43rd birthday, greets paps; video goes viral Ranbir Kapoor celebrated his 43rd birthday with fans, family, and the media, stepping out to cut a cake with paparazzi and receiving warm wishes from Neetu Kapoor and Soni Razdan. A rare video message from the actor, featuring his daughter Raha's voice in the background, added a special touch to the celebrations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pawan-kalyan-they-call-him-og-trade-report-2794835-2025-09-28",
      "headline": "Pawan Kalyan's They Call Him OG reaches Rs 200 crore globally: Trade report They Call Him OG is Power Star Pawan Kalyan's first film to cross the 200-crore mark at the box office worldwide, and the film has done so in three days according to trade report"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ali-fazal-shares-loved-up-instagram-post-for-wife-richa-chadha-2794822-2025-09-28",
      "headline": "My Queen, My Precious: Ali Fazal shares loved-up post for wife Richa Chadha Ali Fazal wrote a sweet note for wife Richa Chadha on Instagram, calling her \"My Queen, My Precious\", leaving the actor touched."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/gauahar-khan-zaid-darbar-share-first-glimpse-of-their-second-son-reveal-name-2794804-2025-09-28",
      "headline": "Gauahar Khan, Zaid Darbar share first glimpse of their second son, reveal name Gauahar Khan and Zaid Darbar have named their newborn son Farwaan, nearly a month after his birth on September 1. The actor shared the announcement with a sweet photo of her elder son Zehaan introducing his little brother."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/ekta-kapoor-says-entourage-is-killing-films-calls-censor-much-needed-trouble-2794777-2025-09-28",
      "headline": "Ektaa Kapoor says entourage is killing films, calls censor much-needed trouble Ektaa Kapoor, the queen of Indian TV, discussed women breaking industry norms, challenges like censor rules and entourage costs, and affirms TV's strength in the digital era as she readies the new season of 'Naagin'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/pm-modi-tribute-lata-mangeshkar-zubeen-garg-mann-ki-baat-2794756-2025-09-28",
      "headline": "PM Modi pays tributes to Lata Mangeshkar and Zubeen Garg in Mann Ki Baat PM Modi paid an emotional tribute to playback legend Lata Mangeshkar on her birthday on Sunday, and hailed late singer Zubeen Garg during his radio show, Mann Ki Baat"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/120-bahadur-teaser-special-tribute-lata-mangeshkar-birth-anniversary-farhan-akhtar-2794734-2025-09-28",
      "headline": "120 Bahadur teaser out as special tribute on Lata Mangeshkar's birth anniversary To mark Lata Mangeshkar's birth anniversary, the makers of '120 Bahadur' released a poignant teaser featuring her iconic song 'Ae Mere Watan Ke Logon'. The film, set during the Rezang La battle, will release in November. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ram-charan-celebrates-18-years-in-cinema-peddi-makers-release-special-poster-2794744-2025-09-28",
      "headline": "Ram Charan celebrates 18 years in cinema, Peddi makers release special poster Tollywood star Ram Charan celebrates 18 years in cinema, with his upcoming film 'Peddi' marking the milestone by releasing a special poster. The film, starring Janhvi Kapoor and featuring music by A.R. Rahman, is halfway through production and has already secured a massive OTT deal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/punjabi-singer-rajvir-jawanda-hospitalised-in-critical-condition-after-bike-accident-2794728-2025-09-28",
      "headline": "Punjabi singer Rajvir Jawanda hospitalised in critical condition after bike accident Punjabi singer Rajvir Jawanda is in critical condition after a motorcycle accident in Himachal Pradesh, sustaining severe head and spine injuries and requiring ventilator support. Fans, fellow artists, and political leaders have expressed concern and prayed for his speedy recovery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-thanks-wife-shalini-for-her-silent-strength-nothing-comes-easy-24h-barcelona-race-2794696-2025-09-28",
      "headline": "Nothing comes easy: Ajith Kumar thanks wife Shalini for her silent strength Ahead of his 24H Barcelona race on September 28, actor Ajith Kumar spoke about the delicate balance between family and passion, crediting wife Shalini's unwavering support. The Tamil superstar also spoke about his love for racing. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/homebound-box-office-collection-day-2-ishaan-khatter-vishal-jethwa-janhvi-kapoor-film-gets-lukewarm-response-2794688-2025-09-28",
      "headline": "Homebound box office day 2: Ishaan's film gets lukewarm response with Rs 50 lakh India's Oscar entry 'Homebound', starring Ishaan Khatter, Vishal Jethwa, and Janhvi Kapoor, has seen a muted response at the domestic box office, earning just Rs 80 lakh so far. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/they-call-him-og-box-office-collection-day-3-pawan-kalyan-film-crosses-rs-120-crore-mark-2794692-2025-09-28",
      "headline": "They Call Him OG box office day 3: Pawan Kalyan's film crosses Rs 120 crore mark  Pawan Kalyan's 'They Call Him OG' has emerged as a box office hit, earning over Rs 120 crore in India and becoming his highest-grossing film. The action-drama, also starring Emraan Hashmi and Priyanka Mohan, performed strongly despite mixed reviews."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/vijays-plea-in-high-court-today-over-karur-rally-stampede-bomb-threat-at-his-chennai-home-top-developments-2794962-2025-09-29",
      "headline": "Karur stampede: High Court to hear Vijay's TVK's plea today amid blame gameTVK has filed a plea before the Madras High Court's Madurai Bench seeking a CBI or SIT probe into the tragedy, while a victim has moved the court to restrain the party from holding further rallies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-president-donald-trump-attend-defence-meeting-quantico-defence-secretary-pete-hegseth-2794957-2025-09-29",
      "headline": "Photo op or pep talk? Trump's surprise entry at top generals' meet sparks buzzLast week, Defence Secretary Pete Hegseth summoned hundreds of generals and admirals, including senior commanders of the one-star rank or higher and their top advisers, to the Marine Corps base in Quantico, Virginia, with little notice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-asia-cup-trophy-fiasco-mohsin-naqvi-suryakumar-gill-hardik-2794941-2025-09-29",
      "headline": "No trophy, no problem: Surya leads Asia Cup celebration with photoshopped picsIndia stars added a trophy emoticon to their celebration pics to mock Mohsin Naqvi after the PCB chief ran away with the Asia Cup title on Sunday, September 28. The Indian players said they won't accept the trophy from Naqvi at the post-match presentation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/video/heartbroken-father-cradles-lifeless-child-moment-of-karur-stampede-horror-2794857-2025-09-28",
      "headline": "Wailing father carrying son's body – Gut-wrenching video of Karur stampede tragedyHeart-wrenching cries amid the eerie silence of death filled Karur General Hospital on Saturday evening as both the injured and the dead were rushed in from the stampede site at Vijay's political rally. Among the victims were several children. A haunting visual of a grief-stricken father carrying his lifeless child at the hospital stood as a stark testimony to the horror of the evening.\r\n\r\nBy Sunday evening, the death toll in the stampede now stood at 40 with 10 children."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-final-standpoint-india-pakistan-trophy-controversy-handshake-2794958-2025-09-29",
      "headline": "Asia Cup: India win. Pakistan do a Pakistan. Cricket suffersAsia Cup 2025 promised tension, yet the final sank to an unprecedented low when India, the victors, were denied the trophy. Celebrations continued in an empty stadium, but the episode showed how egos and off-field drama can overshadow the game. If this becomes the template for India-Pakistan clashes, cricket itself will bear the cost.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/arattai-zoho-ipo-stock-market-debut-founder-sridhar-vembu-says-listing-clash-company-vision-bharat-2794978-2025-09-29",
      "headline": "Will Zoho go public? Sridhar Vembu says listing may clash with company's visionIn a post on X, Zoho founder Sridhar Vembu said that some of Zoho's key projects, such as its messaging app Arattai, would have never been built under the financial pressures faced by public companies."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/south/story/tvk-vijay-rally-stampede-feared-dead-actor-thalapathy-vijay-rally-minister-senthil-balaji-hospital-injured-2794464-2025-09-27",
      "headline": "Live: No power cut during Vijay's Karur rally, says Tamil Nadu governmentVijay rally stampede updates: At least 40 people died, and many others were injured after a stampede broke out during a political rally of TVK chief Vijay in Tamil Nadu's Karur on Saturday evening. The victims included women and children, while those who fainted during the commotion were taken to the nearest hospital for treatment. The Tamil Nadu government announced Rs 10 lakh each for the families of the victims, and also constituted an enquiry commission to probe the incident. Stay tuned for the latest updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-kolkatas-durga-puja-stage-has-a-new-political-actor-in-abhishek-banerjee-2794631-2025-09-28",
      "headline": "How Kolkata's Durga Puja stage has a new political actor in Abhishek BanerjeeFor Abhishek, who keeps a low profile during Puja season, the decision signals both the countdown to Bengal polls and his gradual assumption of command of the TMC\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/vijay-rally-stampede-karur-tamil-nadu-inquiry-ordered-video-victims-families-tvk-dmk-2794866-2025-09-28",
      "headline": "Videos capture moments of panic, tragedy of Karur stampedeHarrowing videos from the Karur rally captured the horror of the deadly stampede, showing grieving parents with lifeless children, frantic cries, and shock-stricken crowds as dozens, including women and children, lost their lives."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/boy-hung-upside-down-beaten-at-haryana-school-case-against-principal-staff-panipat-school-viral-video-2794986-2025-09-29",
      "headline": "Boy hung upside down, beaten at Haryana school; case against principal, staffPolice have booked the driver under serious IPC sections and the Juvenile Justice Act, while the incident has triggered outrage over child safety and corporal punishment in schools."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/i-love-muhammad-controversy-kanpur-police-arrest-ex-constable-political-links-to-samajwadi-party-emerge-2794954-2025-09-29",
      "headline": "Kanpur police arrest ex-cop in 'I love Muhammad' row, Samajwadi Party links emergeKanpur police have arrested ex-constable Zubair Khan, accused of inciting violence. His photographs with SP's Kanpur district president Fazal Mehmood have now gone viral on social media, sparking political debate over his affiliations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-says-real-chance-for-greatness-in-middle-east-hints-at-something-special-glbs-2794930-2025-09-29",
      "headline": "All on board for something special: Trump's big hint on Middle EastUS President Donald Trump hinted at significant progress on the Middle East crisis and a possible Gaza deal. The discussions may impact the ongoing war and hostage negotiations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/insurance-sector-issues-india-mis-selling-claim-rejection-irdai-report-star-health-care-health-neil-borate-2794566-2025-09-29",
      "headline": "Insured, but where is the protection?Despite the recent reform of zero GST, insurance remains an opaque industry where customers struggle to understand what they're actually buying."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/arattai-reaches-no-1-in-app-stores-zoho-says-working-hard-to-expand-servers-2794636-2025-09-28",
      "headline": "WhatsApp meets its match? Arattai races to no 1 in India app storesArattai has surpassed WhatsApp and surges to the top of India's app stores. The app's success highlights growing user demand for local digital platforms amid global scrutiny of the tech industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/shooter-opens-fire-at-michigan-church-multiple-victims-reported-building-engulfed-in-flames-2794854-2025-09-28",
      "headline": "4 dead, 8 injured in US church firing incident, Trump calls it attack on ChristiansThe incident took place at the Church of Jesus Christ of Latter-day Saints in Grand Blanc, a community located about 50 miles north of Detroit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-donates-asia-cup-fees-indian-army-beat-pakistan-final-2794931-2025-09-29",
      "headline": "Suryakumar Yadav pledges his entire Asia Cup match fee to Indian armyIndia captain Suryakumar Yadav announced he will donate all Asia Cup 2025 match fees to the Indian Army following their victory over Pakistan. The triumph was overshadowed by India refusing to accept the trophy from Pakistan's interior minister Mohsin Naqvi, creating unprecedented controversy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/ranbir-kapoor-43rd-birthday-daughter-raha-kisses-family-moments-alia-bhatt-2794961-2025-09-29",
      "headline": "43 kisses to best papa Ranbir: Raha's birthday gift and Alia Bhatt's Insta wishRanbir Kapoor celebrated his 43rd birthday with a special promise from his daughter Raha. Alia Bhatt shared a few glimpses of his birthday from their short holiday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-fresher-hiring-in-indian-it-is-muted-despite-bigger-talent-pool-from-h1b-curbs-2794620-2025-09-28",
      "headline": "Why fresher hiring in Indian IT is muted despite bigger talent pool from H1B curbsThe broad outlook is that headwinds and macroeconomic uncertainties will continue to hit the intake of freshers by the IT sector \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-backs-statehood-demand-activist-sonam-wangchuk-says-ladakh-is-under-attack-by-bjp-2794893-2025-09-29",
      "headline": "Ladakh under attack by BJP: Rahul Gandhi backs statehood demand, Sonam WangchukOn September 24, peaceful protests being held under the leadership of activist Songam Wangchuk turned violent as protesters resorted to arson and vandalism by torching the local BJP office and a few vehicles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-pak-gautam-gambhir-goes-wild-slams-table-in-delight-tilak-varma-six-2794909-2025-09-29",
      "headline": "Watch: Gambhir goes wild, slams table in delight as Tilak whacks Rauf for sixIndia head coach Gautam Gambhir was seen at his ecstatic best as he slammed the table in delight after Tilak Varma's massive six against Haris Rauf in the Asia Cup final against Pakistan."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tamil-nadu-karur-stampede-vijay-fan-frenzy-preventable-team-knew-deaths-39-children-stalin-crowd-management-2794676-2025-09-28",
      "headline": "Karur disaster was foretold. Vijay's team knew of stampede risk over a year agoA stampede at TVK chief and superstar Vijay's rally in Tamil Nadu's Karur killed 40 people. About 1.5 years ago, Vijay's team members told India Today Digital that getting Thalapathy Vijay to campaign would be a challenge given the fan frenzy surrounding him. They knew of the stampede risk. Even political observers feared it. The real tragedy is that 40 lives were lost despite this awareness. As politician Vijay can't give up campaigning, preparedness will be the key in a country that is prone to crowd surges and stampedes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-suryakumar-yadav-not-out-of-form-out-of-runs-comeback-explains-press-conference-2794943-2025-09-29",
      "headline": "Suryakumar plays down horror run in Asia Cup: Not out of form, just short of runsSuryakumar Yadav dismissed concerns about his form after India's Asia Cup 2025 triumph, stressing he is only short on runs. The skipper remains confident his preparation and leadership will soon translate into match-winning performances with the bat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-trade-talks-india-brazil-market-access-tariffs-negotiations-2794617-2025-09-28",
      "headline": "Need to fix India, stop actions harming US interests: Trump aide's new threatTaking a potshot at India and Brazil, US Commerce Secretary Howard Lutnick said that these countries need to do more to open their markets and stop taking actions that harm US interests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/actor-veer-sharma-brother-shoriya-sharma-kota-fire-death-apartment-death-rajasthan-pushkal-in-sony-sabs-shrimad-ramayan-2794858-2025-09-28",
      "headline": "8-year-old TV actor Veer Sharma, brother die in apartment fire in Rajasthan's KotaA sudden fire broke out in a flat in Kota's Transport Nagar area on Sunday, claiming the lives of two children -- eight-year-old television actor Veer Sharma and his 16-year-old brother, Shoriya Sharma."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/asia-cup-2025-india-vs-pakistan-final-sunil-gavaskar-reaction-2794977-2025-09-29",
      "headline": "Asian champions India best team in the T20 format: Sunil Gavaskar Sunil Gavaskar claimed that India are the best team in the world when it comes to the T20 format after their thrilling win against Pakistan in the Asia Cup 2025 final on Sunday, September 28. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-haris-rauf-run-machine-india-vs-pakistan-wasim-akram-slams-pcb-2794975-2025-09-29",
      "headline": "Haris Rauf a run-machine vs India, entire Pakistan criticises him: Wasim Akram Haris Rauf was slammed by Wasim Akram after leaking crucial runs in the Asia Cup final against India. Despite Pakistan's hopes, Rauf's refusal to play red-ball cricket and repeated run-conceding spells drew national criticism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-final-tilak-varma-knock-gavaskar-reaction-2794968-2025-09-29",
      "headline": "Did Tilak Varma play Asia Cup 2025's best knock in final? Sunil Gavaskar reacts Sunil Gavaskar heaped praise on Tilak Varma's match-winning knock in the final against Pakistan which helped India win the Asia Cup trophy. Tilak remained unbeaten and saved India from a rough spot during the run-chase. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-final-standpoint-india-pakistan-trophy-controversy-handshake-2794958-2025-09-29",
      "headline": "Asia Cup: India win. Pakistan do a Pakistan. Cricket suffers Asia Cup 2025 promised tension, yet the final sank to an unprecedented low when India, the victors, were denied the trophy. Celebrations continued in an empty stadium, but the episode showed how egos and off-field drama can overshadow the game. If this becomes the template for India-Pakistan clashes, cricket itself will bear the cost.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-suryakumar-yadav-rohit-sharma-strut-trophy-snub-mohsin-naqvi-2794953-2025-09-29",
      "headline": "Watch: Surya mimics Rohit's iconic celebration, but without Asia Cup trophy Suryakumar Yadav mimicked Rohit Sharma's iconic celebration after winning the Asia Cup 2025 final against Pakistan on Sunday, September 28. However, Suryakumar was forced to pull off the celebration without the trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-suryakumar-yadav-not-out-of-form-out-of-runs-comeback-explains-press-conference-2794943-2025-09-29",
      "headline": "Suryakumar plays down horror run in Asia Cup: Not out of form, just short of runs Suryakumar Yadav dismissed concerns about his form after India's Asia Cup 2025 triumph, stressing he is only short on runs. The skipper remains confident his preparation and leadership will soon translate into match-winning performances with the bat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-asia-cup-trophy-fiasco-mohsin-naqvi-suryakumar-gill-hardik-2794941-2025-09-29",
      "headline": "No trophy, no problem: Surya leads Asia Cup celebration with photoshopped pics India stars added a trophy emoticon to their celebration pics to mock Mohsin Naqvi after the PCB chief ran away with the Asia Cup title on Sunday, September 28. The Indian players said they won't accept the trophy from Naqvi at the post-match presentation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/asia-cup-acc-official-runs-away-trophy-india-snub-mohsin-naqvi-pcb-ceremony-2794940-2025-09-29",
      "headline": "Watch: ACC official bolts with Asia Cup trophy after India snub Mohsin Naqvi on stage India vs Pakistan, Asia Cup final: An ACC official was seen rushing away with the Asia Cup trophy on instructions from PCB and ACC chief Mohsin Naqvi, after the Indian team snubbed him from presenting it during the post-match ceremony."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/salman-agha-press-conference-india-disrespecting-crickrt-2794935-2025-09-29",
      "headline": "India disrespected cricket: Pak captain on Asia Cup handshake row, trophy drama Pakistan cricket captain Salman Agha criticised India in the post-match press conference after the Asia Cup final. Agha claimed that India were disrespecting cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-trophy-controversy-india-vs-pakistan-mohsin-naqvi-devajit-saikia-2794934-2025-09-29",
      "headline": "PCB chief Mohsin Naqvi ran away with Asia Cup trophy, says BCCI secretary BCCI secretary Devajit Saikia took a sharp dig at PCB head Mohsin Naqvi after the Asia Cup final on Sunday. He said that Naqvi went away to his hotel room with the Asia Cup trophy after India won the title by beating Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-donates-asia-cup-fees-indian-army-beat-pakistan-final-2794931-2025-09-29",
      "headline": "Suryakumar Yadav pledges his entire Asia Cup match fee to Indian army India captain Suryakumar Yadav announced he will donate all Asia Cup 2025 match fees to the Indian Army following their victory over Pakistan. The triumph was overshadowed by India refusing to accept the trophy from Pakistan's interior minister Mohsin Naqvi, creating unprecedented controversy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-asia-cup-trophy-fiasco-mohsin-naqvi-suryakumar-gill-hardik-2794941-2025-09-29",
      "headline": "No trophy, no problem: Surya leads Asia Cup celebration with photoshopped pics India stars added a trophy emoticon to their celebration pics to mock Mohsin Naqvi after the PCB chief ran away with the Asia Cup title on Sunday, September 28. The Indian players said they won't accept the trophy from Naqvi at the post-match presentation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/asia-cup-acc-official-runs-away-trophy-india-snub-mohsin-naqvi-pcb-ceremony-2794940-2025-09-29",
      "headline": "Watch: ACC official bolts with Asia Cup trophy after India snub Mohsin Naqvi on stage India vs Pakistan, Asia Cup final: An ACC official was seen rushing away with the Asia Cup trophy on instructions from PCB and ACC chief Mohsin Naqvi, after the Indian team snubbed him from presenting it during the post-match ceremony."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/salman-agha-press-conference-india-disrespecting-crickrt-2794935-2025-09-29",
      "headline": "India disrespected cricket: Pak captain on Asia Cup handshake row, trophy drama Pakistan cricket captain Salman Agha criticised India in the post-match press conference after the Asia Cup final. Agha claimed that India were disrespecting cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-trophy-controversy-india-vs-pakistan-mohsin-naqvi-devajit-saikia-2794934-2025-09-29",
      "headline": "PCB chief Mohsin Naqvi ran away with Asia Cup trophy, says BCCI secretary BCCI secretary Devajit Saikia took a sharp dig at PCB head Mohsin Naqvi after the Asia Cup final on Sunday. He said that Naqvi went away to his hotel room with the Asia Cup trophy after India won the title by beating Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-donates-asia-cup-fees-indian-army-beat-pakistan-final-2794931-2025-09-29",
      "headline": "Suryakumar Yadav pledges his entire Asia Cup match fee to Indian army India captain Suryakumar Yadav announced he will donate all Asia Cup 2025 match fees to the Indian Army following their victory over Pakistan. The triumph was overshadowed by India refusing to accept the trophy from Pakistan's interior minister Mohsin Naqvi, creating unprecedented controversy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-asia-cup-final-trophy-controversy-mohsin-naqvi-suryakumar-yadav-2794929-2025-09-29",
      "headline": "Asia Cup champions India were denied trophy: Suryakumar YadavThe Indian team did not lift the winner's trophy after the final of the Asia Cup 2025. Asked what happened, Suryakumar Yadav said that the Indian team were denied the Asia Cup trophy by Asian Cricket Council, the organisers of the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/watch-india-celebrate-asia-cup-win-without-trophy-on-stage-in-dubai-2794926-2025-09-29",
      "headline": "Watch: India celebrate Asia Cup win without trophy on stage in DubaiAsia Cup champions India on Sunday refused to accept the winners' trophy from ACC chairman Mohsin Naqvi, who is also Pakistan's interior minister and chairman of the country's cricket board. The Indian players celebrated with their fans, posed for photographs, but left the stadium without the trophy, creating a striking image of champions without their silverware."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-ind-vs-pak-final-india-refuse-trophy-presentation-mohsin-naqvi-2794920-2025-09-29",
      "headline": "India refuse Asia Cup trophy from PCB chief, celebrate empty-handed on stageAsia Cup 2025 final, Ind vs Pak: In one of the most bizarre scenes in cricket history, the victorious Indian team celebrated without the trophy on the dais in Dubai. Suryakumar Yadav said India were denied the trophy after it emerged that the team refused to collect it from Pakistan Cricket Board chief Mohsin Naqvi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-bcci-announces-rs-21-crore-cash-reward-for-victorious-indian-team-2794918-2025-09-29",
      "headline": "Asia Cup: BCCI announces Rs 21 crore cash reward for victorious Indian teamThe Board of Control for Cricket in India (BCCI) declared a cash reward of Rs 21 crore for the Indian squad and support staff after Suryakumar Yadav's men defeated Pakistan by five wickets in a thrilling Asia Cup 2025 final, securing their ninth continental title on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-pak-gautam-gambhir-goes-wild-slams-table-in-delight-tilak-varma-six-2794909-2025-09-29",
      "headline": "Watch: Gambhir goes wild, slams table in delight as Tilak whacks Rauf for sixIndia head coach Gautam Gambhir was seen at his ecstatic best as he slammed the table in delight after Tilak Varma's massive six against Haris Rauf in the Asia Cup final against Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-beat-pakistan-win-trophy-pm-narendra-modi-operation-sindoor-2794904-2025-09-29",
      "headline": "Op Sindoor on games field: PM Modi celebrates India beating Pak in Asia Cup finalPrime Minister Narendra Modi termed India's five-wicket win over Pakistan in the Asia Cup final as \"Operation Sindoor on the games field,\" saying the outcome remained the same - India wins - as he congratulated the Indian cricketers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-ind-vs-pak-final-score-tilak-varma-suryakumar-title-win-2794898-2025-09-29",
      "headline": "Ind 3-0 Pak. Tilak Varma special inspires India to 9th Asia Cup crownIndia vs Pakistan, Asia Cup 2025 Final: After a riveting display from their spinners, India overcame a top-order collapse to chase down 147 in Dubai. Pakistan paid the price for a reckless batting performance, going down to their arch-rivals for the third successive time in the tournament - including in the game that mattered most."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/harbhajan-singh-hardik-pandya-injury-not-playing-india-vs-pakistan-asia-cup-final-ytvd-2794850-2025-09-28",
      "headline": "Exclusive: Harbhajan Singh on Hardik Pandya not playing Asia Cup finalIn the cricket final between India and Pakistan, a key development is Hardik Pandya's injury, leading to his replacement by Rinku Singh. This has prompted a significant strategic shift, with India entering the match with only one specialist fast bowler, Jasprit Bumrah. On India Today, World Cup winner Harbhajan Singh analysed the decision, stating, \"I would have liked to see Arshadip along with Jasprit Bumrah, to be honest.\" He pointed out that India's win of the toss and decision to chase is a crucial advantage that helps compensate for the altered bowling lineup. The discussion also covered captain Suryakumar Yadav's inconsistent form, the pitch conditions favouring a lower score, and Harbhajan's prediction of an Indian victory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-pak-gautam-gambhir-goes-wild-slams-table-in-delight-tilak-varma-six-2794909-2025-09-29",
      "headline": "Watch: Gambhir goes wild, slams table in delight as Tilak whacks Rauf for sixIndia head coach Gautam Gambhir was seen at his ecstatic best as he slammed the table in delight after Tilak Varma's massive six against Haris Rauf in the Asia Cup final against Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-beat-pakistan-win-trophy-pm-narendra-modi-operation-sindoor-2794904-2025-09-29",
      "headline": "Op Sindoor on games field: PM Modi celebrates India beating Pak in Asia Cup finalPrime Minister Narendra Modi termed India's five-wicket win over Pakistan in the Asia Cup final as \"Operation Sindoor on the games field,\" saying the outcome remained the same - India wins - as he congratulated the Indian cricketers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-ind-vs-pak-final-score-tilak-varma-suryakumar-title-win-2794898-2025-09-29",
      "headline": "Ind 3-0 Pak. Tilak Varma special inspires India to 9th Asia Cup crownIndia vs Pakistan, Asia Cup 2025 Final: After a riveting display from their spinners, India overcame a top-order collapse to chase down 147 in Dubai. Pakistan paid the price for a reckless batting performance, going down to their arch-rivals for the third successive time in the tournament - including in the game that mattered most."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/harbhajan-singh-hardik-pandya-injury-not-playing-india-vs-pakistan-asia-cup-final-ytvd-2794850-2025-09-28",
      "headline": "Exclusive: Harbhajan Singh on Hardik Pandya not playing Asia Cup finalIn the cricket final between India and Pakistan, a key development is Hardik Pandya's injury, leading to his replacement by Rinku Singh. This has prompted a significant strategic shift, with India entering the match with only one specialist fast bowler, Jasprit Bumrah. On India Today, World Cup winner Harbhajan Singh analysed the decision, stating, \"I would have liked to see Arshadip along with Jasprit Bumrah, to be honest.\" He pointed out that India's win of the toss and decision to chase is a crucial advantage that helps compensate for the altered bowling lineup. The discussion also covered captain Suryakumar Yadav's inconsistent form, the pitch conditions favouring a lower score, and Harbhajan's prediction of an Indian victory."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-fails-again-pakistan-asia-cup-final-india-collapse-2794879-2025-09-28",
      "headline": "IND vs PAK: Suryakumar Yadav flops again, draws flak for horrendous run in Asia CupIndia captain Suryakumar Yadav failed to make an impact in the Asia Cup 2025 final against Pakistan. Suryakumar has been in poor form ever since being appointed India's full-time captain."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-yorker-dismisses-haris-rauf-fighter-jet-celebration-asia-cup-final-2794859-2025-09-28",
      "headline": "Watch: Jasprit Bumrah gives it back to Haris Rauf with crashing-jet celebrationAsia Cup final, IND vs PAK: Jasprit Bumrah dismissed Haris Rauf with a near-perfect yorker in the Asia Cup final. His fighter-jet celebration responded to Rauf's earlier gesture, intensifying the off-field tensions between the two teams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-final-ind-vs-pak-sahibzada-farhan-snubs-rifle-celebration-dubai-2794852-2025-09-28",
      "headline": "After ICC warning, Sahibzada snubs rifle celebration despite fifty vs IndiaPakistan's opening batter scored a quick 57 against India in the Asia Cup 2025 final. His silent celebration and key wicket by Varun Chakaravarthy added drama to the high-stakes match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-asia-cup-2025-final-hardik-pandya-injury-rinku-singh-bumrah-changes-2794839-2025-09-28",
      "headline": "India go in Asia Cup final without Pandya, fans question team combinationIndia will play the Asia Cup 2025 final without all-rounder Hardik Pandya due to injury. The team's altered bowling strategy has sparked debate among fans ahead of the summit clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-pakistan-asia-cup-final-2025-rare-feat-ravi-shastri-waqar-younis-2794831-2025-09-28",
      "headline": "Two captains, two presenters: IND vs PAK Asia Cup final features rare double-actThe Asia Cup 2025 final showcased a rare double-act with two captains and presenters at the toss. India went on to win the toss and chose to bowl first in the title-clash"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-final-ind-vs-pak-suryakumar-handshake-salman-ali-photoshoot-snub-2794832-2025-09-28",
      "headline": "Suryakumar snubs handshake and trophy photoshoot with Pakistan captainAsia Cup 2025 final: India captain Suryakumar Yadav avoided shaking hands with Pakistan skipper Salman Ali Agha for the third time in the tournament. Also, Salman posed with the trophy alone before the toss on Sunday in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/aiff-new-constitution-adoption-october-12-supreme-court-fifa-deadline-2794811-2025-09-28",
      "headline": "AIFF set to hold meeting to draft new constitution in line with SC rulingThe AIFF held a special general body meeting on October 12 to adopt a new draft constitution in line with the Supreme Court ruling."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-retain-jaker-ali-anik-captain-litton-das-afghanistan-t20i-series-2794805-2025-09-28",
      "headline": "Litton Das out of Afghanistan T20Is, Jaker Ali retained as Bangladesh captainAFG vs BAN: Bangladesh have retained Jaker Ali Anik as T20I captain against Afghanistan, recalled Soumya Sarkar, and will play the T20Is on Oct 2, 3, 5 in Sharjah, followed by ODIs from Oct 8 to 14.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-agm-2025-mithun-manhas-pragyan-ojha-rp-singh-2794780-2025-09-28",
      "headline": "From Mithun Manhas to Pragyan Ojha: Full list of newly-appointed BCCI officialsThe 94th BCCI AGM in Mumbai announced key office bearers and committee members for 2025-26. The meeting also approved the audited accounts and budget, signalling focused growth in Indian cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/amita-sharma-appointed-womens-selection-panel-chairman-mithun-manhas-bcci-president-2794739-2025-09-28",
      "headline": "Amita Sharma, former India all-rounder, named women's selection panel chairmanAmita Sharma has been appointed chairman of the women's selection panel, replacing Neetu David. Mithun Manhas takes over as BCCI president, signalling new leadership ahead of the Women's World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nepal-historic-win-west-indies-maiden-t20i-series-rohit-paudel-martyrs-protests-2794714-2025-09-28",
      "headline": "NEP vs WI: Skipper Rohit Paudel dedicates Nepal's historic win to martyrs back homeNepal recorded its first-ever win against a Full ICC Member by defeating West Indies in the opening T20I. The victory offers hope amid national unrest following violent protests and social media restrictions."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}