{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-sensex-nifty-open-flat-godrej-consumer-shares-fall-9-percent-paytm-2646911-2024-12-09",
      "headline": "Sensex, Nifty open flat; Godrej consumer shares fall 9%The S&P BSE Sensex was up 37.49 points to 81,746.61, while the NSE Nifty50 gained 21.45 points to 24,699.2. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/upcoming-ipos-vishal-mega-mart-mobikwik-sai-life-sciences-rs-18340-crore-2646906-2024-12-09",
      "headline": "Upcoming IPOs: Vishal Mega Mart, Mobikwik among 5 to raise Rs 18,340 croreFrom retail giant Vishal Mega Mart to players in healthcare, fintech, and jewellery, this week's IPO lineup has something for everyone."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/flipkart-ipo-launch-12-15-months-next-year-2026-first-quarter-e-commerce-report-2646887-2024-12-09",
      "headline": "Flipkart sets sights on IPO launch within 12-15 months: Report The Walmart-owned ecommerce giant has received internal approvals to move its domicile from Singapore to India, a key step toward going public. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-paytm-lt-ultratech-ceat-it-shares-adani-zomato-2646884-2024-12-09",
      "headline": "Stocks to watch today: Paytm, L&T, Ultratech, CEATIn today's session, several stocks, including Ultratech, Paytm, L&T, Biocon, Alembic Pharma, and CEAT, will be in focus due to recent news and developments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-inaugurate-rising-rajasthan-global-investment-summit-jaipur-2646741-2024-12-08",
      "headline": "PM Modi to inaugurate 'Rising Rajasthan Global Investment Summit' tomorrowAiming to bolster investment opportunities in Rajasthan, Prime Minister Narendra Modi to unveil the Rising Rajasthan Global Investment Summit in Jaipur on Monday, December 9. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/unacademy-ceo-gaurav-munjal-denies-reports-of-sale-deal-with-allen-career-institute-2646516-2024-12-07",
      "headline": "Not doing any sale: Unacademy CEO Gaurav Munjal denies reports of takeover dealReports earlier suggested that Allen Career Institute was in talks to acquire Unacademy for $800 million, significantly lower than its peak valuation of $3.4 billion."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/india-can-become-the-ai-capital-of-the-world-metas-sandhya-devanathan-2646252-2024-12-07",
      "headline": "India can become the AI capital of the world: Meta's Sandhya DevanathanSandhya Devanathan, Vice President and Head of India at Meta, discusses the company's AI initiatives, including Meta AI and Llama models. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/we-are-going-to-be-future-ready-priyank-kharge-on-ai-transforming-job-market-2646186-2024-12-06",
      "headline": "We are going to be future ready: Priyank Kharge on AI transforming job marketSharing his thoughts on AI creating a job deficit, Priyank Kharge, Minister of IT and Biotechnology of Karnataka said that technological evolution creates new opportunities rather than eliminating them. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/forging-the-future-cp-gurnani-aditya-ghosh-discuss-ais-role-in-empowering-india-2646110-2024-12-06",
      "headline": "Forging the future: CP Gurnani, Aditya Ghosh discuss AI's role in empowering IndiaCP Gurnani highlighted the necessity of blending AI with human capabilities. Aditya Ghosh emphasised the accessibility of AI, calling this era a \"magical time\" akin to the Industrial Revolution."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/firms-leveraging-ai-to-empower-workforce-on-right-track-says-professor-das-narayandas-2645981-2024-12-06",
      "headline": "Firms using AI to empower workforce likely to excel in future: Professor Das NarayandasSpeaking at the India Today-Business Today AI Conference 2024, during a session titled 'Leadership.Change.AI', he emphasised that organisations focusing on how AI can augment their workforce are likely to emerge as industry leaders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-share-price-52-week-high-factors-behind-strong-rallt-2645945-2024-12-06",
      "headline": "Paytm share price hits 52-week high today. What's driving the rally?Paytm share price: The stock jumped 3.60% to hit a 52-week high of Rs 990.90 on Friday. At the closing bell, the stock settled 1.89% higher at Rs 974.55."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-rbi-mpc-sensex-nifty-end-flat-as-rbi-maintains-status-quo-on-interest-rates-2645938-2024-12-06",
      "headline": "Sensex, Nifty end flat as RBI maintains status quo on interest ratesThe S&P BSE Sensex lost 56.74 points to end at 81,709.12, while the NSE Nifty50 was down 30.60 points to close at 24,677.80. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/insurance-claims-denied-zerodha-ceo-nithin-kamath-explains-why-and-what-you-can-do-2645903-2024-12-06",
      "headline": "Insurance claims denied? Nithin Kamath explains why and what you can doNithin Kamath warns that having insurance doesn't guarantee full claims and lists common rejection reasons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mcx-share-price-hits-rs-7000-milestone-as-stock-rallies-over-8-percent-high-volume-2645915-2024-12-06",
      "headline": " MCX share price hits Rs 7,000 milestone as stock rallies over 8%The stock has delivered an impressive growth trajectory, with gains of over 100% in the past year, over 300% in the last three years, and more than 500% over the last five years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vedanta-share-price-today-jumps-over-6-percent-explained-2645894-2024-12-06",
      "headline": "Explained: Why Vedanta share price jumped over 6% todayThe surge in stock price follows an announcement from Vedanta Resources Finance II PLC, a subsidiary of VRL, that it had redeemed the full amount of $1.2 billion in bonds due in 2025 but extended to 2028."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-announcements-repo-rate-unchanged-homebuyers-may-have-to-wait-till-2025-for-emi-relief-2645893-2024-12-06",
      "headline": "RBI MPC: Homebuyers may have to wait till 2025 for EMI reliefThe RBI has kept key lending rates unchanged with Governor Shaktikanta Das explaining the Monetary Policy Committee's (MPC) focus on economic stability. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-cuts-crr-to-4-how-this-liquidity-boost-will-benefit-the-economy-2645873-2024-12-06",
      "headline": "RBI cuts CRR to 4%: How this liquidity boost will benefit economyThe decision to cut CRR is expected to benefit the banking sector, particularly public sector banks, by lowering the cost of funds and increasing lending capacity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/epfo-extends-deadline-to-activate-uan-for-employment-linked-incentive-eli-scheme-to-december-15-2645519-2024-12-06",
      "headline": "EPFO extends deadline to activate UAN for ELI scheme. Check final dateThe EPFO has extended the deadline to link UAN and Aadhaar under the ELI scheme to mid-December, aiming to boost job creation with incentives for employees and employers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reserve-bank-of-india-rbi-led-monetary-policy-committee-mpc-announced-7-important-decisions-2645848-2024-12-06",
      "headline": "RBI MPC announcement: 7 important decisions you should know aboutThe Reserve Bank of India's monetary policy update includes key decisions like CRR reduction, increase in farm loan limits and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-increases-upi-lite-transaction-limit-how-will-customers-benefit-upi-rule-changes-upi-lite-app-2645455-2024-12-06",
      "headline": "RBI increases UPI Lite transaction limit: How will you benefit?The RBI has increased transaction limits for UPI Lite, making digital payments more convenient, flexible, and accessible for customers, especially for low-value and offline transactions."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/syria-president-assad-his-family-arrive-in-russia-moscow-gives-them-asylum-report-2646843-2024-12-08",
      "headline": "Syrian rebels storm palaces as Assad flees to Russia; US hits ISIS campsRussia said it granted ousted Bashar al-Assad asylum as he and his family landed in Moscow after rebels took control of Damascus, forcing the long-time Syrian President to flee his country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sonia-gandhi-linked-to-group-financed-by-george-soros-foundation-bjp-levels-fresh-charge-2646868-2024-12-09",
      "headline": "Sonia Gandhi linked to group financed by George Soros Foundation: BJP's big claimThe BJP alleged that Congress stalwart Sonia Gandhi was linked to a group financed by George Soros Foundation. This fresh charge came days after the party claimed that the US \"deep state\" collaborated with Rahul Gandhi to destabilise India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/unitedhealthcare-ceos-killers-new-pics-released-gunman-had-monopoly-money-in-bag-2646869-2024-12-09",
      "headline": "UnitedHealthcare CEO's killer's new pics released, gunman had Monopoly money in bagTwo photos released by the New York Police Department show the gunman, who killed UnitedHealthcare CEO Brian Thompson on December 4, one walking near a taxi and a second inside it."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/music/story/jay-z-accused-of-raping-a-13-year-old-with-sean-diddy-combs-2646883-2024-12-09",
      "headline": "Rapper Jay-Z accused of raping a 13-year-old with Sean Diddy Combs in 2000Rapper Jay-Z was accused of raping a 13-year-old girl with Sean 'Diddy' Combs in 2000. She alleged that she was assaulted at the after-party of MTV Video Music Awards."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/syria-damascus-bashar-al-assad-palace-looted-car-furniture-russia-rebels-2646871-2024-12-09",
      "headline": "Syrians raid Assad's palace, loot luxury cars, Louis Vuitton trunk, clothesPeople looted, vandalised, and ransacked Syrian President Bashar al-Assad's 31,500-square-metre Al-Rawda Presidential Palace, seizing luxury vehicles, valuables, and furniture, while Assad fled to Moscow after the collapse of his regime."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/two-delhi-schools-dps-rk-puram-gd-goenka-public-school-paschim-vihar-receive-bomb-threats-via-e-mail-2646877-2024-12-09",
      "headline": "Bomb hoax in 40 Delhi schools, demand for $30,000 ransomDelhi Bomb Threat: As per the Delhi Police, the schools received the e-mails at around 11.30 pm on Sunday. In the wake of the threat mails, the school administrations sent the students back home."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/delhi-police-nia-human-trafficking-accused-thailand-laos-job-scam-consultancy-service-2646826-2024-12-08",
      "headline": "Man accused of human trafficking arrested after 2,500-km long chase in HyderabadThe accused, Kamran Haider alias Zaidi, allegedly lured victims through his consultancy firm, Ali International Services, and used to traffic them to Thailand and Laos."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-hindu-monk-chinmoy-krishna-das-case-filed-minorities-dhaka-2646834-2024-12-08",
      "headline": "Bangladesh Police file case against Hindu monk Chinmoy Das, his followersEnamul Haque, a Hefazat-e-Islam activist, filed a case naming Hindu monk Chinmoy Krishna Das along with 164 identified and over 500 unidentified persons accusing them of attacking him at the Chittagong court."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-aus-test-series-bgt-rohit-sharma-do-not-need-to-panic-adelaide-loss-2646885-2024-12-09",
      "headline": "It's a marathon, not a sprint: India don't need to panic after 2nd Test lossThe Indian team may have faced a big loss in the pink-ball Test but there is still a lot left in the Border-Gavaskar Trophy to play for. With history backing them, India needs a couple of changes to make before the next match in Brisbane. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/university-of-bath-school-of-management-a-leader-in-global-business-education-2643394-2024-12-02",
      "headline": "University of Bath School of Management: A Leader in Global Business EducationCombining top-ranked MSc programmes with practical knowledge for future corporate leaders.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/afghan-taliban-congratulates-syrians-after-fall-president-bashar-al-assad-regime-removal-factor-conflict-2646889-2024-12-09",
      "headline": "Taliban congratulates Syrians after Assad fall: Removal of factor of conflictIn a statement on Sunday, the Taliban's Ministry of Foreign Affairs said the collapse of the Syrian government led by the autocratic Bashar al-Asaad resulted in the \"removal of the factor of conflict and instability\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/ahmedabad/story/gujarat-man-bank-manager-union-bank-of-india-tds-fixed-deposit-dispute-viral-video-2646850-2024-12-09",
      "headline": "Video: Gujarat man thrashes bank manager, rips his shirt over deposit disputeA viral video shows a man thrashing and ripping the shirt of a Union Bank of India manager in Ahmedabad over a dispute over increased TDS on his fixed deposit."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/music/story/diljit-dosanjh-says-its-time-for-indian-artists-to-shine-promotes-vocal-for-local-2646896-2024-12-09",
      "headline": "Vocal for Local: Diljit Dosanjh says it's time for Indian artists to shineDiljit Dosanjh, during his Indore concert, addressed the issue of fake ticket sales, commenting on how 'times have changed' with artists holding concerts in India. He also gave a shout-out to his 'brothers' AP Dhillon and Karan Aujla. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/apple-faces-12-billion-lawsuit-for-failing-to-prevent-distribution-of-child-sexual-abuse-material-via-icloud-2646899-2024-12-09",
      "headline": "Apple faces $1.2B lawsuit for failing to prevent CSAM distribution on iCloudVictims of child sexual abuse in the US have filed a $1.2 billion lawsuit against Apple, alleging negligence in preventing the spread of illegal content on iCloud."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/us-president-elect-donald-trump-pardon-january-6-capitol-attack-accused-first-day-in-office-2646892-2024-12-09",
      "headline": "Trump vows to pardon Capitol attack rioters on first day in officeHowever, Donald Trump said in an interview that there could be some exceptions\"to his pardons if the individuals had acted radical or crazy during the January 6 assault."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aakash-chopra-ind-vs-aus-2nd-test-bgt-rohit-sharma-captaincy-record-2646882-2024-12-09",
      "headline": "Aakash Chopra blames defensive Rohit Sharma for India's loss in AdelaideIND vs AUS: Former India cricketer Aakash Chopra has blamed Rohit Sharma for the team's loss in Adelaide Test match. India were hammered by Australia in the Border-Gavaskar Trophy as they won the pink ball Test by 10 wickets.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/turkey-president-recep-tayyip-erdogan-dual-strategy-syria-nato-russia-opinion-2646753-2024-12-08",
      "headline": "Erdogan's dual strategy in Syria: Hunting with NATO, running with RussiaFor over a decade, Syria has been a battleground where various international interests have clashed, with Turkey playing a pivotal role. However, Turkey's involvement is complicated by its position as a NATO member, often putting it at odds with Assad's other key ally, Russia."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-diplomatic-efforts-focused-on-strained-israel-iran-ties-s-jaishankar-2646840-2024-12-08",
      "headline": "India's diplomatic efforts focused on strained Israel-Iran ties: S JaishankarThere have been mounting global concerns over escalating tensions between Iran and Israel in the last few months. Talking about them, S Jaishankar said that the relationship or absence of it between Israel and Iran has been a source of concern. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/notre-dame-open-public-sunday-mass-five-years-renovation-2019-fire-emmanuel-macron-2646872-2024-12-09",
      "headline": "Notre Dame hosts 1st Sunday mass after 5 years of renovation since 2019 fireThe inaugural mass on Sunday morning was led by Paris archbishop Laurent Ulrich with 150 bishops and more than 100 priests from the capital in attendance, as well as French President Emmanuel Macron."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/aaditya-thackeray-samajwadi-party-maharashtra-unit-babri-masjid-demolition-row-2646865-2024-12-09",
      "headline": "Babri post row: Team Uddhav calls Samajwadi's Maharashtra unit 'BJP's B-team'Shiv Sena (UBT) leader Aaditya Thackeray asserted that the Samajwadi Party's Maharashtra unit was behaving like \"BJP's B-team\" and said his party was rooted in its Hindutva ideology by taking everyone along."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/d-gukesh-reaction-11-game-win-vs-ding-liren-2646818-2024-12-08",
      "headline": "Gukesh credits team for lead in Game 11: Don't think Liren was playing for drawIndian teenage Grandmaster D. Gukesh has attributed his crucial victory in Game 11 to his team's meticulous preparation, as he moves closer to securing his first World Chess Championship title. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-angry-post-fake-news-spreaders-idiots-2646901-2024-12-09",
      "headline": "Idiots with limited brain: Big B's angry post against fake news spreadersAmitabh Bachchan criticised misinformation spreaders in a cryptic post, calling them \"idiots with limited brain.\" His remarks follow ongoing rumours about his son Abhishek Bachchan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bihar-samastipur-railway-station-train-disruption-fight-monkey-banana-2646838-2024-12-08",
      "headline": "Fight between monkeys over banana disrupts train operations at Bihar railway stationA scuffle between two monkeys over a banana caused a piece of rubber to slip from one monkey's grip and fall onto the overhead wires below. The collision caused a short circuit, with sparks flying from the wires."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/weather-update-delhi-temperature-may-drop-to-3-degrees-celsius-cold-wave-north-india-western-disturbance-himalaya-snowfall-2646734-2024-12-08",
      "headline": "Delhi braces for cold wave, temperature likely to plunge to 3°C this weekCurrently, Delhi's minimum temperature hovers around 7°C. However, the chilling conditions are predicted to intensify due to a combination of factors, including snowfall in the northern hills and the influence of a western disturbance, which could bring light showers to the plains."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pushpa-2-kochi-theatre-screens-second-half-without-first-half-fans-demand-refund-2646905-2024-12-09",
      "headline": "Pushpa 2: Kochi theatre screens second half without first half, fans demand refundA comedy of errors unfolded at a Kochi theatre when the second half of Pushpa 2 was screened before the first. Confused and frustrated, the audience demanded either a refund or a proper screening of the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/sobhita-dhulipala-new-pics-from-wedding-with-naga-chaitanya-2646909-2024-12-09",
      "headline": "Sobhita Dhulipala is a goddess in new pics from wedding with Naga ChaitanyaSobhita Dhulipala shared new pictures from her wedding with Naga Chaitanya. She has channelled her inner goddess in her solo pictures from her big day. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-angry-post-fake-news-spreaders-idiots-2646901-2024-12-09",
      "headline": "Idiots with limited brain: Big B's angry post against fake news spreadersAmitabh Bachchan criticised misinformation spreaders in a cryptic post, calling them \"idiots with limited brain.\" His remarks follow ongoing rumours about his son Abhishek Bachchan. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/music/story/diljit-dosanjh-says-its-time-for-indian-artists-to-shine-promotes-vocal-for-local-2646896-2024-12-09",
      "headline": "Vocal for Local: Diljit Dosanjh says it's time for Indian artists to shineDiljit Dosanjh, during his Indore concert, addressed the issue of fake ticket sales, commenting on how 'times have changed' with artists holding concerts in India. He also gave a shout-out to his 'brothers' AP Dhillon and Karan Aujla. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/west-indies-vs-bangladesh-1st-odi-sherfane-rutherford-2646907-2024-12-09",
      "headline": "Sherfane Rutherford's maiden hundred helps Windies seal 1st ODI vs BangladeshWI vs BAN, 1st ODI: West Indies chased down the highest ever target at St Kitts to take a 1-0 lead in the 3-match series vs Bangladesh. Sherfane Rutherford scored a terrific hundred, his first in ODI cricket.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/new-zealand-vs-england-devon-conway-set-to-miss-3rd-test-due-to-birth-of-his-child-2646894-2024-12-09",
      "headline": "Devon Conway set to miss 3rd Test vs England due to birth of his child New Zealand's Devon Conway will miss the 3rd Test vs England due to the birth of his first child. England already lead the 3-match Test series 2–0 vs the hosts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-aus-2nd-test-sanjay-manjrekar-jasprit-bumrah-shami-siraj-2646893-2024-12-09",
      "headline": "India bowlers need to be more relentless vs Australia: Sanjay ManjrekarIND vs AUS: Former India cricketer Sanjay Manjrekar said that the bowlers needed to be more relentless against Australia in the Adelaide Test match. Manjrekar's comments came after India lost the 2nd Test by a margin of 10 wickets.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-aus-test-series-bgt-rohit-sharma-do-not-need-to-panic-adelaide-loss-2646885-2024-12-09",
      "headline": "It's a marathon, not a sprint: India don't need to panic after 2nd Test lossThe Indian team may have faced a big loss in the pink-ball Test but there is still a lot left in the Border-Gavaskar Trophy to play for. With history backing them, India needs a couple of changes to make before the next match in Brisbane. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aakash-chopra-ind-vs-aus-2nd-test-bgt-rohit-sharma-captaincy-record-2646882-2024-12-09",
      "headline": "Aakash Chopra blames defensive Rohit Sharma for India's loss in AdelaideIND vs AUS: Former India cricketer Aakash Chopra has blamed Rohit Sharma for the team's loss in Adelaide Test match. India were hammered by Australia in the Border-Gavaskar Trophy as they won the pink ball Test by 10 wickets.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-aus-test-series-nitish-reddy-srh-hardik-pandya-replacement-2646724-2024-12-09",
      "headline": "Have India found Pandya's replacement? Nitish Reddy shows spark in Australia   AUS vs IND: Nitish Kumar Reddy's fearless batting and maturity beyond his years mark him as India's next big hope. In just 2 Test matches, the 21-year-old has shown that he thrives under pressure and delivers when it matters the most."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chelsea-vs-tottenham-hotspur-palmer-premier-league-penalty-record-2646853-2024-12-09",
      "headline": "Palmer breaks Premier League record in Chelsea's 4-3 win over SpursCole Palmer scored twice from the penalty spot as Chelsea staged a dramatic comeback, recovering from 2-0 down to defeat Tottenham Hotspur 4-3 in a thrilling London derby. Palmer has now scored the most penalties without missing in Premier League history.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/mikel-arteta-delivers-arsenal-injury-update-after-draw-vs-fulham-2646839-2024-12-08",
      "headline": "Mikel Arteta delivers fresh Arsenal injury update after draw at FulhamWith the Monaco game fast approaching, Mikel Arteta will be hoping his defensive options are bolstered by the potential returns of Gabriel, Zinchenko, and Calafiori, allowing Arsenal to maintain their strong form in both domestic and European competitions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/pakistan-super-league-franchises-eye-unsold-foreign-ipl-players-for-2025-2646836-2024-12-08",
      "headline": "Pakistan Super League franchises eye unsold foreign IPL players for 2025Pakistan franchise owners have submitted a list of unsold overseas IPL players to the PCB for the PSL draft. The potential overlap of PSL and IPL seasons next year adds a new dimension to player availability decisions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/premier-league-arsenal-drop-points-held-1-1-by-fulham-2646833-2024-12-08",
      "headline": "Arsenal frustrated by Fulham once againArsenal were held to a 1-1 draw by London rivals Fulham in a Premier League clash on a grey, wet Sunday at Craven Cottage. Raul Jimenez gave the hosts an early lead, while William Saliba equalized for the visitors at the start of the second half."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/south-africa-vs-sri-lanka-2nd-test-day-4-report-de-silva-mendi-2646830-2024-12-08",
      "headline": "2nd Test: Dhananjaya de Silva-Mendis stand keeps Sri Lanka alive on Day 4South Africa need five wickets, while Sri Lanka require 143 runs as the second Test heads for a potentially thrilling conclusion on Monday, with both teams desperate for victory in their bid for a place in the World Test Championship final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chelsea-vs-tottenham-hotspur-palmer-premier-league-penalty-record-2646853-2024-12-09",
      "headline": "Palmer breaks Premier League record in Chelsea's 4-3 win over SpursCole Palmer scored twice from the penalty spot as Chelsea staged a dramatic comeback, recovering from 2-0 down to defeat Tottenham Hotspur 4-3 in a thrilling London derby. Palmer has now scored the most penalties without missing in Premier League history.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/mikel-arteta-delivers-arsenal-injury-update-after-draw-vs-fulham-2646839-2024-12-08",
      "headline": "Mikel Arteta delivers fresh Arsenal injury update after draw at FulhamWith the Monaco game fast approaching, Mikel Arteta will be hoping his defensive options are bolstered by the potential returns of Gabriel, Zinchenko, and Calafiori, allowing Arsenal to maintain their strong form in both domestic and European competitions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/pakistan-super-league-franchises-eye-unsold-foreign-ipl-players-for-2025-2646836-2024-12-08",
      "headline": "Pakistan Super League franchises eye unsold foreign IPL players for 2025Pakistan franchise owners have submitted a list of unsold overseas IPL players to the PCB for the PSL draft. The potential overlap of PSL and IPL seasons next year adds a new dimension to player availability decisions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/premier-league-arsenal-drop-points-held-1-1-by-fulham-2646833-2024-12-08",
      "headline": "Arsenal frustrated by Fulham once againArsenal were held to a 1-1 draw by London rivals Fulham in a Premier League clash on a grey, wet Sunday at Craven Cottage. Raul Jimenez gave the hosts an early lead, while William Saliba equalized for the visitors at the start of the second half."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/south-africa-vs-sri-lanka-2nd-test-day-4-report-de-silva-mendi-2646830-2024-12-08",
      "headline": "2nd Test: Dhananjaya de Silva-Mendis stand keeps Sri Lanka alive on Day 4South Africa need five wickets, while Sri Lanka require 143 runs as the second Test heads for a potentially thrilling conclusion on Monday, with both teams desperate for victory in their bid for a place in the World Test Championship final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/formula-1-lewis-hamilton-emotional-farewell-donuts-spins-mercedes-final-race-2646828-2024-12-08",
      "headline": "Watch: Emotional Hamilton wows crowd with donuts in final Mercedes raceLewis Hamilton ended his 12-year Mercedes journey with an emotional farewell at the Abu Dhabi Grand Prix, marking the end of an era filled with historic achievements and the beginning of a new chapter with Ferrari."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-day-night-test-sunil-gavaskar-2646829-2024-12-08",
      "headline": "Sunil Gavaskar shares advice on how day-night Tests can thriveAUS vs IND, 2nd Test: Sunil Gavaskar shared a suggestion about Day-Night Tests, saying that pink-ball matches should be hosted by cities with a busy corporate life. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ben-stokes-credits-england-style-of-play-new-zealand-series-win-2646823-2024-12-08",
      "headline": "Ben Stokes credits England's dominant style of play for New Zealand series winEngland captain Ben Stokes has lauded his team's bold and aggressive approach following a resounding 323-run victory in Wellington, marking their first Test series triumph in New Zealand in 16 years. Reflecting on the achievement, Stokes highlighted the significance of their attacking mindset. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gukesh-out-of-syllabus-knight-move-vs-ding-liren-game-eleven-world-chess-championship-favourite-2646819-2024-12-08",
      "headline": "Gukesh's out of syllabus move makes him World Chess Championship favouriteGukesh and Ding Liren were certain to play a draw in the 11th game of the World Chess Championship, but a novelty move from Gukesh ensured Ding Liren blundered, and it put the Indian Grandmaster in pole position to win the World Chess Championships. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/d-gukesh-reaction-11-game-win-vs-ding-liren-2646818-2024-12-08",
      "headline": "Gukesh credits team for lead in Game 11: Don't think Liren was playing for drawIndian teenage Grandmaster D. Gukesh has attributed his crucial victory in Game 11 to his team's meticulous preparation, as he moves closer to securing his first World Chess Championship title. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-marnus-labuschagne-form-2646817-2024-12-08",
      "headline": "Took a lot out of my ability: How Labuschagne recovered from poor formAUS vs IND: Marnus Labuschagne returned to form with a 64-run knock in the first innings of the Adelaide Test. His knock did not go in vain as Australia beat India by 10 wickets to draw level in the five-match series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-pink-ball-test-jasprit-bumrah-fitness-sunil-gavaskar-adelaide-2646809-2024-12-08",
      "headline": "Should Jasprit Bumrah play all 5 Tests vs Australia? Sunil Gavaskar respondsSunil Gavaskar commented on Jasprit Bumrah's workload management and claimed that the pacer should play all the matches in the Border-Gavaskar Trophy. Bumrah has been India's best bowler in the series against Australia so far. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/australia-vs-india-adelaide-test-head-vs-siraj-bgt-spice-2646806-2024-12-08",
      "headline": "Siraj vs Head and more: Pink-ball Test drama spices up Border-Gavaskar TrophyThe Adelaide Test added much-needed excitement to the Border-Gavaskar Trophy after a notably respectful build-up to the series. The Test match featured a massive controversy between Mohammed Siraj and Travis Head, among other dramatic moments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/d-gukesh-reaction-11-game-win-vs-ding-liren-2646818-2024-12-08",
      "headline": "Gukesh credits team for lead in Game 11: Don't think Liren was playing for drawIndian teenage Grandmaster D. Gukesh has attributed his crucial victory in Game 11 to his team's meticulous preparation, as he moves closer to securing his first World Chess Championship title. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-marnus-labuschagne-form-2646817-2024-12-08",
      "headline": "Took a lot out of my ability: How Labuschagne recovered from poor formAUS vs IND: Marnus Labuschagne returned to form with a 64-run knock in the first innings of the Adelaide Test. His knock did not go in vain as Australia beat India by 10 wickets to draw level in the five-match series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-pink-ball-test-jasprit-bumrah-fitness-sunil-gavaskar-adelaide-2646809-2024-12-08",
      "headline": "Should Jasprit Bumrah play all 5 Tests vs Australia? Sunil Gavaskar respondsSunil Gavaskar commented on Jasprit Bumrah's workload management and claimed that the pacer should play all the matches in the Border-Gavaskar Trophy. Bumrah has been India's best bowler in the series against Australia so far. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/australia-vs-india-adelaide-test-head-vs-siraj-bgt-spice-2646806-2024-12-08",
      "headline": "Siraj vs Head and more: Pink-ball Test drama spices up Border-Gavaskar TrophyThe Adelaide Test added much-needed excitement to the Border-Gavaskar Trophy after a notably respectful build-up to the series. The Test match featured a massive controversy between Mohammed Siraj and Travis Head, among other dramatic moments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/australia-vs-india-simply-better-adelaide-test-sunil-gavaskar-exclusive-mohammed-siraj-2646805-2024-12-08",
      "headline": "Australia were simply better than India in the Adelaide Test: GavaskarIndian cricket legend Sunil Gavaskar believes that Australia were simply better than India in terms of both batting and bowling in the Adelaide Test, and urged the Rohit Sharma-led side to revamp their approach for the upcoming Gabba Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-balanced-approach-shelved-leaned-into-aggression-adelaide-robin-uthappa-2646796-2024-12-08",
      "headline": "Siraj is gonna give it back to Australia doubly in kind in Gabba: GavaskarMohammed Siraj faced intense challenges in Adelaide but earned Sunil Gavaskar's backing to retaliate with fiery performances in Gabba after a heated exchange with Travis Head and relentless bouncers from Australia's pace attack marked the second Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/badminton-sachin-tendulkar-pv-sindhu-wedding-2646789-2024-12-08",
      "headline": "PV Sindhu, fiance Venkata Datta Sai invite Sachin Tendulkar for weddingSachin Tendulkar wished PV Sindhu as the badminton star is set to marry Venkata Datta Sai on December 22. Sindhu recently bagged the Syed Modi international title after beating China's Wu Luo Yu in the final. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}