{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/digital-finance-is-not-foolproof-cautions-zerodha-founder-ceo-nithin-kamath-2802838-2025-10-14",
      "headline": "Digital finance isn't foolproof, cautions Zerodha's Nithin KamathFrom Aadhaar e-Sign to mobile apps, digital finance has transformed access to financial services in India. However, Nithin Kamath points out that system failures and delays still pose challenges for users."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bira-91-beer-disappeared-wine-shops-bars-legal-name-change-leadership-change-failure-transparency-salary-delay-2802466-2025-10-14",
      "headline": "Bira 91 went poof! And the name change was just the beer headWhile several news reports said that a change in the name of Indian beer Bira 91 spelt doom for the craft beer brand, it was just the tip of the iceberg. The company is facing a Rs 80-crore loss, supply-chain disruption, and most importantly, internal unrest, with employees demanding the ouster of founder Ankur Jain. This is what industry insiders have to say about the mess at Bira 91."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-now-allows-100-percent-pf-withdrawal-7-major-changes-you-should-know-2802786-2025-10-14",
      "headline": "EPFO now allows 100% PF withdrawal. 7 major changes you should knowMembers of EPFO can now breathe a sigh of relief as the organisation allows full withdrawal of PF balances. Here's a look at seven important changes that will affect how you access your funds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/lg-electronics-india-ipo-listing-share-price-hold-sell-2802777-2025-10-14",
      "headline": "LG Electronics IPO makes bumper debut. Should you hold or sell?With the stock listing at a sharp premium, booking partial profits allows investors to secure immediate gains, while retaining a portion of shares could help benefit from the company's long-term growth trajectory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/tata-motors-share-crash-price-down-40-percent-why-reason-demerger-passenger-pv-cv-businesses-2802761-2025-10-14",
      "headline": "Tata Motors shares crash 40%: Is the Tata stock really down?Tata Motors shares opened at Rs 399 on Tuesday, down around 39.62% from Monday's close of Rs 660.90."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/lg-electronics-india-makes-bumper-stock-market-debut-lists-at-50-over-ipo-price-2802746-2025-10-14",
      "headline": "LG Electronics lights up Dalal Street with 50% listing gain on market debutLG Electronics stock market listing: The strong opening reflected robust investor demand and optimism about the company's growth prospects in India's consumer electronics market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-jumps-over-200-points-nifty-above-25300-hcltech-shares-up-2-percent-2802727-2025-10-14",
      "headline": "Sensex jumps over 200 points, Nifty above 25,300; HCLTech up 2%The S&P BSE Sensex added 205.08 points to 82,532.13, while the NSE Nifty50 gained 60.60 points to 25,287.95 as of 9:30 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/lg-electronics-listing-today-latest-gmp-over-rs-400-how-much-investors-can-gain-market-debut-2802698-2025-10-14",
      "headline": "LG Electronics listing today: Investors eye big gains as GMP crosses Rs 400LG Electronics IPO opened for subscription on October 7 and closed on October 9. The price band for the issue was set between Rs 1,080 and Rs 1,140 per share."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/claim-denied-insurance-star-health-ombudsman-irdai-manipal-hospital-mudit-agarwal-poonam-singhal-2802351-2025-10-14",
      "headline": "Every claim is a fight: Inside a family's months-long health insurance battleIn India, buying health insurance is easy, but claiming it is another battle. Families like Mudit Agarwal's often end up fighting bureaucracy instead of focusing on illness. In this week's story from our ongoing 'Claim Denied' series, we reveal how one family's ordeal exposes the cracks in the system."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/lg-electronics-share-price-market-debut-gmp-above-rs-400-bumper-opening-nse-bse-listing-gains-2802672-2025-10-14",
      "headline": "LG Electronics share listing today: Will it make bumper debut on stock market?LG Electronics IPO is one of the most talked-about offerings of 2025, attracting bids worth over Rs 4.4 lakh crore against the Rs 11,607 crore issue size."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indian-businessman-vijay-mallya-discontinues-bankruptcy-annulment-application-in-uk-ahead-of-his-hearing-2802568-2025-10-13",
      "headline": "Vijay Mallya discontinues bankruptcy annulment application in UK ahead of hearingThis means the \"Trustee in Bankruptcy\" can continue to pursue assets to help a consortium of banks led by the State Bank of India (SBI) realise the repayment of an estimated judgment debt of around 1.05 billion pounds owed by Vijay Mallya's now-defunct Kingfisher Airlines."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/diwali-2025-shopping-on-credit-cards-here-how-no-cost-emi-flash-sale-offers-can-backfire-2802457-2025-10-13",
      "headline": "Diwali shopping on credit cards? Here's how offers can backfireFestive sales and flashy credit card deals may look irresistible, but hidden charges, interest traps and repayment delays can turn Diwali shopping into a debt headache."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/retail-inflation-in-september-down-to-8-year-low-2802366-2025-10-13",
      "headline": "Retail inflation drops to 1.54% in September, lowest in over 8 yearsFood inflation remained negative for the fourth consecutive month, with the Consumer Food Price Index (CFPI) showing a year-on-year decline of 2.28%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/nobel-prize-in-economic-sciences-awarded-to-joel-mokyr-philippe-aghion-and-peter-howitt-2802332-2025-10-13",
      "headline": "Joel Mokyr, Philippe Aghion, Peter Howitt win Nobel Prize in Economics 2025The Nobel Prize committee said the trio's research has helped economists and policymakers better understand the roots of economic progress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-sensex-nifty-it-stocks-us-china-trade-woes-infosys-2802344-2025-10-13",
      "headline": "Sensex, Nifty end in red as IT stocks drag markets; Infosys down 2%The S&P BSE Sensex was down by 173.77 points to close at 82,327.05, while the NSE Nifty50 lost 58 points to end at 25,227.35. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/silver-prices-india-should-you-sell-buy-personal-finance-festive-season-shopping-2802291-2025-10-13",
      "headline": "Is silver the next big story after gold? Here's what you need to knowFrom households to industries and even central banks, silver is suddenly everyone's favourite metal, pushing its price higher. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/loan-rejected-despite-750-cibil-score-5-hidden-reasons-revealed-by-expert-2802284-2025-10-13",
      "headline": "Loan rejected despite 750 CIBIL score? 5 hidden reasons revealed by expertEven with a strong CIBIL score of 750, many borrowers face loan rejections. Experts say banks consider several hidden factors beyond your credit score that can impact approval."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/is-diwali-bonus-taxable-for-salaried-employees-here-is-what-you-must-know-2802249-2025-10-13",
      "headline": "Is Diwali bonus taxable for salaried employees? Here's what you must knowAs Diwali draws near, salaried employees across India look forward to festive bonuses and gifts. But not all perks are tax-free, and understanding which ones attract tax is essential to avoid surprises from the Income Tax Department."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/lg-electronics-ipo-50-percent-listing-pop-stock-market-debut-2802227-2025-10-13",
      "headline": "LG Electronics IPO GMP rises: Can investors expect 50% listing pop tomorrow?LG IPO: While early chatter hinted at a 50% listing pop, current indicators suggest a slightly more modest, yet still impressive, gain. Read on to know more about the grey market trends, subscription frenzy, and what investors can realistically expect tomorrow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cryptocurrency-bitcoin-ethereum-dogecoin-rebound-after-massive-crash-here-is-what-investors-should-do-2802203-2025-10-13",
      "headline": "Crypto rebounds after massive crash. Here's what investors should doThe crypto market has regained lost ground following a sharp crash over the weekend. Bitcoin, Ethereum, and several altcoins are bouncing back, leaving investors to decide their next move carefully."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/hansal-mehta-backs-lijo-jose-pellissery-love-story-ar-rahman-onboard-for-music-2802871-2025-10-14",
      "headline": "Hansal Mehta backs Lijo Jose Pellissery's love story, AR Rahman onboard for music Filmmaker Hansal Mehta is collaborating with Lijo Jose Pellissery and AR Rahman for a new romantic drama. The film promises a lyrical exploration of love with an original Rahman score, generating high expectations in Indian cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/bison-trailer-dhruv-vikram-kabaddi-drama-diwali-release-2802843-2025-10-14",
      "headline": "Bison trailer: Dhruv Vikram is an intense kabaddi player dealing with oppression Dhruv Vikram leads 'Bison', a sports drama centred on kabaddi, directed by Mari Selvaraj. The trailer showcases intense scenes set in the 1990s southern Tamil Nadu, with kabaddi central to the story."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kannada-actor-raju-talikote-dies-heart-attack-udupi-film-shoot-2802811-2025-10-14",
      "headline": "Kannada actor Raju Talikote dies of heart attack during film shoot Veteran Kannada actor and director Raju Talikote, 62, suffered a fatal heart attack during a film shoot in Udupi. His last rites will be held in Chikkasindagi village.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/riddick-furya-vin-diesel-back-in-fourth-film-of-sci-fi-series-unveils-new-look-2802812-2025-10-14",
      "headline": "Riddick Furya: Vin Diesel back in fourth film of sci-fi series, unveils new look Actor Vin Diesel is back as Riddick in the upcoming sci-fi sequel 'Riddick: Furya'. The film explores the mysterious origins of Furyans and promises intense action and new enemies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/lokah-chapter-1-crosses-rs-300-crore-worldwide-stars-thank-fans-crew-2802797-2025-10-14",
      "headline": "Kalyani Priyadarshan, Dulquer Salmaan react after Lokah's Rs 300-crore global haul 'Lokah Chapter 1: Chandra' crossed Rs 300 crore globally, prompting reactions from the cast. Kalyani Priyadarshan and Dulquer Salmaan shared their gratitude on social media."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jennifer-aniston-infertility-no-to-adoption-ivf-failure-wanted-dna-biological-child-2802799-2025-10-14",
      "headline": "Want my DNA in a little person: Jennifer Aniston on infertility and not adopting Jennifer Aniston opened up about her personal experiences with infertility and IVF. The actor addressed speculation on her decision not to adopt children. Aniston shared her feelings about public commentary and personal peace."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kangana-ranaut-on-her-humble-roots-distinct-journey-from-convent-educated-srk-2802774-2025-10-14",
      "headline": "Kangana Ranaut on her humble roots and distinct journey from convent-educated SRK Actor Kangana Ranaut highlighted her humble village background in contrast to mainstream stars. She reflected on her journey, challenging the typical Bollywood success story."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-zeishan-quadri-on-feeling-betrayed-by-amaal-mallik-post-eviction-2802735-2025-10-14",
      "headline": "Bigg Boss 19: Zeishan Quadri on feeling betrayed by Amaal Mallik post eviction Actor Zeishan Quadri was evicted from Bigg Boss 19 and expressed feelings of betrayal by fellow contestants. His revelations hint at tension and unfair treatment within the show's house dynamics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/silambarasan-tr-arasan-promo-theatrical-premiere-october-16-2802753-2025-10-14",
      "headline": "Arasan: 5-minute promo locked for Simbu-Vetri Maaran film, to release in theatres A five-minute promo for 'Arasan', starring Silambarasan, has been locked for theatrical and online release. The film's theatrical premiere has been scheduled for October 16."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/the-curious-case-of-pradeep-ranganathan-dudes-rise-to-relevance-2802646-2025-10-14",
      "headline": "The curious case of Pradeep Ranganathan: Dude's rise to relevance From short films to the big screen, Pradeep Ranganathan has carved a niche with just two movies, blending youth-centric storytelling, relatable characters, and sharp self-awareness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kbc-17-big-b-recites-agneepath-iconic-line-on-rishab-shetty-request-2802699-2025-10-14",
      "headline": "KBC 17: Big B recites Agneepath's iconic line on Rishab Shetty's request Actor-director Rishab Shetty featured on 'Kaun Banega Crorepati 17' with Amitabh Bachchan. The duo recreated a memorable dialogue from 'Agneepath' (1990), adding nostalgia to the show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/pakistan-muslim-nation-to-get-love-island-people-sink-it-in-quran-verses-lazawal-ishq-ott-series-reality-dating-tv-show-2802581-2025-10-14",
      "headline": "Pakistan first Muslim nation to get Love Island. People sink it in Quran verses Pakistani reality dating show, Lazawal Ishq, tried to channel Love Island but ended up delivering a cringe-fest of a series. Pakistanis used Quranic verses to brand it \"unIslamic\". There's awkward casting, archaic gender dynamics, and an experiment that goes wildly off the rails. But it seemingly shows aspects of Pakistani society that mainstream TV fails to highlight."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kantara-box-office-collection-crosses-rs-450-crore-in-12-days-2802714-2025-10-14",
      "headline": "Kantara Chapter 1 box office Day 12: Rishab's film sees big drop on 2nd Monday 'Kantara: Chapter 1' witnessed a significant drop in box office collections on its second Monday. Despite this, the film crossed Rs 450 crore nett in 12 days and should continue its successful run till Diwali."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-asks-fans-to-stay-calm-during-spain-race-event-2802692-2025-10-14",
      "headline": "Ajith Kumar signals fans to remain calm at Spain race event, urging restraint Actor Ajith Kumar gestured to his fans to control their excitement at a Spain racing event. The actor's calm gesture was met with immediate compliance from the crowd."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/m-night-shyamalan-brad-falchuk-magic-8-ball-supernatural-drama-series-2802684-2025-10-14",
      "headline": "Director M Night Shyamalan turns Magic 8 Ball into supernatural TV series M Night Shyamalan and Brad Falchuk are teaming up for a supernatural drama inspired by the iconic Magic 8 Ball, reimagining the classic toy as a psychological thriller filled with suspense and character-driven storytelling."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ed-sheeran-collaborates-tamil-composer-santhosh-narayanan-dhee-hanumankind-2802676-2025-10-14",
      "headline": "Ed Sheeran, Hanumankind, Dhee join forces with Tamil composer Santhosh Narayanan Ed Sheeran is set to collaborate with Tamil composer Santhosh Narayanan, his singer-daughter Dhee, and rapper Hanumankind on a new international track. This marks Santhosh Narayanan's first global collaboration, generating excitement among fans and music enthusiasts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/is-mtv-music-channel-shutting-down-after-40-years-heres-whats-really-happening-2802671-2025-10-14",
      "headline": "Is MTV music shutting down after 40 years? Here's what's really happening MTV will end its iconic UK music channels by December 2025, focusing on reality TV, sparking nostalgia and disappointment among fans and former hosts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rishab-shetty-kantara-chapter-1-celebrates-women-as-both-soul-and-storm-of-film-2802617-2025-10-14",
      "headline": "The women of Kantara Chapter 1: Rishab Shetty turns feminine into cinematic power Rishab Shetty expands his cinematic universe in 'Kantara: Chapter 1', turning women into the story's driving force. From divine strength to human resilience, the prequel moves the gender conversation in the story with myth, strength, and power."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/stranger-things-season-5-episode-lengths-confirmed-no-90-minute-episodes-netflix-release-2802663-2025-10-14",
      "headline": "Stranger Things 5: Volume 1 episode runtimes revealed after fan buzz The co-creator of 'Stranger Things', Ross Duffer, has clarified that the final season's episodes will not be the lengthy 90-minute features as rumoured on social media. Netflix will release the last season in three parts starting November 26."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/bihar-assembly-elections-seat-sharing-deadlock-nda-bjp-jdu-congress-rjd-grand-alliance-2802844-2025-10-14",
      "headline": "Kheliye meeting meeting: Clock ticking, Bihar parties in seat-sharing messLess than a month remains for Bihar elections, but despite several rounds of meetings and to and fro Delhi-Patna flights, both the NDA and the Grand Alliance are yet to sort out the seat-sharing mess. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/dragged-me-into-forest-threatened-to-call-more-men-if-i-screamed-durgapur-gang-rape-survivor-recalls-horror-2802882-2025-10-14",
      "headline": "Dragged me, threatened to call more men: Bengal gang-rape survivor recalls horrorIn her statement to the doctor, the Durgapur gang-rape victim described how the men chased, overpowered, and assaulted her inside a forest adjacent to her hostel. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bringing-industry-leading-tech-to-india-googles-sundar-pichai-briefs-pm-modi-on-mega-ai-hub-in-vizag-2802857-2025-10-14",
      "headline": "Bringing industry-leading tech to India: Sundar Pichai briefs PM on mega AI hubAccording to the Google CEO, the mega AI hub project combines gigawatt-scale compute capacity, a new international subsea gateway, and large-scale energy infrastructure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-match-report-2nd-test-delhi-2802762-2025-10-14",
      "headline": "Shubman Gill's India stamp authority, win first Test series under new captainShubman Gill won his first Test series as captain after India hammered West Indies 2-0 at home. On the final day of the 2nd Test, Gill's India won with 7 wickets in hand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/pakistan-muslim-nation-to-get-love-island-people-sink-it-in-quran-verses-lazawal-ishq-ott-series-reality-dating-tv-show-2802581-2025-10-14",
      "headline": "Pakistan first Muslim nation to get Love Island. People sink it in Quran versesPakistani reality dating show, Lazawal Ishq, tried to channel Love Island but ended up delivering a cringe-fest of a series. Pakistanis used Quranic verses to brand it \"unIslamic\". There's awkward casting, archaic gender dynamics, and an experiment that goes wildly off the rails. But it seemingly shows aspects of Pakistani society that mainstream TV fails to highlight."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/nitish-kumar-patna-residence-cordoned-off-jdu-leaders-protest-not-getting-bihar-poll-tickets-2802821-2025-10-14",
      "headline": "Nitish Kumar's residence cordoned off amid protest over ticket distribution Live UpdatesSecurity was stepped up outside Bihar Chief Minister Nitish Kumar's Patna residence as angry JD(U) leaders and workers, denied tickets for the Assembly polls, staged sit-ins."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/why-a-young-kbc-17-contestants-behaviour-has-put-his-parents-in-the-firing-line-2802397-2025-10-13",
      "headline": "Why a young KBC contestant's behaviour has put his parents in the firing lineTen-year-old KBC contestant Ishit Bhatt has become the butt of memes and jokes on social media, and the reason is his overconfident demeanour. His parents, too, have been dragged into this, with strangers dissecting their \"parenting style\" based on a few televised minutes. Is that fair? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-praises-pm-modi-egypt-gestures-shehbaz-sharif-behind-him-glbs-2802649-2025-10-14",
      "headline": "Trump praises 'good friend' Modi in Egypt, gestures to Shehbaz Sharif behind himDonald Trump, co-hosting the Gaza Peace Summit in Sharm el-Sheikh alongside Egyptian President Abdel Fattah al-Sisi, also praised the Pakistani Prime Minister and said regional peace \"depends on good friends doing good things\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/is-mtv-music-channel-shutting-down-after-40-years-heres-whats-really-happening-2802671-2025-10-14",
      "headline": "Is MTV music shutting down after 40 years? Here's what's really happeningMTV will end its iconic UK music channels by December 2025, focusing on reality TV, sparking nostalgia and disappointment among fans and former hosts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-prime-minister-shehbaz-sharif-calls-us-president-donald-trump-peacemaker-italian-prime-minister-giorgia-melonis-expression-says-it-all-2802670-2025-10-14",
      "headline": "Watch: Another viral Meloni moment as Shehbaz Sharif praises TrumpThe theatrics unfolded when Pakistan Prime Minister Shehbaz Sharif, suddenly summoned by Donald Trump, was waxing eloquent on the US President for stopping the war between India and Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bira-91-beer-disappeared-wine-shops-bars-legal-name-change-leadership-change-failure-transparency-salary-delay-2802466-2025-10-14",
      "headline": "Bira 91 went poof! And the name change was just the beer headWhile several news reports said that a change in the name of Indian beer Bira 91 spelt doom for the craft beer brand, it was just the tip of the iceberg. The company is facing a Rs 80-crore loss, supply-chain disruption, and most importantly, internal unrest, with employees demanding the ouster of founder Ankur Jain. This is what industry insiders have to say about the mess at Bira 91."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jain-political-party-mumbai-bmc-election-pigeon-feeding-ban-dadar-kabootarkhana-monk-threat-politicians-marathi-2802446-2025-10-14",
      "headline": "How pigeons have given India its first Jain political partyMonths after a Jain monk's threat of \"taking up arms\" over a pigeon-feeding ban in Mumbai, the community has announced the launch of a political party, the Shanti Doot Jankalyan Party, with a pigeon as its symbol. The move, ahead of the long-delayed BMC polls, could shake up Mumbai's political landscape and split votes in key wards."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/claim-denied-insurance-star-health-ombudsman-irdai-manipal-hospital-mudit-agarwal-poonam-singhal-2802351-2025-10-14",
      "headline": "Every claim is a fight: Inside a family's months-long health insurance battleIn India, buying health insurance is easy, but claiming it is another battle. Families like Mudit Agarwal's often end up fighting bureaucracy instead of focusing on illness. In this week's story from our ongoing 'Claim Denied' series, we reveal how one family's ordeal exposes the cracks in the system."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/tata-motors-share-crash-price-down-40-percent-why-reason-demerger-passenger-pv-cv-businesses-2802761-2025-10-14",
      "headline": "Tata Motors shares crash 40%: Is the Tata stock really down?Tata Motors shares opened at Rs 399 on Tuesday, down around 39.62% from Monday's close of Rs 660.90."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-now-allows-100-percent-pf-withdrawal-7-major-changes-you-should-know-2802786-2025-10-14",
      "headline": "EPFO now allows 100% PF withdrawal. 7 major changes you should knowMembers of EPFO can now breathe a sigh of relief as the organisation allows full withdrawal of PF balances. Here's a look at seven important changes that will affect how you access your funds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/world-forgot-how-ancient-india-shaped-it-william-dalrymple-tells-fareed-zakaria-2802693-2025-10-14",
      "headline": "World forgot how ancient India shaped it, William Dalrymple tells Fareed ZakariaAs historian William Dalrymple puts it, the story of civilisation itself cannot be told without India, a land that once taught the world to think, count, and dream."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-harshit-rana-kris-srikkanth-youtube-2802826-2025-10-14",
      "headline": "Targeting Harshit Rana for YouTube views shameful: Gambhir slams SrikkanthIndia head coach Gautam Gambhir has ripped into former India cricketer Kris Srikkanth for criticising Harshit Rana's selection in the national team. Gambhir said that it is a little shameful that people are targetting the pacer just to run their YouTube channels."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/nepali-student-bipin-joshi-only-hindu-in-hamass-custody-confirmed-dead-after-738-days-2802787-2025-10-14",
      "headline": "Nepali student Bipin, only Hindu in Hamas's custody, confirmed dead after 738 daysBipin Joshi had moved to Israel just days before the attack as part of the \"Learn and Earn\" agricultural program, working alongside 16 fellow Nepali students at Kibbutz Alumim near the Gaza border."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-virat-kohli-australia-odis-shubman-gill-captain-message-2802881-2025-10-14",
      "headline": "Do your magic: Rohit Sharma and Virat Kohli get cool message from Shubman GillIndia tour of Australia: Shubman Gill backed Virat Kohli and Rohit Sharma to continue their prolific run in one-day internationals as they return to international cricket in a three-match ODI series starting on 19 October. Gill will lead the ODI side for the first time after taking over from Rohit as captain.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/texas-girl-10-saves-little-brother-from-choking-in-heroic-moment-2802775-2025-10-14",
      "headline": "Video: Texas girl, 10, saves little brother from choking in heroic momentA 10-year-old girl from Texas saved her younger brother from choking using the Heimlich manoeuvre. Her quick thinking has sparked admiration and led to discussions on the importance of life-saving skills for children."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/the-curious-case-of-pradeep-ranganathan-dudes-rise-to-relevance-2802646-2025-10-14",
      "headline": "The curious case of Pradeep Ranganathan: Dude's rise to relevanceFrom short films to the big screen, Pradeep Ranganathan has carved a niche with just two movies, blending youth-centric storytelling, relatable characters, and sharp self-awareness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/story/bihar-mahagathbandhan-seat-sharing-talks-stall-congress-rjd-clash-2802700-2025-10-14",
      "headline": "Bihar poll drama: Symbols given to RJD leaders withdrawn as Congress bargains hardSeat-sharing talks between the Congress and RJD in Bihar have stalled after inconclusive meetings in New Delhi and Patna. Congress's firm bargaining stance and the RJD's withdrawal of candidate symbols have deepened uncertainty within the Mahagathbandhan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/gaza-peace-summit-hot-mic-trump-mark-carney-canada-president-justin-trudeau-2802772-2025-10-14",
      "headline": "At least I didn't call you governor: Trump mocks Canada PM Carney on hot micAt the Gaza Peace Summit, Donald Trump mistakenly called Canadian PM Mark Carney 'President', prompting laughter. Mark Carney joked back, and Trump quipped about Justin Trudeau."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-student-sexual-assault-gang-rape-bid-south-asian-university-campus-2802739-2025-10-14",
      "headline": "Tore my clothes: Student claims gang-rape bid on university campus in DelhiThe first-year B.Tech student of Delhi's South Asian University alleged that the incident took place in an area of the campus where construction work was currently underway."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/hansal-mehta-backs-lijo-jose-pellissery-love-story-ar-rahman-onboard-for-music-2802871-2025-10-14",
      "headline": "Hansal Mehta backs Lijo Jose Pellissery's love story, AR Rahman onboard for musicFilmmaker Hansal Mehta is collaborating with Lijo Jose Pellissery and AR Rahman for a new romantic drama. The film promises a lyrical exploration of love with an original Rahman score, generating high expectations in Indian cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/bison-trailer-dhruv-vikram-kabaddi-drama-diwali-release-2802843-2025-10-14",
      "headline": "Bison trailer: Dhruv Vikram is an intense kabaddi player dealing with oppressionDhruv Vikram leads 'Bison', a sports drama centred on kabaddi, directed by Mari Selvaraj. The trailer showcases intense scenes set in the 1990s southern Tamil Nadu, with kabaddi central to the story."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-virat-kohli-australia-odis-shubman-gill-captain-message-2802881-2025-10-14",
      "headline": "Do your magic: Rohit Sharma and Virat Kohli get cool message from Shubman Gill India tour of Australia: Shubman Gill backed Virat Kohli and Rohit Sharma to continue their prolific run in one-day internationals as they return to international cricket in a three-match ODI series starting on 19 October. Gill will lead the ODI side for the first time after taking over from Rohit as captain.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/border-clashes-spill-onto-pitch-afghanistan-to-boycott-pak-tri-series-ytvd-2802876-2025-10-14",
      "headline": "Border Clashes Spill Onto Pitch: Afghanistan To Boycott Pak Tri-Series? The upcoming T20I triangular cricket series between Pakistan, Afghanistan, and Sri Lanka is in jeopardy following intense military conflict between Islamabad and Kabul. According to reports, Pakistan Cricket Board (PCB) Chairperson Mohsin Naqvi has asked the International Cricket Council to 'start working on an alternate plan as he wants the Tri-Series to go ahead'. The series is scheduled from November 17 to 29. However, with deadly clashes reported along the Durand Line, there are serious doubts over Afghanistan's participation. This development also comes just a week after Afghanistan's Foreign Minister, Amir Khan Muttaqi, concluded a high-profile visit to India. The PCB is reportedly already mulling alternative plans, including a bilateral series with Sri Lanka, to ensure the cricketing window is utilized."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nitish-reddy-india-vs-west-indies-2802866-2025-10-14",
      "headline": "Curious case of Nitish Kumar Reddy: Prized all-rounder goes missing in Delhi Nitish Kumar Reddy was promised to play a starring role in the Delhi Test by the Indian team management, but it became a case of serious underutilization. With the aim to build a pace-bowling all-rounder, India fumbled with Nitish in Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/captain-gills-dream-start-india-whitewashes-west-indies-2-0-in-test-series-ytvd-2802868-2025-10-14",
      "headline": "Captain Gill's Dream Start: India Whitewashes West Indies 2-0 In Test Series. This special report focuses on India's dominant 2-0 Test series victory over the West Indies, marking a momentous first series win for new captain Shubman Gill. 'What an outstanding start Shubham Gill has had to his captaincy career,' says cricket analyst Nikhil, capturing the sentiment of the cricketing world. The series concluded in Delhi with a decisive seven-wicket victory for the hosts, successfully chasing down a target of 121. This whitewash provides a significant boost for a young Indian team under Gill's fresh leadership, especially as they prepare for tougher challenges ahead, including an upcoming white-ball tour of Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravindra-jadeja-gautam-gambhir-new-batting-role-india-series-win-west-indies-2802840-2025-10-14",
      "headline": "Gautam Gambhir told me to think more as proper batter at No.6: Ravindra Jadeja Star India all-rounder Ravindra Jadeja said on Tuesday that moving up to number six in the batting order has helped him think 'more as a proper batter,' crediting head coach Gautam Gambhir for a change he believes has brought out the best in him."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-harshit-rana-kris-srikkanth-youtube-2802826-2025-10-14",
      "headline": "Targeting Harshit Rana for YouTube views shameful: Gambhir slams Srikkanth India head coach Gautam Gambhir has ripped into former India cricketer Kris Srikkanth for criticising Harshit Rana's selection in the national team. Gambhir said that it is a little shameful that people are targetting the pacer just to run their YouTube channels."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-arrives-new-delhi-airport-video-black-white-style-australia-tour-2802818-2025-10-14",
      "headline": "Watch: Virat Kohli rocks black and white as he arrives in Delhi ahead of Australia tour Former captain Virat Kohli arrived in New Delhi from London on Tuesday. He, along with Rohit Sharma, will depart with a batch of Indian cricketers for Australia on Wednesday ahead of a three-match ODI series, starting October 19 in Perth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-future-2027-odi-world-cup-gautam-gambhir-india-australia-2802816-2025-10-14",
      "headline": "Gautam Gambhir pragmatic on Rohit Sharma, Virat Kohli's 2027 World Cup chances India head coach Gautam Gambhir has broken his silence on the prospects of Virat Kohli and Rohit Sharma featuring in the 2027 ODI World Cup in South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-match-report-2nd-test-delhi-2802762-2025-10-14",
      "headline": "Shubman Gill's India stamp authority, win first Test series under new captain Shubman Gill won his first Test series as captain after India hammered West Indies 2-0 at home. On the final day of the 2nd Test, Gill's India won with 7 wickets in hand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-odoi-series-josh-inglis-adam-zampa-2802697-2025-10-14",
      "headline": "IND vs AUS: Josh Inglis, Adam Zampa ruled out series opener India vs Australia: Wicketkeeper Josh Inglis and spinner Adam Zampa have been ruled out of Australia's side for their first ODI against India. Inglis has failed to recover from his calf strain in time for the opener."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-arrives-new-delhi-airport-video-black-white-style-australia-tour-2802818-2025-10-14",
      "headline": "Watch: Virat Kohli rocks black and white as he arrives in Delhi ahead of Australia tour Former captain Virat Kohli arrived in New Delhi from London on Tuesday. He, along with Rohit Sharma, will depart with a batch of Indian cricketers for Australia on Wednesday ahead of a three-match ODI series, starting October 19 in Perth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-future-2027-odi-world-cup-gautam-gambhir-india-australia-2802816-2025-10-14",
      "headline": "Gautam Gambhir pragmatic on Rohit Sharma, Virat Kohli's 2027 World Cup chances India head coach Gautam Gambhir has broken his silence on the prospects of Virat Kohli and Rohit Sharma featuring in the 2027 ODI World Cup in South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-match-report-2nd-test-delhi-2802762-2025-10-14",
      "headline": "Shubman Gill's India stamp authority, win first Test series under new captain Shubman Gill won his first Test series as captain after India hammered West Indies 2-0 at home. On the final day of the 2nd Test, Gill's India won with 7 wickets in hand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-odoi-series-josh-inglis-adam-zampa-2802697-2025-10-14",
      "headline": "IND vs AUS: Josh Inglis, Adam Zampa ruled out series opener India vs Australia: Wicketkeeper Josh Inglis and spinner Adam Zampa have been ruled out of Australia's side for their first ODI against India. Inglis has failed to recover from his calf strain in time for the opener."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-wi-brian-lara-pens-emotional-note-west-indies-cricket-delhi-test-2802695-2025-10-14",
      "headline": "Brian Lara pens emotional note for West Indies cricket after attending Delhi TestWest Indies legend Brian Lara penned a heartfelt note for the West Indies cricket team after attending the second Test against India at the Arun Jaitley Stadium in Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-2nd-test-day-5-live-score-shubman-gill-rahul-sai-delhi-2802696-2025-10-14",
      "headline": "Day 5: India complete 2-0 series sweep over West IndiesIndia (IND) vs West Indies (WI), 2nd Test Day 5 Highlights: KL Rahul scored a crucial fifty as India secured a seven-wicket victory over the West Indies, completing a 2-0 series whitewash on Day 5 of the second Test in Delhi. This marks India's first Test series win under Shubman Gill's captaincy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-virat-kohli-return-gautam-gambhir-shubman-gill-test-2802688-2025-10-14",
      "headline": "The Ro-Ko return: New leaders Gautam Gambhir and Shubman Gill in hot seatRohit Sharma and Virat Kohli return to international cricket this week, six months after their last outing. The spotlight now falls on Shubman Gill and Gautam Gambhir, who face a crucial test in ensuring a smooth transition on India's path to the 2027 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-nitish-reddy-bowling-2802687-2025-10-14",
      "headline": "Nitish Reddy not bowling in Delhi Test? Decision baffles Aakash ChopraIndia vs West Indies: All rounder Nitish Kumar Reddy bowled a grand total of 4 overs in the 2-match Test series vs West Indies. The lack of overs for the player has baffled many, including Aakash Chopra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-kohli-india-vs-australia-vijay-hazare-2802346-2025-10-14",
      "headline": "Virat Kohli and Rohit Sharma should play Vijay Hazare Trophy: Parthiv PatelFormer cricketer Parthiv Patel has urged senior India cricketers Virat Kohli and Rohit Sharma to participate in the Vijay Hazare Trophy. Parthiv requests the senior duo to play domestic cricket to maintain cricketing fitness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/aman-sehrawat-appeals-wfi-ban-after-weight-miss-world-championships-2802677-2025-10-14",
      "headline": "Wrestler Aman Sehrawat pleads WFI to reconsider ban on him, admits mistakeParis Olympics bronze medalist grappler Aman Sehrawat on Monday appealed to the Wrestling Federation of India (WFI) to reconsider the one-year ban handed to him for missing weight at the World Championships in Zagreb."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harbhajan-singh-on-rohit-sharma-virat-kohli-australia-tour-2025-2802631-2025-10-14",
      "headline": "Eager to see Ro-Ko back in Australia, hope Kohli scores 2 hundreds: HarbhajanHarbhajan Singh said that he is excited to see Rohit Sharma and Virat Kohli back in action during the Australia tour. Harbhajan also hopes that Kohli will score atleast two hundreds during the tour down under. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nigar-sultana-bangladesh-heartbreaking-loss-south-africa-womens-world-cup-2025-2802618-2025-10-13",
      "headline": "Bangladesh captain Nigar Sultana says team left in tears after heartbreaking SA lossBangladesh captain Nigar Sultana said that her team was left in tears after their heartbreaking loss to South Africa in Vizag. Sultana said she was proud of the team's efforts in the close encounter against the Proteas. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-kohli-india-vs-australia-vijay-hazare-2802346-2025-10-14",
      "headline": "Virat Kohli and Rohit Sharma should play Vijay Hazare Trophy: Parthiv PatelFormer cricketer Parthiv Patel has urged senior India cricketers Virat Kohli and Rohit Sharma to participate in the Vijay Hazare Trophy. Parthiv requests the senior duo to play domestic cricket to maintain cricketing fitness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/aman-sehrawat-appeals-wfi-ban-after-weight-miss-world-championships-2802677-2025-10-14",
      "headline": "Wrestler Aman Sehrawat pleads WFI to reconsider ban on him, admits mistakeParis Olympics bronze medalist grappler Aman Sehrawat on Monday appealed to the Wrestling Federation of India (WFI) to reconsider the one-year ban handed to him for missing weight at the World Championships in Zagreb."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harbhajan-singh-on-rohit-sharma-virat-kohli-australia-tour-2025-2802631-2025-10-14",
      "headline": "Eager to see Ro-Ko back in Australia, hope Kohli scores 2 hundreds: HarbhajanHarbhajan Singh said that he is excited to see Rohit Sharma and Virat Kohli back in action during the Australia tour. Harbhajan also hopes that Kohli will score atleast two hundreds during the tour down under. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nigar-sultana-bangladesh-heartbreaking-loss-south-africa-womens-world-cup-2025-2802618-2025-10-13",
      "headline": "Bangladesh captain Nigar Sultana says team left in tears after heartbreaking SA lossBangladesh captain Nigar Sultana said that her team was left in tears after their heartbreaking loss to South Africa in Vizag. Sultana said she was proud of the team's efforts in the close encounter against the Proteas. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/play-the-spinners-effectively-maddy-green-on-how-new-zealand-can-beat-sri-lanka-2802606-2025-10-13",
      "headline": "Play the spinners effectively: Maddy Green on how New Zealand can beat Sri LankaNew Zealand's Maddy Green believes that the key to beating Sri Lanka in their World Cup league-fixtures is to play their spinners effectively. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/weve-done-well-against-new-zealand-in-the-past-but-thats-history-rumesh-ratnayake-2802596-2025-10-13",
      "headline": "We've done well against New Zealand in the past, but that's history: Rumesh RatnayakeSri Lanka head coach, Rumesh Ratnayake, believes that their side may have done well against New Zealand in the recent past, but now it doesn't matter as they face a crucial game in the league stages."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sa-vs-ban-womens-world-cup-marizanne-kapp-chloe-tryon-south-africa-survive-bangladesh-scare-2802589-2025-10-13",
      "headline": "Women's World Cup: Kapp-Tryon fifties help South Africa survive Bangladesh scareWomen's World Cup 2025: Bangladesh's spirited bowling effort and late drama in the field weren't enough as South Africa's experienced duo, Marizanne Kapp and Chloe Tryon, held their nerve to seal a tense three-wicket win in a thriller at the Women's World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-wi-west-indies-counter-kuldeep-yadav-2nd-innings-delhi-test-2802560-2025-10-13",
      "headline": "How West Indies countered Kuldeep Yadav after taking five wickets in first inningsKuldeep Yadav dominated West Indies in the first innings with a five-wicket haul. Despite this, Campbell and Hope's twin centuries in the second innings showcased West Indies' resilience and tactical adaptation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/italy-world-cup-qualifier-gennaro-gattuso-israel-clash-must-win-2802553-2025-10-13",
      "headline": "Italy's road to redemption: Gattuso warns of Israel danger in must-win tieItaly prepares for a decisive World Cup qualifying match against Israel in Udine, as coach Gennaro Gattuso warns of Israel's attacking quality and heightened security measures accompany a large pro-Palestinian march in the city."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/joe-root-confident-to-end-century-drought-lead-england-ashes-2025-australia-2802539-2025-10-13",
      "headline": "Ashes 2025: Freed from captaincy, Joe Root ready to end century dry spell Down UnderJoe Root is determined to end his century drought in Australia during the 2025 Ashes series. His renewed focus and team-first mindset could be key to England reclaiming the Ashes urn."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ind-vs-wi-2nd-test-delhi-test-washington-sundar-press-conference-2802538-2025-10-13",
      "headline": "IND vs WI, 2nd Test: Washington Sundar jokes about Delhi Test going to Day 5India vs West Indies: After West Indies' spirited batting display on Day 4, Washington Sundar praised the Indian bowlers, saying taking 20 wickets on a slow Delhi pitch was commendable. India are closing in on a dominant win in the capital and a 2-0 series sweep.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-fitness-criticism-sanjay-bangar-india-tour-of-australia-2802534-2025-10-13",
      "headline": "Rohit Sharma worked hard after being called out for fitness, reveals ex-coachFormer India batting coach Sanjay Bangar compared Rohit Sharma's recent fitness transformation ahead of his ODI comeback in Australia to the hard work he put in after being dropped from the 2011 World Cup squad. Rohit has reportedly shed 10 kg as he gears up for his first international appearance since March."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}