{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-rises-over-500-points-whats-behind-todays-bull-run-on-dalal-street-2671828-2025-01-29",
      "headline": "Sensex rises over 500 points: What's behind today's bull run on Dalal StreetShare Market Today: The S&P BSE Sensex was trading 508.25 points higher at 76,409.66 at 1:10 pm, while the NSE Nifty50 rose 170.15 points to trade at 23,127.40."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/budget-2025-will-taxpayers-get-relief-income-tax-changes-to-watch-out-for-2671823-2025-01-29",
      "headline": "Budget 2025: Will taxpayers get relief? Income tax changes to watch out forThe current income-tax law is complex for average taxpayers due to its technical jargon and numerous provisos, circulars, and notifications. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/budget-2025-old-tax-regime-vs-new-tax-regime-which-is-better-tax-relief-finance-minister-nirmala-sitharaman-2671804-2025-01-29",
      "headline": "Budget 2025: Old tax regime vs new tax regime; which is better?Union Budget 2025: The new tax regime was first introduced in Union Budget 2020-21 by inserting a new section, 115BAC, in the Income Tax Act for individuals and Hindu Undivided Families (HUFs)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-auto-share-price-rises-5-percent-after-q3-results-buy-hold-or-sell-2671798-2025-01-29",
      "headline": "Bajaj Auto share price rises 5% after Q3 results: Buy, hold or sell?Bajaj Auto stock price: The two-wheeler company's stock rose over 5% to hit a day's high of Rs 8,803.70 on the Bombay Stock Exchange (BSE). At around 12:27 pm, shares of the company were trading 3.70% higher at Rs 8,702.90.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/deepseek-low-cost-artificial-intelligence-models-benefit-indian-it-firms-explained-2671783-2025-01-29",
      "headline": "Will DeepSeek's low-cost AI models benefit Indian IT firms like TCS, Infosys? Analysts at Motilal Oswal Financial Services suggested that a shift from high-cost AI infrastructure to more affordable alternatives could open new opportunities for Indian IT services firms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rising-today-sensex-nifty-gain-3-key-things-to-know-2671729-2025-01-29",
      "headline": "Why is the stock market rising today? 3 things to knowShare Market Today: The Sensex and Nifty50 gained in early trade and experts believe the conditions are favourable for more gains. However, it will depend on key developments, like the US Fed's policy decision and the Union Budget 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/itc-hotels-share-price-stock-lists-at-30-percent-discount-on-nse-rs-180-bse-listing-2671718-2025-01-29",
      "headline": "ITC Hotels share price: Stock lists at 30% discount on NSE ITC Hotels shares listing: ITC Hotels shares opened at Rs 188 on the Bombay Stock Exchange (BSE), listing at a discount of 31% to the discovered price. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-opening-bell-sensex-nifty-open-in-green-as-it-and-auto-stocks-rise-bajaj-auto-gains-4-percent-2671699-2025-01-29",
      "headline": "Sensex, Nifty open in green as IT and auto stocks rise; Bajaj Auto gains 4%The S&P BSE Sensex added 221 points to 76,122.41, while the NSE Nifty50 gained 66.40 points to 23,023.65 as of 9:35 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-stock-market-wall-street-tech-stocks-apple-meta-alphabet-oracle-recover-a-day-after-deepseek-selloff-hit-nvidia-2671681-2025-01-29",
      "headline": "Wall Street tech stocks recover a day after DeepSeek selloff hit NvidiaNvidia, which lost 17% in Monday's session, the biggest one-day loss in market history, rose 8.9% on Tuesday as investors looked for buying opportunities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/former-intel-ceo-pat-gelsinger-bets-on-this-ai-stock-nvidia-amid-deepseek-rise-chinese-startup-check-here-2671670-2025-01-29",
      "headline": "Former Intel CEO Pat Gelsinger bets on this AI stock amid DeepSeek's riseThe rise of Chinese artificial intelligence (AI) startup DeepSeek caused a huge reaction in the stock market, leading to a $600 billion drop in Nvidia's market value. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-tax-benefits-under-old-tax-regime-hra-80c-standard-deduction-be-available-under-new-tax-regime-get-details-2671567-2025-01-28",
      "headline": "Budget 2025: Will 80C and standard deduction be available under new tax regime?Under the old tax regime, a standard deduction of Rs 50,000 is available for the salaried class, while under the new tax regime, the same has been increased to Rs 75,000."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/making-upi-payments-with-credit-card-a-good-decision-or-a-risky-habit-check-details-2671439-2025-01-28",
      "headline": "Is linking your credit card with UPI a risky habit? Know hereUPI payments reached Rs 2.34 lakh crore in October 2024, recording a rise of 37% from last year, as per the RBI's latest report."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/boeing-annual-result-118-billion-annual-loss-largest-since-2020-share-price-dips-ceo-kelly-ortberg-said-company-to-focus-on-core-business-2671505-2025-01-28",
      "headline": "Boeing reports $11.8 billion in annual loss, largest since 2020Boeing posted an annual loss of $11.83 billion owing to problems at its commercial and defense units, reported Reuters."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/itc-hotels-bse-nse-market-listing-eligibility-and-other-details-2670948-2025-01-28",
      "headline": "ITC Hotels to list on BSE, NSE tomorrow. Check eligibility and other key details Earlier this month, ITC Ltd allotted equity shares of ITC Hotels amounting to Rs 125.11 crore to its shareholders and the latter ceased to be a subsidiary of ITC ltd."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-big-liquidity-boost-what-it-means-for-the-economy-central-bank-to-inject-rs-60000-crore-into-economy-know-the-3-steps-2671369-2025-01-28",
      "headline": "RBI's big liquidity boost: What it means for the economy The RBI has announced OMO purchase auctions of Government of India securities for an aggregate amount of Rs 60,000 crore in three tranches of Rs 20,000 crore each."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-end-higher-but-volatility-caps-gains-key-things-to-know-2671362-2025-01-28",
      "headline": "Sensex, Nifty end higher but volatility caps gains. All you need to knowStock Market Today: The S&P BSE Sensex closed 535.24 points higher at 75,901.41, while the NSE Nifty settled 146.90 points higher at 22,976.05."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rebounds-today-but-volatility-remains-high-investor-strategy-2671291-2025-01-28",
      "headline": "Stock market rebounds but remains volatile. What should investors do? Indian Share Market: Should the increased stock market volatility prompt investors to exit the market, or is it better to stay calm and stick with their investments? Should they even consider adding more to their portfolios?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/200-uk-companies-to-move-to-permanent-4-day-work-week-with-no-pay-loss-2671268-2025-01-28",
      "headline": "200 UK companies sign up for 4-day workweek amid '70-hour debate' in IndiaThe 4 Day Week Foundation campaign director, mentioned that the traditional 9-5, five-day working week which was invented 100 years ago, is now outdated."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/spicejet-share-price-ground-boieng-737-max-jet-operational-january-29-2671246-2025-01-28",
      "headline": "Explained: Why SpiceJet shares rose 4% todaySpiceJet shares were trading 3.94% higher at Rs 45.60 on the Bombay Stock Exchange at around 12:54 pm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ubs-to-lay-off-nearly-3000-employees-post-credit-suisse-takeover-says-report-2671194-2025-01-28",
      "headline": "UBS to lay off nearly 3,000 employees post Credit Suisse takeover: Report UBS Group AG: The impacted employees have been given an option to join a program that allows up to a year to find a new role within the bank."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-storyteller-satyajit-ray-vintage-storytelling-at-its-most-beautiful-in-paresh-rawal-adil-hussain-film-2671785-2025-01-29",
      "headline": "The Storyteller review: Satyajit Ray's vintage storytelling at its most beautifulReleased-Tue Jan 28, 2025The Storyteller is derived from Satyajit Ray's short story. It features Paresh Rawal and Adil Hussain in the pivotal roles, but it's the stories told in the film and the essence of storytelling that elevate the film. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/karan-veer-mehra-chum-darang-farah-khan-aditi-rao-hydari-siddharth-javed-akhtar-birthday-2671792-2025-01-29",
      "headline": "BB 18's Karan Veer, Chum Darang party with Farah Khan, Aditi-Siddharth and othersKaran Veer Mehra along with Chum Darang were among the other guests at Javed Akhtar's birthday bash. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-mehta-boys-trailer-boman-irani-avinash-tiwary-explore-father-son-dynamics-prime-video-2671791-2025-01-29",
      "headline": "The Mehta Boys trailer: Boman Irani, Avinash Tiwary explore father-son dynamicsThe first full trailer of The Mehta Boys is here, and it promises a heartfelt and layered story about a father-son relationship. Directed by Irani, the film will premiere on Prime Video in February. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/exclusive-squid-game-star-park-gyu-young-wants-to-play-a-happy-virus-in-bollywood-2671780-2025-01-29",
      "headline": "Exclusive: Squid Game star Park Gyu-young wants to play a 'happy virus' in BollywoodSouth Korean star Park Gyu-young opened up about her solitary experience filming Squid Game 2 and her interest in Bollywood roles. She also humorously addressed BTS' V cameo rumours for Season 3."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-trauma-code-heroes-on-call-review-ju-ji-hoon-netflix-medical-show-cha-youngwoo-ha-young-2671430-2025-01-29",
      "headline": "The Trauma Code review: Ju Ji-hoon's medical show deserves more than just 8 episodesReleased-Fri Jan 24, 2025The Trauma Code Heroes on Call is Netflix's latest K-drama offering. Featuring a stellar starcast led by Ju Ji-hoon, read our review to find out if it is your cup of tea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/jonas-brothers-kevin-jonas-joe-jonas-nick-jonas-announce-new-christmas-film-2671720-2025-01-29",
      "headline": "Jonas Brothers announce new Christmas film, to release later this yearThe Jonas Brothers have announced a new Christmas film. It is set to premiere on Disney+ Hotstar later this year. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/video/it-exclusive-squid-game-2-actor-park-gyu-young-on-bollywood-her-role-bts-v-cameo-rumours-2671710-2025-01-29",
      "headline": "IT Exclusive: Squid Game actor Park Gyu-young on Bollywood, her role, BTS V Park Gyu-young, starring in Squid Game 2 as a North Korean defector, spoke to India Today's Bhavna Agarwal about filming solo, feeling lonely on set, and her interest in Bollywood. She also reacted to the viral BTS' V cameo rumor in Season 3, sparking excitement for the Netflix series."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/video/it-exclusive-yim-siwan-and-jo-yuri-want-to-star-in-bollywood-rom-com-squid-game-2-bts-v-cameo-2671698-2025-01-29",
      "headline": "Exclusive interview with Yim Siwan and Jo Yuri on India Today In an exclusive chat with India Today's Bhavna Agarwal, the Squid Game 2 stars Yim Siwan and Jo Yuri opened up about their roles, life lessons for their characters, thoughts on starring together in a non-toxic drama, and if they would like to star in a Bollywood film together."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/cigarettes-after-sex-cancels-bengaluru-concert-technical-issue-ahmedabad-2671666-2025-01-29",
      "headline": "Cigarettes After Sex cancels Bengaluru show at the last minute. Here's whyIndie-pop band Cigarettes After Sex cancelled their Bengaluru concert at the last minute, citing local production issues. This left fans agitated, with many expressing their frustration and disappointment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bookmyshow-ceo-on-coldplay-ticket-chaos-first-time-we-tried-democratic-ticketing-2671564-2025-01-28",
      "headline": "BookMyShow CEO on Coldplay ticket chaos: First time we tried democratic ticketingAshish Hemrajani, CEO of BookMyShow, addressed the chaos surrounding Coldplay concert tickets in India, explaining that they employed a democratic ticketing system, which required everyone to join a queue and prevented individuals from using their privilege to gain unfair access."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shilpa-shinde-bigg-boss-makers-decide-winner-2671562-2025-01-28",
      "headline": "Actor Shilpa Shinde accuses Bigg Boss makers of rigging resultsTV actor Shilpa Shinde called out Bigg Boss makers for deciding the winner themselves, saying the audience has figured out their strategy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/armaan-malik-sad-musicians-have-keep-drilling-themselves-people-heads-exclusive-2671541-2025-01-28",
      "headline": "Armaan Malik: Sad that musicians have to keep drilling themselves in people's headsSinger Armaan Malik spoke to India Today Digital about the challenges musicians face to stay relevant in a competitive industry. He also spoke about the evolving concert culture in India and the rise of independent music."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/roadies-prince-narula-fights-elvish-yadav-for-teaming-up-with-rhea-chakrobarty-2671537-2025-01-28",
      "headline": "Roadies XX: Prince Narula hits out at Elvish Yadav for teaming up with RheaPrince Narula clashed with Elvish Yadav and Rhea Chakraborty in the latest episode of MTV Roadies: Double Cross after they teamed up to bid for a contestant he wanted. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bookmyshow-ceo-reacts-to-pms-push-for-a-concert-economy-after-coldplay-india-tour-2671518-2025-01-28",
      "headline": "BookMyShow CEO reacts to PM's push for a 'concert economy' after Coldplay tourColdplay's recent concerts in Navi Mumbai and Ahmedabad have left audiences in awe. India Today spoke with BookMyShow's CEO about the event's success and India's potential as a global concert destination."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/aryan-khan-interacts-with-team-on-set-of-his-netflix-series-stardom-2671422-2025-01-28",
      "headline": "Watch: Aryan Khan interacts with team on set of his Netflix series StardomSuperstar Shah Rukh Khan's son Aryan Khan is all set to make his showbiz debut with the Netflix series Stardom, which he will be directing. It will reportedly star Mona Singh in a pivotal role. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rekha-brings-elegance-to-ghum-hai-kisikey-pyaar-meiin-promo-watch-2671377-2025-01-28",
      "headline": "Rekha brings elegance to Ghum Hai Kisikey Pyaar Meiin promo as show takes new leapRekha introduces new characters in the promo of Ghum Hai Kisikey Pyaar Meiin's new season, which promises to explore love and sacrifice. The show will premiere on January 30 at 8 pm on Star Plus."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/black-warrant-kartar-ujagar-singh-hanging-case-real-story-zahaan-kapoor-vikramaditya-motwane-2671344-2025-01-28",
      "headline": "Black Warrant's Kartar-Ujagar Singh and their real-story: Hanged for Rs 500?Vikramaditya Motwane's Black Warrant shows the real-life story of two brothers, Kartar and Ujagar Singh, who were executed for a crime orchestrated by a Delhi doctor. But why were they hanged while the man who hired him walked free? Read on to know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/squid-game-2-actors-yim-siwan-and-jo-yuri-on-squid-game-2-bollywood-bts-v-cameo-rumours-2671331-2025-01-28",
      "headline": "Exclusive: Yim Si-wan, Jo Yu-ri talk about Squid Game 2, Bollywood, and moreYim Si-wan and Jo Yu-ri, stars of Netflix's Squid Game 2, discussed their roles and aspirations for lighter dramas in an exclusive interview with India Today Digital. They also revealed interest in Bollywood and reacted to BTS V cameo rumours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rakhi-sawant-third-marriage-shaadi-pakistan-mein-hogi-2671310-2025-01-28",
      "headline": "Rakhi Sawant plans to marry again: 'Shaadi Pakistan mein hogi, Islamic rituals'Rakhi Sawant shared her plans to marry a Pakistani suitor, Dodi Khan, in Pakistan, reception in India, and honeymoon in Europe. The Bigg Boss fame was previously married to businessman Adil Khan Durrani. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/lady-gaga-announces-new-album-mayhem-2671232-2025-01-28",
      "headline": "Lady Gaga announces new album MayhemPop star Lady Gaga has announced her new album, Mayhem, which will release in March. It will consist of 14 songs in total. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/pm-narendra-modi-arvind-kejriwal-delhi-assembly-elections-arvind-kejriwal-haryana-poisoning-row-yamuna-2671846-2025-01-29?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "I'm also drinking Yamuna water: PM jabs Arvind Kejriwal over 'poisoning' claimAddressing a rally in Delhi, Prime Minister Narendra Modi renewed his AAP-da (disaster) charge on AAP chief Arvind Kejriwal over his 'Haryana poisoning Yamuna' claim and questioned the intention of making such remarks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/7-injured-in-a-stampede-during-the-mauni-amavasya-bath-at-maha-kumbh-2671652-2025-01-29?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "PM Modi condoles deaths of devotees in stampede at Maha Kumbh  Live UpdatesAt least 10 people are feared dead and several people injured after a stampede at the Maha Kumbh. Uttar Pradesh Chief Minister Yogi Adityanath said the situation was under control and urged devotees not to fall for rumours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/uk-news/story/uk-leaked-report-hindu-nationalism-pro-khalistani-extremism-threats-britain-islamist-left-wing-2671734-2025-01-29?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Hindu nationalism, Khalistani extremism among new threats: Leaked UK govt reportA UK Home Office commission, set up in August 2024, has flagged Hindu nationalist extremism and Khalistani extremism among nine emerging threats to national security, according to its now-leaked report. This marks the first time that Hindutva has been recognised as an \"ideology of concern\" in the UK, following the 2022 Leicester clashes between Hindus and Muslims after an India-Pakistan cricket match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/delhi-elections-2025-why-gurmeet-ram-rahim-is-messenger-of-god-for-one-nation-one-election-opinion-2671845-2025-01-29?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why Gurmeet Ram Rahim is Messenger of God for One Nation, One ElectionOne nation, one parole would be among the biggest advantages of One Nation, One Election. And who would be a better messenger of it than Gurmeet Ram Rahim, who is let out on parole ahead of every election? One Nation, One Election would save time and paperwork spent on the politically-relevant convicts every election cycle. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/science/story/what-is-doomsday-clock-that-puts-humanity-89-seconds-away-from-annihilation-2671837-2025-01-29?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "What is Doomsday Clock, now 89 seconds away from annihilation?Physicists like J. Robert Oppenheimer and Albert Einstein were among the creators of Doomsday Clock, who aimed to give a visual depiction of the threat presented by nuclear weapons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-medical-seats-pg-domicile-reservation-cancel-mbbs-right-to-equality-violation-2671812-2025-01-29?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Violates equality: Supreme Court cancels domicile-based PG medical quotasPG medical seats: The Supreme Court said admissions to PG medical courses should strictly be based on merit even though it clarified that the verdict would not affect the reservations already granted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-asks-elon-musk-spacex-bring-back-sunita-williams-stranded-space-station-2671750-2025-01-29?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump asks Elon Musk to 'go get' Sunita Williams, says Biden abandoned herSunita Williams and Butch Wilmore have been stranded on the space station for seven months, since June 2024. They are supposed to return on SpaceX's Crew-10 spacecraft in March."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/woman-dies-of-heart-attack-as-doctor-watches-instagram-facebook-reels-in-up-mainpuri-hospital-2671810-2025-01-29?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Doctor scrolls through reels as woman dies of heart attack in UP hospitalMainpuri News: The incident, which took place in the district's Maharaja Tej Singh District Hospital, has sparked outrage amongst the patient's family members."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/maha-kumbh-mela-stampede-up-prayagraj-stampede-injury-2671695-2025-01-29?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "From 1954 to 2025, major stampedes that Kumbh Mela witnessedMaha Kumbh Stampede: A tragic stampede occurred during the Mahakumbh Mela 2025 at the Sangam Ghat in Prayagraj on Mauni Amavasya, resulting in at least 10 fatalities and many injuries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-payouts-federal-employees-resign-us-government-size-bureaucracy-2671664-2025-01-29?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "If you wish to resign, select 'Reply': Trump's buyout offer to federal employeesIn an unprecedented move to shrink the US government workforce, President Donald Trump has offered seven-month payouts to all federal employees who opt to leave their posts voluntarily by February 6."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/newly-discovered-asteroid-could-hit-earth-in-2032-2671824-2025-01-29?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Newly discovered asteroid could hit Earth in 2032Asteroid 2024 YR4 has a 1-in-83 chance of striking Earth in December of 2032 as it continues to move in its orbit around 27 million miles away from Earth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/varun-chakravarthy-cricket-icc-t20i-rankings-india-vs-england-2671847-2025-01-29?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Chakravarthy breaks into top 5 of T20I rankings after 5-wicket haul IND vs ENG: Varun Chakravarthy has jumped 25 places up to No.5 in the latest ICC rankings for T20I bowlers. Chakravarthy has taken 10 wickets in the series so far against England with a five-wicket haul at the Niranjan Shah Stadium in Rajkot. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-storyteller-satyajit-ray-vintage-storytelling-at-its-most-beautiful-in-paresh-rawal-adil-hussain-film-2671785-2025-01-29?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "The Storyteller review: Satyajit Ray's vintage storytelling at its most beautifulReleased-Tue Jan 28, 2025The Storyteller is derived from Satyajit Ray's short story. It features Paresh Rawal and Adil Hussain in the pivotal roles, but it's the stories told in the film and the essence of storytelling that elevate the film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/congress-delhi-manifesto-assembly-elections-women-monthly-cash-free-electricity-youth-cooking-gas-ration-2671808-2025-01-29?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Quota for transgenders, Rs 2,500 for women in Congress's Delhi manifestoA caste census in the national capital, Rs 2,500 for women, reservations for transgender individuals, 300 units of free electricity, and a monthly stipend for youth are among promises in the Congress manifesto for the Delhi polls."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/john-abraham-to-star-with-priyanka-chopra-in-ss-rajamouli-mahesh-babu-2671835-2025-01-29?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "John Abraham to star with Priyanka Chopra in SS Rajamouli's next: ReportActor and producer John Abraham is reportedly replacing Malayalam actor Prithviraj Sukumaran in director SS Rajamouli's next -- an epic adventure film starring Mahesh Babu in the lead. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/waqf-draft-bill-amended-version-proposed-law-parliament-panel-jpc-adopt-submit-dissent-members-2671762-2025-01-29?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Parliament panel adopts draft Waqf bill, members asked to submit dissent till 4 pmSo far, Trinamool Congress MPs Kalyan Banerjee and Nadimul Haque, along with DMK MP A Raja, AAP leader Sanjay Singh, and Shiv Sena (UBT) MP Arvind Sawant, have formally submitted their dissent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-witty-reply-fan-asked-can-i-touch-you-profess-love-dubai-event-2671705-2025-01-29?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Video: Shah Rukh Khan's fan asks, 'Can I touch you?', actor gives a witty replyShah Rukh Kha's recent interaction with his fans at an event in Dubai turned memorable after his witty replies caught the attention of all. In one of the viral videos, the actor replied to a fan who requested to 'touch him' once. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mahakumbh-stampede-horror-prayagraj-triveni-sangam-eyewitnesses-account-arrangements-2671719-2025-01-29?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Pushed by crowd, no space to exit: Eyewitnesses recount Kumbh stampede horrorEyewitnesses recounted the horror they endured during the Maha Kumbh stampede, where 10 people were feared dead, and said the Mela area was crowded for the holy dip at Sangam and there was lack of space for people to leave the spot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-ranji-trophy-return-previous-records-major-milestones-stats-2671849-2025-01-29?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "In stats: How good was Virat Kohli in Ranji TrophyRanji Trophy: Virat Kohli is all set to return to the domestic tournament after a gap of 13 years. The 36-year-old wil play for Ayush Badoni-led Delhi against Railways at Arun Jaitley Stadium in Delhi from Thursday, January 30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-nitish-stalin-pinarayi-have-united-against-modi-govt-over-new-ugc-rules-2670758-2025-01-27?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why Nitish, Stalin, Pinarayi have united against Modi govt over new UGC rulesUGC draft regulations 2025 face the ire of NDA allies and Opposition-ruled states, sparking a political, legal and ideological battle over state autonomy in higher education\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/gslv-f15-launched-successfully-what-will-isro-launch-next-2671769-2025-01-29?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "GSLV-F15 launched successfully: What will Isro launch next? GSLV-F15 Rocket Launched: Several key big missions are in the pipeline for the Indian space agency in 2025 after the NVS-02 launch on Wednesday morning. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-rises-over-500-points-whats-behind-todays-bull-run-on-dalal-street-2671828-2025-01-29?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sensex rises over 500 points: What's behind today's bull run on Dalal StreetShare Market Today: The S&P BSE Sensex was trading 508.25 points higher at 76,409.66 at 1:10 pm, while the NSE Nifty50 rose 170.15 points to trade at 23,127.40."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/male-infertility-on-the-rise-why-sperm-freezing-is-gaining-popularity-in-india-2671587-2025-01-29?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Male infertility on the rise: Why sperm freezing is gaining popularity in IndiaSperm freezing is a simple, life-altering option that ensures men can overcome challenges and secure their path to parenthood. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/canada-commission-report-india-election-interference-mea-rejects-claims-2671711-2025-01-29?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Canada report accuses India of election meddling, Centre rejects 'insinuations'The Canadian report, which comes amid a strain in ties, alleged that India might have attempted to use proxy agents to clandestinely provide financial support to preferred candidates during the 2021 election."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/yash-to-begin-shoot-for-ramayan-from-march-2671857-2025-01-29",
      "headline": "Yash to begin shoot for Ramayan from March: ReportKGF star Yash will likely start shooting Nitesh Tiwari's Ramayan from March. The film will see Ranbir Kapoor as Lord Rama and Sai Pallavi as Goddess Sita. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/john-abraham-to-star-with-priyanka-chopra-in-ss-rajamouli-mahesh-babu-2671835-2025-01-29",
      "headline": "John Abraham to star with Priyanka Chopra in SS Rajamouli's next: ReportActor and producer John Abraham is reportedly replacing Malayalam actor Prithviraj Sukumaran in director SS Rajamouli's next -- an epic adventure film starring Mahesh Babu in the lead. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/renee-zellweger-to-lead-bridget-jones-4-premiere-in-london-2671832-2025-01-29",
      "headline": "Renee Zellweger to lead Bridget Jones 4 premiere in LondonThe London premiere of Bridget Jones: Mad About the Boy will be attended by Renée Zellweger. Oscar and Golden Globe-nominated actor Chiwetel Ejiofor, who plays another of Jones's love interests, and director Michael Morris, are also expected to attend the premiere.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karan-johar-introduces-new-talent-ibrahim-ali-khan-2671805-2025-01-29",
      "headline": "KJo wears 'flagbearer of nepotism' tag as badge of honour to introduce IbrahimKaran Johar has introduced Ibrahim Ali Khan, son of Amrita Singh and Saif Ali Khan, as the latest talent from Dharma. He emphasised the family's legacy in the film industry, confident tha Ibrahim will make his mark on the audience's heart."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tilak-varma-rises-t20i-batting-ranking-overtakes-phil-salt-india-vs-england-chennai-heroics-2671852-2025-01-29",
      "headline": "Tilak Varma rises to career-best No. 2 in ICC T20I RankingsTilak Varma's meteoric rise in T20I cricket continues as the young Indian batter climbs to a career-best No. 2 in the ICC rankings, surpassing Phil Salt. With consistent performances, he now eyes the top spot held by Australia's Travis Head."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-ranji-trophy-return-previous-records-major-milestones-stats-2671849-2025-01-29",
      "headline": "In stats: How good was Virat Kohli in Ranji TrophyRanji Trophy: Virat Kohli is all set to return to the domestic tournament after a gap of 13 years. The 36-year-old wil play for Ayush Badoni-led Delhi against Railways at Arun Jaitley Stadium in Delhi from Thursday, January 30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/varun-chakravarthy-cricket-icc-t20i-rankings-india-vs-england-2671847-2025-01-29",
      "headline": "Chakravarthy breaks into top 5 of T20I rankings after 5-wicket haul IND vs ENG: Varun Chakravarthy has jumped 25 places up to No.5 in the latest ICC rankings for T20I bowlers. Chakravarthy has taken 10 wickets in the series so far against England with a five-wicket haul at the Niranjan Shah Stadium in Rajkot. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-gongadi-trisha-u19-womens-t20-world-cup-2025-celebrates-father-video-2671836-2025-01-29",
      "headline": "Watch: Gongadi Trisha hugs, celebrates historic century with proud fatherU19 Women's T20 World Cup: Gongadi Trisha celebrated her century against Scotland on Tuesday with her father, who was cheering her from near the boundary hoardings at the Bayuemas Oval in Kuala Lumpur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/neymar-santos-transfer-president-confirms-message-al-hilal-contract-termination-2671833-2025-01-29",
      "headline": "Neymar-Santos reunion confirmed by Brazilian club PresidentSantos president Marcelo Teixeira confirmed Neymar's return after his Al Hilal exit, marking an emotional homecoming for the Brazilian superstar. The 32-year-old forward reportedly accepted a significant pay cut to rejoin his boyhood club, aiming for redemption after an injury-plagued Saudi stint."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-england-fast-bowler-kate-cross-ruled-out-of-one-off-ashes-test-vs-australia-2671826-2025-01-29",
      "headline": "England fast bowler Kate Cross ruled out of one-off Ashes Test vs AustraliaEngland fast bowler Kate Cross has been ruled out of the one-off Women's Ashes Test against Australia set to be played from January 30 at the Melbourne Cricket Ground."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-womens-ashes-day-night-test-live-streaming-squads-alyssa-healy-2671803-2025-01-29",
      "headline": "Women's Ashes: All you need to know about historic Day-Night TestWomen's Ashes 2025: Alyssa Healy's Australia and Heather Knight's England are all set to lock horns in the historic Day-Night Test at the Melbourne Cricket Ground. Australia won the Ashes earlier after winning the second T20I by six runs in Canberra. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/steve-smith-10000-test-runs-joins-elites-ricky-ponting-sachin-tendulkar-australia-vs-sri-lanka-2671789-2025-01-29",
      "headline": "Smith completes 10,000 Test runs, joins list of Australian elitesAUS vs SL: Steve Smith entered the elite 10,000-run club in Test cricket, becoming the fourth Australian to achieve the feat. The Galle crowd erupted in applause as Smith reached the milestone, with Sri Lankan players also congratulating him on his historic achievement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ms-dhoni-captain-cool-icc-champions-trophy-2025-promo-drs-2671786-2025-01-29",
      "headline": "'Ice cool' MS Dhoni all ready to support India in Champions Trophy 2025Champions Trophy 2025: Legendary India captain MS Dhoni is ready to cheer for team India during the ICC Champions Trophy 2025 as he featured in a fun promo for the mega event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-vs-england-ignoring-pacers-under-using-washington-sundar-aakash-chorpa-team-selection-2671768-2025-01-29",
      "headline": "Ignoring pacers, underutilising Sundar: Chopra questions India's selectionIND vs ENG: Aakash Chopra criticised India's team selection after their Rajkot T20I loss, questioning the underuse of Washington Sundar, the absence of key pacers, and Dhruv Jurel's batting position. He believes India must fix these issues before the crucial fourth T20I in Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sl-vs-aus-1st-test-galle-travis-head-stars-with-blistering-40-ball-57-on-his-return-as-an-opener-2671756-2025-01-29",
      "headline": "Head stars with blistering 40-ball 57 on his return as an opener vs Sri LankaStar Australia batter Travis Head scored a blistering half century on his return as an opener after 22 months during the first Test against Sri Lanka in Galle. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-womens-ashes-day-night-test-live-streaming-squads-alyssa-healy-2671803-2025-01-29",
      "headline": "Women's Ashes: All you need to know about historic Day-Night TestWomen's Ashes 2025: Alyssa Healy's Australia and Heather Knight's England are all set to lock horns in the historic Day-Night Test at the Melbourne Cricket Ground. Australia won the Ashes earlier after winning the second T20I by six runs in Canberra. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/steve-smith-10000-test-runs-joins-elites-ricky-ponting-sachin-tendulkar-australia-vs-sri-lanka-2671789-2025-01-29",
      "headline": "Smith completes 10,000 Test runs, joins list of Australian elitesAUS vs SL: Steve Smith entered the elite 10,000-run club in Test cricket, becoming the fourth Australian to achieve the feat. The Galle crowd erupted in applause as Smith reached the milestone, with Sri Lankan players also congratulating him on his historic achievement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ms-dhoni-captain-cool-icc-champions-trophy-2025-promo-drs-2671786-2025-01-29",
      "headline": "'Ice cool' MS Dhoni all ready to support India in Champions Trophy 2025Champions Trophy 2025: Legendary India captain MS Dhoni is ready to cheer for team India during the ICC Champions Trophy 2025 as he featured in a fun promo for the mega event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-vs-england-ignoring-pacers-under-using-washington-sundar-aakash-chorpa-team-selection-2671768-2025-01-29",
      "headline": "Ignoring pacers, underutilising Sundar: Chopra questions India's selectionIND vs ENG: Aakash Chopra criticised India's team selection after their Rajkot T20I loss, questioning the underuse of Washington Sundar, the absence of key pacers, and Dhruv Jurel's batting position. He believes India must fix these issues before the crucial fourth T20I in Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sl-vs-aus-1st-test-galle-travis-head-stars-with-blistering-40-ball-57-on-his-return-as-an-opener-2671756-2025-01-29",
      "headline": "Head stars with blistering 40-ball 57 on his return as an opener vs Sri LankaStar Australia batter Travis Head scored a blistering half century on his return as an opener after 22 months during the first Test against Sri Lanka in Galle. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-womens-ashes-alyssa-healy-fit-mcg-day-night-test-2671759-2025-01-29",
      "headline": "Alyssa Healy fit and 'ready to go' for Women's Ashes Day-Night TestWomen's Ashes 2025: Skipper Alyssa Healy recovered from her right foot injury and declared herself fit for the Day-Night Test at the Melbourne Cricket Ground. Healy played in the ODIs, but missed the T20Is. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-suryakumar-yadav-choose-when-to-be-aggressive-michael-vaughan-rajkot-2671745-2025-01-29",
      "headline": "Suryakumar Yadav needs to choose when to be aggressive: Michael VaughanMichael Vaughan believes Suryakumar Yadav needs to adjust his batting approach, urging the India T20I skipper to settle in before attacking after his aggressive early shots led to repeated dismissals in their ongoing T20I series against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ambati-rayudu-backs-mohammed-shami-to-regain-his-rhythm-after-a-couple-of-games-2671725-2025-01-29",
      "headline": "Mohammed Shami will regain his rhythm after a few more games: Ambati RayuduFormer India cricketer Ambati Rayudu has backed fast bowler Mohammed Shami to find his rhythm again in a couple of matches after he looked far from his best on his comeback in the third T20I against England in Rajkot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-varun-chakravarthy-india-vs-england-rajkot-pitch-press-conference-2671727-2025-01-29",
      "headline": "Varun Chakravarthy explains how Rajkot pitch helped England defend 171IND vs ENG: Varun Chakravarthy said that England's bowlers got assistance from the Rajkot pitch, which got slower during India's run-chase. India lost the third T20I by 26 runs at the Niranjan Shah Stadium.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-vs-england-varun-chakravarthy-sanjay-manjrekar-challenge-2671697-2025-01-29",
      "headline": "Chakravarthy challenges batters to go at him, willing to take risks: ManjrekarIND vs ENG, 3rd T20I: Varun Chakravarthy had stupendous bowling figures of 4-0-24-5 at the Niranjan Shah Stadium, but India went on to lose the Rajkot T20I against England by 26 runs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-eng-how-under-pressure-ben-duckett-delivered-a-match-winning-50-vs-india-in-rajkot-2671694-2025-01-29",
      "headline": "How 'under pressure' Ben Duckett delivered a match-winning 50 vs India in RajkotIND vs ENG 3rd T20: England opener Ben Duckett revealed how he overcame pressure to score a match-winning half century in the third T20I against India in Rajkot. Duckett scored 51 (28) with the help of seven fours and two sixes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-vs-england-sanju-samson-kevin-pietersen-technique-rajkot-2671683-2025-01-29",
      "headline": "Samson is mentally sound, won't question his technique: Kevin PietersenIND vs ENG, 3rd T20I: Kevin Pietersen said that he's not worried about Sanju Samson's style of playing short balls against quality fast bowlers. On Tuesday, Samson scored only three runs as India slumped to a 26-run defeat in Rajkot. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-vs-england-varun-chakravarthy-sanjay-manjrekar-challenge-2671697-2025-01-29",
      "headline": "Chakravarthy challenges batters to go at him, willing to take risks: ManjrekarIND vs ENG, 3rd T20I: Varun Chakravarthy had stupendous bowling figures of 4-0-24-5 at the Niranjan Shah Stadium, but India went on to lose the Rajkot T20I against England by 26 runs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-eng-how-under-pressure-ben-duckett-delivered-a-match-winning-50-vs-india-in-rajkot-2671694-2025-01-29",
      "headline": "How 'under pressure' Ben Duckett delivered a match-winning 50 vs India in RajkotIND vs ENG 3rd T20: England opener Ben Duckett revealed how he overcame pressure to score a match-winning half century in the third T20I against India in Rajkot. Duckett scored 51 (28) with the help of seven fours and two sixes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-vs-england-sanju-samson-kevin-pietersen-technique-rajkot-2671683-2025-01-29",
      "headline": "Samson is mentally sound, won't question his technique: Kevin PietersenIND vs ENG, 3rd T20I: Kevin Pietersen said that he's not worried about Sanju Samson's style of playing short balls against quality fast bowlers. On Tuesday, Samson scored only three runs as India slumped to a 26-run defeat in Rajkot. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-eng-varun-chakravarthy-jasprit-bumrah-of-spin-bowling-running-riot-in-t20i-cricket-2671676-2025-01-29",
      "headline": "Varun Chakravarthy: Bumrah of spin-bowling running riot in T20I cricketA sensational Varun Chakravarthy won the player of the match award despite India losing the 3rd T20I of the 5-match series. Chakravarthy took his wicket-tally to 10 in the series as he continued his incredible rise in his second stint in the Indian team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-eng-r-ashwin-in-awe-of-adil-rashid-for-cleaning-up-tilak-varmas-stumps-with-a-ripper-2671671-2025-01-29",
      "headline": "R Ashwin in awe of Adil Rashid for cleaning up Tilak Varma's stumps with a ripperFormer India spinner Ravichandran Ashwin was in awe of Adil Rashid for his marvellous delivery to clean up Tilak Varma in the third T20I of the five-match series in Rajkot. Rashid managed to outfox an in-form Varma, who got dismissed after five innings in T20Is."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-eng-3rd-t20i-kevin-pietersen-slams-indias-batting-order-after-rajkot-loss-2671665-2025-01-29",
      "headline": "Kevin Pietersen slams India's batting order after Rajkot lossIND vs ENG, 3rd T20I: Former England batter Kevin Pietersen slammed India's batting order after their Rajkot T20I loss, stating that Dhruv Jurel, an accomplished batter, should have been sent up the order."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-eng-hardik-pandyas-batting-intent-questioned-by-parthiv-patel-after-rajkot-loss-2671661-2025-01-29",
      "headline": "Hardik Pandya's batting intent questioned by Parthiv Patel after Rajkot lossParthiv Patel was highly critical of Hardik Pandya's sedate innings during the high-pressure run-chase against England in the 3rd T20I in Rajkot on Tuesday, January 28. Hardik tried to take the game deep but failed to get India over the line. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}