{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/unacademy-ceo-gaurav-munjal-denies-reports-of-sale-deal-with-allen-career-institute-2646516-2024-12-07",
      "headline": "Not doing any sale: Unacademy CEO Gaurav Munjal denies reports of takeover dealReports earlier suggested that Allen Career Institute was in talks to acquire Unacademy for $800 million, significantly lower than its peak valuation of $3.4 billion."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/india-can-become-the-ai-capital-of-the-world-metas-sandhya-devanathan-2646252-2024-12-07",
      "headline": "India can become the AI capital of the world: Meta's Sandhya DevanathanSandhya Devanathan, Vice President and Head of India at Meta, discusses the company's AI initiatives, including Meta AI and Llama models. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/we-are-going-to-be-future-ready-priyank-kharge-on-ai-transforming-job-market-2646186-2024-12-06",
      "headline": "We are going to be future ready: Priyank Kharge on AI transforming job marketSharing his thoughts on AI creating a job deficit, Priyank Kharge, Minister of IT and Biotechnology of Karnataka said that technological evolution creates new opportunities rather than eliminating them. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/forging-the-future-cp-gurnani-aditya-ghosh-discuss-ais-role-in-empowering-india-2646110-2024-12-06",
      "headline": "Forging the future: CP Gurnani, Aditya Ghosh discuss AI's role in empowering IndiaCP Gurnani highlighted the necessity of blending AI with human capabilities. Aditya Ghosh emphasised the accessibility of AI, calling this era a \"magical time\" akin to the Industrial Revolution."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/firms-leveraging-ai-to-empower-workforce-on-right-track-says-professor-das-narayandas-2645981-2024-12-06",
      "headline": "Firms using AI to empower workforce likely to excel in future: Professor Das NarayandasSpeaking at the India Today-Business Today AI Conference 2024, during a session titled 'Leadership.Change.AI', he emphasised that organisations focusing on how AI can augment their workforce are likely to emerge as industry leaders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-share-price-52-week-high-factors-behind-strong-rallt-2645945-2024-12-06",
      "headline": "Paytm share price hits 52-week high today. What's driving the rally?Paytm share price: The stock jumped 3.60% to hit a 52-week high of Rs 990.90 on Friday. At the closing bell, the stock settled 1.89% higher at Rs 974.55."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-rbi-mpc-sensex-nifty-end-flat-as-rbi-maintains-status-quo-on-interest-rates-2645938-2024-12-06",
      "headline": "Sensex, Nifty end flat as RBI maintains status quo on interest ratesThe S&P BSE Sensex lost 56.74 points to end at 81,709.12, while the NSE Nifty50 was down 30.60 points to close at 24,677.80. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/insurance-claims-denied-zerodha-ceo-nithin-kamath-explains-why-and-what-you-can-do-2645903-2024-12-06",
      "headline": "Insurance claims denied? Nithin Kamath explains why and what you can doNithin Kamath warns that having insurance doesn't guarantee full claims and lists common rejection reasons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mcx-share-price-hits-rs-7000-milestone-as-stock-rallies-over-8-percent-high-volume-2645915-2024-12-06",
      "headline": " MCX share price hits Rs 7,000 milestone as stock rallies over 8%The stock has delivered an impressive growth trajectory, with gains of over 100% in the past year, over 300% in the last three years, and more than 500% over the last five years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vedanta-share-price-today-jumps-over-6-percent-explained-2645894-2024-12-06",
      "headline": "Explained: Why Vedanta share price jumped over 6% todayThe surge in stock price follows an announcement from Vedanta Resources Finance II PLC, a subsidiary of VRL, that it had redeemed the full amount of $1.2 billion in bonds due in 2025 but extended to 2028."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-announcements-repo-rate-unchanged-homebuyers-may-have-to-wait-till-2025-for-emi-relief-2645893-2024-12-06",
      "headline": "RBI MPC: Homebuyers may have to wait till 2025 for EMI reliefThe RBI has kept key lending rates unchanged with Governor Shaktikanta Das explaining the Monetary Policy Committee's (MPC) focus on economic stability. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-cuts-crr-to-4-how-this-liquidity-boost-will-benefit-the-economy-2645873-2024-12-06",
      "headline": "RBI cuts CRR to 4%: How this liquidity boost will benefit economyThe decision to cut CRR is expected to benefit the banking sector, particularly public sector banks, by lowering the cost of funds and increasing lending capacity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/epfo-extends-deadline-to-activate-uan-for-employment-linked-incentive-eli-scheme-to-december-15-2645519-2024-12-06",
      "headline": "EPFO extends deadline to activate UAN for ELI scheme. Check final dateThe EPFO has extended the deadline to link UAN and Aadhaar under the ELI scheme to mid-December, aiming to boost job creation with incentives for employees and employers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reserve-bank-of-india-rbi-led-monetary-policy-committee-mpc-announced-7-important-decisions-2645848-2024-12-06",
      "headline": "RBI MPC announcement: 7 important decisions you should know aboutThe Reserve Bank of India's monetary policy update includes key decisions like CRR reduction, increase in farm loan limits and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-increases-upi-lite-transaction-limit-how-will-customers-benefit-upi-rule-changes-upi-lite-app-2645455-2024-12-06",
      "headline": "RBI increases UPI Lite transaction limit: How will you benefit?The RBI has increased transaction limits for UPI Lite, making digital payments more convenient, flexible, and accessible for customers, especially for low-value and offline transactions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-governor-shaktikanta-das-policy-repo-rate-action-crticisim-piyush-goyal-nirmala-sitharaman-2645843-2024-12-06",
      "headline": "'Our job is…': RBI Governor defends policy amid criticism over lending ratesShaktikanta Das explained that the decision to hold rates stems from a dual focus on managing inflation and supporting growth. He acknowledged the recent rise in inflation, primarily due to food prices, and the moderation in economic growth"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/what-is-cash-reserve-ratio-crr-understanding-rbi-liquidity-management-tool-how-will-crr-impact-economy-2645799-2024-12-06",
      "headline": "What is Cash Reserve Ratio? Understanding RBI's liquidity management toolThe RBI cut the Cash Reserve Ratio (CRR) to 4% on December 6, injecting Rs 1.16 lakh crore into the banking system to boost liquidity, credit flow, and economic growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-keeps-key-rates-unchanged-cuts-crr-to-4-what-it-means-for-stock-market-2645804-2024-12-06",
      "headline": "RBI keeps key rates unchanged, cuts CRR to 4%: What it means for stock marketAt 11:23 am, the Sensex was down 13.04 points at 81,752.82, while the Nifty50 declined 12.05 points to trade at 24,695.80."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-key-takeaways-lower-gdp-forecast-crr-boost-inflation-projection-new-podcast-ai-2645801-2024-12-06",
      "headline": "Lower GDP forecast to CRR boost: 6 key takeaways from RBI MPCThe MPC decided by a 4-2 majority to maintain the policy repo rate at 6.5%. Governor Shaktikanta Das explained that this decision was based on an assessment of the economy and financial conditions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-announcement-crr-cash-reserve-ration-reduced-to-4-percent-2645782-2024-12-06",
      "headline": "RBI reduces CRR to 4% for liquidity boost. 3 things to know The RBI MPC has kept the key lending rates unchanged to 6.5% as its focus remains on bringing inflation under control. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/syrian-rebels-encircling-damascus-president-assad-continuing-working-from-capital-insurgents-rise-2646555-2024-12-07",
      "headline": "Syrian rebels close in on Damascus, President Assad's office denies he has fledSyrian rebels breach key defenses in Homs, marking a rapid collapse of government control as insurgents capture major cities and advance toward Damascus, threatening President Bashar al-Assad's 24-year rule."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/babri-masjid-demolition-post-mva-maharashtra-samajwadi-party-india-bloc-uddhav-sena-2646534-2024-12-07",
      "headline": "Fissures in INDIA bloc after Uddhav Sena leader's remarks on Babri demolitionThe Maha Vikas Aghadi (MVA) in Maharashtra is facing yet another turbulence as the Samajwadi Party announced its decision to exit the coalition, citing Shiv Sena (UBT) leader's controversial Babri Masjid post."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-pink-ball-test-travis-head-vs-mohammed-siraj-adelaide-2646514-2024-12-07",
      "headline": "Travis Head breaks silence on Siraj send-off, says pacer misread complimentTravis Head has opened up on his altercation with Mohammed Siraj and claimed that the Indian pacer misinterpreted his comments to him on Saturday, December 7. Siraj gave Head an animated send-off after his knock. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/notre-dame-reopening-live-updates-cathedral-in-france-reopens-emmanuel-macron-gothic-church-2646551-2024-12-07",
      "headline": "Live: Notre Dame's reopening ceremony begins, world leaders land in ParisNotre Dame Cathedral is welcoming visitors once again, five years after a fire nearly destroyed the historic landmark. Restored to its Gothic splendour, the cathedral now features a new spire and dazzling gold accents. Prominent guests, including French President Emmanuel Macron, Britain's Prince William, and Ukraine's President Volodymyr Zelenskiy, will join the reopening ceremony. Macron called it \"a symbol of hope and unity\". Stay with IndiaToday.in for latest updates as Paris celebrates this global icon's triumphant return."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/bigg-boss-18-low-rating-trp-drama-scripted-fights-reason-salman-khan-2645974-2024-12-07",
      "headline": "Is Bigg Boss losing its edge? Too much drama or scripted fights?Once hailed as the epitome of drama, controversy, and unfiltered entertainment, Bigg Boss has long been a mainstay of Indian reality television. However, with its declining viewership, both fans and celebrity contestants have expressed concerns about the show's recent trajectory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-adelaide-day-night-test-comeback-stats-2646554-2024-12-07",
      "headline": "How realistic are India's chances of making a comeback in Adelaide?  AUS vs IND, 2nd Test: With India trailing by 29 runs in their second innings with only five wickets in hand. With their backs against the walls, is there any hope for India to bounce back at the Adelaide Oval? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-says-us-should-not-get-involved-in-syrian-conflict-not-our-friend-2646565-2024-12-07",
      "headline": "Trump says US should not get involved in Syrian conflict: 'Not our friend'President-elect Donald Trump expressed his opinion that the United States should not engage in the ongoing conflict in Syria. He emphasised the importance of allowing the situation to unfold without US intervention.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/notre-dame-cathedral-reopening-pictures-then-and-now-2646509-2024-12-07",
      "headline": "Then and now: Notre Dame Cathedral, to reopen today, rises from the ashesBefore the Notre Dame Cathedral is officially thrown open to the public, here is a sneak peek at the mediaeval landmark. The images document its damage and the remarkable transformation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/photo/diljit-dosanjh-bengaluru-concert-featuring-deepika-padukone-jubilant-fans-2646525-2024-12-07",
      "headline": "Inside Diljit Dosanjh's Bengaluru concert, featuring Deepika and jubilant fansPunjabi superstar Diljit Dosanjh recently entertained fans at his Bengaluru concert, which was graced by none other than Bollywood star Deepika Padukone. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/punjab-groom-dubai-return-instagram-bride-moga-baraat-deepak-kumar-manpreet-kaur-2646529-2024-12-07",
      "headline": "Dubai-returned groom ghosted by Instagram bride on wedding day in PunjabDeepak Kumar, the groom, was left stranded along with 150 guests in Punjab's Moga after his \"Instagram bride,\" with whom he had been in a three-year relationship, failed to show up on their wedding day."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/arvind-kejriwal-delhi-law-and-order-rising-crimes-murders-women-unsafe-amit-shah-dig-busy-with-elections-exclusive-gangsters-2646387-2024-12-07",
      "headline": "Amit Shah busy with polls: Arvind Kejriwal's dig after twin Delhi murdersArvind Kejriwal blamed Amit Shah for the rise in crime in Delhi, alleging that the Union Home Minister, under whose jurisdiction the Delhi Police falls, is occupied with elections."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/south/story/telangana-thief-steals-ambulance-to-outrun-police-sparks-chase-on-hyderabad-highway-video-surfaces-2646497-2024-12-07",
      "headline": "Thief steals ambulance to outrun police, sparks chase on Hyderabad highwayThe thief stole the ambulance in an attempt to escape towards Vijayawada, following which a pursuit was launched. The accused used the vehicle's siren to manoeuvre through traffic, creating chaos on the highway. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/haryana-boy-rakshit-beniwal-sitting-on-moving-car-roof-featuring-policeman-father-viral-video-2646437-2024-12-07",
      "headline": "Haryana boy rides on car roof, claims cop father will 'protect him' in viral videoA video of a boy from Haryana sitting on the roof of a moving car featuring his policeman father went viral on social media. The video was originally shared by Rakshit Beniwal on Instagram. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/university-of-bath-school-of-management-a-leader-in-global-business-education-2643394-2024-12-02",
      "headline": "University of Bath School of Management: A Leader in Global Business EducationCombining top-ranked MSc programmes with practical knowledge for future corporate leaders.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/director-subhash-ghai-hospitalised-his-team-says-went-for-regular-check-up-2646574-2024-12-07",
      "headline": "Director Subhash Ghai hospitalised, his team says went for regular check-upSubhash Ghai has directed films like Kalicharan, Karz, Hero, Vidhaata, Meri Jung, Karma, Ram Lakhan, Saudagar, Khalnayak, Pardes and Taal, among several others."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-rbi-tried-to-balance-growth-inflation-matrix-with-a-crr-cut-2646079-2024-12-06",
      "headline": "How RBI tried to balance growth-inflation matrix with a CRR cutCutting the CRR by 50 bps to the pre-pandemic 4 per cent will release liquidity to the tune of Rs 1.16 lakh crore into the banking system, augmenting the capacity of banks to lend"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bayraktar-tb2-drones-nagorno-karabakh-armenia-azerbaijan-deployed-bangladesh-challenges-to-india-2646050-2024-12-07",
      "headline": "What's Bayraktar TB2 drone deployed by Bangladesh and is India prepared?Bangladesh has deployed the Bayraktar TB2 drones on the border with India. These are the same drones that helped Azerbaijan beat the much superior Armenian forces decisively in the battle of Nogorno-Karabakh in 2021. This is how prepared India is to the drone challenge in its neighbourhood."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/notre-dame-grand-reopening-donald-trump-prince-william-celebrations-macron-zelenskyy-concert-fire-restoration-2646308-2024-12-07",
      "headline": "Notre Dame reopening ceremony begins, Donald Trump, Prince William in attendanceFrench President Emmanuel Macron, US President-elect Donald Trump, and other global leaders will gather to celebrate the grand reopening of Notre Dame, achieved in just five years after it was engulfed in a massive fire."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pragya-nagra-leaked-private-explicit-video-ai-content-2646466-2024-12-07",
      "headline": "Malayalam actor Pragya Nagra on her leaked private video: Trying to stay strong Malayalam actor Pragya Nagra broke her silence on her leaked private video. She shared a post on X and called the incident a 'bad dream.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-adelaide-test-rohit-sharma-captaincy-blunders-r-ashwin-harshit-rana-2646369-2024-12-07",
      "headline": "Blunders aplenty: Rohit Sharma's captaincy in Adelaide Test under the scannerAUS vs IND, 2nd Test: Rohit Sharma's decision to give only four overs to Jasprit Bumrah on Day 2 morning and bring R Ashwin into the attack late have raised concerns about his captaincy. Australia raced past India's first innings total of 180 on Sautrday morning despite losing three wickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/pushpa-2-the-rule-is-high-on-swag-but-short-on-storyline-pushpa-2-review-2646098-2024-12-06",
      "headline": "'Pushpa 2: The Rule' is high on swag but short on storylineThe template is fairly dull: action-heavy set pieces where Pushpa, the one-man army, inspires awe, but any credible threat to his throne is missing in the first place"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-sports-politics-business-entertainment-435-07-12-2024",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/mahindra-be-6e-renamed-be-6-automaker-to-contest-brand-rights-of-be-6e-against-indigo-2646455-2024-12-07",
      "headline": "Mahindra renames BE 6e as BE 6, to contest for brand rights against IndiGoMahindra revealed its electric origin SUVs, the BE 6e and the XEV 9e, on November 26."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/us-man-gets-threats-after-viral-post-wrongly-identified-as-unitedhealthcare-ceo-brian-thompson-killer-2646422-2024-12-07",
      "headline": "US man mistaken for UnitedHealthcare CEO's killer: 'This can get me killed'A US man received death threats after a viral social media post falsely identified him as the killer of UnitedHealthcare CEO Brian Thompson."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/allu-arjun-thanks-deputy-chief-minister-pawan-kalyan-pushpa-2-ticket-price-hike-andhra-pradesh-2646577-2024-12-07",
      "headline": "Pushpa 2 success: Allu Arjun thanks Pawan Kalyan and Andhra's ticket price hikeHe also lauded the Andhra Pradesh government, acknowledging the long-standing support of Chief Minister Nara Chandrababu Naidu, whom he described as a steadfast advocate for the film industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/director-subhash-ghai-hospitalised-his-team-says-went-for-regular-check-up-2646574-2024-12-07",
      "headline": "Director Subhash Ghai hospitalised, his team says went for regular check-upSubhash Ghai has directed films like Kalicharan, Karz, Hero, Vidhaata, Meri Jung, Karma, Ram Lakhan, Saudagar, Khalnayak, Pardes and Taal, among several others."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pushpa-2-star-allu-arjun-on-fan-death-extremely-unfortunate-2646541-2024-12-07",
      "headline": "Pushpa 2 star Allu Arjun on fan's death: Needed time to process itPushpa 2 actor Allu Arjun has reacted to the tragedy that unfolded at a Hyderabad theatre following his film's screening. A stampede-like situation resulted in the death of a 39-year-old woman. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/when-dhanush-met-swiss-watchmaker-fp-journe-2646532-2024-12-07",
      "headline": "When Dhanush met Swiss watchmaker FP Journe: Greatest of all timeAcclaimed actor and producer Dhanush recently met with renowned Swiss watchmaker FP Journe. The actor shared a couple of photos from the meeting on his social media handle. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/former-assam-cricketer-devajit-saikia-acting-secretary-bcci-2646587-2024-12-07",
      "headline": "Former Assam cricketer Devajit Saikia appointed acting secretary of BCCI Devajit Saikia has been appointed as the acting secretary of the BCCI by Board President Roger Binny. He takes over the role from Jay Shah, who recently assumed the position of the new ICC President."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-2nd-test-adelaide-travis-head-2646584-2024-12-07",
      "headline": "Picked my moments: Head on putting 'pressure' on India in AdelaideAUS vs IND: Travis Head talked about his brilliant century in the Adelaide Test against India. The left-hander scored 140 runs with the help of 17 fours and four sixes, putting Australia in a position of strength. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-travis-head-cheteshwar-pujara-short-ball-adelaide-test-2646579-2024-12-07",
      "headline": "India did not exploit Travis Head's weakness against short balls: Pujara AUS vs IND: Cheteshwar Pujara said that India should have bowled more short balls to Travis Head, who scored 140 runs and put Australia in a commanding position in the second Test at the Adelaide Oval. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-u19-asia-cup-final-india-vs-bangladesh-livestreaming-details-squads-dubai-2646566-2024-12-07",
      "headline": "U-19 Asia Cup final, India vs Bangladesh: When and where to watch summit clashThe stage is set for the U-19 Asia Cup Final as India will take on the defending champions, Bangladesh, in an exciting clash. Both teams will be banking on current form and get their hands on the title on Sunday, December 8."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-wpl-2025-auction-bengaluru-players-list-2646564-2024-12-07",
      "headline": "Heather Knight, Deandra Dottin head list of 120 players in auction WPL 2025: Deandra Dottin, Heather Knight and Lizelle Lee have the highest base price for the upcoming Women's Premier League auction to be held on December 15 in Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-adelaide-day-night-test-comeback-stats-2646554-2024-12-07",
      "headline": "How realistic are India's chances of making a comeback in Adelaide?  AUS vs IND, 2nd Test: With India trailing by 29 runs in their second innings with only five wickets in hand. With their backs against the walls, is there any hope for India to bounce back at the Adelaide Oval? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-rohit-sharma-captaincy-trolling-aus-vs-ind-border-gavaskar-trophy-adelaide-test-2646545-2024-12-07",
      "headline": "Rohit Sharma's captaincy heavily criticised as India surrender in AdelaideIndia captain Rohit Sharma was heavily trolled on social media after India's poor day in the field on Day 2 of the second Test match against Australia in Adelaide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/world-chess-championship-game-10-d-gukesh-father-question-singapore-2646547-2024-12-07",
      "headline": "D Gukesh's dad a chess player? Indian grandmaster gives witty responseD Gukesh had a witty response when asked if his father is the first chess player he talks to after Game 10 of the World Chess Championship against Ding Liren on Saturday, December 7. Gukesh and Liren played out another draw on Saturday. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-2nd-test-mohammed-shami-sunil-gavaskar-interview-2646544-2024-12-07",
      "headline": "Tough for Mohammed Shami to play Brisbane Test, says Sunil Gavaskar AUS vs IND: In an interview with India Today, Sunil Gavaskar said that India would find it tough to rope in Mohammed Shami for the Brisbane Test, starting December 14. The pacer recently returned to playing competitive cricket for Bengal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-jasprit-bumrah-morne-morkel-aus-vs-ind-adelaide-australia-vs-india-travis-head-2646536-2024-12-07",
      "headline": "Jasprit Bumrah injury scare: Bowling coach Morne Morkel gives updateIndia's bowling coach Morne Morkel gave an update on star India fast bowler Jasprit Bumrah after he suffered an injury scare on Day 2 of the second Test against Australia in Adelaide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-pink-ball-test-day-2-rohit-sharma-footwork-issues-sunil-gavaskar-adelaide-2646535-2024-12-07",
      "headline": "Sunil Gavaskar suggests exercises to Rohit Sharma to overcome footwork issuesSunil Gavaskar feels that Rohit Sharma needs to do some exercise before coming in to bat after his failure in the pink-ball Test. The India captain's footwork was the cause of his downfall in both innings of the match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-rohit-sharma-captaincy-trolling-aus-vs-ind-border-gavaskar-trophy-adelaide-test-2646545-2024-12-07",
      "headline": "Rohit Sharma's captaincy heavily criticised as India surrender in AdelaideIndia captain Rohit Sharma was heavily trolled on social media after India's poor day in the field on Day 2 of the second Test match against Australia in Adelaide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/world-chess-championship-game-10-d-gukesh-father-question-singapore-2646547-2024-12-07",
      "headline": "D Gukesh's dad a chess player? Indian grandmaster gives witty responseD Gukesh had a witty response when asked if his father is the first chess player he talks to after Game 10 of the World Chess Championship against Ding Liren on Saturday, December 7. Gukesh and Liren played out another draw on Saturday. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-2nd-test-mohammed-shami-sunil-gavaskar-interview-2646544-2024-12-07",
      "headline": "Tough for Mohammed Shami to play Brisbane Test, says Sunil Gavaskar AUS vs IND: In an interview with India Today, Sunil Gavaskar said that India would find it tough to rope in Mohammed Shami for the Brisbane Test, starting December 14. The pacer recently returned to playing competitive cricket for Bengal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-jasprit-bumrah-morne-morkel-aus-vs-ind-adelaide-australia-vs-india-travis-head-2646536-2024-12-07",
      "headline": "Jasprit Bumrah injury scare: Bowling coach Morne Morkel gives updateIndia's bowling coach Morne Morkel gave an update on star India fast bowler Jasprit Bumrah after he suffered an injury scare on Day 2 of the second Test against Australia in Adelaide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-pink-ball-test-day-2-rohit-sharma-footwork-issues-sunil-gavaskar-adelaide-2646535-2024-12-07",
      "headline": "Sunil Gavaskar suggests exercises to Rohit Sharma to overcome footwork issuesSunil Gavaskar feels that Rohit Sharma needs to do some exercise before coming in to bat after his failure in the pink-ball Test. The India captain's footwork was the cause of his downfall in both innings of the match. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/video/cricket-australia-vs-india-2nd-test-mohammed-siraj-travis-head-sunil-gavaskar-2646533-2024-12-07",
      "headline": "Siraj has to curb his aggression: Gavaskar on heated exchange with HeadAUS vs IND, 2nd Test: Sunil Gavaskar said that Mohammed Siraj needs to curb his aggression to avoid finding himself in trouble. On Saturday, Siraj gave Travis Head a fiery send-off after the latter scored a hundred on Day 2 of the Day-Night Test at the Adelaide Oval.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-gus-atkinson-hat-trick-new-zealand-vs-england-nz-vs-eng-wellington-2646527-2024-12-07",
      "headline": "Gus Atkinson 'more greedy' after claiming hat-trick vs New Zealand in 2nd TestEngland fast bowler Gus Atkinson etched his name in history books as he registered a hat-trick against New Zealand on Day 2 of the second Test in Wellington."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/world-chess-championship-game-10-d-gukesh-vs-ding-liren-draw-singapore-2646520-2024-12-07",
      "headline": "Gukesh, Liren play out draw in Game 10 as deadlock continues in seriesThe stalemate between D Gukesh and Ding Liren in the World Chess Championship continued on Saturday, December 7 as Game 10 also ended in a draw. Both men are now tied at 5-5 with 4 more games remaining in the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-mohammed-shami-return-last-two-tests-border-gavaskar-trophy-2646519-2024-12-07",
      "headline": "Fit-again Mohammed Shami set to play last 2 Tests in Australia: Report Border-Gavaskar Trophy: Mohammed Shami is all set to be available for selection for the last two Tests of the series. The fit-again pacer has been playing for Bengal in the Syed Mushtaq Ali Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-sunil-gavaskar-aus-vs-ind-adelaide-test-border-gavaskar-trophy-2646515-2024-12-07",
      "headline": "Gavaskar defends Kohli after Adelaide failure: Nothing wrong with what he didFormer India cricketer Sunil Gavaskar defended star India batter Virat Kohli after his twin failures in the second Test against Australia in Adelaide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-pink-ball-test-travis-head-vs-mohammed-siraj-adelaide-2646514-2024-12-07",
      "headline": "Travis Head breaks silence on Siraj send-off, says pacer misread complimentTravis Head has opened up on his altercation with Mohammed Siraj and claimed that the Indian pacer misinterpreted his comments to him on Saturday, December 7. Siraj gave Head an animated send-off after his knock. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-v-ind-pink-ball-test-day-2-score-travis-head-rohit-sharma-virat-kohli-2646500-2024-12-07",
      "headline": "Travis Head-ache strikes again as India stare at pink-ball Test defeatAustralia vs India, 2nd Test: Travis Head's 141 and a vicious session of fast bowling from the Australian pacers ensured the hosts inched closer towards a memorable win. Indian batters were at sea against the pink ball under the floodlights on Saturday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-rohit-sharma-pat-cummins-australia-vs-india-aus-vs-ind-border-gavaskar-trophy-2024-25-2646494-2024-12-07",
      "headline": "AUS vs IND: Rohit Sharma turns walking wicket, fails twice at No. 6 in 2nd TestIndia captain Rohit Sharma continued to fail on his return to number 6 as he got dismissed for 6 in the second innings of the second Test against Australia in Adelaide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-sunil-gavaskar-aus-vs-ind-adelaide-test-border-gavaskar-trophy-2646515-2024-12-07",
      "headline": "Gavaskar defends Kohli after Adelaide failure: Nothing wrong with what he didFormer India cricketer Sunil Gavaskar defended star India batter Virat Kohli after his twin failures in the second Test against Australia in Adelaide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-pink-ball-test-travis-head-vs-mohammed-siraj-adelaide-2646514-2024-12-07",
      "headline": "Travis Head breaks silence on Siraj send-off, says pacer misread complimentTravis Head has opened up on his altercation with Mohammed Siraj and claimed that the Indian pacer misinterpreted his comments to him on Saturday, December 7. Siraj gave Head an animated send-off after his knock. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-v-ind-pink-ball-test-day-2-score-travis-head-rohit-sharma-virat-kohli-2646500-2024-12-07",
      "headline": "Travis Head-ache strikes again as India stare at pink-ball Test defeatAustralia vs India, 2nd Test: Travis Head's 141 and a vicious session of fast bowling from the Australian pacers ensured the hosts inched closer towards a memorable win. Indian batters were at sea against the pink ball under the floodlights on Saturday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-rohit-sharma-pat-cummins-australia-vs-india-aus-vs-ind-border-gavaskar-trophy-2024-25-2646494-2024-12-07",
      "headline": "AUS vs IND: Rohit Sharma turns walking wicket, fails twice at No. 6 in 2nd TestIndia captain Rohit Sharma continued to fail on his return to number 6 as he got dismissed for 6 in the second innings of the second Test against Australia in Adelaide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-rishabh-pant-reverse-scoop-pink-ball-test-adelaide-2646484-2024-12-07",
      "headline": "Watch: Rishabh Pant falls after playing stunning reverse scoop, leaves everyone stunnedRishabh Pant left the Adelaide crowd stunned as the Indian wicketkeeper played an audacious reverse scoop off Scott Boland during Day 2 of the pink-ball Test on Saturday, December 7. Pant has been aggressive in his approach from the get-go. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-australia-vs-india-border-gavaskar-trophy-aus-vs-ind-2646476-2024-12-07",
      "headline": "Virat Kohli suffers twin failures in Adelaide, ends love-affair with venue AUS vs IND 2nd Test: Star India batter Virat Kohli got dismissed cheaply in both the innings of the second Test against Australia at Adelaide Oval. He scored 7 and 11 across two innings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/australia-vs-india-2nd-test-travis-head-children-adelaide-2646461-2024-12-07",
      "headline": "Head's wife in awe after batter's centuries on children's first gamesAUS vs IND, 2nd Test: Travis Head scored 140 runs off 141 balls with 17 fours and four sixes at the Adelaide Oval, after which his wife Jessica heaped praise on him. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-pink-ball-test-josh-hazlewood-dressing-room-rift-injury-return-2646463-2024-12-07",
      "headline": "Josh Hazlewood clarifies rift rumours: Tightest team I've been part ofJosh Hazlewood has claimed that there is no rift within the Australian team and his quotes during the Perth Test was taken out of context. Hazlewood also provided an injury update ahead of the Brisbane Test. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}