{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/air-india-crash-rattles-hotel-and-ticketing-stocks-as-investor-confidence-wavers-impact-on-indian-stock-market-2740247-2025-06-13",
      "headline": "Air India crash rattles hotel and ticketing stocks, as investor confidence waversOnline travel companies were among the most affected. Shares of Thomas Cook India fell by 2.39%, trading at Rs 160.03 as of June 13, 1PM. TBO Tek dropped 1.10% to Rs 1,287.40, while Mahindra Holidays slipped 1.47% to Rs 342.35."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/air-india-crash-in-ahmedabad-how-airline-insurance-works-and-why-premiums-may-rise-2740170-2025-06-13",
      "headline": "Air India crash: How airline insurance works and why premiums may riseIncidents like the recent Air India crash can result in a total loss, meaning the aircraft is beyond repair with no salvageable parts. In such cases, the losses can reach around $130 million, roughly $80 million for the plane and $30-50 million in liabilities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/air-india-insurance-cover-new-india-assurance-tata-aig-global-reinsurers-2740162-2025-06-13",
      "headline": "Who are the likely insurers for Air India plane crash?The plane involved in the crash was a Boeing 787-8 Dreamliner, one of the most modern aircraft used in commercial aviation. It was carrying 242 people, including 12 crew members. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/boeing-comeback-on-trial-after-air-india-dreamliner-crash-kills-241-2740174-2025-06-13",
      "headline": "Boeing's revival on trial after deadly Air India Dreamliner crash in AhmedabadThe fatal crash of Air India flight AI-171, a Boeing 787-8 Dreamliner, minutes after takeoff from Ahmedabad, has killed 241 people on board, reigniting serious doubts over Boeing's aircraft safety and corporate oversight."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/oil-stocks-fall-israel-iran-war-brent-crude-oil-price-rise-bpcl-ongc-ioc-asian-paints-2740141-2025-06-13",
      "headline": "Oil shock hits Dalal Street: BPCL, ONGC, IOC, other crude-sensitive stocks fallBrent crude oil futures jumped more than 9% to touch around $75.61 per barrel, reaching a multi-month high. The gain came after Israel said it had launched what it called \"preemptive strikes\" against Iran."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/rbi-steps-in-to-contain-fallout-of-oil-price-jump-on-rupee-2740112-2025-06-13",
      "headline": "RBI steps in to contain fallout of oil price jump on rupee: ReportThe Indian rupee dropped to 86.20 against the US dollar in early trade but later recovered to 86.04, helped by the central bank's likely intervention."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/aviation-stocks-fall-market-crash-spicejet-indigo-adani-enterprises-tata-group-shares-air-india-plane-crash-2740108-2025-06-13",
      "headline": "Aviation stocks tumble after Air India plane crash in AhmedabadSpiceJet's share price dropped 3.42% at the start of the trading session. InterGlobe Aviation Ltd, the company that runs IndiGo, also fell 4.83%, slipping to Rs 5,212 in early trade."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-crashes-over-1100-points-nifty-below-24600-tata-group-shares-fall-up-to-2-percent-2740097-2025-06-13",
      "headline": "Sensex, Nifty crash as Israel attacks Iran; oil prices jump sharplyThe S&P BSE Sensex tanked 838.78 points to 80,853.20, while the NSE Nifty50 lost 252.80 points to 24,635.40 as of 9:25 am. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-over-1200-points-iran-israel-middle-east-conflict-oil-prices-explained-2740093-2025-06-13",
      "headline": "Sensex falls over 1,100 points. Why is the stock market falling today?The BSE Sensex was down 1121.35 points to 80,570.63 at 9:16 am, while the NSE Nifty50 tumbled 334.65 points to trade at 24,553.55."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-june-13-sensex-nifty-crash-today-israel-iran-war-conflict-crude-oil-price-aviation-tata-adani-air-india-2740065-2025-06-13",
      "headline": "Stock market opening: Will Sensex, Nifty crash today over Israel-Iran conflict?The situation in the Middle East has affected global investor sentiment. Oil prices also jumped on fears that the strikes could affect supply from the region, which is known for producing large amounts of oil."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-june-13-nse-bse-trading-tata-group-ril-hcl-asian-paints-icra-icici-bank-2740062-2025-06-13",
      "headline": "Stocks to watch on June 13: Tata Group, RIL, HCL, Asian Paints, ICRA, ICICI BankShares of several Tata Group companies, such as Tata Motors, Tata Steel and Tata Chemicals, are expected to remain in the spotlight after the crash of Air India flight AI171 in Ahmedabad shortly after takeoff."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/boeing-shares-nosedive-5-percent-after-air-india-dreamliner-crash-kills-over-200-2739941-2025-06-12",
      "headline": "Boeing shares slide 5% after Air India Dreamliner crash kills over 200Flight AI171, bound for London, went down minutes after departure, killing more than 200 people in what is now the world's deadliest aviation disaster in a decade. The cause of the crash remains unclear. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-group-to-give-rs-1-crore-to-families-of-ahmedabad-air-india-787-dreamliner-plane-crash-victims-2739919-2025-06-12",
      "headline": "Tata Group to give Rs 1 crore to families of Ahmedabad Air India crash victimsTata Group will offer Rs 1 crore to family members of people who lost their lives in the Ahmedabad crash of Air India Flight 171, which killed over 200 people on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/air-india-ceo-campbell-wilson-reaction-to-ahmedabad-london-787-dreamliner-plane-crash-2739907-2025-06-12",
      "headline": "This is a difficult day for us: Air India CEO reacts to Ahmedabad plane crashAt least 204 people were killed and 41 injured after the London-bound Air India flight crashed just minutes after taking off from Ahmedabad's Sardar Vallabhbhai Patel International Airport on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/retail-inflation-hits-six-year-low-falls-to-282-percent-in-may-2025-2739809-2025-06-12",
      "headline": "Retail inflation hits six-year low, falls to 2.82% in May 2025The decline in retail inflation is mainly because food prices rose at a much slower pace than before. Cheaper vegetables, fruits, cereals, and pulses helped bring food inflation down sharply. In May, food inflation fell to 0.99% from 1.78% in April."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-crash-tata-shares-fall-air-india-crash-2739766-2025-06-12",
      "headline": "Sensex tanks 823 points, Nifty falls below 25,000; Tata Motors falls 3%The S&P BSE Sensex was down by 823.16 points to close at 81,691.98, while the NSE Nifty50 fell by 253.20 points to settle at 24,888.20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/boeing-reacts-after-air-india-plane-crashes-in-ahmedabad-with-242-onboard-2739764-2025-06-12",
      "headline": "Boeing reacts to Air India plane crash in Ahmedabad, says aware of initial reportsThe London-bound flight AI-171, carrying 242 people including 230 passengers and 12 crew members, crashed in the Meghaninagar area near the Sardar Vallabhbhai Patel International Airport minutes after takeoff. The plane had issued a mayday call before losing contact with air traffic control."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/shocked-and-deeply-saddened-gautam-adani-after-air-india-plane-crash-in-ahmedabad-2739761-2025-06-12",
      "headline": "Shocked and deeply saddened: Gautam Adani after Air India plane crash in AhmedabadOn Thursday afternoon, an Air India flight heading to London crashed just minutes after take-off, with 242 people on board. The flight, AI-171, was being operated by a Boeing 787 Dreamliner."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/air-india-flight-171-crash-ahmedabad-airport-operations-suspended-2739753-2025-06-12",
      "headline": "Focus on supporting affected people: Tata Group chief on Ahmedabad plane crashThe airplane crash has led to a temporary suspension of flight operations at Sardar Vallabhbhai Patel International Airport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/boeing-share-price-down-7-percent-in-pre-market-trading-after-air-india-plane-crash-ahmedabad-2739751-2025-06-12",
      "headline": "Boeing shares tumble 8% after Air India flight crashes in AhmedabadBoeing shares nosedived over 8% in pre-market trade after the Air India Dreamliner crash in Ahmedabad, deepening investor concerns over the jetmaker's safety record and regulatory troubles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/google-voluntary-buyouts-knowledge-ads-teams-ai-investment-voluntary-exit-programme-mention-report-2739707-2025-06-12",
      "headline": "Google offers buyout plans amid AI-focused overhaul: ReportGoogle is now giving some employees the option to leave the company with a severance package. This is being called a \"voluntary exit programme\", as per reports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/dalal-street-falls-nearly-1-percent-us-china-trade-middle-east-tensions-stock-market-falling-sensex-down-700-points-2739681-2025-06-12",
      "headline": "Dalal Street dips nearly 1 percent on global trade and geopolitical concernsStock market today: The fall occurred despite markets erasing early losses as the S&P BSE Sensex fell by 911 points to 81,603.95 and the NSE Nifty50 lost 288.75 points to 24,854.45 by 2:29 pm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-to-tighten-remittance-rules-bar-offshore-time-deposits-report-2739671-2025-06-12",
      "headline": "India to tighten remittance rules, bar offshore time deposits: ReportThe Reserve Bank of India (RBI) will amend regulations to prevent overseas transfers from being used to park money in time deposits or other interest-bearing accounts abroad, one of the sources said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pm-kisan-20th-instalment-expected-20-june-2025-financial-aid-indian-farmers-2739652-2025-06-12",
      "headline": "PM-Kisan 20th instalment: When will farmers get the next Rs 2,000?This scheme provides income support of Rs 6,000 a year to eligible farmers. The money is paid in three equal parts of Rs 2,000, directly into the farmers' bank accounts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/dollar-dream-vs-reality-why-rs-80-lakh-in-us-salary-not-as-big-as-it-sounds-purchasing-power-parity-rs-23-lakhs-india-equals-rs-80-lakhs-us-salary-2739606-2025-06-12",
      "headline": "Dollar dream vs reality: Why Rs 80 lakh in US salary not as big as it soundsRs 23 lakh in India can go as far as Rs 80 lakh in the US when it comes to daily living costs. An upcoming author reveals the impact of Purchasing Power Parity (PPP) on salary comparisons between India and the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musk-net-worth-rises-over-usd-100-million-after-apology-to-donald-trump-2739577-2025-06-12",
      "headline": "Elon Musk's net worth jumps after apology to Donald TrumpElon Musk's net worth increased by $191 million, reaching $411.4 billion after his public apology to President Donald Trump."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/got-an-income-tax-notice-types-of-income-tax-notices-here-is-how-to-deal-with-it-2739551-2025-06-12",
      "headline": "Got an income tax notice? Don't panic, here's how to deal with itFor many honest taxpayers, the unexpected arrival of an income tax notice in their inbox can trigger anxiety. However, most of them are often routine and manageable. This article explains what these notices really mean, why they're sent, and what you should do if one lands your way."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-ai-market-growth-17-billion-2027-talent-tech-investments-2739539-2025-06-12",
      "headline": "India's AI market to triple by 2027 with strong talent and tech growthThe report, titled \"India's AI Leap: BCG Perspective on Emerging Challengers,\" indicates that the country is set to become one of the fastest-growing AI economies globally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/paytm-shares-slide-up-to-10-percent-after-government-dismisses-mdr-rumours-2739518-2025-06-12",
      "headline": "Paytm shares slide up to 10% after government dismisses MDR rumoursPaytm shares fell sharply in early trade after the government rejected reports suggesting the return of merchant discount rate (MDR) charges on UPI transactions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/tanla-platforms-shares-jump-13-percent-today-check-whats-driving-the-rally-2739510-2025-06-12",
      "headline": "Tanla Platforms shares jump 13% today. Check what's driving the rallyTanla Platforms share price: At around 10:10 am, shares of the company were trading 9.96% higher at Rs 684.20 on the Bombay Stock Exchange (BSE)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-eu-nearly-90-percent-ready-on-market-access-in-fta-talks-says-piyush-goyal-2739489-2025-06-12",
      "headline": "India, EU nearly 90% ready on market access in FTA talks, says Piyush GoyalPiyush Goyal also underlined the political backing behind the deal, referring to the meeting between Prime Minister Narendra Modi and European Commission President Ursula von der Leyen in New Delhi on 28 February."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-sensex-opens-100-points-lower-nifty-below-25200-infosys-down-1-percent-2739486-2025-06-12",
      "headline": "Sensex, Nifty erase early losses to trade in green; IT stocks limit gainsThe S&P BSE Sensex was up by 89.24 points to 82,604.38, while the NSE Nifty50 added 31.45 points to 25,163.80 as of 9:27 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-today-sensex-nifty-trading-setup-flat-start-why-us-china-trade-inflation-data-2739476-2025-06-12",
      "headline": "Stock market today: Sensex and Nifty likely to open flat. Here's whyAs of 8:34 am, Gift Nifty futures were trading at 25,236.5, suggesting that the Nifty 50 index will open close to Wednesday's closing level of 25,141.4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-on-june-12-nse-bse-trading-wipro-hdfc-bank-ireda-nazara-tech-ntpc-2739463-2025-06-12",
      "headline": "Stocks to watch on June 12: Wipro, HDFC Bank, IREDA, Nazara Tech, NTPCThe Sensex and Nifty closed higher after a rangebound session on Wednesday. While gains in IT stocks supported the indices, profit booking and the absence of strong triggers limited the overall rise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dubai-real-estate-middle-class-indian-investors-rental-yields-residency-benefits-2739165-2025-06-11",
      "headline": "Dubai's billionaire realty map: Can India's salaried class invest there?For years, Dubai's skyline has glittered like a dream, much like that tempting NRI cousin who always seemed a step ahead in life. But things are changing as salaried Indians are looking to venture into Dubai's posh real estate. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-123-points-higher-nifty-above-25100-hcltech-gains-3-percent-2739147-2025-06-11",
      "headline": "Sensex closes 123 points higher, Nifty above 25,100; HCLTech gains 3%The S&P BSE Sensex added 123.42 points to end at 82,515.14, while the NSE Nifty gained 37.15 points to close at 25,141.40. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/bharat-rising-why-tier-2-cities-drive-job-growth-explains-hireveda-co-founder-saurabh-agarwal-2739099-2025-06-11",
      "headline": "Bharat rising: Why Tier-2 cities drive job growth, explains HireVeda co-founderWhile the metros still lead in the number of jobs, the speed of growth in smaller cities is hard to ignore, noted co-founder of HireVeda and ExecEdge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ultra-rich-india-hnwi-us-china-japan-usd-10-million-report-knight-frank-2739078-2025-06-11",
      "headline": "India now home to over 85,000 millionaires, ranks 4th globally: ReportIndia now trails only the United States, China, and Japan in terms of the number of wealthy individuals, accounting for 3.7% of the global HNWI population."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/digital-form-16-step-by-step-guide-to-download-and-use-it-for-easy-itr-filing-income-tax-return-2739064-2025-06-11",
      "headline": "Digital Form 16: Step-by-step guide to download and use it for easy ITR filingWith the advent of digital platforms, accessing and using Form 16 has become more straightforward, making it a vital document for accurate and hassle-free income tax return (ITR) filing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/chasing-rs-10-discounts-ca-explains-why-tracking-every-rupee-is-not-making-you-rich-2739016-2025-06-11",
      "headline": "Chasing Rs 10 discounts? CA explains why tracking every rupee isn't making you richIt's a common belief that managing every rupee wisely equals financial discipline. People cut back on little indulgences and chase discounts, feeling financially in control, yet, their money may be slipping away in unnoticed ways."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sussanne-khan-on-co-parenting-with-hrithik-roshan-2740237-2025-06-13",
      "headline": "Sussanne Khan grateful and blessed to have Hrithik Roshan as co-parentSussanne Khan reflected on co-parenting with actor Hrithik Roshan, shedding light on their commitment to providing a nurturing environment for their sons. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prabhass-the-raja-saab-teaser-leaked-makers-warn-of-strict-action-2740255-2025-06-13",
      "headline": "Prabhas's The Raja Saab teaser leaked, makers warn of strict actionWith just three days to go for the official teaser release of Prabhas' 'The Raja Saab', a few visuals and a short clip from the film were leaked online, prompting the makers to issue a firm warning against the circulation of leaked content."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/rana-naidu-2-review-acting-brilliance-saves-the-day-despite-cinematic-stereotypes-2740245-2025-06-13",
      "headline": "Rana Naidu 2 review: Strong family drama, but familiar stereotypes in average showReleased-Fri Jun 13, 2025Rana Naidu 2 review: 'Rana Naidu 2', starring Rana Daggubati in the titular role, is streaming on Netflix. Does the crime-thriller live up to expectations? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vir-das-backs-air-india-after-crash-calls-them-best-crew-in-the-sky-2740236-2025-06-13",
      "headline": "Vir Das backs Air India after crash, calls them best crew in the skyOn Thursday, Vir Das lent his support to Air India, stating that he stands with them. This came following the crash of its London-bound flight AI171 in Ahmedabad. \r\n\r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-childhood-photo-paresh-rawal-viral-tamanna-sets-2740211-2025-06-13",
      "headline": "Alia Bhatt's childhood pic with Paresh Rawal goes viral, fans link it to Tamanna setsAlia Bhatt's childhood photo with Paresh Rawal has gone viral, sparking nostalgia among fans. One of the social media users pointed out that the picture might be from the sets of 'Tamanna' (1997).\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kajol-admits-saying-no-to-many-successful-films-including-aamir-khans-3-idiots-2740171-2025-06-13",
      "headline": "Kajol admits saying no to many successful films, including Aamir Khan's 3 idiotsActor Kajol shared she has declined many successful films, including Aamir Khan-starrer '3 idiots'. The actor said she does not regret saying no and has done very well for herself. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/superman-final-trailer-david-corenswet-as-man-of-steel-2740180-2025-06-13",
      "headline": "Superman final trailer: DC begins new era with David Corenswet as Man of SteelThe final trailer of James Gunn's 'Superman' has landed, introducing David Corenswet as DC's new Superman. It is set to hit the theatres on July 11, 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/edagaiye-apaghatakke-karana-review-diganths-film-is-a-quirky-thriller-entertainer-2740154-2025-06-13",
      "headline": "Edagaiye Apaghatakke Karana review: Diganth's film is a quirky entertainerReleased-Fri Jun 13, 2025Edagaiye Apaghatakke Karana movie review: Directed by debutant Samarth Kadkol, this Kannada black comedy-suspense drama stars Diganth, Nidhi Subbaiah and Dhanu Harsha in the lead. With good comedy and interesting plot twists, the movie shines with Diganth as the crown jewel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/kpop-group-ateezs-new-launch-lemon-drop-has-fans-melting-watch-2740177-2025-06-13",
      "headline": "ATEEZ's new launch Lemon Drop has fans melting. WatchATEEZ has returned with their bold and sultry summer track Lemon Drop, captivating fans with a fresh, grown-up vibe. The music video and song together highlight the group's confident and charismatic new era."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-traitors-review-karan-johar-show-feels-like-a-luxe-twisted-roadies-ride-2739994-2025-06-13",
      "headline": "The Traitors review: Bigg Boss meets Roadies in Karan Johar's luxe reality showReleased-Thu Jun 12, 2025Karan Johar-hosted show 'The Traitors' is now streaming on Prime Video. The reality show, with an impressive lineup of 20 celebrities, is a power play of vicious betrayals, cold-hearted deception, and constant manipulations. Read our review. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-rm-emotional-letter-on-bands-12th-anniversary-moves-fans-to-tears-2740145-2025-06-13",
      "headline": "BTS RM's emotional letter on band's 12th anniversary moves fans to tearsBTS commemorated their 12th anniversary with leader RM sharing an emotional letter expressing gratitude and disbelief. Fans across were touched by his heartfelt words celebrating the group's journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-veer-pahariya-helped-recover-stolen-mahavir-chakra-ab-devayya-2740144-2025-06-13",
      "headline": "How Akshay Kumar, Veer Pahariya helped recover stolen war hero's Mahavir ChakraActors Akshay Kumar and Veer Pahariya helped recover and return the stolen Mahavir Chakra medal of 1965 war hero, Squadron Leader AB Devayya. The medal was handed back to his family in a special ceremony held by the Indian Air Force in Bengaluru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mountain-of-sadness-anupam-kher-priyanka-chopra-condole-air-india-plane-crash-2740135-2025-06-13",
      "headline": "Mountain of sadness: Anupam Kher, Priyanka Chopra condole Air India plane crashActors Anupam Kher and Priyanka Chopra mourned the loss of lives in the Air India plane crash on Thursday afternoon. Anupam expressed the plane was not just a machine but a moving hope in which our loved ones were sitting. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kim-soo-hyun-loses-luxury-apartment-penalty-payment-kim-sae-ron-garosero-2740127-2025-06-13",
      "headline": "South Korean actor Kim Soo-hyun loses apartment after missing penalty paymentActor Kim Soo-hyun failed to pay a penalty fee for one of his luxury apartments, a day after winning a court order to seize Kim Se Ui's properties over the Kim Sae Ron scandal fallout."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-j-hopes-killin-it-girl-is-the-empowerment-anthem-weve-been-waiting-for-2740139-2025-06-13",
      "headline": "BTS' J-hope's Killin' It Girl is the empowerment anthem we've been waiting forJ-hope returns with his infectious solo Killin' It Girl, blending pop and hip-hop with a powerful message of self-love. Featuring GloRilla, the track and its vibrant visuals celebrate confidence and independence, making it a summer anthem."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mahima-chaudhry-daughter-ariana-birthday-instagram-video-2740134-2025-06-13",
      "headline": "Mahima Chaudhry celebrates daughter Ariana's birthday, fans call them twinsActor Mahima Chaudhry celebrated her daughter Ariana's birthday by sharing a lovely video on Instagram. Fans and celebrities sent wishes and also commented that Ariana is a spitting image of her mother."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/who-is-priya-sachdev-sunjay-kapoor-wife-karisma-kapoor-2740120-2025-06-13",
      "headline": "Who is Priya Sachdev, Sunjay Kapur's wife who once worked with Kareena Kapoor?Actor Karisma Kapoor's ex-husband, industrialist Sunjay Kapur, died on June 12 following a heart attack. He was married to former actor and entrepreneur Priya Sachdev.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tiger-shroff-trolls-cricket-video-in-track-pants-2740110-2025-06-13",
      "headline": "Tiger Shroff responds to trolls with new cricket video in track pantsActor Tiger Shroff responded to trolls about his viral cricket video, where he played in briefs. The actor shared a new clip in track pants with a funny caption on his Instagram Story."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/housefull-5-box-office-day-7-akshay-kumars-film-slows-down-after-one-week-run-2740111-2025-06-13",
      "headline": "Housefull 5 box office Day 7: Akshay Kumar's film slows down after one week run'Housefull 5', Akshay Kumar's comedy entertainer, witnessed a drop in its day-wise collection on Day 7. The film released in theatres on June 6."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ahmedabad-plane-crash-live-updates-air-india-flight-boeing-london-passengers-death-casualties-rescue-2739697-2025-06-12",
      "headline": "Air India crash live updates: Plane's digital video recorder found from debrisAir India Ahmedabad-London Flight Crash Live: Air India has said that the black box of the crashed flight, which would provide crucial information about what went wrong, has not been recovered. At least 265 people have died in the Air India plane crash that took place in Ahmedabad on Thursday. Prime Minister Narendra Modi visited Ahmedabad and took stock of the situation. The airline, in a post on X, confirmed that only one of the 242 passengers and crew onboard had miraculously survived the crash. Rescue operations at the site have now been completed. The crash occurred as the aircraft was lifting off, according to early reports. Stay with IndiaToday.in for live updates."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/plane-broke-my-seat-came-off-lone-air-india-crash-survivor-reveals-how-he-escaped-deadly-accident-2740133-2025-06-13",
      "headline": "How I survived: Vishwas Kumar, on seat 11A, recounts miracle escape from crashVishwash Kumar Ramesh was in seat 11A of the doomed Air India flight. After the plane crashed and exploded, he was the only person pulled out alive from the wreckage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-launches-airstrike-in-iran-explosions-heard-in-tehran-report-glbs-2740035-2025-06-13",
      "headline": "Israel hits Iran's nuke sites, Army chief killed; Tehran retaliates with 100 drones  Live UpdatesIsrael on Friday launched preemptive strikes on Iran, which the nation called Operation Rising Lion, and said was necessary to wade off the nuclear threat from Tehran's side. Meanwhile, Iran has vowed retaliation and after the strikes killed several, including Iran's Revolutionary Guards Commander Hossein Salami."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-india-plane-crash-victim-arjun-patolia-travelled-london-to-india-scatter-wife-ashes-gujarat-2740254-2025-06-13",
      "headline": "He came to fulfil his wife's dying wish. Then he boarded doomed Air India flightLondon resident Arjun Patolia, a father of two, had travelled to India to scatter his late wife's ashes in River Narmada in Gujarat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-india-plane-crash-pilot-sumeet-sabharwal-clive-kunder-ahmedabad-crew-profile-2740235-2025-06-13",
      "headline": "One was to quit, another just started: Tale of two pilots of Air India crashWhile Captain Sumeet Sabharwal was days away from quitting flying, First Officer Clive Kunder was just starting his career in the skies. Both the pilots commanding the Air India Dreamliner died when their aircraft crashed in Ahmedabad, killing all, but one, on board."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/history-of-it/story/ahmedabad-air-crash-vijay-rupani-air-india-1965-india-pakistan-war-sabre-gujarat-cm-balwantrai-mehta-2740230-2025-06-13",
      "headline": "When a Pak fighter jet shot down Gujarat CM's plane 60 years agoSixty years before former Gujarat CM Vijay Rupani lost his life in the Air India crash on Thursday, a sitting CM of the state lost his life mid-air, not to a malfunction, but to a Pakistani strike. During the India-Pakistan War of 1965, a Pakistani fighter jet shot down Balwantrai Mehta's Beechcraft aircraft after perceiving it as a surveillance plane."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/air-india-plane-crash-ahmedabad-thousand-degree-inferno-rescue-update-2740189-2025-06-13",
      "headline": "Air India crash blaze reached 1,000°C, even dogs, birds couldn't escapeThe Air India plane crash in Ahmedabad led to a massive inferno reaching 1,000°C due to 1.25 lakh litres of fuel, making rescue operations nearly impossible. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-gautam-gambhir-returns-to-india-due-to-family-emergency-2740259-2025-06-13",
      "headline": "England tour: Coach Gautam Gambhir returns to India due to family emergencyIndian cricket team head coach Gautam Gambhir has returned to India from England due to a family emergency. India and England are set to lock horns in a five-match Test series beginning from June 20."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/information/story/what-is-a-black-box-in-an-aeroplane-and-why-its-crucial-after-a-crash-2740187-2025-06-13",
      "headline": "Day after Air India crash, hunt begins for black box: Why it's importantA black box in an aeroplane records flight and voice data. It's key in crash investigations, helping experts understand what went wrong and how to avoid it in future.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/air-india-crash-student-newly-engaged-couple-nurse-among-those-killed-in-ahmedabad-2740232-2025-06-13",
      "headline": "20-year-old student, newly engaged couple among those killed in Air India crashOut of the 242 people on board, 241 were killed in the disaster. The lone survivor, Vishwash Kumar Ramesh is presently undergoing treatment. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/air-india-plane-crash-latest-news-ahmedabad-airport-death-injured-survivor-pm-modi-amit-shah-boeing-cause-investigation-2740044-2025-06-13",
      "headline": "PM visits Air India crash site; bodies of 5 victims handed over to familiesAir India Flight AI171 bound for London crashed moments after taking off from Ahmedabad airport, killing at least 265 people in what authorities described as the world's worst aviation disaster in a decade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/roger-federer-rafael-nadal-novak-djokovic-big-three-grand-slam-2740122-2025-06-13",
      "headline": "Was never loved like Roger Federer and Rafael Nadal: Novak DjokovicNovak Djokovic has claimed that he was never loved like Roger Federer and Rafael Nadal during their playing days and felt like the third guy in tennis. Djokovic shared legendary rivalries with both Federer and Nadal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-traitors-review-karan-johar-show-feels-like-a-luxe-twisted-roadies-ride-2739994-2025-06-13",
      "headline": "The Traitors review: Bigg Boss meets Roadies in Karan Johar's luxe reality showReleased-Thu Jun 12, 2025Karan Johar-hosted show 'The Traitors' is now streaming on Prime Video. The reality show, with an impressive lineup of 20 celebrities, is a power play of vicious betrayals, cold-hearted deception, and constant manipulations. Read our review. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/delhi-bound-air-india-flight-makes-emergency-landing-in-thailand-after-bomb-threat-2740243-2025-06-13",
      "headline": "Bomb scare forces emergency landing of Delhi-bound Air India flight in ThailandAn Air India flight from Thailand's Phuket to Delhi made an emergency landing shortly after takeoff on Friday following a bomb threat, which was found to be a hoax after preliminary examination. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/shubhanshu-shuklas-space-launch-delayed-six-times-here-are-the-reasons-2740203-2025-06-13",
      "headline": "Shubhanshu Shukla's launch delayed six times: Here are the reasonsThe mission, which would mark India's return to human spaceflight after 41 years, was rescheduled for June 11, 2025, but now faces an indefinite delay. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/pm-narendra-modi-meets-air-india-plane-crash-lone-survivor-vishwash-kumar-ramesh-ahmedabad-hospital-video-2740150-2025-06-13",
      "headline": "Video: PM Modi meets Air India plane crash lone survivor at Ahmedabad hospitalPM Modi visits the Civil Hospital in Ahmedabad and meets the lone survivor, Vishwash Kumar Ramesh, of the Air India plane crash and other people injured in the accident.  In the plane crash, 265 people lost their lives. He was accompanied by Gujarat Chief Minister Bhupendra Patel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/explained-what-is-aircraft-accident-investigation-bureau-and-what-does-it-do-2740210-2025-06-13",
      "headline": "Explained: What is Aircraft Accident Investigation Bureau and what does it do?This government agency works to find the cause of air accidents and make flying safer for everyone.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/passenger-list-of-the-ahmedabad-plane-crash-what-we-know-so-far-2739746-2025-06-12",
      "headline": "169 Indians among 241 flyers killed in Air India flight crash: List of passengersAn Air India flight carrying over 242 passengers crashed near Ahmedabad Airport minutes after takeoff, triggering a massive rescue operation. Details about the passengers and casualties are still emerging as authorities work at the crash site."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karisma-kapoor-ex-husband-sunjay-kapur-dies-of-heart-attack-at-53-2740002-2025-06-12",
      "headline": "Karisma Kapoor's ex-husband Sunjay Kapur dies of heart attack at 53 Actor Karisma Kapoor's ex-husband, Sanjay Kapur, died of a heart attack in England. He was 53."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-attack-iran-nuclear-facilities-videos-rubble-smoke-drone-retaliation-army-chief-netanyahu-khamenei-2740160-2025-06-13",
      "headline": "Building on fire, thick smoke, rubble: Horrific visuals of Israeli attack on IranIsrael launched strikes on Tehran on Friday, targeting key nuclear and military sites and killing top commanders, sparking fears of a full-scale war with Iran."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vir-das-backs-air-india-after-crash-calls-them-best-crew-in-the-sky-2740236-2025-06-13",
      "headline": "Vir Das backs Air India after crash, calls them best crew in the skyOn Thursday, Vir Das lent his support to Air India, stating that he stands with them. This came following the crash of its London-bound flight AI171 in Ahmedabad. \r\n\r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/temperature-high-due-to-burning-of-125-lakh-litre-fuel-no-opportunity-to-save-anyone-amit-shah-2739968-2025-06-12",
      "headline": "No chance to save, 1.25 lakh litre fuel burned: Amit Shah on plane crashOn Thursday, flight AI-171 crashed on a government hospital hostel near Ahemdabad's Sardar Vallabbhai Patel International Airport, leaving a field of debris and scenes of devastation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mumbai-london-air-india-flight-diverted-due-to-iran-airspace-closure-after-israel-strike-2740095-2025-06-13",
      "headline": "At least 16 Air India flights diverted due to Iran airspace closure after Israel strikeSeveral Air India flights were diverted or forced to return to their origin airports after Iran closed its airspace following a major Israeli strike on Tehran. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/monsoon-to-reach-delhi-10-days-before-schedule-early-relief-from-heat-likely-2739990-2025-06-12",
      "headline": "Early monsoon arrival expected in Delhi, 10 days before scheduleTypically, the monsoon arrives in Delhi around June 30, but an India Meteorological Department (IMD) report suggests it could make its presence felt as early as the third week of June."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wtc-2025-final-day-3-australia-vs-south-afria-live-updates-world-test-championship-aus-sa-match-lord-cricket-ground-in-london-2740295-2025-06-13",
      "headline": "AUS vs SA Live Score, WTC Final 2025 Day 3: Australia tail look to frustrate South AfricaAustralia vs South Africa Live Score, World Test Championship Final 2025 Updates: The match is on a knife edge at the moment as Australia's tailenders look to frustrate South Africa and increase the lead further at Lord's. The Proteas are on the cusp of a monumental win but will need to get the two remaining wickets quickly. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-gautam-gambhir-returns-to-india-due-to-family-emergency-2740259-2025-06-13",
      "headline": "England tour: Coach Gautam Gambhir returns to India due to family emergencyIndian cricket team head coach Gautam Gambhir has returned to India from England due to a family emergency. India and England are set to lock horns in a five-match Test series beginning from June 20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/australia-captain-pat-cummins-hungry-for-more-after-300-test-wickets-2740212-2025-06-13",
      "headline": "Cummins hungry for more after 300 Test wickets: Got lots of miles in my legsAfter breaking into the 300 Test wicket club, Australia's Test skipper Pat Cummins remains hungry for more honours in his career. Cummins picked up six wickets for 28 on Day 2 of the WTC Final on Thursday, June 12. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/viktor-gyokeres-transfer-update-sporting-lisbon-manchester-united-arsenal-2740218-2025-06-13",
      "headline": "Manchester United target Viktor Gyokeres breaks silence amidst Sporting standoffViktor Gyokeres has addressed rumours about his future amidst a reported stand-off with Sporting Lisbon. Gyokeres has been heavily linked with a move to Manchester United and Arsenal during the summer. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-will-bat-with-more-responsibility-as-captain-monty-panesar-2740206-2025-06-13",
      "headline": "Shubman Gill will bat with more responsibility as captain, claims former spinnerIndia's newly appointed Test captain Shubman Gill has been backed to bat a lot more responsibly with the added burden of leadership on his shoulders by former England spinner Monty Panesar. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-tour-of-england-morne-morkel-red-ball-practice-test-series-2740201-2025-06-13",
      "headline": "India bowling coach Morne Morkel admits he was nervous ahead of England tourIndia bowling coach Morne Morkel felt nervous going into the England tour due to the limited red-ball game time the team has had in the past few months. India last played a Test match in January this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/wtc-final-2025-sa-vs-aus-day-2-david-bedingham-full-press-conference-2740172-2025-06-13",
      "headline": "Match can go either way, but we've a lot of belief in dressing room: BedinghamSouth Africa batter David Bedingham said that the World Test Championship (WTC) final 2025 hangs in the balance on Day 2, but mentioned that there's enough belief in the dressing room to chase down whatever Australia puts on the board. Australia finished Day 2 on 144/8, leading by 218 runs in their second innings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/world-test-championship-final-australia-vs-south-africa-pat-cummins-josh-hazlewood-mitchell-starc-matthew-hayden-2740161-2025-06-13",
      "headline": "Cummins-Hazlewood-Starc better than McGrath-Lee-Gillespie: Hayden's big claimMatthew Hayden has praised the current Australian pace trio of Pat Cummins, Josh Hazlewood and Mitchell Starc after their dominant Day 2 performance in the World Test Championship final. Hayden feels that the trio is better than the pace attack of Glenn McGrath, Jason Gillespie and Glenn McGrath. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mlc-2025-finn-allen-shatters-multiple-records-san-franciso-unicorns-2740157-2025-06-13",
      "headline": "Finn Allen shatters multiple records en route 51-ball 151 for San FranciscoNew Zealand batter Finn Allen rewrote the record books with his breathtaking innings of 151 (51) during the opening game of Major League Cricket 2025 (MLC 2025) for San Francisco Unicorns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-tottenham-hotspur-appoint-thomas-frank-ange-postecoglou-2740142-2025-06-13",
      "headline": "Tottenham Hotspur announce Thomas Frank as Ange Postecoglou replacementTottenham Hotspur have appointed Thomas Frank as their new manager on a three-year contract. The Danish coach replaces Ange Postecoglou after a disappointing Premier League season, that saw Spurs finish 17th in the points table. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-excited-about-being-on-threshold-of-becoming-wtc-winners-david-bedingham-2740131-2025-06-13",
      "headline": "SA excited about being on threshold of becoming WTC winners: David BedinghamSouth Africa batter David Bedingham said that the team is excited about being on the cusp of winning the World Test Championship (WTC) title. South Africa will have to chase down a target in excess of 200 to stake claim of the coveted mace."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/wtc-final-2025-sa-vs-aus-day-2-david-bedingham-full-press-conference-2740172-2025-06-13",
      "headline": "Match can go either way, but we've a lot of belief in dressing room: BedinghamSouth Africa batter David Bedingham said that the World Test Championship (WTC) final 2025 hangs in the balance on Day 2, but mentioned that there's enough belief in the dressing room to chase down whatever Australia puts on the board. Australia finished Day 2 on 144/8, leading by 218 runs in their second innings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/world-test-championship-final-australia-vs-south-africa-pat-cummins-josh-hazlewood-mitchell-starc-matthew-hayden-2740161-2025-06-13",
      "headline": "Cummins-Hazlewood-Starc better than McGrath-Lee-Gillespie: Hayden's big claimMatthew Hayden has praised the current Australian pace trio of Pat Cummins, Josh Hazlewood and Mitchell Starc after their dominant Day 2 performance in the World Test Championship final. Hayden feels that the trio is better than the pace attack of Glenn McGrath, Jason Gillespie and Glenn McGrath. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mlc-2025-finn-allen-shatters-multiple-records-san-franciso-unicorns-2740157-2025-06-13",
      "headline": "Finn Allen shatters multiple records en route 51-ball 151 for San FranciscoNew Zealand batter Finn Allen rewrote the record books with his breathtaking innings of 151 (51) during the opening game of Major League Cricket 2025 (MLC 2025) for San Francisco Unicorns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-tottenham-hotspur-appoint-thomas-frank-ange-postecoglou-2740142-2025-06-13",
      "headline": "Tottenham Hotspur announce Thomas Frank as Ange Postecoglou replacementTottenham Hotspur have appointed Thomas Frank as their new manager on a three-year contract. The Danish coach replaces Ange Postecoglou after a disappointing Premier League season, that saw Spurs finish 17th in the points table. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-excited-about-being-on-threshold-of-becoming-wtc-winners-david-bedingham-2740131-2025-06-13",
      "headline": "SA excited about being on threshold of becoming WTC winners: David BedinghamSouth Africa batter David Bedingham said that the team is excited about being on the cusp of winning the World Test Championship (WTC) title. South Africa will have to chase down a target in excess of 200 to stake claim of the coveted mace."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}