{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-nears-full-profitability-revenue-grows-to-rs-1911-crore-2720453-2025-05-06",
      "headline": "Paytm nears full profitability; revenue grows to Rs 1,911 crorePaytm's revenue increased by 5% quarter-on-quarter, reaching Rs 1,911 crore, reflecting the company's steady performance and continued momentum in its core businesses. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/need-a-personal-loan-unlock-rs-5-lakh-instantly-using-just-your-pan-card-2720405-2025-05-06",
      "headline": "Need a personal loan? Unlock Rs 5 lakh instantly using just your PAN cardTo apply online, you simply visit the bank or lender's website and fill out the application form. You'll need to provide your name, date of birth, mobile number, and PAN number."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-156-points-lower-nifty-below-24400-adani-enterprises-falls-4-2720369-2025-05-06",
      "headline": "Sensex ends 156 points lower, Nifty below 24,400; Adani Enterprises falls 4%The BSE Sensex ended 155.77 points lower at 80,641.07, while the NSE Nifty50 fell 81.55 points to settle at 24,379.60. Most of the broader market indices also declined during the trading session due to high selling pressure. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/yes-bank-denies-reports-of-stake-sale-to-japans-smbc-calls-it-speculative-2720360-2025-05-06",
      "headline": "Yes Bank denies reports of stake sale to Japan's SMBC, calls it 'speculative'The private sector lender clarified that while it regularly explores business opportunities, there is nothing material to disclose under current regulatory norms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/saying-yes-to-a-joint-loan-here-is-how-it-can-affect-your-credit-score-2720344-2025-05-06",
      "headline": "Saying yes to a joint loan? Here's how it can affect your credit scoreEvery time an EMI is paid on time, it reflects positively on both borrowers' credit profiles. Over time, this builds your credit score. If you were added as a co-applicant to help someone get a loan because your own score was low, this is your chance to improve it."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-2025-5-common-mistakes-you-must-avoid-while-filing-your-tax-returns-2720287-2025-05-06",
      "headline": "ITR filing 2025: 5 common mistakes you must avoid while filing your tax returnsUsing the wrong ITR form can delay your tax processing or, worse, your return may get rejected. Also, filing your ITR is not the final step, you must also verify it."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/is-the-global-economy-breathing-easier-as-trump-eases-up-on-tariffs-2720249-2025-05-06",
      "headline": "Is the worst over for global economy as Trump eases stance on tariffs?Even as Trump suggests deals are near with countries like India, Japan, and South Korea, and China reviews a fresh proposal from Washington, the global economy isn't breathing easy yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/opted-for-new-tax-regime-here-is-a-look-at-key-benefits-what-you-can-claim-itr-filing-2720230-2025-05-06",
      "headline": "Opted for new tax regime? Here's a look at key benefits, what you can claimThe government brought in the new tax regime to make things simpler for taxpayers. It gives you more tax slabs with lower rates, which means you may end up paying less tax."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/ather-energy-gives-up-listing-gains-slides-4-after-weak-debut-hold-or-sell-2720209-2025-05-06",
      "headline": "Ather Energy gives up listing gains, slides 4% after weak debut. Hold or sell?Ather Energy's stock opened at Rs 328 on the NSE, up 2.2% over its issue price of Rs 321, but slipped over 4% to an intraday low of Rs 308.95 amid weak market sentiment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/why-is-stock-market-down-today-know-why-sensex-nifty-falling-2720190-2025-05-06",
      "headline": "Sensex down over 200 points. Why is the stock market down today?As of 10:48 am, the BSE Sensex was down 213.43 points at 80,583.41, while the NSE Nifty50 slipped 72.40 points to 24,388.75. Broader indices saw sharper cuts, with the Nifty midcap and smallcap indices falling around 1% each, reflecting risk-off sentiment in domestic-focused sectors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/ather-energy-makes-lukewarm-market-debut-lists-just-2-percent-above-ipo-price-2720179-2025-05-06",
      "headline": "Ather Energy makes muted debut on Dalal Street, lists 2% above IPO priceAt the time of listing, the Bengaluru-based company was valued at around Rs 12,144 crore, slightly below its implied market capitalisation of Rs 12,300 crore at the upper end of the IPO price band (Rs 304–Rs 321)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/japans-smbc-likely-in-advanced-talks-to-buy-majority-stake-in-yes-bank-share-price-market-reaction-2720169-2025-05-06",
      "headline": "Explained: Why Yes Bank shares are rising todayYes Bank shares rose sharply as shareholders reacted positively to the news. At around 9:43 am, shares of the bank were trading 5.30% higher at Rs 18.69."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-nick-jonas-shine-at-met-gala-2025-after-party-2720541-2025-05-06",
      "headline": "Priyanka Chopra shines in diamond dress at Met Gala after-party with Nick JonasPriyanka Chopra dazzled in a diamond-studded mini dress at the Met Gala 2025 after-party, stealing the spotlight once again. Alongside husband Nick Jonas, the couple's stylish appearances became the talk of the internet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/100-days-to-go-rajinikanths-coolie-countdown-begins-2720544-2025-05-06",
      "headline": "100 days to go: Rajinikanth's Coolie countdown beginsThe makers of Rajinikanth-starrer 'Coolie' have released a new promo 100 days ahead of the release of Lokesh Kanagaraj's high-octane action film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/tony-kakkar-shaan-support-sonu-nigam-bengaluru-concert-row-2720536-2025-05-06",
      "headline": "Tony Kakkar, Shaan extend support to Sonu Nigam after Bengaluru concert rowSinger Tony Kakkar and Shaan defended Sonu Nigam after he received backlash, and a police complaint, over his remarks at a Bengaluru concert."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/neha-kakkar-reacts-to-melbourne-concert-controversy-days-after-organisers-claim-2720504-2025-05-06",
      "headline": "Neha Kakkar reacts to Melbourne concert controversy days after organiser's claimNeha Kakkar has responded to allegations that she skipped her Melbourne concert due to low turnout, sharing a video of a lively performance to counter the claims. The controversy continues as event organisers alleged she refused to perform because of the crowd size."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/karthik-subbaraj-on-his-next-after-retro-want-to-make-an-indie-film-2720434-2025-05-06",
      "headline": "Karthik Subbaraj on his next after Retro: Want to make an indie filmAfter directing high-budget films like 'Retro,' director Karthik Subbaraj has revealed his plans to direct an indie film, a low-budget project featuring new artists."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/diljit-dosanjh-wanted-historic-rs-21000-crore-necklace-for-met-gala-2025-but-was-denied-2720440-2025-05-06",
      "headline": "Bling denied: Why Diljit Dosanjh didn't wear Rs 21,000 crore necklace to Met GalaDiljit Dosanjh made a powerful Met Gala debut in a regal Prabal Gurung outfit inspired by the Maharaja of Patiala. His team's attempt to borrow the Maharaja's iconic Rs 21,000 crore Cartier necklace was denied, leading them to commission custom jewellery instead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/explained-donald-trump-100-per-cent-tariff-on-foreign-films-and-what-it-means-for-indian-cinema-2720474-2025-05-06",
      "headline": "Trump's 100% tariff on foreign films, and what it means for Indian CinemaWill the Indian film industry be impacted by Donald Trump's policy involving a 100 per cent tariff on foreign films in the US? We spoke to the industry experts to understand the US President's decision, and the respective action to be taken. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/baeksang-arts-awards-korea-when-life-gives-you-tangerines-sweep-trophies-park-bo-gum-iu-lose-2720466-2025-05-06",
      "headline": "When Life Gives You Tangerines sweep Baeksang Awards, but Park Bo-gum, IU loseSouth Korea's prestigious event, the Baeksang Arts Awards, was held on May 5. While 'When Life Gives You Tangerines' secured awards across several categories, its lead actors Park Bo-gum and IU missed out on individual accolades."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/controversy-vinay-pathak-accused-plagiarism-gram-chikitsalay-kolkata-filmmaker-2720407-2025-05-06",
      "headline": "Vinay Pathak accused of plagiarising Kolkata director's work in Gram ChikitsalayPrime Video's 'Gram Chikitsalay' faces plagiarism allegations before its release. The TVF series, featuring Vinay Pathak and Amol Parashar, is set to premiere on May 9."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rahul-vaidya-slams-virat-kohli-fans-after-getting-blocked-by-the-cricketer-2720401-2025-05-06",
      "headline": "Singer Rahul Vaidya slams Virat Kohli fans after getting blocked by cricketerVirat Kohli's accidental like on Avneet Kaur's Instagram post sparked online buzz, leading him to issue a clarification. Singer Rahul Vaidya mocked the explanation, joking about Instagram glitches and revealing he was blocked by Kohli."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/summer-2025-and-south-cinema-a-season-of-surprises-or-a-wasted-opportunity-2720361-2025-05-06",
      "headline": "Summer 2025 and South cinema: A season of surprises or a wasted opportunity?With some surprise hits and notable missteps, the summer of 2025 raises a crucial point. Southern cinema has either capitalised on its potential or missed a golden opportunity to redefine the season's power."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karan-johar-skips-priyanka-chopra-not-shah-rukh-khan-diljit-dosanjh-kiara-advani-in-stories-about-indians-at-met-gala-2025-2720283-2025-05-06",
      "headline": "Karan Johar is all praise for Indian celebs at Met Gala 2025, except for PriyankaFilmmaker Karan Johar reviewed the Met Gala 2025 looks of Indian celebrities. He mentioned everyone from Shah Rukh Khan to Diljit Dosanjh and Kiara Advani, but Priyanka Chopra wasn't to be found on his list. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-suriya-retro-director-karthik-subbaraj-overwhelmed-2720284-2025-05-06",
      "headline": "Rajinikanth watches Suriya's Retro, director Karthik Subbaraj is overwhelmedSuperstar Rajinikanth recently watched Suriya's 'Retro' and appreciated director Karthik Subbaraj. The filmmaker expressed his happiness with a special note on X."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/pawandeep-rajan-health-update-multiple-fractures-under-observation-in-icu-2720279-2025-05-06",
      "headline": "Pawandeep Rajan suffered multiple fractures, in ICU and recovering: Singer's teamIndian Idol 12 winner Pawandeep Rajan met with a major accident on May 5 and is currently undergoing treatment in Noida. His team has provided an update on his health, assuring fans that he is doing fine now and is under observation in the ICU."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diljit-dosanjh-instagram-post-about-met-gala-2025-with-turban-culture-mother-tongue-main-hoon-punjab-2720259-2025-05-06",
      "headline": "Main hoon Punjab: Diljit wraps Met Gala with 'turban, culture, mother tongue' For Diljit Dosanjh, heritage and culture came first and fashion later as he walked the blue carpet at the Met Gala 2025. The 41-year-old took a bit of Punjab's royal history in his Maharaja-inspired look at the fashion's biggest night. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/varun-tej-lavanya-tripathi-announce-pregnancy-2720246-2025-05-06",
      "headline": "Telugu actors Varun Tej, Lavanya Tripathi announce pregnancyTelugu actors Varun Tej and Lavanya Tripathi announced that they are expecting their first child. They shared the announcement on their social media pages."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shakira-shares-car-with-diljit-dosanjh-says-hi-india-in-viral-met-gala-clip-2720238-2025-05-06",
      "headline": "Shakira shares car with Diljit Dosanjh, says 'Hi, India' in viral Met Gala clipDiljit Dosanjh reunited with Priyanka Chopra and Nick Jonas at the Met Gala. The singer even shared a car with Shakira while making his way to the prestigious event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sidharth-malhotra-wins-hearts-as-he-supports-mother-to-be-kiara-advani-at-met-gala-2025-2720222-2025-05-06",
      "headline": "Sidharth Malhotra wins hearts as he supports mother-to-be Kiara at Met Gala 2025Sidharth Malhotra's support for pregnant wife Kiara Advani at Met Gala 2025 touched hearts, even without a red carpet appearance. A viral video and his heartfelt tribute online made their quiet moment the real showstopper."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/squid-game-3-teaser-netflix-2720212-2025-05-06",
      "headline": "Squid Game 3 teaser: No dialogue, just dread as final game resumesNetflix's teaser for 'Squid Game' Season 3 hints at a darker, more dramatic finale as Seong Gi-hun awakens in a coffin, sparking theories about new game dynamics and unseen threats. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/donald-trump-india-tariff-cut-video-drop-to-nothing-pm-modi-2720630-2025-05-06",
      "headline": "Weeks after tariff move, Trump says India has agreed to cut duties to 'nothing'Trump says India has agreed to 'drop tariffs to nothing': Would have never done that for anybody but me"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-indus-waters-treaty-suspension-pakistan-pahalgam-attack-baisaran-2720572-2025-05-06",
      "headline": "India's water used to go outside but now...: PM's first remark on Indus Treaty moveSpeaking about the move to suspend the Indus Waters Treaty with Pakistan, PM Modi asserted that water meant for India will now remain and be used within the country. He made the remark while addressing an ABP News event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/khan-market-vasant-vihar-delhi-security-drills-pahalgam-pakistan-2720585-2025-05-06",
      "headline": "Over 50 locations in Delhi to witness security drills from 4 pm tomorrowIn New Delhi district, the drills will be held in Khan Market, NDMC office building, Palika Kendra, Charak Palika Hospital, Vasant Vihar, D-6, residential colony, Terminal-3 of IGI Airport and Kendriya Vidyalaya School, Delhi Cantt."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-force-plans-large-scale-drill-along-southern-pakistan-border-geo-intelligence-expert-2720514-2025-05-06",
      "headline": "Air Force plans large-scale drill along border with Pak: Geo-intel expertIntelligence expert Damien Symon said that a Notice to Airmen, which indicates restricted airspace usage in the region, has been issued by the government for air exercise along its border with Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/india-at-met-gala-2025-srk-kiara-advani-diljit-dosanjh-isha-ambani-priyanka-chopra-2720208-2025-05-06",
      "headline": "India at the Met Gala 2025: The hits (and the misses)With a strong lineup of Indian celebrities in attendance, Met Gala 2025 gave us some memorable fashion moments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-mark-carney-canada-us-51st-state-not-for-sale-2720611-2025-05-06",
      "headline": "In meet with Trump, Carney says Canada not for sale, gets 'never say never' replyDonald Trump and Mark Carney's meeting started with smiles and a handshake despite Trump's desire to make Canada the 51st US state, a prospect that has chilled bilateral relations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-slams-islamic-group-oic-remark-says-it-fails-to-address-pahalgam-attack-2720570-2025-05-06",
      "headline": "Absurd, at Pak's behest: India on Islamic nations group's remark after J&K attackIndia strongly criticised the OIC for its statement about not mentioning the April 22 Pahalgam terror attack and parroting Pakistan's propaganda on Kashmir, saying it was issued at Islamabad's request."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/shloka-mehta-sister-diya-mehta-jatia-in-backless-outfit-at-met-gala-2025-2720389-2025-05-06",
      "headline": "Shloka Mehta's sister Diya Mehta Jatia in edgy, backless suit at Met Gala 2025Shloka Mehta's sister Diya Mehta Jatia attended the Met Gala 2025 in an edgy backless suit from the label Bloni."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/amazon-indias-great-summer-sale-2025-is-here-transform-your-garden-with-upto-60-off-on-lawn-garden-essentials-2718704-2025-05-02",
      "headline": "Amazon India's Great Summer Sale 2025 is here: Transform your garden with upto 60% off on lawn & garden essentialsMake your Garden and Lawn summer ready with Amazon India's Great Summer Sale 2025 that is live now. Enjoy Up to 60% off on Lawn & Garden Essentials such as Plants, Solar Lights and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-prashant-kishor-is-out-to-corner-nitish-kumar-on-home-turf-2720343-2025-05-06",
      "headline": "Why Prashant Kishor is out to corner Nitish Kumar on home turfWith three posers, the strategist-turned-politician begins a signature campaign from the CM's native place Kalyanbigha on May 11, all the way to 40,000 villages\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/filipino-filipino-cardinal-luis-antonio-tagle-asian-francis-emerges-as-top-papa-contender-for-next-pope-2720150-2025-05-06",
      "headline": "Filipino 'Asian Francis' emerges as top contender for next PopeIf Tagle were elected, it would also likely signal to the world's 1.4 billion Catholics that the cardinals want to go forward with Francis' vision of generally opening up the Church to the modern world by not choosing a man who might roll back some of the late pope's reforms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/explained-donald-trump-100-per-cent-tariff-on-foreign-films-and-what-it-means-for-indian-cinema-2720474-2025-05-06",
      "headline": "Trump's 100% tariff on foreign films, and what it means for Indian CinemaWill the Indian film industry be impacted by Donald Trump's policy involving a 100 per cent tariff on foreign films in the US? We spoke to the industry experts to understand the US President's decision, and the respective action to be taken. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-defence-minister-khawaja-asif-if-not-us-there-will-be-no-one-amid-india-tensions-2720438-2025-05-06",
      "headline": "If not us, there will be no one: Pak minister's warning amid tensions with IndiaThe remark comes as tensions between the two countries hit a new low following the Pahalgam terror attack, after which India took several actions against the neighbouring country, including the suspension of the Indus Waters Treaty. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pak-army-vehicle-targeted-balochistan-blast-soldiers-dead-injured-2720524-2025-05-06",
      "headline": "7 Pak soldiers killed in blast targeting Army vehicle in Balochistan: ReportAn IED blast targeting a Pakistan Army vehicle killed seven people in the restive southern province of Balochistan. According to the army, the Balochistan Liberation Army (BLA) was behind the attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-uk-sign-free-trade-agreement-pm-modi-keir-starmer-2720501-2025-05-06",
      "headline": "India and UK clinch trade pact, PM Modi says move to deepen bilateral tiesIndia and the UK signed a landmark free trade agreement in the shadow of US President Donald Trump's tariff warnings. Calling the deal a \"historic milestone\", PM Narendra Modi said the move will further deepen the comprehensive strategic partnership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/what-54-leopards-thriving-in-mumbais-green-lung-means-2720347-2025-05-06",
      "headline": "What 54 leopards thriving in Mumbai's green lung meansThe survey count at the Sanjay Gandhi National Park is a marked jump from the 47 leopards detected in the habitat in 2018\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/papal-conclave-new-pope-election-pope-francis-death-cardinals-vatican-city-2720383-2025-05-06",
      "headline": "Conclave to elect new Pope tomorrow, cardinals to move into Vatican todayFollowing the death of Pope Francis on April 21, 133 cardinal electors will gather on Wednesday in the Sistine Chapel for an election that could last hours, days, or even months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-tensions-mock-drills-how-india-plans-to-prepare-civilians-for-war-like-emergency-2720403-2025-05-06",
      "headline": "What will tomorrow's civil defence drills look like? Preps give a glimpseCivic volunteers conducted rehearsals ahead of tomorrow's security drills across various cities in India. The mock drills are being conducted at Centre's order amid rising tensions with Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/madhya-pradesh-librarian-principal-government-school-fistfights-hair-pulls-slaps-khargone-2720471-2025-05-06",
      "headline": "Slaps, hair pulls, smashed phones: Principal, librarian come to blows at schoolA principal and a librarian were involved in a heated argument over division work, which spiralled into a full-blown physical altercation - slapping, pulling hairs, landing blows and smashing each other's phones. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/india-shuts-gates-bagligar-salal-dam-chenab-dry-pakistan-war-indus-system-kharif-water-scarcity-punjab-2720175-2025-05-06",
      "headline": "Pakistan sweats, India's dam closure could hit its food bowlIndia has flushed and shut two dams on the Chenab to refill them within weeks of suspending the Indus Waters Treaty. The Chenab of the Indus Water System is Pakistan's lifeline. Pakistani authorities saw a dip in water levels in Chenab, coinciding with the crucial kharif season when food crops like paddy and maize are sown."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/michelle-obama-says-shes-in-transitional-therapy-shuts-down-divorce-rumours-2720550-2025-05-06",
      "headline": "Michelle Obama says she's in therapy: Transitioning into new phase of lifeAmid speculation of a divorce from former US President Barack Obama, former First Lady Michelle Obama said she's undergoing therapy to \"transition\" to the \"next phase of her life\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/friedrich-merz-german-chancellor-parliament-voting-2720552-2025-05-06",
      "headline": "After initial shock defeat, Friedrich Merz elected German chancellorAfter initial shock defeat, Friedrich Merz elected German chancellor in second round of Parliament voting"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/lucknow-shankh-air-ceo-hangs-lift-operator-staffer-upside-down-thrashes-him-2720500-2025-05-06",
      "headline": "Lift operator says he was hung upside down, assaulted by airline CEO in LucknowLift operator employees have accused the CEO of UP-based Shankh Air of assaulting them at his house in Lucknow. One of the employees was hung upside down and assaulted."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-tour-of-england-squad-selection-update-devajit-saikia-bcci-2720601-2025-05-06",
      "headline": "Rohit Sharma, Virat Kohli for England Tests? BCCI secretary shares selection updateIndia tour of England: The squad for the five-Test series in England is set to be announced before the final of IPL 2025, BCCI secretary Devajit Saikia said. The five-Test series will get underway from June 20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-gt-jos-buttler-run-out-ms-dhoni-style-corbin-bosch-2720599-2025-05-06",
      "headline": "Jos Buttler emulates MS Dhoni with sensational run-out in MI vs GTIPL 2025: Jos Buttler stunned fans with a Dhoni-style no-look run out against MI, showcasing his exceptional wicketkeeping skills and adding yet another highlight to a standout IPL 2025 campaign with the Gujarat Titans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-gt-rashid-khan-surgery-wankhede-stadium-mumbai-2720591-2025-05-06",
      "headline": "MI vs GT: Rashid Khan says he is still at 75 percent after fine spellGT spinner Rashid Khan says he is still at 75 percent after a fine spell against MI on Tuesday, May 6. Rashid had struggled to find his rhythm in the early part of the IPL 2025 season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-vs-csk-ms-dhoni-fitness-training-eric-simons-update-2720586-2025-05-06",
      "headline": "IPL 2025 KKR vs CSK: MS Dhoni skips practice, but will play in Kolkata, says bowling coachIPL 2025, KKR vs CSK: Captain MS Dhoni will play Wednesday's game against Kolkata Knight Riders, confirmed Chennai Super Kings bowling coach Eric Simons. Dhoni did not train in the lead-up to the much-awaited game in Kolkata. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-gt-rohit-sharma-left-arm-pace-trap-arshad-khan-2720565-2025-05-06",
      "headline": "Rohit Sharma flops in Mumbai as Gujarat Titans' left-arm pace plan worksIPL 2025, MI vs GT: Gujarat Titans were rewarded for their tactical move to bring in Arshad Khan for their game in Mumbai. The left-arm pacer dismissed Rohit Sharma cheaply in the powerplay on Tuesday, May 6. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-uncapped-player-rule-sunil-gavaskar-2720558-2025-05-06",
      "headline": "Sunil Gavaskar wants change in rule that accommodated Dhoni as uncapped playerSunil Gavaskar wants a change to the IPL rule that allowed MS Dhoni to be retained as an uncapped player by CSK ahead of the IPL 2025 auction. Dhoni was retained by Chennai for Rs. 4 Crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-arun-dhumal-interview-94-matches-pahalgam-attack-2720551-2025-05-06",
      "headline": "94 matches in an IPL season? Chairman Arun Dhumal confirms plans for league expansionIPL 2025: Speaking to India Today, Indian Premier League chairman Arun Dhumal said the BCCI will continue to follow the government's directives on cricket ties with Pakistan. He also confirmed that the BCCI is looking to expand the IPL to 94 matches by the 2028 season."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-test-future-gautam-gambhir-india-tour-of-england-2720547-2025-05-06",
      "headline": "Gautam Gambhir breaks silence on Virat Kohli, Rohit Sharma Test futuresIndia coach Gautam Gambhir has broken the silence on Rohit Sharma and Virat Kohli's Test futures ahead of the tour of England. Rohit and Kohli's futures has been under the scanner since the Border-Gavaskar Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-arun-dhumal-chairman-exclusive-interview-2720538-2025-05-06",
      "headline": "Nation first: IPL chief Arun Dhumal on cricket amid rising India-Pakistan tensionIPL chairman Arun Dhumal reaffirmed that Indian cricket will follow the government's lead on ties with Pakistan, emphasising \"nation first\" amid rising tensions in the aftermath of the Pahalgam attack. He also confirmed plans to expand the IPL to a 94-match season by 2028 while celebrating the emergence of new Indian talent in 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-should-not-play-cricket-vs-pakistan-coach-gautam-gambhir-pahalgam-terror-attack-2720539-2025-05-06",
      "headline": "India shouldn't play Pakistan in cricket till terrorism ends: Gautam GambhirAfter the Pahalgam terror attack, India coach Gautam Gambhir says there should be no cricket with Pakistan until peace is restored and justice is done, even if it means skipping ICC matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-gt-kagiso-rabada-return-delayed-shubman-gill-2720523-2025-05-06",
      "headline": "Kagiso Rabada return delayed: GT skipper Shubman Gill explains call for MI clashGT have decided not to rush Kagiso Rabada as the South African pacer was made to sit out the clash against MI at the Wankhede stadium on Tuesday, May 6. Rabada recently returned to GT squad after serving his suspension for a failed drug test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-arun-dhumal-interview-94-matches-pahalgam-attack-2720551-2025-05-06",
      "headline": "94 matches in an IPL season? Chairman Arun Dhumal confirms plans for league expansionIPL 2025: Speaking to India Today, Indian Premier League chairman Arun Dhumal said the BCCI will continue to follow the government's directives on cricket ties with Pakistan. He also confirmed that the BCCI is looking to expand the IPL to 94 matches by the 2028 season."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-test-future-gautam-gambhir-india-tour-of-england-2720547-2025-05-06",
      "headline": "Gautam Gambhir breaks silence on Virat Kohli, Rohit Sharma Test futuresIndia coach Gautam Gambhir has broken the silence on Rohit Sharma and Virat Kohli's Test futures ahead of the tour of England. Rohit and Kohli's futures has been under the scanner since the Border-Gavaskar Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-arun-dhumal-chairman-exclusive-interview-2720538-2025-05-06",
      "headline": "Nation first: IPL chief Arun Dhumal on cricket amid rising India-Pakistan tensionIPL chairman Arun Dhumal reaffirmed that Indian cricket will follow the government's lead on ties with Pakistan, emphasising \"nation first\" amid rising tensions in the aftermath of the Pahalgam attack. He also confirmed plans to expand the IPL to a 94-match season by 2028 while celebrating the emergence of new Indian talent in 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-should-not-play-cricket-vs-pakistan-coach-gautam-gambhir-pahalgam-terror-attack-2720539-2025-05-06",
      "headline": "India shouldn't play Pakistan in cricket till terrorism ends: Gautam GambhirAfter the Pahalgam terror attack, India coach Gautam Gambhir says there should be no cricket with Pakistan until peace is restored and justice is done, even if it means skipping ICC matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-gt-kagiso-rabada-return-delayed-shubman-gill-2720523-2025-05-06",
      "headline": "Kagiso Rabada return delayed: GT skipper Shubman Gill explains call for MI clashGT have decided not to rush Kagiso Rabada as the South African pacer was made to sit out the clash against MI at the Wankhede stadium on Tuesday, May 6. Rabada recently returned to GT squad after serving his suspension for a failed drug test. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}