{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/from-lpg-prices-to-upi-rules-3-key-march-2026-changes-that-could-impact-your-budget-2876492-2026-03-02",
      "headline": "From LPG prices to UPI rules: 3 key March 2026 changes that could impact your budgetMarch 2026 has brought a few important changes that could affect your monthly budget. From LPG cylinder prices to new UPI rules and railway updates, here are three key changes you should know about."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/strait-of-hormuz-importance-explained-global-economy-oil-prices-india-impact-2876480-2026-03-02",
      "headline": "Strait of Hormuz is buzzing again and why it matters to the global economyThe Strait of Hormuz is a narrow waterway between Iran and Oman that connects the Gulf to the Arabian Sea. On a typical day, ships carrying oil equal to about one-fifth of global demand pass through it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-crash-wipes-out-more-than-rs-9-lakh-crore-of-investor-wealth-2876476-2026-03-02",
      "headline": "Rs 9 lakh crore gone as brutal Dalal Street crash rattles investorsThe sell-off on Dalal Street has erased over Rs 9 lakh crore in investor wealth, dragging BSE's total market capitalisation down from nearly Rs 463 lakh crore to around Rs 454 lakh crore during intraday trade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-at-66000-mark-3-things-crypto-investors-must-know-as-iran-us-tensions-rise-2876453-2026-03-02",
      "headline": "Bitcoin at $66,000 mark: 3 things crypto investors must know as Iran–US tensions riseBitcoin is hovering around the $66,000 level as global markets reel from rising Iran–US tensions. However, the key question remains: what's next?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-crash-sensex-nifty-investors-panic-middle-east-us-iran-2876445-2026-03-02",
      "headline": "Sensex nosedives 1,500 points today: Should investors be worried?Markets are sliding under Middle East tensions, surging crude, US–Iran hostilities and fears of trade blockages. Fundamentals look steady for now, but if the conflict deepens, is this only the first shock?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-jumps-rs-6000-silver-soars-rs-10000-how-iran-us-tensions-affect-your-money-2876420-2026-03-02",
      "headline": "Gold jumps Rs 6,000, silver soars Rs 10,000: How Iran–US tensions affect your moneyGold and silver surged as Iran–US tensions drove investors towards safer assets. The big question is, what does this mean for your money?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/rvnl-irfc-share-price-railway-stocks-falling-today-explained-2876419-2026-03-02",
      "headline": "RVNL, IRFC down up to 5%: Why are these railway stocks falling today?RVNL was down 5.74% to Rs 298.20 at around 12:03 pm, while IRFC shares were down 4.65% to Rs 98.74. The weakness in these names comes at a time when sentiment across domestic equities has turned cautious as global risk appetite faded and benchmark indices weakened."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/larsen-and-toubro-share-price-tumbles-iran-us-israel-tensions-middle-east-exposure-2876391-2026-03-02",
      "headline": "L&T share price tumbles over 5%. Why is the stock falling today?L&T's slide highlights how surging crude and geopolitical uncertainty are unsettling infrastructure stocks, prompting investors to reassess cost risks and project visibility until conditions stabilise in conflict-hit regions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/paras-defence-bel-data-patterns-bdl-defence-stock-rising-explained-2876376-2026-03-02",
      "headline": "Paras Defence shares jump 12%: Why are defence stocks rising today?Defence stocks across the board were firm even as the rest of the market struggled with weak sentiment linked to rising crude prices and the worsening conflict involving Iran and the United States."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/why-is-stock-market-falling-sensex-nifty-down-iran-us-israel-war-oil-prices-rise-strait-of-hormuz-2876366-2026-03-02",
      "headline": "Sensex crashes 1,800 points amid Iran-US conflict: 6 things you need to knowThe S&P BSE Sensex fell sharply in early trade, and the NSE Nifty50 also slipped more than 2%, as investors reacted to the fast-changing situation between the US, Israel and Iran."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/market-opening-bell-sensex-tanks-1000-points-nifty-below-24900-oil-stocks-down-2876358-2026-03-02",
      "headline": "Sensex tanks 1,000 points as oil surges amid ongoing Iran-US conflictThe S&P BSE Sensex fell over 1,000 points in early trade, slipping below 81,000. The NSE Nifty50 dropped under 24,900. This was one of the steepest opening declines in recent weeks."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-opening-will-stock-market-fall-today-amid-iran-us-israel-war-oil-price-surge-trading-view-nse-bse-gift-nifty-2876338-2026-03-02",
      "headline": "Will stock market fall today amid Iran's war with the US, Israel?Early signals from Gift Nifty suggest a weak start. Gift Nifty futures were trading at 25,60 points at 8:30 am. This indicates that the benchmark Nifty 50 may open below Friday's close of 25,178.65. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/india-wont-face-immediate-oil-disruption-amid-iran-crisis-2876159-2026-03-01",
      "headline": "Sufficient stock, India won't face immediate oil disruption amid Iran crisisIndia imports 88 per cent of its crude oil – the raw material for making fuels like petrol and diesel – and about half of its requirement for natural gas - the feedstock for generating electricity, producing fertiliser, fuel for household kitchens and CNG for automobiles – and cooking gas LPG."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-india-needs-indian-cibil-credit-score-framework-cibil-credit-bureau-rbi-data-sovereignty-financial-inclusion-thin-file-borrowers-2875815-2026-02-28",
      "headline": "India built UPI and Aadhaar, is it time for an Aatmanirbhar credit score too?A three-digit number may look small on paper. But for millions of Indians, it quietly decides how far they can go. India built digital infrastructure for identity (AADHAAR) and payment (UPI). The next question is whether credit deserves the same clarity and control."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/warner-brothers-signs-110-billion-deal-with-paramount-its-executive-discloses-in-townhall-2875705-2026-02-28",
      "headline": "Warner Bros Discovery signs $110 billion deal with Paramount SkydanceWarner Bros Discovery agreed to a $110 billion acquisition by Paramount Skydance after Netflix declined to match the offer, creating a media powerhouse set to reshape Hollywood and streaming competition. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-fds-to-mutual-funds-how-indians-are-changing-their-investment-behaviour-zerodha-nithin-kamath-2875570-2026-02-27",
      "headline": "From FDs to mutual funds: How Indians are changing their investment behaviourFor years, FDs and real estate were the first choice for Indian savers seeking safety and certainty. Now, mutual funds are steadily gaining popularity, especially among first-time investors looking for higher returns. Is this the beginning of a long-term shift in how Indians invest?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/indias-q3-gdp-growth-comes-in-at-78-after-base-year-revision-2875439-2026-02-27",
      "headline": "India's Q3 GDP grows 7.8% as government rolls out new base year seriesThe Ministry of Statistics and Programme Implementation introduced a new series of GDP estimates with 2022-23 as the base year, replacing the earlier 2011-12 base."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-down-961-points-nifty-below-25200-maruti-hul-ril-auto-down-2875418-2026-02-27",
      "headline": "Sensex, Nifty fall over 1% as global worries mount; auto, financial shares tankThe S&P BSE Sensex tanked 961.42 points to close at 81,287.19, while the NSE Nifty50 lost 317.90 points to end at 25,178.65. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pakistan-wheat-crisis-usda-report-flour-shortage-afghanistan-conflict-2026-2875416-2026-02-27",
      "headline": "Pakistan to run short of flour? Wheat output likely to fall amid Afghanistan warAccording to a report by the United States Department of Agriculture (USDA), Pakistan's wheat production is expected to decline by 2 to 2.2 million tonnes compared to last year."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hussain-dalal-acting-writing-careers-bollywood-industry-biases-2876489-2026-03-02",
      "headline": "Actor Hussain Dalal opens up on acting, writing and insecurity Hussain Dalal openly discusses juggling his acting and writing careers amid industry scepticism. His experience working with Vishal Bhardwaj on O'Romeo marks a significant milestone in his dual career journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rashmika-mandanna-and-vijay-deverakonda-chemistry-is-unmissable-in-new-videos-from-puja-ceremony-2876496-2026-03-02",
      "headline": "Rashmika and Vijay's chemistry is unmissable in new videos from puja ceremony Rashmika Mandanna and Vijay Deverakonda participated in the Sathyanarayana puja at their new home in Thummanpet, Telangana. The couple got married on February 26 in Udaipur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/jab-khuli-kitaab-trailer-secret-puts-pankaj-kapur-dimple-kapadia-50-year-love-test-divorce-2876485-2026-03-02",
      "headline": "Jab Khuli Kitaab trailer: Pankaj Kapur, Dimple Kapadia and secret that tests love The trailer of Dimple Kapadia and Pankaj Kapur's upcoming film Jab Khuli Kitaab is out. The movie will premiere on Zee5 on March 6. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kartik-aaryan-kickboxing-coach-kabir-khan-tajamul-islam-kashmir-sports-drama-2876459-2026-03-02",
      "headline": "Sreeleela to star with Kartik Aaryan in Kabir Khan sports film? Here's all we know Kartik Aaryan is set to play a kickboxing coach in Kabir Khan's upcoming film inspired by Tajamul Islam. The film highlights resilience amid Kashmir's conflict and aims for a 2027 release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/akshay-kumar-wheel-of-fortune-says-he-set-trend-of-paid-live-shows-we-perform-should-be-paid-2876463-2026-03-02",
      "headline": "Akshay Kumar says he set trend of paid live shows: We perform, should be paid Actor Akshay Kumar said he was the first actor to charge for live shows. He also reflected on his TV journey from Khatron Ke Khiladi to Wheel of Fortune."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-shares-emotional-note-to-fans-on-his-home-jalsa-2876484-2026-03-02",
      "headline": "Blessings of millions: Amitabh Bachchan's emotional note to fans on his home Jalsa Amitabh Bachchan described his Mumbai home 'Jalsa' as a symbol of love, blessings and togetherness for over three decades. He also thanked fans for their weekly visits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tom-holland-and-zendaya-friends-to-lovers-slow-burn-romance-we-all-saw-coming-2876452-2026-03-02",
      "headline": "Tom Holland and Zendaya: The friends-to-lovers slow burn we all saw coming As wedding rumours swirl, revisit Tom Holland and Zendaya's journey from Spider-Man co-stars to one of Hollywood's most adored love stories.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salim-khans-hospitalisation-salman-shifts-galwan-shoot-to-mehboob-studio-2876454-2026-03-02",
      "headline": "Amid Salim Khan's hospitalisation, Salman shifts Galwan shoot to Mehboob Studio Amid his father's treatment and regular hospital visits, Salman Khan has shifted the shoot of his upcoming film, Battle of Galwan, from Film City to Mehboob Studio to stay close by. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/aspirants-returns-with-third-season-makers-share-poster-check-release-date-2876443-2026-03-02",
      "headline": "Aspirants returns with third season, makers share poster. Check release date The Hindi drama series Aspirants is set to return with its third season, as announced by the makers on Monday. The new season will star Naveen Kasturia, alongside Shivankit Singh Parihar, Abhilash Thapliyal and Sunny Hinduja among others."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/auditions-offend-them-casting-director-varsha-varadarajan-vijay-film-varisu-bad-girl-on-ego-access-awards-2876404-2026-03-02",
      "headline": "Auditions offend them: Casting director Varsha Varadarajan on ego, access, awards From Mumbai to the South, the casting conversation continues. In Part II of our ongoing series, casting director Varsha Varadarajan, known for Sardar, Bad Girl, Killer Soup, outlines the structural hurdles facing casting professionals in Tamil and Malayalam cinema, and why National Awards recognition could change the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kerala-police-book-malayalam-filmmaker-chidambaram-sexual-harassment-kochi-2876448-2026-03-02",
      "headline": "Manjummel Boys director Chidambaram accused of sexual assault Malayalam filmmaker Chidambaram, director of Manjummel Boys, has been booked for sexual harassment in Kochi after a female actor lodged a complaint. The case involves allegations stemming from a 2022 incident."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-sirish-nayanika-reddy-wedding-march-6-intimate-ceremony-2876427-2026-03-02",
      "headline": "Who is Nayanika Reddy? All about Allu Sirish's fiancee and their love story Allu Sirish and Nayanika Reddy are all set to get married on March 6. Ahead of their wedding, here's a look at Nayanika's profile, their love story and all the details we know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anubhav-sinha-says-he-was-enamoured-by-shah-rukh-khan-on-raone-i-believed-he-knows-best-2876410-2026-03-02",
      "headline": "Anubhav Sinha says he was enamoured by SRK on Ra.One: I believed he knows best Filmmaker Anubhav Sinha revealed that he placed complete faith in Shah Rukh Khan's understanding of audience preferences during the making of Ra One. However, he now views that period differently."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/archana-gautam-recalls-abuse-by-toxic-ex-boyfriend-kicked-me-mercilessly-2876413-2026-03-02",
      "headline": "Archana Gautam recalls abuse by toxic ex-boyfriend: Kicked me mercilessly Archana Gautam shared on The 50 that she faced physical abuse in a past relationship and struggled with her mental health because of it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/travel-disruptions-abu-dhabi-israel-us-iran-conflict-actor-esha-gupta-stranded-2876377-2026-03-02",
      "headline": "Actor Esha Gupta shares how UAE is helping stranded people amid Middle East conflict Actor Esha Gupta shared her experience of being unable to leave Abu Dhabi due to travel delays caused by the escalation of the Israel-US-Iran conflict. In a post on social media, she expressed her appreciation for local authorities and her wish to return to India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rashmika-mandanna-vijay-deverakonda-traditional-puja-thummanpet-telangana-2876403-2026-03-02",
      "headline": "Rashmika-Vijay Deverakonda attend Sathyanarayana Puja at his hometown. Watch Rashmika Mandanna and Vijay Deverakonda attended a grand Sathyanarayana puja at their new home in Thummanpet, Telangana. Villagers welcomed the newlyweds with music and dance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/renu-desai-warns-online-trolls-legal-action-personal-attacks-cyber-abuse-2876385-2026-03-02",
      "headline": "Actor Renu Desai warns trolls over abusive comments about past with Pawan Kalyan Actor Renu Desai has issued a legal warning to trolls targeting her personal life and using abusive language. She said that the online abuse has increased harassment since her divorce from Pawan Kalyan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jason-sanjay-unfollows-father-vijay-sangeetha-divorce-petition-infidelity-mental-cruelty-2876363-2026-03-02",
      "headline": "Did Vijay's son Jason Sanjay unfollow him on Instagram amid divorce case? It was rumoured that Jason Sanjay had unfollowed his father, Vijay, on Instagram. Last week, Sangeetha filed for divorce from Vijay, seeking the court's intervention to end 27 years of marriage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/zendaya-tom-holland-marriage-rumours-stylist-wedding-claim-2876357-2026-03-02",
      "headline": "Zendaya-Tom Holland secretly married? Stylist hints fans are late to wedding news Buzz around Zendaya and Tom Holland's wedding plans has picked up pace after celebrity stylist Law Roach dropped a tantalising hint during a recent red carpet interview."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/iran-envoy-claims-us-israel-strike-on-nuclear-facility-global-watchdog-says-have-no-indication-2876500-2026-03-02",
      "headline": "Iran envoy claims US-Israel strike on nuke facility, watchdog sees no indicationAfter Iran claimed that the United States and Israel attacked its nuclear facilities on Sunday, the head of the UN nuclear watchdog said there is no evidence that any nuclear sites were damaged in the reported strikes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-israel-attacks-iran-live-updates-middle-east-war-dubai-pakistan-tehran-khamenei-trump-gulf-2876296-2026-03-02",
      "headline": "Live: Israel warns Lebanon invasion, Hezbollah chief a targetUS-Israel's Iran Strikes Live Updates: The Middle East remained on the boil for a third day on Monday as Iran expanded its retaliation against the joint US-Israeli strikes that eliminated its Supreme Leader Ayatollah Ali Khamenei and wiped out several senior figures of the Iranian military and political circles.\r\n\r\nUS President Donald Trump has countered Tehran's warning of attacks on American and Israeli interests by saying that such a move would invite consequences of \"unprecedented\" levels. Meanwhile, Iran's military retaliated across the Middle East with hundreds of missile and drone attacks, with the US confirming the first three deaths of American service members killed in the wider campaign.\r\n\r\nDuring the day, Israel said it had launched another wave of strikes on Iran, while loud blasts were heard for a second day near Dubai and over Doha, after Iran launched retaliatory air attacks on the neighbouring Gulf states. Follow IndiaToday.in for live updates:"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-f-15-believe-shot-down-over-kuwait-video-shows-fighter-jet-crashing-confirmation-from-washington-awaited-2876393-2026-03-02",
      "headline": "Several US planes crashed, says Kuwait after video shows F-15 falling out of skyA US F-15 fighter jet crashed in Kuwait on Monday after reportedly being engaged by a Patriot air defence system, with debris falling inside the Mina Al Ahmadi refinery and injuring two workers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-us-israel-war-save-us-modi-ji-appeal-indians-stranded-in-middle-east-mea-issues-helpline-number-gulf-work-2876456-2026-03-02",
      "headline": "Came in search of work, searching for bunkers: Indians in Gulf plead for helpThe Middle East has turned into a war zone with Iran shooting missiles and drones after the US-Israeli strikes. Thousands of Indians, including workers, students and tourists, are stranded due to airspace closures. Amid calls for help from Indians, the MEA has issued helpline numbers and is monitoring the situation closely."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/how-israel-turned-irans-most-popular-prayer-app-into-a-weapon-of-psychological-war-2876499-2026-03-02",
      "headline": "How Israel turned Iran's most popular prayer app into a weapon of psychological warOn Saturday morning, following the coordinated Israel-US strike, millions of Iranians looked at their phones where they received a message, \"Help has arrived,\" on the Bade Saba app - something that had been used so far as a platform to receive prayer updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/apple-launch-tim-cook-teases-big-week-ahead-5-highly-anticipated-announcements-2876455-2026-03-02",
      "headline": "Apple launch: Tim Cook teases 'big week' ahead, 5 highly-anticipated announcementsApple is set for a busy week. According to reports, the Cupertino giant is expected to launch a bunch of new products ahead of its special experience event on March 4. From a new affordable MacBook to the iPhone 17e, here is what you can expect."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-attack-donald-trump-supreme-leader-ayatollah-khamenei-before-assassination-attempts-2024-2876494-2026-03-02",
      "headline": "I got him before he got me: Trump on Khamenei's killing in US-Israel strikesUS President Donald Trump said he \"got\" Iran's Supreme Leader Ayatollah Ali Khamenei before an alleged Iranian assassination plot against him could succeed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-israel-vs-iran-president-donald-trump-military-action-legal-us-congress-us-constitution-american-law-2876428-2026-03-02",
      "headline": "Scores killed, Middle East burning, but Trump isn't calling it a war. Here's whyHundreds have been killed, and several countries are facing attacks since US President Donald Trump declared the start of major combat operations against Iran on Saturday. Why is Trump not calling it a war? And more importantly, is Trump's military action illegal as per American laws?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rashmika-mandanna-and-vijay-deverakonda-chemistry-is-unmissable-in-new-videos-from-puja-ceremony-2876496-2026-03-02",
      "headline": "Rashmika and Vijay's chemistry is unmissable in new videos from puja ceremonyRashmika Mandanna and Vijay Deverakonda participated in the Sathyanarayana puja at their new home in Thummanpet, Telangana. The couple got married on February 26 in Udaipur."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/taliban-attacks-paks-nur-khan-base-in-latest-escalation-of-cross-border-conflict-2876368-2026-03-02",
      "headline": "Pak's Nur Khan base, under repair after Op Sindoor, struck by TalibanTaliban forces reportedly launched armed drone strikes targeting Pakistan's Command and Control Centre at Nur Khan Air Base in Rawalpindi. Taliban forces carried out drone strikes on 12th division headquarters in Quetta, and other Pakistani military locations in Khyber Pakhtunkhwa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-crash-wipes-out-more-than-rs-9-lakh-crore-of-investor-wealth-2876476-2026-03-02",
      "headline": "Rs 9 lakh crore gone as brutal Dalal Street crash rattles investorsThe sell-off on Dalal Street has erased over Rs 9 lakh crore in investor wealth, dragging BSE's total market capitalisation down from nearly Rs 463 lakh crore to around Rs 454 lakh crore during intraday trade."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/iran-attack-us-irael-war-aramco-ras-tanura-refinery-shutdown-drone-strike-gulf-tensions-2876477-2026-03-02",
      "headline": "Saudi Aramco shuts key oil refinery after drone attack amid US-Iran escalationAramco has shut its Ras Tanura refinery following a drone strike amid escalating Gulf tensions, a disruption that could affect global oil markets and regional stability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/why-is-it-called-the-middle-east-colonial-origin-meaning-and-history-explained-2876422-2026-03-02",
      "headline": "Why is it called the Middle East? Middle of what, and East of where?The phrase 'Middle East' sounds neutral, but it was born from the British empire. Coined by Western strategists looking out from London, it placed Europe at the centre of the world and labelled everything else by distance. Here's how the term began, and why it remains debated today."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/situation-in-west-asia-deeply-worrying-india-backs-dialogue-and-diplomacy-pm-modi-2876460-2026-03-02",
      "headline": "Situation in West Asia deeply worrying, India backs dialogue and diplomacy: PM ModiThe Indian Prime Minister Narendra Modi reiterated that India supports the resolution of all disputes through dialogue and diplomacy. Modi also said India will continue working closely with all countries to ensure the safety and security of Indian citizens living in the region."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-india-vs-west-indies-sanju-samson-special-eden-gardens-legend-2876382-2026-03-02",
      "headline": "The batter who came in from the cold: Sanju Samson's night, Eden Gardens' legendT20 World Cup, India vs West Indies: Sanju Samson had long been the backup, the nearly man—the gifted cricketer forever waiting for his turn. On Sunday night at Eden Gardens, Samson made sure no one would ever doubt him again."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rashmika-mandanna-vijay-deverakonda-join-allu-family-for-allu-sirish-pelli-koduku-ceremony-2876252-2026-03-01",
      "headline": "Rashmika-Vijay join Allu family for Sirish's Pelli Koduku ceremony. See picsAllu Sirish's pre-wedding celebrations drew major film industry personalities, with special attention on the presence of Vijay Deverakonda and Rashmika Mandanna. Sirish is set to marry fiancee Nayanika Reddy on March 6. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/mercedes-benz-v-class-launched-in-india-at-rs-140-crore-2876464-2026-03-02",
      "headline": "Mercedes-Benz V-Class returns to India at Rs 1.40 croreMercedes-Benz has relaunched the V-Class in India at Rs 1.40 crore, bringing back its flagship luxury MPV with refreshed styling, added features, petrol and diesel options, and local assembly in Pune."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/german-womans-survival-kit-for-bengaluru-traffic-goes-viral-2876437-2026-03-02",
      "headline": "German woman's 'survival kit' for Bengaluru traffic goes viralA German woman's video on Bengaluru's traffic has prompted people to their strategies and humour for coping with daily congestion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/the-making-jammu-kashmir-ranji-trophy-historic-title-special-2876335-2026-03-02",
      "headline": "Not built in a day: The making of Jammu & Kashmir's Ranji Trophy triumphFor decades, Jammu & Kashmir flirted with promise without sustaining it. Their maiden Ranji Trophy title was no miracle, but the product of structural reform, cultural reset, and relentless discipline. It is proof that ambition, when engineered properly, can finally endure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/pakistans-polycrisis-and-its-1979-roots-2876353-2026-03-02",
      "headline": "Pakistan's polycrisis and its 1979 rootsThree tectonic events in Saudi Arabia, Iran, and Afghanistan reshaped the Pakistan of today. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/china-moon-landing-2030-nasa-artemis-2028-lunar-race-space-news-2876469-2026-03-02",
      "headline": "Will China win the Moon race against US as Nasa revamps Artemis?China is accelerating its 2030 crewed Moon mission while Nasa recalibrates its Artemis programme for a 2028 lunar landing. Discover who is leading the high-stakes race to the lunar South Pole.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/uae-gulf-nations-and-middle-east-differences-and-geography-explained-2876143-2026-03-01",
      "headline": "Is UAE a country? Who are the Gulf nations? Middle East geography explainedAmid rising tensions involving Iran, Israel and the United States, many readers are confused about basic Middle East geography. Is the UAE a single country or a collection of states? Which nations are referred to as \"Gulf states\"? This explainer clearly breaks down the UAE's structure, the GCC members, and where Iran and Israel fit geographically."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/dharavi-redevelopment-project-adani-dharavikars-charge-rs-15000-for-gareebi-darshan-shanty-slum-tourism-2876110-2026-03-02",
      "headline": "How the richest pay Rs 15,000 for gareebi darshan in DharaviIn Mumbai's Dharavi, poverty is being curated, priced and sold to dollar-rich visitors. Slum tourism has been around in India for decades, but there is a thin line between giving context, and commodification. Both rich Mumbaikars and poor Dharavi residents are making money, charging Rs 15,000 per foreign tourist for gareebi darshan."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-crash-sensex-nifty-investors-panic-middle-east-us-iran-2876445-2026-03-02",
      "headline": "Sensex nosedives 1,500 points today: Should investors be worried?Markets are sliding under Middle East tensions, surging crude, US–Iran hostilities and fears of trade blockages. Fundamentals look steady for now, but if the conflict deepens, is this only the first shock?"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-sanju-samson-rohit-sharma-india-vs-west-indies-2876493-2026-03-02",
      "headline": "You will get your chance: Rohit's message to Samson before T20 WC goes viral T20 World Cup: Rohit Sharma's message to Sanju Samson ahead of the T20 World Cup 2026 goes viral after the wicketkeeper helped India defeat West Indies in Kolkata. Samson's knock helped India reach the semi-final of the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/all-england-open-pv-sindhu-dubai-stranded-lakshya-sen-2876490-2026-03-02",
      "headline": "Stranded in Dubai, Sindhu set to miss All England. Lakshya to lead India's campaign Two-time Olympic medallist PV Sindhu is unlikely to participate in the prestigious All England Open Super 1000 tournament, which begins on Tuesday. The Indian shuttler has been stranded at Dubai airport amid escalating conflict in the Middle East following US-Israel strikes on Iran."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/gukesh-loses-to-abdusattorov-prague-chess-festival-time-trouble-2876491-2026-03-02",
      "headline": "Prague Chess: D Gukesh implodes, loses to Abdusattorov to remain winless Gukesh's nightmare in Prague continued as time trouble cost him a winning position against Abdusattorov. The World Champion blundered twice in the endgame to suffer his fifth straight setback."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/red-bull-rb8-f1-car-moto-jam-india-2026-greater-noida-sebastian-vettel-arvid-lindblad-2876447-2026-03-02",
      "headline": "The smell of burnt rubber, the deafening roar: Watching an F1 car live hits different You can follow F1 for years. But nothing prepares you for the moment an F1 car fires up metres away, and the sound sends shivers down your spine."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/finalissima-spain-argentina-postponed-middle-east-security-qatar-tournament-suspension-2876411-2026-03-02",
      "headline": "Spain vs Argentina Finalissima in Qatar at risk after US, Israel attacks on Iran Escalating tensions in the Middle East have cast uncertainty over the highly anticipated Finalissima between Spain and Argentina, originally set for March 27 in Doha. The Qatar Football Association's suspension of all tournaments, along with delays to other regional matches, has led organisers to reconsider the feasibility of hosting the event amid recent air strikes from US and Israel on Iran. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-tour-india-2026-test-odi-series-bcci-schedule-2876409-2026-03-02",
      "headline": "India to host Afghanistan for one Test and a three-match ODI series in June 2026 The Board of Control for Cricket in India (BCCI) on Monday confirmed that Afghanistan are set to visit India in June 2026 to play a standalone Test and a three-match One-Day International (ODI) series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-97-equals-virat-kohli-mcg-82-t20-world-cup-ind-vs-wi-2876400-2026-03-02",
      "headline": "Sanju Samson's Kolkata blitz on par with Kohli's MCG knock vs PAK: Srikkanth T20 World Cup: Kris Srikkanth has claimed that Sanju Samson's innings in Kolkata is on par with the knock played by Virat Kohli at the MCG in the T20 World Cup 2022 against Pakistan. Samson's 97 helped India reach the semi-finals of the T20 World Cup 2026. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-india-vs-west-indies-sanju-samson-handles-tough-phases-2876397-2026-03-02",
      "headline": "Switched off phone, stayed away from social media: Sanju on handling tough phases India opener Sanju Samson switched off his phone and stayed away from social media to safeguard his self-belief during a lean patch, a phase that ended with a match-winning knock in the do-or-die T20 World Cup clash against the West Indies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-india-vs-west-indies-sanju-samson-special-eden-gardens-legend-2876382-2026-03-02",
      "headline": "The batter who came in from the cold: Sanju Samson's night, Eden Gardens' legend T20 World Cup, India vs West Indies: Sanju Samson had long been the backup, the nearly man—the gifted cricketer forever waiting for his turn. On Sunday night at Eden Gardens, Samson made sure no one would ever doubt him again."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-bows-sanji-samson-t20-world-cup-2026-ind-vs-wi-2876373-2026-03-02",
      "headline": "Rulayega kya pagle? Sanju Samson's hilarious reaction to Surya's praises: Video T20 World Cup: Suryakumar Yadav's praises were so high for Sanju Samson that the Indian wicketkeeper had to step in and ask the Indian captain not to make him cry in hilarious fashion. Samson's sensational knock helped India make it to the semi-final of the T20 World Cup. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/the-making-jammu-kashmir-ranji-trophy-historic-title-special-2876335-2026-03-02",
      "headline": "Not built in a day: The making of Jammu & Kashmir's Ranji Trophy triumph For decades, Jammu & Kashmir flirted with promise without sustaining it. Their maiden Ranji Trophy title was no miracle, but the product of structural reform, cultural reset, and relentless discipline. It is proof that ambition, when engineered properly, can finally endure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/daniil-medvedev-stranded-dubai-uae-airspace-closure-middle-east-tensions-2876365-2026-03-02",
      "headline": "Daniil Medvedev stranded in Dubai with his family due to Middle East conflictFormer world No. 1 Daniil Medvedev, along with his family and team, was stranded in Dubai on Sunday, a day after winning the Dubai Duty Free Tennis Championships for his 23rd career ATP title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-india-vs-west-indies-abhishek-sharma-poor-form-anil-kumble-2876354-2026-03-02",
      "headline": "Abhishek Sharma's lack of form: His head is muddled, says Anil KumbleT20 World Cup: Anil Kumble feels that Abhishek Sharma's lack of form in the T20 World Cup 2026 is down to a mental issue after the Indian opener failed in the must-win clash against the West Indies. Abhishek was dismissed for 10 off 11 balls in Kolkata. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-ind-vs-wi-sunil-gavaskar-ravi-shastri-slam-laser-show-kolkata-2876356-2026-03-02",
      "headline": "T20 World Cup: Sunil Gavaskar, Ravi Shastri slam mid-match laser show in KolkataT20 World Cup, IND vs WI: Former India cricketers Sunil Gavaskar and Ravi Shastri condemned the laser show held during India's innings at Eden Gardens in Kolkata on Sunday night."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-mohammad-amir-fresh-debate-india-not-playing-good-cricket-samson-2876352-2026-03-02",
      "headline": "Samson played best knock of his life but India not playing good cricket: AmirICC T20 World Cup: After India proved Mohammad Amir wrong by storming into the semi-finals, the former Pakistan pacer has reignited debate, conceding that Sanju Samson produced the knock of his life, while insisting that India, as a unit, are still not playing good cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-india-vs-west-indies-sanju-samson-kolkata-2876334-2026-03-02",
      "headline": "At Eden Gardens, Sanju Samson showed the only race worth running is your ownT20 World Cup: He was overlooked, benched, and made to wait. But Sanju Samson never stopped believing. At Eden Gardens, he finally got to show the world exactly what that belief was worth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-india-vs-west-indies-sanju-samson-suryakumar-yadav-bows-down-2876325-2026-03-02",
      "headline": "Surya bows down to Samson after Kolkata blitz: Good things happen to good peopleT20 World Cup: India captain Suryakumar Yadav took off his cap and bowed down for his match-winner, Sanju Samson, after the wicketkeeper guided the hosts home in their must-win clash against West Indies in Kolkata. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shai-hope-snaps-back-at-reporter-takes-blame-for-west-indies-loss-vs-india-2876297-2026-03-02",
      "headline": "Shai Hope snaps back at reporter, takes blame for West Indies' loss against IndiaWest Indies captain Shai Hope snapped back at a reporter and accepted blame for his team's loss against India in the ICC T20 World Cup 2026 Super 8 fixture in Kolkata. India's five-wicket win helped them secure a semi-final berth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-wi-t20-world-cup-gautam-gambhir-press-sanju-samson-97-kolkata-2876298-2026-03-02",
      "headline": "Worth the wait: Gambhir's mic and Samson's bat do the talking in KolkataIND vs WI, T20 World Cup: At Eden Gardens, Sanju Samson finally silenced the what ifs with a 97-run masterpiece. But in the press box, Gautam Gambhir was just getting started, dismantling data, defying tropes, and settling a few 2011-sized scores."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-united-vs-crystal-palace-table-top-3-2876301-2026-03-02",
      "headline": "Manchester United in top three after come-from-behind win over Crystal PalacePremier League: Manchester United came back from behind to beat Crystal Palace 2-1 at home on Sunday. Under their interim boss Michael Carrick, United are unbeaten in seven and back in the top three for the first time since May 2023."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/t20-world-cup-ind-vs-wi-shai-hope-full-post-match-press-conference-2876300-2026-03-02",
      "headline": "We all can go home with our heads held high: Shai HopeT20 World Cup, IND vs WI: West Indies captain Shai Hope reflected on his team's campaign after their exit in the Super 8 stages following a five-wicket defeat to India at Eden Gardens in Kolkata."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-west-indies-t20-world-cup-gautam-gambhir-sanju-samson-2876293-2026-03-02",
      "headline": "Sanju Samson is world-class, always knew he would deliver: Gautam GambhirT20 World Cup 2026: Speaking to the press after India's Super 8 win over West Indies in Kolkata, head coach Gautam Gambhir heaped praise on Sanju Samson's unbeaten 97. He also outlined India's plans for Jasprit Bumrah and reiterated his belief in instinct over data and numbers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-on-virat-kohli-rohit-sharma-after-emotional97-vs-west-indies-t20-world-cup-2026-2876291-2026-03-02",
      "headline": "With lessons from Rohit and Virat, Sanju Samson emerges India's hero in KolkataSanju Samson led India to a record-breaking T20 World Cup chase against the West Indies. He scored an unbeaten 97* (50) with the help of 12 fours and four sixes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-shashi-tharoor-india-t20-world-cup-semifinals-chase-eden-gardens-2876292-2026-03-02",
      "headline": "Shashi Tharoor thrilled for Sanju Samson: Thiruvananthapuram's son, pride of IndiaT20 World Cup, IND vs WI: Shashi Tharoor heaped praise on Sanju Samson after the Indian batter scored an unbeaten 97 and powered India into the semis with a five-wicket win over the West Indies on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-t20-world-cup-2026-mohammad-amir-trolled-semifinal-spot-west-indies-2876273-2026-03-01",
      "headline": "Take that: Mohammad Amir severely trolled after India storm into T20 World Cup semisT20 World Cup, IND vs WI: Ex-Pakistan pacer Mohammad Amir was trolled after India secured their berth in the semifinals with a five-wicket win over the West Indies on Sunday, March 1 at the iconic Eden Gardens in Kolkata."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-t20-world-cup-super-8-sanju-samson-semifinal-chase-kolkata-2876270-2026-03-01",
      "headline": "IND vs WI: Sanju Samson's Virat Kohli-esque special powers India into semifinalIND vs WI, T20 World Cup Super 8: Sanju Samson produced a masterclass in chasing under pressure on Sunday, crafting an unbeaten 97 to lead India past West Indies' daunting 195 at Eden Gardens. India will take on England in the semifinals on Thursday in Mumbai."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhishek-sharma-struggles-india-super-8-t20-world-cup-west-indies-eden-gardens-2876258-2026-03-01",
      "headline": "Drop catches, out cheaply: Abhishek Sharma endures horror night at Eden GardensT20 World Cup, IND vs WI: Abhishek Sharma had a night to forget at the Eden Gardens in Kolkata after he dropped two catches and scored only 10 runs off 12 balls against West Indies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-ind-vs-wi-suryakumar-yadav-flying-catch-jasprit-bumra-2876251-2026-03-01",
      "headline": "Suryakumar Yadav turns Superman, takes flying catch to dismiss Roston ChaseIndia captain Suryakumar Yadav took a spectacular diving catch to dismiss Roston Chase during the Super 8 fixture of T20 World Cup 2026 against West Indies at Eden Gardens in Kolkata. Jasprit Bumrah claimed two key wickets in the 12th over to bring India back into the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-ipl-2026-training-chennai-super-kings-csk-nets-session-2876248-2026-03-01",
      "headline": "MS Dhoni turns up the heat in first training session in Chennai before IPL 2026: VideoIPL 2026: MS Dhoni trained with full intensity at Chennai Super Kings' high-performance centre, ramping up preparations for another season of the tournament. On Saturday, the 44-year-old Dhoni reached Chennai and was greeted with loud cheers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-unbeaten-t20-world-cup-zimbabwe-semifinal-clash-sikandar-raza-2876235-2026-03-01",
      "headline": "Sikandar Raza heroics in vain as rampaging South Africa storm into semis unbeatenT20 World Cup, SA vs ZIM: South Africa beat Zimbabwe by five wickets in New Delhi to continue their unbeaten run in the tournament. Sikandar Raza put in an incredible all-round showing, but it wasn't enough for Zimbabwe to win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-thrashes-india-hobart-womens-odi-series-sweep-alyssa-healy-century-2876212-2026-03-01",
      "headline": "Alyssa Healy's farewell spectacle hands India crushing 0-3 whitewash in ODI seriesAustralia completed a dominant 3-0 sweep over India in the Women's ODI series at Hobart. Alyssa Healy's spectacular century marked her ODI farewell, while India struggled against the relentless Australian attack."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}