{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mahindra-pidilite-dr-reddy-deny-conflict-interest-claims-involving-sebi-chairperson-madhavi-buch-husband-dhaval-buch-2597403-2024-09-10",
      "headline": "Mahindra, Pidilite, Dr Reddy's refute conflict allegations involving Dhaval BuchMahindra & Mahindra, Dr. Reddy's Laboratories, and Pidilite Industries have refuted Congress's allegations of conflict of interest involving SEBI Chairperson Madhabi Puri Buch's husband. The companies clarified their engagements with Dhaval Buch were based on his expertise and predate her SEBI tenure.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-toll-rules-pay-only-for-distance-covered-no-charges-for-first-20-km-gnss-2597322-2024-09-10",
      "headline": "New toll rules: Pay only for distance covered, no charges for first 20 kmThe new toll rules are part of the revised National Highways Fee Rules, 2024, which now focus on a pay-as-you-go system based on the distance you travel beyond the initial 20 km."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-ipo-day-2-latest-subscription-booked-8x-expected-listing-gains-2597288-2024-09-10",
      "headline": "Bajaj Housing Finance IPO booked 8x on Day 2. Check expected listing gainsBajaj Housing Finance is offering its shares in the price range of Rs 66-70 each. Investors can apply for a minimum of 214 shares and in multiples thereafter. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mutual-fund-assets-hit-record-rs-66-lakh-crore-in-august-amfi-data-sip-2597259-2024-09-10",
      "headline": "Mutual fund assets hit record Rs 66 lakh crore in AugustData from the Association for Mutual Funds in India (AMFI) shows that inflows into equity mutual funds rose by 3% in August, reaching Rs 38,239 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/noida-property-prices-all-time-high-circle-rate-hike-proposal-homebuyers-plight-2597254-2024-09-10",
      "headline": "Noida's housing dream fades as proposed rate hike pushes homes out of reachNoida's once-affordable housing dream is slipping away as soaring property prices and a proposed circle rate hike threaten to push homeownership further out of reach for the urban middle class."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-end-higher-driven-by-rally-in-it-pharma-stocks-2597181-2024-09-10",
      "headline": "Sensex, Nifty end higher driven by rally in IT and pharma stocks The S&P BSE Sensex added 361.75 points to end at 81,921.29, while the NSE Nifty50 gained 104.70 points to close at 25,041.10."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-election-trump-kamala-harris-risk-looms-over-wall-street-but-there-are-bigger-threats-federal-reserve-rate-2597159-2024-09-10",
      "headline": "US election risk looms over Wall Street, but there are bigger threatsRight now, Wall Street is facing some uncertain moments as investors keep a close eye on the US stock rally, with the presidential election and other big economic factors coming into play."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/mahindra-group-denies-conflict-of-interest-allegations-regarding-payments-to-dhaval-buch-2597155-2024-09-10",
      "headline": "Mahindra Group rejects conflict of interest claims over payments to Dhaval BuchIn a stock exchange filing, the Mahindra Group has clarified that Dhaval Buch was hired for his supply chain expertise, unrelated to the Sebi approvals cited by the Congress party. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/swiggy-ipo-plans-to-raise-rs-5000-crore-through-fresh-issue-2597106-2024-09-10",
      "headline": "Swiggy plans to raise Rs 5,000 crore in upcoming IPO through fresh issueThe Bengaluru-based firm had earlier planned to raise Rs 3,750 crore through fresh issue, along with an additional Rs 6,664 crore offer for sale."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-ipo-subscription-4x-expected-listing-gain-gmp-close-to-100-percent-2597080-2024-09-10",
      "headline": "Bajaj Housing Finance IPO subscribed over 4x, GMP nears 100%Bajaj Housing Finance has demonstrated impressive growth, with a compound annual growth rate (CAGR) of 30.9% in AUM from Fiscal 2022 to 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jupiter-wagons-stock-price-down-correction-good-buying-opportunity-2597061-2024-09-10",
      "headline": "Jupiter Wagons stock down 12% in a month. Is it a buying opportunity?On Tuesday, the stock extended its losses, dropping to a day's low of Rs 490. At 1:22 pm, shares of Jupiter Wagons were trading 1.24% lower at Rs 502.45."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/p-n-gadgil-jewellers-ipo-opens-review-good-bad-subscribe-skip-expert-view-gmp-2597060-2024-09-10",
      "headline": "P N Gadgil Jewellers IPO opens: Should you subscribe or skip?P N Gadgil Jewellers IPO is a book-built issue which includes a fresh issue of 1.77 crore shares, amounting to Rs 850 crore, and an offer for sale of 52 lakh shares, totalling Rs 250 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-power-share-price-gains-today-solar-power-cell-production-explained-2597031-2024-09-10",
      "headline": "Explained: Why Tata Power shares soared over 5% today Tata Power shares jumped after the company's subsidiary, TP Solar, began commercial production of solar cells at its new plant in Tirunelveli, Tamil Nadu."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/suzlon-energy-share-price-up-5-percent-bull-run-key-triggers-analyst-view-2597004-2024-09-10",
      "headline": "Suzlon Energy shares up 5%. Will positive momentum continue? Suzlon Energy shares were up nearly 5% after the company announced a major 1.17 GW order win from NTPC Green Energy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gautam-adanis-usd-185-billion-airport-deal-in-kenya-nairobi-jomo-kenyatta-hits-legal-roadblock-2596992-2024-09-10",
      "headline": " Gautam Adani's $1.85 billion airport deal in Kenya hits legal roadblockThe deal faced opposition from various groups in Kenya, with a key legal challenge filed by the Kenya Human Rights Commission and the Law Society of Kenya"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-share-price-surges-stock-trend-expert-view-2596958-2024-09-10",
      "headline": "Explained: Why Paytm shares jumped 9% in early tradeIn the past week, Paytm's share price has risen by more than 13%, and in the last month, it has gone up by over 30%. Over the last three months, Paytm's stock has jumped by more than 74%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-india-join-hands-to-expand-semiconductor-industry-chips-act-itsi-all-you-need-to-know-2596941-2024-09-10",
      "headline": "US, India join hands to expand semiconductor industry. All you need to know The US Department of State will collaborate with the India Semiconductor Mission, under India's Ministry of Electronics and IT, to explore ways to grow and diversify the semiconductor ecosystem."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musk-worlds-first-trillionaire-gautam-adani-second-in-line-dubai-based-informa-connect-academy-2596928-2024-09-10",
      "headline": "Elon Musk set to be world's 1st trillionaire, second could be an IndianTesla CEO Elon Musk is set to become the world's first trillionaire, with an Indian business tycoon close behind."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-sensex-nifty-open-marginally-higher-on-positive-global-cues-paytm-up-9-percent-2596922-2024-09-10",
      "headline": "Sensex, Nifty open marginally higher on positive global cues; Paytm up 9%The S&P BSE Sensex was down 47.27 points to 81,512.27, while the NSE Nifty50 shed 18.70 points to 24,917.70. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/wazirx-security-partner-liminal-company-cyberattack-security-breach-audit-findings-2596809-2024-09-09",
      "headline": "Crypto firm WazirX's security partner says no evidence of cyberattack on its systemThe cyberattack on crypto exchange WazirX in July, that led to a loss of about Rs 2,000 crore in digital assets, had originated from their end, according to its security partner and digital asset custody company, Liminal Custody."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/donald-trump-kamala-harris-debate-us-president-elections-democrats-republicans-2597485-2024-09-11",
      "headline": "Donald Trump, Kamala Harris spar over politics, personality in high-stakes debate Live Updates In their closing statement, Kamala Harris said she was focused on the future as Donald Trump countered her by saying if she had plans, she should have accomplished them as vice-president."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/kamala-harris-donald-trump-us-presidential-debate-abortion-rights-2597563-2024-09-11",
      "headline": "On abortions, Donald Trump flip-flops, advantage Kamala HarrisKamala Harris, the Democratic presidential nominee, said Donald Trump's policies on abortion had no exception for rape or incest, which she called 'immoral'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/us-presidential-debate-kamala-harris-donald-trump-israel-2597575-2024-09-11",
      "headline": "Trump says Kamala Harris hates Israel, she hits back with 'likes dictators' jabDonald Trump also warned that Israel would cease to exist as a nation if his Democratic rival Kamala Harris won the US presidential election this year, adding that she hates the Jewish state."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-in-us-bharat-jodo-nyay-yatra-congress-bjp-democracy-2597510-2024-09-11",
      "headline": "Forced to take out Yatra due to non-functioning democracy: Rahul Gandhi in USThe Leader of the Opposition in the Lok Sabha, in his remarks, suggested that the Yatra was a response to what he perceived as the non-functioning of democratic processes in the country. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/taylor-swift-kamala-harris-voting-for-instagram-endorsement-us-presidential-debate-warrior-champion-2597579-2024-09-11",
      "headline": "'Childless Cat Lady' Taylor Swift endorses Kamala Harris. No JD Vance was hurtPop star Taylor Swift said she will be voting for Kamala Harris in the US presidential election in November, while also criticising Donald Trump's false claims of her support for the Republican candidate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/can-post-partum-hair-loss-push-you-into-depression-2597120-2024-09-11",
      "headline": "Can post-partum hair loss push you into depression?Post-partum hair loss can intensify the physical and emotional roller coaster that new moms experience, potentially leading to mental health challenges like anxiety and depression."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/kamala-harris-confident-body-language-handshake-donald-trump-presidential-debate-2597583-2024-09-11",
      "headline": "Kamala Harris confident, unscathed; Trump fails to deliver a knockoutAn aggressive Kamala Harris managed to get under her rival Donald Trump's skin, hammering him over his criminal convictions, his views on abortion rights and the size of his rallies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/border-security-personnel-injured-after-pakistani-troops-violate-ceasefire-along-loc-jammu-2597577-2024-09-11",
      "headline": "BSF soldier injured after Pak violates ceasefire near LoC in Jammu: ReportThe Indian troops retaliated to the unprovoked firing from the other side of the LoC and gave a befitting reply to the Pakistani aggression."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kareena-kapoor-doesnt-feel-botox-husband-saif-ali-khan-finds-me-sexy-taimur-the-buckingham-murders-2597580-2024-09-11",
      "headline": "Kareena Kapoor doesn't feel the need for Botox: My husband finds me sexyActor Kareena Kapoor, in an interview, spoke about ageism and how she never felt the urge to get Botox done. The actor discussed that she is against altering her appearance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/elon-musk-responds-taylor-swift-twitter-childless-cat-lady-endorses-kamala-harris-donald-trump-us-presidential-debate-2597620-2024-09-11",
      "headline": "I'll give you a child: Elon Musk to Taylor Swift after endorsing Kamala HarrisElon Musk's remark came shortly after popstar Taylor Swift said she would be voting for Kamala Harris in the US presidential election in November following the latter's debate with Donald Trump."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/omar-abdullah-exclusive-jammu-and-kashmir-election-full-statehood-restoration-supreme-court-2597499-2024-09-11",
      "headline": "Will knock Supreme Court's door if J&K's statehood not restored: Omar AbdullahSpeaking exclusively to India Today TV, National Conference Omar Abdullah said while restoring Article 370 may be a longer struggle, the demand for statehood can be served through a resolution by the Jammu and Kashmir Assembly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maharashtra-assembly-polls-mahayuti-alliance-rift-eknath-shinde-ajit-pawar-maha-vikas-aghadi-2597408-2024-09-10",
      "headline": "Will Mahayuti partners get equal seats? What Eknath Shinde saidMaharashtra Chief Minister Eknath Shinde has dismissed rumours of discord within the Mahayuti alliance, asserting that all partners will receive equal importance in the upcoming Assembly polls."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/kamala-harris-facial-expressions-donald-trump-memes-us-presidental-debate-2597618-2024-09-11",
      "headline": "Kamala Harris's expressions to Donald Trump's statements inspire hilarious memes#Debate2024 is one of the top trends on X as Kamala Harris and Donald Trump debated on subjects including abortion rights, the economy, immigration and border issues as well as the Israel-Gaza war."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/donald-trump-on-us-capitol-riot-had-nothing-to-do-with-it-only-made-a-speech-2597567-2024-09-11",
      "headline": "Trump on US Capitol riot: Had nothing to do with it, only made a speechThe January 6, 2021 insurrection was carried out by a mob of Donald Trump supporters in a bid to prevent a joint session of Congress counting the Electoral College votes to formalise the victory of then President-elect Joe Biden."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tejashwi-yadav-nitish-kumar-bihar-alliance-assembly-elections-rjd-jdu-2597315-2024-09-10",
      "headline": "Nitish Kumar came with folded hands, won't make mistake again: Tejashwi YadavTejashwi Yadav took aim at Nitish Kumar, claiming that his political relevance is over and vowing not to support him again as Bihar gears up for the 2025 Assembly polls."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-presidential-debate-2024-live-updates-donald-trump-vs-kamala-harris-2597502-2024-09-11",
      "headline": "Kamala Harris's team claims victory, Trump says 'my best debate ever'Donald Trump vs Kamala Harris Debate Live Updates: Democratic US Presidential candidate Kamala Harris and her Republican rival candidate Donald Trump concluded their first presidential debate, which was focused on the economy, immigration, foreign policy, healthcare and more. The debate was held at the National Constitution Centre in Philadelphia, Pennsylvania, and was hosted on ABC News. India Today is the first and only Indian news channel reporting live from the US Presidential Debate. Stay tuned for live updates from the debate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rana-daggubati-touches-shah-rukh-khan-feet-karan-johar-iifa-2024-event-2597571-2024-09-11",
      "headline": "Rana Daggubati touches SRK's feet at IIFA 2024 event: We're fully South IndianRana Daggubati touched Shah Rukh Khan and Karan Johar's feet at the IIFA 2024 event, held on September 10 in Mumbai. SRK greeted Rana with a kiss and a warm hug."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/us-presidential-election-2024-debate-kamala-harris-donald-trump-2597558-2024-09-11",
      "headline": "Trump has no plan for you, says Kamala Harris, he says she copied Biden'sKamala Harris also accused Donald Trump of leaving the US with \"the worst unemployment since the Great Depression, the worst attack on our democracy since the Civil War and the worst public health epidemic in a century\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bengal-protesting-doctors-kolkata-rape-murder-rg-kar-hospital-mamata-banerjee-supreme-court-order-2597370-2024-09-10",
      "headline": "Bengal seeks talks with doctors after they defy court's return-to-work deadlineA delegation of 10 doctors was invited by the West Bengal government for a discussion amid the ongoing protests against the rape and murder of a trainee doctor at the RG Kar hospital in Kolkata."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/narayana-murthy-does-not-believe-in-coaching-classes-says-wrong-way-to-help-children-2597092-2024-09-10",
      "headline": "Narayana Murthy criticises coaching classes, says wrong way to help childrenInfosys co-founder NR Narayana Murthy has expressed his disapproval of coaching classes, stating that they are an inappropriate method for assisting children in passing examinations and that he does not support their use."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/kbc-16-contestant-quits-amitabh-bachchan-show-over-rs-25-lakh-history-question-2597595-2024-09-11",
      "headline": "KBC 16: Contestant quits Amitabh Bachchan's show over Rs 25 lakh history questionAmitabh Bachchan's Kaun Banega Crorepati had contestant Akshay Narang quit the show on a question worth Rs 25 lakh. Can you answer it?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/goat-box-office-day-6-vijay-film-eyes-vikram-jailer-records-targets-rs-350-crore-2597578-2024-09-11",
      "headline": "GOAT box office Day 6: Vijay's film eyes Vikram, Jailer recordsThalapathy Vijay and director Venkat Prabhu's GOAT aka The Greatest of All Time is marching towards Rs 350 crore worldwide. The film is chasing the records of Kamal Haasan's Vikram and Rajinikanth's Jailer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sushil-kumar-shinde-home-minister-jammu-kashmir-scared-visit-bjp-congress-2597261-2024-09-10",
      "headline": "BJP's Article 370 brag after ex-Home Minister says he was scared to visit KashmirFormer Union Home Minister Sushil Kumar Shinde said he used to be scared of venturing out in the Kashmir Valley during the UPA government. The BJP mocked the Congress, highlighting the changes Jammu and Kashmir has witnessed following the abrogation of Article 370."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/chris-gayle-first-t20i-hundred-t20-world-cup-2007-vs-south-africa-2597586-2024-09-11",
      "headline": "OTD 2007: Chris Gayle gets T20 World Cup off the mark with a breathtaking hundredOn September 11, 2007 West Indies batter Chris Gayle played a scintillating knock of117 (57) in the first match of maiden edition of the T20 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-new-hairstyle-at-iifa-2024-buzz-jawan-2-karan-johar-2597604-2024-09-11",
      "headline": "SRK's new hairstyle at IIFA 2024 event creates buzzShah Rukh Khan surprised fans after he debuted a new look at the International Indian Film Academy (IIFA) press conference in Mumbai on September 10. The actor is set to host the grand event with Karan Johar and Vicky Kaushal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/taylor-swift-kamala-harris-voting-for-instagram-endorsement-us-presidential-debate-warrior-champion-2597579-2024-09-11",
      "headline": "'Childless Cat Lady' Taylor Swift endorses Kamala Harris. No JD Vance was hurtPop star Taylor Swift said she will be voting for Kamala Harris in the US presidential election in November, while also criticising Donald Trump's false claims of her support for the Republican candidate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jayam-ravi-aarti-ravi-divorce-announcement-consent-blindsided-2597615-2024-09-11",
      "headline": "Jayam Ravi's wife Aarti: 'Divorce announcement was made without my consent'Jayam Ravi's estranged wife Aarti Ravi shared her first statement regarding the dissolution of their marriage. In the statement, she explained that she was blindsided by Ravi's announcement, which was made without her consent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/kbc-16-contestant-quits-amitabh-bachchan-show-over-rs-25-lakh-history-question-2597595-2024-09-11",
      "headline": "KBC 16: Contestant quits Amitabh Bachchan's show over Rs 25 lakh history questionAmitabh Bachchan's Kaun Banega Crorepati had contestant Akshay Narang quit the show on a question worth Rs 25 lakh. Can you answer it?"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afg-vs-nz-greater-noida-stadium-noida-weather-kane-williamson-hashmatullah-shahidi-tim-southee-2597611-2024-09-11",
      "headline": "AFG vs NZ: Persistent rain in Greater Noida washes out play on Day 3 of the TestThe Day 3 of the one-off Test between Afghanistan and New Zealand was once again abandoned due to incessant rain at the Greater Noida Sports Complex Ground."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/chris-gayle-first-t20i-hundred-t20-world-cup-2007-vs-south-africa-2597586-2024-09-11",
      "headline": "OTD 2007: Chris Gayle gets T20 World Cup off the mark with a breathtaking hundredOn September 11, 2007 West Indies batter Chris Gayle played a scintillating knock of117 (57) in the first match of maiden edition of the T20 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-ban-kl-rahul-form-safaraz-khan-bangladesh-tour-of-india-2597576-2024-09-11",
      "headline": "Time for Rahul to replay selectors as India's busy Test season beginsIndia vs Bangladesh: With India's Test season set to begin, KL Rahul's performance in the upcoming Bangladesh series will be crucial in solidifying his place in the squad, especially with a major tour of Australia looming on the horizon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/brendon-mccullum-hails-jos-buttler-as-englands-greatest-white-ball-player-2597572-2024-09-11",
      "headline": "Brendon McCullum hails Jos Buttler as England's 'greatest white-ball player'England's newly appointed white-ball head coach Brendon McCullum has hailed Jos Buttler as the greatest white ball player to play for England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-aus-t20i-series-philip-salt-mitchell-marsh-travis-head-jofra-archer-liam-livingstone-2597566-2024-09-11",
      "headline": "England vs Australia T20I series: H2H, all you need to knowEngland and Australia will renew their rivalry in T20Is as both teams will lock horns on September 11, Wednesday at The Rose Bowl in Southampton. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/nations-league-kevin-de-bruyne-slams-belgium-team-mates-after-loss-to-france-2597497-2024-09-10",
      "headline": "Kevin de Bruyne slams Belgium team-mates after loss to FranceBelgium captain Kevin De Bruyne slammed his teammates and questioned the manager's tactical decisions after his team's 2-0 loss to France in the Nations League."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-unsure-about-quinton-de-kocks-t20i-future-rob-walter-2597483-2024-09-10",
      "headline": "South Africa unsure about Quinton de Kock's T20I future: Rob WalterSouth Africa white-ball coach Rob Walter said they're unsure about Quinton de Kock's T20I future after he was omitted from the team for a second consecutive series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/neeraj-chopra-avinash-sable-to-compete-in-diamond-league-final-in-brussels-2597461-2024-09-10",
      "headline": "Neeraj Chopra, Avinash Sable to compete in Diamond League final in BrusselsAvinash Sable, the national record holder in the 3000m steeplechase, will compete in his first Diamond League Final in Brussels, joining star javelin thrower Neeraj Chopra in the season-ending event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-sri-lanka-third-test-ollie-pope-michael-vaughan-reaction-oval-2597462-2024-09-10",
      "headline": "England disrepected Test cricket during Oval loss to Sri Lanka: Michael VaughanMichael Vaughan slammed England and claimed that they disrespected Test cricket with their strategies in the Oval Test loss to Sri Lanka. England were slammed for being over-aggressive with their approach. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/litton-das-pakistan-series-india-test-challenge-sg-ball-2597455-2024-09-10",
      "headline": "Pakistan win is in the past: Litton wary of India's SG balls ahead of Test seriesIndia vs Bangladesh: Litton Das said their heroics against Pakistan are behind them and that they must now focus on the upcoming series against India. Bangladesh will travel to India on September 15 to play two Tests and three T20 Internationals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/video/glad-that-i-was-able-to-change-the-colour-of-the-medal-archer-harvinder-2597433-2024-09-10",
      "headline": "Glad that I was able to change the colour of the medal: Archer HarvinderArcher Harvinder Singh, who won gold in the Paris Paralympics said that he was glad to be able to change the colour of his medal. Harvinder had earlier won bronze in Tokyo Paralympics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-unsure-about-quinton-de-kocks-t20i-future-rob-walter-2597483-2024-09-10",
      "headline": "South Africa unsure about Quinton de Kock's T20I future: Rob WalterSouth Africa white-ball coach Rob Walter said they're unsure about Quinton de Kock's T20I future after he was omitted from the team for a second consecutive series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/neeraj-chopra-avinash-sable-to-compete-in-diamond-league-final-in-brussels-2597461-2024-09-10",
      "headline": "Neeraj Chopra, Avinash Sable to compete in Diamond League final in BrusselsAvinash Sable, the national record holder in the 3000m steeplechase, will compete in his first Diamond League Final in Brussels, joining star javelin thrower Neeraj Chopra in the season-ending event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-sri-lanka-third-test-ollie-pope-michael-vaughan-reaction-oval-2597462-2024-09-10",
      "headline": "England disrepected Test cricket during Oval loss to Sri Lanka: Michael VaughanMichael Vaughan slammed England and claimed that they disrespected Test cricket with their strategies in the Oval Test loss to Sri Lanka. England were slammed for being over-aggressive with their approach. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/litton-das-pakistan-series-india-test-challenge-sg-ball-2597455-2024-09-10",
      "headline": "Pakistan win is in the past: Litton wary of India's SG balls ahead of Test seriesIndia vs Bangladesh: Litton Das said their heroics against Pakistan are behind them and that they must now focus on the upcoming series against India. Bangladesh will travel to India on September 15 to play two Tests and three T20 Internationals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/video/glad-that-i-was-able-to-change-the-colour-of-the-medal-archer-harvinder-2597433-2024-09-10",
      "headline": "Glad that I was able to change the colour of the medal: Archer HarvinderArcher Harvinder Singh, who won gold in the Paris Paralympics said that he was glad to be able to change the colour of his medal. Harvinder had earlier won bronze in Tokyo Paralympics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/video/nishad-kumar-elated-with-tremendous-support-after-historic-paralympics-campaign-2597407-2024-09-10",
      "headline": "Nishad Kumar elated with tremendous support after historic Paralympics campaignHigh-jumper Nishad Kumar was welcomed with a rousing reception at the Delhi Airport on Tuesday, September 10. The silver medallist in the Paris Paralympics said that he was elated to see the kind support India offered during the Games."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/greater-noida-venue-future-match-referee-report-afghanistan-vs-new-zealand-2597404-2024-09-10",
      "headline": "AFG vs NZ may be Greater Noida's last international match, eyes on referee's reportThe international cricket match between Afghanistan and New Zealand at Greater Noida's Shaheed Vijay Singh Pathik Sports Complex may be the venue's last, subject to the match referee's report. Inadequate infrastructure and rain disruptions have raised concerns about the venue's future."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/badminton/story/hong-kong-open-chirag-sen-manav-choudhary-knocked-out-in-qualifiers-2597405-2024-09-10",
      "headline": "Hong Kong Open: Chirag Sen, Manav Choudhary knocked out in qualifiersIndia's Chirag Sen and Manav Choudhary were knocked out in the qualifiers of the Hong Kong Open on Tuesday, September 10. While Chirag was knocked out in the Round of 16 of his qualification round, Manav lost in the quarter-finals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-trolled-social-media-twitter-champions-cup-pakistan-2597393-2024-09-10",
      "headline": "Babar Azam trolled after failing in practice matchPakistan batter Babar Azam was trolled on social media by fans after failing to score big runs in a practice game. Babar, who has been going through a terrible patch of form got out trying to play a sweep shot against a left-arm spinner."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/cristiano-ronaldo-future-ballon-dor-winners-kylian-mbappe-lamine-yamal-jude-bellingham-erling-haaland-2597389-2024-09-10",
      "headline": "Mbappe, Yamal, Bellingham: Cristiano Ronaldo picks future Ballon d'Or winnersCristiano Ronaldo has picked Kylian Mbappe, Erling Haaland, Jude Bellingham and Lamine Yamal as future Ballon d'Or winners. Ronaldo is a five-time winner of the award. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-kl-rahul-vs-sarfaraz-khan-kris-srikkanth-2597374-2024-09-10",
      "headline": "I feel bad for Sarfaraz, but KL Rahul has done well in Tests: Kris SrikkanthIndia vs Bangladesh: Former opener and ex-chairman of the selection committee, Kris Srikkanth, backed the idea of KL Rahul playing at No. 5 ahead of young Sarfaraz Khan in the first Test against Bangladesh. Rahul returned to the Test squad after missing the second half of England series earlier in the year due to injury. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/young-indian-chess-players-great-at-grabbing-opportunities-viswanathan-anand-2597371-2024-09-10",
      "headline": "Young Indian chess players great at grabbing opportunities: Viswanathan AnandViswanathan Anand, transitioning from world champion to mentor, shares insights on India's chess prospects and his own future. He reflects on the rise of young talents and India's chances at the upcoming Chess Olympiad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-1st-test-mehidy-hasan-miraz-number-eight-all-rounder-2597351-2024-09-10",
      "headline": "Don't want to be best No.8, aim to bat higher: Mehidy Hasan MirazBangladesh's Mehidy Hasan Miraz has claimed that he doesn't want to be the best No.8 and bat higher up in the order. Mehidy was the star of the show for Bangladesh in their series win over Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/cristiano-ronaldo-future-ballon-dor-winners-kylian-mbappe-lamine-yamal-jude-bellingham-erling-haaland-2597389-2024-09-10",
      "headline": "Mbappe, Yamal, Bellingham: Cristiano Ronaldo picks future Ballon d'Or winnersCristiano Ronaldo has picked Kylian Mbappe, Erling Haaland, Jude Bellingham and Lamine Yamal as future Ballon d'Or winners. Ronaldo is a five-time winner of the award. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-kl-rahul-vs-sarfaraz-khan-kris-srikkanth-2597374-2024-09-10",
      "headline": "I feel bad for Sarfaraz, but KL Rahul has done well in Tests: Kris SrikkanthIndia vs Bangladesh: Former opener and ex-chairman of the selection committee, Kris Srikkanth, backed the idea of KL Rahul playing at No. 5 ahead of young Sarfaraz Khan in the first Test against Bangladesh. Rahul returned to the Test squad after missing the second half of England series earlier in the year due to injury. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/young-indian-chess-players-great-at-grabbing-opportunities-viswanathan-anand-2597371-2024-09-10",
      "headline": "Young Indian chess players great at grabbing opportunities: Viswanathan AnandViswanathan Anand, transitioning from world champion to mentor, shares insights on India's chess prospects and his own future. He reflects on the rise of young talents and India's chances at the upcoming Chess Olympiad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-1st-test-mehidy-hasan-miraz-number-eight-all-rounder-2597351-2024-09-10",
      "headline": "Don't want to be best No.8, aim to bat higher: Mehidy Hasan MirazBangladesh's Mehidy Hasan Miraz has claimed that he doesn't want to be the best No.8 and bat higher up in the order. Mehidy was the star of the show for Bangladesh in their series win over Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yuzvendra-chahal-county-championship-five-wicket-haul-northamptonshire-vs-derbyshire-2597343-2024-09-10",
      "headline": "Yuzvendra Chahal takes 5-wicket haul in County Championship for NorthantsCounty Championship 2024: Yuzvendra Chahal picked his third five-wicket haul in first-class cricket, leading Northamptonshire's charge against Derbyshire on Day 2 of their contest in Northampton on Tuesday, September 10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-squad-vs-pakistan-ben-stokes-jack-leach-2597344-2024-09-10",
      "headline": "Ben Stokes returns as England announce 17-member squad for Pakistan Test seriesEngland announced their squad for 3-match Test series against Pakistan on Tuesday, September 10. Ben Stokes, who is currently rehabilitating from a hamstring tear was named the captain the side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-1st-test-brad-hoggs-india-playing-xi-ravindra-jadeja-kl-rahul-chennai-2597313-2024-09-10",
      "headline": "Ravindra Jadeja at No.5, No KL Rahul: Brad Hogg's India playing XI vs BangladeshBrag Hogg has included Ravindra Jadeja at No.5 and snubbed KL Rahul from his India's playing XI for the 1st Test against Bangladesh in Chennai. Jadeja and Rahul were included in the squad for the 1st Test against Bangladesh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-australia-1st-t20i-phil-salt-playing-xi-2597286-2024-09-10",
      "headline": "ENG vs AUS: Phil Salt to captain as England hand 3 debuts in 1st T20IEngland announced their playing XI for the 1st T20I match against Australia a day in advance. With Phil Salt captaining, the hosts named three debutants in the first XI."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/how-i-made-it/story/wc-influential-ten-writers-community-honors-digital-social-change-makers-2527796-2024-04-16",
      "headline": "WC influential ten: Writers community honors digital social change makersWriters Community Freelancers Releases 'WC Influential Ten' List Recognizing Social Impact through Virtual Space and Social Media"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}