{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/epf-withdrawal-via-upi-and-atms-coming-soon-all-you-need-to-know-2689399-2025-03-05",
      "headline": "EPF withdrawal via UPI and ATMs coming soon. All you need to knowThis new facility will allow EPF members to withdraw their savings instantly using UPI platforms like GPay, PhonePe, and Paytm."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/itr1-sahaj-vs-itr4-sugam-check-key-differences-and-eligibility-2689364-2025-03-05",
      "headline": "ITR-1 (Sahaj) vs ITR-4 (Sugam): Check key differences and eligibility Commonly known as the Sahaj form, ITR-1 is a simple form for individuals with simple income sources."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/want-to-track-old-mutual-funds-investments-here-is-what-you-need-to-do-2689316-2025-03-05",
      "headline": "Want to track old mutual funds investments? Here's what you need to doWith millions of unclaimed folios, the Mitra platform aims to simplify the process of finding and reclaiming lost mutual fund investments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-ends-over-700-points-higher-nifty-snaps-10-day-losing-streak-2689296-2025-03-05",
      "headline": "Sensex ends 740 points higher, Nifty snaps 10-day losing streakThe S&P BSE Sensex ended 740.30 points higher to 73,730.23 at the closing bell, while the NSE Nifty50 settled 254.65 points lower at 22,337.30."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/looking-for-better-returns-than-fixed-deposits-check-these-3-investment-options-nsc-ppf-government-bonds-gold-etfs-2689243-2025-03-05",
      "headline": "Looking for better returns than fixed deposits? Check these 3 investment optionsWith the RBI announcing a repo rate cut, banks have lowered fixed deposit rates, prompting investors to look for better alternatives. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-sensex-nifty-dalal-street-relief-rally-losing-streak-finally-over-2689183-2025-03-05",
      "headline": "Sensex surges 900 points: Is Dalal Street's losing streak finally over?Today's relief rally in domestic equities is offering some much-needed respite to traders. But with trade tensions heating up, the volatility isn't going away anytime soon. Is this the beginning of a rebound or just a temporary surge?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-could-hamper-taxpayers-digital-privacy-details-here-2689162-2025-03-05",
      "headline": "New income tax bill proposes allowing officers access to your email, social mediaThe new bill gives tax officers the authority to access computers, emails, and social media accounts, raising privacy concerns. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mahindra-and-mahindra-share-price-jumps-over-4-percent-after-ubs-target-price-upgrade-2689139-2025-03-05",
      "headline": "M&M shares rise over 4% after UBS upgrade. 3 things investors should know M&M stock price: The brokerage said the recent 19% correction in M&M's share price, compared to Nifty Auto's 13% decline, was an overreaction to EV-related concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/services-sector-growth-accelerates-in-february-backed-by-strong-demand-2689130-2025-03-05",
      "headline": "Services sector growth accelerates in February backed by strong demandHSBC's final India services Purchasing Managers' Index, compiled by S&P Global, rose to 59.0 in February from January's 26-month low of 56.5 but was lower than a preliminary estimate of 61.1."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/what-are-reciprocal-tariffs-us-president-donald-trump-congress-address-2689116-2025-03-05",
      "headline": "What are reciprocal tariffs that Donald Trump mentioned in Congress address?US President Donald Trump announced the implementation of reciprocal tariffs starting next month while addressing a joint session of the US Congress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-rises-over-600-points-why-is-the-stock-market-rising-today-2689112-2025-03-05",
      "headline": "Sensex surges 800 points. Why is the stock market rising today?Today's rebound has brought much-needed relief to traders on Dalal Street, reviving hopes of a broader recovery in the days ahead. Here's what's driving the rally and whether the downturn has bottomed out."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/explained-why-coforge-shares-jumped-nearly-10-today-2689103-2025-03-05",
      "headline": "Explained: Why Coforge shares jumped nearly 10% todayCoforge share price: The stock reached an intraday high of Rs 7,924.50 in early trade and was up 8.65% to Rs 7,827.25 on the Bombay Stock Exchange (BSE) at 10:20 am."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/actor-parambrata-jokes-about-playing-a-cop-ahead-of-khakee-the-bengal-chapter-neeraj-pandey-2689496-2025-03-05",
      "headline": "Actor Parambrata jokes about playing a cop ahead of Khakee: The Bengal ChapterActor Parambrata Chattopadhyay recently joked about playing a police officer ahead of his Netflix series, Khakee: The Bengal Chapter. The actor even shared reasons behind nodding to feature in the political drama. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/khakee-the-bengal-chapter-trailer-out-neeraj-pandey-netflix-show-2689461-2025-03-05",
      "headline": "Khakee The Bengal Chapter trailer: Neeraj Pandey show dives into politics, crimeThe trailer for Khakee The Bengal Chapter was unveiled on March 5. The show promises a riveting series filled with action, drama, and political intrigue. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/seventeen-member-wonwoo-to-enlist-in-military-in-april-3-2689393-2025-03-05",
      "headline": "K-pop group SEVENTEEN member Wonwoo to enlist in military in AprilSEVENTEEN's Wonwoo is set to begin his mandatory military service in April, as confirmed by Pledis Entertainment. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/lollapalooza-2025-shawn-mendes-louis-tomlinson-to-make-india-debut-2689363-2025-03-05",
      "headline": "Lollapalooza 2025: Shawn Mendes, Louis Tomlinson to make India debutLollapalooza India is making a grand return in 2025 at Mumbai's Mahalaxmi Racecourse. With an eclectic lineup featuring Green Day, Shawn Mendes, and more, this festival promises an unforgettable musical experience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/sumbul-touqeer-blasts-trolls-for-body-shaming-rupali-ganguly-reacts-2689259-2025-03-05",
      "headline": "Actor Sumbul Touqeer blasts trolls for body-shaming: Never been more madTelevision actor Sumbul Touqeer Khan has addressed the body-shaming and trolling she faced in a recent social media post. She clarified that her weight gain was due to medication and urged trolls to stop their unwarranted comments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/with-love-meghan-first-reviews-from-foreign-media-meghan-markle-show-called-queasy-unlovable-2689245-2025-03-05",
      "headline": "With Love, Meghan first reviews: Meghan Markle's show called queasy, unlovableIn 'With Love, Meghan', Meghan Markle arranges flowers, cooks delectable exquisite food with her celebrity friends, and gives stunning glimpses of her gorgeous Montecito house with a sprawling ocean view. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/severance-creator-ben-stiller-requested-barack-obama-for-cameo-in-apple-tv-show-2689232-2025-03-05",
      "headline": "Severance creator Ben Stiller requested Obama for cameo in show. Here's how it wentSeverance creator and actor Ben Stiller wanted former US President Barack Obama to appear in his acclaimed Apple TV show, Severance. However, his request was politely turned down. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/black-doves-netflix-new-thriller-show-keira-knightley-ben-whishaw-2689184-2025-03-05",
      "headline": "Black Doves: Keira Knightley show is essential viewing for thriller enthusiastsBritish stars Keira Knightley and Ben Whishaw's thriller series Black Doves is both relentless and rewarding. The underrated gem is currently streaming on Netflix. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/sana-khan-faces-backlash-after-asking-sambhavna-seth-to-wear-burqa-for-her-podcast-2689168-2025-03-05",
      "headline": "Sana Khan faces backlash after asking Sambhavna Seth to wear burqa for her podcastSana Khan found herself in the spotlight after a video of her asking Sambhavna Seth to wear a burqa went viral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/aashram-3-part-2-aaditi-pohankar-pammi-outshines-bobby-deol-baba-nirala-prakash-jha-2688708-2025-03-05",
      "headline": "Aashram 3 Part 2: Aaditi Pohankar's Pammi outshines Bobby Deol's Baba NiralaAaditi Pohankar's character as Pammi has garnered her immense love and appreciation from fans. Her fierce portrayal and her quest to take revenge against Bobby Deol's Baba Nirala truly makes her the hero of the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bobby-deol-had-a-vertigo-attack-while-promoting-aashram-2689147-2025-03-05",
      "headline": "Bobby Deol had a vertigo attack while promoting Aashram: Was very nervousActor Bobby Deol recently revealed that he suffered from a vertigo attack while promoting his popular show Aashram. The actor is currently seen in the latest season of the show, which is streaming on MX Player. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/blackpink-jennie-new-song-plagiarism-controversy-explained-beats-similar-to-karan-johar-rocky-aur-rani-theme-song-alia-bhatt-2689121-2025-03-05",
      "headline": "Explained: The plagiarism controversy around BLACKPINK's Jennie's new song BLACKPINK member Jennie Kim released the teaser of her new single, 'Like Jennie', on social media, and several social media users, especially Indians, found it quite similar to Alia Bhatt's theme song from 'Rocky Aur Rani Kii Prem Kahaani'. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/s-jaishankar-in-uk-extremists-try-to-attack-external-affairs-minister-car-in-london-tear-indian-flag-2689594-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Khalistani extremists try to attack S Jaishankar in London, tear Indian flagKhalistani extremists attempted to disrupt EAM S Jaishankar's visit to London, escalating a protest into a security breach. As he left Chatham House, a man ran towards his car and tore the Indian flag in front of police officers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donld-trump-united-states-secret-talks-hamas-citizens-hostages-israle-gaza-palestine-2689548-2025-03-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Release hostages now or you're dead: Trump after US holds talks with HamasAs the US held unprecedented talks with Hamas on Gaza hostages, President Donald Trump gave a stern \"last warning\" to the Palestinian terror group to release the remaining captives or \"there will be hell to pay later\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/s-jaishankar-says-kashmir-issue-will-be-solved-once-stolen-land-i-s-returned-2689590-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Can PM use Trump's peace making zeal to solve Kashmir issue? Jaishankar repliesExternal Affairs Minister S Jaishankar on Wednesday was asked if Prime Minister Narendra Modi could leverage US President Donald Trump's peace efforts to resolve the Kashmir issue with "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-us-president-tariff-canada-mexico-ukraine-military-assistance-transactional-foreign-policy-fareed-zakaria-2689565-2025-03-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump is transactional: Fareed Zakaria as US reshapes its foreign policiesGeopolitical expert Fareed Zakaria described US President Donald Trump's foreign policy as purely transactional, emphasising that he relentlessly shapes the agenda to his advantage and pressures opponents into win-lose situations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-mitchell-santner-speaks-about-toss-factor-ind-vs-nz-final-2689571-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "IND vs NZ final: Mitchell Santner speaks about toss factor in the summit clashNew Zealand captain Mitchell Santner spoke about the toss factor in the final of the ICC Champions Trophy 2025 against India. New Zealand lost their group stage game against India in Dubai by 44 runs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-justin-trudeau-phone-call-tariffs-trade-war-drug-smuggling-canada-mexico-tariffs-2689586-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Governor Trudeau' trying to use trade war to stay in power, says TrumpUS President Donald Trump claimed that Canadian Prime Minister Justin Trudeau wanted to use the escalating trade war to stay in power, a day after Washington imposed 25 per cent tariffs on Canadian imports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/sleep-divorce-indian-couples-sleep-separate-rooms-beds-relationship-work-life-balance-resmed-2689346-2025-03-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sleeping single, staying married: The rise of sleep divorce in IndiaOver 70% of Indian couples opt for sleep divorce to improve rest, citing snoring, stress, and mismatched schedules - highlighting a global sleep crisis impacting health and relationships, according to a study."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/top-karnataka-cop-ramachandra-rao-reacts-stepdaughter-ranya-arrest-smuggling-gold-case-2689439-2025-03-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Wasn't aware of any of it: Karnataka top cop on actor daughter's arrestKarnataka DGP Ramachandra Rao, the father of actor Ranya Rao, distanced himself from his daughter's gold smuggling case, saying he was unaware of it. The Kannada actor was caught with over 14 kg gold worth Rs 12 crore from Bengaluru airport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/diu/story/us-donald-trump-ukraine-russia-military-aid-war-eu-2689424-2025-03-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ukraine's aid lifeline: Without US support, who will fill the gap?The suspension of US military aid to Ukraine has raised concerns among European nations. France criticised the decision, stating it could delay peace efforts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/katrina-kaif-dances-to-sasural-genda-phool-friend-wedding-vicky-kaushal-2689593-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Katrina Kaif grooves to 'Sasural Genda Phool' at friend's wedding. WatchKatrina Kaif performed at her friend's wedding and grooved to 'Sasural Genda Phool' song with her girl gang. As the video went viral, fans filled the comment section with heart emojis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/stanley-zhong-father-nan-zhong-lawsuit-university-of-california-rejected-16-united-states-universities-google-job-offer-2689599-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rejected by 16 US colleges despite Google job offer, teen sues universityStanley Zhong, now 19, was offered a job at PhD level as a software engineer by Google when he was 13. He was rejected by multiple top US universities in 2023, and in the lawsuit that his father has filed, they have alleged racial discrimination against Asian-Americans."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/indians-abroad/story/telangana-man-shot-dead-us-part-time-job-store-higher-studies-family-members-2689557-2025-03-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Telangana student working part-time in US store shot dead by robbersA 27-year-old man from Telangana was shot dead at a store in the US where he used to work part-time after robbers opened fire. The victim's father said he received the news of his death from his friends."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-final-ct-dubai-icc-tournament-history-2689528-2025-03-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India, New Zealand to battle in Champions Trophy final after 25 years Champions Trophy 2025: New Zealand produced an all-round effort to outclass South Africa in the second semi-final in Lahore. New Zealand and India will meet in the final of an ICC white-ball tournament for the first time since 2000."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/biju-babu-patnaik-birthday-takes-battle-turn-bjd-congress-pounce-on-bjp-panchayati-raj-day-naveen-mohan-majhi-2689319-2025-03-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Biju Babu's birthday takes battle turn, BJD and Congress pounce on BJPThe BJP government of Odisha's move to delink Biju Patnaik's birth anniversary from Panchayati Raj Day and cancel the state holiday has sparked a political firestorm in the coastal state. With protests on the streets and barbs from the BJD and the Congress, the battle around Biju Babu's legacy is only hotting up."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/ukraine-russia-war-peace-negotiations-ghosts-of-2022-talks-might-return-to-haunt-zelenskyy-trump-2689178-2025-03-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why ghosts of 2022 talks might return to haunt ZelenskyyJust weeks after Russia invaded Ukraine in February 2022, officials from both sides met in Belarus and Turkey for peace talks. The negotiations fell through. Three years later, after losing territory and thousands of people, Ukraine might find terms of peace much more difficult to settle. This comes as Russia digs in amid US President Donald Trump withdrawing war support for Kyiv."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ayesha-takia-case-against-husband-abu-farhan-azmi-goan-goons-bullied-him-son-2689539-2025-03-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ayesha Takia on case against husband Farhan Azmi: Goan goons bullied him, sonFormer actor Ayesha Takia shared a bunch of posts detailing her ordeal after a case was registered against her husband, Abu Farhan Azmi, by Goa police for a public altercation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-automakers-tariff-relief-canada-mexico-border-drug-control-justin-trudeau-2689585-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US exempts automakers from new Canada and Mexico tariffs for 1 monthThe White House said President Donald Trump exempted automakers from his new 25 per cent tariffs on Canada and Mexico for one month as long as they followed the existing free trade agreement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tamil-nadu-couples-making-babies-at-war-footing-cant-help-mk-stalin-meet-target-delimitation-population-rate-2689376-2025-03-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Tamil couples can't make babies fast enough to please Stalin or save Lok Sabha seatsSaying that Tamil Nadu might lose parliamentary seats as it successfully controlled population growth, Chief Minister MK Stalin has urged couples to have babies without delay. Statistically speaking, can Tamil couples actually add babies to the population at the rate and in the duration that Stalin seeks?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sourav-ganguly-acting-netflix-khaki-2-2689564-2025-03-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sourav Ganguly ventures into acting with Netflix's Khakee 2Legendary former India captain Sourav Ganguly is set to make his acting debut in a promotional for Netflix's Khaki 2. Ganguly has been on TV before with multiple advertisement shoots and with his game show called Dadagiri."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rajiv-gandhi-education-failed-in-college-mani-shankar-aiyar-video-amit-malviya-2689486-2025-03-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "BJP vs Congress over Mani Shankar Aiyar's 'Rajiv Gandhi failed twice' remarkCongress veteran Mani Shankar Aiyar's video, shared by BJP leaders, claims that Rajiv Gandhi failed at Cambridge University and Imperial College in London. The video drew a sharp reaction from Congress leaders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/yogi-adityanath-abu-azmi-aurangzeb-maharashtra-mla-samajwadi-party-akhilesh-yadav-bjp-protest-2689388-2025-03-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Send Abu Azmi to UP, we'll take care of rest: Yogi Adityanath to Samajwadi PartyYogi Adityanath asked the Samajwadi Party to expel Abu Azmi and send him to Uttar Pradesh. \"We know well how to deal with such people,\" he said after row over Azmi's Aurangzeb comment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/united-states-intelligence-sharing-ukraine-donald-trump-volodymyr-zelenskyy-washington-2689512-2025-03-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "After pausing military aid, US cuts off intel sharing with Ukraine: ReportThe US has halted intelligence-sharing with Ukraine, impacting its military strategy, as Zelenskyy expresses willingness to negotiate peace and sign a mineral deal with Trump.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/macbook-air-m4-launched-in-india-and-it-is-rs-15000-cheaper-than-air-m3-model-2689470-2025-03-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "MacBook Air M4 launched in India and it is Rs 15,000 cheaper than Air M3 modelApple has announced its new 13-inch and 15-inch MacBook Air models in India, powered by the advanced M4 chip and featuring an all-new \"Sky Blue\" colour option."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rajasthan-education-minister-madan-dilawar-akbar-rapist-aurangzeb-assembly-2689382-2025-03-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rajasthan minister calls Akbar 'rapist', says Aurangzeb killed 'countless Hindus'Rajasthan Education Minister Madan Dilawar, speaking in the Rajasthan Assembly, said labelling Akbar as 'great' was an insult to the country as he was a rapist and a looter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/liam-payne-girlfriend-kate-cassidy-breaks-down-remembering-singer-says-cannnot-fully-accept-2689598-2025-03-06",
      "headline": "Liam Payne's girlfriend breaks down remembering singer, says 'can't fully accept'Liam Payne's untimely demise has left his girlfriend Kate Cassidy grappling with grief. In a heartfelt interview, she shares her struggles and healing journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/katrina-kaif-dances-to-sasural-genda-phool-friend-wedding-vicky-kaushal-2689593-2025-03-06",
      "headline": "Katrina Kaif grooves to 'Sasural Genda Phool' at friend's wedding. WatchKatrina Kaif performed at her friend's wedding and grooved to 'Sasural Genda Phool' song with her girl gang. As the video went viral, fans filled the comment section with heart emojis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/rekha-suhana-khan-sara-ali-khan-janhvi-kapoor-ibrahim-ali-khan-khusi-kapoor-nadaaniyan-screening-2689567-2025-03-05",
      "headline": "Rekha, Suhana Khan, Sara Ali Khan, and other celebs attend Nadaaniyan screeningMakers of Ibrahim Ali Khan and Khushi Kapoor's upcoming Netflix film, Nadaaniyan, hosted a star-studded screening in Mumbai. Take a look at the celebs who attended the event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anurag-kashyap-moves-out-of-mumbai-bollywood-has-become-too-toxic-2689554-2025-03-05",
      "headline": "Anurag Kashyap moves out of Mumbai: Bollywood has become too toxicAnurag Kashyap confessed to moving out of Mumbai. The director cited toxicity in Bollywood behind his move to relocate. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-kane-williamson-dubai-advantage-final-2689602-2025-03-06",
      "headline": "New Zealand not looking closely at India's Dubai advantage: Kane WilliamsonKane Williamson remains unfazed by India's familiarity with Dubai conditions ahead of the Champions Trophy final, emphasising that New Zealand must focus on their own game rather than external factors beyond their control."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-mitchell-santner-speaks-about-toss-factor-ind-vs-nz-final-2689571-2025-03-06",
      "headline": "IND vs NZ final: Mitchell Santner speaks about toss factor in the summit clashNew Zealand captain Mitchell Santner spoke about the toss factor in the final of the ICC Champions Trophy 2025 against India. New Zealand lost their group stage game against India in Dubai by 44 runs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sourav-ganguly-acting-netflix-khaki-2-2689564-2025-03-05",
      "headline": "Sourav Ganguly ventures into acting with Netflix's Khakee 2Legendary former India captain Sourav Ganguly is set to make his acting debut in a promotional for Netflix's Khaki 2. Ganguly has been on TV before with multiple advertisement shoots and with his game show called Dadagiri."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-rajeev-shukla-interacts-with-pakistani-press-in-lahore-2689558-2025-03-05",
      "headline": "Watch: Rajeev Shukla interacts with Pakistani press in LahoreBCCI vice president Rajeev Shukla interacted with the Pakistani press during his visit to Lahore to watch the second semi final of the ICC Champions Trophy 2025 between New Zealand and South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-sunil-gavaskar-on-rohit-sharma-intent-gautam-gambhir-presser-2689553-2025-03-05",
      "headline": "Sunil Gavaskar disagrees with Gautam Gambhir over Rohit Sharma's batting approachChampions Trophy 2025: A day after head coach Gautam Gambhir defended Rohit Sharma's risk-laden batting approach, Sunil Gavaskar urged the India captain to reconsider it and spend more time at the crease."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-david-miller-fastest-hundred-in-champions-trophy-nz-vs-sa-2689552-2025-03-05",
      "headline": "Watch: David Miller celebrates bittersweet 67-ball hundred in South Africa's exitSouth Africa batter David Miller scored the fastest century in the history of ICC Champions Trophy during the second semi-final against New Zealand. He dedicated his hundred to his newborn baby with a special gesture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-jason-gillespie-pakistan-coach-aaqib-javed-clown-2689550-2025-03-05",
      "headline": "He is a clown: Gillespie slams Pakistan coach Aaqib Javed for lyingFormer Pakistan Test team coach Jason Gillespie has hit out against his successor Aaqib Javed for his excuses after the Champions Trophy exit. Gillispie called Javed a clown and called the situation of the Pakistan team hilarious.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-vs-south-africa-semi-final-rachin-kane-williamson-santner-2689531-2025-03-05",
      "headline": "Rachin special knocks South Africa out, sets up India vs New Zealand finalNew Zealand beat South Africa in the second semi final of the Champions Trophy to qualify for the summit clash against India. Rachin Ravindra and Kane Williamson were heroes for the Kiwis in their clinical show in Lahore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-final-ct-dubai-icc-tournament-history-2689528-2025-03-05",
      "headline": "India, New Zealand to battle in Champions Trophy final after 25 years Champions Trophy 2025: New Zealand produced an all-round effort to outclass South Africa in the second semi-final in Lahore. New Zealand and India will meet in the final of an ICC white-ball tournament for the first time since 2000."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-rajeev-shukla-irked-by-pakistan-journalist-question-on-dubai-advantage-2689505-2025-03-05",
      "headline": "Pakistan journalist's question on 'Dubai advantage' irks Rajeev ShuklaBCCI vice president was seen getting irritated by a question from a Pakistan journalist about India's advantage while playing in Dubai in the ICC Champions Trophhy 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fifa-world-cup-final-show-coldplay-tickets-2689491-2025-03-05",
      "headline": "Coldplay at World Cup 2026? FIFA president confirms half-time show in finalFIFA president Gianni Infantino has confirmed that the football World Cup 2026 will have a first of its kind halftime show in the final of the tournament. The FIFA World Cup will be jointly hosted by United States, Canada, and Mexico.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-jason-gillespie-pakistan-coach-aaqib-javed-clown-2689550-2025-03-05",
      "headline": "He is a clown: Gillespie slams Pakistan coach Aaqib Javed for lyingFormer Pakistan Test team coach Jason Gillespie has hit out against his successor Aaqib Javed for his excuses after the Champions Trophy exit. Gillispie called Javed a clown and called the situation of the Pakistan team hilarious.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-vs-south-africa-semi-final-rachin-kane-williamson-santner-2689531-2025-03-05",
      "headline": "Rachin special knocks South Africa out, sets up India vs New Zealand finalNew Zealand beat South Africa in the second semi final of the Champions Trophy to qualify for the summit clash against India. Rachin Ravindra and Kane Williamson were heroes for the Kiwis in their clinical show in Lahore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-final-ct-dubai-icc-tournament-history-2689528-2025-03-05",
      "headline": "India, New Zealand to battle in Champions Trophy final after 25 years Champions Trophy 2025: New Zealand produced an all-round effort to outclass South Africa in the second semi-final in Lahore. New Zealand and India will meet in the final of an ICC white-ball tournament for the first time since 2000."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-rajeev-shukla-irked-by-pakistan-journalist-question-on-dubai-advantage-2689505-2025-03-05",
      "headline": "Pakistan journalist's question on 'Dubai advantage' irks Rajeev ShuklaBCCI vice president was seen getting irritated by a question from a Pakistan journalist about India's advantage while playing in Dubai in the ICC Champions Trophhy 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fifa-world-cup-final-show-coldplay-tickets-2689491-2025-03-05",
      "headline": "Coldplay at World Cup 2026? FIFA president confirms half-time show in finalFIFA president Gianni Infantino has confirmed that the football World Cup 2026 will have a first of its kind halftime show in the final of the tournament. The FIFA World Cup will be jointly hosted by United States, Canada, and Mexico.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-rajeev-shukla-watches-semi-final-with-pcb-chief-mohsin-naqvi-2689474-2025-03-05",
      "headline": "Rajeev Shukla watches Champions Trophy semi-final with PCB Chief Mohsin NaqviBCCI vice President Rajeev Shukla was spotted watching the second semi-final of the ICC Champions Trophy 2025 with PCB Chairman Mohsin Naqvi in Lahore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-virat-kohli-india-vs-australia-interview-bcci-2689466-2025-03-05",
      "headline": "I just love batting: Kohli speaks from the heart in Champions Trophy interviewSenior India batter Virat Kohli gave a raw interview after India pulled off a nervy chase against Australia in the semi-final of the Champions Trophy 2025. Kohli said that as long as the joy of batting was there, other things just took care of themselves.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-kl-rahuls-gesture-towards-pitch-invading-fan-ind-vs-aus-2689402-2025-03-05",
      "headline": "Watch: KL Rahul's kind gesture towards pitch-invading fan wins hearts Star India batter KL Rahul's gesture towards a pitch-invading fan after the semi final of the ICC Champions Trophy 2025 against Australia is being loved by the fans worldwide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-kane-williamson-15th-odi-hundred-ab-de-villiers-sa-vs-nz-2689381-2025-03-05",
      "headline": "SA vs NZ: Kane Williamson surpasses AB de Villiers after 15th ODI hundredNew Zealand batter Kane Williamson scored a magnificent century in the second semi-final of the ICC Champions Trophy 2025 against South Africa. He played a brilliant knock of 102 (94) smashing ten fours and two sixes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-new-zealand-vs-south-africa-semi-final-arshad-nadeem-brings-out-trophy-lahore-2689361-2025-03-05",
      "headline": "NZ vs SA: Olympic champion Arshad Nadeem brings out Champions Trophy before matchPakistan's Olympic champion Arshad Nadeem was the special guest as he brought out the Champions Trophy ahead of the semi-final between New Zealand and South Africa on Wednesday, March 5. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-sa-vs-nz-semifinal-rachin-ravindra-hundred-record-sourav-ganguly-2689358-2025-03-05",
      "headline": "Rachin Ravindra emulates Sourav Ganguly with twin hundreds in Champions Tropy 2025Champions Trophy, SA vs NZ: Rachin Ravindra became the eighth batter and the first New Zealander to hit more than one hundred in an edition of the Champions Trophy. The 24-year-old hit his fifth hundred in ICC ODI tournaments. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-kane-williamson-completes-19000-international-runs-2689337-2025-03-05",
      "headline": "Champions Trophy: Kane Williamson becomes 4th fastest to 19000 international runsKane Williamson completed 19000 runs in international cricket during the second semi-final of the ICC Champions Trophy 2025 against South Africa and became the fourth fastest to reach the milestone."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-steve-smith-retirement-yuvraj-singh-message-2689325-2025-03-05",
      "headline": "Steve Smith retires from ODIs: Your impact beyond numbers, says Yuvraj SinghWorld Cup-winning all-rounder Yuvraj Singh reminisced about his IPL stint with Steve Smith as he wished the Australian batter the best for the future. Smith retired from ODIs on Wednesday"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-new-zealand-vs-south-africa-semi-final-arshad-nadeem-brings-out-trophy-lahore-2689361-2025-03-05",
      "headline": "NZ vs SA: Olympic champion Arshad Nadeem brings out Champions Trophy before matchPakistan's Olympic champion Arshad Nadeem was the special guest as he brought out the Champions Trophy ahead of the semi-final between New Zealand and South Africa on Wednesday, March 5. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-sa-vs-nz-semifinal-rachin-ravindra-hundred-record-sourav-ganguly-2689358-2025-03-05",
      "headline": "Rachin Ravindra emulates Sourav Ganguly with twin hundreds in Champions Tropy 2025Champions Trophy, SA vs NZ: Rachin Ravindra became the eighth batter and the first New Zealander to hit more than one hundred in an edition of the Champions Trophy. The 24-year-old hit his fifth hundred in ICC ODI tournaments. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-kane-williamson-completes-19000-international-runs-2689337-2025-03-05",
      "headline": "Champions Trophy: Kane Williamson becomes 4th fastest to 19000 international runsKane Williamson completed 19000 runs in international cricket during the second semi-final of the ICC Champions Trophy 2025 against South Africa and became the fourth fastest to reach the milestone."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-steve-smith-retirement-yuvraj-singh-message-2689325-2025-03-05",
      "headline": "Steve Smith retires from ODIs: Your impact beyond numbers, says Yuvraj SinghWorld Cup-winning all-rounder Yuvraj Singh reminisced about his IPL stint with Steve Smith as he wished the Australian batter the best for the future. Smith retired from ODIs on Wednesday"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-vs-lsg-security-concern-april-ram-navami-kolkata-2689287-2025-03-05",
      "headline": "KKR's clash with LSG on April 6 faces hurdle over security arrangementsDefending champions Kolkata Knight Riders' clash against Lucknow Super Giants on April 6 faces a major roadblock as Kolkata Police has expressed its inability to provide adequate security for the match due to Ram Navami celebrations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/sharath-kamal-retirement-table-tennis-chennai-2689268-2025-03-05",
      "headline": "Table tennis great Sharath Kamal announces retirement after two-decade-long career Five-time Olympian Sharath Kamal announced he will bring the curtains down on his decorated career after playing a tournament in Chennai in March."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-wpl-2025-smriti-mandhana-rcb-playoffs-qualification-2689195-2025-03-05",
      "headline": "How can Smriti Mandhana's RCB qualify for playoffs? WPL 2025: Smriti Mandhana's Royal Challengers Bengaluru (RCB) need to win both their remaining matches to give themselves a decent chance of qualifying for the playoffs. They are currently on a four-match losing streak. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-virat-kohli-odi-rankings-australia-2689242-2025-03-05",
      "headline": "Virat Kohli climbs further in ODI rankings after Australia heroics Champions Trophy 2025: Virat Kohli has climbed to No.4 in the ICC rankings for ODI batters after he played a match-winning knock in the semi-final on Tuesday at the Dubai International Cricket Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-ruturaj-gaikwad-csk-captaincy-2689238-2025-03-05",
      "headline": "This is your team: When MS Dhoni handed CSK captaincy to Ruturaj GaikwadCSK captain Ruturaj Gaikwad recalled the moment when MS Dhoni handed over the reins of the team ahead of the IPL 2024 season. Ruturaj was given CSK captaincy just before the start of the season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/steve-smith-announces-odi-retirement-after-champions-trophy-ytvd-2689208-2025-03-05",
      "headline": "Steve Smith retires from ODIs, marking a significant era in Australian cricketSteve Smith announces retirement from ODIs after Australia's Champions Trophy exit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-south-africa-vs-new-zealand-live-score-semifinal-updates-today-match-lahore-2689209-2025-03-05",
      "headline": "Semifinal Highlights: New Zealand beat South Africa by 50 runs to advance to finalChampions Trophy semifinal, South Africa (SA) vs New Zealand (NZ) Live Updates: New Zealand beat South Africa by 50 runs in the second semi-final of the ICC Champions Trophy 2025. David Miller scored a sensational century in losing cause scoring an unbeaten 100* (67). For  New Zealand, Mitchell Santner starred with the ball registering figures of 3/43 in ten overs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-india-vs-australia-semi-final-rohit-sharma-virat-kohli-s-sreesanth-2689205-2025-03-05",
      "headline": "Indian team's brotherhood on the field is their biggest strength: S SreesanthFormer pacer S Sreesanth feels that the brotherhood within the Indian team is their biggest strength as they reached the final of the Champions Trophy 2025. Sreesanth also praised Gautam Gambhir, Rohit Sharma and the support staff for their handling of the squad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-indian-cricket-team-sops-bcci-franchises-2689201-2025-03-05",
      "headline": "BCCI extends Indian team SOPs to IPL franchises ahead of 2025 season: ReportThe BCCI has decided to partially implement its recently rolled out Indian team SOPs to the 10 IPL franchises ahead of the IPL 2025 season. The IPL 2025 season is set to start from March 22 in Kolkata. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-australia-semi-final-rohit-sharma-virast-kohli-olympics-2028-s-sreesanth-2689169-2025-03-05",
      "headline": "Let Virat Kohli, Rohit Sharma continue playing and win Olympic gold: S SreesanthFormer pacer S Sreesanth wants to see retirement questions for Rohit Sharma and Virat Kohli coming to an end. Sreesanth wants the star duo to play for India and win the Olympics gold in 2028. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-virat-kohli-run-chase-grandmaster-singles-spin-trouble-2689153-2025-03-05",
      "headline": "Grandmaster of chases: Virat Kohli cements GOAT status, one single at a timeVirat Kohli has stepped up with the bat in two of India's biggest games so far in the Champions Trophy. With one single at a time, the batting great is further cementing his reputation as one of the greatest chasters in one-day cricket. \r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}