{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/reliance-says-it-will-comply-with-new-us-western-sanctions-on-russian-oil-2808035-2025-10-24",
      "headline": "Reliance says it will comply with new US, Western sanctions on Russian oilThe oil-to-retail behemoth said that it is assessing the implications of restrictions announced by the European Union, the United Kingdom and the United States on crude oil imports from Russia and the export of refined products to Europe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/goyals-warning-shot-no-trade-deals-with-a-gun-to-our-head-ytvd-2807865-2025-10-24",
      "headline": "No trade deals with a gun to our head: Piyush Goyal on India-US trade talksThis special report covers Union Commerce Minister Piyush Goyal's firm message on India's approach to international trade negotiations, particularly regarding the United States. Speaking at the Berlin Global Dialogue, Mr. Goyal made it clear that India will not be rushed into agreements. He stated, 'we do not do deals in a hurry, and we do not go ahead and sign any deals with deadlines or with a gun to our head'. The minister emphasized that for India, trade deals are not merely about tariffs or market access but are long-term partnerships built on trust and mutual respect between nations. This stance comes amid ongoing trade discussions with both the US and the European Union, where India is advocating for fair and equitable agreements that benefit its businesses and economy in the long run."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/do-not-do-deals-with-gun-to-our-head-piyush-goyal-on-trade-talks-with-us-2807857-2025-10-24",
      "headline": "Don't do deals with gun to our head: Piyush Goyal on trade talks with USIndia is exploring newer markets to reduce the impact of high tariffs and ensure fair trade terms for its exporters, said Piyush Goyal. He noted that India's approach is guided by strategy and self-interest rather than external pressure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-320-points-lower-nifty-below-25800-hul-down-3-percent-2807806-2025-10-24",
      "headline": "Sensex closes 320 points lower, Nifty below 25,800; HUL down 3%The S&P BSE Sensex lost 344.52 points to close at 84,211.88, while the NSE Nifty50 lost 96.25 points to end at 25,795.15."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/mutual-fund-investing-best-returns-xirr-value-how-to-invest-expert-view-2807794-2025-10-24",
      "headline": "Have you been investing in mutual funds the wrong way all this time?Experts say that most investors rely only on absolute returns while judging a mutual fund's performance. They focus on the number showing how much profit they've made, without understanding the factors behind those returns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-maize-import-talks-rattle-indian-farmers-as-prices-fall-below-msp-2807771-2025-10-24",
      "headline": "US maize import talks rattle Indian farmers as prices fall below MSPReports suggest that if the trade deal goes through and American maize starts entering Indian markets — prices could crash, and farmers may face huge losses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-tumbles-600-points-why-the-stock-market-is-falling-today-2807736-2025-10-24",
      "headline": "Sensex tumbles 600 points: Why the stock market is falling todayThe fall came as investors engaged in profit booking following recent gains. After sustained upward movements, it is common for markets to experience short-term corrections as participants secure returns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-etfs-vs-physical-gold-what-smart-investors-are-looking-at-explains-expert-2807734-2025-10-24",
      "headline": "Gold ETFs vs physical gold: What smart investors are looking at, explains expertGold may be timeless, but the way Indians invest in it is changing fast. With rising awareness of hidden costs, gold ETFs are gaining traction as a smarter, hassle-free alternative."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/piyush-pandey-ads-storytelling-emotion-fevikwik-cadbury-gujarat-tourism-2807721-2025-10-24",
      "headline": "How Piyush Pandey made India fall in love with adsPiyush Pandey transformed Indian advertising with heartfelt stories and local flavour. His campaigns blended wit and emotion, leaving a lasting cultural impact."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/piyush-pandey-who-was-he-fevicol-dairy-milk-asian-paints-famous-ads-adman-dies-age-70-tribute-2807686-2025-10-24",
      "headline": "Remembering Piyush Pandey: The ad legend who made brands immortalFor over four decades, the Jaipur-born storyteller reshaped Indian advertising, turning simple commercials into cultural phenomena and making brands like Fevicol, Cadbury, and Asian Paints inseparable from the Indian consciousness.​"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/ca-explains-why-saving-before-spending-works-best-for-financial-stability-2807696-2025-10-24",
      "headline": "CA explains why saving before spending works best for financial stabilityWhile most people save whatever is left after spending, CA Meenal Goel flips the approach. Her mantra, prioritise savings before expenses, has helped her stay financially secure and stress-free."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/error-in-your-itr-filing-here-is-how-to-correct-it-with-an-updated-return-2807634-2025-10-24",
      "headline": "Error in your ITR filing? Here's how to correct it with an updated returnRealised there's an error in your ITR after submission? You're not alone. Many taxpayers make small mistakes while filing, but the good news is — you can still correct them through an updated return."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/central-banks-gold-hoarding-2025-global-reserve-shift-2807616-2025-10-24",
      "headline": "Why the world's central banks are buying gold like never beforeNot just households and investors, but central banks around the globe are buying gold like it's Dhanteras every day. So why are the world's biggest buyers going for bullion? Read on to find out. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/target-announces-1800-job-cuts-in-a-decade-amid-falling-sales-employee-layoff-2807611-2025-10-24",
      "headline": "Target announces 1,800 job cuts in a decade amid falling salesAll corporate employees in the US have been asked to work from home next week as the company finalises its restructuring process. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-silver-prices-slip-rally-cools-traders-watch-next-2807560-2025-10-24",
      "headline": "Gold, silver prices continue to fall: Is the rally over and what should you do next?After a nine-week winning streak, gold and silver prices are finally losing steam as investors book profits amid a stronger dollar, easing global tensions, and anticipation over key US economic data."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-nifty-flat-defence-stocks-fmcg-metal-shares-2807557-2025-10-24",
      "headline": "Sensex, Nifty open flat as FMCG stocks offset metal gainsThe S&P BSE Sensex lost 96.63 points to 84,459.77, while the NSE Nifty50 was down by 24.20 points to 25,866.45 as of 9:28 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/midwest-listing-share-price-latest-gmp-profit-for-investors-book-hold-market-debut-2807550-2025-10-24",
      "headline": "Midwest listing today: Will it give investors profit? See what GMP suggestsMidwest IPO was subscribed 92.36 times overall. The retail portion was booked 25.52 times, the Qualified Institutional Buyers (QIB) category saw 146.99 times, while the Non-Institutional Investors (NII) category was subscribed 176.57 times. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bank-account-4-nominees-allowed-november-1-per-account-claim-settlement-process-banking-laws-amendment-2807527-2025-10-24",
      "headline": "Banks to allow up to 4 nominees per account from November 1. Here's how it helps youThe decision to allow four nominees aims to make the claim settlement process smoother, more transparent, and uniform across all banks in the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-silver-prices-rebound-amid-volatility-will-they-rise-today-bullion-2807349-2025-10-24",
      "headline": "Gold, silver prices rebound amid volatility. Will they rise today?Following a rough start earlier this week, gold and silver staged a mild recovery on Thursday. While the recovery lifted market mood, the outlook for today depends on global data and investor sentiment. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/apple-loses-uk-lawsuit-over-app-stores-unfair-30-developer-commissions-2807439-2025-10-23",
      "headline": "Apple loses UK lawsuit over App Store's unfair 30% developer commissionsApple has been found guilty in a London court for abusing its dominant position by charging app developers an unfair 30 per cent commission on its App Store. The ruling marks a significant legal challenge against the tech giant's business practices in the UK market.\r\n"
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ek-deewaane-ki-deewaniyat-box-office-day-4-harshvardhan-sonam-film-sees-slight-dip-2808146-2025-10-25",
      "headline": "Ek Deewaane Ki Deewaniyat box office day 4: Harshvardhan-Sonam film sees slight dip 'Ek Deewaane Ki Deewaniyat' has held steady post-Diwali, earning Rs 28.25 crore in four days despite competition from 'Thamma'. Praised for its chemistry and music, the romantic drama is emerging as a festive season success."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nawazuddin-siddiqui-reacts-demand-8-hour-work-hour-shift-deepika-padukone-2807801-2025-10-25",
      "headline": "Exclusive: Nawazuddin Siddiqui shares his take on call for 8-hour work shifts Actor Nawazuddin Siddiqui has commented on Deepika Padukone's recent comments about 8-hour work shifts in the film industry. In an exclusive interview, Siddiqui emphasised the importance of comfortable working hours for all, without exhaustion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/thamma-box-office-day-4-ayushmann-khurana-rashmika-mandanna-film-slows-down-after-a-festive-high-2808128-2025-10-25",
      "headline": "Thamma box office Day 4: Ayushmann-Rashmika's film slows down after a festive high After a blockbuster Diwali debut, 'Thamma' starring Ayushmann Khurrana and Rashmika Mandanna saw a dip in box office numbers on Day 4. Still, the horror comedy remains one of 2025's top performers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/the-female-gaze-why-women-actors-turned-directors-must-helm-indian-cinema-2807868-2025-10-25",
      "headline": "The female gaze: Why women actors-turned-directors must helm Indian cinema A critical industry gap stifles diverse storytelling: why do women actors rarely become directors? The female gaze offers vital, nuanced counter-narratives to clichés, but patriarchal biases and commercial pressures restrict it. On Cinematic Saturday, we reflect on how to unleash this transformative force in Indian cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bb19-episode-62-tanya-mittal-breaks-down-farrhana-clashes-with-neelam-and-malti-2808106-2025-10-25",
      "headline": "BB19 Episode 62: Tanya Mittal breaks down, Farrhana clashes with Neelam and Malti New captain Mridul faced immediate chaos as Tanya's tearful isolation fueled a breakdown and refusal to reconcile with Neelam. Amidst their feud, a fierce family-based fight erupted between Shehbaz and Malti, fracturing friendships and escalating tensions in the house."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-says-the-man-hasnt-changed-as-he-announces-film-festival-of-his-movies-2808080-2025-10-24",
      "headline": "SRK says the man hasn't changed as he announces film festival of his iconic movies Shah Rukh Khan announced a film festival celebrating his iconic movies starting October 31. The event marks his 60th birthday with screenings across India and internationally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/exclusive-priyamani-says-she-is-happy-that-south-films-are-now-getting-acceptance-2808036-2025-10-24",
      "headline": "Exclusive: Priyamani says she is happy that South films are now getting acceptance Actor Priyamani expresses joy over increased acceptance of South films and regional cinema. She highlighted OTT platforms for offering varied acting opportunities and hopes for blurred lines between South and Hindi industries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/baahubali-the-epic-trailer-prabhas-rana-daggubati-clash-in-majestic-spectacle-2808059-2025-10-24",
      "headline": "Baahubali The Epic trailer: Prabhas, Rana Daggubati clash in majestic spectacle The trailer of SS Rajamouli's 'Baahubali: The Epic' merges the two-part film series. The movie is scheduled to release on October 31, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/srk-pays-tribute-to-piyush-pandey-praises-his-contribution-to-ad-industry-in-india-2808029-2025-10-24",
      "headline": "SRK pays tribute to Piyush Pandey, praises his contribution to ad industry in India Actor Shah Rukh Khan paid tribute to late Adman Piyush Pandey. He honoured his legacy by mentioning about his contribution to the Indian advertising industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/zareen-khan-mother-hospitalised-actor-requests-fans-to-pray-for-her-2808005-2025-10-24",
      "headline": "Zareen Khan's mother hospitalised, actor requests fans to pray for her Actor Zareen Khan's mother has been hospitalised. While sharing her mother's health update on social media, Zareen requested her fans to keep her in their prayers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/osgood-perkins-slams-monster-the-ed-gein-story-over-depiction-of-his-late-father-netflix-show-2807982-2025-10-24",
      "headline": "Osgood Perkins slams Monster The Ed Gein Story over depiction of his late father Osgood Perkins has publicly criticised Netflix's Monster series for its portrayal of his father, Anthony Perkins. The debate raises concerns about creative liberties and cultural integrity in the true-crime genre."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/farah-khan-tells-rakhi-sawant-her-7-bhk-house-has-pool-and-james-bond-lift-2807958-2025-10-24",
      "headline": "Farah Khan tells Rakhi Sawant her 7-BHK house has pool and 'James Bond' lift Filmmaker Farah Khan recently opened up about her luxury apartment in Mumbai with three floors, a private pool, and a private lift. She addressed a question about the apartment's price in conversation with actor Rakhi Sawant."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/akhanda-2-teaser-released-new-december-2025-release-date-intense-action-scenes-2807971-2025-10-24",
      "headline": "Akhanda 2 teaser out: Balakrishna's action-packed sequel set for December release The official teaser for 'Akhanda 2' has been released, showcasing intense action sequences. The film, starring Nandamuri Balakrishna, is directed by Boyapati Sreenu. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/munna-bhai-3-serious-development-rajkumar-hirani-fresh-concept-arshad-warsi-2807957-2025-10-24",
      "headline": "Arshad Warsi confirms Munna Bhai 3 in works, Hirani promises fresh concept Actor Arshad Warsi confirmed 'Munna Bhai 3' is under serious development by Rajkumar Hirani. Hirani aims to deliver a fresh concept for the sequel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/manish-malhotra-teases-karan-johar-not-giving-credit-kjo-jokes-paycheck-pitch-to-get-rich-jiohotstar-2807902-2025-10-24",
      "headline": "Manish Malhotra teases Karan Johar for not giving credit, KJo jokes about paycheck Fashion designer Manish Malhotra accused filmmaker Karan Johar of not giving him credit for his work on JioHotstar's 'Pitch To Get Rich'. To which, KJo joked that Malhotra is well-compensated for his work. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bill-gates-x-tulsi-virani-the-wild-story-behind-most-unexpected-crossover-on-tv-2807885-2025-10-24",
      "headline": "Bill Gates x Tulsi Virani: The wild story behind most unexpected crossover on TV In a twist no one saw coming, 'Kyunki Saas Bhi Kabhi Bahu Thi 2' featured Bill Gates casually video-chatting with Tulsi Virani. The viral episode shows nostalgia and surprise as Tulsi's speech on motherhood and nutrition catches Gates' attention online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sunjay-kapur-wife-priya-sachdev-performs-puja-amid-real-etate-property-dispute-2807907-2025-10-24",
      "headline": "Our prayer for protection: Sunjay Kapur's wife performs puja amid property dispute Late Sunjay Kapur's wife, Priya Kapur, recently performed puja with her son, Azarias and shared pictures from the auspicious occasion on social media. The puja came amid a dispute over Sunjay's property. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/amaal-mallik-bigg-boss-19-reality-show-exit-health-concerns-salman-khan-show-reports-2807831-2025-10-24",
      "headline": "Amaal Mallik to leave Bigg Boss 19 house due to health concerns: Reports Singer Amaal Mallik is likely to leave the 'Bigg Boss 19' house due to health concerns. Reports suggest he could take a temporary exit soon. The latest post by his father, Daboo Malik, has added to the exit rumours."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/india-pakistan-war-fears-2002-cia-reveals-parliament-attack-terror-role-glbs-2808112-2025-10-25",
      "headline": "We believed India, Pak would go to war in 2002: Ex-CIA whistleblower John KiriakouFormer CIA officer John Kiriakou disclosed that the US feared a war between India and Pakistan in 2002 following the Parliament attack. He highlighted Pakistan's support for terror groups."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/satara-doctor-found-deceased-amid-police-harassment-political-pressure-allegations-2807978-2025-10-24",
      "headline": "Doctor who killed herself was forced to make false reports: Cousin's big claimAfter the doctor's suicide, her cousin alleged that last year she faced significant police and political pressure, including being coerced into preparing false post-mortem reports. He added that she was also instructed to issue a \"fit and fine\" report for a patient who had not even been admitted to the hospital."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/divya-suresh-hit-and-run-case-bengaluru-woman-injured-byatarayanapura-accident-2808071-2025-10-25",
      "headline": "Kannada actor Divya Suresh rams bike with her car, woman suffers leg fractureEyewitnesses and relatives described the incident as a hit-and-run, stating that the driver did not stop to assist the victims. One of the victims was rushed to the hospital with a fractured kneecap, while the others escaped with minor injuries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-live-score-ind-vs-aus-3rd-odi-updates-2808119-2025-10-25",
      "headline": "3rd ODI LIVE: Siraj breaks opening partnership, Travis Head departsIndia (IND) vs Australia (AUS), 3rd ODI Live score and updates: Australia lose the wicket of Travis Head against the run of flow. Mohammed Siraj traps the batter at point."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nawazuddin-siddiqui-reacts-demand-8-hour-work-hour-shift-deepika-padukone-2807801-2025-10-25",
      "headline": "Exclusive: Nawazuddin Siddiqui shares his take on call for 8-hour work shiftsActor Nawazuddin Siddiqui has commented on Deepika Padukone's recent comments about 8-hour work shifts in the film industry. In an exclusive interview, Siddiqui emphasised the importance of comfortable working hours for all, without exhaustion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/investment-scams-bengaluru-delhi-ncr-hyderabad-rs-1500-crore-loss-2807740-2025-10-24",
      "headline": "30,000 people duped of Rs 1,500 crore, Bengaluru, Delhi worst hit: CentreInvestment scams have led to financial losses of over Rs 1,500 crore for more than 30,000 people in top Indian cities in the past six months. Bengaluru, Hyderabad, and Delhi-NCR account for the majority of impacted people and financial damage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/john-kiriakou-us-control-pakistan-nuclear-saudi-shield-aq-khan-revelations-glbs-2808111-2025-10-25",
      "headline": "Pervez Musharraf handed control of Pak's nukes to US: Ex-CIA officer's bombshellFormer CIA officer John Kiriakou claimed that Pakistan's former president Pervez Musharraf handed control of the country's nuclear arsenal to the United States, saying Washington \"purchased\" him with millions in aid."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/after-zohran-mamdani-hyderabad-born-democrat-ghazala-hashmi-creates-buzz-virginia-us-pakistan-migrants-2807825-2025-10-25",
      "headline": "After Mamdani, India-born Democrat Ghazala Hashmi creates buzz in USHyderabad-born Ghazala Hashmi, Virginia State Senator and former college professor, is making headlines as she vies for Virginia's Lieutenant Governor's post. The Indian-American's campaign on education, healthcare, and immigrant representation is resonating with South Asian communities, and she is leading the race."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-toss-curse-18-matches-sydney-odi-shubman-gill-2808142-2025-10-25",
      "headline": "India lose 18 ODI tosses as 0.00038 percent probability comes trueAUS vs IND, 3rd ODI: India's toss curse continued as Shubman Gill lost his third successive toss as ODI captain. India play for pride after having conceded an unbeatable 2-0 lead in the three-match series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/national-conference-rajya-sabha-seats-bjp-jammu-kashmir-election-article-370-mohammad-ramzan-sajad-kichloo-gsoberoi-2807973-2025-10-24",
      "headline": "National Conference wins 3 seats, BJP bags 1 in J&K Rajya Sabha pollsThe ruling National Conference won three Rajya Sabha seats in Jammu and Kashmir, while the opposition BJP emerged victorious on one in the first Rajya Sabha polls in J&K since the abrogation of Article 370."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/greylist-exit-not-bulletproof-global-watchdog-fatfs-warning-to-pakistan-on-terror-financing-2808115-2025-10-25",
      "headline": "Greylist exit not bulletproof: Terror watchdog warns Pakistan on money launderingThe Financial Action Task Force (FATF) has warned Pakistan that its 2022 greylist exit doesn't make it immune to terror financing, urging continued vigilance as reports surface of digital funding networks.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/no-more-hiding-new-york-mayoral-hopeful-zohran-mamdani-vows-to-embrace-muslim-identity-amid-attacks-2808114-2025-10-25",
      "headline": "No more hiding: Zohran Mamdani vows to embrace Muslim identity amid attacksNew York mayoral hopeful Zohran Mamdani vowed to embrace his Muslim identity after Andrew Cuomo and others made what he called racist and baseless attacks, fueling a debate over Islamophobia in city politics.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/introverts-heres-how-to-share-your-feelings-without-feeling-exposed-2807654-2025-10-25",
      "headline": "Introverts, here's how to share your feelings without feeling exposedHaving a lot to say but not finding the right words isn't easy, and no one understands that better than introverts. If you relate, here's how you can express yourself more easily."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/piyush-goyal-hits-back-at-western-pressure-over-russian-oil-singling-out-india-us-trade-tensions-2808030-2025-10-24",
      "headline": "Why single out India? Piyush Goyal hits back at Western pressure over Russian oilCommerce and Industry Minister Piyush Goyal's remarks come amid rising pressure from the US and its allies on India to scale back imports of discounted Russian crude."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/odisha-mangrove-restoration-nikolaj-coster-waldau-climate-resilience-documentary-2807287-2025-10-23",
      "headline": "Nikolaj Coster-Waldau spotlights Odisha's mangrove restoration in docuseries'Game of Thrones' actor and UNDP Goodwill Ambassador Nikolaj Coster-Waldau spotlights Odisha's community-led mangrove restoration in the new season of his international documentary series. The series highlights local climate resilience efforts and global cooperation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/baby-rani-maurya-car-collides-with-truct-agra-lucknow-expressway-up-minister-2808120-2025-10-25",
      "headline": "UP Minister escapes unhurt after her car collides with truck on Agra ExpresswayUP Minister Baby Rani Maurya narrowly escaped injury after her car collided with a truck on the Agra-Lucknow Expressway near Firozabad. The vehicle was damaged, but all occupants were safe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/the-female-gaze-why-women-actors-turned-directors-must-helm-indian-cinema-2807868-2025-10-25",
      "headline": "The female gaze: Why women actors-turned-directors must helm Indian cinemaA critical industry gap stifles diverse storytelling: why do women actors rarely become directors? The female gaze offers vital, nuanced counter-narratives to clichés, but patriarchal biases and commercial pressures restrict it. On Cinematic Saturday, we reflect on how to unleash this transformative force in Indian cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-537-25-10-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/uttar-pradesh/story/kanpur-dehat-nephew-kills-aunt-drunken-assault-diwali-night-2808132-2025-10-25",
      "headline": "Drunk Kanpur man beats aunt to death in fit of rage; manhunt onA woman was beaten to death by her intoxicated nephew in Kanpur Dehat on Diwali night. The accused fled the scene, prompting a police manhunt and ongoing investigation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/26-mba-surge-in-india-golden-opportunity-amid-visa-problems-abroad-2807791-2025-10-24",
      "headline": "26% MBA surge in India: Can we cash in on the opportunity amid visa woes abroad?There has been a 26% rise in MBA applications in India, shows GMAC data, as visa uncertainty in the US, UK and Canada pushes students to domestic management programmes. This could be a big win for India or a missed opportunity. Policy, capacity, and quality will decide the outcome."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-australia-womens-world-cup-top-spot-indore-clash-preview-2807990-2025-10-25",
      "headline": "India await semis rivals as South Africa aim for T20 WC heroics repeat vs AustraliaWomen's World Cup: South Africa knocked Australia out of the T20 World Cup last year and would be looking to pull off a similar performance in the 50-over format when they meet on Saturday in Indore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/election-commission-advisory-ai-generated-political-content-bihar-assembly-elections-2808098-2025-10-24",
      "headline": "Don't misuse AI in Bihar poll campaign: Election Commission's warning to partiesThe Election Commission of India has released new rules for disclosure and responsible use of AI-generated content in Bihar elections. These guidelines aim to maintain fair competition and protect voter trust in the democratic process."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-madarsa-staffer-makes-indecent-remarks-virginity-test-demand-on-minor-girl-arrested-moradabad-uttar-pradesh-police-2808100-2025-10-25",
      "headline": "Madarsa staffer makes indecent remarks, virginity test demand on minor, arrestedPolice said the allegations were found true, and one accused, Shahjahan, has been sent to jail while others are on the run. The madarsa administration denied the charges, calling them baseless."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/mahagathbandhan-tejashwi-yadav-nda-modi-bihar-polls-nitish-kumar-congress-rjd-jdu-2808126-2025-10-25",
      "headline": "Live: Amit Shah to address back-to-back rallies in Khagaria, Munger, NalandaBihar Election News Live Updates: Bihar's political battlefield heated up as both the ruling NDA and the opposition Mahagathbandhan have gone all-out with parallel rallies across the state to woo voters. Prime Minister Narendra Modi led the charge for the BJP-led coalition, addressing back-to-back rallies in Samastipur and Begusarai. He urged voters to deliver a \"record-breaking\" victory to the NDA. On the opposition side, RJD leader Tejashwi Yadav, freshly declared as the Mahagathbandhan's chief ministerial face, hit the campaign trail after days of internal rift over seat-sharing and ticket distribution. Yadav addressed a string of rallies in Patna, Muzaffarpur, Samastipur, and Vaishali, signalling that the INDIA bloc was ready for a direct contest with the NDA. Follow indiatoday.in for the latest updates."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-kuldeep-yadav-sydney-odi-prasidh-krishna-playing-xi-changes-2808145-2025-10-25",
      "headline": "AUS vs IND: Kuldeep Yadav, Prasidh Krishna finally get the nod for Sydney clash AUS vs IND: India recalled Kuldeep Yadav and brought in Prasidh Krishna for the 3rd ODI. Playing for pride in Sydney, the Men in Blue revisedtheir bowling lineup in hopes of it sparking a fightback against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-toss-curse-18-matches-sydney-odi-shubman-gill-2808142-2025-10-25",
      "headline": "India lose 18 ODI tosses as 0.00038 percent probability comes true AUS vs IND, 3rd ODI: India's toss curse continued as Shubman Gill lost his third successive toss as ODI captain. India play for pride after having conceded an unbeatable 2-0 lead in the three-match series. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/jonathan-trott-frustrated-afghanistan-cricket-board-2808127-2025-10-25",
      "headline": "Frustrated with Afghanistan Cricket Board, Trott hints at exit Afghanistan head coach Jonathan Trott is frustrated with the country's cricket board over lack of communication. The former England batter is unsure about extending his tenure beyond the T20 World Cup 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-live-score-ind-vs-aus-3rd-odi-updates-2808119-2025-10-25",
      "headline": "3rd ODI LIVE: Siraj breaks opening partnership, Travis Head departs India (IND) vs Australia (AUS), 3rd ODI Live score and updates: Australia lose the wicket of Travis Head against the run of flow. Mohammed Siraj traps the batter at point."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-australia-womens-world-cup-top-spot-indore-clash-preview-2807990-2025-10-25",
      "headline": "India await semis rivals as South Africa aim for T20 WC heroics repeat vs Australia Women's World Cup: South Africa knocked Australia out of the T20 World Cup last year and would be looking to pull off a similar performance in the 50-over format when they meet on Saturday in Indore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-india-vs-australia-michael-clarke-prediction-sydney-odi-2808084-2025-10-24",
      "headline": "Virat Kohli will be the top scorer in Sydney ODI: Michael Clarke backs India star Former Australia captain Michael Clarke has backed Virat Kohli to be the leading run-scorer and Josh Hazlewood to claim the most wickets in the final ODI of the ongoing India-Australia series at the Sydney Cricket Ground on Saturday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-kaif-shubman-gill-feels-guilty-leading-rohit-sharma-odi-captaincy-2808086-2025-10-24",
      "headline": "Shubman Gill may feel guilt of leading Rohit Sharma as ODI captain: Kaif Former cricketer Mohammed Kaif has claimed that Shubman Gill may feel guilty that he has to lead Rohit Sharma as the ODI captain of the Indian team. Gill took over as the captain of the 50-overs side from Rohit ahead of the Australia tour. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/womens-world-cup-2025-australia-vs-south-africa-anneke-bosch-press-conference-2808075-2025-10-24",
      "headline": "South Africa want to take it a step further in Women's World Cup 2025: Anneke Bosch After reaching multiple knockout stages, South Africa are aiming to go one step further at the Women's World Cup 2025, according to Anneke Bosch. The Proteas women have been on a roll since being hammered in their opening game against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-ind-3rd-odi-rohit-sharma-virat-kohli-final-odyssey-sydney-2807909-2025-10-24",
      "headline": "Can Rohit Sharma and Virat Kohli finish their Australian odyssey on a high? Rohit Sharma and Virat Kohli have returned to Sydney, the city where their Test careers ended, for what could be their final ODI in Australia. As India's cricketing legends face one last challenge at the SCG, the question remains whether they can end their Australian journey on a high."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/atp-finals-alexander-zverev-vienna-open-alcaraz-sinner-djokovic-2808068-2025-10-24",
      "headline": "Alexander Zverev secures ATP finals spot to join Alcaraz, Sinner and Djokovic Two-time ATP Finals champion Alexander Zverev booked his place in the season-ending championship by advancing to the semi-finals of the Vienna Open on Friday, marking his eighth qualification in the past nine seasons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-india-vs-australia-michael-clarke-prediction-sydney-odi-2808084-2025-10-24",
      "headline": "Virat Kohli will be the top scorer in Sydney ODI: Michael Clarke backs India star Former Australia captain Michael Clarke has backed Virat Kohli to be the leading run-scorer and Josh Hazlewood to claim the most wickets in the final ODI of the ongoing India-Australia series at the Sydney Cricket Ground on Saturday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-kaif-shubman-gill-feels-guilty-leading-rohit-sharma-odi-captaincy-2808086-2025-10-24",
      "headline": "Shubman Gill may feel guilt of leading Rohit Sharma as ODI captain: Kaif Former cricketer Mohammed Kaif has claimed that Shubman Gill may feel guilty that he has to lead Rohit Sharma as the ODI captain of the Indian team. Gill took over as the captain of the 50-overs side from Rohit ahead of the Australia tour. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/womens-world-cup-2025-australia-vs-south-africa-anneke-bosch-press-conference-2808075-2025-10-24",
      "headline": "South Africa want to take it a step further in Women's World Cup 2025: Anneke Bosch After reaching multiple knockout stages, South Africa are aiming to go one step further at the Women's World Cup 2025, according to Anneke Bosch. The Proteas women have been on a roll since being hammered in their opening game against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-ind-3rd-odi-rohit-sharma-virat-kohli-final-odyssey-sydney-2807909-2025-10-24",
      "headline": "Can Rohit Sharma and Virat Kohli finish their Australian odyssey on a high? Rohit Sharma and Virat Kohli have returned to Sydney, the city where their Test careers ended, for what could be their final ODI in Australia. As India's cricketing legends face one last challenge at the SCG, the question remains whether they can end their Australian journey on a high."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/atp-finals-alexander-zverev-vienna-open-alcaraz-sinner-djokovic-2808068-2025-10-24",
      "headline": "Alexander Zverev secures ATP finals spot to join Alcaraz, Sinner and Djokovic Two-time ATP Finals champion Alexander Zverev booked his place in the season-ending championship by advancing to the semi-finals of the Vienna Open on Friday, marking his eighth qualification in the past nine seasons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/fatima-sana-urges-icc-better-venues-womens-world-cup-rain-disruptions-2808058-2025-10-24",
      "headline": "Fatima Sana frustrated as rain washes off PAK vs SL: ICC must arrange good venuesFatima Sana urged the ICC to choose better venues after Pakistan's Women's World Cup ended without a win, with three of their matches abandoned due to rain. Fatima finished as Pakistan's leading wicket-taker with 10 scalps."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pro-kabaddi-league-season-12-playoffs-schedule-teams-live-streaming-2025-2808055-2025-10-24",
      "headline": "Pro Kabaddi League Season 12 Playoffs: Schedule and all you need to knowThe Pro Kabaddi League Season 12 Playoffs is all set to start as eight teams will battle it out for the title. Here's all you need to know about the race to the PKL title. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shan-masood-appointed-pcb-director-international-cricket-operations-2808044-2025-10-24",
      "headline": "Shan Masood asked by PCB to become Pakistan's director of international cricketThe PCB plans to give Test captain Shan Masood an added role as director of international cricket operations. He remains the top choice for the job after Misbah-ul-Haq declined, and continues to lead Pakistan in the ongoing WTC."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-trophy-saga-tilak-varma-reveals-india-pakistan-final-controversy-2808032-2025-10-24",
      "headline": "Tilak Varma recalls India's trophy-less celebration after Asia Cup final dramaIndia batter Tilak Varma has revealed what truly happened on the night of September 28, when Suryakumar Yadav's India refused to accept the title from Asian Cricket Council (ACC) chair and Pakistan Cricket Board (PCB) chief Mohsin Naqvi.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/pep-guardiola-liverpool-title-manchester-city-premier-league-race-2808026-2025-10-24",
      "headline": "Manchester City's Guardiola expects Liverpool to return to Premier League title raceManchester City manager Pep Guardiola has insisted it is too early to write off Liverpool or any other team in the Premier League title race."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/tahlia-mcgrath-womens-world-cup-south-africa-vs-australia-press-conference-2808025-2025-10-24",
      "headline": "South Africa a dangerous side, going to be a tough game: Tahlia McGrathWomen's World Cup 2025, SA vs AUS: Tahlia McGrath said that South Africa are a dangerous team and Australia won't take them lightly in their last league match on Saturday at the Holkar Stadium in Indore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-women-world-cup-rain-sri-lanka-washout-ends-winless-campaign-2808018-2025-10-24",
      "headline": "Pakistan finish Women's World Cup winless after fifth Colombo washoutWomen's World Cup, SL vs PAK: Pakistan finished their campaign without any win after their last league match against Sri Lanka at the R Premadasa Stadium in Colombo was abandoned due to rain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/atiqa-mir-f1-academy-cotfa-uae-support-2808006-2025-10-24",
      "headline": "Formula 1 academy extends support for India's racing prodigy Atiqa MirThe Formula 1 academy on Friday, October 24, announced that they're extending their support to India's racing prodigy Atiqa Mir. The 10-year-old has become the first Indian to be supported by F1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/pep-guardiola-liverpool-title-manchester-city-premier-league-race-2808026-2025-10-24",
      "headline": "Manchester City's Guardiola expects Liverpool to return to Premier League title raceManchester City manager Pep Guardiola has insisted it is too early to write off Liverpool or any other team in the Premier League title race."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/tahlia-mcgrath-womens-world-cup-south-africa-vs-australia-press-conference-2808025-2025-10-24",
      "headline": "South Africa a dangerous side, going to be a tough game: Tahlia McGrathWomen's World Cup 2025, SA vs AUS: Tahlia McGrath said that South Africa are a dangerous team and Australia won't take them lightly in their last league match on Saturday at the Holkar Stadium in Indore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-women-world-cup-rain-sri-lanka-washout-ends-winless-campaign-2808018-2025-10-24",
      "headline": "Pakistan finish Women's World Cup winless after fifth Colombo washoutWomen's World Cup, SL vs PAK: Pakistan finished their campaign without any win after their last league match against Sri Lanka at the R Premadasa Stadium in Colombo was abandoned due to rain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/atiqa-mir-f1-academy-cotfa-uae-support-2808006-2025-10-24",
      "headline": "Formula 1 academy extends support for India's racing prodigy Atiqa MirThe Formula 1 academy on Friday, October 24, announced that they're extending their support to India's racing prodigy Atiqa Mir. The 10-year-old has become the first Indian to be supported by F1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/isack-hadjar-top-contender-red-bull-2026-f1-seat-strong-rookie-season-2807988-2025-10-24",
      "headline": "Being Verstappen's Red Bull teammate is frightening, but exciting: HadjarFrench rookie Isack Hadjar has said that he is a bit frightened and excited at the same time to become the future teammate of Max Verstappen at Red Bull racing. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/harry-maguire-contract-future-manchester-united-ruben-amorim-2807989-2025-10-24",
      "headline": "Manchester United's Amorim explains reason for delay in Maguire contract talksManchester United manager Ruben Amorim has clarified why discussions over Harry Maguire's contract have yet to begin. The defender's future at Old Trafford remains uncertain, with his current deal nearing expiry and the 31-year-old free to negotiate with foreign clubs from January."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-3rd-odi-2025-predicted-xi-sydney-match-preview-2807968-2025-10-24",
      "headline": "AUS vs IND 3rd ODI Predicted XIs: Will India give Yashasvi Jaiswal a chance in Sydney?With the series done and dusted, will the Indian team management make some brave calls and bring in the fringe players into the mix. India will be battling for pride and hope to sign off from the ODI series with a win. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kane-williamson-new-zealand-future-family-balance-2027-odi-world-cup-2807950-2025-10-24",
      "headline": "Kane Williamson breaks silence on New Zealand future: I still love the gameAhead of his return to international cricket in the upcoming ODIs against England, veteran New Zealand batter Kane Williamson said that discussions about his availability for the rest of the home summer are still ongoing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-ind-3rd-odi-virat-kohli-sydney-test-prediction-2807947-2025-10-24",
      "headline": "3rd ODI: Virat Kohli faces another Sydney test. Will it end like the last one?Australia vs India, 3rd ODI: 10 months after his Test career ended in Sydney, Virat Kohli returns to the same venue facing another stern examination — this time in one-day colours. With back-to-back ducks and mounting scrutiny, the third ODI against Australia could define how the next chapter of his white-ball career unfolds, as India fight to avoid a clean sweep."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/tom-aspinall-defend-heavyweight-title-ciryl-gane-ufc-321-2807929-2025-10-24",
      "headline": "Tom Aspinall aims for undisputed heavyweight glory at UFC 321 against Ciryl GaneEngland's Tom Aspinall prepares to defend his UFC heavyweight championship against Ciryl Gane, focusing on a strategic approach amidst the unpredictability of the division."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-liverpool-injury-concerns-tactical-challenges-brentford-clash-2807905-2025-10-24",
      "headline": "Alexander Isak likely to miss Liverpool's clash against Brentford: Arne SlotLiverpool could be without the services of Alexander Isak for the clash against Brentford. Isak suffered a groin injury during the clash against Eintracht Frankfurt in the Champions League. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sarfaraz-khan-not-need-india-a-games-shardul-thakur-mumbai-ranji-trophy-2807906-2025-10-24",
      "headline": "Sarfaraz Khan doesn't need India A to play international cricket: Shardul ThakurMumbai captain Shardul Thakur has backed Sarfaraz Khan, saying he does not need India A matches to stake a claim for the national Test side. Thakur pointed to Sarfaraz's strong domestic record and ability to perform under pressure as proof of his readiness."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}