{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-q2-results-dividend-set-at-rs-10-per-share-payout-november-5-record-date-october-18-2614783-2024-10-10",
      "headline": "TCS Q2 results: Dividend set at Rs 10 per share. Check key datesTCS Q2 results: The company reported a 5% year-on-year (YoY) rise in net profit, amounting to Rs 11,909 crore, compared to Rs 11,342 crore in the corresponding quarter of the previous year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/ratan-tata-was-a-great-human-being-very-humble-narayana-murthy-2614774-2024-10-10",
      "headline": "Ratan Tata was a great human being, very humble: Narayana MurthyIn an exclusive interview with India Today TV, Infosys co-founder Narayana Murthy paid tribute to late industrialist, Ratan Tata. Murthy lauded Ratan Tata as a 'compassionate human being who transcended financial status and official power.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/ratan-tatas-legacy-as-humanitarian-bigger-than-as-industrialist-birla-group-chief-2614740-2024-10-10",
      "headline": "Ratan Tata's legacy as humanitarian bigger than as industrialist: Birla Group chiefIn an exclusive interview with India Today TV, Kumar Mangalam Birla, chairperson of the Aditya Birla Group, reflected on the life and legacy of Ratan Tata."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-q2-results-dividend-it-firm-consolidated-net-profit-up-5-percent-yoy-to-rs-11909-crore-2614736-2024-10-10",
      "headline": "TCS Q2 Results: IT firm's net profit up 5% YoY to Rs 11,909 crore The company's net profit reached Rs 11,909 crore, up from Rs 11,342 crore in the same period last year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-successor-at-tata-trusts-who-are-the-frontrunners-noel-venu-srinivasan-vijay-singh-2614721-2024-10-10",
      "headline": "Ratan Tata's successor at Tata Trusts: Who are the frontrunners?The trusts, particularly the Sir Dorabji Tata Trust and Sir Ratan Tata Trust, collectively hold 66% of Tata Sons, making them the company's primary shareholders."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-end-marginally-higher-banking-metal-stocks-shine-2614706-2024-10-10",
      "headline": "Sensex, Nifty end marginally higher; banking, metal stocks shine The S&P BSE Sensex added 144.31 points to close at 81,611.41, while the NSE Nifty50 gained 16.50 points to end at 24,998.45. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-family-tree-look-at-its-members-from-jamsetji-to-noel-tata-2614692-2024-10-10",
      "headline": "Ratan Tata family tree: Look at its members from Jamsetji to Noel TataRatan Tata was born on December 28, 1937, and belonged to one of India's most well-known business families."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-death-kumar-mangalam-birla-pays-tribute-lost-true-visionary-2614609-2024-10-10",
      "headline": "Kumar Mangalam Birla pays tribute to Ratan Tata: Lost true visionaryKumar Mangalam Birla, the Chairman of the Aditya Birla Group, expressed his sorrow and paid tribute to Ratan Tata, highlighting the long-standing relationship between their families and the impact Ratan Tata had on the nation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/star-health-confirms-data-breach-clears-ciso-of-wrongdoing-amid-hacker-claims-2614583-2024-10-10",
      "headline": "Star Health confirms data breach, clears CISO of wrongdoing amid claimsStar Health Insurance released a statement acknowledging the cyberattack. The company confirmed that it was a victim of a targeted malicious cyberattack, which led to unauthorised access to certain data."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-death-group-succession-plan-rs-3800-crore-empire-noel-tata-n-chandrasekaran-2614554-2024-10-10",
      "headline": "Ratan Tata dies: Who will lead Rs 30 lakh crore Tata Group?Ratan Tata's absence leaves a gap, and the question of succession is more important than ever, given that he had no children of his own"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-death-mumbai-tata-group-philanthropy-investments-education-technology-steel-2614512-2024-10-10",
      "headline": "Remembering Ratan Tata, a beacon of philanthropyRatan Tata death: Ratan Tata played a key role with his philanthropic efforts in various sectors, including healthcare, technology, disaster relief and social welfare. Here's how Ratan Tata made a profound impact through his philanthropy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-death-visionary-who-fuelled-indias-startup-revolution-paytm-ola-firstcry-upstox-2614508-2024-10-10",
      "headline": "Ratan Tata: The visionary who fuelled India's startup revolutionEven after his retirement, Ratan Tata continued to embody the spirit of entrepreneurship, emerging as a formidable investor and mentor to a multitude of startups across India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-q2-results-today-press-conference-doubtful-after-ratan-tatas-demise-2614473-2024-10-10",
      "headline": "TCS Q2 results today, press conference doubtful after Ratan Tata's demiseRatan Naval Tata, one of India's most influential industrialists and chairman emeritus of the Tata Group, passed away late Wednesday night at the age of 86."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-price-today-october-10-2024-precious-metals-record-hike-on-mcx-2614472-2024-10-10",
      "headline": "Gold, silver price today, October 10, 2024: Precious metals record hike on MCXGold Price Today October 10, 2024: Both gold and silver are trading on the higher side of the Multi Commodity Exchange (MCX) on Thursday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-higher-tata-shares-in-spotlight-after-ratan-tata-death-2614464-2024-10-10",
      "headline": "Sensex, Nifty open higher; Tata shares in spotlight after Ratan Tata's deathThe S&P BSE Sensex added 110.95 points to 81,578.05, while the NSE NIfty50 gained 19.80 points to 25,001.75. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/businessman-niranjan-hiranandani-ratan-tata-london-trip-pet-dog-industry-titan-dies-mumbai-2614460-2024-10-10",
      "headline": "When Ratan Tata cancelled London trip for his pet: Niranjan Hiranandani recountsRatan Tata death: Businessman Niranjan Hiranandani, who had invested in his friend Ratan Tata-backed Goodfellows, a companionship startup for senior citizens in 2022, recalled the veteran industrialist's down-to-earth nature."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-businessman-death-tata-group-legacy-tata-group-philanthropy-pm-modi-condoles-2614428-2024-10-10",
      "headline": "Ratan Tata: The titan who built a billion-dollar empire without chasing billionaire statusRatan Tata's legacy endures as a titan who built a billion-dollar empire while never appearing on any billionaire lists."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-death-condolences-pour-in-mukesh-ambani-adani-anand-mahindra-goenka-pm-modi-bid-farewell-2614417-2024-10-10",
      "headline": "Condolences pour in as India's business world bids farewell to Ratan TataThe former Tata Chairman had been undergoing treatment for a prolonged illness at Breach Candy Hospital in Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-death-passes-away-age-86-leader-who-took-tata-group-from-usd-5-billion-to-100-billion-2614413-2024-10-10",
      "headline": "Ratan Tata: Leader who took Tata Group from $5 billion to $100 billionRatan Tata took over as Chairman of Tata Sons in 1991, succeeding JRD Tata. At that time, the Tata Group was largely an Indian conglomerate with annual revenues of around $5 billion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-confirms-central-panel-ccpa-show-cause-notice-response-due-in-15-days-2614138-2024-10-09",
      "headline": "Ola Electric confirms Central panel show cause notice, response due in 15 daysThe notice accuses the company of failing to meet standards in areas concerning customer service and product advertisements."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ratan-tata-accorded-state-funeral-maharashtra-chief-minister-eknath-shinde-2614425-2024-10-10",
      "headline": "Ratan Tata cremated with state honours, hundreds gather to say goodbyeRatan Tata funeral: The Maharashtra government has declared a day of mourning as a mark of respect for Ratan Tata. The legendary business leader and chairman emeritus of Tata Sons died on Wednesday at 86."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ratan-tata-death-last-rites-state-funeral-parsi-rituals-in-mumbai-tata-group-zoroastrianism-beliefs-2614556-2024-10-10",
      "headline": "Ratan Tata's funeral held through Parsi ritualsRatan Tata funeral: Parsis do not cremate or bury their loved ones, unlike Hindus and Muslims, and they consider a human body as a gift of nature, which has to be returned."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-family-tree-look-at-its-members-from-jamsetji-to-noel-tata-2614692-2024-10-10",
      "headline": "Ratan Tata family tree: Look at its members from Jamsetji to Noel TataRatan Tata was born on December 28, 1937, and belonged to one of India's most well-known business families."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/ratan-tatas-pet-dog-goa-last-respects-industrialist-philanthropist-ratan-naval-tata-death-2614770-2024-10-10",
      "headline": "Watch: Goa, Ratan Tata's pet, pays last respects to dog-lover industrialist  Tata Sons Chairman Emeritus Ratan Tata's dog, Goa, joined scores of dignitaries who paid homage to the industrialist and philanthropist in Mumbai where his mortal remains were kept for the public to pay their last respects on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/hamne-aapka-namak-khaya-hai-ratan-noble-tata-opinion-2614698-2024-10-10",
      "headline": "Hamne aapka namak khaya hai, Ratan Noble TataRatan Naval Tata did not succumb to the acrimonious politics often associated with public figures pawing for power and pelf."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ratan-tata-dies-updates-tata-chairman-pm-modi-industrialist-2614414-2024-10-10",
      "headline": "Ratan Tata cremated with full state honours at Worli crematorium in MumbaiRatan Tata Death News Updates: Ratan Naval Tata, the former Tata Group chairman who transformed a staid group into India's largest and most influential conglomerate with a string of eye-catching deals, has died. He was 86. Tata, who was chairman of the Salt to Software group for more than two decades, breathed his last at south Mumbai's Breach Candy Hospital at 11.30 pm on Wednesday, October 9. A Padma Vibhushan recipient, Tata, was educated at Cornell University and worked on the shop floor at the family-run group after returning to India in 1962. He became chairman of Tata Industries a decade later and in 1991 took over as the chairman of the Tata Group from his uncle, JRD, who had been in charge for more than half a century."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/south-korean-author-han-kang-2024-nobel-prize-in-literature-2614722-2024-10-10",
      "headline": "South Korean author Han Kang awarded the 2024 Nobel Prize in LiteratureThis prestigious accolade marks a significant moment for Asian literature on the global stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ratan-tata-death-personal-life-never-getting-married-simi-garewal-rendezvous-2614553-2024-10-10",
      "headline": "When Ratan Tata spoke on love, loss and lonelinessIn a rare appearance on friend Simi Garewal's talk show in 1997, the business tycoon opened up about never being married and admitted that he longed for a wife and family at times. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/hurricane-milton-makes-landfall-in-us-causing-power-cuts-and-destroying-homes-2614775-2024-10-10",
      "headline": "Hurricane Milton fury hits Florida, leaves millions without powerThe storm arrived in Florida on Wednesday night, bringing along winds as fast as 205 kph. While the hurricane brought its share of chaos, it wasn't near a Category-5 hurricane that had threatened the state but went over the Gulf of Mexico. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/rafael-nadal-retirement-tennis-after-end-of-season-2614656-2024-10-10",
      "headline": "Tennis legend Rafael Nadal to retire after Davis Cup finals in NovemberRafael Nadal, one of the greatest tennis players in history, has announced his retirement, closing the chapter on a remarkable career that included 22 Grand Slam titles. The Spanish icon shared the news in an emotional video on social media, expressing heartfelt thanks for the support he received throughout his journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-death-group-succession-plan-rs-3800-crore-empire-noel-tata-n-chandrasekaran-2614554-2024-10-10",
      "headline": "Ratan Tata dies: Who will lead Rs 30 lakh crore Tata Group?Ratan Tata's absence leaves a gap, and the question of succession is more important than ever, given that he had no children of his own"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ratan-tata-reins-of-tata-group-jrd-tata-heart-attack-breach-candy-hospital-2614625-2024-10-10",
      "headline": "'You should take my place': When JRD Tata handed over firm's reins to Ratan TataRatan Tata death: In a 1997 interview with actor and talk show host Simi Garewal, Ratan Tata shared his insights on the lesser-known story of his takeover of Tata Sons, the holding company of the mammoth group."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/jammu-and-kashmir-election-result-bjp-national-conference-alliance-omar-abdullah-on-pm-modi-article-370-statehood-2614198-2024-10-10",
      "headline": "Why Omar Abdullah is leaning towards PM ModiOmar Abdullah's relentless emotional campaign saw the National Conference (NC) win 42 seats and emerge as the biggest party in Jammu and Kashmir. Now, Omar is leaning towards the Modi-led Centre to run a smooth government. Can the reconciliatory tone also bridge a divide?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/suits-shirts-only-luxury-he-allowed-himself-kumar-mangalam-birla-on-ratan-tata-2614723-2024-10-10",
      "headline": "Suits, shirts only luxury he allowed himself: Kumar Mangalam Birla on Ratan TataIn an exclusive interview with India Today TV, Kumar Mangalam Birla, chairperson of the Aditya Birla Group, paid tribute to the legendary Ratan Tata."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-successor-at-tata-trusts-who-are-the-frontrunners-noel-venu-srinivasan-vijay-singh-2614721-2024-10-10",
      "headline": "Ratan Tata's successor at Tata Trusts: Who are the frontrunners?The trusts, particularly the Sir Dorabji Tata Trust and Sir Ratan Tata Trust, collectively hold 66% of Tata Sons, making them the company's primary shareholders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/ratan-tata-was-a-great-human-being-very-humble-narayana-murthy-2614774-2024-10-10",
      "headline": "Ratan Tata was a great human being, very humble: Narayana MurthyIn an exclusive interview with India Today TV, Infosys co-founder Narayana Murthy paid tribute to late industrialist, Ratan Tata. Murthy lauded Ratan Tata as a 'compassionate human being who transcended financial status and official power.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/vettaiyan-movie-review-rajinikanth-gets-rooted-script-tj-gnanavel-middling-drama-amitabh-bachchan-rana-daggubati-fahadh-faasil-2614602-2024-10-10",
      "headline": "Vettaiyan review: Rajinikanth gets a rooted script in Gnanavel's middling dramaReleased-Thu Oct 10, 2024Vettaiyan movie review: Director TJ Gnanavel's Vettaiyan, starring Rajinikanth, Amitabh Bachchan and Rana Daggubati, is a social commentary on extrajudicial killings. Good, solid moments get overshadowed by predictability. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/murasoli-selvam-mk-stalin-brother-in-law-former-dmk-mouthpiece-editor-dies-at-85-2614662-2024-10-10",
      "headline": "Murasoli Selvam, former editor of DMK mouthpiece dies at 85MK Stalin's brother-in-law, Murasoli Selvam, has passed away at the age of 85. Deputy CM Udhayanidhi Stalin and other DMK leaders are overseeing the arrangements for his final rites."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ratan-tata-death-former-tata-employee-job-covid-pandemic-mumbai-last-rites-2614635-2024-10-10",
      "headline": "How Ratan Tata helped ex-Tata employee get his job back after call from daughterVikas Tyagi, who was laid-off from Tata after working there for 20 years due to Covid, got his job when his daughter made a call to Ratan Tata, who promptly ensured that he was reinstated to the company."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ratan-tata-mumbai-terror-attacks-taj-mahal-hotel-resilience-jamshedji-tata-2614633-2024-10-10",
      "headline": "Ratan Tata stood tall during 26/11 terror attacks despite test of resilienceCommissioned by Ratan Tata's great-grandfather Jamshedji Tata, Mumbai's iconic Taj Mahal Hotel opened its doors December 16, 1903. The Mumbai landmark was one of the two luxury hotels targeted in Mumbai during the 26/11 terror attacks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ratan-tata-revenge-ford-motors-bill-ford-insulted-indica-car-2614477-2024-10-10",
      "headline": "When Ratan Tata turned the tables on auto giant Ford after being humiliatedRatan Tata death: Ratan Tata's timely decision to not sell its fledging car division to Ford in 1999 was instrumental in Tata Motors becoming the automobile behemoth that it is today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/ratan-tatas-legacy-revolutionising-cancer-care-in-india-one-hospital-at-a-time-2614789-2024-10-10",
      "headline": "How Ratan Tata quietly transformed cancer treatment for IndiansThe Tata Group's foray into healthcare began in 1941 with the establishment of the Tata Memorial Hospital in Mumbai. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/uk-news/story/bbc-apologises-for-data-glitch-that-led-to-incorrect-weather-forecast-in-uk-2614663-2024-10-10",
      "headline": "BBC apologises for data glitch that led to incorrect weather forecast in UKA data glitch reportedly led to the wrong weather forecast on the BBC's website and app following which it showed extreme weather and temperatures for several UK cities."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/hyderabad-court-notice-konda-surekha-defamation-case-naga-chaitanya-divorce-case-2614708-2024-10-10",
      "headline": "Court notice to Telangana minister over Samantha-Naga Chaitanya divorce remarksA Nampally Magistrate Court in Hyderabad heard testimony from a second witness in a criminal defamation case filed against Telangana Minister Konda Surekha. The court demanded minister Surekha for an explanation and adjourned the hearing to October 23. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/will-rajinikanths-vettaiyan-satisfy-his-loyal-fans-2614636-2024-10-10",
      "headline": "Will Rajinikanth's Vettaiyan satisfy his loyal fans?Vettaiyan showcases Rajinikanth's character navigating moral dilemmas, raising questions about justice and societal norms, but the presentation is more story-driven than a fan-service mass commercial film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dhanush-watches-vettaiyan-with-rajinikanth-family-at-chennai-theatre-watch-viral-video-2614778-2024-10-10",
      "headline": "Dhanush watches Vettaiyan with Rajinikanth's family at Chennai theatreSuperstar Rajinikanth's family, including his wife and daughter, watched his film Vettaiyan at a theatre in Chennai. Dhanush was also present during the same screening. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/martin-scorsese-on-his-retirement-plans-after-frank-sinatra-biopic-2614733-2024-10-10",
      "headline": "Director Martin Scorsese on his retirement plans after Sinatra biopicAcclaimed director Martin Scorsese recently opened up about his retirement plans. Earlier reports had claimed that the director intends to retire after having completed the Frank Sinatra biopic. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/video/thalapathy-vijay-watches-rajinikanths-vettaiyan-in-chennai-theatre-2614734-2024-10-10",
      "headline": "Video: Thalapathy Vijay watches Rajinikanth's Vettaiyan in Chennai theatre Thalapathy Vijay arrived at the iconic Devi theatre in Chennai to catch the first-day first-show of Rajinikanth's recently released film, Vettaiyan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/mozilla-firefox-users-beware-your-device-is-at-high-risk-and-here-is-how-you-can-fix-it-2614751-2024-10-10",
      "headline": "Mozilla Firefox users beware, your device is at high risk and here is how you can fix it  The Indian Computer Emergency Response Team has alerted Mozilla users about serious vulnerabilities that threaten device security. The government has asked these users to immediately update their software to mitigate risks posed by these flaws."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/oppo-find-x8-series-rumoured-to-feature-a-mediatek-dimensity-9400-with-ai-engine-2614696-2024-10-10",
      "headline": "Oppo Find X8 series rumoured to feature a MediaTek Dimensity 9400 with AI engine Oppo Find X8 is tipped to feature advanced AI features and a sleek design.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/features/story/openai-eyes-profit-may-restructure-itself-into-a-for-profit-entity-to-avoid-hostile-takeover-over-leaderships-2614707-2024-10-10",
      "headline": "OpenAI eyes profit, may restructure from non-profit to a for-profit entitySam Altman's OpenAI is reportedly planning to restructure the company into a for-profit entity. This has apparently been done so that the non-profit that currently looks over OpenAI can not do a \"hostile takeover\" over the leadership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/video/iphone-16-full-review-heres-why-its-a-worthy-upgrade-2614678-2024-10-10",
      "headline": "iPhone 16 full review: Here's why it's a worthy upgradeThe iPhone 16 promises to be an all-rounder in terms of performance and camera. With the new A18 chipset, does it have what it takes to become the smartphone of the year in 2024? Watch the full video to find out. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-coco-gauf-rafael-nadal-cristiano-ronaldo-2614786-2024-10-10",
      "headline": "Rafael Nadal retires: How Tennis fraternity paid tribute to Spanish legendEntire sporting fraternity paid tribute to the Tennis Legend Rafael Nadal as he announced his retirement from the game. Nadal will play his last game in the Davis Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-captain-fatima-sana-father-death-2614776-2024-10-10",
      "headline": "Pakistan captain Fatima Sana to return home after father diesWomen's T20 World Cup 2024: Captain Fatima Sana is likely to miss Pakistan's next game against Australia as she is set to return home following the death of her father. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/rafael-nadal-retirement-cristiano-ronaldo-wishes-real-madrid-2614753-2024-10-10",
      "headline": "Cristiano Ronaldo wishes retiring Rafael Nadal: Honour to witness your journeyRafael Nadal retirement: Football legend Cristiano Ronaldo took to social media to pay his tribute to Rafael Nadal, who announced he would retire in November after the Davis Cup Finals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-pak-vs-eng-1st-test-multan-harry-brook-joe-root-2614745-2024-10-10",
      "headline": "Babar Azam trolled after twin failures vs England: 'Can't even score on highways'Babar Azam's twin failures in the first Test against England has drawn a strong reaction from fans on social media. Babar has gone 18 consecutive innings without a 50+ score in Tests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/rafael-nadal-retires-king-of-clays-glorious-career-in-numbers-2614720-2024-10-10",
      "headline": "Rafael Nadal retires: King of Clay's glorious career in numbers Rafael Nadal said that he will retire from professional tennis after the Davis Cup knockout stage later this year, pulling the curtains down on his 23-year-long career. Nadal turned professional in 2001 and went on to win 22 Grand Slam singles titles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/roger-federer-on-retiring-rafael-nadal-i-hoped-this-day-would-never-come-2614702-2024-10-10",
      "headline": "I hoped this day would never come: Federer on retiring NadalRoger Federer heaped praise on Rafael Nadal after the latter announced the Davis Cup Finals later this year in November in Malaga will be his last at the professional level. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/rafael-nadal-retirement-statement-in-full-video-davis-cup-2614699-2024-10-10",
      "headline": "Rafael Nadal retirement statement in full: Leave with absolute peace of mindRafael Nadal has announced his retirement from tennis at the conclusion of the 2024 season on October 10, Thursday. Nadal will leave the sport at the end of the Davis Cup 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/rafael-nadals-retirement-sends-fans-into-breakdown-undefeatable-spirit-of-tennis-2614673-2024-10-10",
      "headline": "Rafael Nadal's retirement sends fans into breakdown: Undefeatable spirit of TennisLegendary Tennis Player Rafael Nadal announced his retirement from the game on October 10, 2024. Nadal will play his last game in the upcoming Davis Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/rafael-nadal-retirement-tennis-after-end-of-season-2614656-2024-10-10",
      "headline": "Tennis legend Rafael Nadal to retire after Davis Cup finals in NovemberRafael Nadal, one of the greatest tennis players in history, has announced his retirement, closing the chapter on a remarkable career that included 22 Grand Slam titles. The Spanish icon shared the news in an emotional video on social media, expressing heartfelt thanks for the support he received throughout his journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/1st-test-england-823-vs-pakistan-4th-highest-team-total-brook-triple-hundred-2614648-2024-10-10",
      "headline": "England post 4th-highest team total in Test cricket history after Brook 317England posted 823 for 7, the fourth highest team score in the history of Test cricket during the first match against Pakistan in Multan on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indian-players-are-best-in-world-they-bat-well-in-all-conditions-taskin-ahmed-2614617-2024-10-10",
      "headline": "Indian players are best in world, they bat well in all conditions: Taskin AhmedBangladesh pacer Taskin Ahmed said Indian players are the best in the world and can bat well in any conditions while conceding that batting frailties have let down the visitors in the T20I series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/rafael-nadal-retirement-statement-in-full-video-davis-cup-2614699-2024-10-10",
      "headline": "Rafael Nadal retirement statement in full: Leave with absolute peace of mindRafael Nadal has announced his retirement from tennis at the conclusion of the 2024 season on October 10, Thursday. Nadal will leave the sport at the end of the Davis Cup 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/rafael-nadals-retirement-sends-fans-into-breakdown-undefeatable-spirit-of-tennis-2614673-2024-10-10",
      "headline": "Rafael Nadal's retirement sends fans into breakdown: Undefeatable spirit of TennisLegendary Tennis Player Rafael Nadal announced his retirement from the game on October 10, 2024. Nadal will play his last game in the upcoming Davis Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/rafael-nadal-retirement-tennis-after-end-of-season-2614656-2024-10-10",
      "headline": "Tennis legend Rafael Nadal to retire after Davis Cup finals in NovemberRafael Nadal, one of the greatest tennis players in history, has announced his retirement, closing the chapter on a remarkable career that included 22 Grand Slam titles. The Spanish icon shared the news in an emotional video on social media, expressing heartfelt thanks for the support he received throughout his journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/1st-test-england-823-vs-pakistan-4th-highest-team-total-brook-triple-hundred-2614648-2024-10-10",
      "headline": "England post 4th-highest team total in Test cricket history after Brook 317England posted 823 for 7, the fourth highest team score in the history of Test cricket during the first match against Pakistan in Multan on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indian-players-are-best-in-world-they-bat-well-in-all-conditions-taskin-ahmed-2614617-2024-10-10",
      "headline": "Indian players are best in world, they bat well in all conditions: Taskin AhmedBangladesh pacer Taskin Ahmed said Indian players are the best in the world and can bat well in any conditions while conceding that batting frailties have let down the visitors in the T20I series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-harry-brook-2nd-fastest-triple-hundred-multan-test-2614618-2024-10-10",
      "headline": "Harry Brook scores 310-ball triple century, 2nd fastest in Test historyPakistan vs England: Harry Brook beat Matthew Hayden's record to score the second-fastest triple hundred on Day 4 of the Multan Test on October 10, Thursday. Brook became the 6th England batter to score a triple hundred in Tests. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-brian-lara-400-harry-brook-multan-test-joe-root-2614613-2024-10-10",
      "headline": "Lara's Record? Jos Buttler ponders if Root or Brook will target 400 in Multan TestPakistan vs England, 2nd Test: England white-ball captain Jos Buttler pondered the chances of Brian Lara's Test record getting broken when Joe Root and Harry Brook were tormenting the Pakistan bowlers on Day 4 of the Multan Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/hockey-india-league-2024-25-auction-list-harmanpreet-singh-salima-tete-2614605-2024-10-10",
      "headline": "Hockey India League: Harmanpreet Singh leads auction list of over 1000 starsIndia captains Harmanpreet Singh and Salima Tete leads the auction list that features more than 1000 stars who have registered for the upcoming Hockey India League 2024-25, which will begin from October 13 in Delhi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tom-latham-new-zealand-captaincy-rebrand-test-team-india-tour-2614597-2024-10-10",
      "headline": "Captain Tom Latham hopes to rebrand New Zealand's Test team during India tourThe New Zealand Test captain, Tom Latham, is excited to transition from \"caretaker\" to full-time leader, eager to put his \"own spin on things\" starting with the upcoming India tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-nitish-reddy-gautam-gambhir-coach-bowling-heroics-delhi-t20is-2614584-2024-10-10",
      "headline": "Nitish Reddy recalls Gautam Gambhir's advice after bowling heroics in Delhi T20IIndia vs Bangladesh, 2nd T20I: Nitish Kumar Reddy won the Player of the Match award in just his second T20I. He smashed 34-ball 74 and picked up two wickets in India's 86-run victory in New Delhi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-trolled-for-dropping-joe-root-easy-catch-during-1st-test-2614576-2024-10-10",
      "headline": "Babar, it hurts: Fans troll Pakistan batter for dropping Joe Root's easy catchPakistan vs England: Pakistan fans slammed star batter Babar Azam for dropping an easy catch of England's Joe Root on Day 4 of the ongoing first Test in Multan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-1st-test-harry-brook-double-hundred-joe-root-multan-2614564-2024-10-10",
      "headline": "After Joe Root, Harry Brook hits double hundred in record partnership for EnglandAfter Joe Root, Harry Brook scored his maiden double hundred as England piled on the misery on Pakistan in the Multan Test. Brook continued his fine run of form against Pakistan with the knock. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-2nd-t20i-nitish-kumar-reddy-hardik-pandya-delhi-2614547-2024-10-10",
      "headline": "India want Nitish Kumar Reddy to compliment Hardik Pandya: Aakash ChopraAakash Chopra feels that Nitish Kumar Reddy is being fast tracked by India to be an all-rounder who would Hardik Pandya in the team. Nitish was the star of the show in India's thumping win in the 2nd T20I. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-nitish-reddy-gautam-gambhir-coach-bowling-heroics-delhi-t20is-2614584-2024-10-10",
      "headline": "Nitish Reddy recalls Gautam Gambhir's advice after bowling heroics in Delhi T20IIndia vs Bangladesh, 2nd T20I: Nitish Kumar Reddy won the Player of the Match award in just his second T20I. He smashed 34-ball 74 and picked up two wickets in India's 86-run victory in New Delhi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-trolled-for-dropping-joe-root-easy-catch-during-1st-test-2614576-2024-10-10",
      "headline": "Babar, it hurts: Fans troll Pakistan batter for dropping Joe Root's easy catchPakistan vs England: Pakistan fans slammed star batter Babar Azam for dropping an easy catch of England's Joe Root on Day 4 of the ongoing first Test in Multan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-1st-test-harry-brook-double-hundred-joe-root-multan-2614564-2024-10-10",
      "headline": "After Joe Root, Harry Brook hits double hundred in record partnership for EnglandAfter Joe Root, Harry Brook scored his maiden double hundred as England piled on the misery on Pakistan in the Multan Test. Brook continued his fine run of form against Pakistan with the knock. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-2nd-t20i-nitish-kumar-reddy-hardik-pandya-delhi-2614547-2024-10-10",
      "headline": "India want Nitish Kumar Reddy to compliment Hardik Pandya: Aakash ChopraAakash Chopra feels that Nitish Kumar Reddy is being fast tracked by India to be an all-rounder who would Hardik Pandya in the team. Nitish was the star of the show in India's thumping win in the 2nd T20I. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nepal-vs-canada-hp-commentator-racist-remark-viral-video-backlash-2614536-2024-10-10",
      "headline": "Commentator makes racist remark against Nepal cricketer, faces backlash from fansIn a video that is going viral on social media, a commentator can be heard making a racist remark against Nepal cricketers. Fans of the Nepal cricket team have urged the cricket administrators to take action against the commentator. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-joe-root-double-hundred-multan-virat-kohli-20000-runs-2614499-2024-10-10",
      "headline": "Root hits double hundred in Multan Test, emulates Virat with 20,000 runs Pakistan vs England, 2nd Test: Joe Root hit his sixth Test double hundreds, going past Alastair Cook in another elite England list. Root became only the second active cricketer to go past 20,000 runs in international cricket. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-bangladesh-2nd-t20i-rinku-singh-press-conference-gautam-gambhir-delhi-2614490-2024-10-10",
      "headline": "Gautam Gambhir has given us full freedom to play our natural game: Rinku SinghRinku Singh has opened up about Gautam Gambhir's coaching style and claimed that the Indian coach has given the team full freedom to play their natural game. India have won 5 out of 5 matches in T20Is under Gambhir."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/former-sheffield-united-defender-george-baldock-found-dead-in-swimming-pool-2614481-2024-10-10",
      "headline": "Former Sheffield United defender George Baldock found dead in swimming poolFormer Sheffield United defender George Baldock was found dead in a swimming pool at his home on October 9. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}