{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/top-gainers-losers-stock-market-sensex-nifty-nse-bse-shares-it-auto-trump-tariff-2700664-2025-03-28",
      "headline": "Sensex, Nifty closing: Top stocks that gained and lost on BSE, NSEIT and auto sector stocks dragged the market down. The fall in IT and auto stocks is linked to concerns over US reciprocal tariffs, which are set to come into effect on April 2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/thailand-stock-exchange-halts-trading-after-earthquake-hits-myanmar-2700603-2025-03-28",
      "headline": "Thailand stock exchange halts trading after earthquake hits MyanmarFollowing tremors from the Myanmar earthquake, the Stock Exchange of Thailand suspended all trading for the Friday afternoon session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/da-hiked-by-2-percent-how-much-salary-will-central-government-employees-get-2700579-2025-03-28",
      "headline": "DA hiked by 2%: Here's how much central government employees will earn nowWith the 2% hike, DA has now risen from 53% to 55%. Pensioners will also experience a similar increase in their Dearness Relief (DR)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-ends-191-points-lower-nifty-settles-above-23500-it-stocks-tumble-2700566-2025-03-28",
      "headline": "Sensex, Nifty end FY25 on a weak note as Trump tariffs weigh on Dalal StreetThe S&P BSE Sensex lost 191.51 points to close at 77,414.92, while the NSE Nifty50 was down 72.60 points to end at 23,519.35.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tracking-india-billionaire-growth-from-2014-to-2025-massive-surge-hurun-rich-list-2025-key-data-explained-2700554-2025-03-28",
      "headline": "How India saw a billionaire boom in just 10 yearsIndia's billionaire club isn't just growing—it's thriving. A decade ago, cracking this list was a rare feat. Now, it's happening faster than ever. Even with market swings and economic headwinds, the country keeps adding new names to its billionaire ranks."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/cabinet-approves-da-hike-salary-government-employees-2700544-2025-03-28",
      "headline": "Salary boost for central government employees, DA hiked by 2%With this revision, DA will rise from 53% to 55%, offering a salary boost to employees. The last DA increase took place in July 2024, when it was raised from 50% to 53%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/missed-tax-deducted-at-source-tds-on-rent-here-is-what-tax-department-is-doing-2700536-2025-03-28",
      "headline": "Missed TDS on rent? Here's what tax department is doingThe law requires tenants to deduct TDS at 2% on rent above Rs 50,000 per month, in case the landlord is a resident Indian. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-bilateral-talk-offers-to-lower-us-farm-tariffs-strengthen-trade-ties-diary-report-2700508-2025-03-28",
      "headline": "India offers to lower US farm tariffs, looks to strengthen trade ties: ReportIndia-US trade talk: The government has proposed reducing import duties on several US agricultural products, including almonds, walnuts, cranberries, pistachios, and lentils. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-falling-on-march-28-3-things-explained-for-retail-investors-2700495-2025-03-28",
      "headline": "Why is stock market falling today? 3 things investors need to knowThe S&P BSE Sensex was down 339.66 points to 77,266.77 at 1:13 pm and the NSE Nifty50 traded 100.45 points lower to trade at 23,491.50. Here are three important points retail investors need to know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hurun-global-rich-list-india-billionaire-more-money-saudi-arabia-gdp-mukesh-ambani-adani-roshni-nadar-2700490-2025-03-28",
      "headline": "India's billionaires have wealth bigger than Saudi Arabia's GDP. Check detailsIndia's billionaires now have a combined wealth that exceeds the entire economy of Saudi Arabia. India ranks third globally in the number of billionaires, behind the United States and China."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/health-insurance-claim-rejected-5-common-mistakes-to-avoid-2700418-2025-03-28",
      "headline": "Health insurance rejected? Here are 5 things you need to knowUnderstanding why health insurance claims are rejected is important as it will help you avoid unnecessary stress or financial burden during medical emergencies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-sukanya-samriddhi-yojana-ssy-help-save-rs-20-lakh-in-15-years-for-your-daughter-education-2700387-2025-03-28",
      "headline": "How this scheme can help you save Rs 20 lakh in 15 years for daughterIf you are planning for your daughter's higher education expenses, the Sukanya Samriddhi Yojana (SSY) can be a great savings option."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hurun-global-rich-list-india-youngest-billionaire-razorpay-founders-harshil-mathur-shashank-kumar-age-34-2700382-2025-03-28",
      "headline": "Razorpay's Shashank Kumar, Harshil Mathur become India's youngest billionairesHarshil Mathur and Shashank Kumar met at IIT Roorkee, where they shared an interest in technology and problem-solving. Their journey into fintech began in 2014 when they launched Razorpay to simplify digital payments in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-bell-sensex-opens-30-points-lower-nifty-flat-in-early-trade-infosys-mahindra-down-up-to-3-percent-2700328-2025-03-28",
      "headline": "Sensex, Nifty fall in early trade over Trump tariff threats; Infosys down 2%The S&P BSE Sensex lost 282.59 points to 77,323.84, while the NSE Nifty50 was down 84.70 points to 23,507.25 as of 9:42 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bank-services-unavailable-on-march-31-fund-transfer-cash-deposit-withdrawal-rtgs-neft-financial-year-end-2700325-2025-03-28",
      "headline": "Planning a bank transfer on March 31? Here's why it may not workWhile banks will remain open, transactions like fund transfers, cash deposits, and withdrawals may not go through."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-on-march-28-infosys-tata-motors-bel-adani-power-hcltech-and-more-2700293-2025-03-28",
      "headline": "Stocks to watch today: Infosys, Tata Motors, BEL, Adani Power, HCLTech and moreMarkets are set for a strong start on March 6 as key stocks like Infosys, Tata Motors, and Adani Power grab attention. Trade talks, global deals, and company moves could shape today's trading session. Here's what investors need to know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-prediction-on-march-28-sensex-nifty-trends-expert-view-key-factors-2700290-2025-03-28",
      "headline": "Sensex, Nifty today: Will positive run continue on stock market?Stock market opening today: The Sensex and Nifty gained in the previous session amid reports of positive talks between Indian and US officials about a trade deal. Analysts have noted that the focus during today's trading session will be on upcoming tariff developments and the India-US trade deal outcome.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-suspends-wto-financial-contributions-report-glbs-2700200-2025-03-27",
      "headline": "US suspends WTO financial contributions: ReportThe Trump administration has reportedly suspended financial contributions to The World Trade Organisation amid efforts to cut back government spending."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-drifts-as-auto-tariffs-hurt-gm-help-tesla-and-others-glbs-2700188-2025-03-27",
      "headline": "Wall Street drifts as auto tariffs hurt GM, help Tesla and othersDonald Trump's auto tariffs impacted Wall Street on Thursday morning, with autogiant General Motors falling by 6.8%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trumps-25-auto-tariff-which-indian-companies-will-pay-the-price-glbs-2700039-2025-03-27",
      "headline": "Trump's 25% auto tariff: Which Indian companies will pay the priceUS President Donald Trump's 25% tariff on car imports will affect a few Indian companies, including Tata Motors, Eicher Motors, and Samvardhana Motherson. These firms ship components to the US and Europe's markets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-sensex-nifty-close-higher-top-gainers-and-losers-donald-trump-tariff-impact-and-more-2700007-2025-03-27",
      "headline": "Sensex, Nifty close higher: Top gainers and losers, tariff impact and key driversStock market today: Some of the top gainers during today's session were Bajaj Finserv, IndusInd Bank, NTPC, L&T, Ultratech Cement, Hero MotoCorp, Adani Enterprises and BPCL. On the other hand, some of the top losers were Tata Motors, Sun Pharma, Eicher Motors, Apollo Hospitals, Bharti Airtel, Kotak Mahindra Bank and HCLTech."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-ends-318-points-higher-nifty-just-below-23600-tata-motors-down-5-2699968-2025-03-27",
      "headline": "Sensex ends 318 points higher, Nifty just below 23,600; Tata Motors down 5%Stock market closing bell: The S&P BSE Sensex ended 317.93 points higher at 77,606.43, while the NSE Nifty50 rose 105.10 points to settle at 23,591.95."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/noida-greater-noida-flats-to-get-costlier-registration-fees-increase-20-30-percent-2699948-2025-03-27",
      "headline": "Noida, Greater Noida flat registration fees may rise 20-30%According to a draft notification, circle rates in Noida could see a 20% hike, while in Greater Noida, the increase may go up to 30%. The move is expected to make property transactions more expensive in the region."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-may-receive-reprieve-from-proposed-us-tariffs-sources-2699915-2025-03-27",
      "headline": "India may receive reprieve from proposed US tariffs: SourcesIndia may escape the proposed US tariffs and avoid being grouped with nations like China, Mexico, and Canada, according to government sources. Trade talks between the two countries are progressing smoothly, with no signs of a deadlock as the April 2 deadline for US reciprocal tariffs approaches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-may-double-investment-limit-to-10-percent-for-foreign-individual-investors-2699886-2025-03-27",
      "headline": "RBI may double foreign individual investor limit to 10% in listed firms: ReportForeign portfolio investors (FPIs), pressured by poor earnings, high valuations and prospects of U.S. tariffs, have pulled more than $28 billion out of Indian stocks since September's record high in the benchmark NSE Nifty 50."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hurun-global-rich-list-2025-elon-musk-is-worlds-richest-person-jeff-bezos-and-mark-zuckerberg-among-top-10-billionaires-2699860-2025-03-27",
      "headline": "Elon Musk leads Hurun Global Rich List despite $100 billion drop in net worthElon Musk has reretained his position as the wealthiest person in the world for the fourth time in five years, becoming the first individual to surpass the $400 billion threshold, noted the Hurun Research report."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-united-states-reciprocal-tariff-talks-eyes-big-relief-may-not-be-clubbed-china-mexico-canada-sectors-2699822-2025-03-27",
      "headline": "US tariff reprieve for India, may not be treated like China, Canada, Mexico: SourcesTrade talks between the two nations are progressing smoothly, with no deadlock expected before the April 2 deadline for US reciprocal tariffs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-terminates-30-45-more-trainees-from-mysuru-campus-offers-alternative-career-options-2699797-2025-03-27",
      "headline": "Infosys terminates more trainees from Mysuru campus, but offers…: ReportInfosys has terminated more trainees from its Myrusu campus. The IT giant had terminated hundreds of trainees from the same campus just two months ago. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-motors-shares-down-falls-6-percent-why-is-stock-falling-trump-tarriff-us-car-imports-2699787-2025-03-27",
      "headline": "Tata Motors shares slump as US slaps 25% duty on car importsTata Motors stock price: Tata Motors shares slumped 6% in early trade and were trading 5.26% lower at Rs 670.70 on the Bombay Stock Exchange (BSE) at 9.55 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-update-sensex-nifty-open-lower-amid-us-tariff-uncertainty-wipro-trent-gain-nearly-2-percent-2699764-2025-03-27",
      "headline": "Sensex, Nifty gain after opening lower in volatile trade; Wipro rises nearly 2%Stock market opening: While the Sensex opened 100 points lower, it was trading 64.27 points higher at 77,552.77 at around 9.26 am. The Nifty50 was trading 16.75 points higher at 23,503.60."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/top-stocks-to-watch-on-march-27-wipro-bandhan-bank-infosys-vedanta-upl-and-more-2699760-2025-03-27",
      "headline": "Top stocks to watch today: Tata Motors, Wipro, JB Chemicals, Infosys, Vedanta, UPLWhile positive cues are likely to support the two leading indices on Dalal Street, US tariff uncertainty looms large. Here are some of the key stocks that will be in focus today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-expectations-march-27-sensex-nifty-today-nse-bse-dalal-street-2699718-2025-03-27",
      "headline": "Stock market on March 27: What to expect from Sensex, Nifty today?Stock market prediction: Nifty and Sensex have gained nearly 2% in the past five sessions, but investors will now be watching to see if the market can recover from Wednesday's drop."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-manufacturing-hub-permanent-player-in-global-value-chain-gvc-economic-growth-2699713-2025-03-27",
      "headline": "How can India cement its position in the global value chain?With global value chains (GVCs) driving over 70% of international trade, India's growth story hinges on its ability to integrate into and scale within these networks."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/tesla-to-enter-saudi-arabia-as-elon-musk-mends-rift-with-kingdom-glbs-2699679-2025-03-26",
      "headline": "Tesla to enter Saudi Arabia as Elon Musk mends rift with kingdomAmerican EV giant Tesla announced its entry into the Saudi Arabian market after company CEO Elon Musk's relations with the Kingdom improved in recent months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/upi-down-payments-glitch-hits-several-paytm-google-pay-phonepe-users-across-india-npci-technical-glitch-resolved-2699609-2025-03-26",
      "headline": "UPI outage hits several users across India, NPCI says issue resolvedThe National Payments Corporation of India (NPCI) acknowledged the issue, stating that it was caused by intermittent technical difficulties, resulting in partial transaction failures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-is-drifting-again-after-getting-whipsawed-for-weeks-glbs-2699577-2025-03-26",
      "headline": "Wall Street is drifting again after getting whipsawed for weeksThe New York Stock Exchange saw a steady opening on Wednesday with marginal drops for S&P 500 and the Nasdaq composite."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/cancer-diabetes-antibiotics-medicine-controlled-government-to-get-costlier-2699576-2025-03-26",
      "headline": "Cancer, diabetes drugs under government price control to get costlier: SourcesGovernment-controlled medicines, including that of cancer, diabetes, heart-related concerns and other antibiotics, are set to become more expensive by 1.7 per cent, government sources told India Today TV's sister publication, Business Today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-top-gainers-losers-bse-nse-sensex-nifty-shares-2699443-2025-03-26",
      "headline": "Stock market closing: Top gainers and losers on Sensex, NiftyBenchmark indices snapped their seven-day winning streak, as investors turned cautious ahead of the monthly expiry. The S&P BSE Sensex dropped 728.69 points to close at 77,288.50, while the NSE Nifty50 fell 181.80 points, ending the session at 23,486.85."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/india-may-lower-duties-on-harley-davidson-bikes-bourbon-whiskey-sources-2699423-2025-03-26",
      "headline": "India may lower duties on Harley-Davidson bikes, bourbon whiskey: SourcesIndia may further reduce import duties on Harley-Davidson motorcycles, US wines, and bourbon whiskey as part of ongoing India-US trade talks, according to sources. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-tumbles-over-700-points-nifty-settles-below-23500-indusind-bank-jumps-3-percent-2699400-2025-03-26",
      "headline": "Sensex tumbles over 700 points, Nifty settles below 23,500; IndusInd Bank up 3%Stock market closing bell: The S&P BSE Sensex ended 728.69 points lower to 77,288.50,  while the NSE Nifty50 declined 181.80 points to settle at 23,486.85."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/will-smith-addresses-oscars-slap-in-new-album-chris-rock-2700877-2025-03-28",
      "headline": "Will Smith addresses Chris Rock Oscars slap in new albumWill Smith's latest album, Based on a True Story, dives into the controversy surrounding his Oscars slap incident. During Oscars 2022, Will slapped Chris Rock when the latter cracked a joke on Will's wife, Jada Pinkett-Smith."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/chris-brown-announces-2025-breezy-bowl-xx-tour-dates-tickets-more-glbs-2700854-2025-03-28",
      "headline": "Chris Brown announces 2025 Breezy Bowl XX tour: Dates, tickets & moreChris Brown announces his 2025 Breezy Bowl XX Stadium Tour, celebrating 20 years in music. The tour spans Europe and North America, with tickets expected to sell out fast.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/megan-fox-vs-machine-gun-kelly-who-has-the-higher-net-worth-glbs-2700853-2025-03-28",
      "headline": "Megan Fox vs. Machine Gun Kelly: Who has the higher net worth Megan Fox and Machine Gun Kelly welcomed a baby girl amid their turbulent relationship. With MGK's $25 million fortune exceeding Megan's $8 million net worth, his music and investments give him the financial edge.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/manoj-bajpayee-confirms-jaideep-ahlawat-the-family-man-3-november-release-2700851-2025-03-28",
      "headline": "The Family Man 3: Manoj Bajpayee confirms Jaideep Ahlawat in cast, November releaseManoj Bajpayee has confirmed Jaideep Ahlawat's inclusion in The Family Man 3. He also said that the show will premiere on Prime Video in November. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/maren-morris-new-single-carry-me-through-kicks-off-dreamsicle-era-glbs-2700844-2025-03-28",
      "headline": "Maren Morris' new single 'carry me through' kicks off Dreamsicle eraCountry star Maren Morris unveils Carry Me Through, a soulful anthem from her upcoming album Dreamsicle. Set for release on May 9, it follows a year of personal and artistic reinvention.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/kanye-west-sued-for-unauthorised-sample-after-refusing-clearance-over-antisemitism-glbs-2700828-2025-03-28",
      "headline": "Kanye West sued for unauthorised sample after refusing clearance over antisemitismGerman singer Alice Merton sues Kanye West for using her song Blindside without permission in Gun to My Head."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/chiyaan-vikram-veera-dheera-sooran-release-delay-not-due-to-financial-issues-says-producer-2700822-2025-03-28",
      "headline": "Vikram's Veera Dheera Sooran release delay not due to financial issues: ProducerVeera Dheera Sooran's producer addressed the release delay of the film. He wrote on X how it was not due to financial issues. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/avengers-doomsday-marvels-bet-on-nostalgia-or-beginning-of-another-end-game-2700574-2025-03-28",
      "headline": "Avengers Doomsday: Marvel's bet on nostalgia or beginning of another end-game?Avengers Infinity Saga - Infinity War and Endgame - had huge impact on cinema when they released. But will the upcoming Avengers film - Avengers Doomsday - hold the same effect?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shivangi-joshi-sends-love-to-boyfriend-kushal-tandon-on-his-40th-birthday-2700791-2025-03-28",
      "headline": "Shivangi Joshi sends love to boyfriend Kushal Tandon on his 40th birthdayOn actor Kushal Tandon's birthday, his girlfriend Shivangi Joshi showered him with love through a heartfelt wish. The actor turned 40 on March 28.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ananya-panday-as-dilreet-gill-in-akshay-kumars-kesari-2-2700774-2025-03-28",
      "headline": "Ananya Panday as Dilreet Gill in Akshay Kumar's Kesari 2. Makers share new postersActor Ananya Panday has been officially announced as part of the cast for the upcoming Hindi film Kesari Chapter 2. On Friday, the makers unveiled brand-new posters featuring Panday to make the announcement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/mad-square-review-a-wacky-fun-sequel-lacks-the-magic-of-mad-2700727-2025-03-28",
      "headline": "Mad Square review: A wacky fun sequel, but lacks the magic of MadReleased-Fri Mar 28, 2025Even before its release, Mad Square promised a laughter-packed ride without logic or intricate storytelling. While it delivers fun moments and retains the quirky energy of its prequel, the film struggles with inconsistent humour, underdeveloped character arcs, and a stretched second half. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/adolescence-through-jamie-miller-eyes-highs-and-lows-of-a-teenager-emotions-2700711-2025-03-28",
      "headline": "Adolescence through Jamie Miller's eyes: Highs and lows of a teenager's emotionsNetflix's critically acclaimed show, 'Adolescence' portrays the layers of adolescence through its celebrated lead actor, teenager - debutante Owen Cooper. We highlight the array of emotions that the show tries to explore via Jamie Miller. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/robinhood-review-nithiin-sreeleela-starrer-commercial-film-lacks-freshness-2700731-2025-03-28",
      "headline": "Robinhood review: Nithiin-Sreeleela starrer commercial film lacks freshnessReleased-Fri Mar 28, 2025Robinhood film review: Directed by Chalo fame Venky Kudumula, Robinhood released in theatres on March 28, 2025. It is a tale of a street-smart thief and his antics to stop a drug-lord and save a village. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sikandar-release-look-at-salman-khan-last-five-films-box-office-performance-2700714-2025-03-28",
      "headline": "Ahead of Sikandar, a look at Salman Khan's last five films' box office performanceSalman Khan returns this Eid with the action-packed film Sikandar, directed by AR Murugadoss and co-starring Rashmika Mandanna. As anticipation builds, we take a look at the box office performances of his last five films."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/empuraan-1st-day-box-office-records-5-historic-benchmarks-set-by-mohanlal-prithviraj-sukumar-film-domestically-and-worldwide-2700701-2025-03-28",
      "headline": "Empuraan 1st day box office records: 5 historic benchmarks set by Mohanlal's filmMohanlal and Prithviraj Sukumaran's 'L2: Empuraan' is already rocking the box office. The film is yet to cover the first weekend, and it has set the cash registers ringing. Here's how. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-glory-to-weak-hero-class-1-exploring-bullying-and-its-impact-in-k-dramas-2700672-2025-03-28",
      "headline": "The Glory to Weak Hero Class 1: Exploring bullying and its impact in K-dramasKorean dramas have been pivotal in showcasing the serious issue of bullying, exploring its effects on victims and society. Through powerful storytelling, these dramas address school violence, online harassment, and the emotional scars left behind."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/athiya-shetty-homecoming-after-embracing-motherhood-pic-2700663-2025-03-28",
      "headline": "Athiya Shetty shares glimpse of homecoming after embracing motherhoodAthiya Shetty and KL Rahul became parents of their first child, a daughter, on March 24. Athiya has shared a glimpse of their welcome ceremony on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/where-megan-fox-and-machine-gun-kelly-stand-after-welcoming-their-baby-girl-glbs-2700641-2025-03-28",
      "headline": "Where Megan Fox and Machine Gun Kelly stand after welcoming their baby girlMegan Fox and Machine Gun Kelly welcome their baby girl on March 27, 2025, months after ending their engagement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sikandar-new-song-hum-aapke-bina-brings-out-salman-khan-rashmika-mandanna-chemistry-watch-song-by-arijit-singh-2700623-2025-03-28",
      "headline": "Sikandar new song Hum Aapke Bina brings out Salman-Rashmika's chemistry. WatchThe team of 'Sikandar' released a romantic track from the film on Friday. Titled 'Hum Aapke Bina', it is sung by Arijit Singh, and highlights Salman Khan-Rashmika Mandanna's chemistry. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/myanmar-earthquake-building-collapse-deaths-bangkok-thailand-tremors-rescue-emergency-2700648-2025-03-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "144 dead in Myanmar after massive earthquake, buildings collapse in Thailand Live UpdatesA powerful earthquake and subsequent aftershocks struck Myanmar and neighbouring Thailand on Friday, killing several people and trapping dozens under rubble as multiple buildings collapsed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/pm-modi-a-smart-man-will-work-out-well-between-india-us-donald-trump-amid-tariff-talks-2700888-2025-03-29#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India-US tariffs will work out well, PM Modi is a great man, says Donald TrumpUS President Donald Trump reaffirmed his concerns over India's high tariffs while praising Prime Minister Narendra Modi as a \"great friend\" and \"very smart man\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/mk-stalin-vijay-eps-edappadi-palaniswami-annamalai-whom-does-tamil-nadu-prefer-as-chief-minister-cvoter-survey-reveals-2700790-2025-03-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Whom does Tamil Nadu prefer as Chief Minister? CVoter survey revealsA CVoter survey places MK Stalin as the preferred Chief Minister, but actor-politician Vijay's strong second-place ranking signals a potential political shift. Is Tamil Nadu's 'Thalapathy' ready to challenge Stalin's throne?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/kerala/story/mohanlal-empuraan-controversy-congress-lauds-film-says-exposes-sangh-agenda-2700688-2025-03-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Congress in Kerala praises Empuraan: World class film exposing Sangh agendaMohanlal-starrer Empuraan sparked discussions on social media after indirectly portraying incidents in connection with the Gujarat riots. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/myanmar-earthquakes-shake-bangkok-trapping-korean-family-in-high-rise-viral-video-glbs-2700693-2025-03-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Family's quake horror atop swaying Bangkok high-rise as terrace pool overflowsA viral video captures a Korean family in a high-rise during Bangkok's tremors after Myanmar's earthquakes. Shaking rooftop pools created a waterfall illusion, amplifying panic before the family confirmed their safety."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-rcb-match-report-chennai-ms-dhoni-virat-kohli-2700873-2025-03-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "RCB breach fortress Chepauk, clinch first win in Chennai in 17 yearsRoyal Challengers Bengaluru breached fortress Chepauk to make it two in the Indian Premier League 2025. Captain Patidar and the bowlers starred as the visitors clinched a clinical victory by 50 runs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/elon-musks-ai-platform-xai-acquires-social-media-platform-x-for-45-billion-2700899-2025-03-29#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Elon Musk's xAI startup buys his social media platform X for $33 billionThe all-stock deal announced on Friday combines two of Elon Musk's multiple portfolio companies, which also include automaker Tesla and SpaceX, and potentially eases Musk's ability to train his AI model known as Grok."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-mark-carney-canada-snap-elections-productive-talks-2700813-2025-03-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump holds 'productive' talks with Carney, says meet planned after Canada pollsUS President Donald Trump has said he would meet Canadian PM Mark Carney after elections on April 28. His remarks came after he described a call between them as \"productive\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/lakme-fashion-week-anamika-khanna-ak-ok-show-is-a-love-letter-to-the-white-shirt-2700750-2025-03-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Anamika Khanna's AK | OK show is a love letter to the white shirtThe humble white shirt - albeit not in its humble form - took centre stage in AK | OK's new collection, Silver Collar, displayed at the Lakme Fashion Week. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-murder-case-womans-decomposed-body-found-vivek-vihar-flat-husband-untraceable-sources-2700848-2025-03-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Woman's decomposed body found in Delhi flat, landlord detained: SourcesThe body of the woman, who lived with her husband in the flat, was found wrapped in a blanket and stuffed inside a bag, which was hidden in a bed inside the house."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/kolkata-doctor-rape-murder-rg-kar-hospital-calcutta-high-court-sanjay-roy-gangrape-delay-in-probe-west-bengal-2700849-2025-03-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "No gangrape in RG Kar case, probing larger conspiracy: CBI to courtThe rape and murder of a trainee doctor at Kolkata's RG Kar Medical College was not a gang rape but the act of a single perpetrator, Sanjay Roy, CBI informed the Calcutta High Court on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virat-kohli-ms-dhonis-bromance-goes-viral-csk-vs-rcb-2700886-2025-03-29#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Virat Kohli, MS Dhoni's bromance goes viral after RCB's historic win over CSKRoyal Challengers Bengaluru (RCB) batter Virat Kohli was seen hugging MS Dhoni after his team's win over Chennai Super Kings (CSK) in Match 8 of the Indian Premier League 2025 (IPL 2025). RCB beat CSK by 50 runs as Rajat Patidar was adjudged Player of the Match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/isro-successfully-fires-engine-that-will-power-indias-heaviest-launch-vehicle-2700900-2025-03-29#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Isro successfully fires engine that will power India's heaviest launch vehicleIndia's space ambitions soared as Isro successfully conducted the first major hot test of its 200T thrust semi-cryogenic engine at IPRC, Mahendragiri, advancing future missions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/centre-approves-justice-yashwant-varma-transfer-allahabad-high-court-cash-row-2700592-2025-03-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Justice Varma's transfer cleared, High Court asked not to assign him judicial workFollowing the recovery of the cash pile from his residence during a fire incident last week, Justice Varma was repatriated from the Delhi High Court to the Allahabad High Court."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/gurdwara-committee-slams-amit-shahs-parliament-remarks-hateful-disrespectful-2700897-2025-03-29#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Gurdwara committee slams Amit Shah's Parliament remarks: Hateful, disrespectfulThe Gurdwara Committee has condemned Union Home Minister Amit Shah's remarks on Jarnail Singh Bhindranwale, calling them anti-Sikh and insulting to India's heritage. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/plea-in-court-in-support-of-comedian-kunal-kamra-amid-joke-row-2700892-2025-03-29#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Plea in court in support of Kunal Kamra amid joke row: Satirical commentaryA Criminal Public Interest Litigation (CrPIL) has been filed in the Bombay High Court, seeking protection for comedian Kunal Kamra's remarks under Article 19 of the Constitution. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/adolescence-through-jamie-miller-eyes-highs-and-lows-of-a-teenager-emotions-2700711-2025-03-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Adolescence through Jamie Miller's eyes: Highs and lows of a teenager's emotionsNetflix's critically acclaimed show, 'Adolescence' portrays the layers of adolescence through its celebrated lead actor, teenager - debutante Owen Cooper. We highlight the array of emotions that the show tries to explore via Jamie Miller. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/google-india-finally-reveals-availability-details-for-pixel-9a-2700827-2025-03-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Google India finally reveals availability details for Pixel 9aGoogle has confirmed that the Pixel 9a will be available in India on April 16, alongside launches in Australia, Singapore, Taiwan, and Malaysia. The device will hit shelves earlier in the US, Canada, and UK on April 10."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-vs-lsg-match-date-timing-kolkata-bcci-2700821-2025-03-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "KKR vs LSG stays in Kolkata, but BCCI changes date and timing of matchIPL 2025: Kolkata Knight Riders vs Lucknow Super Giants' match has not been taken away from hosts Kolkata. Instead, the match, originally scheduled to be played on 6th April, will now be played on April 8."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-ghibli-style-images-donald-trump-meet-tejas-sortie-prime-minister-narendra-modi-studio-ghibli-trend-2700763-2025-03-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump meet to Tejas sortie: PM Modi hops on to Studio Ghibli trendAmong the Ghibli-style images shared by the government were the Prime Minister holding the tri-colour, his meetings with Donald Trump and Emmanuel Macron during his recent visits to the US and France, respectively. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tracking-india-billionaire-growth-from-2014-to-2025-massive-surge-hurun-rich-list-2025-key-data-explained-2700554-2025-03-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How India saw a billionaire boom in just 10 yearsIndia's billionaire club isn't just growing—it's thriving. A decade ago, cracking this list was a rare feat. Now, it's happening faster than ever. Even with market swings and economic headwinds, the country keeps adding new names to its billionaire ranks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/videos-building-collapses-in-bangkok-bridge-falls-in-myanmar-after-major-earthquake-2700438-2025-03-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Videos: Building collapses in Bangkok, bridge falls in Myanmar after major quakesTwo powerful earthquakes, measuring 7.7 and 6.4 in magnitude, hit Myanmar on Friday. The tremors were so strong that they were felt in Thailand's capital, Bangkok. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/madras-high-court-pre-arrest-bail-comedian-kunal-kamra-eknath-shinde-joke-row-mumbai-tamil-nadu-2700647-2025-03-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Joke row: Kunal Kamra gets interim pre-arrest bail, claims he got 500 threat callsKunal Kamra's counsel claimed that the comedian received 500 threatening calls after his 'traitor' jab at Eknath Shinde during a stand-up performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/lost-grave-of-dara-shikoh-murdered-by-brother-aurangzeb-mystery-humayuns-tomb-chhaava-maratha-film-2700142-2025-03-28#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "The lost grave of Dara Shikoh, murdered by brother AurangzebMughal emperor Aurangzeb got his brother Dara Shikoh beheaded in Delhi and presented his head to their father, Shah Jahan, whom he had imprisoned in Agra. Experts believe India's history would have been different had a scholarly and secular Dara become the emperor. Amid the controversy over Aurangzeb's grave, a look at the life of Dara, who translated the Upanishads into Persian, and the mystery around his tomb."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-points-tabe-top-spot-beat-csk-chepauk-2700894-2025-03-29",
      "headline": "IPL 2025 Points Table, March 28: RCB cement top spot after CSK winRCB cemented their top spot in IPL 2025 after a dominant 50-run victory over CSK in Chepauk, breaking a 17-year winless streak at the venue. The emphatic win boosted their net run rate to +2.266 with two wins from two matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-rcb-batting-order-ms-dhoni-2700893-2025-03-29",
      "headline": "Ambati Rayudu questions CSK's batting strength after RCB hammering at ChepaukAfter CSK's embarrassing loss against Royal Challengers Bengaluru, Ambati Rayudu slammed the middle-order of the Chennai-based side. Rayudu ripped into the quality of the batters and said that CSK needed to shake things up if they were to remain alive in the competition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-csk-highest-run-scorer-suresh-raina-2700891-2025-03-29",
      "headline": "IPL 2025: MS Dhoni breaks Suresh Raina's all-time CSK recordIPL 2025: MS Dhoni became CSK's highest run-scorer in IPL history, surpassing Suresh Raina. However, his unbeaten 30 went in vain as RCB broke their 17-year Chepauk jinx with a commanding 50-run victory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-chants-chepauk-vs-csk-watch-2700890-2025-03-29",
      "headline": "Watch: RCB chants echo in Chepauk as CSK fans silenced after rare defeatChepauk echoed with \"RCB, RCB\" chants as Bengaluru stunned CSK with a 50 to end their 17-year winless streak at the iconic stadium.  Despite the many doubts  and criticism,   RCB dominated CSK in what was a one-sided match on March 28."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virat-kohli-ms-dhonis-bromance-goes-viral-csk-vs-rcb-2700886-2025-03-29",
      "headline": "Virat Kohli, MS Dhoni's bromance goes viral after RCB's historic win over CSKRoyal Challengers Bengaluru (RCB) batter Virat Kohli was seen hugging MS Dhoni after his team's win over Chennai Super Kings (CSK) in Match 8 of the Indian Premier League 2025 (IPL 2025). RCB beat CSK by 50 runs as Rajat Patidar was adjudged Player of the Match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ruturaj-gaikwads-bizarre-comments-lost-by-just-50-runs-csk-vs-rcb-2700876-2025-03-28",
      "headline": "Lost by just 50 runs: Ruturaj's bizarre comments after RCB hammer CSK irk fansChennai Super Kings (CSK) captain Ruturaj Gaikwad made a bizarre comment on his team's loss against Royal Challengers Bengaluru (RCB) in Indian Premier League 2025 (IPL 2025) as he said that they only lost by 50 runs and not a big margin."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-rcb-match-report-chennai-ms-dhoni-virat-kohli-2700873-2025-03-28",
      "headline": "RCB breach fortress Chepauk, clinch first win in Chennai in 17 yearsRoyal Challengers Bengaluru breached fortress Chepauk to make it two in the Indian Premier League 2025. Captain Patidar and the bowlers starred as the visitors clinched a clinical victory by 50 runs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-bats-below-r-ashwin-in-csk-vs-rcb-fans-slam-tactics-2700861-2025-03-28",
      "headline": "IPL 2025: MS Dhoni bats below R Ashwin in CSK vs RCB, fans slam tacticsChennai Super Kings (CSK) wicketkeeper batter MS Dhoni wasn't sent out to bat against Royal Challengers Bengaluru (RCB) early despite the required run rate climbing. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/anahat-singh-beats-helen-tang-to-clinch-indian-open-squash-womens-title-2700852-2025-03-28",
      "headline": "17-year-old Anahat Singh beats Helen Tang to clinch Indian Open squash women's titleIndia's women's number one squash player Anahat Singh beat Helen Tang of Hong Kong to win her sixth title on the bounce, and 11th in total. The victory helped her earn 300 ranking points."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-csk-vs-rcb-ipl-2025-2700835-2025-03-28",
      "headline": "Hit on helmet, struggle vs spin: Virat Kohli trolled after forgetful outing vs CSKRoyal Challengers Bengaluru's Virat Kohli was trolled on social media after a struggling knock against Chennai Super Kings on Friday, March 28. Kohli was dismissed for 31 off 30 balls."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ruturaj-gaikwads-bizarre-comments-lost-by-just-50-runs-csk-vs-rcb-2700876-2025-03-28",
      "headline": "Lost by just 50 runs: Ruturaj's bizarre comments after RCB hammer CSK irk fansChennai Super Kings (CSK) captain Ruturaj Gaikwad made a bizarre comment on his team's loss against Royal Challengers Bengaluru (RCB) in Indian Premier League 2025 (IPL 2025) as he said that they only lost by 50 runs and not a big margin."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-rcb-match-report-chennai-ms-dhoni-virat-kohli-2700873-2025-03-28",
      "headline": "RCB breach fortress Chepauk, clinch first win in Chennai in 17 yearsRoyal Challengers Bengaluru breached fortress Chepauk to make it two in the Indian Premier League 2025. Captain Patidar and the bowlers starred as the visitors clinched a clinical victory by 50 runs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-bats-below-r-ashwin-in-csk-vs-rcb-fans-slam-tactics-2700861-2025-03-28",
      "headline": "IPL 2025: MS Dhoni bats below R Ashwin in CSK vs RCB, fans slam tacticsChennai Super Kings (CSK) wicketkeeper batter MS Dhoni wasn't sent out to bat against Royal Challengers Bengaluru (RCB) early despite the required run rate climbing. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/anahat-singh-beats-helen-tang-to-clinch-indian-open-squash-womens-title-2700852-2025-03-28",
      "headline": "17-year-old Anahat Singh beats Helen Tang to clinch Indian Open squash women's titleIndia's women's number one squash player Anahat Singh beat Helen Tang of Hong Kong to win her sixth title on the bounce, and 11th in total. The victory helped her earn 300 ranking points."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-csk-vs-rcb-ipl-2025-2700835-2025-03-28",
      "headline": "Hit on helmet, struggle vs spin: Virat Kohli trolled after forgetful outing vs CSKRoyal Challengers Bengaluru's Virat Kohli was trolled on social media after a struggling knock against Chennai Super Kings on Friday, March 28. Kohli was dismissed for 31 off 30 balls."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-vs-lsg-match-date-timing-kolkata-bcci-2700821-2025-03-28",
      "headline": "KKR vs LSG stays in Kolkata, but BCCI changes date and timing of matchIPL 2025: Kolkata Knight Riders vs Lucknow Super Giants' match has not been taken away from hosts Kolkata. Instead, the match, originally scheduled to be played on 6th April, will now be played on April 8."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virat-kohli-rcb-most-runs-vs-csk-2700807-2025-03-28",
      "headline": "IPL 2025: Virat Kohli becomes highest run-scorer vs Chennai Super KingsVirat Kohli became the highest run-scorer against CSK in IPL history, surpassing Shikhar Dhawan's record during RCB's clash at Chepauk. Although Kohli was slow in his 31-run knock against CSK on March 28, he achieved the feat in just 10 balls during the Chepauk clash on  March  28."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/mlb-opening-day-yankees-win-as-bearded-era-begins-ohtani-homers-for-dodgers-glbs-2700794-2025-03-28",
      "headline": "MLB Opening Day: Yankees win as bearded era begins, Ohtani Homers for DodgersThe Yankees kicked off MLB's bearded era with a victory, while Shohei Ohtani made a statement in his Dodgers debut, launching a home run and thrilling fans on Opening Day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-stumping-video-phil-salt-csk-vs-rcb-2700783-2025-03-28",
      "headline": "MS Dhoni affects magic-stumping after failed DRS review against Virat KohliCSK vs RCB: MS Dhoni affected yet another lightning-quick stumping in the IPL. He dismissed Phil Salt off Noor Ahmed. This happened after Dhoni made an error in his judgement early in the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ashutosh-sharma-ms-dhoni-advice-secret-2700702-2025-03-28",
      "headline": "When Dhoni shared 'secret' advice to Delhi Capitals batter Ashutosh SharmaDelhi Capitals star Ashutosh Sharma revealed that he received batting advice from MS Dhoni last season, but kept the details under wraps. Ashutosh's blistering knock against Lucknow put him under the spotlight for the rest of the season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nhl-winnipeg-jets-look-to-clinch-playoff-spot-in-crucial-matchup-against-capitals-glbs-2700756-2025-03-28",
      "headline": "NHL: Winnipeg Jets clinch Playoff spot after big matchup against CapitalsThe Winnipeg Jets have an opportunity on Tuesday, April 1to secure the NHL's second playoff spot for the 2025 season, with various paths to attain a postseason spot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/csk-vs-rcb-matheesha-pathirana-replaces-nathan-ellis-bhuvneshwar-kumar-2700747-2025-03-28",
      "headline": "CSK vs RCB: Pathirana replaces Nathan Ellis, Bhuvneshwar debuts for BengaluruFast bowler Matheesha Pathirana will be playing his first match of the Indian Premier League 2025 (IPL 2025) against Royal Challengers Bengaluru (RCB). Bhuvneshwar Kumar was also brought in by RCB."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ashutosh-sharma-ms-dhoni-advice-secret-2700702-2025-03-28",
      "headline": "When Dhoni shared 'secret' advice to Delhi Capitals batter Ashutosh SharmaDelhi Capitals star Ashutosh Sharma revealed that he received batting advice from MS Dhoni last season, but kept the details under wraps. Ashutosh's blistering knock against Lucknow put him under the spotlight for the rest of the season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nhl-winnipeg-jets-look-to-clinch-playoff-spot-in-crucial-matchup-against-capitals-glbs-2700756-2025-03-28",
      "headline": "NHL: Winnipeg Jets clinch Playoff spot after big matchup against CapitalsThe Winnipeg Jets have an opportunity on Tuesday, April 1to secure the NHL's second playoff spot for the 2025 season, with various paths to attain a postseason spot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/csk-vs-rcb-matheesha-pathirana-replaces-nathan-ellis-bhuvneshwar-kumar-2700747-2025-03-28",
      "headline": "CSK vs RCB: Pathirana replaces Nathan Ellis, Bhuvneshwar debuts for BengaluruFast bowler Matheesha Pathirana will be playing his first match of the Indian Premier League 2025 (IPL 2025) against Royal Challengers Bengaluru (RCB). Bhuvneshwar Kumar was also brought in by RCB."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/how-to-watch-the-sweet-16-tv-channels-streaming-options-and-schedule-glbs-2700703-2025-03-28",
      "headline": "How to watch the Sweet 16: TV channels, streaming options, and scheduleThe 2025 March Madness tournament enters its thrilling Sweet 16 round during this hot period. Many fans follow March Madness 2025 intensely since the tournament features critical games and remarkable underdog teams competing for viewership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-id-be-surprised-if-he-didnt-play-says-steve-kerr-as-stephen-curry-expected-to-return-to-face-pelicans-glbs-2700684-2025-03-28",
      "headline": "NBA: I'd be surprised if he didn't play, Steve Kerr on Stephen Curry's returnThe Golden State Warriors will square off against the New Orleans Pelicans on Friday, March 28, in a regular NBA game, hoping to end their two-game losing streak."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/joe-root-not-interested-in-becoming-england-odi-captain-2700680-2025-03-28",
      "headline": "Joe Root not interested in becoming England ODI captain: The ship has sailedStar England batter Joe Root said that he isn't interested in captaining the England ODI team after Jos Buttler stepped down from his position. Root has never led England in ODIs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-rcb-virat-kohli-six-hitting-nets-session-watch-2700657-2025-03-28",
      "headline": "Watch: Kohli pulls off six after six in nets session ahead of CSK vs RCBVirat Kohli's explosive form in the nets has set the stage for a blockbuster clash between Royal Challengers Bengaluru and Chennai Super Kings. With Kohli and Dhoni locking horns, fans anticipate fireworks at Chepauk in this high-stakes IPL battle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/csk-vs-rcb-live-score-updates-ipl-2025-virat-kohli-ms-dhoni-noor-ahmad-2700645-2025-03-28",
      "headline": "CSK vs RCB Highlights: Bengaluru clinch rare win in ChepaukChennai Super Kings (CSK) vs Royal Challengers Bengaluru (RCB) Highlights: A late MS Dhoni show was not enough to save Chennai Super Kings as  Royal Challengers Bengaluru beat the hosts by 50 runs, and it is their first victory in Chepauk since 2008. A good batting display from the likes of RCB skipper Rajat Patidar and Tim David, followed by the bowling brilliance from Josh Hazlewood and Yash Dayal, kept CSK consistently out of the competition in this match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/former-barcelona-star-dani-alves-rape-conviction-appeal-overturned-2700634-2025-03-28",
      "headline": "Former Barcelona star Dani Alves' rape conviction appeal overturnedFormer Barcelona star defender Dani Alves' rape conviction appeal has been overturned by a Spanish court on Friday, March 28. Alves was found guilty of sexually assaulting a woman in 2022 in a nightclub in Barcelona. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tamim-iqbal-discharged-from-hospital-after-heart-attack-returns-home-2700615-2025-03-28",
      "headline": "Tamim Iqbal discharged from hospital after heart attackBangladesh cricketer Tamim Iqbal has been discharged from the hospital following treatment after suffering a heart attack before participating in a Dhaka Premier League (DPL) match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/ncaa-tournament-cooper-flagg-shines-as-duke-outlasts-arizona-in-sweet-16-thriller-glbs-2700586-2025-03-28",
      "headline": "NCAA Tournament: Cooper Flagg shines as Duke outlasts Arizona in sweet 16 thrillerCooper Flagg's epic buzzer-beater stuns Arizona, ignites March Madness chaos, and cements his rising stardom, fans erupt in shock, disbelief, and pure joy after witnessing the tournament's most electrifying moment yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-vs-pakistan-odi-series-squads-streaming-babar-azam-2700573-2025-03-28",
      "headline": "New Zealand vs Pakistan ODI series: Squads, all you need to knowAfter losing the T20I series 1-4, Pakistan will face New Zealand in a three-match ODI series. Napier, Hamilton and  Mount Maunganui will host the matches in the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ashutosh-sharma-delhi-capitals-power-hitting-2700561-2025-03-28",
      "headline": "Just want to hit every ball: Ashutosh reveals mantra to power-hittingIPL 2025: Ashutosh Sharma spoke about his power-hitting skills after playing a match-winning knock of 66 for the Delhi Capitals in their match against Lucknow Super Giants. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-lsg-shardul-thakur-unsold-robin-uthappa-2700512-2025-03-28",
      "headline": "Shardul Thakur going unsold in IPL 2025 auction still baffling: Robin UthappaRobin Uthappa said that he finds it baffling that Shardul Thakur went unsold during the IPL 2025 auction. Shardul was the star of the show with the ball as LSG defeated SRH on Thursday, March 27 in Hyderabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-invites-applications-fo-spin-bowling-coach-at-centre-of-excellence-2700440-2025-03-28",
      "headline": "BCCI invites applications for spin bowling coach at Centre Of ExcellenceThe BCCI on Frdiay, March 23 announced that they are inviting applications for the role of spin bowling coach at the Centre Of Excellence in Bengaluru. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}