{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/government-probes-dark-pattern-after-man-exposes-extra-fees-on-cash-on-delivery-2797655-2025-10-04",
      "headline": "Man flags extra charge on cash-on-delivery payments, Centre launches probeThe Department of Consumer Affairs has launched an investigation into e-commerce sites charging additional fees on cash-on-delivery payments. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/agent-body-protest-gst-reform-zero-insurance-distribution-input-tax-credit-prashant-mhatre-2797322-2025-10-03",
      "headline": "Agents' body questions GST cut, says move undermines insurance distributionPrashant Mhatre, All India President of the General Insurance Agents Federation Integrated (GIAFI), has sounded an alarm, saying the decision risks weakening the role of agents, brokers, and advisors who are central to India's insurance reach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/planning-a-personal-loan-do-not-make-these-5-errors-2795807-2025-10-03",
      "headline": "Planning a personal loan? Don't make these 5 errorsWhile personal loans can be a handy financial tool, they come with risks if mismanaged. Avoid these five common errors to keep your finances safe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/chennai-firm-wintrack-customs-official-bribery-corruption-charge-import-export-sector-cripple-2797228-2025-10-03",
      "headline": "Wintrack vs Chennai Customs is a sorry tale of grease of doing business in IndiaChennai-based logistics company Wintrack has ceased Indian operations, alleging repeated bribery demands and harassment by Chennai Customs, exposing the ugly truth that at Indian Customs integrity is the real contraband.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/delhi-government-may-revise-circle-rates-public-feedback-invited-2797279-2025-10-03",
      "headline": "Delhi government may revise circle rates, public feedback invitedThe Delhi government is considering a revision of circle rates across the city and has called on the public to share their views before any changes are finalised."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/health-insurance-trap-to-watch-2025-room-rent-caps-deductibles-co-pays-save-money-2797278-2025-10-03",
      "headline": "Health insurance in 2025: Key traps that could drain your pocketClauses such as room rent caps, deductibles, and co-pay options are often buried deep in policy documents but can have a massive influence on the claim process."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-end-higher-metal-stocks-gain-tata-steel-2797261-2025-10-03",
      "headline": "Sensex, Nifty recover losses to end higher fuelled by gains in metal stocksThe S&P BSE Sensex added 223.86 points to close at 81,207.17, while the NSE Nifty50 gained 57.95 points to end at 24,894.25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/63-of-households-aware-yet-only-95-invest-in-markets-sebi-survey-shows-2797218-2025-10-03",
      "headline": "63% of households aware, yet only 9.5% invest in markets, Sebi survey showsDespite growing awareness about investing in the markets, the latest Sebi survey shows that only a small fraction of households, i.e., just 9.5%, are actively investing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/looking-for-high-returns-this-small-savings-scheme-beats-ppf-and-nsc-2797178-2025-10-03",
      "headline": "Looking for high returns? This small savings scheme beats PPF and NSCMany investors assume PPF or NSC offer the best returns, but the scheme leads the pack with the highest interest among small savings schemes. Have a look."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/chennai-customs-wintrack-bribe-ask-legal-case-law-help-corruption-business-protection-expert-view-2797188-2025-10-03",
      "headline": "Wintrack vs Chennai Customs: If forced to bribe, can companies fight legally?The Finance Ministry has already ordered an official probe, but the matter has also raised a wider debate: if businesses are forced to pay bribes to get their consignments cleared, do they have the law on their side?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/will-zerodha-end-its-zero-brokerage-model-for-equity-delivery-trades-nithin-kamath-2797133-2025-10-03",
      "headline": "Will Zerodha end its zero-brokerage model for equity delivery trades?Zerodha, long known for offering free equity delivery trades, could soon charge for delivery trades for the first time, signalling a major shift for investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nirmala-sitharaman-opens-kautilya-economic-conclave-seeks-stronger-role-for-india-2797042-2025-10-03",
      "headline": "India can't be passive spectator: Nirmala Sitharaman talks tough amid US tariffsUnion Finance Minister Nirmala Sitharaman opened the Kautilya Economic Conclave 2025 in New Delhi, urging India to play a more active role in shaping global decisions amid growing economic and geopolitical uncertainty."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/baahubali-off-netflix-platforms-in-india-2797823-2025-10-04",
      "headline": "Baahubali films off Netflix: On which platforms can you watch them in India? Baahubali and Baahubali 2 are currently not available on Netflix. However, fans can catch the epic films on five other platforms. Check it out."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/jin-encore-concerts-hotel-price-surge-incheon-munhak-stadium-booking-chaos-2797768-2025-10-04",
      "headline": "BTS Jin concerts cause Incheon hotel prices to soar by 200 per cent Hotels near Incheon Munhak Main Stadium raise rates sharply ahead of BTS' Jin's encore concerts. Fans and non-fan guests report cancelled bookings and increased accommodation costs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/arbaaz-khan-ssura-khan-hospital-admission-first-child-mumbai-2797736-2025-10-04",
      "headline": "Arbaaz Khan, Sshura Khan arrive at hospital ahead of baby's birth: Reports Actor Arbaaz Khan and Sshura Khan arrived at PD Hinduja Hospital for the birth of their first child together, according to reports. Family members and friends attended a private baby shower before admission."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kim-woo-bin-suzy-genie-make-a-wish-fantasy-romance-kdrama-netflix-2797709-2025-10-04",
      "headline": "Genie, Make A Wish Review: Woo-bin, Suzy's chemistry casts a spell, almost!Release Date:Fri Oct 03, 2025 South Korean actors Kim Woo-bin and Suzy reunite in the new fantasy-romance K-drama 'Genie, Make a Wish'. The series explores temptation and morality with a unique blend of dark humour and fantasy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-tamil-season-9-launch-october-5-vijay-sethupathi-host-2797697-2025-10-04",
      "headline": "Vijay Sethupathi hosts Bigg Boss Tamil Season 9: Read all about the show 'Bigg Boss Tamil' Season 9 will premiere on October 5. Vijay Sethupathi returns as host for the new season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/when-is-rashmika-mandanna-the-girlfriend-releasing-2797696-2025-10-04",
      "headline": "When is Rashmika Mandanna's The Girlfriend releasing? Check confirmed date here Makers of 'The Girlfriend', starring Rashmika Mandanna, confirmed the film's release date on Saturday, a day after reports of her engagement with Vijay Deverakonda went viral. The film also stars Dheekshith Shetty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/samay-raina-takes-hilarious-dig-at-dhanashree-verma-yuzvendra-chahal-in-new-ad-with-rj-mahvish-2797690-2025-10-04",
      "headline": "Samay Raina takes hilarious dig at Dhanashree, Yuzvendra in new ad with RJ Mahvish Comedian Samay Raina featured in a new ad with Yuzvendra Chahal's rumoured girlfriend, RJ Mahvish. In the commercial, Raina took a sly dig at Yuzvendra and his ex-wife Dhanashree Verma. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rashmika-mandanna-vijay-deverakonda-engagement-hyderabad-2025-2797681-2025-10-04",
      "headline": "Vijay Deverakonda, Rashmika Mandanna engagement: A look at their timeline Actors Rashmika Mandanna and Vijay Deverakonda got engaged at a private ceremony in Hyderabad. The couple's relationship timeline has included years of speculation and subtle public hints."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-turns-heartbreak-into-happily-ever-after-from-glitch-wish-list-2797658-2025-10-04",
      "headline": "Taylor Swift turns heartbreak into happily ever after from Glitch to Wi$h Li$t From 'Glitch' to 'Wi$h Li$t', Taylor Swift turns heartbreak into a fairytale in 'The Life of a Showgirl', marking her most romantic era yet.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sandhya-shantaram-dies-age-of-94-2797661-2025-10-04",
      "headline": "Veteran actor Sandhya Shantaram dies at 94 Veteran actor Sandhya Shantaram has passed away at the age of 94. She was known for her roles in films like 'Jhanak Jhanak Payal Baaje', 'Do Aankhen Barah Haath', 'Navrang', and the Marathi film 'Pinjara'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/karnataka-state-awards-rakshit-shetty-archana-jois-win-top-honours-2797619-2025-10-04",
      "headline": "Karnataka State Awards: Rakshit Shetty, Archana Jois win big The Karnataka State Awards were announced recently, honouring the best talent for their contribution to cinema. Take a look at the complete list of winners. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-update-amaal-mallik-furious-after-physical-fight-abhishek-bajaj-ashnoor-2797636-2025-10-04",
      "headline": "Bigg Boss 19 ep 41: Amaal Mallik furious after physical fight with Abhishek Bajaj Amaal Mallik and Abhishek Bajaj got into a heated argument after Amaal referred to Ashnoor Kaur as Bhokti hai during her caretaker stint. The clash intensified with Amaal issuing aggressive threats and challenging the makers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/pooja-shah-kbc-17-therapy-challenges-cerebral-palsy-epilepsy-2797633-2025-10-04",
      "headline": "KBC 17: Amitabh Bachchan promises support to contestant's son with special needs Contestant Pooja Shah wins Rs 12,50,000 on 'Kaun Banega Crorepati' 17 for her son's future. Amitabh Bachchan promises to assist in finding better treatment options."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kangana-ranaut-returns-showstopper-raabta-bridal-jewellery-praises-pm-modi-hollywood-debut-2797616-2025-10-04",
      "headline": "Kangana Ranaut praises PM Modi's style, calls him the perfect showstopper Actor Kangana Ranaut walked as the showstopper for Raabta by Rahul's bridal jewellery showcase in Delhi. She commended Prime Minister Modi's sense of style, highlighting his leadership and calling him the perfect showstopper. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/blake-lively-supports-taylor-swift-lawsuit-friendship-rift-justin-baldoni-2797597-2025-10-04",
      "headline": "Blake Lively shows support for Taylor Swift's new album amid rumours of rift Actor Blake Lively liked Taylor Swift's post about her new album amid reports of a strained friendship. Their relationship reportedly became strained after Lively's lawsuit involving Justin Baldoni."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/aryan-khan-netflix-the-bands-of-bollywood-bollywood-satire-debate-2797587-2025-10-04",
      "headline": "Sunil Pal slams Aryan Khan's Netflix show for mocking Bollywood Aryan Khan's directorial debut 'The Ba***ds of Bollywood' draws criticism from comedian Sunil Pal. He objects to Khan's critique of the industry that made his father, Shah Rukh Khan, a star."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/what-sean-diddy-combs-said-in-tearful-remarks-before-sentencing-four-years-prison-2797582-2025-10-04",
      "headline": "I lost my self-respect: What Diddy said in tearful remarks before sentencing Rapper Sean 'Diddy' Combs, in his tearful remarks before the sentencing, apologised for his mistakes and said how he had lost self-respect.  He has been sentenced to 4 years and 2 months for arranging drug-fueled sexual encounters. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/steve-review-cillian-murphy-shines-raw-tale-compassion-chaos-2797519-2025-10-04",
      "headline": "Steve review: Cillian Murphy shines in a raw tale of compassion and chaosRelease Date:Fri Oct 03, 2025 Steve review: Director Tim Mielants crafts a quietly devastating portrait of empathy and resilience in this raw drama, featuring Cillian Murphy as a headteacher holding on to hope while his world unravels. Is the Netflix drama worth your time? Here is our review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nick-jonas-unties-priyanka-chopra-hair-in-adorable-clip-from-gala-night-photo-dump-2797571-2025-10-04",
      "headline": "Nick Jonas unties Priyanka's hair in adorable clip from gala night photo dump Priyanka Chopra shared an adorable video of her husband Nick Jonas, helping her untie her hair after attending a gala night. In a heartfelt note, she thanked Jonas for being so supportive. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/hamas-must-move-quickly-or-else-all-bets-will-be-off-trumps-fresh-ultimatum-on-gaza-peace-deal-acceptance-2797800-2025-10-04",
      "headline": "Move quickly or else...: Trump's fresh warning to Hamas to accept Gaza peace planAsserting that he wouldn't tolerate \"any delay\", US President Donald Trump warned Hamas to cease fighting with Israel and lay down its arms or else \"all bets will be off\"."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/indians-abroad/story/hyderabad-student-killed-us-shooting-telangana-repatriation-2797739-2025-10-04",
      "headline": "Hyderabad student, working at US gas station, shot deadAn Indian student from Hyderabad, who went to the US for his higher studies, was shot dead by miscreants in Texas. The incident reportedly occurred at a gas station where the victim worked on a part-time basis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-odi-captain-rohit-sharma-india-squad-australia-tour-selection-2797642-2025-10-04",
      "headline": "Shubman Gill replaces Rohit Sharma as India's ODI captainIndia tour of Australia: Shubman Gill has replaced Rohit Sharma as the new ODI captain. The call was taken during Saturday's selection meeting, convened by chairman of selectors Ajit Agarkar, in Ahmedabad."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/madhya-pradesh/story/sale-of-coldrif-cough-syrup-banned-across-madhya-pradesh-after-9-children-die-chief-minister-mohan-yadav-promises-strict-action-2797610-2025-10-04",
      "headline": "Three states ban Coldrif cough syrup as tests confirm toxins amid child deathsMadhya Pradesh, Tamil Nadu and Kerala have banned the sale and distribution of Coldrif cough syrup after laboratory tests found the medicine to be \"substandard and adulterated,\" containing 48.6% Diethylene Glycol, a toxic chemical that can cause severe harm or even death."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-odi-captaincy-shubman-gill-ajit-agarkar-explained-aus-tour-2797695-2025-10-04",
      "headline": "Why Rohit Sharma was replaced as ODI captain well before 2027 World CupIndia's ODI captaincy baton has officially passed from Rohit Sharma to Shubman Gill, with selectors opting for long-term planning ahead of the 2027 World Cup. While Rohit and Virat Kohli remain in the squad, their futures now hinge on performance, fitness and commitment to domestic cricket."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-pok-peace-deal-ends-protests-agreement-violence-pressure-2797699-2025-10-04",
      "headline": "Pak blinks as it signs deal with POK protesters, calls it victory of peaceAfter several days of violent protests in Pakistan Occupied Kashmir, the Pakistani government wilted under pressure and signed a 25-point agreement with the protesters. The deal includes compensation, reforms and infrastructure commitments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/no-one-will-play-role-of-big-brother-this-time-nda-will-fight-unitedly-bihar-bjp-chief-dilip-jaiswal-2797809-2025-10-04",
      "headline": "No one will play role of big brother this time: Bihar BJP's message ahead of pollsAddressing the media after a state election committee meeting, Jaiswal said, \"This time, no one will play the role of big brother or small brother. The NDA will fight together, like a rock, with full unity and strength.\"\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-trump-offer-us-port-arabian-sea-balochistan-close-to-india-chabahar-port-2797757-2025-10-04",
      "headline": "Pak asks Trump to develop port on Arabian Sea, close to India's ChabaharAs per Pakistan's blueprint, the civilian port will be located in Pasni, a town in Balochistan's Gwadar district, placing it strategically close to the Chabahar port being developed by India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-shubman-gill-odi-captain-first-words-2027-world-cup-big-goal-2797782-2025-10-04",
      "headline": "Shubman Gill sets clear targets for India as ODI captain: 2027 World Cup is the goalIND vs AUS: Shubman Gill takes charge as India's new ODI captain with the 2027 World Cup in South Africa as the ultimate goal. The 26-year-old will now lead India in both Tests and ODIs, after replacing Rohit Sharma in both roles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/learn-how-adobe-express-is-making-graphic-design-fun-in-classrooms-2792611-2025-09-24",
      "headline": "Learn How Adobe Express Is Making Graphic Design Fun In ClassroomsThe Adobe Express app is available on any smart device or desktop computer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-odi-squad-shubman-gill-captain-rohit-sharma-virat-kohli-2797657-2025-10-04",
      "headline": "Ro-Ko back: Rohit Sharma and Virat Kohli return as India name ODI squadIndia tour of Australia: Rohit Sharma and Virat Kohli were named in India's 15-man squad for the three-match series, starting October 19. Shubman Gill replaced Rohit as the new captain of the one-day international side. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/bihar-assembly-elections-bjp-verification-burqa-clad-voters-during-bihar-polls-rjd-slams-demand-2797801-2025-10-04",
      "headline": "BJP urges verification of burqa-clad voters during Bihar polls, RJD slams demandThe request has sparked criticism from the party's main rival, the RJD, which accused the BJP of trying to push a \"political conspiracy.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-turns-heartbreak-into-happily-ever-after-from-glitch-wish-list-2797658-2025-10-04",
      "headline": "Taylor Swift turns heartbreak into happily ever after from Glitch to Wi$h Li$tFrom 'Glitch' to 'Wi$h Li$t', Taylor Swift turns heartbreak into a fairytale in 'The Life of a Showgirl', marking her most romantic era yet.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-baba-swami-chaitanyanand-saraswatis-flirty-online-comments-surface-as-molestation-probe-deepens-2797812-2025-10-04",
      "headline": "Delhi baba's flirty online comments surface as molestation probe deepensPosts from self-styled godman Swami Chaitanyanand Saraswati's verified X (formerly Twitter) account reveal a pattern of inappropriate, flirtatious, and suggestive comments on photographs uploaded by women."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/former-pakistan-cricketer-danish-kaneria-indian-citizenship-caa-discrimination-2797622-2025-10-04",
      "headline": "India my matrubhumi: Ex-Pak cricketer Danish Kaneria's big claim on citizenshipDanish Kaneria, a Hindu, rejected speculation that his recent positive remarks on India's internal affairs were driven by a motive to seek Indian citizenship."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uk-pm-keir-starmer-to-make-first-visit-to-india-on-october-8-9-focus-on-boosting-strategic-partnership-2797769-2025-10-04",
      "headline": "UK PM Keir Starmer to make first official visit to India next weekThe United Kingdom's Prime Minister Keir Starmer MP, will make his first official visit to India on October 8-9, 2025, at the invitation of Prime Minister Narendra Modi. During his visit, the two leaders will review progress in the India-UK Comprehensive Strategic Partnership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/nigel-farage-reform-uk-shakes-british-politics-with-hardline-migration-stance-2797594-2025-10-04",
      "headline": "Fringe to frontline: How Farage is forcing Britain's migration debateNigel Farage's Reform UK has shaken Britain's political landscape, forcing major parties to toughen their migration stance as his far-right movement gains momentum and reshapes debates on nationalism and immigration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-530-03-10-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/hold-bihar-election-soon-after-chhath-in-single-phase-parties-urge-poll-body-eci-2797779-2025-10-04",
      "headline": "Hold Bihar election soon after Chhath, in single phase: Parties urge poll bodyPolitical parties in Bihar urged the Election Commission of India (ECI) to schedule the state Assembly elections immediately after the Chhath festival, which falls on October 28 this year."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-citizens-worry-gillette-razor-soap-shampoo-shortages-procter-gamble-exit-2797615-2025-10-04",
      "headline": "Pakistanis worry about their grooming game as Gillette maker shuts shopP&G Pakistan: With consumer goods giant P&G shutting shop, several Pakistanis have gone into a meltdown, worrying about shortages of their favourite Gillette razor and Head and Shoulders shampoo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-india-odi-captain-rohit-sharma-transition-ajit-agarkar-bcci-2797767-2025-10-04",
      "headline": "Kudos to Agarkar: India's ODI transition will be smoother than messy Test sagaAs the Indian ODI team enters a new phase with Rohit Sharma stepping aside for Shubman Gill, a lot of credit should go to chief selector Ajit Agarkar and the BCCI to hit the transition button two years before the ODI World Cup. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/zubeen-gargs-bandmate-claims-singers-manager-fest-organiser-poisoned-him-2797543-2025-10-04",
      "headline": "Manager, fest organiser poisoned Zubeen Garg: Bandmate's damning claimZubeen Garg's bandmate Shekhar Jyoti Goswami said the singer's manager behaved suspiciously prior to his death. Garg died under mysterious circumstances in Singapore on September 19 while swimming."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/karur-stampede-will-vijay-be-arrested-tamil-nadu-minister-durai-murugan-responds-2797752-2025-10-04",
      "headline": "Will Vijay be arrested for Karur stampede? Tamil Nadu Minister respondsTamil Nadu Minister Durai Murugan has clarified that actor-politician Vijay will not be arrested in connection with the Karur stampede unless there is concrete evidence. The 41-death tragedy, which occurred during a TVK rally, is under investigation by a SIT led by IG Asra Garg."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/are-ott-platforms-really-a-safe-place-to-launch-newcomers-and-debutants-2797213-2025-10-04",
      "headline": "Are OTT platforms really a safe place to launch newcomers and debutants?OTT platforms have emerged as a safe and effective launchpad for newcomers, providing global reach, creative freedom, and a chance to build skills without box office pressure. They allow fresh talent to experiment, gain visibility, and connect with audiences in a low-risk environment."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-chelsea-estevao-liverpool-manchester-united-arsenal-2797828-2025-10-05",
      "headline": "Estevao's late winner helps Chelsea sink Liverpool, United, Arsenal win Estevao was the star of the show as his late goal helped Chelsea secure a thrilling 2-1 win over Liverpool on Sunday, October 4. Arsenal moved to the top of the points table while Manchester United eased pressure off Ruben Amorim by beating Sunderland. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/kenyan-coach-stray-dog-bite-para-athletics-championships-delhi-2797825-2025-10-04",
      "headline": "A day after being biten by dog, Kenyan coach says no measures still taken A day after being attacked and biten by a dog, Kenyan coach Dennis Maragia said that not enough measures have been taken at the venue of the World Para Athletics Championships in Delhi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vidarbha-lower-order-spinners-pressure-rest-of-india-irani-cup-day-4-2797808-2025-10-04",
      "headline": "Irani Cup 2025: Vidarbha inches closer to third title as ROI left reeling Vidarbha are on the cusp of securing their third Irani Cup title as the Rest Of India were left reeling at the end of Day 4's play with the lose of two wickets. ROI have a steep mountain to climb if they want to win the title on the final day. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhishek-nayar-rohit-sharma-odi-captaincy-change-shubman-gill-2797799-2025-10-04",
      "headline": "Hope communication with Rohit Sharma was done right over captaincy change: Nayar Abhishek Nayar is hoping that the communication with Rohit Sharma was done right about the captaincy change. Rohit was replaced as the captain of the ODI team as Shubman Gill took over the reins. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-odis-virat-kohli-fitness-never-question-harbhajan-singh-reacts-2797797-2025-10-04",
      "headline": "Never question Virat Kohli's fitness: Harbhajan Singh shuts down readiness doubts Harbhajan Singh slammed critics doubting Virat Kohli's fitness, calling him a \"fitness guru\" and the fittest player in international cricket. He backed Kohli to return strongly in ODIs, saying the star still has what it takes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/leadership-nothing-new-to-ravindra-jadeja-always-gave-my-inputs-when-needed-2797783-2025-10-04",
      "headline": "Leadership nothing new to Ravindra Jadeja: Always gave my inputs when needed Ravindra Jadeja said that vice-captaincy was never something new for him as he always kept himself as a leader in the team throughout his career. Jadeja was the star of the show as India thrashed West Indies in Ahmedabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-shubman-gill-odi-captain-first-words-2027-world-cup-big-goal-2797782-2025-10-04",
      "headline": "Shubman Gill sets clear targets for India as ODI captain: 2027 World Cup is the goal IND vs AUS: Shubman Gill takes charge as India's new ODI captain with the 2027 World Cup in South Africa as the ultimate goal. The 26-year-old will now lead India in both Tests and ODIs, after replacing Rohit Sharma in both roles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-ravindra-jadeja-misses-r-ashwin-ahmedabad-test-win-2797781-2025-10-04",
      "headline": "IND vs WI: Ahmedabad Test match-winner Ravindra Jadeja admits missing partner Ashwin India's match-winner in the Ahmedabad Test, Ravindra Jadeja, admitted that he was missing his former spin partner, R Ashwin, during the win. Jadeja was the star of the show for India in the match as the hosts took a 1-0 lead in the series. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/womens-world-cup-india-vs-pakistan-fatima-sana-press-conference-2797771-2025-10-04",
      "headline": "Records are meant to be broken: Pakistan captain plays down 0-11 record vs India Women's World Cup 2025, INDW vs PAKW: In the pre-match press conference, captain Fatima Sana said that Pakistan aren't worried about their record against India in ODIs where they have lost all 11 matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-india-odi-captain-rohit-sharma-transition-ajit-agarkar-bcci-2797767-2025-10-04",
      "headline": "Kudos to Agarkar: India's ODI transition will be smoother than messy Test saga As the Indian ODI team enters a new phase with Rohit Sharma stepping aside for Shubman Gill, a lot of credit should go to chief selector Ajit Agarkar and the BCCI to hit the transition button two years before the ODI World Cup. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-skipper-fatima-sana-focuses-cricket-india-pakistan-world-cup-controversy-2797766-2025-10-04",
      "headline": "Pakistan not focussed on outside noise: Skipper Fatima Sana before India clash Pakistan skipper Fatima Sana said the team remains focused on playing quality cricket and upholding the spirit of the game, ignoring the external controversies surrounding India and Pakistan ahead of their Women's World Cup clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-shubman-gill-odi-captain-first-words-2027-world-cup-big-goal-2797782-2025-10-04",
      "headline": "Shubman Gill sets clear targets for India as ODI captain: 2027 World Cup is the goal IND vs AUS: Shubman Gill takes charge as India's new ODI captain with the 2027 World Cup in South Africa as the ultimate goal. The 26-year-old will now lead India in both Tests and ODIs, after replacing Rohit Sharma in both roles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-ravindra-jadeja-misses-r-ashwin-ahmedabad-test-win-2797781-2025-10-04",
      "headline": "IND vs WI: Ahmedabad Test match-winner Ravindra Jadeja admits missing partner Ashwin India's match-winner in the Ahmedabad Test, Ravindra Jadeja, admitted that he was missing his former spin partner, R Ashwin, during the win. Jadeja was the star of the show for India in the match as the hosts took a 1-0 lead in the series. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/womens-world-cup-india-vs-pakistan-fatima-sana-press-conference-2797771-2025-10-04",
      "headline": "Records are meant to be broken: Pakistan captain plays down 0-11 record vs India Women's World Cup 2025, INDW vs PAKW: In the pre-match press conference, captain Fatima Sana said that Pakistan aren't worried about their record against India in ODIs where they have lost all 11 matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-india-odi-captain-rohit-sharma-transition-ajit-agarkar-bcci-2797767-2025-10-04",
      "headline": "Kudos to Agarkar: India's ODI transition will be smoother than messy Test saga As the Indian ODI team enters a new phase with Rohit Sharma stepping aside for Shubman Gill, a lot of credit should go to chief selector Ajit Agarkar and the BCCI to hit the transition button two years before the ODI World Cup. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-skipper-fatima-sana-focuses-cricket-india-pakistan-world-cup-controversy-2797766-2025-10-04",
      "headline": "Pakistan not focussed on outside noise: Skipper Fatima Sana before India clash Pakistan skipper Fatima Sana said the team remains focused on playing quality cricket and upholding the spirit of the game, ignoring the external controversies surrounding India and Pakistan ahead of their Women's World Cup clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-womens-world-cup-flora-devonshire-injury-hannah-rowe-replacement-2797760-2025-10-04",
      "headline": "New Zealand suffer big blow after young all-rounder gets ruled outNew Zealand's Women's World Cup campaign suffered a setback as 22-year-old off-spinner Flora Devonshire was ruled out with a hand injury, sidelining her for 2–3 weeks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-virat-kohli-2027-odi-world-cup-sunil-gavaskar-match-readiness-exclusive-2797751-2025-10-04",
      "headline": "Will Rohit and Kohli play 2027 World Cup? Sunil Gavaskar not sureRohit Sharma and Virat Kohli's ODI futures face a test of time, with Sunil Gavaskar stressing match readiness as the key to their 2027 World Cup hopes. Fewer ODIs in the calendar may pose their biggest challenge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-australia-squad-announcement-ajit-agarkar-rohit-sharma-shubman-gill-2797750-2025-10-04",
      "headline": "Ajit Agarkar explains big Rohit Sharma call, 2027 World Cup plansIndia tour of Australia: Rohit Sharma and Virat Kohli were named in India's 15-man squad for the three-match series, starting October 19. Shubman Gill replaced Rohit as the new captain of the one-day international side.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-2025-rain-washes-out-sri-lanka-australia-match-colombo-2797741-2025-10-04",
      "headline": "Rain washes out Sri Lanka-Australia clash in Colombo, clouds over India-Pakistan matchRain washed out Match No. 5 of the Women's World Cup 2025 between Sri Lanka and Australia in Colombo on October 4, with officials calling off the 20-over clash early due to persistent downpours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-batting-struggles-against-india-first-test-ahmedabad-2797717-2025-10-04",
      "headline": "Roston Chase urges West Indies to solve batting woes after Ahmedabad debacleIND vs WI, 1st Test: West Indies fell behind 0-1 in the Test series after a heavy defeat by India. Chase stresses the need for better batting and partnerships to mount a comeback."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/renuka-singh-workload-india-vs-pakistan-avishkar-salvi-press-conference-2797700-2025-10-04",
      "headline": "Renuka Singh's workload a concern? India coach opens up before Pakistan clashWomen's World Cup 2025, INDW vs PAKW: Bowling coach Avishkar Salvi said that India are looking at the workload of several of their players, including Renuka Singh, who has missed two out of four matches since her comeback. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-dinesh-karthik-tribute-rohit-sharma-odi-captaincy-exit-2797698-2025-10-04",
      "headline": "Rohit Sharma taught India team to win big matches: Dinesh Karthik pays tributeDinesh Karthik paid a heartfelt tribute to Rohit Sharma as the star batter made his exit as the ODI captain of the Indian team on Saturday, October 4. Rohit was replaced by Shubman Gill for the upcoming tour of Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-womens-cricket-pakistan-asia-cup-tensions-world-cup-clash-journalist-2797692-2025-10-04",
      "headline": "India avoid IND vs PAK Asia Cup row ahead of Colombo clashWomen's World Cup, INDW vs PAKW: In the pre-match press conference, a journalist was asked not to ask questions about the Asia Cup controversies between India and Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-batting-struggles-against-india-first-test-ahmedabad-2797717-2025-10-04",
      "headline": "Roston Chase urges West Indies to solve batting woes after Ahmedabad debacleIND vs WI, 1st Test: West Indies fell behind 0-1 in the Test series after a heavy defeat by India. Chase stresses the need for better batting and partnerships to mount a comeback."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/renuka-singh-workload-india-vs-pakistan-avishkar-salvi-press-conference-2797700-2025-10-04",
      "headline": "Renuka Singh's workload a concern? India coach opens up before Pakistan clashWomen's World Cup 2025, INDW vs PAKW: Bowling coach Avishkar Salvi said that India are looking at the workload of several of their players, including Renuka Singh, who has missed two out of four matches since her comeback. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-dinesh-karthik-tribute-rohit-sharma-odi-captaincy-exit-2797698-2025-10-04",
      "headline": "Rohit Sharma taught India team to win big matches: Dinesh Karthik pays tributeDinesh Karthik paid a heartfelt tribute to Rohit Sharma as the star batter made his exit as the ODI captain of the Indian team on Saturday, October 4. Rohit was replaced by Shubman Gill for the upcoming tour of Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-womens-cricket-pakistan-asia-cup-tensions-world-cup-clash-journalist-2797692-2025-10-04",
      "headline": "India avoid IND vs PAK Asia Cup row ahead of Colombo clashWomen's World Cup, INDW vs PAKW: In the pre-match press conference, a journalist was asked not to ask questions about the Asia Cup controversies between India and Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-odi-captaincy-shubman-gill-ajit-agarkar-explained-aus-tour-2797695-2025-10-04",
      "headline": "Why Rohit Sharma was replaced as ODI captain well before 2027 World CupIndia's ODI captaincy baton has officially passed from Rohit Sharma to Shubman Gill, with selectors opting for long-term planning ahead of the 2027 World Cup. While Rohit and Virat Kohli remain in the squad, their futures now hinge on performance, fitness and commitment to domestic cricket."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/harbhajan-singh-reacts-rohit-sharma-odi-captaincy-snub-australia-tour-shubman-gill-2797682-2025-10-04",
      "headline": "Gill could have waited, Rohit's captaincy axe disappointing: HarbhajanHarbhajan Singh admitted that he was shocked to see Rohit Sharma in the ODI squad for the Australia tour as a player and not as the captain of the team. Rohit's handed over the ODI captaincy to Shubman Gill. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-australia-odi-shubman-gill-all-format-captain-bcci-message-sunil-gavaskar-2797679-2025-10-04",
      "headline": "Shubman Gill will be all-format India captain, message is clear: GavaskarIndian cricket legend Sunil Gavaskar emphasised that the appointment of Shubman Gill as India's new ODI skipper after replacing Rohit Sharma is a clear message from the BCCI that Gill will be India's new all-format captain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-odi-series-ravindra-jadeja-snub-tactical-decision-ajit-agarkar-2797676-2025-10-04",
      "headline": "Ravindra Jadeja's ODI future in doubt? Ajit Agarkar explains Australia tour snubRavindra Jadeja will miss India's three-match ODI series in Australia, but his exclusion is strategic rather than form-related. Ajit Agarkar reassured fans that Jadeja remains central to India's ODI plans, with 2027 World Cup in mind."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-praises-indias-spin-options-innings-win-west-indies-2797671-2025-10-04",
      "headline": "Shubman Gill reacts to happy headache of managing quality spinnersIND vs WI: Shubman Gill lauded India's world-class spinners after their innings-and-140-run win over the West Indies, calling it a happy headache to manage so much talent.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-t20i-squad-vs-australia-2025-hardik-pandya-injury-jasprit-bumrah-2797665-2025-10-04",
      "headline": "No Hardik Pandya as Asia Cup champions India name T20I squad for Australia tourHardik Pandya misses out on making it to the squad for the T20I series against Australia as India retained most of the players from their squad that won the Asia Cup. Jasprit Bumrah retains his spot and Nitish Kumar Reddy and Washington Sundar are included in the side. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyer-vice-captain-bcci-shubman-gill-deputy-australia-odi-series-2797662-2025-10-04",
      "headline": "Shreyas Iyer named vice-captain, becomes Shubman Gill's deputy in ODI teamShreyas Iyer has made a massive rise in the Indian ODI setup as he was promoted as vice-captain for the upcoming Australia tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-1st-test-score-ahmedabad-ravindra-jadeja-mohammed-siraj-2797659-2025-10-04",
      "headline": "Epic mismatch: Ruthless India rout sorry West Indies in just 2-and-a-half daysIndia (IND) vs West Indies (WI), 1st Test: India hammered West Indies by an innings and 140 runs, wrapping up the match in fewer than eight sessions. Ravindra Jadeja's all-round brilliance, Mohammed Siraj's fiery pace, and commanding centuries from KL Rahul and Dhruv Jurel powered India to a dominant victory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-odi-squad-shubman-gill-captain-rohit-sharma-virat-kohli-2797657-2025-10-04",
      "headline": "Ro-Ko back: Rohit Sharma and Virat Kohli return as India name ODI squadIndia tour of Australia: Rohit Sharma and Virat Kohli were named in India's 15-man squad for the three-match series, starting October 19. Shubman Gill replaced Rohit as the new captain of the one-day international side. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-replaced-odi-captain-shubman-gill-bcci-australia-tour-2797644-2025-10-04",
      "headline": "Just disrespect: Rohit Sharma fans livid as Shubman Gill takes over as ODI captainRohit Sharma has been replaced as India's ODI captain ahead of the Australia tour. Fans have reacted with anger and disappointment over the decision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-odi-captain-rohit-sharma-india-squad-australia-tour-selection-2797642-2025-10-04",
      "headline": "Shubman Gill replaces Rohit Sharma as India's ODI captainIndia tour of Australia: Shubman Gill has replaced Rohit Sharma as the new ODI captain. The call was taken during Saturday's selection meeting, convened by chairman of selectors Ajit Agarkar, in Ahmedabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-trophy-mohsin-naqvi-mohammad-yousuf-india-vs-pakistan-2797626-2025-10-04",
      "headline": "After vile SKY remark, ex-Pak star says Naqvi right in denying India Asia CupAsia Cup 2025: Former Pakistan cricketer Mohammad Yousuf has defended Mohsin Naqvi, saying the Pakistan Cricket Board chief was right to withhold the Asia Cup trophy from India. Yousuf had made a vile remark about India captain Suryakumar Yadav last month."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}