{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/amul-cuts-prices-of-700-products-ghee-cheaper-by-rs-40-per-litre-from-september-22-mother-dairy-gst-rate-cuts-2790620-2025-09-20",
      "headline": "Amul cuts prices of 700 products, ghee cheaper by Rs 40 per litre from Sept 22Amul, marketed by the Gujarat Cooperative Milk Marketing Federation (GCMMF), on Saturday announced a price reduction for over 700 products, including ghee, butter, ice cream, cheese, and frozen snacks. The move comes after a GST rate cut, with the company passing the benefits to consumers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nasscom-warns-us-100000-h1b-visa-fee-impact-indian-it-firms-2790579-2025-09-20",
      "headline": "H-1B visa fee hike will disrupt Indian tech ops, 1-day deadline concerning: NasscomNasscom cautioned that Indian nationals employed on H-1B visas will be directly impacted, while technology companies will face disruption in ongoing client projects requiring onshore deployment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/is-your-itr-refund-delayed-heres-why-the-process-is-taking-longer-this-year-2790516-2025-09-20",
      "headline": "ITR refund delayed? Here's why the process may take longer this yearTax refunds this year are taking longer than usual, leaving many taxpayers waiting and prompting questions about delays, processing times, and what to expect in the weeks ahead."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/insurance-trap-india-mis-selling-policies-irdai-agent-rbm-commissions-bank-targets-financial-illiteracy-2790046-2025-09-20",
      "headline": "Why India's insurance market has become a breeding ground for mis-sellingFrom loans tied to unwanted policies to agents chasing fat commissions, insurance policies that were meant to shield families have instead become a trap for many. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cryptocurrency-a-bigger-challenge-to-dollar-than-brics-currency-says-wef-president-2790312-2025-09-19",
      "headline": "Cryptocurrency a bigger challenge to dollar than BRICS currency, says WEF PresidentSpeaking in an exclusive conversation with India Today TV, Brende said de-dollarisation is unlikely in the near term. He added that cryptocurrency is a bigger challenge to the dollar than a potential BRICS currency."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-powers-18-percent-of-global-growth-wef-president-borge-brende-sees-tariff-row-with-us-easing-soon-2790284-2025-09-19",
      "headline": "India powers 18% of global growth, WEF chief sees tariff row with US easing soonIn an exclusive interaction with India Today TV, WEF President Borge Brende described India's rapid expansion as a source of \"exported prosperity\" to the world. \"Just imagine what it means for global prosperity. So, you are exporting prosperity by growing so fast,\" he said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/a-widow-wait-a-worker-fight-the-human-struggle-behind-pf-claims-2790021-2025-09-19",
      "headline": "A widow's wait, a worker's fight: The human struggle behind PF claimsIn Part 2 of our series on the PF claim crisis, we look at why, for so many Indians, withdrawing their own savings has turned into a struggle, forcing them to fight for money that is rightfully theirs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/market-optimism-rises-after-sebi-clears-adani-group-hindenburg-allegations-2790095-2025-09-19",
      "headline": "Will October bring a market breakout? Earnings, GST price cuts fuel hopeAdani stocks led the rally on Thursday following Sebi's dismissal of Hindenburg Research allegations. Experts say this could mark the start of renewed market optimism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-387-points-lower-nifty-below-25400-adani-enterprises-gains-5-2790077-2025-09-19",
      "headline": "Sensex, Nifty end lower amid profit booking; Adani Group shares gainThe S&P BSE Sensex slipped 387.73 points to close at 82,626.23, while the NSE Nifty50 lost 96.55 points to settle at 25,327.05."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/explained-why-intel-shares-jumped-22-percent-after-nvidias-usd5-billion-investment-2789998-2025-09-19",
      "headline": "Explained: Why Intel shares jumped 22% after Nvidia's $5 billion investmentThe Nvidia-Intel deal not only fuels Intel's stock surge but strengthens its next-gen manufacturing and product integration, creating potential market shifts that could challenge competitors like AMD over the coming years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/waiting-for-your-itr-refund-here-is-how-to-track-it-2789924-2025-09-19",
      "headline": "Waiting for your ITR refund? Here is how to track itAfter filing your ITR, the next big question is, when will the refund come? Instead of guessing, you can quickly check the progress on the official portal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-500-points-nifty-down-why-is-the-stock-market-down-today-2789941-2025-09-19",
      "headline": "Sensex tumbles 500 points: Is the stock market rally over?Around midday, the S&P BSE Sensex was down 471.67 points, settling at 82,542.29, while the NSE Nifty50 declined 130.20 points to 25,293.40."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/malayalam-superstar-mohanlal-to-get-dadasaheb-phalke-award-2023-for-contribution-to-indian-cinema-2790610-2025-09-20",
      "headline": "Mohanlal to receive Dadasaheb Phalke Award for contribution to Indian cinemaMalayalam superstar Mohanlal is set to receive the Dadasaheb Phalke Award for contribution to Indian Cinema. The award will be presented to him at the 71st National Film Awards on September 23. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jennifer-aniston-the-morning-show-season-4-reese-witherspoon-want-to-come-to-india-2790599-2025-09-20",
      "headline": "Exclusive: Jennifer Aniston wants to come for silent retreat and meditation to IndiaHollywood star Jennifer Aniston shared in an exclusive interview that she wants her next visit to India to be centred on spirituality. She hopes to take part in a silent retreat and experience meditation in India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-salman-khan-schools-gaurav-mridul-over-inactivity-playing-safe-2790573-2025-09-20",
      "headline": "Bigg Boss 19: Salman Khan schools Gaurav, Mridul over inactivity, playing safeActor Salman Khan returned to Bigg Boss 19 after missing last week's episode. He schooled contestant Mridul Tiwari for playing too safe inside the reality series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saiyaara-aneet-padda-ahaan-panday-dating-in-real-life-what-we-know-so-far-2790563-2025-09-20",
      "headline": "Are Saiyaara's Aneet and Ahaan dating in real life? Here's what we knowActors Aneet Padda and Ahaan Panday, the lead pair from 'Saiyaara', are reportedly dating in real life. However, they have been advised to keep their relationship private for now."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-diplomat-season-3-trailer-keri-russell-lands-in-unexpected-political-storm-2790280-2025-09-20",
      "headline": "The Diplomat Season 3 trailer: Keri Russell lands in unexpected political stormThe first trailer for 'The Diplomat Season 3', featuring actors Keri Russell and Bradley Whitford was recently released. The new season promises intense political drama following the death of the president and rising tensions within the British government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/homebound-oscars-kareena-kapoor-khan-arjun-kapoor-ananya-panday-extend-wishes-2790557-2025-09-20",
      "headline": "Homebound picked for Oscars: Kareena, Arjun, Ananya and others extend wishesActors Kareena Kapoor, Arjun Kapoor, Ananya Panday, among other celebrities have congratulated the team behind 'Homebound.' The film has been selected as India's official entry for the 2026 Oscars. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kapil-sharma-netflix-show-faces-firoz-nadiadwala-rs-25-crore-suit-baburao-character-2790544-2025-09-20",
      "headline": "Kapil Sharma's Netflix show faces Rs 25 crore lawsuit over Baburao characterProducer Firoz Nadiadwala has issued a legal notice against Netflix for unauthorised use of the Baburao character. The lawsuit highlights serious copyright and trademark violations, demanding removal and apology."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/exclusive-jennifer-aniston-reese-witherspoon-discuss-ai-say-it-is-frightening-2790504-2025-09-20",
      "headline": "Exclusive: Jennifer Aniston, Reese Witherspoon discuss AI, say it's frighteningActors Jennifer Aniston and Reese Witherspoon discussed AI's impact, labelling it as 'frightening', in an exclusive interview with India Today. Their fourth season of their series 'The Morning Show', addresses AI, deepfakes, and media challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/manoj-bajpayee-the-family-man-season-3-update-raj-and-dk-prime-video-series-2790511-2025-09-20",
      "headline": "Manoj Bajpayee marks 6 years of The Family Man, shares Season 3 updateAs 'The Family Man' marked six years of release, actor Manoj Bajpayee shared an update on its third season. Directors Raj and DK also expressed gratitude to fans for the success of the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/akshay-kumar-stuntmen-the-great-indian-kapil-sharma-show-season-3-final-episode-2790493-2025-09-20",
      "headline": "Akshay Kumar credits career to stuntmen on The Great Indian Kapil ShowActor Akshay Kumar credited his career's success to stuntmen on 'The Great Indian Kapil Show season 3' finale. He also shared a light-hearted banter with the show's host Kapil Sharma and the rest of the cast as he engaged in playful activities. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jolly-llb-3-box-office-day-1-akshay-kumar-arshad-warsi-film-surpasses-sky-force-kesari-2-2790478-2025-09-20",
      "headline": "Jolly LLB 3 box office day 1: Akshay, Arshad's comedy surpasses Sky Force, Kesari 2Actor Akshay Kumar's 'Jolly LLB 3' opened to a Rs 12.5 crore net collection on day one. The courtroom comedy-drama also features actor Arshad Warsi in a pivotal character."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-episode-27-day-26-written-update-abhishek-bajaj-captain-baseer-ali-gaurav-khanna-2790473-2025-09-20",
      "headline": "Bigg Boss 19 episode 27: Abhishek becomes new captain, Baseer-Gaurav clashAbhishek Bajaj is the new captain of 'Bigg Boss 19' house. The actor won the position after a competitive task. In episode 27 of the reality show, a heated argument also erupted between Gaurav Khanna and Baseer Ali. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ishaan-khatter-vishal-jethwa-call-homebound-india-oscar-entry-moment-surreal-2790453-2025-09-20",
      "headline": "Ishaan Khatter, Vishal Jethwa call Homebound's India's Oscar entry moment surrealActors Ishaan Khatter and Vishal Jethwa reacted to 'Homebound' getting selected as India's entry for the 98th Academy Awards. The Neeraj Pandey directorial also features actor Janhvi Kapoor in a crucial role."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kaun-banega-crorepati-17-episode-30-written-update-amitabh-bachchan-pallavi-niphadkar-seven-miscarriages-2790463-2025-09-20",
      "headline": "KBC 17: Contestant Pallavi Niphadkar opens up about undergoing seven miscarriagesPre-primary teacher Pallavi Niphadkar opened up about experiencing seven miscarriages on the latest episode of 'Kaun Banega Crorepati'. She told host Amitabh Bachchan about her health struggles and shared how adoption brought positivity into her life. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/homebound-review-neeraj-ghaywan-film-on-caste-faith-holds-mirror-to-society-2790436-2025-09-20",
      "headline": "Homebound review: Neeraj Ghaywan's film on caste, faith holds a mirror to societyRelease Date:Fri Sep 26, 2025Homebound review: Director Neeraj Ghaywan's 'Homebound' is not just to be watched; it's a heavy, unforgettable cinematic experience that holds up a mirror to a reality you can no longer pretend you didn't know, leaving you with a profound sense of responsibility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/bollywoods-franchise-fever-why-filmmakers-keep-chasing-part-twos-and-universes-2789142-2025-09-20",
      "headline": "Bollywood's franchise fever: Why filmmakers keep chasing part twos and universesAre you a fan of franchises? Bollywood is hooked on them, banking on them and building universes for box-office wins. Experts from the industry shared why nothing but fresh storytelling can keep the magic alive. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/deepika-padukone-shares-emotional-post-6th-collaboration-with-shah-rukh-khan-post-kalki-exit-2790421-2025-09-20",
      "headline": "Deepika shares emotional post on 6th collaboration with SRK after exit from Kalki 2Actor Deepika Padukone confirmed her role in Shah Rukh Khan's upcoming film 'King' after leaving the 'Kalki 2989 AD sequel'. This move highlights ongoing industry shifts and creative disagreements in major film projects."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/zubeen-garg-final-moments-before-scuba-diving-accident-surface-viral-video-2790416-2025-09-20",
      "headline": "Zubeen Garg's final moments before scuba diving accident surface in viral videoAssamese singer Zubeen Garg died at the age of 52 following a scuba diving accident in Singapore. A video of him wearing a life jacket shortly before the tragedy has since gone viral online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/kiss-movie-review-a-cheesy-romantic-fantasy-starring-kavin-that-tugs-at-your-emotions-2790292-2025-09-19",
      "headline": "Kiss review: A cheesy romantic fantasy starring Kavin that tugs at your emotionsRelease Date:Fri Sep 19, 2025Kiss movie review: The Tamil film, written and directed by National award-winning choreographer Sathish Krishnan, stars Kavin and Preeti Israni in the lead. 'Kiss' is a breezy romantic film that is worth watching. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/skilled-talent-exchange-contributes-to-economic-growth-india-seeks-us-measures-to-address-h-1b-rule-impact-2790619-2025-09-20",
      "headline": "Skilled talent exchange drives growth: India on US' new H-1B visa rule impactThe Indian government urged the US to address the humanitarian impact of the new USD 100,000 annual H-1B visa fee, stressing that skilled talent exchange is vital for growth and innovation in both countries."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/us-h-1b-visa-techy-donald-trump-new-order-fees-congress-rahul-gandhi-kharge-2790560-2025-09-20",
      "headline": "India has a weak PM: Congress trains gun on Modi after Trump's H-1B clampdownCongress, led by Rahul Gandhi and Mallikarjun Kharge, criticised PM Modi as a \"weak\" leader whose foreign policy has failed to protect Indian interests after the US imposed a new $100,000 annual fee on H-1B visas. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-h1b-visa-fee-chaos-us-airports-indian-techies-flight-fares-new-york-2790508-2025-09-20",
      "headline": "India-US flight fares soar after Trump's H-1B visa move, airports see chaosNew H1B visa rules: H-1B holders in India saw a massive jump in the cost of a direct flight to the US as airlines looked to cash in on the chaos unleashed by US President Donald Trump."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/malayalam-superstar-mohanlal-to-get-dadasaheb-phalke-award-2023-for-contribution-to-indian-cinema-2790610-2025-09-20",
      "headline": "Mohanlal to receive Dadasaheb Phalke Award for contribution to Indian cinemaMalayalam superstar Mohanlal is set to receive the Dadasaheb Phalke Award for contribution to Indian Cinema. The award will be presented to him at the 71st National Film Awards on September 23. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/homebound-review-neeraj-ghaywan-film-on-caste-faith-holds-mirror-to-society-2790436-2025-09-20",
      "headline": "Homebound review: Neeraj Ghaywan's film on caste, faith holds a mirror to societyRelease Date:Fri Sep 26, 2025Homebound review: Director Neeraj Ghaywan's 'Homebound' is not just to be watched; it's a heavy, unforgettable cinematic experience that holds up a mirror to a reality you can no longer pretend you didn't know, leaving you with a profound sense of responsibility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-andy-pycroft-officiate-india-pakistan-super-4-clash-2790571-2025-09-20",
      "headline": "Andy Pycroft set to be match referee for IND vs PAK Super 4 clash: SourceAsia Cup 2025: Andy Pycroft will officiate the India-Pakistan Super 4 match despite earlier controversy during the group stage clash in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pay-100000-or-dont-enter-us-trumps-warning-to-h-1b-employees-2790487-2025-09-20",
      "headline": "No US entry from Sunday unless $100K paid: Trump's disruptive H-1B visa moveUS President Donald Trump signed a proclamation, saying that all H1-B employees, including current visa holders, should pay USD 100,000 (over Rs 88 lakh) every year through their employer or they will be barred from entering the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-w-vs-australia-w-smriti-mandhana-fastest-hundred-odi-history-2790618-2025-09-20",
      "headline": "Smriti Mandhana breaks Virat Kohli's record for fastest Indian century in ODIsSmriti Mandhana scored the fastest hundred by an Indian in ODI cricket history. She bettered Virat Kohli's record set way back in 2013 against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-h1b-visas-work-permit-chabahar-port-sanctions-india-pressure-tactics-2790490-2025-09-20",
      "headline": "Trump's $100,000 H-1B visa fee is a low blow to IndiaNew H-1B Visa Rules: Just three days ago, Donald Trump wished PM Modi on his birthday, signalling a thaw in ties. Two days later, he revoked the sanctions' waiver for Chabahar Port and imposed a $100,000 fee for H-1B visas. Is Trump playing the classic 'good cop, bad cop' negotiation strategy with India?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/the-80-gap-why-most-indians-are-underinsured-and-why-its-time-to-act-2787740-2025-09-15",
      "headline": "The 80% gap: Why most Indians are underinsured and why it's time to actThe solution lies in choosing a comprehensive life cover that reflects modern realities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/university-of-bath-school-of-management-where-careers-begin-with-confidence-2788009-2025-09-16",
      "headline": "University of Bath School of Management: Where Careers Begin With ConfidenceWith students from over 160 countries and a strong alumni network spanning 130 nations, the School creates a community that feels global in reach yet personal in experience. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/cyberattack-disrupts-flight-operations-in-london-brussels-and-other-major-european-airports-2790519-2025-09-20",
      "headline": "Cyberattack disrupts flights at London, Brussels and other major European airportsThe incident resulted in significant delays and numerous flight cancellations, impacting thousands of passengers across Europe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/trump-h1-b-visa-fee-order-hike-us-innovation-india-brain-drain-economy-2790448-2025-09-20",
      "headline": "Why Trump's H-1B crackdown could spark India's talent renaissanceSeveral Indians have lashed out at US President Donald Trump's executive order to impose a USD 100,000 (over Rs 88 lakh) annual fee on H-1B visas, saying the move will \"kill\" the American economy and boost the Indian economy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indias-biggest-enemy-is-dependence-says-pm-modi-amid-us-tariff-h-1b-visa-moves-2790603-2025-09-20",
      "headline": "India's biggest enemy is dependence, says PM Modi amid US tariff, H-1B visa movesPrime Minister Narendra Modi on Saturday said India's biggest adversary was its dependence on other nations, while urging for self-reliance in sectors from semiconductors to shipbuilding. His remarks came after the US imposed steep tariffs on Indian imports and raised H-1B visa fees drastically."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nasscom-warns-us-100000-h1b-visa-fee-impact-indian-it-firms-2790579-2025-09-20",
      "headline": "H-1B visa fee hike will disrupt Indian tech ops, 1-day deadline concerning: NasscomNasscom cautioned that Indian nationals employed on H-1B visas will be directly impacted, while technology companies will face disruption in ongoing client projects requiring onshore deployment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-hydrogen-bomb-congress-sir-vote-chori-bihar-elections-2025-backfire-mahagathbandhan-rjd-bjp-jdu-2789989-2025-09-20",
      "headline": "Will Rahul Gandhi's Hydrogen Bomb explode on the Congress?Congress leader Rahul Gandhi's all-out campaign on 'vote chori' and the SIR exercise has raised eyebrows within his own party, with fears it could alienate allies and voters in Bihar. With Gandhi building up the \"hydrogen bomb\" hype, the Congress faces a dangerous gamble."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-suryakumar-yadav-india-vs-pakistan-unfazed-by-hype-dubai-super-4-2790524-2025-09-20",
      "headline": "Don't know what you mean by rivalry: Suryakumar Yadav unfazed by India vs Pakistan hypeSuryakumar Yadav downplayed India-Pakistan rivalry, focusing on cricket and entertaining fans. India remains unbeaten in the Asia Cup, while Pakistan struggles with form and consistency, making the Super 4 clash a high-stakes, India-favoured encounter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-524-19-09-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/ulips-mutual-funds-why-you-need-both-for-a-balanced-portfolio-2789465-2025-09-19",
      "headline": "ULIPs & Mutual Funds: Why you need both for a balanced portfolioULIPs give you protection and discipline for the long haul, while mutual funds give you liquidity and flexibility for the near term."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/preschool-fees-soar-to-lakhs-as-toddler-education-becomes-big-business-2789638-2025-09-20",
      "headline": "Preschool fees soar to lakhs: Are parents paying for toddler education or gloss?Over the past couple of years, viral posts have exposed the steep rise in preschool fees, with parents in cities like Bengaluru, Delhi and Jaipur paying lakhs per year. Once affordable neighbourhood playschools, today's preschools are big business, offering things like robotics kits and glossy facilities, leaving many middle-class families torn between aspiration and financial strain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/bollywoods-franchise-fever-why-filmmakers-keep-chasing-part-twos-and-universes-2789142-2025-09-20",
      "headline": "Bollywood's franchise fever: Why filmmakers keep chasing part twos and universesAre you a fan of franchises? Bollywood is hooked on them, banking on them and building universes for box-office wins. Experts from the industry shared why nothing but fresh storytelling can keep the magic alive. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-saudi-arabia-mutual-defence-pact-military-support-india-2790466-2025-09-20",
      "headline": "Will Saudi step in if there is a war with India? Here's what Pak Minister saidPakistan's Defence Minister Khawaja Asif stated that under a new mutual defence pact with Saudi Arabia, both countries will provide military support if India or any other country launches an attack on either."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/humanity-weighty-story-from-ancient-slenderness-to-a-fat-crisis-triggered-by-genes-2790031-2025-09-20",
      "headline": "Humanity's Weighty Story: From ancient slenderness to a fat crisis triggered by genesHumanity's journey from ancient slender figurines to modern obesity reveals a complex story of genetic legacy, lifestyle shifts, and urbanisation. As the world faces a rising obesity epidemic, understanding this interplay is vital to tackling a growing public health crisis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-super-4-preview-india-pakistan-sri-lanka-bangladesh-2790417-2025-09-20",
      "headline": "Super 4 preview: Can Pakistan prove they are second-best Asian team?India, Pakistan, Sri Lanka and Bangladesh have reached the Super 4 stage of the Asia Cup. India are the clear favourites to win the trophy. But who is the second-best side in the competition?"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-w-vs-australia-w-smriti-mandhana-fastest-hundred-odi-history-2790618-2025-09-20",
      "headline": "Smriti Mandhana breaks Virat Kohli's record for fastest Indian century in ODIsSmriti Mandhana scored the fastest hundred by an Indian in ODI cricket history. She bettered Virat Kohli's record set way back in 2013 against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/noor-ahmad-mujeeb-ur-rahman-icc-code-afghanistan-asia-cup-sri-lanka-2790609-2025-09-20",
      "headline": "Afghanistan's Noor, Mujeeb reprimanded for breaching ICC Code of ConductAfghan spinners Noor Ahmad and Mujeeb ur Rahman have been handed official reprimands for Level 1 breaches of the ICC Code of Conduct during the Asia Cup Group B clash against Sri Lanka in Abu Dhabi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-women-highest-total-in-womens-odis-india-1997-world-cup-2790604-2025-09-20",
      "headline": "Beth Mooney helps Australia equal their highest-ever women's ODI totalBatting stalwart Beth Mooney produced a career-best knock while Georgia Voll and Ellyse Perry struck fluent half-centuries as Australia matched their highest-ever women's ODI total of 412 in the decisive third match against India at the Arun Jaitley Stadium on Saturday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hardik-pandya-downplays-india-pakistan-hype-asia-cup-2025-2790587-2025-09-20",
      "headline": "Asia Cup: Hardik Pandya downplays Pakistan match hype after close win over OmanHardik Pandya advised the team not to think too much ahead of their clash against Pakistan after their win over Oman. India are set to face Pakistan again in the Super 4 stage amid intense expectations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-andy-pycroft-officiate-india-pakistan-super-4-clash-2790571-2025-09-20",
      "headline": "Andy Pycroft set to be match referee for IND vs PAK Super 4 clash: SourceAsia Cup 2025: Andy Pycroft will officiate the India-Pakistan Super 4 match despite earlier controversy during the group stage clash in Dubai. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-cancels-press-conference-hire-motivational-speaker-for-india-clash-2790561-2025-09-20",
      "headline": "Pakistan cancel press conference, hire motivational speaker ahead of India clashPakistan cricket team has cancelled their pre-match press conference ahead of their Super 4 match against India in Asia Cup 2025. The team has brought in motivational speaker Dr Raheel Kareem to boost morale before the crucial game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-pep-guardiola-jibe-arsenal-liverpool-win-title-money-standards-2790559-2025-09-20",
      "headline": "If Arsenal or Liverpool win Premier League, it's money: Guardiola jibes at City rivalsPep Guardiola took aim at Arsenal and Liverpool ahead of City's Emirates clash, suggesting any Premier League success for his rivals is down to big spending. He stressed, however, that on-pitch performance, not money alone, will ultimately decide the title race."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/no-edge-for-india-over-pakistan-despite-big-win-in-group-stage-suryakumar-yadav-2790543-2025-09-20",
      "headline": "No edge for India over Pakistan despite big win in group stage: Suryakumar YadavIndia captain Suryakumar Yadav has said that his side will have no advantage over Pakistan, despite beating them handsomely in the group stages of the Asia Cup 2025. India and Pakistan will lock horns once again in the Super 4s on Sunday, September 21. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/aiff-new-constitution-explained-impact-indian-football-isl-future-politics-2790542-2025-09-20",
      "headline": "Promotion-Relegation, ISL's future: How the new constitution impacts Indian footballThe AIFF's constitution brings promotion-relegation, player and women representation, and stronger governance, creating a fairer, more competitive, and professional game across the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-suryakumar-yadav-india-batting-strategy-vs-oman-arshdeep-singh-2790531-2025-09-20",
      "headline": "Suryakumar Yadav explains batting-order change, jokes Arshdeep wanted to bat higherAsia Cup 2025: India's captain Suryakumar Yadav chose to send lower-order batters in the final overs against Oman. The move focused on developing squad depth while securing a win amid mixed public reactions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-cancels-press-conference-hire-motivational-speaker-for-india-clash-2790561-2025-09-20",
      "headline": "Pakistan cancel press conference, hire motivational speaker ahead of India clashPakistan cricket team has cancelled their pre-match press conference ahead of their Super 4 match against India in Asia Cup 2025. The team has brought in motivational speaker Dr Raheel Kareem to boost morale before the crucial game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-pep-guardiola-jibe-arsenal-liverpool-win-title-money-standards-2790559-2025-09-20",
      "headline": "If Arsenal or Liverpool win Premier League, it's money: Guardiola jibes at City rivalsPep Guardiola took aim at Arsenal and Liverpool ahead of City's Emirates clash, suggesting any Premier League success for his rivals is down to big spending. He stressed, however, that on-pitch performance, not money alone, will ultimately decide the title race."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/no-edge-for-india-over-pakistan-despite-big-win-in-group-stage-suryakumar-yadav-2790543-2025-09-20",
      "headline": "No edge for India over Pakistan despite big win in group stage: Suryakumar YadavIndia captain Suryakumar Yadav has said that his side will have no advantage over Pakistan, despite beating them handsomely in the group stages of the Asia Cup 2025. India and Pakistan will lock horns once again in the Super 4s on Sunday, September 21. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/aiff-new-constitution-explained-impact-indian-football-isl-future-politics-2790542-2025-09-20",
      "headline": "Promotion-Relegation, ISL's future: How the new constitution impacts Indian footballThe AIFF's constitution brings promotion-relegation, player and women representation, and stronger governance, creating a fairer, more competitive, and professional game across the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-suryakumar-yadav-india-batting-strategy-vs-oman-arshdeep-singh-2790531-2025-09-20",
      "headline": "Suryakumar Yadav explains batting-order change, jokes Arshdeep wanted to bat higherAsia Cup 2025: India's captain Suryakumar Yadav chose to send lower-order batters in the final overs against Oman. The move focused on developing squad depth while securing a win amid mixed public reactions."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}