{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-trade-war-fears-spook-markets-sensex-nifty-take-a-hit-as-rupee-weakens-2673983-2025-02-03",
      "headline": "Trade war fears spook markets: Sensex, Nifty take a hit as rupee weakensThe S&P BSE Sensex tanked by 319.22 points to end at 77,186.74, while the NSE Nifty50 lost 128.85 points to close at 23,353.30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/explained-reason-why-has-volkswagen-sued-the-indian-authorities-legal-angle-expert-2673959-2025-02-03",
      "headline": "Explained: Why Volkswagen has sued Indian authoritiesAccording to the government, Volkswagen broke down imports of some VW, Skoda, and Audi cars into separate components, instead of declaring them as completely knocked down (CKD) units."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-reviewing-crypto-stance-amid-global-policy-shift-us-donald-trump-report-2673919-2025-02-03",
      "headline": "India reviewing crypto stance amid global policy shift: ReportIndians have poured money into cryptocurrencies in recent years despite the country's tough regulatory stance and steep trading taxes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-regime-annual-salary-more-than-rs-12-lakh-can-you-still-save-tax-explained-deductions-2673868-2025-02-03",
      "headline": "Earn over Rs 12.75 lakh? You can still pay zero tax under new regimeWith a standard deduction of Rs 75,000 under the new regime, salaried taxpayers earning up to Rs 12.75 lakh annually do not need to pay any tax. But what if you have a higher annual income, say Rs 13 lakh or more? You could still end up paying no tax. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-regime-impact-on-different-salary-levels-calculations-explained-budget-2025-2673906-2025-02-03",
      "headline": "New income tax slabs: Check how much you'll save with these simple calculationsBudget 2025: Tax experts explain how the new income tax changes impact taxpayers across income levels, from Rs 6 lakh to Rs 1 crore, after the fresh proposals in the Union Budget 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/volkswagen-sues-indian-government-authorities-over-usd-14-billion-crore-tax-notice-report-2673843-2025-02-03",
      "headline": "Volkswagen sues Indian authorities over $1.4 billion tax notice: ReportThe tax dispute began in September 2024, when Indian authorities issued a $1.4 billion tax notice to Volkswagen's Skoda Auto Volkswagen India unit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indian-rupee-all-time-low-us-dollar-slumps-past-87-donald-trump-tariffs-2673821-2025-02-03",
      "headline": "Explained: Why rupee fell past 87 against US dollar to a record lowThe Indian rupee (INR) dropped to an all-time low of Rs 87.1450 per dollar, down 0.6% from Friday. It may be noted that the rupee has fallen almost 4% since October 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-crashes-700-points-why-is-the-indian-stock-market-falling-today-main-reasons-rupee-us-tariff-2673801-2025-02-03",
      "headline": "Sensex tanks 700 points: Why is the stock market falling today?Stock market crash: Sensex plunged over 700 points and Nifty lost nearly 300 points in early trade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rupee-hits-an-all-time-low-to-go-past-rs-87-against-us-dollar-heres-why-reason-trump-tariff-2673795-2025-02-03",
      "headline": "Rupee hits an all-time low to go past Rs 87 against US dollar. Here's why Rupee hit an all-time low, breaching 87 per US dollar for the first time. The sharp fall was mainly triggered by three executive orders signed by Trump over the weekend. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-stock-market-today-markets-in-red-sensex-drops-500-points-rupee-hits-record-low-2673786-2025-02-03",
      "headline": "Markets in red: Sensex drops 500 points, rupee hits record lowShare Market Today: The S&P BSE Sensex plunged 516.30 points to 76,989.66, while the NSE Nifty50 fell by 230.90 points to 23,251.25 as of 9:25 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-will-sensex-nifty-rally-after-budget-2025-key-stocks-to-buy-fmcg-sector-2673777-2025-02-03",
      "headline": "Stock market today: Will Sensex, Nifty rally after Budget 2025? Stocks to buyShare Market Today: Market experts believe that while the budget had some positive aspects, certain key areas did not meet expectations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/marginal-tax-relief-now-applies-to-income-up-to-rs-12-lakh-what-it-means-for-you-budget-2025-announcements-2673766-2025-02-03",
      "headline": "Zero tax up to income of Rs 12.75 lakh, but what if you earn Rs 12.76 or more?Union Budget 2025: One of the key highlights of Budget 2025 was that individuals earning up to Rs 12 lakh will not have to pay any income tax under the new tax regime."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nirmala-sitharaman-rupee-value-not-falling-us-dollar-rbi-2673597-2025-02-02",
      "headline": "Rupee not falling against any currency other than US dollar: Nirmala SitharamanFinance Minister Nirmala Sitharaman rejected criticism of the rupee's decline, stating it remains stable against most currencies despite a stronger US dollar. She attributed volatility to global factors and highlighted India's strong macroeconomic fundamentals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pazhampori-parippu-vada-ada-malayali-tea-stall-snacks-18-percent-gst-rate-2673379-2025-02-02",
      "headline": "Gone bananas! Most Kerala tea-time snacks come under 18% GST From 'pazhampori' to 'ada' and 'undam pori,' beloved Malayali tea-time snacks find themselves caught in the bewildering GST maze. These humble delicacies come with an 18 per cent GST tag, all because they do not have the required 'classification' to be put elsewhere."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/harley-davidson-import-duty-tax-price-drop-union-budget-imported-bikes-2673462-2025-02-02",
      "headline": "Harley-Davidson bikes to get cheaper as Centre cuts tariff amid Trump threatDonald Trump has consistently pushed for reducing trade barriers, especially on products that the US manufactures, and the high tariff on Harley-Davidson has been a point of contention in the past."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-increased-tds-limit-rs-50000-to-rs-100000-exemption-for-nss-big-relief-for-senior-citizens-2673279-2025-02-01",
      "headline": "Increased TDS limit, exemption for NSS: Big relief for senior citizens Budget 2025 announced major tax reforms for senior citizens, reducing their tax burden and giving a boost to their savings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pm-narendra-modi-budget-2025-consumption-growth-investment-savings-investment-praises-tax-relief-nirmala-sitharaman-2673294-2025-02-01",
      "headline": "Will boost savings, investment, consumption, growth: PM on BudgetPrime Minister Narendra Modi praised the Union Budget 2025, calling it a \"force multiplier\" that will boost savings, investment, consumption, and growth. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-tds-reforms-announced-and-limit-for-senior-citizens-doubled-2673246-2025-02-01",
      "headline": "TDS reforms announced, limit for senior citizens doubledBudget 2025: Finance Minister Nirmala Sitharaman announced an increase in the TDS threshold in the Union Budget 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pm-narendra-modi-congratulates-nirmala-sitharaman-finance-minister-everybody-praising-budget-2025-very-good-2673247-2025-02-01",
      "headline": "Everyone's praising you, Budget is very good: PM praises Nirmala SitharamanThe Prime Minister walked up to the bench where Nirmala Sitharaman was seated and expressed his gratitude for presenting her eighth and the Modi 3.0 government's first Budget today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/budget-2025-no-income-tax-payable-up-to-rs-12-lakh-says-nirmala-sitharaman-2673235-2025-02-01",
      "headline": "No tax payable up to Rs 12 lakh income: Budget bonanza for middle classFinance Minister Nirmala Sitharaman announced that taxpayers with salaries up to Rs 12 lakh would not be required to pay tax in the new tax regime. Sitharaman also proposed changes in the slab structure of the new income tax regime. \r\n"
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/shah-rukh-khan-asks-fans-support-launches-son-aryan-khan-directorial-debut-project-naam-ka-producer-the-bads-of-bollywood-2674218-2025-02-03",
      "headline": "SRK jokes about being 'Naam ka producer' at son Aryan's directorial launchShah Rukh Khan launched his son, Aryan Khan's directorial debut project, The Ba***ds of Bollywood, on February 3. During the Netflix event, the actor referred to himself as 'naam ka producer'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-bads-of-bollywood-shah-rukh-khan-launches-son-aryan-khans-directorial-debut-netflix-gauri-khan-2674180-2025-02-03",
      "headline": "The Ba***ds of Bollywood: SRK launches son Aryan Khan's directorial debut Shah Rukh Khan launched the upcoming project, The Ba***ds of Bollywood, which marks the directorial debut of his son, Aryan Khan. The actor unveiled the announcement video during the Netflix 2025 event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/test-teaser-r-madhavan-nayanthara-and-siddharth-set-for-test-of-life-2674171-2025-02-03",
      "headline": "Test teaser: R Madhavan, Nayanthara and Siddharth set for 'test of life'The teaser of TEST, starring R Madhavan, Nayanthara and Siddharth was unveiled on Monday. The upcoming cricket drama will stream on Netflix this year. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-royals-teaser-zeenat-aman-makes-a-comeback-ishaan-khatter-bhumi-pednekar-regal-drama-sakshi-tanwar-dino-morea-2674149-2025-02-03",
      "headline": "The Royals teaser: Zeenat Aman makes a comeback in Ishaan, Bhumi's royal love storyThe teaser of Ishaan Khatter and Bhumi Pednekar's The Royals is finally out. Set to stream on Netflix, the upcoming drama also stars Zeenat Aman, Sakshi Tanwar and Milind Soman in key roles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-tale-of-lady-ok-review-lim-ji-yeon-stars-in-a-standout-historical-k-drama-2674122-2025-02-03",
      "headline": "The Tale of Lady Ok review: Lim Ji-yeon stars in a standout historical K-dramaReleased-Mon Jan 06, 2025Unlike most Joseon-era dramas that revolve around kings, queens, and court politics, The Tale of Lady Ok dares to step outside the palace. Read on. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/khakee-the-bengal-chapter-teaser-neeraj-pandey-returns-with-high-stakes-crime-drama-2674100-2025-02-03",
      "headline": "Khakee The Bengal Chapter teaser: Neeraj Pandey promises darker, grittier sagaFilmmaker Neeraj Pandey's Khakee The Bengal Chapter was unveiled at the Netflix event today, February 3. The upcoming series will feature Prosenjit Chatterjee, Saswata Chatterjee, Parambrata Chatterjee, and others in key roles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/akka-keerthy-suresh-radhika-apte-epic-period-thriller-first-look-unveiled-2674098-2025-02-03",
      "headline": "Akka teaser: Keerthy Suresh, Radhika Apte fight for supreme power in YRF's showNetflix unveiled the first look teaser of its highly-anticipated period thriller drama, Akka. It stars Radhika Apte and Keerthy Suresh in indomitable avatars. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ishq-mein-song-from-nadaaniyan-ibrahim-ali-khan-and-khushi-kapoor-bring-their-a-game-in-romance-2674094-2025-02-03",
      "headline": "Ishq Mein song from Nadaaniyan: Ibrahim and Khushi bring their A-game in romanceThe team of Nadaaniyan released the first song from the film on Monday. The Netflix romantic drama marks the debut of Ibrahim Ali Khan with Khushi Kapoor. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kohhra-2-teaser-barun-sobti-leads-a-smooth-and-silky-but-intense-sequel-2674077-2025-02-03",
      "headline": "Kohhra 2 teaser: Barun Sobti leads a 'smooth and silky' but intense sequelBarun Sobti and Mona Singh feature in the sequel to Kohhra on Netflix. The teaser of the series promises an intense and mysterious experience by director Sudip Sharma and Faisal Rahman. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/aap-jaisa-koi-teaser-netfix-r-madhavan-fatima-sana-shaikh-film-heartwarming-tale-of-love-karan-johar-dharma-productions-2674073-2025-02-03",
      "headline": "Aap Jaisa Koi teaser: R Madhavan, Fatima in a heartwarming tale of love, laughterActors R Madhavan and Fatima Sana Shaikh are all set to share screen space in the upcoming drama, Aap Jaisa Koi, on Netflix. The streaming giant shared the teaser on February 3.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/rana-naidu-2-teaser-arjun-rampal-joins-rana-daggubati-venkatesh-in-tricky-face-off-2674058-2025-02-03",
      "headline": "Rana Naidu 2 teaser: Arjun Rampal joins Rana Daggubati, Venkatesh in tricky face-offThe teaser of the much-awaited Rana Naidu 2 was unveiled at a grand event on Monday. The second installment features a stellar cast of Venkatesh Daggubati, Rana Daggubati, Surveen Chawla and Arjun Rampal. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/delhi-crime-3-teaser-shefali-shah-returns-as-madam-sir-to-tackle-child-trafficking-2674045-2025-02-03",
      "headline": "Delhi Crime 3 teaser: Shefali Shah returns as Madam Sir to tackle child traffickingActor Shefali Shah-starrer Delhi Crime 3 was announced at the Netflix event on February 3. The streaming giant dropped the teaser of the upcoming gripping drama. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/photo/saif-ali-khan-r-madhavan-shefali-shah-rana-daggubati-celebs-at-netflix-slate-2025-event-2674035-2025-02-03",
      "headline": "Pics: Saif Ali Khan, R Madhavan, Shefali Shah, and others at Netflix event Several Bollywood stars gathered as Netflix India unveiled its 2025 slate on February 3. Take a look at the pictures here. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-jewel-thief-teaser-saif-ali-khan-is-the-most-suave-conman-in-heist-drama-with-jaideep-ahlawat-2674022-2025-02-03",
      "headline": "Jewel Thief teaser: Saif Ali Khan is the most suave conman in heist dramaSaif Ali Khan joined Jaideep Ahlawat in leading a heist drama titled Jewel Thief. Directed by Pathaan fame Siddharth Anand, the film will stream on Netflix this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/abhijeet-bhattacharya-defends-udit-narayan-amid-kiss-row-girls-were-after-him-2674004-2025-02-03",
      "headline": "Girls were after him: Abhijeet Bhattacharya defends Udit Narayan amid kiss rowFellow singer Abhijeet Bhattacharya sided with Udit Narayan following the viral incident in which the latter was criticised for kissing a female fan forcefully during his concert. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/samay-raina-amitabh-bachchan-kbc-16-episode-2673938-2025-02-03",
      "headline": "KBC 16: Samay Raina's wit and Big B's warmth made for an unforgettable episodeComedian Samay Raina left Amitabh Bachchan in splits on KBC's digital stars special episode, joking about his house Jalsa, Sooryavansham, and more. The episode was filled with laughter, fun moments, and heartwarming stories."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/pm-narendra-modi-congratulates-chandrika-tandon-for-grammy-win-we-take-great-pride-2673932-2025-02-03",
      "headline": "We take great pride: PM Modi congratulates Chandrika Tandon on Grammy winGrammy Awards 2025: Prime Minister Narendra Modi shared a note on social media, congratulating Indian-origin vocalist Chandrika Tandon for winning a Grammy Award on Monday. He talked about her undying passion for Indian culture and her other accomplishments. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/chandrika-tandon-reflects-on-power-of-music-after-grammy-win-2673920-2025-02-03",
      "headline": "Indian-origin artist Chandrika Tandon reflects on power of music after Grammy winIndian-origin entrepreneur and artist Chandrika Tandon celebrated her Grammy win for the album Triveni, highlighting music's power to unite and inspire. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-gets-snubbed-at-the-grammys-fans-call-recording-academy-a-joke-2673918-2025-02-03",
      "headline": "Taylor Swift gets snubbed at the Grammys. Fans call Recording Academy a jokeAt the 67th Grammy Awards, Taylor Swift, Ariana Grande, and Billie Eilish were left empty-handed despite multiple nominations. Beyonce, however, took home the Album of the Year award, adding to her impressive win tally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/sonu-nigam-back-spasm-needle-was-pricking-my-spine-watch-2673905-2025-02-03",
      "headline": "Sonu Nigam performs despite intense pain: Felt needle was pricking my spineSonu Nigam battled excruciating back pain before his Pune show but still delivered a stellar performance. Fans and fellow singers praised his dedication, calling him a true artist."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/us-military-flight-carrying-illegal-indian-migrants-left-country-news-agency-reuters-2674327-2025-02-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump begins deporting Indian migrants, military flight leaves country: ReportThe Donald Trump administration in the US began deporting illegal migrants to India, with a military flight leaving the country on Monday, officials said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-will-pause-tariff-on-canada-for-30-days-says-justin-trudeau-after-call-with-us-president-2674324-2025-02-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump pauses tariffs on Canada, Mexico after promise to boost border securityPresident Trump announced a 30-day delay in enforcing tariffs on Canadian imports after a series of calls with Prime Minister Trudeau, who pledged increased cooperation on border security concerns."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/union-finance-minister-slams-rahul-gandhi-over-lok-sabha-speech-stupid-self-confidence-2674117-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Stupid self-confidence: Finance Minister slams Rahul Gandhi over Lok Sabha speechUnion Finance Minister Nirmala Sitharaman criticised Rahul Gandhi over his speech in the Lok Sabha and said that the Congress MP wasn't \"qualified\" enough to talk about the Indian economy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-akash-bobba-indian-origin-engineer-aiding-musk-doge-team-2674227-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Akash Bobba, Indian-origin engineer aiding Musk's DOGE teamThe Elon Musk-led Department of Government Efficiency (DOGE) has come under scrutiny for hiring several young engineers, including Indian-origin Akash Bobba."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/queen-latifah-grammy-2025-outfit-rahul-mishra-noida-chandrika-tandon-manish-malhotra-2674076-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Queen Latifah's Grammy black outfit by Rahul Mishra was made in NoidaQueen Latifah wowed in an embellished black cape designed by Indian designer Rahul Mishra at the 67th Grammy Awards. On the other hand, Indian-origin vocalist Chandrika Tandon, who won her first Grammy this year, dazzled in a Manish Malhotra outfit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-us-president-donald-trump-meet-february-13-2674211-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "PM Modi, US President Donald Trump to meet on February 13Prime Minister Narendra Modi will meet US President Donald Trump on February 13, sources told India Today TV. This would be PM's first meeting with Trump since the US inauguration on January 20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/himanshu-sangwan-virat-kohli-wicket-ranji-trophy-bus-driver-5th-stump-line-2674223-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bus driver told me to bowl 5th-stump line to Virat Kohli: Himanshu SangwanRanji Trophy: Himanshu Sangwan has revealed that the bus driver of the Railways team advised him on how to dismiss Virat Kohli in the team's Ranji match against Delhi. Himanshu said that the driver told him to bowl fifth stump line vs the senior batter.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-tariff-mexico-claudia-us-delay-one-month-2674181-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Tariffs against Mexico delayed after Trump's 'friendly' chat with counterpartDonald Trump has decided to delay 25% tariffs on Mexican goods by one month. Mexico will deploy additional security to its northern border to stop flow of drugs into the US. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-bads-of-bollywood-shah-rukh-khan-launches-son-aryan-khans-directorial-debut-netflix-gauri-khan-2674180-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "The Ba***ds of Bollywood: SRK launches son Aryan Khan's directorial debut Shah Rukh Khan launched the upcoming project, The Ba***ds of Bollywood, which marks the directorial debut of his son, Aryan Khan. The actor unveiled the announcement video during the Netflix 2025 event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/a-celebration-of-rohit-bals-legacy-at-blenders-pride-fashion-tour-2025-2673256-2025-02-01?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "A Celebration of Rohit Bal's Legacy at Blenders Pride Fashion Tour 2025A grand celebration of Rohit Bal's iconic work at Blenders Pride Fashion Tour brought together his closest friends, industry icons, and admirers in an unforgettable evening honouring his legacy and artistic brilliance."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rahul-jinping-bjp-leader-sambit-patra-jabs-congress-mp-for-saying-china-34-times-in-parliament-2674257-2025-02-04?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Rahul Jinping': BJP jabs Congress MP for saying China '34 times' in ParliamentThe BJP claimed that Rahul Gandhi mentioned China 34 times in his Lok Sabha speech and BJP leader Sambit Patra sarcastically dubbed him \"Rahul Jinping\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/canada-news/story/ontario-province-canada-us-companies-contracts-elon-musk-starlink-deal-trump-tariffs-2674224-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Canada's Ontario bans US firms from contracts, scraps Elon Musk's Starlink dealCanada's Ontario province banned US companies from provincial contracts and scrapped a contract with Elon Musk's Starlink in the latest response to US President Donald Trump's tariff threat on Canada."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/video/kanye-west-wife-bianca-censoris-nude-outfit-reveal-at-grammys-2025-2673785-2025-02-03?utm_source=Videos_hp&utm_medium=Videos&utm_campaign=home_Videos",
      "headline": "Video: Kanye West's wife Bianca Censori's nude outfit reveal at Grammys 2025Kanye West and his wife Bianca Censori turned heads at the 67th Grammys with their unexpected appearance. Bianca's almost nude look at the event left everyone shocked. The couple were reportedly escorted out of the Grammys. It is being speculated that Bianca's controversial dress could have been the reason for the couple's ouster from the awards show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/uttarakhand-ucc-a-risk-or-opportunity-for-bjp-2673957-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Uttarakhand UCC a risk or opportunity for BJP?The legal step—the first by an Indian state—aims to standardise personal laws on marriage, divorce, inheritance, live-ins and succession across religions\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/d-gukesh-vs-magnus-carlsen-norway-chess-match-2674196-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Gukesh to face Carlsen in classical chess for 1st time since winning world titleD Gukesh is set to face Magnus Carlsen for the first time since becoming the world champion. Carlsen, one of the greatest players of all time, will face Gukesh in the classical format in Norway Chess 2025."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bjp-mps-privilege-motion-sonia-gandhi-poor-thing-remark-president-murmu-budget-session-2674044-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "BJP MPs' privilege motion against Sonia Gandhi for calling President 'poor thing'Rajya Sabha MP Sonia Gandhi faced a privilege motion from 21 tribal BJP MPs over her remarks on President Droupadi Murmu following her joint address to both Houses on January 31."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ishq-mein-song-from-nadaaniyan-ibrahim-ali-khan-and-khushi-kapoor-bring-their-a-game-in-romance-2674094-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ishq Mein song from Nadaaniyan: Ibrahim and Khushi bring their A-game in romanceThe team of Nadaaniyan released the first song from the film on Monday. The Netflix romantic drama marks the debut of Ibrahim Ali Khan with Khushi Kapoor. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kumbh-water-contaminated-bodies-disposed-river-jaya-bachchan-budget-session-parliament-2673985-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kumbh water most contaminated as bodies disposed of in river: Jaya BachchanSamajwadi Party MP Jaya Bachchan alleged that unidentified bodies were thrown into the river at the Maha Kumbh due to which the water there had become contaminated."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-canada-us-banking-controls-drug-trafficking-border-justin-trudeau-tariffs-trade-war-2674199-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump speaks to Trudeau amid major tariff war: Talks went very wellThe US President Donald Trump dialled Canadian Prime Minister Justin Trudeau twice on Monday, hours before new US tariffs on Canada were due to take effect. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-lauded-himanshu-sangwan-for-ranji-trophy-wicket-2673951-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kaafi teekhe bowler ho: How Kohli lauded Himanshu Sangwan for Ranji Trophy wicketStar India batter Virat Kohli showered massive praise on Himanshu Sangwan after he dismissed him in the Ranji Trophy 2024-25 match between Delhi and Railways."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/neet-2019-topper-nalin-khandelwal-cracked-neet-on-first-attempt-success-story-stmp-2673870-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "He cracked NEET 2019 on first attempt with 99.9999 percentile. Where is he now?NEET 2019 topper Nalin Khandelwal had cracked the medical entrance exam on his first attempt with an outstanding percentile of 99.9999291. Here's what he is doing now. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/10-warning-signs-of-cancer-you-shouldnt-ignore-2673940-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "10 warning signs of cancer you shouldn't ignoreIndia logs over 700,000 cancer cases every year. On World Cancer Day, how spotting the early signs of onset can not only save lives but ensure better treatment outcomes\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-us-visit-s-jaishankar-trump-coronation-invite-attack-2673997-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rahul Gandhi's lies damage nation abroad: S Jaishankar on 'Trump oath invite' digExternal Affairs Minister S Jaishankar has slammed Congress leader Rahul Gandhi for claiming that the Indian government sent him to the US to secure an invitation for Prime Minister Narendra Modi to attend Donald Trump's swearing-in ceremony, saying that an \"invite for PM Modi was never discussed\". "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/aaradhya-bachchan-delhi-high-court-fake-videos-online-platforms-google-notice-2674174-2025-02-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Aaradhya Bachchan moves High Court again seeking removal of fake videos onlineAaradhya Bachchan, the daughter of actors Abhishek Bachchan and Aishwarya Rai Bachchan, approached the Delhi High Court again, seeking the removal of fake videos about her health on YouTube and other websites."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/anurag-basu-begin-kartik-aaryan-aashiqui-3-shoot-march-2674254-2025-02-03",
      "headline": "Anurag Basu to begin Kartik Aaryan's Aashiqui 3 shoot in March Kartik Aaryan, Anurag Basu are all set to shoot for Aashiqui 3 in March. The director gave an update about the upcoming project in an interview. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/ranbir-kapoor-alia-bhatt-kajol-sachin-tendulkar-irfan-pathan-celebs-aamir-khan-junaid-khan-khushi-kapoor-loveyapa-screening-2674240-2025-02-03",
      "headline": "Ranbir-Alia, Kajol and others attend Junaid Khan, Khushi's Loveyapa screeningAamir Khan and the team of Loveyapa hosted a star-studded screening of the upcoming film on January 3. Take a look at the celebs who attended the event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/shah-rukh-khan-and-family-cheer-for-aryan-khan-at-directorial-debut-launch-2674186-2025-02-03",
      "headline": "SRK and family cheer for Aryan Khan at directorial debut launchAryan Khan's Ba***ds of Bollywood was launched at a grand event in Mumbai. It was attended by Aryan Khan, Shah Rukh Khan, Gauri Khan and Suhana Khan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saif-ali-khan-makes-his-first-public-appearance-after-knife-attack-at-netflix-event-2025-for-the-jewel-thief-2674030-2025-02-03",
      "headline": "Saif Ali Khan makes his 1st public appearance after knife attack, skips discussionActor Saif Ali Khan joined the team of his film, Jewel Thief: The Heist Begins, at the grand Netflix event in Mumbai on Monday. The actor looked healthy but refrained from talking about the injury. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-2025-punjab-kings-kuldeep-sen-2674261-2025-02-03",
      "headline": "Punjab Kings' Kuldeep Sen opens up on difficult cricketing journeyPunjab Kings pacer Kuldeep Sen has spoken about his touch journey in the world of cricket. Kuldeep said that when he started playing cricket, he could not let his father know as latter would have been mad at him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-marcus-rashford-reveals-why-he-decided-to-join-aston-villa-2674237-2025-02-03",
      "headline": "Premier League: Marcus Rashford reveals why he decided to join Aston VillaMarcus Rashford has revealed the reason why he decided to join Aston Villa on loan for the remainder of the season. Rashford also opened up on making a return to the UEFA Champions League. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sri-lanka-vs-australia-usman-khawaja-defends-peter-lalor-palestine-posts-2674228-2025-02-03",
      "headline": "Usman Khawaja defends journalist fired for Palestine posts: UnbelievableAustralia batter Usman Khawaja has jumped to the defence of journalist Peter Lalor, who was fired due to his social media posts about Palestine. Khawaja said that Lalor deserved better treatment. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/himanshu-sangwan-virat-kohli-wicket-ranji-trophy-bus-driver-5th-stump-line-2674223-2025-02-03",
      "headline": "Bus driver told me to bowl 5th-stump line to Virat Kohli: Himanshu SangwanRanji Trophy: Himanshu Sangwan has revealed that the bus driver of the Railways team advised him on how to dismiss Virat Kohli in the team's Ranji match against Delhi. Himanshu said that the driver told him to bowl fifth stump line vs the senior batter.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/danielle-collins-australian-open-hecklers-boos-five-star-vacay-2674212-2025-02-03",
      "headline": "Danielle Collins fulfils promise of 'five star vacay' after hecklers boo her World No.12 Danielle Collins went on a vacation to the Bahamas with her friends, fulfilling her promise of a 'five-star vacay' after being booed during her clash against Destanee Aiava in the second round of the Australian Open. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-champions-trophy-india-squad-varun-chakravarthy-ind-vs-eng-2674210-2025-02-03",
      "headline": "R Ashwin backs late Champions Trophy call-up for Varun ChakravarthyFormer India spinner Ravichandran Ashwin has backed Varun Chakravarthy to make a late entry in India's ODI squad vs England. Ashwin feels that Varun might also play the Champions Trophy 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/d-gukesh-vs-magnus-carlsen-norway-chess-match-2674196-2025-02-03",
      "headline": "Gukesh to face Carlsen in classical chess for 1st time since winning world titleD Gukesh is set to face Magnus Carlsen for the first time since becoming the world champion. Carlsen, one of the greatest players of all time, will face Gukesh in the classical format in Norway Chess 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-suryakumar-yadav-batting-poor-form-r-ashwin-2674179-2025-02-03",
      "headline": "Suryakumar Yadav needs to change his batting approach after poor run: R AshwinR Ashwin feels that Suryakumar Yadav needs to have a change in his batting approach after his poor run of form during the England T20I series. Suryakumar got out to almost the same delivery during the 5 matches. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-abhishek-sharma-bowling-harbhajan-singh-ranji-trophy-debut-2017-2674158-2025-02-03",
      "headline": "Batting is his first love, Abhishek needs to work more on bowling: HarbhajanIndia vs England: Former spinner Harbhajan Singh said he was delighted to see Abhishek Sharma blossom into a match-winning opener for India. Abhishek made his first-class debut under Harbhajan Singh for Punjab in 2017. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/india-vs-england-t20i-series-gautam-gambhir-top-moments-2674141-2025-02-03",
      "headline": "How Gautam Gambhir's new-age tactics outclassed England in T20I seriesIndia hammered England 4-1 in the T20I series under the coaching of Gautam Gambhir. While Gambhir has had a turbulent time in Test cricket, he has been exceptional at outwitting opponents in the shortest format of international cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-wpl-2025-ipl-smriti-mandhana-rcb-2674108-2025-02-03",
      "headline": "WPL can impact women's cricket the same way as IPL for men: Mandhana Smriti Mandhana said that the WPL could be a gamechanger for women's cricket, similar to how the IPL further popularised men's cricket. The left-handed batter is set to be in action when RCB start their campaign in WPL 2025 against Gujarat Giants. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/d-gukesh-vs-magnus-carlsen-norway-chess-match-2674196-2025-02-03",
      "headline": "Gukesh to face Carlsen in classical chess for 1st time since winning world titleD Gukesh is set to face Magnus Carlsen for the first time since becoming the world champion. Carlsen, one of the greatest players of all time, will face Gukesh in the classical format in Norway Chess 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-suryakumar-yadav-batting-poor-form-r-ashwin-2674179-2025-02-03",
      "headline": "Suryakumar Yadav needs to change his batting approach after poor run: R AshwinR Ashwin feels that Suryakumar Yadav needs to have a change in his batting approach after his poor run of form during the England T20I series. Suryakumar got out to almost the same delivery during the 5 matches. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-abhishek-sharma-bowling-harbhajan-singh-ranji-trophy-debut-2017-2674158-2025-02-03",
      "headline": "Batting is his first love, Abhishek needs to work more on bowling: HarbhajanIndia vs England: Former spinner Harbhajan Singh said he was delighted to see Abhishek Sharma blossom into a match-winning opener for India. Abhishek made his first-class debut under Harbhajan Singh for Punjab in 2017. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/india-vs-england-t20i-series-gautam-gambhir-top-moments-2674141-2025-02-03",
      "headline": "How Gautam Gambhir's new-age tactics outclassed England in T20I seriesIndia hammered England 4-1 in the T20I series under the coaching of Gautam Gambhir. While Gambhir has had a turbulent time in Test cricket, he has been exceptional at outwitting opponents in the shortest format of international cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-wpl-2025-ipl-smriti-mandhana-rcb-2674108-2025-02-03",
      "headline": "WPL can impact women's cricket the same way as IPL for men: Mandhana Smriti Mandhana said that the WPL could be a gamechanger for women's cricket, similar to how the IPL further popularised men's cricket. The left-handed batter is set to be in action when RCB start their campaign in WPL 2025 against Gujarat Giants. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-sanju-samson-bouncers-kris-srikkanth-yashasvi-jaiswal-2674096-2025-02-03",
      "headline": "Sanju Samson on an ego trip? Ex-captain disappointed with England T20I failuresIndia vs England: Sanju Samson managed just 51 runs in five matches in the recently-concluded T20I series at home. Samson was undone by bouncers from England's express pace bowlers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-womens-ashes-england-vs-australia-embarrassment-2674085-2025-02-03",
      "headline": "England ready for 'tough conversations' after Women's Ashes disaster  ECB boss Clare Conor said that England will have \"tough and honest conversations\" after the embarrassing 0-16 defeat against Australia in the Women's Ashes. For the first time since the multi-format Ashes was introduced, a team has come out victorious with a whitewash. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-virat-kohli-rohit-sharma-form-kevin-pietersen-2674067-2025-02-03",
      "headline": "Virat Kohli, Rohit Sharma have another couple of years in them: Kevin PietersenKevin Pietersen feels that Virat Kohli and Rohit Sharma can serve India for another couple of years. Rohit and Kohli will make a return to the Indian team for the England ODIs before they get ready for the Champions Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/luis-rubiales-kiss-scandal-trials-jenni-hermoso-rfef-spanish-football-federation-2674040-2025-02-03",
      "headline": "My boss should have not kissed me: Spanish footballer tells court during trialsSpanish footballer Jenni Hermoso has claimed that her former boss Luis Rubiales shouldn't have kissed her during the trials on Monday, January 3. Rubiales is currently undergoing trials and has been accussed of sexual assault. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/travis-head-australia-cricketer-of-the-year-allan-border-medal-2674020-2025-02-03",
      "headline": "Travis Head beats Pat Cummins by over 60 votes to win Allan Border MedalTravis Head beat Australia captain Pat Cummins by over 60 votes to win the 2024 Allan Border Medal on Monday, February 3. Head was honoured as Australia's cricketer of the year after a sensational show in all formats."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sanju-samson-fracture-finger-india-vs-england-ipl-return-injury-timeline-2674010-2025-02-03",
      "headline": "Sanju Samson fractures finger, set to be out of action until IPL 2025: ReportIndia vs England: Sanju Samson is set to spend time on the sidelines for more than a month. Scans revealed Sanju Samson suffered a fractured finger after taking a blow to his finger in the fifth T20I in Mumbai on January 2. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-jos-buttler-press-conference-shivam-dube-mumbai-2674006-2025-02-03",
      "headline": "Shivam Dube must have been happy with risk he took: Jos Buttler takes another digJos Buttler took another dig at the Indian team after Shivam Dube came back for the Mumbai T20I and shined with bat and ball. Dube was hit on the head during the Pune T20I and was controversially substituted for Harshit Rana. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sri-lanka-vs-australia-nathan-lyon-ruthless-test-series-2673990-2025-02-03",
      "headline": "Nathan Lyon wants Australia to become more ruthless, says 'Not there yet' SL vs AUS: Nathan Lyon said that Australia have plenty to work on to become more ruthless in Test cricket. Australia also advanced to the WTC final, having also recorded their biggest Test win on Sri Lankan soil, by an innings and 242 runs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/travis-head-australia-cricketer-of-the-year-allan-border-medal-2674020-2025-02-03",
      "headline": "Travis Head beats Pat Cummins by over 60 votes to win Allan Border MedalTravis Head beat Australia captain Pat Cummins by over 60 votes to win the 2024 Allan Border Medal on Monday, February 3. Head was honoured as Australia's cricketer of the year after a sensational show in all formats."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sanju-samson-fracture-finger-india-vs-england-ipl-return-injury-timeline-2674010-2025-02-03",
      "headline": "Sanju Samson fractures finger, set to be out of action until IPL 2025: ReportIndia vs England: Sanju Samson is set to spend time on the sidelines for more than a month. Scans revealed Sanju Samson suffered a fractured finger after taking a blow to his finger in the fifth T20I in Mumbai on January 2. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-jos-buttler-press-conference-shivam-dube-mumbai-2674006-2025-02-03",
      "headline": "Shivam Dube must have been happy with risk he took: Jos Buttler takes another digJos Buttler took another dig at the Indian team after Shivam Dube came back for the Mumbai T20I and shined with bat and ball. Dube was hit on the head during the Pune T20I and was controversially substituted for Harshit Rana. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sri-lanka-vs-australia-nathan-lyon-ruthless-test-series-2673990-2025-02-03",
      "headline": "Nathan Lyon wants Australia to become more ruthless, says 'Not there yet' SL vs AUS: Nathan Lyon said that Australia have plenty to work on to become more ruthless in Test cricket. Australia also advanced to the WTC final, having also recorded their biggest Test win on Sri Lankan soil, by an innings and 242 runs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-suryakumar-yadavs-best-fielder-of-the-series-medal-dhruv-jurel-t-dilip-2673980-2025-02-03",
      "headline": "Watch: Suryakumar Yadav's playful tease while announcing best fielder of the seriesIndia's T20I captain Suryakumar Yadav had a playful tease with his teammates as he announced the best fielder of the series award after the fifth T20I vs England. India beat England by 4-1 in the five-match series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-u19-womens-t20-world-cup-niki-prasad-heartbreak-glory-2673731-2025-02-03",
      "headline": "How Niki Prasad overcame heartbreak to bring India World Cup gloryBack in 2023, one of India's youngest scouts, Nisarg Naik, had predicted that Niki Prasad would lead India to victory in the U19 Women's T20 World Cup 2025. On Sunday, under Niki, India successfully defended their crown after beating South Africa in the final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-australia-vs-india-mitchell-marsh-jasprit-bumrah-nightmare-2673969-2025-02-03",
      "headline": "Bumrah nightmare continued: Marsh says nephew imitated pacer in backyardMitchell Marsh revealed how the 'Jasprit Bumrah nightmare' continued for him when his nephew imitated the Indian pacer's bowling action during a session of backyard cricket. Marsh was one of the batters Bumrah was able to trouble during the Border-Gavaskar Trophy series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-lauded-himanshu-sangwan-for-ranji-trophy-wicket-2673951-2025-02-03",
      "headline": "Kaafi teekhe bowler ho: How Kohli lauded Himanshu Sangwan for Ranji Trophy wicketStar India batter Virat Kohli showered massive praise on Himanshu Sangwan after he dismissed him in the Ranji Trophy 2024-25 match between Delhi and Railways."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}