{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/quadrant-future-tek-ipo-allotment-status-step-by-step-guide-gmp-today-listing-date-2662647-2025-01-10",
      "headline": "Quadrant Future Tek IPO: Check allotment status, latest GMP and listing dateQuadrant Future Tek IPO allotment: Investors who have bid for the IPO can check their allotment status online. They can log in to either the Bombay Stock Exchange (BSE) website or the website of Link Intime India Private Ltd. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/lt-defends-chairman-sn-subrahmanyan-90-hour-work-weeks-sunday-working-comment-amid-backlash-2662644-2025-01-10",
      "headline": "Nation-building at core: L&T defends chairman's 90-hour workweek callThe company said that achieving extraordinary results requires extraordinary effort, particularly in a time when India is striving for progress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-tcs-tata-elxsi-ireda-adani-wilmar-lt-mazagon-dock-2662632-2025-01-10",
      "headline": "Stocks to watch today: TCS, Tata Elxsi, IREDA, Adani Wilmar, L&T, Mazagon DockIn today's trade, several stocks such as TCS, IREDA, Adani Wilmar, Adani Total Gas are expected to be in focus due to corporate developments, quarterly results, and other news updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/budget-2025-how-indias-wealth-shifted-to-the-pockets-of-top-1-per-cent-2662386-2025-01-09",
      "headline": "Budget 2025: How India's wealth shifted to the pockets of top 1%About 11.4 per cent of India's total wealth was in the hands of the people in the bottom 50 per cent bracket in the year 1961, this nearly halved to 6.5 per cent in the year 2023, according to the World Inequality Database. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/national-savings-certificate-know-the-latest-rate-and-tax-benefits-under-section-80c-2662355-2025-01-09",
      "headline": "National Savings Certificate: Know the latest rate and tax benefitsNSCs are government-backed investments that provide attractive interest rates, tax benefits, and a five-year maturity, making them ideal for risk-averse investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/public-provident-fund-ppf-2025-benefits-interest-rates-and-other-details-2662329-2025-01-09",
      "headline": "PPF 2025: Benefits, interest rates, and other details PPF is a secure, tax-free savings option ideal for risk-averse investors seeking long-term financial growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-prepares-for-200000-job-cuts-as-artificial-intelligence-takes-over-report-2662298-2025-01-09",
      "headline": "Wall Street prepares for 200,000 job cuts as AI takes over: ReportAI's rise may cost 200,000 Wall Street jobs, boosting efficiency, profits, and reshaping roles in finance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-q3-fy25-dividend-financial-results-it-giant-announces-special-dividend-rs-66-check-details-2662285-2025-01-09",
      "headline": " TCS Q3 FY25 results: IT giant announces special dividend. Check detailsThe TCS Board of Directors declared a third interim dividend of Rs 10 per equity share and a special dividend for Q3 FY25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-q3-results-profit-rises-12-to-rs-12380-crore-announces-special-dividend-2662274-2025-01-09",
      "headline": "TCS Q3 Results: Profit rises 12% to Rs 12,380 crore; special dividend announcedTCS Q3 results: TCS's revenue for the quarter stood at Rs 63,973 crore, marking a 5.6% YoY increase (4.5% in constant currency). The operating margin was 24.5%, reflecting a YoY decline of 50 basis points but a sequential improvement of 40 basis points. The net margin for the quarter was 19.4%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-closes-500-points-lower-nifty-falls-reasons-behind-market-volatility-today-2662255-2025-01-09",
      "headline": "Sensex closes 500 points lower: Key reasons behind market volatility todayThe S&P BSE Sensex tanked 528.28 points to close at 77,620.21, while the NSE Nifty50 lost 162.45 points to end at 23,526.50. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-what-women-taxpayers-can-expect-tax-relief-credit-access-housing-loans-education-loans-2662245-2025-01-09",
      "headline": "Budget 2025: What women taxpayers can expectWomen taxpayers hope the Union Budget 2025 will offer tax relief, credit access, and support for education, entrepreneurship, and retirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/these-cash-transactions-may-trigger-100-percent-penalties-details-here-2662158-2025-01-09",
      "headline": "These cash transactions may trigger 100% penalties. Details hereThe Income Tax Department warns against excessive cash transactions, as violations can lead to heavy penalties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-leads-india-payments-from-disruption-to-monetisation-bernstein-2662157-2025-01-09",
      "headline": "Paytm leads India payments from disruption to monetisation: BernsteinBernstein's analysis underscores Paytm's potential for sustainable growth and profitability, citing key drivers of its success."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-q3-results-today-check-revenue-projection-dividend-key-expectations-2662148-2025-01-09",
      "headline": "TCS Q3 results today: Check revenue projection, dividend, key expectationsTCS Q3 results: Investor attention is likely to centre on TCS's commentary regarding client budgets and demand outlook for 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-long-can-you-stare-at-your-wife-lt-chairman-sn-subrahmanyan-wants-employees-to-work-on-sunday-2662134-2025-01-09",
      "headline": "'How long can you stare at wife?' L&T chief wants employees to work on SundaysL&T chairman SN Subrahmanyan's call for a 90-hour work week has reignited the work-life balance debate, adding to the uproar sparked by Narayana Murthy's 70-hour work week suggestion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/high-interest-fds-for-super-senior-citizens-check-sbi-pnb-rbl-indian-bank-union-bank-2662124-2025-01-09",
      "headline": "High-interest FDs for super senior citizens: Check SBI, PNB, RBL and more Banks like SBI, PNB, RBL, Indian Bank, and Union Bank are offering enhanced returns to help them secure a financially stable future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-donald-trump-wants-to-purchase-greenland-regain-control-of-panama-canal-2662081-2025-01-09",
      "headline": "Donald Trump wants Greenland: Here's what the island might costGreenland, a resource-rich Arctic gem, remains an ambitious dream amidst Trump's territorial aspirations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/capital-infra-trust-invit-ipo-check-latest-gmp-subscription-status-on-day-3-stmp-2662079-2025-01-09",
      "headline": "Capital Infra Trust InvIT IPO: Check latest GMP, subscription status on Day 3Capital Infra Trust InvIT IPO: The grey market premium (GMP) for the Capital Infra Trust InvIT IPO stood at Rs 0 on Thursday, indicating that the units were trading at their issue price of Rs 100 without any premium or discount in the grey market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-interim-dividend-q3-fy-2025-record-date-historical-payouts-details-expectations-financial-results-2662055-2025-01-09",
      "headline": "TCS to declare interim dividend today: Know record date and past dividendsTCS has already declared dividends totalling Rs 20 per share for FY25, with Rs 10 each announced in the first and second quarters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/srf-navin-fluorine-stock-price-jumps-nearly-14-percent-today-key-factors-explained-stmp-2662048-2025-01-09",
      "headline": "Explained: Why SRF and Navin Fluorine share price surged up to 14% todaySRF and Navin Fluorine stock price today: SRF Ltd's shares soared by 13.8% to a day's high of Rs 2,678.95 on the BSE in early trade, while Navin Fluorine International's shares surged 13.9% to Rs 3,974.15."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-refuses-to-reconsider-its-order-rejecting-legal-sanction-to-same-sex-marriage-2662486-2025-01-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Supreme Court refuses to reconsider order rejecting legality to same-sex marriageIn its latest ruling on same-sex marriages, the top court stated that there was \"no error apparent on the face of the record\" in its earlier judgment. The bench emphasised that the views expressed in the original verdict were in accordance with the law and required no further interference."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-weather-fog-visibility-flight-delay-trains-noida-haryana-punjab-air-quality-aqi-level-2662621-2025-01-10?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Dense fog blankets Delhi-NCR, zero visibility at airport hits flightsDense fog and biting cold gripped Delhi and parts of North India on Friday, reducing visibility to near zero. The Air Quality Index (AQI) in the national capital has deteriorated to a severe level of 409."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sneak-peek-into-pm-modi-upcoming-podcast-with-zerodha-co-founder-nikhil-kamath-im-human-not-god-2662496-2025-01-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "I'm human, not God: Sneak peek into PM's upcoming podcast with Nikhil KamathNikhil Kamath and PM Modi explored various themes, including the parallels between politics and entrepreneurship. Kamath shared his vision for the podcast, explaining his intent to highlight the common challenges faced by leaders in both fields. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/lt-defends-chairman-sn-subrahmanyan-90-hour-work-weeks-sunday-working-comment-amid-backlash-2662644-2025-01-10?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Nation-building at core: L&T defends chairman's 90-hour workweek callThe company said that achieving extraordinary results requires extraordinary effort, particularly in a time when India is striving for progress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/can-popping-supplements-help-you-manage-your-pcos-2662475-2025-01-10?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Can popping supplements help you manage your PCOS?The internet is obsessing over supplements as a way to manage and even treat PCOS."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/meerut-murder-5-of-family-found-dead-2-of-them-in-bed-box-in-uttar-pradesh-2662594-2025-01-10?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Family of 5 found dead at Meerut home, 3 bodies were inside bed boxFive members of a family were found dead inside their home in Meerut. The couple's bodies were found on the floor, while the children's bodies were hidden inside a bed box."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/game-changer-x-review-ram-charan-shankar-kiara-advani-political-thriller-2662631-2025-01-10?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Game Changer X reviews: Ram Charan scores, Shankar delivers neat political filmRam Charan's much-awaited Game Changer hit theatres on January 10 amid massive anticipation. With the early morning shows coming to an end, fans have been sharing their opinions on Shankar's film on X."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-claims-poisoned-covid-detention-australian-open-2022-2662628-2025-01-10?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Djokovic claims he was poisoned during Covid detention before Australian OpenNovak Djokovic has alleged that he was \"poisoned\" by food served during his detention in Melbourne in January 2022 amid a controversial visa saga. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yuzvendra-chahal-breaks-silence-amid-rumours-of-divorce-with-dhanashree-verma-2662561-2025-01-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Yuzvendra Chahal breaks silence amid rumours of divorce with Dhanashree VermaYuzvendra Chahal breaks his silence on divorce rumours with Dhanashree Verma, urging fans to avoid speculation. While addressing the pain caused by baseless claims, the cricketer reassures supporters of his focus on family values and career commitments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-hush-money-case-sentencing-supreme-court-lawfare-weaponization-justice-system-2662630-2025-01-10?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump rants about 'lawfare' as court refuses to halt hush money case sentencingTrump slammed the US Supreme Court's decision to deny his last-minute request to delay his sentencing in a hush money case, set for Friday, adding that he plans to appeal."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepika-padukone-criticises-lt-chairmans-call-for-daily-work-commitment-calls-it-shocking-2662400-2025-01-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Shocking: Deepika Padukone slams L&T chairman's call for working SundaysDeepika Padukone has expressed her disapproval of L&T Chairman's suggestion that employees should work seven days a week. She found the idea shocking and unfeasible."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/pune-entrepreneur-requests-blinkit-ceo-to-start-atm-like-service-sparks-debate-2662443-2025-01-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Pune entrepreneur requests Blinkit CEO to 'start ATM-like service', sparks debateThe suggested service would function like an ATM, enabling users to pay via UPI and receive cash at their doorstep within 10 minutes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/raveena-tandons-daughter-rasha-thadani-lights-up-the-screen-in-debut-song-uyi-amma-2662559-2025-01-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Raveena Tandon's daughter Rasha Thadani lights up the screen in debut song Uyi AmmaUyi Amma, the latest song from Raveena Tandon's daughter Rasha Thadani's Bollywood debut, was recently released. Fans are now raving about the debutante's dance moves in the music video, dubbing her the 'new-generation Raveena Tandon'.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/elon-musk-hosts-germanys-far-right-afd-party-chief-alice-weidel-on-x-german-elections-2025-2662611-2025-01-10?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Woke mind virus infected people: Musk hosts Germany's far-right party chief on XElon Musk endorsed Germany's far-right AfD party during a broadcast on X, urging voters to support Alice Weidel in the February election. Musk criticised Germany's energy policies and bureaucracy, drawing backlash from European leaders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/tirupati-stampede-andhra-pradesh-chief-minsiter-chandrababu-naidu-suspends-officials-calls-for-improved-crowd-management-2662420-2025-01-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Tirupati stampede: Chandrababu Naidu suspends officials, calls cop's actions wrongFollowing the stampede at Tirumala, Chief Minister Chandrababu Naidu suspended DSP Ramanakumar and Goshaala Director Harinath Reddy. He also transferred Tirupati SP Subbarayudu and Joint Commissioner Gouthami for lapses. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/palisades-wildfire-california-governor-gavin-newsom-shrugs-responsibility-for-empty-fire-hydrants-says-locals-will-figure-it-out-2662391-2025-01-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Locals will figure out: California Governor shrugs responsibility for dry hydrantsCalifornia Governor Gavin Newsom deflected responsibility for fire hydrants running out of water during the devastating Pacific Palisades fire, saying the \"local folks will figure it out\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/iit-roorkee-clarifies-after-idly-chutney-no-sambar-mail-sent-to-gate-aspirants-2662460-2025-01-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "IIT Roorkee clarifies after 'idly chutney no sambar' mail sent to GATE aspirantsIIT Roorkee has clarified and apologised for a technical glitch after GATE aspirants received emails addressed as \"Dear IDLI CHUTNEY NO SAMBHAR.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kl-rahul-likely-to-be-rested-from-white-ball-series-against-england-ind-vs-eng-2662597-2025-01-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "KL Rahul likely to be rested from white-ball series against EnglandStar India batter KL Rahul is likely to be rested from the upcoming white-ball series against England. India and England will play five T20Is and three ODIs beginning from 22nd January."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/parents-can-be-legally-compelled-to-offer-education-money-to-daughter-supreme-court-2662478-2025-01-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Parents can be legally compelled to offer education money to daughter: Top courtParents can be compelled to provide necessary funds within their means for their daughter's education, the Supreme Court said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/malayalam-singer-p-jayachandran-dies-at-80-2662485-2025-01-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Legendary Malayalam singer P Jayachandran dies at 80Veteran Malayalam playback singer P Jayachandran died on Thursday at the age of 80. With a career spanning over 16,000 songs in multiple languages, his soulful voice captivated countless hearts.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/maharashtra/story/caught-on-cctv-pune-man-kills-it-colleague-at-parking-lot-over-financial-dispute-2662213-2025-01-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Video: Woman stabbed by colleague at parking lot over financial dispute in PuneThe 28-year-old woman was stabbed by her colleague in the parking lot of their office. She succumbed to her injuries while undergoing treatment. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/california-wildfire-survivor-los-angeles-resident-shares-ordeal-fire-fighters-us-news-2662610-2025-01-10?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Everything was orange, it was scary: California resident describes raging wildfireSoukhya Inamdar, a West Hollywood resident, shared her experience of the raging Palisades fire. She described the chaos, evacuating after her supervisor alerted her to the fire's spread. She used a mobile app to track the fires."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-manoj-tiwary-hypocrite-explosive-interivew-kkr-harshit-rana-nitish-2662325-2025-01-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Gautam Gambhir a hypocrite, says Manoj Tiwary. KKR stars rally behind India coachFormer India batter Manoj Tiwary lashed out at Gautam Gambhir, accusing him of taking undue credit for Kolkata Knight Riders' successes in the IPL, both as captain and mentor, attributing these to effective PR. KKR pacer Harshit and former captain Nitish Rana responded to the comments in strongly worded statements on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/uk-news/story/fancy-cars-alcohol-white-girls-uk-grooming-gang-rape-sexual-exploitation-pattern-explained-2662193-2025-01-09?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Fancy cars, drugs, white girls: Pattern of UK grooming gangs explained in 5 pointsCases of sexual exploitation by grooming gangs in the UK have been going on for decades now, and were recently highlighted by Tesla boss Elon Musk to attack UK Prime Minister Keir Starmer. There was an unmistakable pattern of how girls as young as 11 were trapped and exploited by older men of the grooming gangs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/game-changer-song-naanaa-hyraanaa-removed-temporarily-2662648-2025-01-10",
      "headline": "Game Changer's NaaNaa Hyraanaa removed temporarily, to return on this dateRam Charan's Game Changer omits the romantic melody 'NaaNaa Hyraanaa' temporarily. The song, starring Ram Charan and Kiara Advani, will return to theatres on January 14."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshan-deeply-shocked-producer-pritish-nandy-death-2662645-2025-01-10",
      "headline": "Hrithik Roshan is 'deeply shocked and saddened' by Pritish Nandy's deathActor Hrithik Roshan mourned the death of producer Pritish Nandy. A luminary in Indian journalism and cinema died at 73 on January 8. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pushpa-2-tragedy-effect-telangana-theatres-regularise-entry-say-no-to-celebrations-crackers-2662643-2025-01-10",
      "headline": "Pushpa 2 tragedy effect: Telangana theatres regularise entry, say no to crackersOn December 4, a 35-year-old woman died in the stampede at Sandhya Theatre in Hyderabad during Pushpa 2 screening. After the arrest of the owners and Allu Arjun, theatres in Telangana have regularised entry and said no to big celebrations."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/game-changer-x-review-ram-charan-shankar-kiara-advani-political-thriller-2662631-2025-01-10",
      "headline": "Game Changer X reviews: Ram Charan scores, Shankar delivers neat political filmRam Charan's much-awaited Game Changer hit theatres on January 10 amid massive anticipation. With the early morning shows coming to an end, fans have been sharing their opinions on Shankar's film on X."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/inter-miami-coach-mascherano-downplays-neymar-link-up-messi-suarez-2662646-2025-01-10",
      "headline": "Inter Miami's Mascherano downplays talk of Neymar linking up with Messi, SuarezInter Miami manager Javier Mascherano said bringing Neymar to the club to reunite with his former Barcelona teammates Lionel Messi and Luis Suárez is \"impossible\" under Major League Soccer's salary cap rules.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-sports-minister-calls-for-boycotting-afghanistan-in-champions-trophy-2662642-2025-01-10",
      "headline": "South Africa minister calls for boycotting Afghanistan in Champions TrophySouth Africa sports minister Gayton McKenzie has called for a boycott of Afghanistan in the Champions Trophy. The call for a boycott has become prominent after the Taliban government's ongoing crackdown on women's rights."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/amad-diallo-extends-contract-with-manchester-united-until-2030-2662636-2025-01-10",
      "headline": "Amad Diallo extends contract with Manchester United until 2030Amad Diallo has signed a new five-and-a-half-year contract with Manchester United, keeping him at Old Trafford until June 2030. The 22-year-old winger has emerged as a standout performer this season despite the team's struggles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-indian-team-manoj-tiwary-ravi-ashwin-insulted-2662635-2025-01-10",
      "headline": "R Ashwin was insulted, deserved to retire with dignity: Manoj TiwaryFormer India cricketer Manoj Tiwary has once again hit out against Gautam Gambhir-led Indian team management. The former Bengal captain has said that India did not handle the Ravichandran Ashwin situation correctly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-claims-poisoned-covid-detention-australian-open-2022-2662628-2025-01-10",
      "headline": "Djokovic claims he was poisoned during Covid detention before Australian OpenNovak Djokovic has alleged that he was \"poisoned\" by food served during his detention in Melbourne in January 2022 amid a controversial visa saga. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kl-rahul-likely-to-be-rested-from-white-ball-series-against-england-ind-vs-eng-2662597-2025-01-09",
      "headline": "KL Rahul likely to be rested from white-ball series against EnglandStar India batter KL Rahul is likely to be rested from the upcoming white-ball series against England. India and England will play five T20Is and three ODIs beginning from 22nd January."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/manoj-tiwary-on-gautam-gambhir-india-head-coach-kolkata-knight-riders-kkr-ipl-2662588-2025-01-09",
      "headline": "Appointing Gambhir as India coach on the basis of IPL record was wrong: Manoj TiwaryFormer India cricketer Manoj Tiwary has launched a fresh attack on India head coach Gautam Gambhir saying that his appointment just on the basis of IPL results was wrong."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-nitish-kumar-reddy-gets-heros-welcome-at-vizag-airport-after-bgt-2662586-2025-01-09",
      "headline": "Watch: Nitish Kumar Reddy gets hero's welcome at Vizag airport after BGTNitish Kumar Reddy's maiden Test heroics in the Border-Gavaskar Trophy 2024 earned him a grand welcome in Vizag. Fans celebrated the all-rounder's remarkable journey with cheers, garlands, and yellow petals, marking the rise of a promising cricketing star."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ricky-ponting-on-sam-konstas-technique-border-gavaskar-trophy-2024-25-aus-vs-ind-2662572-2025-01-09",
      "headline": "Don't think Sam Konstas can survive as a Test opener playing like that: PontingLegendary Australia cricketer Ricky Ponting feels young opener Sam Konstas will be able to survive for long in Test cricket with his current style of play."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indian-team-selectors-to-meet-on-january-11-to-pick-t20i-squad-vs-england-2662569-2025-01-09",
      "headline": "Indian team selectors to meet on January 11 to pick T20I squad vs EnglandSelectors will announce India's T20I squad for the England series on January 11. With Test regulars likely to rest, fresh faces and fringe players could take centre stage, setting the tone for a busy cricket season ahead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yuzvendra-chahal-breaks-silence-amid-rumours-of-divorce-with-dhanashree-verma-2662561-2025-01-09",
      "headline": "Yuzvendra Chahal breaks silence amid rumours of divorce with Dhanashree VermaYuzvendra Chahal breaks his silence on divorce rumours with Dhanashree Verma, urging fans to avoid speculation. While addressing the pain caused by baseless claims, the cricketer reassures supporters of his focus on family values and career commitments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/manoj-tiwary-on-gautam-gambhir-india-head-coach-kolkata-knight-riders-kkr-ipl-2662588-2025-01-09",
      "headline": "Appointing Gambhir as India coach on the basis of IPL record was wrong: Manoj TiwaryFormer India cricketer Manoj Tiwary has launched a fresh attack on India head coach Gautam Gambhir saying that his appointment just on the basis of IPL results was wrong."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-nitish-kumar-reddy-gets-heros-welcome-at-vizag-airport-after-bgt-2662586-2025-01-09",
      "headline": "Watch: Nitish Kumar Reddy gets hero's welcome at Vizag airport after BGTNitish Kumar Reddy's maiden Test heroics in the Border-Gavaskar Trophy 2024 earned him a grand welcome in Vizag. Fans celebrated the all-rounder's remarkable journey with cheers, garlands, and yellow petals, marking the rise of a promising cricketing star."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ricky-ponting-on-sam-konstas-technique-border-gavaskar-trophy-2024-25-aus-vs-ind-2662572-2025-01-09",
      "headline": "Don't think Sam Konstas can survive as a Test opener playing like that: PontingLegendary Australia cricketer Ricky Ponting feels young opener Sam Konstas will be able to survive for long in Test cricket with his current style of play."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indian-team-selectors-to-meet-on-january-11-to-pick-t20i-squad-vs-england-2662569-2025-01-09",
      "headline": "Indian team selectors to meet on January 11 to pick T20I squad vs EnglandSelectors will announce India's T20I squad for the England series on January 11. With Test regulars likely to rest, fresh faces and fringe players could take centre stage, setting the tone for a busy cricket season ahead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yuzvendra-chahal-breaks-silence-amid-rumours-of-divorce-with-dhanashree-verma-2662561-2025-01-09",
      "headline": "Yuzvendra Chahal breaks silence amid rumours of divorce with Dhanashree VermaYuzvendra Chahal breaks his silence on divorce rumours with Dhanashree Verma, urging fans to avoid speculation. While addressing the pain caused by baseless claims, the cricketer reassures supporters of his focus on family values and career commitments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/james-vince-hits-seagull-big-bash-league-2024-25-melbourne-stars-sydney-sixers-2662493-2025-01-09",
      "headline": "Watch: James Vince's shot hurts seagull during Big Bash League fixtureEngland and Sydney Sixers batter James Vince hit a seagull with his shot during Big Bash League 2024-25 fixture against Melbourne Stars."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/malaysia-open-2025-satwik-chirag-reach-quarter-final-malvika-eliminated-2662484-2025-01-09",
      "headline": "Malaysia Open 2025: Satwik-Chirag reach quarter-final, Malvika eliminatedSatwik-Chirag kept India's hopes alive at the Malaysia Open 2025, storming into the quarter-finals. Prannoy's valiant effort ended in a narrow loss, while Malvika and other doubles pairs bowed out after fighting performances in the second round."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-women-vs-ireland-women-pratika-rawal-psychology-2662435-2025-01-09",
      "headline": "How being a psychology student helped Pratika Rawal ace international cricketYoung India batter Pratika Rawal recently opened up on the role her psychology studies played in shaping her cricketing career. Rawal recently made her debut in the three-match ODI series vs West Indies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/paris-saint-germain-kvicha-kvaratskhelia-transfer-news-napoli-january-window-2662398-2025-01-09",
      "headline": "PSG looking to seal Kvicha Kvaratskhelia signing from Napoli in January: Reports Paris Saint-Germain intensify their pursuit of Napoli star Khvicha Kvaratskhelia amid uncertainty over his future. With contract talks stalled, Luis Enrique eyes the Georgian winger as a key addition to bolster PSG's attacking firepower and European ambitions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/malaysia-open-hs-prannoy-pre-quarters-defeat-indian-mens-singles-campaign-2662394-2025-01-09",
      "headline": "HS Prannoy out in pre-quarters as Indian men's singles campaign endsMalaysia Open 2025: HS Prannoy lost to higher-ranked Li Shi Feng of China after a valiant battle that lasted an hour and 22 minutes on Thursday. With that defeat, Indian men's singles campaign in the season-opening tournament in Kuala Lumpur came to an early end. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-w-vs-ire-w-smriti-mandhana-reveals-reason-behind-harmanpreet-and-shafalis-absence-from-india-squad-2662380-2025-01-09",
      "headline": "Captain Smriti Mandhana explains Shafali Verma's absence from India's ODI squadSmriti Mandhana reveals why Harmanpreet Kaur, Shafali Verma, and Renuka Singh are missing from India's ODI squad against Ireland. Backing youngsters, she highlights Shafali's domestic exploits and emphasizes a positive mindset with a balanced squad for the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/adam-gilchrist-shares-his-thoughts-on-rohit-sharmas-test-and-odi-future-2662358-2025-01-09",
      "headline": "I don't see Rohit Sharma going to England: Adam Gilchrist on India captain's futureFormer Australia wicketkeeper-batter Adam Gilchrist recently shared his thoughts on India captain Rohit Sharma's future and said that the opening batter will not go to England later this year for the Test series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/juventus-priority-signing-ronald-araujo-fc-barcelona-january-transfer-window-arsenal-2662349-2025-01-09",
      "headline": "Juventus pushing to sign Barcelona's Araujo as priority defender: ReportsJuventus is targeting Barcelona's defensive star Ronald Araújo as a priority signing for January, but Arsenal's interest could spark a fierce battle. With contract talks stalled, Barcelona faces a tough decision on their prized centre-back's future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/malaysia-open-hs-prannoy-pre-quarters-defeat-indian-mens-singles-campaign-2662394-2025-01-09",
      "headline": "HS Prannoy out in pre-quarters as Indian men's singles campaign endsMalaysia Open 2025: HS Prannoy lost to higher-ranked Li Shi Feng of China after a valiant battle that lasted an hour and 22 minutes on Thursday. With that defeat, Indian men's singles campaign in the season-opening tournament in Kuala Lumpur came to an early end. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-w-vs-ire-w-smriti-mandhana-reveals-reason-behind-harmanpreet-and-shafalis-absence-from-india-squad-2662380-2025-01-09",
      "headline": "Captain Smriti Mandhana explains Shafali Verma's absence from India's ODI squadSmriti Mandhana reveals why Harmanpreet Kaur, Shafali Verma, and Renuka Singh are missing from India's ODI squad against Ireland. Backing youngsters, she highlights Shafali's domestic exploits and emphasizes a positive mindset with a balanced squad for the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/adam-gilchrist-shares-his-thoughts-on-rohit-sharmas-test-and-odi-future-2662358-2025-01-09",
      "headline": "I don't see Rohit Sharma going to England: Adam Gilchrist on India captain's futureFormer Australia wicketkeeper-batter Adam Gilchrist recently shared his thoughts on India captain Rohit Sharma's future and said that the opening batter will not go to England later this year for the Test series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/juventus-priority-signing-ronald-araujo-fc-barcelona-january-transfer-window-arsenal-2662349-2025-01-09",
      "headline": "Juventus pushing to sign Barcelona's Araujo as priority defender: ReportsJuventus is targeting Barcelona's defensive star Ronald Araújo as a priority signing for January, but Arsenal's interest could spark a fierce battle. With contract talks stalled, Barcelona faces a tough decision on their prized centre-back's future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/australia-vs-india-podcast-bgt-rohit-sharma-virat-kohli-future-gautam-gambhir-2662335-2025-01-09",
      "headline": "BGT gone: Should Rohit Sharma and Virat Kohli be part of India's Test future?India surrendered the Border-Gavaskar Trophy after seven years following a disappointing campaign that concluded in Sydney. The team unravelled after their loss in Melbourne, and Jasprit Bumrah's absence denied them the opportunity to push for a series-levelling win in Sydney. Is it fair to point fingers at individuals? Or is this a collective failure of the Indian team?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-women-vs-ireland-women-squads-schedule-live-streaming-smriti-mandhana-2661682-2025-01-09",
      "headline": "India Women vs Ireland Women ODI series: Squads, all you need to knowIND-W vs IRE-W: Smriti Mandhana's India and Gaby Lewis' Ireland will be up against each other in the upcoming three-match ODI series, starting January 10 at the Saurashtra Cricket Association Stadium in Rajkot. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-manoj-tiwary-hypocrite-explosive-interivew-kkr-harshit-rana-nitish-2662325-2025-01-09",
      "headline": "Gautam Gambhir a hypocrite, says Manoj Tiwary. KKR stars rally behind India coachFormer India batter Manoj Tiwary lashed out at Gautam Gambhir, accusing him of taking undue credit for Kolkata Knight Riders' successes in the IPL, both as captain and mentor, attributing these to effective PR. KKR pacer Harshit and former captain Nitish Rana responded to the comments in strongly worded statements on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/narayan-jagadeesan-smashes-six-fours-in-an-over-against-rajasthans-aman-shekhawat-in-vijay-hazare-trophy-2662317-2025-01-09",
      "headline": "Watch: N Jagadeesan smashes 6 consecutive fours in an over in Vijay Hazare TrophyTamil Nadu opener Narayan Jagadeesan smashed six fours in an over against Rajasthan's Aman Shekhawat during the pre-quarterfinal game of Vijay Hazare Trophy 2024-25."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}