{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/siemens-may-cut-up-to-5000-jobs-amid-ongoing-struggles-2633486-2024-11-14",
      "headline": "Siemens layoffs: Tech giant may cut up to 5,000 jobs amid ongoing strugglesThe company's Q4 FY 2024 results highlighted the impact of global geopolitical and macroeconomic challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-nifty-fall-six-straight-sessions-fii-selling-continues-fmcg-shares-2633390-2024-11-14",
      "headline": "Sensex, Nifty fall for 6th straight session as FMCG stocks decline sharplyThe S&P BSE Sensex ended 110.64 points lower at 77,580.31 at the closing bell, while the NSE Nifty50 fell 26.35 points to 23,532.70."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-poor-service-standards-bureau-of-indian-standards-investigation-2633362-2024-11-14",
      "headline": "More trouble for Ola Electric, faces probe over poor service standards: ReportThis comes after the Central Consumer Protection Authority (CCPA) issued a notice to the SoftBank-backed e-scooter maker following a high volume of complaints."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/boeing-layoffs-aerospace-giant-reduce-workforce-by-17000-warn-letter-2633348-2024-11-14",
      "headline": "Boeing layoffs: Aerospace giant to reduce workforce by 17,000Boeing Layoffs: The aerospace giant has faced financial challenges this year, pushing it to make these deep cuts to realign its current financial realities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdfc-icici-sbi-itc-titan-stocks-sector-safe-bet-market-fall-infrastructure-housing-finance-investing-tips-2633338-2024-11-14",
      "headline": "Markets in free fall: These sectors and stocks can be safe betsBoth the Sensex and Nifty indices have fallen around 10% from their 52-week peaks, marking a notable slump in the market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-price-rise-cypto-bull-run-memecoin-dogecoin-donald-trump-push-tokens-soaring-2633317-2024-11-14",
      "headline": "Donald Trump's crypto push: Not just Bitcoin, even these tokens are soaringThe bull run is not only crucial in terms of Bitcoin's valuation but also in its wider impact on the altcoin market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-correction-phase-sensex-nifty-fall-sixth-stright-session-trump-factor-fii-selling-2633278-2024-11-14",
      "headline": "Trump factor, FII selling: Why Sensex, Nifty fell for 6th straight sessionThe benchmark Sensex dropped over 250 points, while the Nifty fell over 100 points during intraday trade, marking a significant 10% decline from their September peaks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/income-tax-changes-budget-2025-simpler-filing-lower-brackers-all-key-details-2633226-2024-11-14",
      "headline": "Can you expect major income tax changes in Budget 2025? Check detailsThe Finance Ministry has established 22 specialised sub-committees to examine various aspects of the Income Tax Act, with an aim to simplify tax structures, expand tax base, and balance revenue generation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jio-financial-services-share-price-jump-6-percent-today-nse-futures-and-options-inclusion-2633213-2024-11-14",
      "headline": "Explained: Why Jio Financial Services share price surged over 6% todayJio Financial Services share price: At midday, JFS shares were trading at Rs 318.70, marking a 6.45% increase. The development came as a relief for the stock, which has seen declines in recent months but has gained attention for its potential in the derivatives market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/swiggy-share-price-fall-3-percent-should-you-buy-or-avoid-2633177-2024-11-14",
      "headline": "Swiggy share price falls 3% after listing. Should you buy or avoid?Swiggy share price: The drop comes after a decent debut, closing at Rs 455.95 the previous day, marking a 10.67% rise from its initial listing price."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/eicher-motors-share-price-gains-over-7-percent-after-q2-results-buy-hold-sell-2633159-2024-11-14",
      "headline": "Eicher Motors share price jumps over 8% after Q2 results. Should you buy?Eicher Motors share price: Royal Enfield's parent company posted an 8% year-on-year net profit increase to Rs 1,100 crore, up from Rs 1,016 crore a year earlier. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/niva-bupa-shares-listing-stock-price-decent-d-street-debut-lists-at-6-percent-premium-bse-nse-2633146-2024-11-14",
      "headline": "Niva Bupa share price: Stock lists at 6% premium on D-Street debutNiva Bupa shares listing: Shares of Niva Bupa listed at Rs 78.50 on the Bombay Stock Exchange at a premium of 6.08%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-marginally-higher-eicher-motors-shares-gain-7-percent-2633138-2024-11-14",
      "headline": "Sensex, Nifty open marginally higher; Eicher Motors shares gain 7% The S&P BSE Sensex was up 62.80 points to 77,753.75, while NSE Nifty50 gained 6.60 points to 23,565.65."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-price-today-breaches-usd-93000-mark-amid-donald-trump-pro-crypto-stance-2633133-2024-11-14",
      "headline": "Bitcoin breaches $93,000 mark amid Donald Trump's pro-crypto stanceBitcoin touched $93,400 at its peak, before settling around $90,000 as traders monitored its path toward the significant $100,000 level."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trading-setup-today-stock-market-shares-gift-nifty-starts-lower-down-stocks-to-watch-2633114-2024-11-14",
      "headline": "GIFT Nifty starts in red, down 10 points; market trading setup for todayThe stock market has been struggling due to sustained foreign fund outflows, weakening demand in certain sectors, and a fluctuating rupee."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/top-stocks-to-watch-today-varun-beverages-hero-motocorp-cipla-grasim-2633099-2024-11-14",
      "headline": "Top stocks to watch today: Varun Beverages, Hero MotoCorp, Cipla, Grasim Stocks to watch: Several major stocks such as Grasim, Hero MotoCorp, and Honasa Consumer are likely to draw attention due to company updates and the release of quarterly results."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/union-budget-2025-income-tax-filing-simplification-act-amendment-finance-ministry-2632972-2024-11-13",
      "headline": "Major income tax reforms in pipeline, Budget 2025 to ease filing process: SourcesThe upcoming Union Budget 2025-26 is set to simplify India's Income Tax Act, by streamlining tax filing processes, reducing compliance burdens and expanding the tax base, Finance Ministry sources told India Today TV."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/swiggy-ipo-listing-gains-70-dollar-millionaires-500-crorepati-employees-2632844-2024-11-13",
      "headline": "Inside Swiggy's listing gains: 70 dollar millionaires, 500 crorepati employees Swiggy market listing: As many as 70 current and former employees stand to become dollar millionaires."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-price-rise-donald-trump-sparking-a-crypto-surge-ether-dogecoin-2632814-2024-11-13",
      "headline": "'Trump time' for Bitcoin: How Donald Trump is sparking a crypto surgeSeveral industry experts believe Bitcoin's growth could accelerate under a more supportive US administration."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-down-1000-points-nifty-tumbles-bloodbath-dalal-street-2632798-2024-11-13",
      "headline": "Sensex drops 1,000 points, Nifty slips below 23,600 amid stock market turmoilStock market today: The S&P BSE Sensex ended 984.23 points lower at 77,690.95 at the closing bell, while the NSE Nifty50 fell 324.40 points to settle at 23,559.05."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-air-pollution-aqi-severe-online-classes-primary-students-2633511-2024-11-14",
      "headline": "Primary schools in Delhi shift to online classes as pollution chokes cityThe decision to move primary classes online was made following the imposition of restrictions under Stage 3 of the Graded Response Action Plan (GRAP) in Delhi-NCR."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/agra/story/agra-air-quality-monitoring-systems-india-today-investigation-data-manipulation-row-2633492-2024-11-14",
      "headline": "India Today probe reveals how effective Agra's air quality monitoring systems areAmid allegations of potential manipulation of air quality data in Agra, an India Today TV team conducted an on-ground investigation of the air quality monitoring system across several locations in the city."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/india-today-expose-evm-whistleblower-syed-shuja-rigging-machines-maharashtra-elections-mva-mahayuti-2633527-2024-11-14",
      "headline": "'Whistleblower' offers to hack EVMs for Maharashtra MP for Rs 53 croreIndia Today's special investigation team, with one of them posing as the personal assistant of an MP, got in touch with self-proclaimed cyber expert Syed Shuja via a video call to probe his claims of getting the EVMs hacked."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-anti-vaccine-activist-robert-f-kennedy-jr-health-secretary-2633597-2024-11-15",
      "headline": "Trump appoints anti-vaccine activist Robert F Kennedy Jr as health secretaryPresident-elect Donald Trump's decision of nominating Robert F Kennedy Jr as Health Secretary drew alarm from public health experts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/video/will-ladki-bahin-be-maharashtra-game-changer-rajdeep-sardesais-ground-report-2633542-2024-11-14",
      "headline": "Will Ladki Bahin be Maharashtra game-changer? Rajdeep Sardesai's ground reportIn this episode of Maharashtra Majha with Rajdeep Sardesai, watch what women of Maharashtra have to say about the Ladki Bahin Yojana, which was rolled out by Maharashtra Chief Minister Eknath Shinde. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/canada-news/story/khalistani-terrorist-arsh-dalla-arshdeep-singh-gill-arrested-in-canada-india-relationship-strain-hardeep-singh-nijjar-2633497-2024-11-14",
      "headline": "How Arsh Dalla, a Punjab gangster, turned into Khalistani terrorist in CanadaArshdeep Singh Gill, alias Arsh Dalla, a Khalistani terrorist and one of India's most wanted, has been arrested in Canada. This is how Dalla, a local gangster in Punjab, moved to Canada in 2020 and became a Khalistani terrorist with an international network."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/delhi-smog-air-pollution-grap-3-restrictions-2633302-2024-11-14",
      "headline": "GRAP-III pollution curbs in Delhi from today. See what is bannedStage 3 of GRAP is activated when the AQI reaches 'severe' levels, enforcing restrictions on construction, demolition, and public activities to reduce pollution."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/chennai/story/chennai-doctor-stabbing-accused-vignesh-mother-defends-son-say-he-loves-me-too-much-2633422-2024-11-14",
      "headline": "Patient defends son who stabbed Chennai doctor 7 times: He loves me too muchThe accused's mother further claimed she had been misinformed about her own diagnosis, insisting she was told she had Stage 2 cancer rather than the Stage 5 cancer diagnosis reportedly circulating in the hospital. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/us-california-suspects-use-bear-costume-fake-attack-luxury-cars-insurance-fraud-2633563-2024-11-14",
      "headline": "4 suspects in US use costume to stage 'bear attacks' on Rolls-Royce, MercedesDubbed \"Operation Bear Claw\" by the California Department of Insurance (CDI), the investigation revealed that the suspects submitted staged footage supposedly showing a bear tearing up luxury cars."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/harnessing-the-power-of-data-iim-kozhikodes-professional-certificate-programme-in-advanced-data-analytics-for-managers-2631624-2024-11-11",
      "headline": "Harnessing the Power of Data: IIM Kozhikode's Professional Certificate Programme in Advanced Data Analytics for ManagersEmpowering Managers with Data-Driven Insights for Strategic Decision-Making"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education-today/news/story/uppsc-exams-single-shift-yogi-adityanath-government-protesting-candidates-2633373-2024-11-14",
      "headline": "UP government rolls back decision on key job exams amid protests by candidatesThe Provincial Civil Services (PCS) exam was to be held in two shifts on December 7 and 8. However, candidates had been demanding that the exam be conducted in a single shift."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/what-odisha-govts-rein-in-order-to-bureaucrats-signals-2633282-2024-11-14",
      "headline": "What Odisha government's rein-in order to bureaucrats signalsThe warning against lobbing for postings is seen as a crackdown on the bureaucracy, which was perceived to enjoy widespread powers during the Naveen Patnaik regime\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/four-year-old-boy-survives-minor-injuries-car-runs-over-him-betul-madhya-pradesh-accident-2633569-2024-11-14",
      "headline": "Video: 4-year-old on cycle run over by car in Madhya Pradesh, climbs out safeThe mother of the boy alleged that the man behind the steering wheel ran the car over her son intentionally in Madhya Pradesh's Betul."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/x-exodus-people-quitting-social-media-platform-donald-trump-victory-blue-sky-jamie-lee-curtis-elton-john-2633469-2024-11-14",
      "headline": "As X sees X-odus of users and celebs, these platforms are gainingPeople are deserting X, the Elon Musk-owned social media platform, after Donald Trump's victory. This is the biggest exodus of users from X since what was seen after Musk's takeover of Twitter.  Even celebs like Elton John, Mia Farrow and Jim Carrey, have stopped using X. Who is gaining from X's loss? "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/tom-homan-border-czar-us-canada-border-extreme-security-vulnerabilities-ice-human-smuggling-special-interest-aliens-2633347-2024-11-14",
      "headline": "Not just India, US also worried about terror risks from CanadaIt's not just India, even the US is concerned about security risks related to Canada. Trump's border czar, Tom Homan, pointed to the ill-guarded Canadian border and said terrorists could use it as a \"gateway\" into the US. He said the Justin Trudeau administration had not taken border security seriously.    "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/secret-service-agent-fired-for-inviting-girlfriend-lover-barack-obama-hawaii-beachfront-property-first-lady-bathroom-sex-2633464-2024-11-14",
      "headline": "US Secret Service agent took lover to Obamas' Hawaii home for sex, got firedAn American Secret Service agent was fired after allegedly breaching security protocols by taking his lover to former President Barack Obama's Hawaii property. In her memoir, the lover claimed that the agent also offered to have sex with her in the former First Lady's bathroom."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/suriya-kanguva-full-movie-leaked-online-release-2633496-2024-11-14",
      "headline": "Suriya's Kanguva full movie leaked online just hours after releaseActor Suriya's latest film, Kanguva, was leaked online shortly after its theatrical release, with pirated copies spreading across several websites. The film released on November 14."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/single-composer-sanjay-chakraborty-arrested-pocso-case-molesting-minor-kolkata-2633545-2024-11-14",
      "headline": "Singer-composer Sanjay Chakraborty arrested for allegedly molesting minorSanjay Chakraborty has been arrested under Pocso charges. He was produced before a Kolkata court on Wednesday and sent to police custody till November 18."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/lodestars-of-their-own-sky-indias-most-cherished-icons-2633360-2024-11-14",
      "headline": "Lodestars of their own sky: India's most cherished iconsFrom INDIA TODAY's High & Mighty Power List, 10 personalities who have risen above their vocations, inflecting the course of society itself\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/how-do-we-explain-elon-musk-moby-dick-opinion-2633358-2024-11-14",
      "headline": "How do we explain Elon Musk? Moby DickWhat drives Elon Musk is the same thing that drives everyone else, and on some occasions to a tragic end: the white whale. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/mark-zuckerberg-special-gift-for-wife-priscilla-chan-on-their-dating-anniversary-2633513-2024-11-14",
      "headline": "Mark Zuckerberg's special gift for wife Priscilla Chan on their dating anniversaryIn a post on Instagram, Zuckerberg shared a throwback picture with Priscilla and said that Get Low was the song that was playing when he met her for the first time at a college party.  \r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/arsh-dalla-hardeep-nijjar-khalistani-terrorist-extradition-india-canada-2633441-2024-11-14",
      "headline": "India to push for terrorist Arsh Dalla's extradition after arrest in CanadaOn November 10, India Today first reported about Khalistani terrorist Arsh Dalla's arrest following his suspected involvement in a shootout in Milton town in Canada's Ontario in October."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/aap-councillor-mahesh-khinchi-wins-delhi-mayor-elections-2633450-2024-11-14",
      "headline": "AAP councillor Mahesh Khinchi wins Delhi Mayor electionsThe mayor election marks a significant victory for AAP, which has managed to hold onto the mayoral position amid a longstanding power struggle with the BJP in the Municipal Corporation of Delhi (MCD)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/can-food-cravings-affect-your-mental-health-2633266-2024-11-14",
      "headline": "Can food cravings affect your mental health?When it comes to cravings, they often feel irresistible, and we tend to give in. But did you know that cravings can also affect your mental health?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/story/rupali-ganguly-anupamma-trp-chart-no-2-amid-family-dispute-2633585-2024-11-15",
      "headline": "Rupali Ganguly's Anupamaa slips to second position on TRP list for the 1st timeYeh Rishta Kya Kehlata Hai dethroned Anupamaa to take the top spot in this week's TRP ratings, reflecting shifting viewer preferences in Indian television. This was the first time Anupamaa slipped from the No 1 position."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/abhishek-bachchan-marriage-promo-ahilya-i-wanna-talk-2633581-2024-11-14",
      "headline": "What do you know about marriage: Actor Ahilya asks Abhishek Bachchan in videoThe promo for I Want to Talk, starring Abhishek Bachchan and Ahilya Bamroo, unveils the emotional intricacies of a father-daughter relationship. Directed by Shoojit Sircar, the film is set for release on November 22."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/web-series/video/watch-shalini-passi-with-bollywood-wives-and-karan-johar-at-mumbai-event-2633574-2024-11-14",
      "headline": "Watch: Shalini Passi, with Bollywood Wives and Karan Johar, at Mumbai eventFabulous Lives vs Bollywood Wives' standout star, Shalini Passi, was seen at an event today where she reunited with the rest of the cast - Maheep Kapoor, Bhavana Pandey, Riddhima Kapoor Sahni and Kalyani Saha Chawla, along with Karan Johar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/web-series/photo/shruti-haasan-shabana-azmi-celebs-freedom-at-midnight-premiere-2633571-2024-11-14",
      "headline": "Pics: Shruti Haasan, Shabana Azmi and others at Freedom At Midnight premiereA special screening of Freedom At Midnight was held in Mumbai and it saw several celebs in attendance, apart from the cast and the team of the series."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/atp-finals-jannik-sinner-semi-final-taylor-firtz-vs-alex-de-minaur-daniil-medvedev-turin-2633566-2024-11-14",
      "headline": "ATP Finals: Sinner seals semi-final spot, Fritz awaits Medvedev resultTaylor Fritz's win over Alex de Minaur has taken him closer to the ATP Finals semi-finals, though he must await the outcome of Jannik Sinner's match against Daniil Medvedev to see if his journey in Turin continues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-champions-trophy-tour-pakistan-dates-announced-2633558-2024-11-14",
      "headline": "Champions Trophy arrives in Pakistan, trophy tour from November 16 The Champions Trophy arrived in Pakistan on Thursday, November 14. The trophy will be on a tour from November 16 to 24 across several cities in the country despite the uncertainty around the 50-over tournament, scheduled to be held in February-March 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-border-gavaskar-trophy-sarfaraz-khan-injury-update-perth-test-2633552-2024-11-14",
      "headline": "Sarfaraz Khan injury 'not serious' after blow to elbow in Perth training sessionBorder-Gavaskar Trophy: Sarfaraz Khan was hit on the elbow while training in the nets at the WACA Stadium in Perth on Thursday, November 14. Sarfaraz could be in contention to play the series opener, starting November 22. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/cricket-rohit-sharma-perth-test-update-travel-border-gavaskar-trophy-2633551-2024-11-14",
      "headline": "Will Rohit Sharma travel to Australia before first Test in Perth?Border Gavaskar Trophy: In a piece of positive news for Indian cricket fans, Rohit Sharma might travel to Perth in the lead-up to the first Test. The BCCI is making all arrangements to ensure Rohit reaches on time, if the captain makes himself available to be part of the series opener, starting November 22. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-usman-khawaja-plans-jasprit-bumrah-pace-will-not-get-out-border-gavaskar-trophy-2633529-2024-11-14",
      "headline": "Khawaja reveals plans to handle Bumrah: 'Will not think about getting out'As the Border-Gavaskar Trophy series nears, Usman Khawaja shared his insights on facing India's ace pacer Jasprit Bumrah, detailing the challenge and excitement of adapting to Bumrah's unique bowling style while keeping a sharp focus on staying grounded."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-sunil-gavaskar-advice-rohit-sharma-batting-restraint-mitchell-starc-2633510-2024-11-14",
      "headline": "Sunil Gavaskar's advice to struggling Rohit Sharma ahead of Australia Test seriesIndia legend Sunil Gavaskar advised Rohit Sharma to curb his instinct for big hits, emphasizing patience against Australia's bowlers as essential to secure runs in the upcoming Border-Gavaskar Trophy series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-virat-kohli-king-australia-ravi-shastri-warning-2633489-2024-11-14",
      "headline": "'King' Kohli back in his territory in Australia: Ravi Shastri warns naysayersBorder-Gavaskar Trophy 2024-25: Ravi Shastri backed Virat Kohli to hit peak form with the bat in Australia, saying the former captain will enjoy batting in conditions where he has had success in the past. Kohli averages over 50 runs per innings in Tests in Australia with six hundreds Down Under. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-australia-vs-india-bgt-virat-kohli-rohit-sharma-home-sanjay-manjrekar-2633485-2024-11-14",
      "headline": "Australia will be home away from home for Virat Kohli, Rohit Sharma: ManjrekarBorder-Gavaskar Trophy: Sanjay Manjrekar backed Virat Kohli and Rohit Sharma to return to form in the upcoming five-Test series Down Under. The two batters failed in India's shocking 0-3 defeat to New Zealand in spin-friendly conditions at home. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-sarfaraz-khan-shubman-gill-presents-bat-fun-perth-training-session-2633483-2024-11-14",
      "headline": "Sarfaraz presents Shubman Gill a bat during fun Perth training sessionIndia's Border-Gavaskar Trophy preparations saw a light-hearted moment as Sarfaraz Khan humorously presented Shubman Gill with the ball during a training session in Perth, adding a dose of camaraderie before the high-stakes series against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fc-barcelona-erling-haaland-transfer-rumours-sporting-director-deco-lewandowski-replacement-2633449-2024-11-14",
      "headline": "Haaland to Barcelona? Sporting Director Deco reacts on transfer buzzBarcelona Sporting Director Deco praised Erling Haaland's exceptional skills amid speculation linking the Manchester City star to a potential Barcelona move. Deco suggested Haaland's abilities could make him an ideal long-term successor to Robert Lewandowski."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-sunil-gavaskar-advice-rohit-sharma-batting-restraint-mitchell-starc-2633510-2024-11-14",
      "headline": "Sunil Gavaskar's advice to struggling Rohit Sharma ahead of Australia Test seriesIndia legend Sunil Gavaskar advised Rohit Sharma to curb his instinct for big hits, emphasizing patience against Australia's bowlers as essential to secure runs in the upcoming Border-Gavaskar Trophy series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-virat-kohli-king-australia-ravi-shastri-warning-2633489-2024-11-14",
      "headline": "'King' Kohli back in his territory in Australia: Ravi Shastri warns naysayersBorder-Gavaskar Trophy 2024-25: Ravi Shastri backed Virat Kohli to hit peak form with the bat in Australia, saying the former captain will enjoy batting in conditions where he has had success in the past. Kohli averages over 50 runs per innings in Tests in Australia with six hundreds Down Under. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-australia-vs-india-bgt-virat-kohli-rohit-sharma-home-sanjay-manjrekar-2633485-2024-11-14",
      "headline": "Australia will be home away from home for Virat Kohli, Rohit Sharma: ManjrekarBorder-Gavaskar Trophy: Sanjay Manjrekar backed Virat Kohli and Rohit Sharma to return to form in the upcoming five-Test series Down Under. The two batters failed in India's shocking 0-3 defeat to New Zealand in spin-friendly conditions at home. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-sarfaraz-khan-shubman-gill-presents-bat-fun-perth-training-session-2633483-2024-11-14",
      "headline": "Sarfaraz presents Shubman Gill a bat during fun Perth training sessionIndia's Border-Gavaskar Trophy preparations saw a light-hearted moment as Sarfaraz Khan humorously presented Shubman Gill with the ball during a training session in Perth, adding a dose of camaraderie before the high-stakes series against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fc-barcelona-erling-haaland-transfer-rumours-sporting-director-deco-lewandowski-replacement-2633449-2024-11-14",
      "headline": "Haaland to Barcelona? Sporting Director Deco reacts on transfer buzzBarcelona Sporting Director Deco praised Erling Haaland's exceptional skills amid speculation linking the Manchester City star to a potential Barcelona move. Deco suggested Haaland's abilities could make him an ideal long-term successor to Robert Lewandowski."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ranji-trophy-ipl-auction-mahipal-lomror-audition-triple-hundred-rajasthan-vs-uttarakhand-2633451-2024-11-14",
      "headline": "Ranji Trophy: Ex-RCB star warms up for IPL auction with blazing triple hundredRanji Trophy 2024: Mahipal Lomror has been making the right noises in the lead-up to the IPL mega auction. The left-handed batter scored his maiden triple hundred for Rajasthan against Uttarakhand on Thursday, October 14. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/border-gavaskar-trophy-australia-vs-india-mohammed-shami-to-be-flown-in-ranji-trophy-return-2633445-2024-11-14",
      "headline": "Mohammed Shami could be flown to Australia after brilliant Ranji trophy returnThe Indian team are reportedly considering flying in Mohammed Shami to Australia after the pacer made a sensational return in the Ranji Trophy for Bengal. Shami wreaked havoc on the Madhya Pradesh batting order as he picked up 4 wickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-gautam-gambhir-brad-haddin-ricky-ponting-border-gavaskar-trophy-2024-25-aus-vs-ind-2633420-2024-11-14",
      "headline": "Gautam Gambhir reminded of his 1-match ban by Brad Haddin amid Ricky Ponting rowFormer Australia wicketkeeper batter touched upon Gautam Gambhir's one match man after physical altercation with Shane Watson in 2008 amid his ongoing row with Ricky Ponting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-pakistan-glenn-maxwell-fireworks-reduced-overs-gabba-shootout-babar-azam-2633413-2024-11-14",
      "headline": "Gabba T20I: Maxwell fireworks too good for Pakistan in 7-over shootoutAustralia, under Josh Inglis' leadership, secured a decisive win over Pakistan in a rain-shortened T20I at The Gabba, taking a 1-0 series lead with an explosive batting display led by Glenn Maxwell and a strong bowling performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-south-africa-vs-india-predicted-xis-yash-dayal-vijaykumar-vysakh-debut-wanderers-johannesburg-2633395-2024-11-14",
      "headline": "SA vs IND 4th T20I Predicted XIs: Will Dayal or Vijaykumar get a look in?India and South Africa are all set to clash in the series finale, which will emanate from the Wanderers stadium in Johannesburg on November 15, Friday. Will India go for a change and give a debut to Yash Dayal or Vijaykumar Vysakh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-links-ayemric-laporte-feels-good-defender-injury-concerns-al-nassr-2633386-2024-11-14",
      "headline": "Real Madrid links feel good: Al Nassr defender Laporte opens up on transfer buzzAl Nassr defender Aymeric Laporte hinted he would consider joining Real Madrid if they approached him, emphasising the honour of being linked with the LaLiga giants amid their search for defensive reinforcements due to a string of key injuries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-rohit-sharma-gautam-gambhir-brendon-julian-border-gavaskar-trophy-aus-vs-ind-2633377-2024-11-14",
      "headline": "Virat Kohli is not gelling with captain Rohit and coach Gambhir: Brendon JulianFormer Australia cricketer Brendon Julian has made a shocking statement regarding the Indian dressing room saying that Virat Kohli is not gelling with Rohit Sharma and Gautam Gambhir ahead of the Test series against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/lungi-ngidi-injury-ruled-out-summer-home-test-season-groin-injury-world-test-championship-2633369-2024-11-14",
      "headline": "South Africa pacer Lungi Ngidi ruled out of home Test season with injurySouth Africa's World Test Championship hopes took a significant hit as Lungi Ngidi was ruled out of their home Tests with a groin injury. With injuries already affecting key players, the Proteas face an uphill battle for the WTC final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-south-africa-vs-india-predicted-xis-yash-dayal-vijaykumar-vysakh-debut-wanderers-johannesburg-2633395-2024-11-14",
      "headline": "SA vs IND 4th T20I Predicted XIs: Will Dayal or Vijaykumar get a look in?India and South Africa are all set to clash in the series finale, which will emanate from the Wanderers stadium in Johannesburg on November 15, Friday. Will India go for a change and give a debut to Yash Dayal or Vijaykumar Vysakh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-links-ayemric-laporte-feels-good-defender-injury-concerns-al-nassr-2633386-2024-11-14",
      "headline": "Real Madrid links feel good: Al Nassr defender Laporte opens up on transfer buzzAl Nassr defender Aymeric Laporte hinted he would consider joining Real Madrid if they approached him, emphasising the honour of being linked with the LaLiga giants amid their search for defensive reinforcements due to a string of key injuries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-rohit-sharma-gautam-gambhir-brendon-julian-border-gavaskar-trophy-aus-vs-ind-2633377-2024-11-14",
      "headline": "Virat Kohli is not gelling with captain Rohit and coach Gambhir: Brendon JulianFormer Australia cricketer Brendon Julian has made a shocking statement regarding the Indian dressing room saying that Virat Kohli is not gelling with Rohit Sharma and Gautam Gambhir ahead of the Test series against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/lungi-ngidi-injury-ruled-out-summer-home-test-season-groin-injury-world-test-championship-2633369-2024-11-14",
      "headline": "South Africa pacer Lungi Ngidi ruled out of home Test season with injurySouth Africa's World Test Championship hopes took a significant hit as Lungi Ngidi was ruled out of their home Tests with a groin injury. With injuries already affecting key players, the Proteas face an uphill battle for the WTC final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sunil-gavaskar-allan-border-aus-vs-ind-border-gavaskar-trophy-2024-25-2633334-2024-11-14",
      "headline": "Sunil Gavaskar opens up on hilarious rivalry with Allan Border: He calls me bunnyFormer India cricketer Sunil Gavaskar recalled his hilarious rivalry with Allan Border ahead of the Border Gavaskar Trophy 2024-25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/boxing-mike-tyson-vs-jake-paul-press-conference-tony-bellew-old-man-2633333-2024-11-14",
      "headline": "Watch: Tony Bellew thrown out after hilarious 'old man' proposal for Jake PaulIn a surprising turn of events, retired boxer Tony Bellew brought an elderly man as Jake Paul's next opponent during the press conference for the upcoming Mike Tyson fight. The incident occurred ahead of the Tyson vs Paul bout set to take place in Dallas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ranji-trophy-goa-arunachal-pradesh-snehal-kashyap-300s-highest-partnership-2633329-2024-11-14",
      "headline": "Snehal, Kashyap hit triple hundreds; share highest-ever Ranji Trophy partnershipGoa batters Snehal Kauthankar (314*) and Kashyap Bakle (300*) shared the highest-ever partnership in the Ranji Trophy history during their plate group match against Arunachal Pradesh on Thursday."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}