{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-and-nifty-end-flat-as-it-losses-offset-consumer-stock-gains-2792033-2025-09-23",
      "headline": "Sensex and Nifty end flat as IT losses offset consumer stock gainsThe S&P BSE Sensex slipped 11.83 points to 82,102.1, while the NSE Nifty50 settled 32.85 points lower at 25,169.50. The broader small- and mid-cap indices also lagged, declining 0.5% and 0.4%, respectively."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/indian-origin-srinivas-gopalan-rahul-goyal-appointed-as-ceos-of-two-big-us-companies-2791848-2025-09-23",
      "headline": "Indian-origin Srinivas Gopalan, Rahul Goyal appointed as CEOs of two big US companiesTwo major US companies have appointed Indian-origin CEOs. Telecom giant T-Mobile announced Srinivasan Gopalan will take over as CEO from November 1. Beverage major Molson Coors has chosen Rahul Goyal as its new CEO, effective October 1. Gopalan's appointment comes as the US wireless market faces challenges, including slowing subscriber growth and fierce competition. Goyal, a company veteran, has previously served in key roles including CFO of Molson Coors India. These appointments are notable amidst discussions around the H1B visa program in the US. A reporter noted, \"Desi CEO for US Giants is the biggest news in the day for Telecom and IT space as well.\" This highlights the significance of these leadership changes in the corporate world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-rises-to-all-time-high-3-reasons-behind-its-strength-2791956-2025-09-23",
      "headline": "Gold rises to all-time high. 3 reasons behind its strengthInvestors are flocking to gold as it climbs to record highs, supported by currency weakness, economic uncertainty, and inflationary pressures. Here are the three main drivers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/india-health-insurance-crisis-denied-claims-rejections-financial-mental-stress-2791939-2025-09-23",
      "headline": "Denied, delayed, dismissed: Inside India's broken health insurance systemIn this special report, part of our 'CLAIM DENIED' series, we uncover why health insurance in India has become a gamble for families."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/sip-vs-swp-how-to-turn-your-retirement-corpus-into-reliable-income-2791903-2025-09-23",
      "headline": "SIP vs SWP: How to turn your retirement corpus into reliable incomeAccumulating wealth through SIPs is just the beginning of retirement planning. The real challenge is turning that corpus into a steady income. Here's how you can do it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-withdrawal-rule-change-relaxation-government-housing-marriage-education-report-2791915-2025-09-23",
      "headline": "PF pre-retirement withdrawal rules likely to be relaxed: ReportAt present, EPFO members can withdraw their entire corpus only after reaching the retirement age of 58, or if they remain unemployed for more than two months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/launching-a-startup-this-government-scheme-simplifies-early-funding-2791851-2025-09-23",
      "headline": "Launching a startup? This government scheme simplifies early fundingStarting a startup is exciting but securing funds at the initial stage is often a hurdle. This government scheme provides seed funding through incubators, giving you the financial boost to test, prototype, and launch your product."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-5-and-itr-7-filing-opens-online-who-can-file-and-by-when-2791813-2025-09-23",
      "headline": "ITR-5 and ITR-7 filing opens online. Who can file and by when?The Income Tax Department has opened online filing for ITR-5 and ITR-7 forms for AY 2025–26. These forms are not meant for individuals but for specific entities. Here's a quick look at who needs to file and the deadlines."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-srini-gopalan-t-mobile-ceo-net-worth-profile-education-experience-indian-origin-2791808-2025-09-23",
      "headline": "Who is Srini Gopalan, T-Mobile's new Indian-origin CEOSrini Gopalan will take over from Mike Sievert, who has been named Vice Chairman. Mike Sievert, the outgoing CEO, said that Gopalan was the natural choice to take T-Mobile forward."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/gold-all-time-high-festive-season-buy-safe-to-invest-expert-view-silver-yellow-metal-price-today-2791785-2025-09-23",
      "headline": "Gold shines at an all-time high, but is it safe to invest?The yellow metal, traditionally seen as a safe haven in uncertain times, has surged sharply in the past year, supported by global factors ranging from geopolitical tensions to central bank buying. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/take-that-maga-two-indian-origin-ceos-us-companies-h1b-crackdown-2791772-2025-09-23",
      "headline": "Take that, MAGA. Two big US firms appoint Indian-origin CEOs amid H-1B crackdownAmid H-1B tensions, two Indian-origin executives, Srinivas Gopalan and Rahul Goyal, rise to top US leadership roles, defying Make America Great Again (MAGA) hardliners and reshaping America's corporate landscape."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-up-100-points-nifty-above-25200-maruti-jumps-over-2-2791752-2025-09-23",
      "headline": "Markets edge higher, auto stocks lead early gains; volatility loomsThe Sensex climbed nearly 100 points in early trade, while the Nifty50 hovered above 25,200. Broader indices, however, struggled to find traction as pockets of profit booking introduced early volatility."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/amitabh-bachchan-kbc-17-navratri-pallavi-niphadkar-prize-2791830-2025-09-23",
      "headline": "KBC 17: Amitabh Bachchan recalls time when wife Jaya played host on the showOn 'Kaun Banega Crorepati 17', Big B shared Navratri greetings and welcomed contestant Pallavi Niphadkar. Bachchan recalled an episode where his wife Jaya hosted, and he became the contestant, describing himself as speechless."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/mastiii-4-teaser-og-boys-vivek-riteish-aftab-promise-four-times-laughter-and-fun-2792004-2025-09-23",
      "headline": "Mastiii 4 teaser: OG trio Vivek, Riteish, Aftab promise four times laughter and funThe teaser of 'Mastiii 4' starring Vivek Oberoi, Aftab Shivdasani and Riteish Deshmukh is out. The film is slated to release in theatres on November 21. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/parineeti-chopra-youtube-channel-baby-bump-life-updates-2791941-2025-09-23",
      "headline": "Parineeti Chopra back on YouTube with baby bump and life updates. WatchActor Parineeti Chopra on Tuesday announced her YouTube comeback eight months after starting her channel. The latest video featured the actor exploring different ideas and genres for her channel and reacting to viral memes, while giving a baby bump update."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nana-patekar-extend-support-to-pakistan-shelling-victims-in-jammu-and-kashmir-2791844-2025-09-23",
      "headline": "Nana Patekar offers support to Pak shelling victims, provides Rs 42 lakh aidActor Nana Patekar's Nirmala Gajanan Foundation, in collaboration with the Indian Army, distributed Rs 42 lakh rehabilitation aid to 117 families affected by cross-border shelling in Rajouri and Poonch in the aftermath of Operation Sindoor. Patekar called it a collective responsibility of citizens."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kumar-sanu-ex-wife-rita-bhattacharya-alleges-abuse-during-pregnancy-2791932-2025-09-23",
      "headline": "Kumar Sanu's ex-wife Rita alleges abuse during pregnancy: They locked kitchenKumar Sanu's ex-wife, Rita Bhattacharya, alleged that she faced abuse from the singer and his family while pregnant with their son, Jaan Kumar Sanu. She also claimed his behaviour changed after he gained fame with 'Aashiqui', and highlighted instances of mistreatment and neglect during their marriage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-ruth-prabhu-raj-nidimoru-spotted-together-mumbai-gym-relationship-rumours-2791965-2025-09-23",
      "headline": "Samantha and rumoured boyfriend Raj Nidimoru hit the gym together in MumbaiSamantha Ruth Prabhu and Raj Nidimoru were seen together at a Bandra gym in Mumbai. Their joint appearance has fuelled ongoing rumours about their relationship. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-security-threat-travis-kelce-home-justin-baldoni-lawsuit-2791850-2025-09-23",
      "headline": "Taylor Swift has intruder arrested at Travis Kelce's house over Justin Baldoni caseTaylor Swift faced a security incident at fiance Travis Kelce's house after a man was arrested for trespassing. The man was attempting to serve legal documents related to a lawsuit involving actor Justin Baldoni."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karan-johars-joke-on-farah-khans-cook-dilip-steals-spotlight-at-homebound-premiere-2791865-2025-09-23",
      "headline": "Karan Johar's joke on Farah Khan's cook Dilip steals spotlight at Homebound premiereKaran Johar and Farah Khan's witty banter stole the spotlight at the Mumbai premiere of Neeraj Ghaywan's 'Homebound', even amid a star-studded turnout. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/riddhima-kapoor-daughter-samara-kapoor-opens-up-on-viral-clip-with-neetu-kapoor-2791957-2025-09-23",
      "headline": "Samara Kapoor opens up on viral clip with Neetu Kapoor: It's just a resting faceSamara Kapoor clarified the viral clip from Aadar Jain's wedding, saying her expression was simply a resting face and not anger toward her grandmother, Neetu Kapoor. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ai-impact-entertainment-the-morning-show-cast-debate-2791947-2025-09-23",
      "headline": "The Morning Show cast on AI: We're just at the tip of the icebergIn an exclusive chat, 'The Morning Show' cast members share varied views on artificial intelligence affecting their industry. Their insights reveal both hope and concern about AI's future role in entertainment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kusha-kapila-anubhav-singh-bassi-dating-rumours-viral-birthday-post-2791870-2025-09-23",
      "headline": "Are Kusha Kapila-Anubhav Singh Bassi dating? Viral birthday pic sparks buzzInfluencer-turned-actor Kusha Kapila's birthday celebration post has reignited speculation about her relationship status. The post, which included a photo with comedian Anubhav Singh Bassi, has gone viral.    "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/janhvi-kapoor-zoya-akhtar-lead-bollywood-wishes-as-katrina-kaif-vicky-kaushal-confirm-pregnancy-2791914-2025-09-23",
      "headline": "Janhvi Kapoor, Zoya Akhtar lead Bollywood wishes as Katrina-Vicky confirm pregnancyKatrina Kaif and Vicky Kaushal are expecting their first child. The couple announced the happy news on social media, with Bollywood stars like Janhvi Kapoor, Zoya Akhtar, Ayushmann Khurrana and Rhea Kapoor congratulating the parents-to-be."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/video/singer-zubeen-garg-cremated-with-full-state-honours-2791931-2025-09-23",
      "headline": "Singer Zubeen Garg cremated with full state honoursSinger Zubeen Garg was cremated with full state honours and a 21-gun salute on September 23. The last rites were performed by his younger sister, Palmi Borthakur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ar-rahman-hosts-japanese-boyband-jo1-in-mumbai-sparks-collaboration-buzz-2791871-2025-09-23",
      "headline": "AR Rahman hosts Japanese boyband JO1 in Mumbai, sparks collaboration buzzMusic maestro AR Rahman recently hosted J-pop group JO1 at his Mumbai studio, sparking excitement about a possible cross-cultural collaboration. He shared a picture from his studio on Instagram. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/video/watch-zubeen-gargs-wife-in-tears-as-she-bids-farewell-to-singer-2791894-2025-09-23",
      "headline": "Watch: Zubeen Garg's wife in tears as she bids farewell to singerGarima Saikia Garg, wife of singer Zubeen Garg, tearfully bid farewell to her husband on Tuesday at his funeral in Guwahati, attended by thousands of fans eager for a last glimpse of the Assamese icon. Dressed in a traditional mekhela chador, she stood before Zubeen Garg's pyre with folded hands, sobbing inconsolably, as his sister Palme and other family members tried to comfort her."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/video/audrey-hobert-on-debut-record-working-with-gracie-abrams-desire-to-collab-with-bts-and-blackpink-2791821-2025-09-23",
      "headline": "Audrey Hobert on debut record, working with Gracie Abrams, desire to collab with BTS and BLACKPINKAudrey Hobert spoke to India Today's Bhavna Agarwal on her debut record, working with Gracie Abrams, the challenges she endured for her debut record and more. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-episode-29-day-30-written-update-neelam-giri-targets-awez-darbar-2791788-2025-09-23",
      "headline": "Bigg Boss 19 episode 29: Neelam Giri targets Awez Darbar after being exposedA day after their fight, Bhojpuri actor Neelam Giri targetted influencer Awez Darbar in the latest episode of 'Bigg Boss 19.' She also told Amaal Mallik what Awez Darbar told her about him. Catch the highlights here. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rishab-shetty-denies-fake-no-meat-no-alcohol-post-kantara-viewers-2791879-2025-09-23",
      "headline": "Rishab Shetty slams fake post urging no-meat, no-alcohol policy for Kantara viewersActor Rishab Shetty refuted a viral fake post suggesting lifestyle restrictions to fans before watching 'Kantara: Chapter 1'. The actor asserted that the post is unrelated to the film's production house. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/best-chapter-of-our-lives-katrina-kaif-vicky-kaushal-announce-pregnancy-2791886-2025-09-23",
      "headline": "Best chapter of our lives: Katrina Kaif, Vicky Kaushal announce pregnancyBollywood's favourite couple, Katrina Kaif and Vicky Kaushal, are set to welcome their first child, stepping into a joyous new chapter that has fans and the film world celebrating with them."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/kolkata/story/kolkata-heavy-rain-record-rain-floods-city-days-before-durga-puja-metro-services-impacted-2791750-2025-09-23",
      "headline": "Record rain brings Kolkata to knees before Durga Puja; 9 dead, 30 flights cancelled Live UpdatesFloodwater entered many buildings and residential complexes across Kolkata as heavy rain, which began past midnight, left roads waterlogged."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/french-president-macron-stopped-new-york-trump-convoy-viral-video-2792016-2025-09-23",
      "headline": "Macron stopped by New York cops for Trump's convoy, he dials US PresidentAs Macron was returning to the French embassy after his UN speech, he was stopped by the New York police to let US President Donald Trump's convoy pass. Read on to find out what unfolded later. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/71st-national-film-awards-live-updates-timing-where-to-watch-mohanlal-shah-rukh-khan-rani-mukerji-2791964-2025-09-23",
      "headline": "National Film Awards Live: SRK called king of hearts, Rani shines in regal look71st National Awards Ceremony 2025: The prestigious National Film Awards ceremony will be held in New Delhi where President Droupadi Murmu will honour artists for their exceptional work in Indian cinema. The winners this year include Mohanlal, Shah Rukh Khan, Vikrant Massey and Rani Mukerji."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjp-seizes-on-manish-tewaris-nepo-kids-dynasts-tweet-to-target-rahul-gandhi-2791952-2025-09-23",
      "headline": "BJP seizes on Manish Tewari's 'Nepo Kids, Dynasts' post to target Rahul GandhiThe BJP linked Manish Tewari's comments on dynastic politics in Asia to Rahul Gandhi. Tewari hit back, urging a focus on regional trends rather than domestic political jabs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/best-chapter-of-our-lives-katrina-kaif-vicky-kaushal-announce-pregnancy-2791886-2025-09-23",
      "headline": "Best chapter of our lives: Katrina Kaif, Vicky Kaushal announce pregnancyBollywood's favourite couple, Katrina Kaif and Vicky Kaushal, are set to welcome their first child, stepping into a joyous new chapter that has fans and the film world celebrating with them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/arshdeep-singh-fiery-gesture-asia-cup-2025-india-pakistan-super-4-2792011-2025-09-23",
      "headline": "Asia Cup: Arshdeep Singh's response to Haris Rauf's fighter-jet celebration goes viralIndia's Arshdeep Singh made headlines with a fiery gesture which could likely have come during the game against Pakistan in the Asia Cup 2025."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/trump-republican-party-alexander-duncan-hanuman-statue-hindu-god-controversy-2791790-2025-09-23",
      "headline": "False Hindu God: Trump party leader's remark on Hanuman statue sparks furyThe Hanuman statue, the tallest in North America, has received backlash on social media by MAGA members ever since it was inaugurated in August 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/how-zubeen-garg-death-assam-life-exposes-tragedy-of-india-diversity-jubin-nautiyal-puneeth-rajkumar-kalpana-patowary-2791978-2025-09-23",
      "headline": "How Zubeen Garg's life and death expose the tragedy of India's diversityRest of India was left surprised as lakhs of people descended on the streets of Assam to mourn singer Zubeen Garg's death. Though immensely popular in Assam and Bengal, Zubeen was little-known in other parts of India. It was the same story in case of Puneeth Rajkumar. Zubeen's life and death exposes the dichotomy of India's diversity where icons like Puneeth, Sharda Sinha and Soumitra Chatterjee die without wide national recognition they deserve."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/trump-rfk-jr-and-paracetamol-panic-what-indian-parents-must-know-acetaminophen-dolo-crocin-tylenol-2791920-2025-09-23",
      "headline": "Trump, RFK Jr and Paracetamol panic: What Indian parents must knowDonald Trump and Robert F. Kennedy Jr.'s recent claims linking prenatal use of acetaminophen (Paracetamol or tylenol) to autism have sparked global anxiety, and in India, where this medicine is found in every household, the ripple effects are real. But is there any truth behind the fear? Or are Indian parents being misled by misinformation dressed up as advocacy?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-withdrawal-rule-change-relaxation-government-housing-marriage-education-report-2791915-2025-09-23",
      "headline": "PF pre-retirement withdrawal rules likely to be relaxed: ReportAt present, EPFO members can withdraw their entire corpus only after reaching the retirement age of 58, or if they remain unemployed for more than two months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/ulips-mutual-funds-why-you-need-both-for-a-balanced-portfolio-2789465-2025-09-19",
      "headline": "ULIPs & Mutual Funds: Why you need both for a balanced portfolioULIPs give you protection and discipline for the long haul, while mutual funds give you liquidity and flexibility for the near term."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/roger-federer-clow-courts-favour-carlos-alcaraz-jannik-sinner-grand-slam-finals-laver-cup-2791731-2025-09-23",
      "headline": "Tennis rigged? Roger Federer says courts slowed to favour Alcaraz, SinnerRoger Federer has criticised modern tennis for uniform, slower courts, saying they favour stars like Alcaraz and Sinner. He urges tournament directors to reintroduce surface variety to keep matches unpredictable and exciting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/take-that-maga-two-indian-origin-ceos-us-companies-h1b-crackdown-2791772-2025-09-23",
      "headline": "Take that, MAGA. Two big US firms appoint Indian-origin CEOs amid H-1B crackdownAmid H-1B tensions, two Indian-origin executives, Srinivas Gopalan and Rahul Goyal, rise to top US leadership roles, defying Make America Great Again (MAGA) hardliners and reshaping America's corporate landscape."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/india-health-insurance-crisis-denied-claims-rejections-financial-mental-stress-2791939-2025-09-23",
      "headline": "Denied, delayed, dismissed: Inside India's broken health insurance systemIn this special report, part of our 'CLAIM DENIED' series, we uncover why health insurance in India has become a gamble for families."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/allow-limited-vehicle-movement-through-bengaluru-wipro-campus-to-ease-congestion-siddaramaiah-to-azim-premji-2791925-2025-09-23",
      "headline": "Amid Bengaluru traffic woes, a Siddaramaiah appeal to Azim Premji, WiproKarnataka Chief Minister Siddaramaiah wrote to Wipro founder Azim Premji to allow limited vehicular movement through the campus, aiming to ease traffic on Bengaluru's Outer Ring Road. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/the-lowdown/story/west-rushes-to-officially-recognise-palestine-will-israel-be-isolated-the-lowdown-2791824-2025-09-23",
      "headline": "West rushes to officially recognise Palestine; will Israel be isolated?On September 21, four Western nations formally recognised the State of Palestine, aligning with over 140 countries and intensifying pressure for a two-state solution amid the escalating Gaza conflict.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rishab-shetty-denies-fake-no-meat-no-alcohol-post-kantara-viewers-2791879-2025-09-23",
      "headline": "Rishab Shetty slams fake post urging no-meat, no-alcohol policy for Kantara viewersActor Rishab Shetty refuted a viral fake post suggesting lifestyle restrictions to fans before watching 'Kantara: Chapter 1'. The actor asserted that the post is unrelated to the film's production house. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/zubeen-garg-funeral-assam-fans-farewell-singer-full-state-honours-2791910-2025-09-23",
      "headline": "Assam's goodbye to its favourite rockstar, Zubeen Garg, with song he loved mostSinger Zubeen Garg was cremated with full state honours as hundreds of thousands of his fans, most in tears, sang lines from 'Mayabini' – a song that was close to his heart."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tdp-andhra-pradesh-nara-lokesh-chandrababu-naidu-son-technology-entrepreneurs-vizag-visakhapatnam-hyderabad-bengaluru-2791603-2025-09-23",
      "headline": "Is Nara Lokesh seeking father of all revenges via Vizag?Nara Lokesh, Andhra Pradesh minister and CM Chandrababu Naidu's son, recently invited a tech entrepreneur to set shop in Vizag. Nara Lokesh has been pitching Vizag as an alternative to Bengaluru and Hyderabad. It seems like the TDP leader is out to avenge his father's loss in the Hyderabad-Bangalore cybercity battle of the 1990s. Bengaluru, having won the IT race and with Hyderabad going to Telangana, Vizag is the port of call for the big daddy of all revenges."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/noida-school-class-6-dead-death-investigation-family-demands-justice-2791971-2025-09-23",
      "headline": "Class 6 girl faints at Noida school, dies; family alleges foul playA 10-year-old Class 6 girl fainted and died at a private school in Noida. The incident, which occurred on September 4, has sparked controversy, with her family alleging foul play."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/raghav-juyal-is-the-hero-you-didnt-see-coming-in-the-bads-of-bollywood-aryan-khan-2791402-2025-09-23",
      "headline": "Raghav Juyal is the hero you didn't see coming in The Ba***ds of BollywoodDid you watch Aryan Khan's debut series 'The Ba***ds of Bollywood'? If yes, you'd agree that Raghav Juyal made sure your weekend binge was far more entertaining with his stellar performance. While you might be hooked on knowing more about the show, you might also be introduced to some spoilers ahead. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/can-kids-really-grow-up-without-screens-2791403-2025-09-23",
      "headline": "Can kids really grow up without screens?Can children really thrive without screens in today's connected world, and should parents even attempt it? Find out from experts."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kerala-dulquer-salmaan-prithviraj-sukumaran-customs-raids-homes-of-actors-in-kochi-2791933-2025-09-23",
      "headline": "Customs raids homes of actors Dulquer Salmaan and Prithviraj Sukumaran in KochiCustoms is conducting checks at multiple Kerala locations, including the homes of actors Dulquer Salmaan and Prithviraj Sukumaran in Kochi. The inspections relate to vehicles brought from Bhutan. Similar checks are ongoing in Kozhikode."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/delhi-rekha-gupta-loudspeaker-time-midnight-navratri-ramlila-durga-puja-rules-2791981-2025-09-23",
      "headline": "Hindu festivals face difficulties: Delhi relaxes rule for Ramlila, Durga PujaThe Delhi government has increased the permitted time for using loudspeakers at religious functions from 10 pm to midnight during Navratri."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-women-odi-rankings-smriti-mandhana-career-best-ratings-deepti-sharma-5th-2792025-2025-09-23",
      "headline": "Smriti Mandhana achieves career-best ICC ODI ratings, Deepti Sharma jumps to 5thSmriti Mandhana reached a career-best rating of 818 to consolidate her position at the top of the ICC Women's ODI batting rankings, while Deepti Sharma rose to fifth among bowlers after her consistent performances against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/arshdeep-singh-fiery-gesture-asia-cup-2025-india-pakistan-super-4-2792011-2025-09-23",
      "headline": "Asia Cup: Arshdeep Singh's response to Haris Rauf's fighter-jet celebration goes viralIndia's Arshdeep Singh made headlines with a fiery gesture which could likely have come during the game against Pakistan in the Asia Cup 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indian-women-cricket-team-fined-slow-over-rate-third-odi-loss-australia-2792001-2025-09-23",
      "headline": "India fined for maintaining slow over rate in high-scoring 3rd ODI vs AustraliaThe Indian women's cricket team was fined for a slow over rate in their third ODI against Australia. Despite Smriti Mandhana's record-breaking century, India lost the match and the series 2-1 ahead of the Women's World Cup 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/wayne-rooney-video-games-manchester-united-communication-success-2791977-2025-09-23",
      "headline": "How gaming led to Man United's success under Sir Alex Ferguson? Wayne Rooney revealsWayne Rooney revealed video games on the team bus helped boost Manchester United's communication. This off-field bonding played a surprising role in the club's success under Sir Alex Ferguson."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-india-vs-bangladesh-phill-simmons-press-conference-can-beat-rivalry-2791997-2025-09-23",
      "headline": "Bangladesh can beat India, won't focus on past results: Coach Phil SimmonsBangladesh head coach Phil Simmons asserts his team's capability to defeat India in the upcoming Asia Cup Super 4 clash. Emphasising the significance of performance on the day, he remains focused on the present challenge."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/video/fc-goa-vs-al-nassr-sandesh-jhingan-talks-cristiano-ronaldo-cafa-nations-bronze-india-2791949-2025-09-23",
      "headline": "Talking FC Goa vs Al Nassr, CAFA Nations bronze with Sandesh JhinganSandesh Jhingan reflects on India's CAFA Nations Cup bronze and gears up for FC Goa's AFC Champions League clash against Cristiano Ronaldo's Al Nassr. For Jhingan, it's about more than spectacle, it's India's chance to prove grit on a global stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dinesh-karthik-named-india-hong-kong-sixes-2025-ashwin-comeback-2791946-2025-09-23",
      "headline": "Dinesh Karthik named India captain for Hong Kong sixesDinesh Karthik will captain India in the Hong Kong Sixes 2025 tournament, scheduled to be played from November 7 to 9 at the Tin Kwong Road Recreation Ground."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/grace-harris-ruled-out-womens-world-cup-2025-calf-strain-heather-graham-replaces-2791904-2025-09-23",
      "headline": "Grace Harris ruled out of Women's World Cup 2025 due to calf strainAustralia's World Cup title defence suffers a blow as Grace Harris is ruled out with a calf strain. Heather Graham steps in as replacement amid multiple injury concerns in the squad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fc-goa-vs-al-nassr-cristiano-ronaldo-sandesh-jhingan-exclusive-afc-champions-league-2-2791908-2025-09-23",
      "headline": "Sandesh Jhingan ready for more than spectacle as FC Goa face Cristiano Ronaldo's Al NassrFC Goa's showdown with Cristiano Ronaldo's Al Nassr is more than a football match, it's a chance for Indian football to showcase their worth on a global stage. Sandesh Jhingan stands ready to lead from the front."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/ousmane-dembele-ballon-dor-psg-fc-barcelona-disrespect-panache-2791872-2025-09-23",
      "headline": "From ambulance jibes to Ballon d'Or glory: Dembele's chapter from the book of panacheOusmane Dembele's journey from ridicule at Barcelona to Ballon d'Or glory with PSG epitomizes resilience and redemption. Once mocked as injury-prone, he now stands among football's greats, silencing critics with brilliance on Europe's grandest stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravichandran-ashwin-ilt20-big-bash-league-ricky-ponting-auction-2025-2791814-2025-09-23",
      "headline": "Ashwin set for double-role? Spinner likely to play in ILT20, Big Bash League: ReportThe Indian spin-bowling great, Ravichandran Ashwin, is reportedly almost certain to feature in both the ILT20 in the UAE and the Big Bash League in Australia despite the overlapping schedules. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dinesh-karthik-named-india-hong-kong-sixes-2025-ashwin-comeback-2791946-2025-09-23",
      "headline": "Dinesh Karthik named India captain for Hong Kong sixesDinesh Karthik will captain India in the Hong Kong Sixes 2025 tournament, scheduled to be played from November 7 to 9 at the Tin Kwong Road Recreation Ground."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/grace-harris-ruled-out-womens-world-cup-2025-calf-strain-heather-graham-replaces-2791904-2025-09-23",
      "headline": "Grace Harris ruled out of Women's World Cup 2025 due to calf strainAustralia's World Cup title defence suffers a blow as Grace Harris is ruled out with a calf strain. Heather Graham steps in as replacement amid multiple injury concerns in the squad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fc-goa-vs-al-nassr-cristiano-ronaldo-sandesh-jhingan-exclusive-afc-champions-league-2-2791908-2025-09-23",
      "headline": "Sandesh Jhingan ready for more than spectacle as FC Goa face Cristiano Ronaldo's Al NassrFC Goa's showdown with Cristiano Ronaldo's Al Nassr is more than a football match, it's a chance for Indian football to showcase their worth on a global stage. Sandesh Jhingan stands ready to lead from the front."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/ousmane-dembele-ballon-dor-psg-fc-barcelona-disrespect-panache-2791872-2025-09-23",
      "headline": "From ambulance jibes to Ballon d'Or glory: Dembele's chapter from the book of panacheOusmane Dembele's journey from ridicule at Barcelona to Ballon d'Or glory with PSG epitomizes resilience and redemption. Once mocked as injury-prone, he now stands among football's greats, silencing critics with brilliance on Europe's grandest stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravichandran-ashwin-ilt20-big-bash-league-ricky-ponting-auction-2025-2791814-2025-09-23",
      "headline": "Ashwin set for double-role? Spinner likely to play in ILT20, Big Bash League: ReportThe Indian spin-bowling great, Ravichandran Ashwin, is reportedly almost certain to feature in both the ILT20 in the UAE and the Big Bash League in Australia despite the overlapping schedules. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}