{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-410-points-higher-nifty-above-24700-tata-steel-jumps-6-percent-2781360-2025-09-03",
      "headline": "Sensex ends 410 points higher, Nifty above 24,700; Tata Steel jumps 6%The S&P BSE Sensex added 409.83 points to end at 80,567.71, while the NSE Nifty50 gained 135.45 points to close at 24,715.05. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/cibil-series-how-to-improve-credit-score-money-tips-personal-finance-loans-2781355-2025-09-03",
      "headline": "CIBIL Decoded: Why your credit score dropped and how to fix itWhether it is taking a loan, applying for a credit card, or even renting a house, your credit score often comes into play, affecting your personal finances. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-the-right-time-to-invest-is-always-now-explains-expert-2781341-2025-09-03",
      "headline": "Why the right time to invest is always 'now', explains expertMany people wait for the 'perfect' time to start investing, hoping the market will feel safe. But an expert says that moment never really comes, and delaying could cost more than you think."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-services-sector-logs-15-year-high-inflation-fears-resurface-2781281-2025-09-03",
      "headline": "India's services sector logs 15-year high, inflation fears resurfaceBusiness confidence for the year ahead improved to a three-month-high, helped by expectations of strong demand and higher marketing investments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/at-gst-council-meet-opposition-ruled-states-seek-revenue-protection-compensation-plan-sources-2781265-2025-09-03",
      "headline": "Opposition states demand revenue protection at GST Council meet: SourcesThese states have stressed that companies must not profiteer from lower GST rates and that benefits should be passed directly to consumers. They are also pressing for a clear compensation plan to ensure that states do not face massive revenue shortfalls. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-council-meeting-3-crucial-decisions-to-watch-out-for-2781234-2025-09-03",
      "headline": "GST Council meeting: 3 crucial decisions to watch out forBig changes may be on the way as the GST Council begins its two-day meeting. From reducing GST slabs to easing compliance, the decisions taken could directly affect consumers and businesses alike."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-council-meeting-rate-cut-common-goods-consumer-benefit-state-vs-centre-nirmala-sitharaman-2781225-2025-09-03",
      "headline": "GST Council meet: Rate cuts may spark clash between Centre and statesThe GST Council Meeting is underway and is expected to lower taxes on daily goods. Lower taxes could encourage spending and give the economy a push, but states worry about their already tight finances. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-council-meeting-will-major-tax-overhaul-upset-state-revenues-2781166-2025-09-03",
      "headline": "GST Council meeting: Will major tax overhaul upset state revenues?Initial estimates indicate that states could see annual revenue declines from the proposed cuts, though long-term benefits are expected to outweigh the short-term losses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/video/gst-20-implementation-tax-cut-consumer-goods-dussehra-september-5-diwali-bonanza-experts-answer-2781153-2025-09-03",
      "headline": "Will GST 2.0 be implemented by Dussehra? Experts answerThe GST Council Meeting will take place from September 2-4, with a lot of buzz about benefits to consumers with a reduction in tax on daily goods before the festive season begins. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/are-your-sips-not-giving-returns-watch-out-for-these-5-mistakes-2781147-2025-09-03",
      "headline": "Are your SIPs not giving returns? Watch out for these 5 mistakesMany investors start SIPs with big hopes but end up disappointed with the returns. Often, the problem is not with SIPs but with some common mistakes that quietly reduce gains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-council-meeting-today-whats-likely-to-get-cheaper-and-costlier-2781110-2025-09-03",
      "headline": "GST Council meeting today: What's likely to get cheaper and costlierAt the centre of discussions is a plan to simplify the current four-tier system into just two slabs—5% and 18%—potentially making daily essentials and electronic goods more affordable while introducing higher levies on luxury items."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-fall-after-opening-in-green-gst-council-meet-in-focus-2781079-2025-09-03",
      "headline": "Sensex, Nifty fall after opening in green, GST Council meeting in focusAt 9:25 am, the S&P BSE Sensex was trading nearly 100 points lower, while the NSE Nifty50 was also down marginally. Banking and financial stocks were among the top drags, reflecting investor caution amid global uncertainty and ongoing trade tensions."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranvir-shorey-advises-against-dating-refers-meghalaya-honeymoon-murder-2781331-2025-09-03",
      "headline": "Ranvir Shorey advises against dating, refers to Meghalaya honeymoon murderActor Ranvir Shorey recently expressed his views on the current dating trends. The actor stated that this is not the right time to invest in relationships."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/gauahar-khan-zaid-darbar-welcome-second-child-a-baby-boy-zehaan-2781336-2025-09-03",
      "headline": "Gauahar Khan, Zaid Darbar announce birth of second child, a baby boyActor Gauahar Khan and her husband Zaid Darbar welcomed their second child on September 1. The couple shared the news with a joint post on social media. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vivek-agnihotri-recalls-working-with-irrfan-in-debut-film-chocolate-2781295-2025-09-03",
      "headline": "Vivek Agnihotri recalls working with Irrfan in debut film Chocolate: I miss himFilmmaker Vivek Agnihotri recalled working with Irrfan Khan in his debut film 'Chocolate', praising the late actor's spontaneous style and unique screen presence. He also shared memories of Irrfan's off-set persona."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/baseer-farhanas-fight-to-flirt-chemistry-is-the-spicy-twist-bigg-boss-19-needed-2781322-2025-09-03",
      "headline": "Baseer-Farhana's fight-to-flirt chemistry is the spicy twist Bigg Boss 19 neededBaseer Ali Khan and Farhana Bhatt's fiery clashes in 'Bigg Boss 19' are slowly giving way to flirtatious banter and unexpected chemistry. And we are in for it with popcorn!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/bridgerton-star-simone-ashley-kiss-with-mystery-man-at-us-open-2781107-2025-09-03",
      "headline": "Bridgerton's Simone Ashley kiss with mystery man at US Open, pics go viralHollywood star Simone Ashley once again made headlines for her personal life after being seen sharing a kiss with a mystery man at the US Open."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/wednesday-season-2-part-2-review-a-gothic-return-that-fumbles-under-pressure-2781343-2025-09-03",
      "headline": "Wednesday Season 2 Part 2 review: A gothic return that fumbles under pressureNetflix's 'Wednesday' season 2 part 2 concludes with a stylish but overambitious finale. The season sets up new cliffhangers while struggling with pacing and character depth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-episode-10-tanya-mittal-amaal-mallik-clash-baseer-ali-farrhana-bhatt-fight-heat-up-the-house-2781268-2025-09-03",
      "headline": "Bigg Boss 19 episode 10: Tanya-Amaal clash, Baseer-Farrhana fight heat up the houseBigg Boss 19 episode 10 delivered high-voltage drama as fights over food, heated nominations, and emotional breakdowns kept tensions high inside the house."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rahul-deshpande-marathi-singer-announced-separation-from-wife-neha-17-years-2781310-2025-09-03",
      "headline": "Who is Rahul Deshpande, Marathi singer who announced separation from wife, NehaMarathi singer Rahul Deshpande announced his separation from his wife Neha, after 17 years. The two have decided to co-parent their daughter, Renuka. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kaun-banega-crorepati-17-amitabh-bachchan-recalls-buying-watch-first-salary-2781289-2025-09-03",
      "headline": "KBC 17: Amitabh Bachchan recalls buying watch for his father with first salaryWhile sharing an anecdote in the latest episode of 'Kaun Banega Crorepati', Amitabh Bachchan recalled buying a watch for his father with his first salary. However, it was not in the box."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/the-smashing-machine-first-review-dwayne-johnson-best-performance-mark-kerr-biopic-mma-2781273-2025-09-03",
      "headline": "The Smashing Machine first review: Dwayne Johnson's best performance, say criticsActor Dwayne Johnson received praise for his raw and vulnerable portrayal of an MMA fighter in 'The Smashing Machine'. The film, helmed by director Benni Safdie, is based on the life of a former amateur wrestler, Mark Kerr."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/devil-wears-prada-2-to-avengers-doomsday-hollywood-ogs-to-be-back-in-2026-2781256-2025-09-03",
      "headline": "Devil Wears Prada 2 to Avengers Doomsday: Hollywood OGs to be back in 2026Hollywood is set for a blockbuster 2026 with the return of iconic franchises and stars. Studios aim to blend nostalgia with fresh storytelling, promising a thrilling year for movie fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/don-3-amitabh-bachchan-shah-rukh-khan-ranveer-singh-casting-updates-2781261-2025-09-03",
      "headline": "Don 3: Amitabh Bachchan, Shah Rukh Khan to join Ranveer Singh?'Don 3' is creating a buzz with the possibility of Amitabh Bachchan and Shah Rukh Khan joining Ranveer Singh, bringing together three generations of the iconic Don franchise. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shilpa-shetty-shuts-down-her-restaurant-bastian-amid-fraud-allegations-2781251-2025-09-03",
      "headline": "Shilpa Shetty shuts down her restaurant Bastian amid fraud allegationsShilpa Shetty has announced the closure of her iconic Mumbai hotspot, Bastian Bandra, marking the end of an era. Amidst this, she and her husband face a Rs 60-crore fraud allegation, which their lawyer has denied. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-shares-special-video-from-his-sunday-meet-at-jalsa-2781237-2025-09-03",
      "headline": "Amitabh Bachchan shares special video from his Sunday meet at JalsaAmitabh Bachchan shared a video of his Sunday meet with fans at Jalsa, thanking them for their love."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-seeks-blessings-at-ashish-shelars-ganpati-pandal-salman-khan-2781246-2025-09-03",
      "headline": "Aamir Khan seeks blessings at Ashish Shelar's Ganpati pandal. WatchAamir Khan recently visited Maharashtra minister Ashish Shelar's Ganpati pandal. Videos of the superstar seeking blessings have gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/elli-avrram-mourns-grandmother-death-pays-tribute-pics-videos-2781178-2025-09-03",
      "headline": "Actor Elli AvrRam pays tribute to her late grandmother, shares pics and videosActor Elli AvrRam mourned the death of her grandmother, sharing an emotional tribute with heartfelt memories on social media. Several industry colleagues extended their condolences as the actor remembered her close bond with her late grandparent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/simple-kaul-rahul-loomba-separation-13-years-marriage-2781197-2025-09-03",
      "headline": "Simple Kaul and Rahul Loomba separate after 13 years of marriageSimple Kaul has separated from her husband Rahul Loomba after 13 years of marriage. The Shararat actor confirmed the news to a media portal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/lokah-box-office-collection-day-6-kalyani-priyadarshan-superhero-film-rs-50-crore-india-2781190-2025-09-03",
      "headline": "Lokah box office Day 6: Kalyani's superhero film eyes Rs 50 crore in IndiaKalyani Priyadarshan and Naslen's 'Lokah Chapter 1: Chandra' is inching closer towards Rs 50 crore-mark in India. The superhero film is showing no signs of slowing down."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/varun-dhawan-janhvi-kapoor-groove-to-reimagined-bijuria-in-sunny-sanskari-ki-tulsi-kumari-2781192-2025-09-03",
      "headline": "Sonu Nigam's Bijuria gets revamp for Varun-Janhvi's Sunny Sanskari Ki Tulsi KumariSonu Nigam's 90s hit 'Bijuria' returns in 'Sunny Sanskari Ki Tulsi Kumari', reimagined by Tanishk Bagchi and voiced by Nigam with Asees Kaur for a new-gen groove."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/persecuted-minorities-from-afghanistan-bangladesh-pak-who-came-by-2024-will-be-allowed-to-stay-government-2781231-2025-09-03",
      "headline": "CAA cut-off date extended, persecuted minorities who came by 2024 can stay onHindus, Sikhs, Buddhists, Jains, Parsis and Christians from Afghanistan, Pakistan and Bangladesh who entered India on or before December 31, 2024 will be allowed to stay in the country, the government said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/donald-trump-softening-stance-india-ties-tariff-trade-deal-after-harsh-criticism-2781316-2025-09-03",
      "headline": "Has Trump tempered India tone after weeks of rabid criticism?US-India ties: In recent days, a softer and more calibrated messaging has given way to the barrage of sharp criticisms seen just a week ago that saw India being dubbed the 'Kremlin's laundromat' and the Ukraine conflict being called 'Modi's war'. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/sending-resignation-as-brs-member-says-k-kavitha-day-after-being-suspended-over-alleged-anti-party-activities-2781244-2025-09-03",
      "headline": "Conspiracies against me: K Kavitha quits BRS, drops bombshells after suspensionK Kavitha resigned from her MLC post a day after being suspended from the party, intensifying the turmoil within the KCR-led outfit. She accused her cousins Harish Rao and Santosh Kumar of conspiring against her father, weakening the party, and plotting to divide their family. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maratha-quota-protest-mumbai-is-manoj-jarange-patil-really-a-achievement-big-historic-win-explained-voices-2781290-2025-09-03",
      "headline": "Has Jarange Patil really won the Maratha quota battle?Maratha quota activist Manoj Jarange Patil called the Maharashtra government's nod to accord the Kunbi status a breakthrough. However, the gains are narrowly tailored for only those Marathas with traceable records and would leave out millions. Is this victory big enough for Patil, who was turned away empty-handed several times?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/maruti-suzuki-victoris-unveiled-new-mid-size-suv-with-5-star-bncap-rating-adas-2781271-2025-09-03",
      "headline": "Maruti Suzuki Victoris unveiled: New mid-size SUV with 5-Star BNCAP Rating, ADASMaruti Suzuki has unveiled the Victoris, a new mid-size SUV for its Arena network. Positioned above the Brezza and Grand Vitara, it boasts premium features, multiple powertrains, and a 5-star BNCAP rating."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/north-koreas-great-clean-up-kim-jong-uns-aides-erase-dna-after-talks-with-putin-2781377-2025-09-03",
      "headline": "North Korea's great clean-up: Kim Jong Un's aides erase DNA after talks with PutinThe unusual spectacle unfolded on Wednesday, shortly after the North Korean and Russian leaders held talks following a grand military parade in Beijing, where Chinese President Xi Jinping showcased his nation's growing diplomatic clout."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/at-gst-council-meet-opposition-ruled-states-seek-revenue-protection-compensation-plan-sources-2781265-2025-09-03",
      "headline": "Opposition states demand revenue protection at GST Council meet: SourcesThese states have stressed that companies must not profiteer from lower GST rates and that benefits should be passed directly to consumers. They are also pressing for a clear compensation plan to ensure that states do not face massive revenue shortfalls. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-trade-row-trump-tariff-finland-president-warns-india-sco-summit-west-global-south-2781263-2025-09-03",
      "headline": "If we don't engage...: Finland President cautions Trump over Indian foreign policyPointing to last week's SCO summit in China, Finland President Alexander Stubb said the gathering of leaders of the Global South underscored how the bloc is positioning itself against Western influence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/wink-girl-priya-prakash-varrier-background-actor-param-sundari-malayali-representation-row-2781067-2025-09-03",
      "headline": "Priya Varrier's Param Sundari cameo as extra angers Malayalis amid portrayal rowMalayalam actor Priya Prakash Varrier, popularly known as 'Wink Girl', appeared as a background actor in Janhvi Kapoor and Sidharth Malhotra's 'Param Sundari'. Fans were surprised to see her in the background, not even uttering a single dialogue, and said that she should have played Janhvi Kapoor's role of a half-Malayali, half-Tamilian."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/is-donald-trump-trying-punish-india-it-services-exports-after-taxing-trade-tariff-peter-navarro-h1b-new-visa-policy-2781264-2025-09-03",
      "headline": "Is Trump trying to punish India's prized IT sector next?The US, after imposing high tariffs on exports from India, is considering taxes on its IT services and tech workers. The buzz of taxing foreign remote workers comes amid the crackdown on the H-1B visa programme, a mainstay of India's tech companies. Trump is threatening a sector that is central to India's economy and global standing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/why-umar-khalid-denied-bail-2020-delhi-riots-case-high-court-prolonged-trial-2781189-2025-09-03",
      "headline": "5 years on, Umar Khalid languishes in jail without bail or trial. Natural pace?2020 Delhi riots case: For Umar Khalid, accused of being the 'key conspirator' in the northeast Delhi riots of 2020 that left 53 people dead, this was the sixth time that he was denied bail. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/india-china-sco-summit-normalise-ties-modi-visit-shifts-relations-us-pressure-2781329-2025-09-03",
      "headline": "India geopolitically promiscuous, knows what it wants: Analyst on tariff standoffIndia and China moved towards normalising ties at the SCO summit in Tianjin. The rapprochement signals a geopolitical shift that has unsettled the US, says geopolitical analyst Marko Papic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bengaluru-couple-spends-rs-59-lakh-monthly-shares-expense-list-in-viral-video-2781135-2025-09-03",
      "headline": "Bengaluru couple spends Rs 5.9 lakh monthly, shares expense list in viral videoIn a now-viral video, a Bengaluru-based couple broke down their expenses for the month of August in detail.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/environment/story/ladakh-rains-floods-monsoon-rainfall-surge-in-ladakh-2781203-2025-09-03",
      "headline": "Ladakh drenched in 930% excess rain: The shocking reason behind itUnprecedented August rains in Ladakh have been due to western disturbances and monsoons, with Leh, the region's capital, itself logged 55 mm of rain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/asia-cup-paddy-upton-indian-hockey-virat-kohli-world-cup-olympics-2781037-2025-09-03",
      "headline": "18 Virat Kohlis in one side? Why Indian men's hockey team is built to win bigMental conditioning coach Paddy Upton, in an exclusive chat with India Today, revealed his amazement at the fitness of the Indian men's hockey team, calling them a side that has 18 Virat Kohlis in it. Upton also spoke about his current work with the team and praised Craig Fulton as a coach. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/story/chatgpt-ai-outage-down-meter-people-social-media-chatter-world-india-artificial-intelligence-disruption-why-glitch-2781326-2025-09-03",
      "headline": "ChatGPT isn't down. It helped write this copy as proofUsers reported ChatGPT outages in India and worldwide, citing login failures and unresponsive chats, but India Today Digital checked what the chatbot itself had to say: it's fully operational, with the disruption likely due to isolated technical glitches rather than a global outage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/jobs-and-careers/story/humans-getting-paid-to-fix-ai-mistakes-freelance-job-trend-2781209-2025-09-03",
      "headline": "AI made the mess. Now humans are getting paid to clean itAI generates content fast but often badly. An MIT report and freelance-platform data show people are earning by fixing AI output, creating a new clean-up niche in the gig economy. Looks like the AI job takeover isn't going to be very successful yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/what-is-the-hyderabad-gazette-giving-reservation-to-marathas-kunbi-status-maharashtra-government-maratha-quota-row-2781342-2025-09-03",
      "headline": "What is the Hyderabad Gazette giving 'Kunbi status' and reservation to Marathas?The Maharashtra government has accepted the use of the Hyderabad Gazette, issued by the Nizam of Hyderabad in 1918, as a basis for granting Maratha communities 'Kunbi' status and thus granting OBC reservation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/pengdao-chinas-phd-village-has-churned-out-33-doctorates-2781356-2025-09-03",
      "headline": "Pengdao, China's 'PhD village' has churned out 33 doctoratesPengdao Village in China, now called the 'PhD Village', has produced 33 doctoral graduates through scholarships and a strong community focus on education, celebrated recently at a viral scholarship ceremony."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/india-boosts-russian-oil-imports-despite-us-tariffs-steep-discounts-2781167-2025-09-03",
      "headline": "Russia's bigger oil discounts lure India, Trump's tariff gambit backfires: ReportBetween August 27 and September 1 – right after Trump's tariffs came into effect – Indian refiners snapped up 11.4 million barrels of discounted Russian crude. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/the-smashing-machine-first-review-dwayne-johnson-best-performance-mark-kerr-biopic-mma-2781273-2025-09-03",
      "headline": "The Smashing Machine first review: Dwayne Johnson's best performance, say criticsActor Dwayne Johnson received praise for his raw and vulnerable portrayal of an MMA fighter in 'The Smashing Machine'. The film, helmed by director Benni Safdie, is based on the life of a former amateur wrestler, Mark Kerr."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-e-rickshaw-tirri-tuktuk-versatile-ev-memes-reels-viral-instagram-fb-ambulance-police-wedding-transport-safety-2780991-2025-09-03",
      "headline": "Virus Tirri grows up as ambulance, police van and trainThe humble e-rickshaw, a moving menace, gained prominence after 2010 for last-mile connectivity. Popular as Tirri in west UP, Toto in Bengal and Mayuri in Delhi, the e-rickshaw has morphed into ambulances, police vans and even loading trucks. The caterpillar-to-butterfly story has triggered memories and a meme fest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/baseer-farhanas-fight-to-flirt-chemistry-is-the-spicy-twist-bigg-boss-19-needed-2781322-2025-09-03",
      "headline": "Baseer-Farhana's fight-to-flirt chemistry is the spicy twist Bigg Boss 19 neededBaseer Ali Khan and Farhana Bhatt's fiery clashes in 'Bigg Boss 19' are slowly giving way to flirtatious banter and unexpected chemistry. And we are in for it with popcorn!"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/newborn-dies-two-days-after-rats-bite-infants-at-indore-hospital-staff-suspended-2781252-2025-09-03",
      "headline": "Newborn dies two days after rats bite infants at Indore hospital, staff suspendedTwo newborn babies were bitten by rats roaming around in the infant ward of a government hospital in Indore. One of them died two days later on Tuesday."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-bcci-fitness-test-london-exception-teammates-bengaluru-2781386-2025-09-03",
      "headline": "Virat Kohli gave BCCI fitness test in London, claims report. Fans call out exceptionVirat Kohli took his pre-season fitness test in London, unlike his teammates who tested in Bengaluru, according to a news report. The former captain is gearing up for his one-day international return in a three-match series in Australia in October."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/ioc-lifts-ioa-suspension-governance-reforms-funding-restored-indian-athletes-2781358-2025-09-03",
      "headline": "Olympic body restores funding to Indian association after CEO hire, sports billThe International Olympic Committee has fully reinstated its partnership with the Indian Olympic Association, 11 months after suspending funding to the national body. The decision comes as a relief to Indian athletes in the lead-up to the Asian Games in 2026 and the Olympics in 2028."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-day-11-quarterfinals-schedule-sinner-swiatek-bhambri-2781330-2025-09-03",
      "headline": "US Open Day 11 schedule of play: Sinner and Swiatek eye semifinal berthsQuarter-final matches continue at the US Open 2025 with top seeds in action. Key rivalries and Indian interest add excitement to the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/madan-lal-backs-india-asia-cup-favourites-kuldeep-yadav-2781321-2025-09-03",
      "headline": "Asia Cup: Madan Lal backs India as favourites, advocates for Kuldeep's inclusionFormer cricketer Madan Lal backed India as strong favourites to defend their Asia Cup title in Dubai, highlighting the importance of Kuldeep Yadav's inclusion and the rising challenge posed by Afghanistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/pakistan-likely-to-boycott-junior-hockey-world-cup-in-india-2781312-2025-09-03",
      "headline": "Pakistan likely to boycott Junior Hockey World Cup in IndiaPakistan is likely to withdraw from the 2025 FIH Men's Junior Hockey World Cup, scheduled to be held in Chennai and Madurai, India, from November 28 to December 10."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/irish-open-2025-mcilroy-koepka-headline-high-stakes-showdown-at-the-k-club-2781287-2025-09-03",
      "headline": "McIlroy, Koepka headline high-stakes showdown at the K ClubThe Irish Open returns to the K Club with a $6M purse, Ryder Cup momentum, and a star-studded field led by Rory McIlroy, Brooks Koepka, and Shane Lowry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/the-rock-weight-loss-transformation-wwe-return-hollywood-2781286-2025-09-03",
      "headline": "The Rock unveils lean new look after 27kg drop. WWE return in doubt?Dwayne \"The Rock\" Johnson debuted a dramatically leaner look at Venice after shedding 27kg for his role as MMA legend Mark Kerr, sparking fan buzz and health debates, while die-hard WWE faithful worry it could put a damper on his long-teased wrestling comeback."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jhulan-goswami-praises-icc-for-increasing-prize-money-of-womens-world-cup-2781245-2025-09-03",
      "headline": "Jhulan Goswami praises ICC for increasing prize money for Women's World CupJhulan Goswami has praised the ICC's landmark decision to offer a staggering 13.88 million USD in prize money for the 2025 Women's World Cup. She believes this will motivate both players and their parents to pursue cricket at a professional level."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-asia-cup-t20-template-irfan-pathan-interview-2781229-2025-09-03",
      "headline": "Leader Shubman Gill won't struggle with India's new T20 template: Irfan PathanAsia Cup 2025: Shubman Gill is set to open the batting alongside Abhishek Sharma, with Sanju Samson likely to make way for the returning star, who has been appointed vice-captain of the T20I side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-reaction-carlos-alcaraz-us-open-semi-final-2781191-2025-09-03",
      "headline": "Novak Djokovic looking to 'mess up Sinner-Alcaraz final plans' in US OpenAfter storming into the semifinals of the US Open 2025, Novak Djokovic has laid bare his plans to 'mess up Jannik Sinner vs Carlos Alcaraz final plans' as he prepares for the clash with the Spaniard."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/sandesh-jhingan-injury-india-cafa-nations-cup-ruled-out-2781144-2025-09-03",
      "headline": "Blow to India as Sandesh Jhingan ruled out of CAFA Nations Cup due to injuryIndian men's football team captain Sandesh Jhingan has been ruled out of the rest of the CAFA Nations Cup after sustaining an injury during India's 0-3 loss to Iran, the All India Football Federation (AIFF) confirmed on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/the-rock-weight-loss-transformation-wwe-return-hollywood-2781286-2025-09-03",
      "headline": "The Rock unveils lean new look after 27kg drop. WWE return in doubt?Dwayne \"The Rock\" Johnson debuted a dramatically leaner look at Venice after shedding 27kg for his role as MMA legend Mark Kerr, sparking fan buzz and health debates, while die-hard WWE faithful worry it could put a damper on his long-teased wrestling comeback."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jhulan-goswami-praises-icc-for-increasing-prize-money-of-womens-world-cup-2781245-2025-09-03",
      "headline": "Jhulan Goswami praises ICC for increasing prize money for Women's World CupJhulan Goswami has praised the ICC's landmark decision to offer a staggering 13.88 million USD in prize money for the 2025 Women's World Cup. She believes this will motivate both players and their parents to pursue cricket at a professional level."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-asia-cup-t20-template-irfan-pathan-interview-2781229-2025-09-03",
      "headline": "Leader Shubman Gill won't struggle with India's new T20 template: Irfan PathanAsia Cup 2025: Shubman Gill is set to open the batting alongside Abhishek Sharma, with Sanju Samson likely to make way for the returning star, who has been appointed vice-captain of the T20I side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-reaction-carlos-alcaraz-us-open-semi-final-2781191-2025-09-03",
      "headline": "Novak Djokovic looking to 'mess up Sinner-Alcaraz final plans' in US OpenAfter storming into the semifinals of the US Open 2025, Novak Djokovic has laid bare his plans to 'mess up Jannik Sinner vs Carlos Alcaraz final plans' as he prepares for the clash with the Spaniard."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/sandesh-jhingan-injury-india-cafa-nations-cup-ruled-out-2781144-2025-09-03",
      "headline": "Blow to India as Sandesh Jhingan ruled out of CAFA Nations Cup due to injuryIndian men's football team captain Sandesh Jhingan has been ruled out of the rest of the CAFA Nations Cup after sustaining an injury during India's 0-3 loss to Iran, the All India Football Federation (AIFF) confirmed on Wednesday."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}