{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-deal-full-exemption-of-26-percent-reciprocal-tariff-2728230-2025-05-21",
      "headline": "India seeks full 26% tariff exemption in trade deal with US: ReportThe reciprocal duty, announced by the Trump administration on April 2, is currently suspended until July 9 under a 90-day pause meant to allow room for negotiations. The US's baseline 10% tariff, however, remains in place."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/onion-glut-crashes-prices-across-maharashtra-farmers-count-losses-2728145-2025-05-21",
      "headline": "Onion glut crashes prices across Maharashtra, farmers count lossesIn Navi Mumbai's Vashi APMC—the main supplier of onions to the Mumbai Metropolitan Region—wholesale prices have dropped from Rs 35–40 per kilogram in February to just Rs 7–17 in May."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-ends-410-points-higher-nifty-above-24800-bajaj-finserv-gains-2-percent-2728139-2025-05-21",
      "headline": "Sensex ends 410 points higher; Nifty above 24,800; Bajaj Finserv gains 2%The S&P BSE Sensex gained 410.19 points to close at 81,596.63, while the NSE Nifty added 129.55 points to end at 24,813.45. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/can-sensex-hit-100000-in-12-months-heres-what-morgan-stanley-analyst-ridham-desai-says-2728127-2025-05-21",
      "headline": "Can Sensex hit 1,00,000 in 12 months? Here's what Morgan Stanley saysThe bull case, where Sensex hits 1 lakh within the next 12 months, rests on more aggressive assumptions: oil prices persistently below $65/barrel, progress on farm reforms, GST rate cuts, and CAGR of 19% in corporate earnings. Relief from global trade tensions would further fuel this scenario."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/leela-hotels-ipo-details-check-price-band-gmp-subscription-and-listing-date-2728116-2025-05-21",
      "headline": "Leela Hotels IPO details: Check price band, GMP, subscription and listing dateLeela Hotels IPO will open for bidding on May 26, 2025 and will close on May 28, 2025. Price band for the IPO has been set between Rs 413 and Rs 435 per share."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gensol-engineering-fraud-nfra-probe-financial-record-account-book-sebi-investigation-2728102-2025-05-21",
      "headline": "Gensol's books under review: NFRA launches preliminary probeIn April, Sebi took action against Gensol Engineering and its promoters brothers Anmol Jaggi and Puneet Jaggi. The market regulator barred the two from accessing the stock markets and called for a forensic audit into the affairs of the company."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/moody-credit-rating-agency-explains-india-economy-not-affected-tariff-threat-2728067-2025-05-21",
      "headline": "Explained : Why Moody's thinks tariffs won't slow down India's economyThe credit ratings agency said India is in a better position than many other emerging markets to handle the tariff challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/accenture-promotions-15000-india-six-month-delay-report-global-salary-hike-it-consulting-job-2728039-2025-05-21",
      "headline": "Accenture promotions: 15,000 India staff finally get nod, says reportAccenture will offer 50,000 promotions globally. The global consulting and technology firm, which is headquartered in Dublin, had initially planned to roll out promotions in December 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/bengaluru-peepalco-group-ceo-ashish-singhal-middle-class-salary-crisis-2728029-2025-05-21",
      "headline": "'Biggest scam': Bengaluru CEO on India's silent middle-class salary crisisIn a LinkedIn post, PeepalCo Group CEO Ashish Singhal called India's middle-class salary stagnation amid soaring costs \"the biggest scam no one talks about\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/iphone-production-india-donald-trump-tim-cook-apple-ceo-why-foxconn-investment-2727994-2025-05-21",
      "headline": "Why Trump desperately wants Apple back in the US?Apple has been working closely with partners like Foxconn, Pegatron and Tata Electronics to make more iPhones in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/bel-share-price-jumps-4-percent-defence-stock-in-focus-should-you-buy-hold-or-sell-2727969-2025-05-21",
      "headline": "BEL share price jumps 4% today. Should you buy, hold or sell?The stock has surged over 26% in the past month, driven by improving operating margins and robust order book visibility, even as FY25 order inflows fell slightly short of guidance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-jump-today-trading-session-what-is-driving-the-stock-market-dalal-street-rally-2727963-2025-05-21",
      "headline": "Sensex jumps 700 points despite global headwinds. What's driving the rally?The BSE Sensex jumped over 687.83 points to 81,874.27 by 10:18 am, while the NSE Nifty50 gained 214.15 points to 24,898.05. The rebound was broad-based, with all major indices trading higher after a sharp fall in the previous session."
    }
  ],
  "entertainment": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/chris-brown-bail-london-assault-charge-music-producer-attack-tour-2728238-2025-05-21",
      "headline": "Chris Brown granted bail in London assault case ahead of world tourChris Brown was granted bail by a London court after a serious assault charge. This development allows his world tour to proceed despite ongoing legal challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rahul-bhat-on-playing-sanjay-gandhi-in-sudhir-mishra-summer-of-77-exclusive-2728146-2025-05-21",
      "headline": "Rahul Bhat on playing politician Sanjay Gandhi: Tried to get his aura rightRahul Bhat is gearing up to portray politician Sanjay Gandhi in Sudhir Mishra's 'Summer of 77', aiming to capture his unique aura. In an exclusive interview, he also opened up about the time when he met the politician as a child."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shabana-azmi-aparna-sen-ankur-tribute-shyam-benegal-50-years-cinema-2728138-2025-05-21",
      "headline": "Thank you for not doing it: Shabana Azmi to Aparna Sen for turning down AnkurVeteran actors Shabana Azmi and Aparna Sen came together at the Habitat Film Festival to honour late filmmaker Shyam Benegal. The event also celebrated Shabana's remarkable 50-year journey in Indian cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ar-rahman-collaboration-mani-ratnam-he-has-seen-my-growth-2728176-2025-05-21",
      "headline": "AR Rahman on long-standing collaboration with Mani Ratnam: He has seen my growthComposer AR Rahman, in an interview with India Today, opened up about his collaboration with director Mani Ratnam. He also shared that they have mutual respect for each other."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/rahul-bhat-kennedy-release-delay-in-india-it-hurts-hope-it-releases-soon-exclusive-2728079-2025-05-21",
      "headline": "Rahul Bhat on Kennedy release delay: It hurts, hope it releases soonActor Rahul Bhat is hopeful about the release of his offbeat film 'Kennedy' this year despite its delay. He emphasises the need for dedicated theatres for such films and the importance of art reaching its audience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/janhvi-kapoor-cannes-2025-backless-green-dress-brings-desi-drama-styled-by-rhea-kapoor-2728170-2025-05-21",
      "headline": "Janhvi Kapoor continues to bring desi drama at Cannes in backless dressActor Janhvi Kapoor is representing a bit of India at Cannes this year. She attended the premiere of her film 'Homeboound' in a green sculpted dress that came with backless detailing. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshan-shooting-war-2-was-not-easy-we-have-given-our-everything-jr-ntr-2728165-2025-05-21",
      "headline": "Hrithik Roshan says shooting War 2 was not easy: We have given our everythingHrithik Roshan and Jr NTR starrer 'War 2' teaser released on May 20. Amid all the love from fans, Hrithik thanked fans and shared how making 'War 2' was not easy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/special-budget-separate-rooms-for-drugs-malayalam-producer-sandra-thomas-makes-explosive-claims-2728134-2025-05-21",
      "headline": "Special budget, separate rooms for drugs: Malayalam producer's explosive claimsActor-turned-producer Sandra Thomas has made shocking revelations about the drug crisis on Mollywood movie sets. She alleged that shooting often gets stalled because of the menace."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/abhishek-bachchan-is-raja-shivaji-in-riteish-deshmukh-film-see-first-poster-2728142-2025-05-21",
      "headline": "Riteish Deshmukh is 'Raja Shivaji' in his directorial. See first posterActor Abhishek Bachchan shared the first poster of his film 'Raja Shivaji, in which Riteish Deshmukh plays the titular role. It is directed by Deshmukh, while Bachchan, Sanjay Dutt, Genelia Deshmukh and Bhagyashree, among others, play important roles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mani-ratnam-justifies-kamal-haasan-thug-life-title-we-are-gen-z-it-felt-right-2728109-2025-05-21",
      "headline": "Director Mani Ratnam justifies Thug Life title: We are Gen-Z, it felt rightDirector Mani Ratnam, known for adapting with time while staying rooted in storytelling, is back with the film 'Thug Life'. At a press interaction in Mumbai, he opened up about how the title came to be and how it reflects a conscious shift towards younger sensibilities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ram-gopal-varma-slammed-for-crass-post-on-actor-kiara-advani-war-2-bikini-pic-deletes-later-2728084-2025-05-21",
      "headline": "Ram Gopal Varma slammed for crass post on Kiara's War 2 bikini pic, deletes laterFilmmaker Ram Gopal Varma recently faced criticism over a distasteful post on X about actor Kiara Advani's bikini shot from the teaser of War 2. He later deleted his late-night post."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jurassic-world-rebirth-second-trailer-unveiled-releasing-on-july-2-in-theatres-2728022-2025-05-21",
      "headline": "Jurassic World Rebirth second trailer out, film to release on July 2The second trailer of 'Jurassic World Rebirth' was unveiled on May 20. The trailer revealed a range of mutant dinosaurs who were left behind on an island where they were once experimented on. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/exclusive-at-cannes-2025-the-second-wind-shines-as-india-only-women-led-film-interview-with-filmmaker-indira-baikerikar-2728082-2025-05-21",
      "headline": "Exclusive: At Cannes 2025, The Second Wind shines as India's only women-led filmFilmmaker Indira Baikerikar took her debut film 'The Second Wind' at the Cannes International Film Festival 2025. IndiaToday.in spoke to the director about presenting India's only women-centric film at the prestigious film festival this year, and showcasing the real-life stories of real Indian women on a global platform. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shilpa-shetty-kundra-emotional-message-for-son-viaan-whos-officially-a-teenager-now-2728083-2025-05-21",
      "headline": "Shilpa Shetty's emotional message for son Viaan who's officially a teenager nowShilpa Shetty celebrated her son Viaan's 13th birthday with a heartfelt video montage capturing his childhood memories. She also shared an emotional message encouraging him to stay curious, work hard, and enjoy his teenage years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kamal-haasan-learning-ai-in-us-thug-life-2728087-2025-05-21",
      "headline": "Kamal Haasan on learning AI: It's here to stay, but don't be threatenedKamal Haasan went to the US to learn Artifical Intelligence (AI) for three months. In an interview with India Today, he spoke about the use of AI in movies. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-emotional-tribute-to-f1-legend-ayrton-senna-wins-the-internet-2728080-2025-05-21",
      "headline": "Ajith Kumar emotional tribute to F1 legend Ayrton Senna wins the internetAjith Kumar paid an emotional tribute to Formula One icon Ayrton Senna. He visited his memorial in Imola, Italy and kissed his statue. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/achint-kaur-seeks-acting-voice-work-social-media-family-loss-2728030-2025-05-21",
      "headline": "Jamai Raja actor Achint Kaur on seeking work via social media postActor Achint Kaur of Jamai Raja fame posted a video seeking acting and voice roles after her mother's death. She was initially terrified but received strong support, opening doors to new opportunities."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/amul-pays-tribute-to-tom-cruises-mission-impossible-8-better-ethan-the-rest-2728034-2025-05-21",
      "headline": "Amul pays tribute to Tom Cruise's Mission Impossible 8: Better Ethan the restAmul paid a fun tribute to Tom Cruise's 'Mission: Impossible - The Final Reckoning' with a witty cartoon showing him hanging from a helicopter while holding buttered toast. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/sean-diddy-threatened-ex-cassie-ventura-with-sex-tapes-demanded-20000-says-her-mother-2728056-2025-05-21",
      "headline": "Sean Diddy threatened ex Cassie with sex tapes, demanded $20,000, says her motherCassandra \"Cassie\" Ventura's mother has alleged that Sean \"Diddy\" Combs demanded $20,000 out of anger after learning that her daughter had started dating someone else. Diddy and Cassie were in a relationship for nearly a decade.\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/turkey-linked-aviation-firm-celebi-lost-clearance-tells-delhi-high-court-indian-employees-2728244-2025-05-21",
      "headline": "We are Indian, employees are Indians, Turkey-linked Celebi Aviation tells court'We are Indian company, employees are Indians', Turkey-linked aviation firm that lost clearance tells court"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-waqf-law-hearing-waqf-by-user-principle-government-land-2728061-2025-05-21",
      "headline": "Waqf is like charity, not an essential part of Islam: Centre to Supreme CourtThe Centre told the Supreme Court that the latest Waqf law amendments 'resolved problems' that the British and successive Indian governments could not settle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/attempt-to-hoodwink-world-doomed-to-fail-india-rejects-pak-charge-of-role-in-balochistan-school-bus-blast-2728199-2025-05-21",
      "headline": "Attempt to hoodwink: India rejects Pak charge of role in Balochistan bus blastIndia condemned the Balochistan school bus bombing but dismissed Pakistan's accusation of involvement as 'baseless', asserting Islamabad is deflecting blame for internal failures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/indus-water-treaty-satellite-images-show-china-ramped-up-pakistan-dam-work-late-2024-2728130-2025-05-21",
      "headline": "Satellite images show China ramped up Pakistan dam work in late 2024China's state media reported speeding up dam construction in Pakistan after India suspended the IWT, but satellite images show construction picked up pace in September 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/golden-dome-over-america-how-this-trump-proposed-missile-shield-will-work-2728123-2025-05-21",
      "headline": "Golden Dome over America: How Trump's new missile shield will workProposed by defense giant Lockheed Martin, the system aims to integrate ground and space-based technologies to detect, track, and intercept projectiles at every stage of flight, from launch to impact."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-bjp-mla-munirathna-gangrape-urination-injection-virus-bengaluru-police-2728143-2025-05-21",
      "headline": "Urinated on face, injected virus: Woman accuses Karnataka BJP MLA of gangrapeA 40-year-old woman has accused Karnataka BJP MLA Munirathna of gangraping, urinating on her, and injecting her with a harmful substance. An FIR has been filed in Bengaluru. Police are investigating the allegations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nambala-keshav-rao-naxal-top-commander-killed-chhattisgarh-encounter-2728178-2025-05-21",
      "headline": "Who was Basavaraju, 'backbone' of Naxal movement, killed in encounter?Nambala Keshav Rao was part of the Naxalite movement since the late 1970s and was one of its most feared strategists. He was killed in an encounter with security forces in Chhattisgarh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/girls-body-found-in-suitcase-near-bengaluru-railway-bridge-probe-on-2728125-2025-05-21",
      "headline": "Woman's body found in suitcase in Bengaluru, likely thrown out of moving trainA body of an unidentified girl, presumably around 18 years old, was found inside a suitcase near a railway bridge in southern Bengaluru. Police suspect the suitcase was thrown from a moving train. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/janhvi-kapoor-cannes-2025-backless-green-dress-brings-desi-drama-styled-by-rhea-kapoor-2728170-2025-05-21",
      "headline": "Janhvi Kapoor continues to bring desi drama at Cannes in backless dressActor Janhvi Kapoor is representing a bit of India at Cannes this year. She attended the premiere of her film 'Homeboound' in a green sculpted dress that came with backless detailing. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/an-architectural-trail-in-gujarat-2723608-2025-05-15",
      "headline": "An Architectural Trail in GujaratPress Release | Vadnagar has substantial remains of its ancient Buddhist heritage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-prepares-strike-iran-nuclear-facilities-rising-tensions-2728074-2025-05-21",
      "headline": "Why Israel cannot strike Iranian nuclear facilities without US helpIsrael lacks the specialist munitions that could completely destroy Iranian nuclear weapons infrastructure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/sbi-anekal-taluk-branch-officer-customer-kannada-speaking-argument-viral-video-2727968-2025-05-21",
      "headline": "Won't speak Kannada, this is India: SBI official spars with customer, transferredA viral video showing an SBI staffer refusing to speak Kannada has sparked backlash, prompting an apology from the bank. However, pro-Kannada activists demanded respect for the state's official language and have called for a protest outside its main office in Bengaluru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/dietary-strategies-mimic-injectable-weight-loss-drugs-ozempic-mounjaro-2728133-2025-05-21",
      "headline": "Can you mimic the effects of weight-loss drugs with just diet?Injectable drugs like Ozempic and Mounjaro have transformed obesity treatment by mimicking gut hormones. But experts have shared some dietary strategies that can support weight loss without medication."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-grants-interim-bail-to-ashoka-university-professor-over-op-sindoor-post-refuses-to-stay-probe-2728018-2025-05-21",
      "headline": "Ashoka professor gets bail, rapped for 'cheap publicity' in Op Sindoor postAli Khan Mahmudabad of Ashoka University was arrested last week after his social media post on Operation Sindoor was perceived as critical of the armed forces."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/indus-canal-water-protests-pakistan-sindh-boils-two-activists-dead-pak-army-asim-munir-minister-home-torched-2728086-2025-05-21",
      "headline": "Sindh turns battlefield over Pak Army's Indus canals, 2 shot deadNorthern Sindh turned into a \"virtual battlefield\" as people protesting against the Pakistan Army's Indus canals project set oil tankers and a minister's house on fire. Two activists were killed and 15 injured as police opened fire. PPP leader Bilawal Bhutto and his party were criticised by Sindhi activists, who blame Punjab's dominance for their woes."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/nikhil-somawanshi-iisc-graduate-toxic-work-culture-ola-krutrim-extreme-pressure-may-8-death-in-bengaluru-lake-2728055-2025-05-21",
      "headline": "Tell everyone I died in accident, Ola Krutrim techie texted friend before suicideNikhil Somawanshi, a machine learning engineer at Krutrim, who allegedly died by suicide had messaged his friend to tell everyone that he had died by accident. His body was found in a Bengaluru lake the next morning. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/the-stigma-of-career-breaks-are-psychological-social-pressures-and-bias-real-2727095-2025-05-21",
      "headline": "The stigma of career breaks: Are psychological, social pressures, and bias real?Career breaks are increasingly common in today's dynamic work landscape, yet they still carry a stigma that can hinder re-entry. Despite progress in inclusive hiring, fears of bias and discrimination remain valid for many professionals.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/robbery-in-us-leads-to-visa-fraud-attempt-by-illegal-indian-migrant-u-visa-fraud-indian-origin-people-in-us-2727571-2025-05-21",
      "headline": "A fake robbery in US, American visa and an illegal Indian immigrantAn investigation into a robbery in Connecticut revealed that it was staged by an Indian-origin shop owner to help his clerk, an illegal Indian migrant, stay in the US by exploiting the U-Visa programme. Now, the case has been referred to the Department of Homeland Security."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rajasthan-serial-killer-arrest-doctor-death-devender-sharma-fed-victims-to-crocodiles-2727861-2025-05-20",
      "headline": "Doctor-turned-serial killer, who fed victims to crocodiles, arrested in RajasthanSerial killer who fed victims to crocodiles caught after six-month manhunt. He had over 50 murders to his name and a kidney racket under his belt."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/heat-on-h-1b-work-visa-us-clamp-down-indian-travel-agencies-maga-laura-loomer-trump-america-immigration-2728103-2025-05-21",
      "headline": "Heat on H-1B visas now as US clamps down on Indian travel agentsThe MAGA heat is now directed at H-1B work visas in the US. This is after the Trump administration announced visa restrictions on Indian travel agents aiding illegal immigration. While some MAGA supporters asked for a clamp down on H-1B next, others expressed disappointment with no strict action on what they called the \"H-1B scam\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/aditi-rao-hydari-looks-ravishing-in-red-saree-with-sindoor-at-cannes-2728111-2025-05-21",
      "headline": "Aditi Rao Hydari looks ravishing in red saree with 'sindoor' at CannesActor Aditi Rao Hydari shared pictures from her second look at Cannes. The actor radiated glow in a red Raw Mango saree with 'sindoor', "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/diu/story/global-conflicts-at-a-record-high-half-of-humanity-affected-2728197-2025-05-21",
      "headline": "Global conflicts at a record high, half of humanity affectedA whopping 423 crore people from at least 50 countries have been exposed to conflict in the past year alone. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/the-lowdown/story/national-herald-money-laundering-case-explained-charges-against-sonia-gandhi-rahul-2728000-2025-05-21",
      "headline": "Are Sonia Gandhi, Rahul in trouble in the National Herald case?The National Herald case involves allegations of financial irregularities and money laundering against Sonia Gandhi, her son Rahul Gandhi. In this edition of The Lowdown, we delve into the intricacies of the case, the charges against the Congress leaders and the consequences if the allegations are proved."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/spy-youtuber-jyoti-malhotra-confesses-met-pakistani-intelligence-agents-2727961-2025-05-21",
      "headline": "'Spy' YouTuber admits to meeting Pak agents, use of encrypted apps: SourcesHaryana-based YouTuber Jyoti Malhotra has told interrogators that she was in regular contact with Danish, a Pakistani High Commission official in New Delhi."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ben-stokes-on-virat-kohli-test-retirement-text-message-england-tour-2728239-2025-05-21",
      "headline": "Ben Stokes reveals text message to Virat Kohli after India star's Test retirementEngland Test captain Ben Stokes said he enjoyed his battles with Virat Kohli and revealed he sent the Indian superstar a text message after he retired from the longest format of the game. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jofra-archer-suffers-injury-blow-weeks-ahead-of-india-test-series-2728235-2025-05-21",
      "headline": "Jofra Archer suffers injury blow weeks ahead of India Test seriesEngland fast bowler Jofra Archer has suffered an injury blow ahead of the all-important Test series against India as he's been ruled out of the ODI series against West Indies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-tour-of-england-virat-kohli-rohit-sharma-retirement-ben-stokes-2728203-2025-05-21",
      "headline": "Can't take India lightly despite Virat Kohli, Rohit Sharma retirements: Ben StokesBen Stokes has said that India cannot be taken lightly despite the retirements of Virat Kohli and Rohit Sharma from Test cricket. The Indian team will have a young batting order for England this time in the absence of Kohli and Rohit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-dc-live-score-wankhede-stadium-mumbai-weather-updates-2728201-2025-05-21",
      "headline": "MI vs DC Live Updates: Will rain play spoilsport in Mumbai?IPL 2025, Mumbai Indians (MI) vs Delhi Capitals (DC) Live Updates: Heavy rain and thunderstorms are expected to disrupt the IPL encounter between the Mumbai Indians and the Delhi Capitals at Wankhede Stadium on Wednesday (May 21)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-will-have-a-tough-tour-of-england-after-seniors-retirements-vikram-rathour-2728181-2025-05-21",
      "headline": "India will have tough England tour after Rohit, Kohli's retirement:Vikram RathourFormer India batting coach Vikram Rathour has said that the team will have a tough tour of England following the retirements of Virat Kohli and Rohit Sharma. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-andy-murray-coach-geneva-open-2728149-2025-05-21",
      "headline": "Don't need to rush: Djokovic in no need of coach after Murray's exitNovak Djokovic said that he is in no rush to find a new coach after parting ways with Andy Murray. The 37-year-old Djokovic is currently taking part in the Geneva Open where he will face Marton Fucsovics in the Round of 16. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhinav-mukund-in-awe-of-vaibhav-suryavanshis-6-hitting-prowess-2728144-2025-05-21",
      "headline": "Mukund in awe of Suryavanshi's 6 hitting prowess: He hits 80-90m sixes at 14Former India cricketer turned commentator Abhinav Mukund praised Vaibhav Suryavanshi for his mind-boggling six hitting prowess at just 14. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-city-squad-pep-guardiola-remark-2728132-2025-05-21",
      "headline": "Reduce squad size or I'll quit: Pep Guardiola reveals stunning Manchester City claimPep Guardiola has claimed that he told Manchester City that he wants a reduced squad for next season, otherwise he will quit the club. City had to leave out a lot of first-team players for their win over Bournemouth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-tour-of-england-new-test-captain-squad-announcement-shubman-gill-rishabh-pant-2728075-2025-05-21",
      "headline": "India's new Test captain, England tour squad likely to be announced on May 24The new Indian Test team captain and the England tour squad are likely to be announced on May 24, sources have told India Today. India's tour of England will begin on June 20, with the first Test in Headingley. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/pv-sindhu-knocked-out-hs-prannoy-malaysia-masters-2728068-2025-05-21",
      "headline": "PV Sindhu crashes out of Malaysia Masters, HS Prannoy advancesPV Sindhu's poor run of form in 2025 continued after Vietnam's Nguyen Thuy Linh defeated her 21-11, 14-21, 21-15 in the first round of the Malaysia Masters 2025. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhinav-mukund-in-awe-of-vaibhav-suryavanshis-6-hitting-prowess-2728144-2025-05-21",
      "headline": "Mukund in awe of Suryavanshi's 6 hitting prowess: He hits 80-90m sixes at 14Former India cricketer turned commentator Abhinav Mukund praised Vaibhav Suryavanshi for his mind-boggling six hitting prowess at just 14. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-city-squad-pep-guardiola-remark-2728132-2025-05-21",
      "headline": "Reduce squad size or I'll quit: Pep Guardiola reveals stunning Manchester City claimPep Guardiola has claimed that he told Manchester City that he wants a reduced squad for next season, otherwise he will quit the club. City had to leave out a lot of first-team players for their win over Bournemouth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-tour-of-england-new-test-captain-squad-announcement-shubman-gill-rishabh-pant-2728075-2025-05-21",
      "headline": "India's new Test captain, England tour squad likely to be announced on May 24The new Indian Test team captain and the England tour squad are likely to be announced on May 24, sources have told India Today. India's tour of England will begin on June 20, with the first Test in Headingley. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/pv-sindhu-knocked-out-hs-prannoy-malaysia-masters-2728068-2025-05-21",
      "headline": "PV Sindhu crashes out of Malaysia Masters, HS Prannoy advancesPV Sindhu's poor run of form in 2025 continued after Vietnam's Nguyen Thuy Linh defeated her 21-11, 14-21, 21-15 in the first round of the Malaysia Masters 2025. \r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}