{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-nigeria-ties-key-to-shaping-a-stronger-global-south-2863702-2026-02-05",
      "headline": "India–Nigeria ties key to shaping a stronger global southBy working closely through diplomatic engagement, trade and cultural cooperation, Musawa believes that both nations can play a leading role in shaping a future where developing countries have a louder voice on the world stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/peace-partnerships-and-progress-top-agenda-for-caribbean-nations-2863669-2026-02-05",
      "headline": "Peace, partnerships and progress top agenda for Caribbean nationsSpeaking to India Today at the World Governments Summit, Wheatley and Mitchell highlighted the importance of peace, economic diversification and stronger global partnerships for Caribbean nations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-hovers-around-71000-hits-weakest-level-in-about-15-months-2863583-2026-02-05",
      "headline": "Bitcoin hovers around $71,000, hits weakest level in about 15 monthsBitcoin fell nearly 2% to around $71,000 on February 5, marking its weakest level in about 15 months. The world's largest cryptocurrency has now lost more than 42% from its October peak of $126,000 last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/world-govt-summit-2026-jose-ramos-horta-international-law-warning-2863587-2026-02-05",
      "headline": "Global conflicts expose decline of international law, says Timor-Leste president President of Timor-Leste José Ramos-Horta said the world is witnessing the steady breakdown of global systems that were created to protect peace, human rights, and fair international trade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-gulf-cooperation-council-agree-to-restart-talks-on-long-pending-free-trade-deal-2863520-2026-02-05",
      "headline": "India, Gulf Cooperation Council agree to restart talks on long-pending free trade dealThe move formally revives negotiations between India and the six-nation bloc after a long gap and signals a renewed push to deepen economic cooperation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-lower-down-eternal-it-metal-shares-down-ril-low-2863510-2026-02-05",
      "headline": "Sensex ends 504 points lower, Nifty below 25,700; Eternal down 2%The S&P BSE Sensex was down by 503.76 points to close at 83,313.93, while the NSE Nifty50 lost 133.20 points to end at 25,642.80. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/why-stock-market-falling-today-it-stocks-global-cues-profit-booking-sensex-down-500-points-nifty-red-2863499-2026-02-05",
      "headline": "Sensex down 500 points: Why is stock market falling today?At 2:30 PM, the S&P BSE Sensex was down 569.43 points at 83,248.26. The NSE Nifty50 also declined, falling 164.50 points to 25,611.50. Both benchmark indices were down by over half a percent, showing clear pressure across the market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ai-and-policy-are-redefining-digital-lifestyles-say-global-tech-leaders-2863480-2026-02-05",
      "headline": "AI and policy are redefining digital lifestyles, say global tech leadersAl Shamsi said telecom companies are no longer just service providers focused on speed and coverage. They are evolving into broader technology platforms that support consumer, enterprise and government services."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/a-system-upgrade-led-to-a-criminal-tax-notice-how-budget-2026-changes-that-2863440-2026-02-05",
      "headline": "A system upgrade led to a criminal tax notice. How Budget 2026 changes thatA routine system upgrade or staff reshuffle should not land a business in criminal trouble. Yet, under earlier tax rules, even genuine operational delays could trigger prosecution. Budget 2026 aims to fix this by easing penalties for procedural lapses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/regulator-cci-orders-probe-into-indigo-after-mass-flight-cancellations-interglobe-aviation-shares-down-2863443-2026-02-05",
      "headline": "Competition watchdog orders probe into IndiGo after mass flight cancellationsIn a 16-page order, the Competition Commission of India (CCI) said that IndiGo, which holds a dominant position in the domestic aviation market, may have abused its strength by cancelling a large number of flights."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/silver-etfs-sink-up-to-15-gold-etfs-remain-relatively-steady-2863421-2026-02-05",
      "headline": "Silver ETFs sink up to 15%, gold ETFs remain relatively steadySilver ETFs witnessed aggressive one-day selling, with losses ranging from over 10% to nearly 15% during morning trade. The fall was much steeper than what was seen in gold ETFs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/eu-india-fta-alcohol-industry-impact-domestic-liquor-makers-premium-spirits-2863379-2026-02-05",
      "headline": "A slow reset, not a shock: What the EU-India FTA means for liquor companiesThe EU-India FTA is not an immediate disruption to India's domestic alcohol industry but a calibrated strategic shift that will gradually reshape competition, pushing domestic producers to evolve through premiumisation, enforcement-backed regulation, and long-term adaptability rather than relying on tariff protection."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-400-points-it-stocks-down-today-investors-panic-or-not-ai-impact-dalal-street-2863368-2026-02-05",
      "headline": "Sensex falls 400 points: Are IT stocks down today, do investors need to panic?At around 10 am, the S&P BSE Sensex was down 448.57 points at 83,369.12. The NSE Nifty50 also slipped, falling 144.95 points to 25,631.05. The fall was close to half a percent, showing a clear pause after the recent rally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-it-stocks-metal-shares-tcs-infosys-indigo-2863348-2026-02-05",
      "headline": "Sensex, Nifty open lower amid IT stock worries; metal shares major laggardsThe S&P BSE Sensex was down by 225.69 points to 83,592.00, while the NSE Nifty50 lost 87.65 points to 25,688.35 as of 9:23 am. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-today-will-it-shares-fall-again-stock-market-opening-trading-setup-nse-bse-2863339-2026-02-05",
      "headline": "Sensex, Nifty today: Will IT shares fall again on stock markets?Gift Nifty futures were trading at 25,820 points at around 7:54 am. This suggests that the Nifty 50 may open above Wednesday's closing level of 25,776."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/we-want-to-double-our-stores-in-india-in-next-2-3-years-hugo-boss-ceo-2863263-2026-02-05",
      "headline": "We want to double our stores in India in next 2-3 years: Hugo Boss CEOIn an exclusive conversation with India Today, Hugo Boss CEO Daniel Grieder discusses the company's strategic focus on the Indian market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/arvind-panagariya-on-why-indias-trade-deals-with-us-eu-could-be-bigger-moment-than-1991-2863230-2026-02-04",
      "headline": "Arvind Panagariya on why India's trade deals with US, EU could be bigger moment than 1991In an exclusive interview with India Today, Dr. Arvind Panagariya, Chairman of the 16th Finance Commission and former Vice-Chairman of NITI Aayog, shares his thoughts on the landmark India-US trade deal and more. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-policies-to-ai-how-businesses-and-governments-can-deliver-at-scale-2863196-2026-02-04",
      "headline": "From policies to AI: How businesses and governments can deliver at scaleMohit Joshi and Kaan Terzioglu discussed the importance of long-term thinking, ethical practices, and digital solutions in building credibility with customers, governments, and societies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musk-becomes-worlds-first-person-with-800-billion-after-spacex-xai-deal-2863046-2026-02-04",
      "headline": "Elon Musk becomes world's first person with $800 billion after SpaceX-xAI dealMusk is now $578 billion richer than Google co-founder Larry Page, the world's second-wealthiest person, who is estimated to be worth $281 billion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-jumps-nearly-4-silver-up-6-is-the-rally-set-to-continue-2863006-2026-02-04",
      "headline": "Gold jumps nearly 4%, silver up 6%: Is the rally set to continue?At the time of writing, gold was priced at Rs 1,58,858, up 3.28% or Rs 5,049. Silver showed an even stronger recovery, trading at Rs 2,83,395, higher by 5.74% or Rs 15,380."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prabhas-raja-saab-extended-cut-jiohotstar-missing-scenes-fan-looks-2863515-2026-02-06",
      "headline": "Prabhas' The Raja Saab gets extended OTT cut following mixed reviews Streaming platform JioHotstar has announced that The Raja Saab will feature an extended cut in its OTT release, following calls from viewers to include scenes missing from the theatrical version."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/guy-ritchies-young-sherlock-to-premiere-globally-on-prime-video-in-march-details-2863848-2026-02-05",
      "headline": "Guy Ritchie's Young Sherlock to premiere globally on Prime Video in March. Details Prime Video will launch all episodes of the new series Young Sherlock, directed by Guy Ritchie and starring Hero Fiennes Tiffin, in over 240 countries and territories in March. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ghooskhor-pandat-title-row-film-body-sends-notice-to-netflix-neeraj-pandey-2863827-2026-02-05",
      "headline": "Ghooskhor Pandat title row: Film body sends notice to Netflix, Neeraj Pandey A dispute has emerged surrounding the Netflix release of Ghooskhor Pandat starring Manoj Bajpayee, with a film body objecting to the unauthorised use of the title and legal notices claiming it offends community sentiments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aishwarya-rai-loving-birthday-wish-for-abhishek-bachchan-50th-birthday-babyyy-papa-stay-golden-2863799-2026-02-05",
      "headline": "Babyyy-Papa, stay golden: Aishwarya's loving wish for Abhishek's 50th birthday Aishwarya Rai posted a deeply personal and mushy birthday wish for Abhishek Bachchan on Thursday. The actor turned 50 on February 5. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/exclusive-shanaya-kapoor-opens-up-on-mixed-reception-to-her-debut-film-aankhon-ki-gustaakhiyan-2863788-2026-02-05",
      "headline": "Shanaya Kapoor opens up on mixed reception to her debut film: You can't let hope die Shanaya Kapoor said her debut film Aankhon Ki Gustaakhiyan was a deeply personal milestone, adding that she chose to savour her first big-screen moment rather than dwell on varied reviews. Staying hopeful and driven, she is now looking ahead to her next film, Tu Yaa Main."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/shah-rukh-khan-may-play-double-role-in-farah-khans-main-hoon-na-sequel-report-2863754-2026-02-05",
      "headline": "Shah Rukh Khan may play double role in Farah Khan's Main Hoon Na sequel: Report Shah Rukh Khan and Farah Khan are reportedly considering a reunion for Main Hoon Na 2, with sources indicating a double role for Khan and the return of the original cast. The decision is expected after the completion of Khan's film King."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/lucky-ali-backs-arijit-singh-on-quitting-playback-make-your-own-road-2863703-2026-02-05",
      "headline": "Lucky Ali backs Arijit Singh on quitting playback: Make your own road Lucky Ali has supported Arijit Singh's decision to quit playback singing, and said that \"it's not a loss.\" Ali suggested that something must have snapped for Singh to take this stand, emphasising the importance of expressing oneself away from the music industry's existing constraints."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/did-anurag-kashyaps-name-surface-in-epstein-files-director-responds-2863739-2026-02-05",
      "headline": "Did Anurag Kashyap's name surface in Epstein files? Director responds Filmmaker Anurag Kashyap has responded to claims about his alleged mention in the Epstein files, stating he has never been to Beijing and dismissing the credibility of the documents."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/assi-actor-kani-kusruti-once-quit-acting-over-harassment-found-her-way-back-2863715-2026-02-05",
      "headline": "Assi actor Kani Kusruti once quit acting over harassment, found her way back Award-winning actor Kani Kusruti, who plays a rape survivor in the upcoming film Assi, had once quit acting after facing harassment. Assi, also starring Taapsee Pannu, is scheduled for a February 2026 release. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/netflix-ghooskhor-pandat-controversy-legal-notice-pandit-community-2863629-2026-02-05",
      "headline": "Explained: Why Manoj Bajpayee's Ghooskhor Pandat has landed in controversy Netflix's upcoming thriller Ghooskhor Pandat has landed in controversy over its title. A legal notice alleges the film defames the Pandit community, sparking a debate on creative freedom and cultural respect."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kangana-ranaut-shares-warm-moments-with-hema-malini-during-winter-session-in-parliament-2863677-2026-02-05",
      "headline": "Sansad mein sukoon: Kangana Ranaut shares Parliament selfies with Hema Malini Kangana Ranaut posted rare moments with veteran actor Hema Malini on social media as they spent time together in Parliament during the ongoing winter session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/at-animals-japan-premiere-ranbir-kapoor-says-he-was-scared-to-accept-vangas-film-2863675-2026-02-05",
      "headline": "At Animal's Japan premiere, Ranbir Kapoor says he was scared to accept Vanga's film Ranbir Kapoor and Sandeep Reddy Vanga spoke ahead of Animal's Japan premiere. The actor recalled his initial fear of taking on Ranvijay Singh, as he teased Animal Park, the sequel to the 2023 blockbuster."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/aap-rocky-has-the-best-response-to-student-asking-if-hes-married-to-rihanna-2863626-2026-02-05",
      "headline": "A$AP Rocky has the best response to student asking if he's married to Rihanna A$AP Rocky addressed a young student's question about his relationship with Rihanna while sharing insights into their musical family life and reflecting on his chart-topping album, highlighting strong family support."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rhea-chakraborty-on-comeback-with-family-business-didnt-expect-to-act-ever-again-2863507-2026-02-05",
      "headline": "Rhea Chakraborty on comeback with Family Business: Didn't expect to act ever again Actor Rhea Chakraborty opened up about her comeback with the new series Family Business. She reflected on her experience of returning to acting after a seven-year hiatus.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bipasha-basus-daughter-devi-melts-hearts-with-bedtime-prayer-watch-2863585-2026-02-05",
      "headline": "Bipasha Basu's daughter Devi melts hearts with bedtime prayer. Watch Bipasha Basu has posted videos on her social media, offering fans a look at her daughter Devi's celebrations and bedtime routine, including a recent clip of Devi saying a short prayer before sleeping."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bhabiji-ghar-par-hain-fun-on-the-run-a-love-letter-to-fans-producer-vihaan-kohli-2863551-2026-02-05",
      "headline": "Bhabiji Ghar Par Hain! Fun on the Run, a love letter to fans: Producer Vihaan Kohli Producer Vihaan Kohli describes the upcoming film Bhabiji Ghar Par Hain: Fun on the Run as a heartfelt \"love letter\" to the show's loyal fans. In an interview with India Today, he discusses the legacy IP's transition to the big screen, navigating family-friendly comedy, and expanding the production's horizon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/blackpink-jisoo-and-seo-in-guk-boyfriend-on-demand-release-date-out-2863546-2026-02-05",
      "headline": "BLACKPINK'S Jisoo and Seo In-guk's Boyfriend on Demand release date out Netflix announced the premiere date for Boyfriend on Demand, starring Jisoo of BLACKPINK and Seo In-guk. The series explores modern romance through a virtual dating subscription."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/desi-bling-netflixs-dubai-bling-spin-off-draws-mixed-reactions-online-2863533-2026-02-05",
      "headline": "Desi Bling: Netflix's Dubai Bling spin-off draws mixed reactions online Netflix is launching Desi Bling, a luxury reality show showcasing the lavish lives of wealthy Indians in Dubai, but it has sparked mixed reactions online. While the show promises glamour and drama, many viewers have criticised its authenticity and casting choices, leading to a lively debate on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/richa-chadha-reacts-sharply-to-indian-origin-author-deepak-chopras-epstein-files-link-2863524-2026-02-05",
      "headline": "Richa Chadha reacts sharply to Indian-origin author Deepak Chopra's Epstein files link Richa Chadha commented on Deepak Chopra's apology after his name emerged in the new Epstein Files. The actor also referred to the other Deepak, who is going viral for confronting a mob, protecting a Muslim shopkeeper's store."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/can-india-really-stop-buying-oil-from-russia-us-trade-deal-donald-trump-narendra-modi-venezuelan-crude-america-brent-prices-2863472-2026-02-05",
      "headline": "Can India really stop buying oil from Russia?President Donald Trump claimed that India had vowed to stop buying oil from Russia. In recent years, Russia emerged as one of the key sources of crude for India. Here we analyse if it is feasible for India to end oil imports from Russia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/how-can-nation-tolerate-traitor-remark-against-sikhs-pm-tears-into-rahul-gandhi-over-ravneet-bittu-remark-2863681-2026-02-05",
      "headline": "Congress loathes Sikhs: PM tears into Rahul Gandhi for calling Bittu a traitorPrime Minister Narendra Modi hit out at Rahul Gandhi saying that the Congress leader's 'traitor' remark against Union Minister Ravneet Singh Bittu reflected arrogance at its peak and hatred towards Sikhs. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/inside-epstein-secret-medical-files-low-testosterone-low-libido-penis-enlarger-pills-glbs-2863860-2026-02-06",
      "headline": "Low testosterone, low libido, penis enlarger pills: Inside Epstein's medical filesNew Justice Department files reveal Jeffrey Epstein had chronically low testosterone, libido complaints, repeated STD infections and sought medical advice for years, according to emails, lab results and doctor correspondence."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/uk-news/story/starmer-apologises-to-epstein-victims-as-mandelson-scandal-rocks-british-establishment-glbs-2863857-2026-02-06",
      "headline": "I am sorry: UK PM apologises to Epstein victims amid Mandelson scandal falloutThe newly released records from a US Justice Department investigation into the crimes of Jeffrey Epstein show that Mandelson passed on market-sensitive information of clear financial interest to Epstein in the wake of the 2008 financial crisis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jewar-airport-when-farmers-became-crorepatis-overnight-then-lost-it-all-on-luxuries-ground-report-exclusive-2863473-2026-02-05",
      "headline": "Jewar airport: When farmers became crorepatis overnight, then lost it all on luxuriesFor generations, land was the farmers' only steady asset, producing food, income and security. Compensation replaced that asset with a lump sum, but this money came without financial planning support, guidance or long-term safeguards."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/celina-jaitley-seeks-pm-modi-help-brother-vikrant-jaitley-detention-uae-legal-aid-2863760-2026-02-05",
      "headline": "Modi ji, bring soldier back: Celina Jaitley in tears over brother's UAE detentionActor Celina Jaitley has sought Prime Minister Narendra Modi's intervention for the release of her brother, former Special Forces officer Major Vikrant Jaitley, detained in the UAE since September 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2026-final-rcb-win-2nd-wpl-title-highest-run-chase-beat-delhi-capitals-2863835-2026-02-05",
      "headline": "RCB script historic chase to clinch 2nd title as DC stumble again in finalRoyal Challengers Bengaluru (RCB) scripted history by chasing down the highest total in WPL to clinch their second title. Smriti Mandhana led from the front with her innings of 87 (41) as RCB chased down 204 in 19.4 overs to beat Delhi Capitals by six wickets in the final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/saudi-arabia-pours-billions-tighten-grip-yemen-counter-houthi-rebels-after-uae-setback-glbs-2863867-2026-02-06",
      "headline": "Saudi Arabia pours billions to tighten grip on Yemen after UAE setbackThe wealthy Gulf kingdom is trying to bring together fractious armed groups and tribes while also propping up a collapsed state through major cash injections, with an unresolved conflict with Houthi rebels in north Yemen held at bay by a fragile truce - just as Riyadh faces a budget crunch at home."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/sri-ganganagar-murder-woman-kills-husband-lover-help-pass-of-murder-as-road-accident-arrested-2863787-2026-02-05",
      "headline": "3 months after wedding, woman plots husband's murder, stages fake road accidentThe incident first came to light on January 31, when Wazirchand, a local resident in Rawla Mandi area, reported that his nephew Ashish had died after being hit by an unidentified vehicle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-china-talks-donald-trump-did-to-xi-jinping-what-he-did-to-narendra-modi-india-trade-deal-politics-2863423-2026-02-05",
      "headline": "Trump now does to Xi what he did to ModiA familiar pattern is emerging in US President Donald Trump's claims on social media after calls with leaders. Trump posted preemptively on his talks with Chinese President Xi Jinping like he did after a call with Indian PM Narendra Modi. The posts disregarded protocol and facts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-news-frisco-city-council-in-texas-showdown-indian-takeover-h1b-visa-fraud-2863678-2026-02-05",
      "headline": "Indian takeover of US city: Right-wing turns Frisco council meet into H-1B showdownA city council meeting in Frisco, Texas, turned into a verbal clash between right-wing critics and Indian-origin citizens. While the right-wing participants alleged that Indians were committing visa fraud by acquiring H-1B visas and displacing American citizens, the Indian attendees argued they were being generalised as a community and their presence was a net benefit for the American city. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/sarthak-mahapatra-odisha-merchant-navy-cadet-missing-aboard-vessel-mid-sea-mauritius-search-2863822-2026-02-05",
      "headline": "Odisha merchant navy cadet missing mid-sea near Mauritius, search underwayCompany records indicate Sarthak was last seen entering his cabin on the morning of February 3. Around 8:30 am, the chief officer checked on him, but the cabin was empty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/visuals/time-tide-tamil-alliances-and-animosities-the-political-ping-pong-and-punching-bags-part-21-346-05-02-2026",
      "headline": "Time, Tide & Tamil Part 21 | Alliances & Animosities: The Political Ping-Pong & Punching BagsEVR's political path through the 1920s and 1930s resembled a high stake \"Dravidian Derby,\" a race where alliances flipped faster than idlis on an Erode tawa. This was no gentle trot; it was a thundering gallop through the corridors of power and the dusty lanes of protest."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-theft-assault-complaint-case-2863842-2026-02-05",
      "headline": "Bengaluru thief caught stealing beaten by locals. He files assault caseA man caught attempting theft in Bengaluru alleged he was assaulted by local residents and filed a police complaint. Police have registered a case under the Bharatiya Nyaya Sanhita and are investigating the sequence of events.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-gone-through-lot-marriage-shreyanka-patil-rcb-2nd-wpl-title-win-2863849-2026-02-05",
      "headline": "Smriti Mandhana has gone through a lot, this win is for her: Shreyanka PatilWPL 2026 final: Shreyanka Patil dedicated RCB's historic second WPL title victory to Smriti Mandhana for leading the side once again after the personal setbacks she faced before the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ghaziabad-three-minor-sisters-suicide-korean-culture-online-game-addiction-father-financial-issues-diary-suicide-note-2863643-2026-02-05",
      "headline": "Sisters' Korean awe, father's Rs 2-crore debt: Ghaziabad suicide probe deepensThe central piece of evidence in the probe into the suicide of three minor sisters in Ghaziabad becomes a nine-page pocket diary recovered by the police, which the sisters described as their 'true life story'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/this-stray-dog-regularly-tags-along-with-mumbai-police-at-marine-drive-2863693-2026-02-05",
      "headline": "This stray dog regularly tags along with Mumbai Police at Marine DriveA video of a street dog running with a police vehicle on Marine Drive, Mumbai, has highlighted the unique bond between the animal and the police officers patrolling the area."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-united-states-secret-trade-deal-before-election-unelected-yunus-regime-garment-textile-sector-2862850-2026-02-05",
      "headline": "Yunus's rush to ink secretive deal with US has Bangladesh exporters worriedThe interim setup of Muhammad Yunus is set to sign a tariff deal with the US. However, the non-disclosure agreement that keeps details shrouded in mystery has got Bangladeshi business leaders concerned. Then there is a bigger question. Is it legal for the unelected Yunus regime to ink a deal even as an elected government could come to office in weeks time?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/netflix-ghooskhor-pandat-controversy-legal-notice-pandit-community-2863629-2026-02-05",
      "headline": "Explained: Why Manoj Bajpayee's Ghooskhor Pandat has landed in controversyNetflix's upcoming thriller Ghooskhor Pandat has landed in controversy over its title. A legal notice alleges the film defames the Pandit community, sparking a debate on creative freedom and cultural respect."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/proposed-before-my-birth-inaugurated-by-me-pm-slams-congress-over-narmada-dam-2863748-2026-02-05",
      "headline": "Proposed before my birth, inaugurated by me: PM slams Congress over Narmada damHighlighting the history of the Narmada dam project, Modi said Sardar Vallabhbhai Patel had envisioned building a dam on the river even before he was born. After Patel's demise, former Prime Minister Jawaharlal Nehru laid the foundation stone, but the project remained incomplete for decades."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kangana-ranaut-shares-warm-moments-with-hema-malini-during-winter-session-in-parliament-2863677-2026-02-05",
      "headline": "Sansad mein sukoon: Kangana Ranaut shares Parliament selfies with Hema MaliniKangana Ranaut posted rare moments with veteran actor Hema Malini on social media as they spent time together in Parliament during the ongoing winter session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/10-labourers-killed-as-blast-rocks-coal-mine-in-meghalaya-rescue-operation-underway-2863545-2026-02-05",
      "headline": "18 labourers killed in coal mine blast in Meghalaya, PM announces ex-gratiaThe blast occurred inside a coal mine, leading to heavy casualties among labourers present at the site. Authorities suspect that most of the victims were workers from Assam."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/maharashtra/story/signal-app-used-to-coordinate-rohit-shetty-house-firing-in-mumbai-police-tell-court-2863851-2026-02-05",
      "headline": "Signal app used to coordinate Rohit Shetty house firing, police tell courtThe Mumbai Police informed the court that conversations related to the January 31 firing at filmmaker Rohit Shetty's house were conducted through the Signal app and later deleted, prompting efforts to retrieve the data as part of the ongoing investigation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ghaziabad-sisters-suicide-korean-culture-indian-identity-father-2863452-2026-02-05",
      "headline": "They hated being called Indian: Father's claim in Ghaziabad girls' suicide caseIn an interview with India Today, Chetan Kumar, the father of the three girls who jumped to death from their Ghaziabad flat, claimed they had begun rejecting their Indian identity and wanted to settle in Korea."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yuzvendra-chahal-social-media-relationship-rumours-fan-wars-2863770-2026-02-06",
      "headline": "Yuzi Chahal tired of endless social media rumours: I know who I really am Yuzvendra Chahal opens up on social media rumours, online trolling and fan wars, saying he ignores the noise and trusts his family and close friends."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-gone-through-lot-marriage-shreyanka-patil-rcb-2nd-wpl-title-win-2863849-2026-02-05",
      "headline": "Smriti Mandhana has gone through a lot, this win is for her: Shreyanka Patil WPL 2026 final: Shreyanka Patil dedicated RCB's historic second WPL title victory to Smriti Mandhana for leading the side once again after the personal setbacks she faced before the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2026-final-rcb-win-2nd-wpl-title-highest-run-chase-beat-delhi-capitals-2863835-2026-02-05",
      "headline": "RCB script historic chase to clinch 2nd title as DC stumble again in final Royal Challengers Bengaluru (RCB) scripted history by chasing down the highest total in WPL to clinch their second title. Smriti Mandhana led from the front with her innings of 87 (41) as RCB chased down 204 in 19.4 overs to beat Delhi Capitals by six wickets in the final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-sri-lanka-urges-pakistan-reconsider-india-boycott-heavy-losses-2863819-2026-02-05",
      "headline": "Sri Lanka urges Pakistan to reconsider India boycott, flags heavy losses: Report T20 World Cup 2026: Sri Lanka Cricket has reportedly urged the PCB to reconsider boycotting the India match, warning of heavy financial and tourism losses, with the marquee fixture at risk of being called off."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/yuzvendra-chahal-on-indias-t20-world-cup-chances-suryakumar-yadav-2863795-2026-02-05",
      "headline": "India can only lose T20 World Cup on it's own, no team can beat them: Yuzvendra Chahal India spinner Yuzvendra Chahal has said that India are firm favourites to win the T20 World Cup 2026 and that only their own mistakes could lead to them losing in the tournament. India will begin their campaign against the USA on February 7 at the Wankhede Stadium in Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-on-how-gautam-gambhir-removed-personal-milestone-obsession-2863783-2026-02-05",
      "headline": "Gautam Gambhir has changed team's milestone-obsessed mindset: Suryakumar Yadav India captain Suryakumar Yadav praised head coach Gautam Gambhir for prioritising team goals over personal milestones. The India captain sakid that the shift has fuelled India's dominant run in T20 cricket and boosted team unity."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/t20-world-cup-captains-press-conference-suryakumar-yadav-2863761-2026-02-05",
      "headline": "India ready to play Pakistan in T20 World Cup, will travel to Colombo: Suryakumar T20 World Cup 2026: India captain Suryakumar Yadav said the Men in Blue will travel to Colombo for the February 15 match, despite Pakistan threatening a boycott. Suryakumar said the matter is beyond his control, adding that even the International Cricket Council finds it difficult to intervene when decisions are driven by the Pakistan government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/chetan-sharma-on-pakistan-t20-world-cup-boycott-reversal-bangladesh-elections-2863746-2026-02-05",
      "headline": "Pak will make a U-turn on India boycott stance after February 12: Chetan Sharma Former India pacer Chetan Sharma expects Pakistan to reverse their boycott of the India match after the Bangladesh elections. The Pakistan government have denied permission to their cricket team to play against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mustafizur-rahman-pakistan-super-league-lahore-qalandars-77-per-cent-less-ipl-contract-2863750-2026-02-05",
      "headline": "Mustafizur heads to PSL after shock IPL exit, to earn 77 per cent less Mustafizur Rahman has signed with Lahore Qalandars for PSL 11 after his IPL release by KKR, agreeing to a deal worth about Rs 2 crore, nearly 77 per cent lower than his IPL contract."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/sunil-gavaskar-backs-virat-kohli-and-rohit-sharma-for-2027-odi-world-cup-2863689-2026-02-05",
      "headline": "Sunil Gavaskar backs Virat Kohli and Rohit Sharma for 2027 ODI World Cup Sunil Gavaskar did not think twice when he backed both Virat Kohli and Rohit Sharma to play the 2027 ODI World Cup. Speaking at India Today's Salaam Cricket 2026, Gavaskar backed the idea of having India's favourite duo for one last push for the ODI crown. \"Virat and Kohli will definitely play ODI World Cup 2027. They've been performing well. Even if the ODI are six months later, they will continue practising and stay in touch with the game. Their experience is of utmost importance to the team,\" he said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gavaskar-dance-promise-suryakumar-yadav-india-defend-t20-world-cup-crown-2863680-2026-02-05",
      "headline": "Dancing with joy: Gavaskar's promise to Suryakumar Yadav if India defend T20 crown Sunil Gavaskar has promised India captain Suryakumar Yadav a joyful dance if the team successfully defend their T20 World Cup crown, saying nothing moves him more than seeing India lift a trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-vs-dc-live-score-wpl-2026-final-royal-challengers-bengaluru-delhi-capitals-womens-match-2863668-2026-02-05",
      "headline": "WPL Final Highlights: Royal Challengers Bengaluru win 2nd title in dramatic fashionWPL 2026, Royal Challengers Bengaluru (RCB-W) vs Delhi Capitals (DC-W) Live Score: The Royal Challengers Bengaluru have done it again, leaving Delhi Capitals in the dust to win their second Women's Premier League title."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-captain-salman-agha-government-permission-india-t20-world-cup-2026-2863592-2026-02-05",
      "headline": "Will Pakistan play India in T20 World Cup semi final or final? Captain revealsPakistan captain Salman Agha has said that they will have to seek the government's permission to face India in the semi-final or final of the T20 World Cup 2026. Pakistan government has denied permission to its players to play against India in the group stage game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/supreme-court-lifts-bcci-ban-anurag-thakur-nine-years-2863590-2026-02-05",
      "headline": "Anurag Thakur gets relief as Supreme Court lifts nine-year BCCI banThe Supreme Court has lifted the nine-year ban on Anurag Thakur, allowing him to participate in BCCI affairs after noting the ban was not meant to be lifelong and citing his unconditional apology."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-pakistan-t20-world-cup-2026-uncertainty-players-mental-health-ishant-sharma-2863557-2026-02-05",
      "headline": "Uncertainty over India vs Pakistan match not good for players: Ishant SharmaFormer India bowler Ishant Sharma has expressed concern for players amid the uncertainty of the India-Pakistan T20 World Cup match. The ongoing boycott threat by Pakistan could impact players' preparations and tournament dynamics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/be-the-same-person-no-matter-what-happens-rishabh-pant-reveals-rahul-dravids-advice-2863559-2026-02-05",
      "headline": "Be the same person no matter what happens: Rishabh Pant reveals Rahul Dravid's advicePant, who flourished under Dravid across formats, said one piece of advice from the Indian legend has stayed with him.\r\n\r\n\"I think the key is not thinking about it too much and not dwelling on it. There's one really good line I learnt from Rahul (Dravid) bhai. He always told me one thing: 'Rishabh, no matter what happens, try to be the same person when you score a hundred and when you score a zero,'\" Pant said.\r\n\r\n\"I think, as an athlete, that's the hardest thing to do — to remain who you are. Emotions sometimes get the better of you, but that line always stays with me. So personally, I try that. Whether I score zero or a hundred, I want to be the same guy. Maybe when I get out, it hurts more. I don't enjoy scoring runs as much as I feel the pain of getting out,\" the wicketkeeper-batter concluded."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-suryakumar-yadav-on-ind-vs-pak-controversy-2863528-2026-02-05",
      "headline": "Suryakumar Yadav breaks silence on Pakistan boycott threat: We are ready to playT20 World Cup: India's T20I captain, Suryakumar Yadav, remained firm that their plans do not change considering Pakistan's boycott of their group-stage clash. He said that they would prepare for the game regardless of Pakistan's stance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-t20-world-cup-rishabh-pant-abhishek-sharma-rahul-dravid-2863509-2026-02-05",
      "headline": "Dravid's student, now Abhishek's fan: Rishabh Pant on batting mavericksRishabh Pant has revealed his admiration for two batting mavericks - Rahul Dravid and Abhishek Sharma. Speaking on India Today's Salaam Cricket, Pant revealed how one of Dravid's advises will stay with him lifelong."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/salaam-cricket-t20-world-cup-sunil-gavaskar-suresh-raina-india-pakistan-2863468-2026-02-05",
      "headline": "Salaam Cricket Highlights: India favourites, says Gavaskar. Wasan disagreesSalaam Cricket 2026, T20 World Cup Highlights: Legendary Sunil Gavaskar led a star-studded list of cricketers who spoke about Indian cricket and the upcoming T20 World Cup. Most of them said India are the firm favourites to defend the crown, but former bowler Atul Wasan backed New Zealand to win big. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-world-cup-2026-bangladesh-thanks-pakistan-asif-nazrul-shehbaz-sharif-politics-off-field-nexux-2863447-2026-02-05",
      "headline": "Thank you, Pakistan: Bangladesh reveals big cricket nexus against IndiaBangladesh's sports adviser Asif Nazrul thanked Pakistan for backing Dhaka's boycott of the T20 World Cup, after Islamabad decided to skip its match against India in Colombo. A day earlier, Pakistani PM Shehbaz Sharif publicly justified the move as standing \"completely\" with Bangladesh. This exposed how both governments made cricket a theatre of a political engagement against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indian-origin-captains-t20-world-cup-2026-2863098-2026-02-05",
      "headline": "Beyond Suryakumar Yadav. List of Indian-origin captains in T20 World CupT20 World Cup 2026: It is not just the Indian team that will have a captain from India in the T20 World Cup. The mega event on Indian and Sri Lankan soil is set to witness several Indian-origin players leading their respective associate teams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tilak-varma-angry-arshdeep-singh-ind-vs-sa-warm-up-2863369-2026-02-05",
      "headline": "Tilak Varma gets angry at Arshdeep Singh: Don't take videos without permissionT20 World Cup: India batter Tilak Varma got angry at Arshdeep Singh at the end of the team's warm-up game against South Africa. In the dressing room, Tilak told Arshdeep to not film him without permission."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ishan-kishan-sanju-samson-india-opener-spot-t20-world-cup-warm-up-2863268-2026-02-05",
      "headline": "Has Samson lost opener's battle to Kishan? Aakash Chopra gives his verdictT20 World Cup: Aakash Chopra said that Ishan Kishan cemented his place for the opener's slot with his 53-run knock against South Africa in the warm-up match on Wednesday in Navi Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-pak-nasser-hussain-sky-cricket-podcast-2863332-2026-02-05",
      "headline": "I quite like it: Hussain backs Bangladesh, Pakistan over World Cup boycottNasser Hussain has lambasted the ICC and the BCCI over the ongoing uncertainty in the cricketing world. Nasser says that he quite likes the fact that the board stood up for their players."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/delhi-capitals-vs-royal-challengers-bengaluru-wpl-2026-final-preview-2863228-2026-02-05",
      "headline": "Delhi look to break final curse, aim for 2024 revenge in battle of best friendsWPL 2026 Final, RCB vs DC Preview: In the battle of best friends, Jemimah Rodrigues' Delhi Capitals will be up against Smriti Mandhana's Royal Challengers Bengaluru in the summit clash on Thursday in Vadodara. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/time-to-stand-up-to-bcci-400-million-now-on-one-side-ex-pak-cricket-chief-2863306-2026-02-05",
      "headline": "Time to stand up to BCCI, 400 million now on one side: Ex-Pak cricket chiefT20 World Cup 2026: Speaking to India Today, former Pakistan Cricket Board chief Najam Sethi said Pakistan is now standing up to BCCI by announcing the boycott of their game against India. Sethi said the ICC is run by people in the BCCI and Pakistan are willing to let go off short-term financial gains to end the bullying of the global cricket body."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-t20-world-cup-2026-india-role-impact-bench-2863285-2026-02-05",
      "headline": "Sanju Samson's fate sealed? Job's not finished with T20 World Cup 2026 in sightWith India's T20 plans taking shape, Sanju Samson faces a reduced role ahead of the 2026 World Cup. Staying ready, and being used wisely, may decide his future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/isl-broadcast-deal-dip-in-value-below-kerala-super-league-ipl-fancode-2862862-2026-02-05",
      "headline": "Rs 9 crore for ISL, Rs 100 crore for Kerala: How low has Indian football sunkThe ISL has its broadcast deal, but the numbers tell a harsher story. Now, valued below regional leagues and nowhere near cricket, Indian football's top tier has fallen from grace."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-2026-pakistan-prime-minister-shahbaz-sharif-no-change-india-boycott-stance-2863261-2026-02-04",
      "headline": "T20 World Cup: Pakistan PM confirms no change in India boycott stancePakistan Prime Minister Shahbaz Sharif confirmed that Pakistan will not play against India in the T20 World Cup 2026 group stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-recharge-goa-trip-wpl-2026-final-delhi-capitals-2863250-2026-02-04",
      "headline": "Could Goa break unsettle RCB? Smriti Mandhana opens up ahead of WPL finalWPL 2026: Smriti Mandhana said that Royal Challengers Bengaluru (RCB) are fresh for the final against Delhi Capitals (DC) after they spent their one-week break enjoying in Goa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-2026-india-vs-south-africa-warm-ups-ishan-kishan-sanju-samson-debate-tilak-varma-return-india-defend-title-2863245-2026-02-04",
      "headline": "IND vs SA, warm-up: Ishan edges Samson, Tilak back as India ready to defend crownIND vs SA, T20 World Cup Warm-ups: India's only warm-up turned into a statement as Ishan Kishan sealed the opener role, Tilak Varma returned in style, and the bowlers controlled the chase to down South Africa by 30 runs."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}