{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/millennials-vs-gen-z-how-their-crypto-portfolios-and-risk-appetites-differ-2820655-2025-11-16",
      "headline": "Millennials vs Gen Z: How their crypto portfolios and risk appetites differMillennials and Gen Z are both active in the world of crypto, yet they approach it from very different angles. Their portfolios, strategies and risk appetite reveal how differently each generation views money, technology and long-term investing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-to-execute-will-inheritance-property-transfer-documents-time-needed-executor-probate-importance-2820294-2025-11-15",
      "headline": "How to execute a will properly, so your family avoids delays and disputesThe truth is, writing a will is only half the job. The real work begins afterwards. One missing document, one unclear clause or one forgotten instruction is enough to turn a simple inheritance into months of delay and dispute."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/expert-explains-why-your-12-equity-returns-arent-real-2819899-2025-11-14",
      "headline": "Expert explains why your 12% equity returns aren't realMost people believe a 12% equity return is strong growth, but according to an expert, the actual gain after inflation and taxes is much smaller. Here's why your money may not be growing as much as you think."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/fresh-ed-summons-to-anil-ambani-in-fraud-case-after-he-skips-second-date-2819849-2025-11-14",
      "headline": "Fresh ED summons to Anil Ambani in fraud case after he skips second dateIn a continued push to seek clarity in the ongoing investigation, the ED has served another notice to Anil Ambani."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-end-green-bihar-election-nda-win-it-stocks-down-2819839-2025-11-14",
      "headline": "Sensex, Nifty bounce back after volatile day as markets cheer Bihar winThe S&P BSE Sensex gained 84.11 points to close at 84,562.78, while the NSE Nifty50 added 30.90 points to end at 25,910.05.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/corporate-security-india-ceos-face-highest-risk-violence-misinformation-insider-threats-world-security-report-2819791-2025-11-14",
      "headline": "Why safety worries are growing for India's top executivesThe report shows that 71% of corporate security chiefs in India believe the risk of violence against chief executives has increased in the last two years, marking the highest level recorded globally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/bnpl-india-invisible-debt-trap-salary-repayments-2819772-2025-11-14",
      "headline": "Using BNPL regularly? Your salary may be hiding an invisible debt trapHaving easy access to credit at the tap of your finger via BNPL feels convenient, but could those small pay-later purchases be quietly building into a debt trap that only shows up on payday?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/from-ssy-to-fds-3-smart-investment-schemes-every-parent-should-know-2819741-2025-11-14",
      "headline": "From SSY to FDs: 3 smart investment schemes every parent should knowPlanning for a child's future requires wise financial choices. From government-backed savings to bank deposits, these three investments offer stability and dependable returns for parents."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/verizon-to-slash-15-percent-of-workforce-whats-driving-the-massive-cuts-2819712-2025-11-14",
      "headline": "Verizon to slash 15% of workforce. What's driving the massive cuts?The telecom giant has been under pressure as rivals AT&T and T-Mobile continue to offer cheaper plans and aggressive promotions, especially during the launch of new iPhone models. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/bars-coins-or-digital-how-indians-are-buying-gold-differently-after-prices-crossed-rs-1-lakh-2819695-2025-11-14",
      "headline": "Bars, coins or digital: How Indians are buying gold differently after prices crossed Rs 1 lakhFor the first time, gold breached the psychological barrier of Rs 1 lakh, a milestone that once seemed out of reach. Until that point, conversations around gold were filled with speculation: \"Will gold really touch one lakh?\" But once that threshold was crossed, the sentiment changed entirely."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-silver-dip-slightly-today-is-the-recent-rally-losing-steam-2819674-2025-11-14",
      "headline": "Gold, silver dip slightly today. Is the recent rally losing steam?At the time of writing, at 12.00 pm, gold on the Multi Commodity Exchange (MCX) was slightly down by 0.30%, trading at Rs 1,26,366 per 10 grams. Silver followed a similar trend, falling 0.69% to Rs 1,61,350 per kg."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/pine-labs-shares-extend-rally-after-strong-ipo-debut-details-here-2819678-2025-11-14",
      "headline": "Pine Labs shares extend rally after strong IPO debut. Details hereThe stock listed at Rs 242 on the Bombay Stock Exchange, which was a 9.5 percent premium to its issue price. It later surged to Rs 283.70, a gain of 28.5 percent from the issue level. Around 12.33 pm, the shares were trading at Rs 257.35, valuing the company at Rs 29,556.63 crore."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/michael-burry-movie-big-short-predicted-us-housing-market-bubble-closes-hedge-fund-reason-2819665-2025-11-14",
      "headline": "Investor who foresaw 2008 US home crisis closes hedge fund. Here's whyThe investor has spent the past year warning about what he sees as bubbles in the market. He has sharply criticised big technology stocks and the boom in artificial intelligence (AI)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/infosys-buyback-record-date-retail-investor-guide-18000-crore-2819624-2025-11-14",
      "headline": "Infosys share buyback record date today: What investors should knowInfosys is conducting the buyback through the tender offer route, where it will purchase shares at Rs 1,800 per share. This is more than 18% above the recent market price of around Rs 1,515."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/do-taxpayers-always-get-interest-on-delayed-income-tax-refunds-find-out-2819606-2025-11-14",
      "headline": "Do taxpayers always get interest on delayed income tax refunds? Find outIf your income tax refund is taking longer than expected, you may wonder whether the tax department must pay you interest for the delay. The law does provide for interest, but not in every situation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/capillary-technologies-ipo-day-1-check-latest-gmp-and-subscription-status-2819607-2025-11-14",
      "headline": "Capillary Technologies IPO Day 1: Check latest GMP and subscription statusCapillary operates in the AI-led SaaS and customer loyalty solutions space, serving more than 410 brands across 47 countries. The company turned profitable in FY25 after two years of losses, reporting Rs 14.15 crore in profit. Revenue increased to Rs 598 crore in FY25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/pine-labs-share-price-today-ipo-listing-premium-hold-or-book-profit-2819597-2025-11-14",
      "headline": "Pine Labs shares list at 10% premium: Should you hold or book profit now?Pine Labs' better-than-expected debut and strong institutional support boosted early sentiment, but analysts say elevated valuations and intense fintech competition mean investors should balance listing-day gains with disciplined, long-term positioning."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/can-a-daughter-name-be-removed-from-pension-records-government-explains-2819582-2025-11-14",
      "headline": "Can a daughter's name be removed from pension records? Government explainsSeveral departments had asked whether a daughter's name should be removed from the family list after an employee retires. To settle the confusion, the DoP&PW issued an Office Memorandum clearly stating that her name must stay in the records."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/adani-group-to-invest-over-rs-1-lakh-crore-in-andhra-pradesh-2819565-2025-11-14",
      "headline": "Adani Group to invest over Rs 1 lakh crore in Andhra Pradesh: ReportSpeaking at a state event on Friday, Karan Adani said the investments are aimed at expanding the conglomerate's infrastructure footprint in the southern state and strengthening its long-term presence in high-growth sectors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sagility-share-price-jumps-over-6-percent-key-reasons-block-deal-2819557-2025-11-14",
      "headline": "Sagility share price jumps over 6% today. What's driving the rally?Sagility's shares jumped after a large block deal hit the tape, with buyers overpowering supply. The stock's sharp rise suggests traders are betting the stake sale won't derail its near-term momentum."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/de-de-pyaar-de-2-box-office-collection-day-2-ajay-devgn-film-witnesses-close-to-50-jump-2820645-2025-11-16",
      "headline": "De De Pyaar De 2 box office Day 2: Ajay Devgn's film witnesses close to 50% jump Ajay Devgn and Rakul Preet Singh's 'De De Pyaar De 2' witnessed a significant rise in collections on Saturday. The film, a romantic comedy directed by Anshul Sharma, also stars R Madhavan and Meezaan Jafri, amongst others."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-weekend-ka-vaar-written-update-rohit-shetty-host-amaal-mallik-gaurav-khanna-clash-2820620-2025-11-16",
      "headline": "Bigg Boss 19 Weekend Ka Vaar: Rohit Shetty steps in as host, Amaal-Gaurav clash Director Rohit Shetty took over hosting duties in actor Salman Khan's absence during 'Bigg Boss 19' Weekend Ka Vaar. He addressed the reaction of contestants during the twist in captaincy tasks and called out contestants over their controversial remarks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/sankranthi-clutter-is-telugu-cinemas-biggest-festival-losing-its-charm-2820129-2025-11-16",
      "headline": "Sankranthi clutter: Is Telugu cinema's biggest festival losing its charm? As multiple big, mid and small films line up for the 2026 Sankranthi window, recent box office patterns raise a question: Is the festival turning from a celebrated showcase into an overcrowded release slot?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sholay-returns-4k-re-release-original-ending-final-cut-amitabh-bachchan-dharmendra-jaya-bachchan-hema-malini-2820607-2025-11-16",
      "headline": "Sholay returns in 4K: Iconic film to re-release with its original ending The 4K restored version of 'Sholay' will be released in 1,500 screens across India to mark the film's 50th anniversary. The final cut version will feature the movie's original climax. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/exclusive-lee-pace-on-edgar-wright-and-the-duality-of-the-running-man-2820526-2025-11-16",
      "headline": "Exclusive: Lee Pace on Edgar Wright and the duality of The Running Man Lee Pace praised director Edgar Wright for crafting the \"unbothered\" and masked McCone, a hunter in the dystopian film The Running Man. Pace highlighted the film's dual narrative, where his character is the network's protagonist despite doing \"grotesque\" violence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hawar-you-i-am-hava-hawaie-witty-salman-khan-brings-back-sridevi-memories-2820472-2025-11-15",
      "headline": "Hawar you? I am hava hawaie: Witty Salman Khan brings back Sridevi memories During the Da-Banng Tour in Doha, Salman Khan paid tribute to Sridevi's iconic song, 'Hawa Hawai,' from the film 'Mr India' (1987). The actor shared an image of himself being lifted high in the air by background dancers during the performance.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajamouli-varanasi-event-filmmaker-slams-unauthorised-drone-leak-incident-2820494-2025-11-15",
      "headline": "Rajamouli's Varanasi event: Filmmaker slams unauthorised drone leak incident SS Rajamouli expressed extreme frustration over the Varanasi teaser leak, which he blamed on a drone capturing test footage. The teaser revealed Mahesh Babu's character as 'Rudhra' fiercely yielding a trident."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajamouli-film-titled-varanasi-mahesh-babu-invokes-lord-shiva-yields-trident-2820365-2025-11-15",
      "headline": "Rajamouli's film titled Varanasi: Mahesh Babu plays Rudhra, yields trident Director SS Rajamouli unveiled the first glimpse of his film 'Varanasi' at the 'GlobeTrotter' event in Ramoji City, Hyderabad. Mahesh Babu's fierce, trident-yielding appearance was revealed in the first teaser from the movie.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prithviraj-sukumaran-globetrotter-event-varanasi-ss-rajamouli-hyderabad-2820481-2025-11-15",
      "headline": "Bigger, bolder, more audacious: Prithviraj Sukumaran on Rajamouli's Varanasi vision Actor Prithviraj Sukumaran shared insights on his career and collaboration with director SS Rajamouli at the 'GlobeTrotter' event at Ramoji Rao Film City, Hyderabad, highlighting the significance of the project and the collective pride of the Telugu film community."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ss-rajamouli-varanasi-summer-2027-release-new-music-2820471-2025-11-15",
      "headline": "Rajamouli-Mahesh Babu's Varanasi: MM Keeravani reveals release window. Read here MM Keeravani's speech at the event included a key update on 'Varanasi'. The ace music composer revealed the highly anticipated film's release window.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahesh-babu-rajamoulis-varanasi-time-trotter-text-ignites-wild-fan-theories-2820460-2025-11-15",
      "headline": "Mahesh Babu-Rajamouli's Varanasi: Time Trotter text ignites wild fan theories The 'GlobeTrotter' frenzy peaked even before the teaser launch, with a leaked glimpse featuring the phrase \"Time Trotter\" sending fans into speculation over a possible time-travel storyline in SS Rajamouli and Mahesh Babu's upcoming epic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-remembers-late-family-friend-kamini-kaushal-in-emotional-blog-2820441-2025-11-15",
      "headline": "Amitabh Bachchan remembers late family-friend Kamini Kaushal in emotional blog Veteran Hindi film actror Kamini Kaushal died at the age of 98. Amitabh Bachchan mourned her death, recalling their deep pre-partition family ties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahesh-babu-fan-travels-6817-km-perth-hyderabad-globetrotter-event-2820430-2025-11-15",
      "headline": "Mahesh Babu fan travels from Perth to Hyderabad for GlobeTrotter event A dedicated Mahesh Babu fan travelled over 6,000 kilometres from Australia to Hyderabad to attend the GlobeTrotter event.  He documented his journey and even won SS Rajamouli's son Karthikeya's attention."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/lilly-singh-is-the-next-global-star-heading-to-india-after-ed-sheeran-travis-scott-2820408-2025-11-15",
      "headline": "Lilly Singh is the next global star heading to India after Ed Sheeran, Travis Scott After a high-profile lineup of artists like Enrique Iglesias, Travis Scott, and Ed Sheeran visited India, the momentum is sustained. The next major figure arriving is Lilly Singh, known for her work as an award-winning actress, writer, and advocate.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-thalaivar-173-kamal-haasan-shares-update-on-project-read-here-2820381-2025-11-15",
      "headline": "Rajinikanth's Thalaivar 173: Kamal Haasan shares update on project. Read here After Sundar C exited the highly anticipated 'Thalaivar 173' due to unforeseen and unavoidable circumstances, producer Kamal Haasan assured that he remains dedicated to finding the right script. He said that the project with Rajinikanth will continue as planned."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/the-running-man-director-edgar-wright-says-he-enjoyed-rrr-loves-ray-films-2820400-2025-11-15",
      "headline": "Exclusive: The Running Man's Edgar Wright says he enjoyed RRR and loves Ray films In an exclusive interview, 'The Running Man' director Edgar Wright shared his fondness for Indian cinema. He also spoke about his desire to visit the country. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/malice-review-a-glossy-twisty-thriller-thats-high-on-style-low-on-surprise-2820305-2025-11-15",
      "headline": "Malice review: A glossy, twisty thriller that's high on style, low on surpriseRelease Date:Sat Nov 15, 2025 Malice is a stylish but predictable revenge thriller where a charming outsider slowly dismantles a wealthy family from within. Despite strong performances and luxe settings, the series never quite delivers the tension or depth it promises."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahesh-babu-launches-ssmb-29-globetrotter-with-ss-rajamouli-at-hyderabad-event-2820321-2025-11-15",
      "headline": "Mahesh Babu remembers father Krishna ahead of GlobeTrotter event Actor Mahesh Babu expresses heartfelt memories of his father Krishna as he launches SSMB 29 Globetrotter with filmmaker SS Rajamouli and co-stars at a major event in Hyderabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/video/super-junior-de-exclusive-k-pop-duo-on-their-chemistry-and-two-decade-friendship-2820216-2025-11-15",
      "headline": "Super Junior-D&E Exclusive: K-Pop Duo on Their Chemistry and Two-Decade Friendship K-pop duo Super Junior-D&E, composed of members Donghae and Eunhyuk, spoke to India Today's Bhavna Agarwal about their first visit to India. The sub-unit of the group Super Junior, which was part of the initial Hallyu wave, expressed their excitement, stating, 'We always wanted to meet our Indian fans'. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/lalu-yadavs-daughter-rohini-acharya-emotional-message-day-after-cutting-family-ties-quitting-politics-rjd-2820658-2025-11-16",
      "headline": "Tejashwi, aides tore me away: Rohini Acharya after cutting ties with Yadav familyRohini Acharya, Lalu Yadav's daughter, quit politics and severed ties with her family, alleging abuse, humiliation, and betrayal by Tejashwi Yadav's aides. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/9mm-cartridges-typically-used-by-army-recovered-from-red-fort-car-blast-site-but-no-weapon-found-sources-2820588-2025-11-16",
      "headline": "9mm cartridges, used by Army, recovered from Red Fort car blast site: SourcesA powerful car explosion near Delhi's Red Fort on November 10 killed 13 people and injured several others, shattering the area. Authorities continue to document the wreckage and aftermath of the high-intensity blast."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bihar-assembly-election-result-world-bank-fund-women-payout-jdu-bjp-nda-jan-suraaj-prashant-kishor-2820625-2025-11-16",
      "headline": "Rs 14,000 crore World Bank funds used in Bihar polls: Jan Suraaj's big claimPrashant Kishor's party alleged that the Nitish Kumar government diverted Rs 14,000 crore in World Bank funds to give Rs 10,000 cash transfers to women ahead of  elections, calling it an unethical bid to sway the polls. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-1st-test-live-score-ind-vs-sa-day-3-kolkata-match-2820573-2025-11-16",
      "headline": "IND vs SA 1st Test Day 3 Live: Jansen rocks India ahead of lunchIndia (IND) vs South Africa (SA) 1st Test Day 3 Live Score and Updates from Kolkata: It's a session that belonged to South Africa as the visitors head to the break with the edge over India. Dhruv Jurel and Washington Sundar will have their work cut out as the match hangs in the balance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/delhi-bomb-blast-terrorist-attack-response-plan-chain-of-command-first-responders-pmo-police-nia-nsg-26-11-mumbai-2820425-2025-11-16",
      "headline": "There's been a blast. Phones ring. Then...This is what happens after that first phone call reporting an explosion, just like in the Red Fort blast case in Delhi. Veterans tell us how central agencies, like the NSG and the NIA, the state police and the forensic science laboratories react and how the entire counter-terror operation is coordinated."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/new-bihar-government-likely-to-be-sworn-in-on-november-19-or-20-at-patnas-gandhi-maidan-2820632-2025-11-16",
      "headline": "New Bihar government likely to be sworn-in on November 19 or 20 at Gandhi Maidan Live updates The Election Commission will submit the results of the 18th Bihar Assembly elections to Governor Rajendra Arlekar today, following which the notification for the formation of the new Assembly will be issued."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-shubman-gill-ruled-out-neck-injury-bcci-update-kolkata-2820605-2025-11-16",
      "headline": "IND vs SA: Shubman Gill in hospital after neck injury, ruled out of first TestIndia captain Shubman Gill will take no further part in the opening Test against South Africa after sustaining a neck injury on Day 2 at Eden Gardens. The opener was taken to the hospital for scans after experiencing discomfort and is currently under observation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/story/have-no-family-youll-be-abused-hit-with-slippers-if-you-question-rohini-acharya-after-quitting-politics-2820489-2025-11-15",
      "headline": "Go ask Tejashwi, Rameez: Rohini Acharya's first reaction after quitting politicsOn Saturday, Rohini Acharya dropped a bombshell by announcing that she was quitting politics and disowning her family. This came a day after the RJD-led Mahagathbandhan suffered a drubbing in Bihar elections."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-emotionally-drained-rajasthan-royals-trade-manoj-badale-2820566-2025-11-16",
      "headline": "Samson was emotionally drained, asked to leave RR during IPL 2025: Manoj BadaleSanju Samson requested to leave Rajasthan Royals during the IPL 2025 season, revealed team owner Manoj Badale. Samson has been traded to the Chennai Super Kings (CSK) for IPL 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/bihar-assembly-2025-result-bjp-loses-12-seats-razor-thin-margins-votes-rjd-congress-aimim-seemanchal-bsp-election-2820404-2025-11-15",
      "headline": "Who are BJP's dozen who lost despite party's 88% strike rate in Bihar?Sometimes a few votes make all the difference. The BJP, which won 89 seats out of the 101 it contested in Bihar Assembly polls, lost three seats by slender margins of 30, 178, and 221 votes. Who are the BJP's dozen who lost despite the party's impressive strike rate of 88%?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/white-collar-terror-module-case-woman-doctor-detained-haryana-kashmir-red-fort-blast-priyanka-sharma-2820657-2025-11-16",
      "headline": "Haryana woman doctor, linked with 'white-collar' terror module, detained in J&KOfficials probing the \"white-collar\" terror module detained a Haryana doctor posted in Anantnag, widening a multi-agency investigation that already spans Kashmir, Delhi and Haryana and links to the Red Fort blast case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/bihar-election-results-tejashwi-yadav-rjd-vote-share-more-bjp-jdu-nitish-kumar-2820345-2025-11-15",
      "headline": "Tejashwi's RJD got more vote share than BJP, JDU but still lost. Here's whyBihar election results: The RJD, led by Tejashwi Yadav, won 25 of the 143 seats it contested and secured 23 per cent of the vote share, which was the highest for any single party in the election, surpassing both the BJP and the JDU."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/sankranthi-clutter-is-telugu-cinemas-biggest-festival-losing-its-charm-2820129-2025-11-16",
      "headline": "Sankranthi clutter: Is Telugu cinema's biggest festival losing its charm?As multiple big, mid and small films line up for the 2026 Sankranthi window, recent box office patterns raise a question: Is the festival turning from a celebrated showcase into an overcrowded release slot?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/who-is-rameez-rohini-acharyas-post-triggers-buzz-after-shock-exit-from-politics-2820504-2025-11-15",
      "headline": "Who is Rameez, the mystery man at centre of Lalu Yadav family turmoil?In a shocking move, Rohini Acharya, daughter of Lalu Yadav, decided to quit politics and disown her family following Mahagathbandhan's rout in Bihar. In her post, she blamed Tejashwi Yadav and his two aides, including one Rameez, for forcing her to take this decision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/punjab-grandson-of-rss-stalwart-shot-dead-in-firozpur-cctv-footage-shows-attackers-escaping-2820618-2025-11-16",
      "headline": "Grandson of RSS stalwart shot dead in Punjab, CCTV footage shows attackers escapingPolice said Arora had left his shop and was returning home to spend time with his children when the assailants fired at him near Budhwara Wala Mohalla. He died on the spot. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/noida-ceo-says-he-can-buy-two-interns-for-rs-50000-instead-of-a-coffee-machine-2820623-2025-11-16",
      "headline": "Noida CEO says he can 'buy two interns' for Rs 50,000 instead of a coffee machineA Noida IT employee claimed that his CEO made a controversial remark, refusing to invest in a coffee machine and implying he could use the same budget to get interns for the job."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/from-stigma-to-style-glasses-find-a-place-in-indian-bridal-fashion-2819877-2025-11-16",
      "headline": "From stigma to style, glasses find a place in Indian bridal fashionGlasses are becoming an unapologetic addition to bridal trousseaus. The fashion world is also helping brides shake off this unnecessary pressure. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-544-15-11-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rjd-bihar-elections-rohini-acharya-rameez-sanjay-yadav-tejashwi-nda-swearing-in-2820581-2025-11-16",
      "headline": "Tejashwi Yadav's aide Rameez, accused in murder case, has ties to Akhilesh YadavRohini Acharya's revolt has yanked a little-known Tejashwi Yadav's aide into the spotlight, deepening turmoil inside the RJD just as the party absorbs a heavy Bihar defeat to the BJP-JD(U) alliance."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/gurugram-man-critically-injured-as-bungee-cord-breaks-mid-jump-in-rishikesh-2820201-2025-11-15",
      "headline": "Video: Gurugram man critically injured as bungee cord breaks mid-jump in RishikeshA Gurugram man was critically injured after a bungee cord snapped mid-jump in Rishikesh, which triggered outrage and questions about safety measures and regulatory oversight in adventure sports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sholay-returns-4k-re-release-original-ending-final-cut-amitabh-bachchan-dharmendra-jaya-bachchan-hema-malini-2820607-2025-11-16",
      "headline": "Sholay returns in 4K: Iconic film to re-release with its original endingThe 4K restored version of 'Sholay' will be released in 1,500 screens across India to mark the film's 50th anniversary. The final cut version will feature the movie's original climax. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/dellhi-aqi-no-relief-for-national-capital-as-air-quality-stays-very-poor-amid-fresh-pollution-surge-2820601-2025-11-16",
      "headline": "No relief for Delhi as air quality stays 'very poor' amid fresh pollution surgeData from the Central Pollution Control Board (CPCB) at 7 am showed that many parts of the city were once again breathing hazardous air, signalling a fresh deterioration after a brief improvement at the end of the week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/jobs-and-careers/story/why-emotional-intelligence-matters-at-work-and-how-organisations-can-build-it-2820451-2025-11-16",
      "headline": "Emotional intelligence: The hidden skill that can make or break your careerIn offices full of flawless presentations and tight deadlines, one skill is quietly becoming a deal-maker: emotional intelligence. But for many professionals, mastering EQ is proving harder than mastering code."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/budgam-road-accident-car-truck-collision-killed-injured-jammu-kashmir-2820626-2025-11-16",
      "headline": "4 killed, 7 injured after car collides with dumper truck in J&K's BudgamFour people, including a 10-year-old girl, died after a Tata Sumo collided with a dumper truck in Budgam's Palar area late Saturday, leaving seven others injured and hospitalised."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/de-de-pyaar-de-2-box-office-collection-day-2-ajay-devgn-film-witnesses-close-to-50-jump-2820645-2025-11-16",
      "headline": "De De Pyaar De 2 box office Day 2: Ajay Devgn's film witnesses close to 50% jumpAjay Devgn and Rakul Preet Singh's 'De De Pyaar De 2' witnessed a significant rise in collections on Saturday. The film, a romantic comedy directed by Anshul Sharma, also stars R Madhavan and Meezaan Jafri, amongst others."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/photo/priyanka-chopra-brings-regal-charm-in-ivory-lehenga-at-varanasi-event-see-pics-2820653-2025-11-16",
      "headline": "Priyanka Chopra brings regal charm in ivory lehenga at Varanasi event. See picsActor Priyanka Chopra served regal glam at the title launch event of her upcoming film 'Varanasi'. Directed by SS Rajamouli, the highly anticipated movie also stars Mahesh Babu and Prithviraj Sukumaran."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-aims-highest-successful-test-run-chase-eden-gardens-lead-south-africa-series-2820641-2025-11-16",
      "headline": "Can India chase 124 and win Kolkata Test? Here's what history says IND vs SA, 1st Test: India face a historic challenge at Eden Gardens, needing to pull off the venue's highest-ever run-chase to beat South Africa. India is the only team to chase a 100-plus target in Kolkata. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-temba-bavuma-fifty-kolkata-test-2820635-2025-11-16",
      "headline": "Bavuma hits first fifty of Kolkata Test, earns standing ovation at Eden Gardens India vs South Africa, 1st Test: Temba Bavuma brought up a superb half-century on a surface where no other batter had managed to cross 40 across three innings on a treacherous Eden Gardens pitch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-eden-gardens-pitch-modern-batting-kolkata-test-chaos-2820616-2025-11-16",
      "headline": "Eden pitch or modern batting: Why the Kolkata Test has spiralled into chaos India vs South Africa: Eden Gardens has sparked a fierce debate: is this another rogue surface, or are modern batters simply losing the craft required for tough Test cricket? As the match hurtles towards an early finish, the questions only grow louder."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravindra-jadeja-pay-cut-joins-rajasthan-royals-ipl-2026-transfer-2820599-2025-11-16",
      "headline": "Maybe Ravindra Jadeja was done with CSK: Ex-India opener on RR move Ravindra Jadeja's move from Chennai Super Kings to Rajasthan Royals for a lower fee has raised questions over his motivations, including possible captaincy offers, as highlighted by former cricketer Aakash Chopra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-shubman-gill-ruled-out-neck-injury-bcci-update-kolkata-2820605-2025-11-16",
      "headline": "IND vs SA: Shubman Gill in hospital after neck injury, ruled out of first Test India captain Shubman Gill will take no further part in the opening Test against South Africa after sustaining a neck injury on Day 2 at Eden Gardens. The opener was taken to the hospital for scans after experiencing discomfort and is currently under observation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/atp-finals-carlos-alcaraz-vs-jannik-sinner-championship-match-2820592-2025-11-16",
      "headline": "ATP Finals: Carlos Alcaraz sets blockbuster championship match vs Jannik Sinner World number one Carlos Alcaraz cruised past Canada's Felix Auger-Aliassime 6-2, 6-4 at the ATP Finals on Saturday, booking his place in a much-anticipated title clash with defending champion Jannik Sinner."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/special-report-grit-glory-at-5th-ironman-703-as-goa-hosts-athletes-from-31-nations-ytvd-2820591-2025-11-16",
      "headline": "Special Report: Grit, Glory at 5th Ironman 70.3 as Goa Hosts Athletes From 31 Nations This special report covers the 5th edition of the Ironman 70.3 triathlon in Goa, where over 1300 athletes from 31 countries competed in a grueling 1.9 km swim, 90 km cycle, and 21.1 km run. The event, held at Miramar beach, saw Konstantin Belusov of Uzbekistan win the men's category, while the Indian Air Force teams secured the top three spots in the relay. 'It's an amazing feeling,' said men's category winner Konstantin Belusov. 'It's my first time being in India. My second ever half-hour a month and I mean it surprised me to get a result like this today.' The report highlights the immense human endurance and resilience on display."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravindra-jadeja-return-to-rajasthan-royals-manoj-badale-reaction-ipl-2026-2820589-2025-11-16",
      "headline": "Jadeja reached out to me 4 weeks ago, was excited about coming home: RR owner RR owner Manoj Badale said that Ravindra Jadeja was excited about returning to the franchise where he started his IPL career. Jadeja played a big role in RR's IPL title win in 2008. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-1st-test-live-score-ind-vs-sa-day-3-kolkata-match-2820573-2025-11-16",
      "headline": "IND vs SA 1st Test Day 3 Live: Jansen rocks India ahead of lunch India (IND) vs South Africa (SA) 1st Test Day 3 Live Score and Updates from Kolkata: It's a session that belonged to South Africa as the visitors head to the break with the edge over India. Dhruv Jurel and Washington Sundar will have their work cut out as the match hangs in the balance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/atp-finals-carlos-alcaraz-vs-jannik-sinner-championship-match-2820592-2025-11-16",
      "headline": "ATP Finals: Carlos Alcaraz sets blockbuster championship match vs Jannik Sinner World number one Carlos Alcaraz cruised past Canada's Felix Auger-Aliassime 6-2, 6-4 at the ATP Finals on Saturday, booking his place in a much-anticipated title clash with defending champion Jannik Sinner."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/special-report-grit-glory-at-5th-ironman-703-as-goa-hosts-athletes-from-31-nations-ytvd-2820591-2025-11-16",
      "headline": "Special Report: Grit, Glory at 5th Ironman 70.3 as Goa Hosts Athletes From 31 Nations This special report covers the 5th edition of the Ironman 70.3 triathlon in Goa, where over 1300 athletes from 31 countries competed in a grueling 1.9 km swim, 90 km cycle, and 21.1 km run. The event, held at Miramar beach, saw Konstantin Belusov of Uzbekistan win the men's category, while the Indian Air Force teams secured the top three spots in the relay. 'It's an amazing feeling,' said men's category winner Konstantin Belusov. 'It's my first time being in India. My second ever half-hour a month and I mean it surprised me to get a result like this today.' The report highlights the immense human endurance and resilience on display."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravindra-jadeja-return-to-rajasthan-royals-manoj-badale-reaction-ipl-2026-2820589-2025-11-16",
      "headline": "Jadeja reached out to me 4 weeks ago, was excited about coming home: RR owner RR owner Manoj Badale said that Ravindra Jadeja was excited about returning to the franchise where he started his IPL career. Jadeja played a big role in RR's IPL title win in 2008. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-1st-test-live-score-ind-vs-sa-day-3-kolkata-match-2820573-2025-11-16",
      "headline": "IND vs SA 1st Test Day 3 Live: Jansen rocks India ahead of lunch India (IND) vs South Africa (SA) 1st Test Day 3 Live Score and Updates from Kolkata: It's a session that belonged to South Africa as the visitors head to the break with the edge over India. Dhruv Jurel and Washington Sundar will have their work cut out as the match hangs in the balance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-emotionally-drained-rajasthan-royals-trade-manoj-badale-2820566-2025-11-16",
      "headline": "Samson was emotionally drained, asked to leave RR during IPL 2025: Manoj BadaleSanju Samson requested to leave Rajasthan Royals during the IPL 2025 season, revealed team owner Manoj Badale. Samson has been traded to the Chennai Super Kings (CSK) for IPL 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2026-mini-auction-decembr-16-abu-dhabi-bcci-2820511-2025-11-15",
      "headline": "IPL 2026 auction on December 16 in Abu Dhabi after 173 players retained: BCCIThe IPL 2026 Player Auction is set to take place on 16th December at the Etihad Arena in Abu Dhabi, announced BCCI on Saturday, November 15. The player retention window for the Indian Premier League (IPL) 2026 season closed on 15 November 2025, with all 10 franchises finalising their squads ahead of the upcoming auction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-neck-injury-sidelines-india-captain-first-test-south-africa-eden-gardens-2820496-2025-11-15",
      "headline": "Shubman Gill's neck injury likely from bad sleep, not workload: Morne MorkelIndia vs South Africa: Bowling coach Morne Morkel has dismissed suggestions that Shubman Gill's neck injury was caused by workload, insisting it may simply be the result of a stiff night's sleep. The setback, however, is all set to leave India without their captain for the rest of the first Test in Kolkata. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-simon-harmer-on-kolkata-pitch-criticism-pitches-in-2015-were-worse-2820485-2025-11-15",
      "headline": "Simon Harmer plays down Kolkata surface criticism: Pitches in 2015 were worseSouth Africa spinner Simon Harmer compared the current Kolkata Test surface to the 2015 India tour, saying the previous wickets were more challenging. The Eden Gardens pitch has come under the scanner after 16 wickets fell on Day 2 of the first Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/chess-world-cup-2025-arjun-erigaisi-quarters-harikrishna-pentala-2820491-2025-11-15",
      "headline": "Chess World Cup: Arjun Erigaisi reaches quarters, Harikrishna to play tiebreakGM Arjun Erigaisi rejected a draw and defeated Levon Aronian to advance in the FIDE World Cup 2025 in Goa on Saturday. Harikrishna must now face a tiebreak to stay in the competition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yash-dayal-retained-royal-challengers-bengaluru-serious-criminal-allegations-pocso-case-2820467-2025-11-15",
      "headline": "RCB face backlash for retaining Yash Dayal amid rape allegationsRoyal Challengers Bengaluru's decision to retain Yash Dayal for IPL 2026 has sparked backlash on social media, as the bowler is facing two criminal cases involving allegations of sexual assault — one under the POCSO Act involving a minor and another alleging sexual exploitation under the pretext of marriage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/my-fathers-never-satisfied-with-me-even-if-i-score-200-vaibhav-suryavanshi-2820459-2025-11-15",
      "headline": "My father's never satisfied with me, even if I score 200: Vaibhav SuryavanshiVaibhav Suryavanshi revealed that his father, Sanjiv Suryavanshi, is never happy with his performance, even if he scores 200. The 15-year-old recently registered the second-fastest T20 century by an Indian in the Rising Stars Asia Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-neck-injury-india-captain-sidelined-first-test-south-africa-2820450-2025-11-15",
      "headline": "Shubman Gill stretchered to hospital with neck injury, may miss rest of 1st TestIND vs SA: India captain Shubman Gill is likely to miss the remainder of the first Test against South Africa at Eden Gardens due to a neck injury sustained while playing a sweep off Simon Harmer.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/chess-world-cup-2025-arjun-erigaisi-quarters-harikrishna-pentala-2820491-2025-11-15",
      "headline": "Chess World Cup: Arjun Erigaisi reaches quarters, Harikrishna to play tiebreakGM Arjun Erigaisi rejected a draw and defeated Levon Aronian to advance in the FIDE World Cup 2025 in Goa on Saturday. Harikrishna must now face a tiebreak to stay in the competition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yash-dayal-retained-royal-challengers-bengaluru-serious-criminal-allegations-pocso-case-2820467-2025-11-15",
      "headline": "RCB face backlash for retaining Yash Dayal amid rape allegationsRoyal Challengers Bengaluru's decision to retain Yash Dayal for IPL 2026 has sparked backlash on social media, as the bowler is facing two criminal cases involving allegations of sexual assault — one under the POCSO Act involving a minor and another alleging sexual exploitation under the pretext of marriage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/my-fathers-never-satisfied-with-me-even-if-i-score-200-vaibhav-suryavanshi-2820459-2025-11-15",
      "headline": "My father's never satisfied with me, even if I score 200: Vaibhav SuryavanshiVaibhav Suryavanshi revealed that his father, Sanjiv Suryavanshi, is never happy with his performance, even if he scores 200. The 15-year-old recently registered the second-fastest T20 century by an Indian in the Rising Stars Asia Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-neck-injury-india-captain-sidelined-first-test-south-africa-2820450-2025-11-15",
      "headline": "Shubman Gill stretchered to hospital with neck injury, may miss rest of 1st TestIND vs SA: India captain Shubman Gill is likely to miss the remainder of the first Test against South Africa at Eden Gardens due to a neck injury sustained while playing a sweep off Simon Harmer.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/punjab-kings-release-glenn-maxwell-ipl-2026-poor-form-ricky-ponting-2820445-2025-11-15",
      "headline": "Ricky Ponting's blunt take on why PBKS released Glenn MaxwellPunjab Kings (PBKS) released Glenn Maxwell ahead of IPL 2026 after the Australian all-rounder struggled in 2025, scoring just 48 runs in six innings, with head coach Ricky Ponting saying he wouldn't fit into the team's starting XI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kl-rahul-released-dc-head-coach-mocks-trade-rumours-after-ipl-retentions-2820442-2025-11-15",
      "headline": "KL Rahul released? DC head coach mocks trade rumours after IPL retentionsDelhi Capitals coach Hemang Badani mocked all trade rumours surrounding KL Rahul ahead of IPL 2026. Ahead of the players' retention deadline, there were speculations that KL Rahul might be traded."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2026-retention-csk-ruturaj-gaikwad-captain-sanju-samson-2820434-2025-11-15",
      "headline": "CSK confirm Ruturaj Gaikwad remains captain after Sanju Samson tradeIPL 2026 retentions: Chennai Super Kings confirmed on the retention deadline day that Ruturaj Gaikwad will continue to captain the side. Speculation was rife that Sanju Samson, who was traded from Rajasthan Royals, would take over the baton. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2026-retentions-full-list-players-mini-auction-purse-remaining-2820429-2025-11-15",
      "headline": "IPL 2026: How teams stack up for mini auction after retention deadline dayIPL 2026 retentions full list: Chennai Super Kings and Kolkata Knight Riders released a big chunk of their squad, making room for the mini auction. While KKR let go of Andre Russell, CSK released their Sri Lankan pacer Matheesha Pathirana. Here's the full list of players retained and relased by teams on deadline day. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kkr-releases-andre-russell-ahead-of-ipl-2026-auction-2820417-2025-11-15",
      "headline": "KKR release Andre Russell in shocking move, break their old promiseIPL 2026 Retentions: Kolkata Knight Riders (KKR) have released their charismatic all-rounder Andre Russell, who has been with the team since the 2014 season and contributed to their IPL title wins in 2014 and 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-1st-test-day-2-report-harmer-jadeja-bavuma-eden-gardens-pitch-2820380-2025-11-15",
      "headline": "Kolkata Test in 2x mode: 16 wickets fall on Day 2 in Eden Gardens dustbowlIndia vs South Africa, 1st Test, Day 2: Spin ruled the roost on the second day of the opening Test as India clawed their way back into the contest after being dismissed for a modest 189. Ravindra Jadeja left the visitors tottering at 93 for seven at stumps on an Eden Gardens surface that offered uneven bounce and sharp turn. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-1st-test-eden-gardens-pitch-criticism-fans-2820377-2025-11-15",
      "headline": "Eden Gardens deserves to be banned: Fans slam pitch in Kolkata TestIndia vs South Africa, 1st Test: The Eden Gardens pitch was scrutinised for being heavily in favour of spinnners and bowlers. As many as 26 wickets fell on the first two days of the match in Kolkata."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/ryan-williams-india-squad-afc-qualifier-vs-bangladesh-aiff-oci-2820364-2025-11-15",
      "headline": "New India citizen Ryan Williams named in AFC qualifier squad vs BangladeshNew India citizen Ryan Williams has been added to the Indian squad for their final AFC Asia Cup qualifier against Bangladesh, which will take place on November 18. Williams recently got his India passport. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}