{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/supreme-court-puts-bhushan-power-liquidation-on-hold-amid-jsw-review-plea-2730641-2025-05-26",
      "headline": "Supreme Court puts Bhushan Power liquidation on hold as JSW seeks reviewThis interim order effectively pauses the liquidation process of BSPL, offering JSW a window to pursue legal recourse and protect its investment interests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filing-itr-for-2025-here-is-why-you-must-verify-your-ais-and-form-26as-first-2730625-2025-05-26",
      "headline": "Filing ITR for 2025? Here's why you must verify your AIS and Form 26AS firstOne of the most important things you should do before filing your return is to check your Annual Information Statement (AIS) and Form 26AS. These documents contain details of your income and financial transactions during the year. If you forget to report something, you could end up receiving a notice from the tax department."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/radico-khaitan-launches-trikal-and-morpheus-premium-whiskies-2730624-2025-05-26",
      "headline": "Radico Khaitan launches TRIKĀL and Morpheus whiskiesWith the new launches, the company's goal is to dominate both the luxury and super-premium categories, building on the global success of its flagship Rampur Indian Single Malt."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-utilities-not-live-yet-will-the-e-filing-deadline-be-extended-2730597-2025-05-26",
      "headline": "ITR utilities not live yet: Will the e-filing deadline be extended?Many taxpayers are wondering if the delay in these filing tools means the return filing deadline will be pushed. But that's unlikely. The deadline for those who don't need to get their accounts audited remains July 31, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/belrise-industries-ipo-allotment-status-online-guide-check-latest-gmp-listing-date-2730551-2025-05-26",
      "headline": "Belrise Industries IPO allotment: Step-by-step guide to check statusThe IPO received a good response from all types of investors. By the end of the three-day bidding period on May 23, it was subscribed 43.14 times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/nibe-share-price-rise-5-percent-upper-circuit-why-reason-new-order-israel-2730514-2025-05-26",
      "headline": "Explained: Why NIBE share price surged 5% to hit upper circuit todayNIBE share price: The shares of NIBE Ltd surged 5% to hit the upper circuit. The stock has lost 4.43% in the last 5 days, but has gained 18.22% in the past month. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/aegis-vopak-terminals-ipo-open-bidding-subscribe-skip-details-expert-review-gmp-today-2730498-2025-05-26",
      "headline": "Aegis Vopak Terminals IPO: Subscribe or skip Rs 2,800 crore listing? Check GMPBefore the public issue opened, the company raised Rs 1,259.99 crore from 32 anchor investors. This money was raised at the upper end of the price band, which is Rs 235 per share."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/eternal-zomato-share-price-falling-today-global-index-msci-ftse-cut-weights-explained-2730494-2025-05-26",
      "headline": "Eternal shares tumble over 3% in early trade. Why is the stock falling?The Zomato stock was trading 3.17% lower on the NSE at 9:38 am, making it the only significant laggard among Nifty50 constituents during morning trade. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-gain-why-is-stock-market-rising-3-reasons-why-tariff-pause-4th-largest-economy-rbi-dividend-monsoon-2730489-2025-05-26",
      "headline": "Sensex gains 750 points: 3 reasons why stock market is rising todayStock market rally: Sensex surged over 700 points to 82,437.76 in early trade, while Nifty gained over 200 points to 25,063.65 as of 9:50 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-jumps-over-500-points-nifty-crosses-25000-eternal-falls-over-3-2730482-2025-05-26",
      "headline": "Sensex jumps over 600 points, Nifty crosses 25,000; Eternal tumbles 3%The BSE Sensex rose 704.45 points to 82,425.53 around 9:53 am while the Nifty50 gained 218.10 points to 25,071.25. Broader market indices were also in the green, reflecting widespread bullish sentiment on Dalal Street."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/leela-hotels-ipo-open-bidding-subscribe-skip-latest-gmp-opening-date-market-view-2730473-2025-05-26",
      "headline": "Leela Hotels IPO opens for bidding: Should you subscribe? Check latest GMPLeela Hotels plans to raise Rs 2,500 crore by issuing 5.75 crore fresh equity shares. An additional Rs 1,000 crore will be raised through the offer for sale (OFS) route, where existing shareholders will sell 2.30 crore shares."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-prediction-trading-setup-sensex-nifty-today-may-26-nse-bse-2730462-2025-05-26",
      "headline": "Stock market today: Will Sensex, Nifty open higher on May 26?Market experts believe Nifty may continue to trade in a narrow range, with some key support and resistance levels in focus. Gift Nifty futures were trading at 24,935.5 around 8:09 am, which is above Friday's closing level of 24,853.15 for Nifty50."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-says-raha-has-transformed-her-emotionally-everyone-pain-affects-you-2730644-2025-05-26",
      "headline": "Alia Bhatt says Raha has transformed her emotionally: Everyone's pain affects youActor Alia Bhatt talked about motherhood bringing a whirlwind of changes in her. She mentioned feeling more empathetic and concerned about people's feelings, and looking at the world from a whole new perspective. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/retro-ott-release-when-and-where-to-watch-suriyas-gangster-drama-2730606-2025-05-26",
      "headline": "Retro OTT release: When and where to watch Suriya's gangster dramaSuriya and director Karthik Subbaraj's 'Retro' had a decent run at the box office. The film is all set to stream on an OTT platform later this week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/gurmeet-choudhary-debina-bonnerjee-hina-khan-rocky-jaiswal-colors-tv-pati-patni-aur-panga-2730632-2025-05-26",
      "headline": "Gurmeet-Debina, Hina-Rocky star in new show Pati, Patni Aur PangaColors TV is set to launch a new reality show, 'Pati, Patni Aur Panga', featuring popular celebrity couples. The show promises exciting challenges and a fresh take on couples competing together."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/yg-2025-blueprint-blackpink-treasure-baby-monster-new-rookies-unveiled-2730556-2025-05-26",
      "headline": "Blackpink headlines YG's 2025 Blueprint featuring Treasure, BabyMonsterYG's executive producer, Yang Hyun-suk unveiled a new plan to boost activities for artists like Blackpink, Baby Monster, and Treasure, while also accelerating the debut of new talents. He announced the upcoming projects of Blackpink and the release of their new album and world tour 'Deadline' following the teaser release on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prabhas-to-have-a-30-minute-extended-cameo-in-kannappa-reveals-vishnu-manchu-2730571-2025-05-26",
      "headline": "Prabhas to have a 30-minute extended cameo in Kannappa, reveals Vishnu ManchuTelugu actor Vishnu Manchu's upcoming fantasy film, 'Kannappa', has been generating buzz due to its star-studded cameo appearances, which include Prabhas, Mohanlal and Akshay Kumar. In a recent interview, Vishnu revealed more details about the film and these characters."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/woman-injured-as-theatre-ceiling-crashes-down-at-final-destination-screening-2730586-2025-05-26",
      "headline": "Final Destination turns real as Aregntina theatre ceiling collapses, injures womanFiamma Villaverde's 29th birthday ended up being a real-life 'Final Destination' when she got injured while watching the sixth instalment of the American horror franchise. The theatre ceiling in Argentina collapsed mid-screening."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/joju-george-kamal-haasan-oscar-thug-life-mani-ratnam-2730592-2025-05-26",
      "headline": "Kamal Haasan's praise is my Oscar, Mollywood co-workers hurt me: Actor Joju GeorgeActor Joju George was moved to tears when Kamal Haasan praised him at the 'Thug Life' audio launch. The actor shared the video on his Instagram and called Haasan's appreciation his Oscar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ajay-devgn-jackie-chan-teaser-karate-kid-legends-hindi-release-2730574-2025-05-26",
      "headline": "You fight, I dance: Jackie Chan tells Ajay Devgn as they promote Karate KidThe teaser of Ajay Devgn and Jackie Chan's conversation was unveiled ahead of Karate Kid: Legends release. The martial arts icon showed keen interest in doing a Bollywood film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/puzzled-sanjay-dutt-asks-karn-as-paps-mention-rasha-thadani-watch-viral-video-2730570-2025-05-26",
      "headline": "Puzzled Sanjay Dutt asks 'kaun' as paps mention Rasha Thadani. WatchActor Sanjay Dutt was asking the paparazzi to leave the place since it was raining when they informed him that they were waiting to click Rasha Thadani at the venue. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/typical-hindi-heroine-bipasha-basu-says-jism-changed-how-bollywood-saw-women-2730557-2025-05-26",
      "headline": "'Typical Hindi heroine' Bipasha Basu says Jism changed how Bollywood saw womenActor Bipasha Basu recalled how she was looked at as a 'typical Hindi film heroine' until 'Jism' happened, and changed the perception of Bollywood. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sidharth-malhotra-praises-gram-chikitsalay-and-calls-it-a-must-watch-2730503-2025-05-26",
      "headline": "Sidharth Malhotra praises Gram Chikitsalay, calls it a must watchBollywood actor Sidharth Malhotra is thoroughly impressed with Prime Video's 'Gram Chikitsalay'. The series features Amol Parashar and Vinay Pathak. It premiered on the OTT platform on May 9. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-gauri-spratt-son-azadl-lunch-date-2730502-2025-05-26",
      "headline": "Aamir Khan, partner Gauri Spratt and son Azad step out for special lunch dateAamir Khan, his partner Gauri Spratt and his son Azad were seen visiting a plush restaurant in Mumbai for lunch. The trio were seen exiting the restaurant in a viral video."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/bhool-chuk-maaf-box-office-day-3-detailed-report-rajkummar-rao-heartland-comedy-wraps-up-decent-1st-weekend-2730500-2025-05-26",
      "headline": "Bhool Chuk Maaf box office Day 3: Heartland comedy wraps up decent 1st weekend Despite receiving mixed reviews, Rajkummar Rao's 'Bhool Chuk Maaf' collected decently in its opening weekend. The film is set against the backdrop of a wedding and time loop. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/game-changer-editor-shameer-muhammed-director-shankar-unprofessionalism-2730487-2025-05-26",
      "headline": "Game Changer editor slams director Shankar's work ethics: Had terrible experience'Game Changer' editor Shameer Muhammed called out director Shankar's unprofessionalism in a recent interview. He said that the filmmaker would turn up 10 days late for editing and called it a 'terrible experience'."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/mission-impossible-8-the-final-reckoning-box-office-day-9-detailed-report-tom-cruise-film-fails-to-hit-rs-100-crore-after-2nd-weekend-2730484-2025-05-26",
      "headline": "Mission Impossible 8 box office Day 9: Fails to hit Rs 100 crore after 2nd weekendTom Cruise's 'Mission Impossible - The Final Reckoning' is eyeing Rs 110 crore - the lifetime collection of the previous film in the franchise. However, the film has slowed down with current collection in the range of Rs 72 crore after nine days. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-salutes-indian-agniveers-celebrates-countrys-booming-gdp-2730472-2025-05-26",
      "headline": "Amitabh Bachchan salutes India's Agniveers, celebrates country's booming GDP Actor Amitabh Bachchan shared a series of posts on social media, praising India's rise as the fourth-largest economy in the world. He also shared a tribute to the Indian army. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/super-singer-junior-10-winner-gayathri-nasreen-1st-runner-up-kamal-haasan-ar-rahman-2730464-2025-05-26",
      "headline": "Gayathri lifts Super Singer Junior 10 trophy, wins villa worth Rs 60 lakhGayathri won the title of Vijay Television's Super Singer Junior 10, while Nasreen became the first runner-up. Kamal Haasan and AR Rahman were the chief guests for the musical night."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/sophie-turner-cheerleader-joe-jonas-divorce-inspired-album-2730453-2025-05-26",
      "headline": "Sophie Turner turns cheerleader for Joe Jonas's new divorce-inspired albumSophie Turner extended her support for her ex-husband Joe Jonas's solo album, 'Music for People Who Believe in Love'. This move came months after the two parted ways."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/og-release-date-out-pawan-kalyan-film-to-hit-screens-in-september-2730364-2025-05-25",
      "headline": "OG release date out: Pawan Kalyan's film to hit screens in SeptemberPawan Kalyan's much-awaited Telugu action film 'OG' is set to release in September25, 2025. Directed by Sujeeth and featuring music by S Thaman, the film will be a gripping mafia drama alongside a star-studded cast.\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/heavy-rain-batters-mumbai-pune-monsoon-advances-high-alert-karnataka-2730461-2025-05-26",
      "headline": "Rain red alert in Mumbai, roads flooded, local trains and flights hit Live UpdatesMumbai weather: Several low-lying areas, local trains and flight operations have been affected after heavy rain and thunderstorms lashed Mumbai."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/mumbai/story/mumbai-rain-breaks-107-year-record-may-rainfall-monsoon-earliest-arrival-25-years-2730640-2025-05-26",
      "headline": "107-year May rain record broken as monsoon makes earliest arrival in 25 yearsMumbai breaks 107-year record for May rainfall as monsoon makes earliest arrival in city in 25 years"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/covid-19-cases-cross-delhi-kerala-mumbai-fresh-infections-2730577-2025-05-26",
      "headline": "India reports over 1,000 active Covid cases; spikes in Kerala, Maharashtra, DelhiDelhi has registered over 100 cases of Covid-19 with 99 cases recorded in the past week. 750 fresh infections have been reported in the last week in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-army-chief-gifts-pm-chinese-drill-photo-to-celebrate-own-strikes-against-india-2730549-2025-05-26",
      "headline": "Asim Munir passes off pic of Chinese drill as strike on India, gifts it to Pak PMThe photo was reportedly presented at a high-profile dinner hosted by Pakistan Field Marshal Asim Munir, Chief of Army Staff. It quickly became the subject of widespread mockery on social media."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/no-foreign-wife-shopping-china-warns-against-marriage-scams-in-bangladesh-2730474-2025-05-26",
      "headline": "No 'foreign wife' shopping: China warns against marriage scams in BangladeshThe Chinese embassy in Bangladesh warned its citizens not to fall for deceptive \"cross-border dating\" content on short video platforms or seek out so-called \"foreign wives\" through informal networks or commercial matchmaking agencies,"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistan-spy-nia-crpf-personnel-delhi-spying-for-pakistan-2730652-2025-05-26",
      "headline": "CRPF personnel from Delhi arrested for spying for Pakistan since 2023A CRPF personnel, Moti Ram Jat, was arrested in Delhi for allegedly sharing classified national security information with Pakistan Intelligence Officers since 2023. \r\n\r\n\r\n\r\n\r\n\r\n4o\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mumbai-polices-economic-offences-wing-questions-actor-dino-morea-in-rs-65-crore-mithi-river-cleaning-scam-2730642-2025-05-26",
      "headline": "Actor Dino Morea questioned by Mumbai Police in Rs 65-crore Mithi river scamMumbai Police's Economic Offences Wing questioned actor Dino Morea in Rs 65-crore Mithi river cleaning scam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/india-covid-new-subvariants-nb-1-8-1-lf-7-detection-mild-cases-booster-advice-2730543-2025-05-26",
      "headline": "New Covid-19 variants detected in India: Should you be worried?India has detected new Covid-19 subvariants NB.1.8.1 and LF.7 in Tamil Nadu and Gujarat. Experts say cases remain mild but advise boosters and caution for high-risk groups."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/mumbai/video/video-underground-mumbai-metro-station-flooded-amid-rain-havoc-in-city-2730631-2025-05-26",
      "headline": "Video: Underground Mumbai Metro station flooded amid rain havoc in cityIn a concerning incident early Monday, the newly inaugurated Acharya Atre Chowk underground metro station on Mumbai's Aqua Line 3 was submerged following heavy overnight rainfall. Operational since May 10, 2025, the station links key business districts Bandra-Kurla Complex and Worli. Authorities are assessing the damage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/amazon-fashions-serve-store-offers-convenience-selection-and-value-to-gen-z-says-nikhil-sinha-director-amazon-fashion-2729633-2025-05-24",
      "headline": "Amazon Fashion's 'SERVE' Store Offers Convenience, Selection and Value to Gen Z, says Nikhil Sinha, Director, Amazon FashionIndia's first dedicated Gen Z fashion store democratizes style access across the country with 3X customer growth\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mumbai-rain-weather-news-live-early-monsoon-thunderstorms-heavy-rain-imd-forecast-traffic-local-trains-waterlogging-2730541-2025-05-26",
      "headline": "Live: Monsoon hits Mumbai 16 days ahead of schedule, shatters 107-year recordMumbai weather live update: Thunderstorms with lightning and gusty winds lashed Mumbai on Monday morning, disrupting suburban train services and slowing road traffic amid poor visibility, officials said. The India Meteorological Department (IMD) announced that the southwest monsoon has arrived in Maharashtra nearly ten days ahead of schedule — the earliest since 1990. Civic officials reported continuous rainfall since Sunday night, with some low-lying areas experiencing flooding. The IMD has forecast light to moderate rain in parts of the city over the next 24 hours. Stay with IndiaToday.in for live updates:"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-shopping-spree-drones-launchers-after-india-operation-sindoor-sources-2730580-2025-05-26",
      "headline": "Pak on shopping spree for drones, launchers after India's Op Sindoor: SourcesAfter India's Operation Sindoor, Pakistan is purchasing 30 Wing Loong unmanned aerial vehicles (Chinese killer drones), as per sources. It is also renewing a 2021 defence agreement with a Turkish company, sources added."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/satellite-images-warn-of-intensifying-rainfall-as-monsoon-swamps-mumbai-2730637-2025-05-26",
      "headline": "Satellite images warn of intensifying rainfall as monsoon swamps MumbaiThe India Meteorological Department (IMD) confirmed on May 26, that the Southwest Monsoon has further advanced into several key regions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/tunnel-documents-hamas-gaza-used-october-7-massacre-derail-israel-saudi-arabia-normalisation-yahya-sinwar-2727088-2025-05-26",
      "headline": "Hamas carried out Oct 7 massacre to derail Israel-Saudi deal, reveal tunnel papersA new set of documents recovered by the Israeli army reveal what had long been suspected. The October 7 Hamas massacre of people in Israel was a calculated move to sabotage the normalisation of ties between Israel and Saudi Arabia. It was the \"extraordinary act\" needed to keep the two nations from formalising ties."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/new-satellite-image-shows-pakistans-murid-airbase-damaged-indian-airstrike-2730463-2025-05-26",
      "headline": "New satellite images show damage to Pak's Nur Khan, Murid bases in Indian strikeNew satellite images reveal damage caused to the Pakistan Air Force bases in Murid and Nur Khan after the Indian Air Force's precise strike - Operation Sindoor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/saudi-arabia-lifts-alcohol-ban-major-rules-ahead-world-cup-2034-wine-beer-cider-2026-heres-what-happened-2730627-2025-05-26",
      "headline": "Saudi Arabia to lift alcohol ban ahead of World Cup 2034Saudi Arabia, an ultra-conservative country, is planning to legalise alcohol at 600 tourist spots ahead of hosting the 2034 World Cup. It will allow the sale of wine, beer, and cider at licensed locations, such as five-star hotels. Saudi Arabia believes that allowing alcohol at certain tourist sites will help the country compete with the UAE and Bahrain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/mumbai-rains-memes-jokes-videos-heavy-rain-monsoon-hits-city-weather-updates-2730588-2025-05-26",
      "headline": "Heavy rain brings Mumbai to a standstill as Internet floats with memes to copeMumbai Rain Memes: Mumbai woke up to heavy rain and waterlogged roads on Monday as the monsoon continued its advance. To cope, social media users flooded the internet with memes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/putins-chopper-epicenter-ukrainian-drone-attack-claims-russian-commander-2730538-2025-05-26",
      "headline": "Putin's chopper was 'at epicentre' of Ukrainian drone attack, claims Russian commanderA Russian military commander has claimed that President Vladimir Putin's helicopter was 'at the epicentre' of the Ukrainian drone attack on May 20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-preview-carlos-alcaraz-rafael-nadal-2730518-2025-05-26",
      "headline": "Who can challenge Carlos Alcaraz on clay in the post-Nadal era? French Open 2025 ushers in a new era with Carlos Alcaraz poised to defend his crown. With Sinner surging, Djokovic seeking redemption, and dark horses in the mix, Paris is set for a gripping battle to decide the next ruler of Roland Garros."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/what-the-hell-trump-loses-cool-after-putin-launches-largest-airstrike-of-war-glbs-2730438-2025-05-26",
      "headline": "What the hell...: Trump loses cool after Putin launches war's biggest air attackDonald Trump, who had been patient with Vladimir Putin, slammed him after Russia's largest airstrike on Ukraine killed 12. Calling out the violence, Trump said, \"What the hell happened to him?\" "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/why-indian-astronaut-shubhanshu-shukla-has-been-put-into-quarantine-2730547-2025-05-26",
      "headline": "Why Indian astronaut Shubhanshu Shukla has been put into quarantineThe Ax-4 mission is scheduled for launch on June 8, 2025 from the Kennedy Space Centre aboard a SpaceX Dragon spacecraft. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/coastal-karnataka-see-heavy-rains-schools-shut-in-mysuru-kodagu-as-krishna-river-swells-major-inflow-almatti-reservoir-2730533-2025-05-26",
      "headline": "Heavy rain lashes coastal Karnataka, Mysuru, Kodagu, light showers in BengaluruThe Met department has issued a red alert for coastal Karnataka, warning of extremely heavy rain, thunderstorms, and lightning. North interior Karnataka is on orange alert with very heavy rain forecast over the next two days. On Monday, Bengaluru saw light drizzles."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/operation-murshidabad-part-2-banned-groups-radical-ngos-fueled-bengal-violence-2730579-2025-05-26",
      "headline": "Operation Murshidabad Part 2: Banned groups, radical NGOs fueled Bengal violenceIndia Today's post-riot investigation into the Murshidabad case has revealed the nexus behind the violence - the role of banned radical groups, radicalised NGOs, and a growing culture of digital and grassroots radicalisation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/himanta-biswa-sarma-assam-bangladesh-chicken-necks-siliguri-corridor-row-muhammad-yunus-2730428-2025-05-26",
      "headline": "Far more vulnerable: Himanta Sarma shares map of Bangladesh's '2 chicken necks'Intensifying his attack on Bangladesh's interim chief Muhammad Yunus, Assam Chief Minister Himanta Biswa Sarma asserted that the neighbouring country has \"two chicken necks\", which are far more vulnerable than India's Chicken Neck, also known as Siliguri Corridor."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-visits-kamakhya-temple-ahead-of-england-tour-2730643-2025-05-26",
      "headline": "Gambhir visits Kamakhya temple in Guwahati to seek blessings for England tourIndian cricket team head coach Gautam Gambhir visited Maa Kamakhya temple in Guwahati ahead of the upcoming tour of England. India are set to play five Tests against England beginning from June 20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-robin-uthappa-comments-on-ms-dhonis-ipl-future-2730620-2025-05-26",
      "headline": "Uthappa comments on Dhoni's IPL Future: His fire to win tournaments still burnsFormer India cricketer-turned commentator Robin Uthappa has shared his thoughts on MS Dhoni's future and said that the fire to win tournaments still burns bright in him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-gujarat-titans-chennai-super-kings-vikram-solanki-press-conference-2730605-2025-05-26",
      "headline": "GT must be better, no two ways around it: Vikram SolankiIPL 2025, GT vs CSK: Gujarat Titans Director of Cricket Vikram Solanki said that his team needs to play better cricket following the heavy 83-run defeat to the Chennai Super Kings on Sunday at the Narendra Modi Stadium in Ahmedabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/vidarbha-hockey-supreme-court-india-plea-2730598-2025-05-26",
      "headline": "Vidarbha's plea for associate membership at Indian Hockey rejectedThe Supreme Court has refused to hear Vidarbha Hockey Association's plea for recognition, citing rules allowing only one state association. It questioned Vidarbha's inaction after derecognition by Maharashtra Hockey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-pbks-vs-mi-will-jacks-full-pre-match-press-conference-2730585-2025-05-26",
      "headline": "I've been given lot of confidence in my bowling by captain and coach: Will JacksMumbai Indians (MI) all-rounder Will Jacks has thanked captain Hardik Pandya and head coach Mahela Jayawardene for instilling confidence in his bowling. Jacks has been handy with the ball in the ongoing IPL 2025 having scalped six wickets from seven innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-gt-vs-csk-sridharan-sriram-full-post-match-press-conference-2730575-2025-05-26",
      "headline": "Delighted to finish season on a winning note: CSK bowling coach after win vs GTChennai Super Kings (CSK) bowling coach Sridharan Sriram was delighted with his team finishing the season on a winning note. CSK beat Gujarat Titans by 83 runs in their last fixture in Ahmedabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-jos-buttler-vikram-solanki-press-conference-2730567-2025-05-26",
      "headline": "Will Jos Buttler's absence affect GT in playoffs? Vikram Solanki opens upIPL 2025, GT vs CSK: On Jos Buttler's departure after the playoffs, Vikram Solanki said that the Gujarat Titans don't depend on one or two individuals. The Titans have roped in Kusal Mendis as Buttler's replacement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-mi-preview-jaipur-conditions-preview-2730560-2025-05-26",
      "headline": "Top spot at stake as Mumbai Indians face off against Punjab KingsMumbai Indians (MI) are set to take on Punjab Kings (PBKS) in an all-important clash of the Indian Premier League 2025 (IPL 2025), which will guarantee a top two finish for either of the sides."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-ajinkya-rahane-press-conference-srh-vs-kkr-2730540-2025-05-26",
      "headline": "Not easy winning a title and then defending it: Ajinkya RahaneIPL 2025: Ajinkya Rahane said that the Knight Riders struggled in the batting department, although their bowlers did reasonably well throughout. On Sunday, the Knights lost to Sunrisers Hyderabad by 110 runs in New Delhi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-preview-carlos-alcaraz-rafael-nadal-2730518-2025-05-26",
      "headline": "Who can challenge Carlos Alcaraz on clay in the post-Nadal era? French Open 2025 ushers in a new era with Carlos Alcaraz poised to defend his crown. With Sinner surging, Djokovic seeking redemption, and dark horses in the mix, Paris is set for a gripping battle to decide the next ruler of Roland Garros."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-kkr-heinrich-klaasen-srh-season-review-2730512-2025-05-26",
      "headline": "SRH's final game serves a reminder of an IPL season that could have beenSRH beat KKR with a scintillating display of batting in their final game of the IPL 2025. The performance served a reminder of the season that could have been for SRH."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-jos-buttler-vikram-solanki-press-conference-2730567-2025-05-26",
      "headline": "Will Jos Buttler's absence affect GT in playoffs? Vikram Solanki opens upIPL 2025, GT vs CSK: On Jos Buttler's departure after the playoffs, Vikram Solanki said that the Gujarat Titans don't depend on one or two individuals. The Titans have roped in Kusal Mendis as Buttler's replacement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-mi-preview-jaipur-conditions-preview-2730560-2025-05-26",
      "headline": "Top spot at stake as Mumbai Indians face off against Punjab KingsMumbai Indians (MI) are set to take on Punjab Kings (PBKS) in an all-important clash of the Indian Premier League 2025 (IPL 2025), which will guarantee a top two finish for either of the sides."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-ajinkya-rahane-press-conference-srh-vs-kkr-2730540-2025-05-26",
      "headline": "Not easy winning a title and then defending it: Ajinkya RahaneIPL 2025: Ajinkya Rahane said that the Knight Riders struggled in the batting department, although their bowlers did reasonably well throughout. On Sunday, the Knights lost to Sunrisers Hyderabad by 110 runs in New Delhi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-preview-carlos-alcaraz-rafael-nadal-2730518-2025-05-26",
      "headline": "Who can challenge Carlos Alcaraz on clay in the post-Nadal era? French Open 2025 ushers in a new era with Carlos Alcaraz poised to defend his crown. With Sinner surging, Djokovic seeking redemption, and dark horses in the mix, Paris is set for a gripping battle to decide the next ruler of Roland Garros."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-kkr-heinrich-klaasen-srh-season-review-2730512-2025-05-26",
      "headline": "SRH's final game serves a reminder of an IPL season that could have beenSRH beat KKR with a scintillating display of batting in their final game of the IPL 2025. The performance served a reminder of the season that could have been for SRH."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}