{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-opening-bell-rally-sensex-opens-267-points-higher-nifty-above-25100-eternal-jumps-10-2759351-2025-07-22",
      "headline": "Sensex opens 267 points higher, Nifty above 25,100; Eternal jumps 10%Sensex opens 267 points higher, Nifty above 25,100; Eternal jumps 10%"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/top-paid-auto-sector-ceo-salary-pawan-munjal-hero-rajiv-bajaj-anish-shah-mahindra-jayadev-galla-2759339-2025-07-22",
      "headline": "Pawan Munjal top paid auto sector CEO in India. Check others on the listHero MotoCorp chairman and managing director Pawan Munjal remained the highest-paid auto sector CEO in FY25. His total pay stood at Rs 109.41 crore, the same as in FY24."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/8th-pay-commission-update-news-government-starts-talks-with-states-ministries-da-hike-salary-news-2759330-2025-07-22",
      "headline": "8th Pay Commission update: Government kickstarts talks with states, ministriesThe government adjusts the salaries of employees and pensioners through dearness allowance (DA), which is reviewed every six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/books/story/mango-millionaire-makes-money-feel-relatable-radhika-gupta-niranjan-awasthi-2758912-2025-07-21",
      "headline": "From Bollywood to dal-chawal, Mango Millionaire makes money feel relatable'Mango Millionaire' turns personal finance into a relatable conversation, using Bollywood, family meals, and everyday metaphors to explain money matters. It's simple, practical, and feels more like advice from a friend than a finance manual."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/louis-vuitton-faces-scrutiny-over-hong-kong-data-leak-2759100-2025-07-21",
      "headline": "Louis Vuitton faces scrutiny over Hong Kong data leakHong Kong's Office of the Privacy Commissioner for Personal Data said on Monday that it has started an investigation into how this happened and whether the company told the authorities on time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/salary-survey-2025-foundit-appraisals-done-not-enough-employees-want-to-change-jobs-2759058-2025-07-21",
      "headline": "Over 85% of employees plan to change jobs after salary hikes in 2025: SurveyMost hikes fell in the 5–10% range, with only a small fraction crossing the 20% mark. Advertising, education, and IT saw the highest share of professionals reporting no hike at all, while sectors like energy and BFSI offered relatively better payouts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-shock-for-karnataka-vendor-raises-concerns-among-small-upi-users-2759049-2025-07-21",
      "headline": "GST shock for Karnataka vendor raises concerns among small UPI usersThe incident shows why small traders might stop taking UPI payments out of fear. Many would rather handle cash than deal with confusing tax demands. This goes against the government's aim of building a cashless economy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/real-estate-homes-under-rs-1-crore-metro-city-property-price-rs-1-crore-new-delhi-mumbai-bangalore-2759033-2025-07-21",
      "headline": "Affordable homes are vanishing. Can you still get a 2BHK under Rs 1 crore?Real estate prices across major metros have surged due to strong demand, high construction costs, and a steady flow of luxury housing projects. Yet, there are still locations in both Tier-1 and Tier-2 cities where a 2BHK under Rs 1 crore is within reach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-gains-442-points-nifty-ends-above-25000-eternal-jumps-over-7-2759031-2025-07-21",
      "headline": "Sensex gains 442 points, Nifty ends above 25,000; Eternal jumps over 7%The S&P BSE Sensex gained 442.61 points to close at 82,200.34, while the NSE Nifty50 added 122.30 points to end at 25,090.70. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/have-not-got-your-tax-refund-yet-here-is-why-it-may-be-delayed-wrong-hra-claims-mismatch-itr-ais-data-2758954-2025-07-21",
      "headline": "Haven't got your tax refund yet? Here's why it may be delayedSometimes, taxpayers claim deductions like HRA or medical insurance without having proper proof. If the tax department finds something suspicious, they may stop your refund and send you a notice for more details."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-now-hosts-over-half-the-worlds-gccs-led-by-bengaluru-2758930-2025-07-21",
      "headline": "India now hosts over half the world's GCCs, led by BengaluruFrom cost-saving outposts to strategic anchors, India's GCC evolution is reshaping global operations. As Tier-2 cities gear up, the next big wave might come from smaller, smarter urban bets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-in-lok-sabha-today-how-it-impacts-you-2758892-2025-07-21",
      "headline": "New income tax bill in Lok Sabha today: How it impacts youThe Bill aims to make clearer rules for exemptions, TDS, TCS, and not-for-profit organisations. All this, the government hopes, will cut down on confusion and save everyone time and trouble."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-fahadh-faasil-nazriya-nazim-hridayapoorvam-moment-2759350-2025-07-22",
      "headline": "Mohanlal, Fahadh and Nazriya's night to remember after viral Hridayapoorvam momentMohanlal, his family, Fahadh Faasil and Nazriya enjoyed a get-together with their friends. This celebration comes after the release of 'Hridayapoorvam' teaser."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/avatar-fire-and-ash-introduces-new-villain-varang-see-first-look-poster-2759327-2025-07-22",
      "headline": "Avatar Fire and Ash introduces new villain Varang. See first look posterThe first-look poster for the much-anticipated film 'Avatar: Fire and Ash' was released on Tuesday. It introduces a new villain, Varang, who will be portrayed by actor Oona Chaplin. The film's trailer will be shown in cinemas with the release of 'The Fantastic Four: First Steps' on July 25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-embraces-femininity-mammootty-gay-kaathal-malayalam-superstars-redefine-heroism-2758928-2025-07-22",
      "headline": "Mohanlal embraces femininity, Mammootty plays gay: How superstars redefine heroismMohanlal wore diamond jewellery and struck feminine poses in a recent commercial for a jewellery brand. Mammootty, on the other hand, was praised for playing a homosexual in 'Kaathal'. The two Malayalam superstars are redefining heroism with inclusive choices.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-twirls-her-way-into-our-hearts-from-london-holiday-with-ranbir-kapoor-2759319-2025-07-22",
      "headline": "Alia Bhatt twirls her way into our hearts from London holiday with Ranbir KapoorAlia Bhatt gave a glimpse of her London holiday with her husband, Ranbir Kapoor, and daughter, Raha Kapoor. Sharing a cute reel, she called herself 'twirl girl'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/siddhant-chaturvedi-triptii-dimri-dhadak-2-eyes-august-1-release-to-clash-with-ajay-devgn-son-of-sardaar-2-2759313-2025-07-22",
      "headline": "Siddhant-Triptii's Dhadak 2 eyes August 1 release, to clash with Son of Sardaar 2Amid reports of speculation, Siddhant Chaturvedi and Triptii Dimri's 'Dhadak 2' will release on August 1. The makers confirmed the film's release date along with the release of the second single."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sushmita-sen-ex-rohman-shawl-gift-22-carat-diamond-meri-aukaat-nahi-bollywood-2759178-2025-07-21",
      "headline": "Sushmita Sen's ex Rohman on gifting her the diamond she wants: Meri aukaat nahiActor Rohman Shawl recently opened up about ex-Sushmita Sen's love for diamonds. He also spoke about the possibility of gifting expensive diamonds to Sushmita. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saiyaara-bts-video-ahaan-panday-aneet-share-warm-moments-mohit-suri-emotional-2759143-2025-07-21",
      "headline": "Ahaan Panday-Aneet share warm moments as Mohit Suri tears up in Saiyaara BTS videoA viral video from the last day shoot of 'Saiyaara' captures director Mohit Suri getting emotional. The BTS clip also shows actors Ahaan Panday and Aneet Padda in a warm hug. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/farah-khan-sponsors-her-cook-dilips-childrens-english-medium-education-2759182-2025-07-21",
      "headline": "Farah Khan sponsors her cook Dilip's children's English-medium educationFarah Khan shared in her vlog that she is supporting her cook Dilip's children by enrolling them in an English-medium school and getting one of them a culinary diploma. She said that her aim is to help them build a better future and work in good places instead of doing domestic work."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/blackpink-jisoo-wins-outstanding-asian-star-newtopia-seoul-drama-awards-2759180-2025-07-21",
      "headline": "BLACKPINK's Jisoo wins outstanding Asian star at Seoul Drama AwardsJisoo has bagged her first major acting award for 'Newtopia', earning the title of Outstanding Asian Star. Her win has sent BLACKPINK fans into a celebratory frenzy online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kalki-koechlin-recalls-casting-couch-experiences-2759139-2025-07-21",
      "headline": "Kalki Koechlin recalls casting couch experiences, says producer wanted to know meKalki Koechlin opened up about her personal experiences with casting couch incidents, both before and after joining the film industry. She highlighted how such encounters have a lasting impact and emphasised the need to acknowledge and address them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/prithviraj-sukumaran-patriotism-pride-indian-sarzameen-jiocinema-premiere-2759133-2025-07-21",
      "headline": "Prithviraj Sukumaran on patriotism: I am proud of the fact that I am IndianPrithviraj Sukumaran expresses his strong pride in being Indian and redefines patriotism. His upcoming film 'Sarzameen' explores themes of national duty and personal sacrifice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tara-sutaria-veer-pahariyas-my-and-mine-game-on-instagram-sparks-dating-rumours-2759066-2025-07-21",
      "headline": "Tara Sutaria-Veer Pahariya's my and mine game on Instagram sparks dating rumoursActor Tara Sutaria's reply to Veer Pahariya's comment has sparked dating rumours. Fans speculate that it is more than friendship."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/television/story/mannara-chopra-returns-to-work-after-father-death-shares-emotional-note-2759003-2025-07-21",
      "headline": "Mannara Chopra returns to work after father's death, shares emotional noteMannara Chopra returned to work and social media after the recent death of her father, sharing an emotional note about grief and strength. Despite the pain, she expressed gratitude for the support and said she's posting again as part of her professional journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kriti-sanon-dreamy-cruise-holiday-with-rumoured-boyfriend-kabir-bahia-2758893-2025-07-21",
      "headline": "Kriti Sanon enjoys dreamy cruise vacation - with Kabir Bahia?Kriti Sanon shared stunning photos from her French cruise holiday, and the internet took notice after entrepreneur Kabir Bahia posted similar pictures from the same location. Though they didn't appear together, fans quickly connected the dots, sparking fresh buzz online."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actor-silambarasan-offers-financial-aid-to-late-stuntman-mohan-rajs-family-2759128-2025-07-21",
      "headline": "Actor Silambarasan offers financial aid to late stuntman Mohan Raj's familyAfter veteran stuntman Mohan Raj tragically lost his life while performing a dangerous car stunt for Pa. Ranjith's 'Vettuvam', actor Silambarasan TR stepped in with a heartfelt gesture. Even though he wasn't associated with the film, Silambarasan quietly extended financial help to the late stuntman's family. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-v-and-jungkook-sojang-defamation-case-trial-2759037-2025-07-21",
      "headline": "BTS' V and Jungkook's Sojang defamation case moves to trialThe defamation suit filed by BTS members V and Jungkook against YouTuber Sojang is now set to undergo court-led mediation. However, chances of arriving at a mutually agreeable resolution appear slim."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/5-most-popular-anime-villains-with-tragic-backstories-naruto-attack-on-titan-2758974-2025-07-21",
      "headline": "5 most popular anime villains with tragic backstories that deserve tears, not hateFrom Naruto to Attack on Titan, these anime villains prove that evil isn't always black and white; sometimes, it's heartbreak in disguise. See which anime villain's backstory is your favourite.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-ruth-prabhu-return-telugu-cinema-nandini-reddy-social-drama-2759085-2025-07-21",
      "headline": "Samantha to return to Telugu cinema with Nandini Reddy's film: ReportSamantha Ruth Prabhu, who was last seen in a full-fledged role in Telugu cinema in 2023's 'Khushi' starring Vijay Deverakonda, will be making a comeback with a project backed by her production company, Tralala Moving Pictures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/uorfi-javed-gets-lip-fillers-dissolved-after-9-years-shares-video-of-swollen-face-2759104-2025-07-21",
      "headline": "Uorfi Javed gets lip fillers dissolved after 9 years, shares video of swollen faceUorfi Javed shared a video of her swollen face after getting her lip fillers removed, sharing the pain and challenges of the procedure. Fans praised her honesty, while others expressed concern and urged empathy for her choices."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/vice-president-jagdeep-dhankar-resigns-health-reasons-political-speculation-congress-india-bloc-parliament-lok-sabha-rajya-sabha-monsoon-2759318-2025-07-22",
      "headline": "Despite frequent run-ins, why Veep's surprise exit left Opposition in disbeliefVice President Jagdeep Dhankhar's sudden resignation citing health reasons has taken both the ruling and opposition parties by surprise. The unexpected move has triggered intense speculation and prompted swift strategic huddles among political leaders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/bihar-sir-voter-list-revision-citizenship-aadhaar-election-commission-supreme-court-2759322-2025-07-22",
      "headline": "Exclusion from Bihar voter roll won't affect citizenship: Poll body to top courtThe Election Commission's response was to charges by the opposition that the SIR in Bihar was a 'citizenship screening' exercise and would lead to mass disenfranchisement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/vice-president-jagdeep-dhankhar-resigns-citing-health-reasons-2759221-2025-07-21",
      "headline": "Vice President Jagdeep Dhankhar resigns on Day 1 of Monsoon Session, cites healthServing as Vice President since 2022, the 74-year-old made the surprise announcement after chairing the first day of the Monsoon Session in Rajya Sabha. Under Article 67 of the Constitution, the Deputy Chairman will manage the day-to-day affairs until a new Vice-President is elected."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/bangladesh-air-force-aircraft-crashes-on-school-building-in-dhaka-during-training-sortie-many-feared-dead-2758970-2025-07-21",
      "headline": "20 dead as Bangladesh Air Force jet crashes into Dhaka schoolA China-made F-7 training jet of the Bangladesh Air Force crashed into a school in Dhaka, killing 20 people and injuring 171 others. A one-day state mourning was declared on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/in-narendra-modis-kali-durga-stage-cry-a-new-bjp-vocabulary-for-bengal-2759065-2025-07-21",
      "headline": "In Modi's 'Kali-Durga' stage-cry, a new BJP vocabulary for Bengal?Ram-centric Hindutva not delivering to promise, so the BJP's pivot to foreground Bengal's most-revered deities to culturally align itself to the softer Hindu voter"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-india-delhi-kolkata-flight-with-160-onboard-aborts-take-off-due-to-technical-snag-checks-underway-2759189-2025-07-21",
      "headline": "Another Air India scare: Pilots slam brakes, abort take-off last moment in DelhiAir India flight AI 2403 from Delhi to Kolkata aborted take-off due to a technical snag. All 160 passengers were safely disembarked, and the flight is rescheduled for later today.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/vice-president-jagdeep-dhankhar-resigns-health-reasons-political-speculation-2759294-2025-07-22",
      "headline": "Far more than meets the eye: Opposition stunned by Jagdeep Dhankhar's resignationSenior Congress leader Jairam Ramesh said while Jagdeep Dhankhar's health should indeed be prioritised, there were suspicions of underlying motives for his resignation. Ramesh, however, cautioned against any speculation at this stage, emphasising the need for clarity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/decades-before-epsteins-arrest-accuser-maria-farmer-told-fbi-to-investigate-trump-report-glbs-2759298-2025-07-22",
      "headline": "Kept staring at my legs: Epstein accuser recalls late-night encounter with TrumpAccording to Farmer, Trump stood over her, staring at her legs. Epstein then walked in and told Trump, \"No, no. She's not here for you.\" The two men left the room, and Farmer said she overheard Trump say he thought she was 16 years old."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-embraces-femininity-mammootty-gay-kaathal-malayalam-superstars-redefine-heroism-2758928-2025-07-22",
      "headline": "Mohanlal embraces femininity, Mammootty plays gay: How superstars redefine heroismMohanlal wore diamond jewellery and struck feminine poses in a recent commercial for a jewellery brand. Mammootty, on the other hand, was praised for playing a homosexual in 'Kaathal'. The two Malayalam superstars are redefining heroism with inclusive choices.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/ssvm-institutions-from-cradle-to-cosmos-2754432-2025-07-11",
      "headline": "SSVM Institutions: From Cradle to CosmosForging Futures with Foresight, Flair, and Faith"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indian-government-pursues-safe-release-of-kidnapped-ranjit-singh-in-niger-2759324-2025-07-22",
      "headline": "Making all efforts to free Indian national kidnapped in Niger: Union MinisterAn Indian national, Ranjit Singh, has been reported missing in Niger after an attack that claimed the lives of two others. Efforts are underway to ensure his safe and early release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/andhra-pradesh-it-minister-nara-lokesh-amid-language-row-telugu-people-coolest-speak-only-development-2759174-2025-07-21",
      "headline": "Telugu people are the coolest: Nara Lokesh says development our only languageIn response to being called the \"coolest politician in India right now,\" Andhra Pradesh's IT Minister Nara Lokesh said it is not him, but the Telugu people who are the coolest. He added that everyone who speaks the language of development is welcome in the state, winning a lot of hearts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/cm-punk-rhea-ripley-netflix-unreal-john-cena-aj-lee-return-2759224-2025-07-22",
      "headline": "Punk, Ripley keep it Unreal: WWE stars on Netflix docuseries, Cena and moreIn an exclusive interaction with India Today, CM Punk and Rhea Ripley showed off their real-life personas and talked about WWE's new docuseries on NetFlix, John Cena and the return of AJ Lee to the company. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/dog-lovers-vs-the-rest-supreme-court-remark-on-dogs-stray-dog-divide-now-harder-to-bridge-2759106-2025-07-21",
      "headline": "'Feed them at home?' That one line has dog lovers fuming and whyThe Supreme Court on Tuesday, while hearing a plea alleging harassment over the feeding of community dogs in Noida, asked the petitioner, \"Why don't you feed them in your own house?\" Can the remark widen the divide between dog lovers and 'the rest'?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/scientists-decode-molecular-secret-behind-hair-loss-regrowth-without-transplant-2759077-2025-07-21",
      "headline": "New hair loss discovery from India could end the need for transplantsThey found five key systems in the body that manage the hair growth cycle. In people with hair loss, these systems stop talking to each other properly, causing hair follicles to \"go to sleep.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/gita-gopinath-to-leave-imf-in-august-return-to-harvard-as-professor-glbs-2759299-2025-07-22",
      "headline": "Gita Gopinath to leave IMF in August, return to Harvard as professorGopinath will become the inaugural Gregory and Ania Coffey Professor of Economics in Harvard's Department of Economics. She first joined the IMF in 2019 as Chief Economist. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/avatar-fire-and-ash-introduces-new-villain-varang-see-first-look-poster-2759327-2025-07-22",
      "headline": "Avatar Fire and Ash introduces new villain Varang. See first look posterThe first-look poster for the much-anticipated film 'Avatar: Fire and Ash' was released on Tuesday. It introduces a new villain, Varang, who will be portrayed by actor Oona Chaplin. The film's trailer will be shown in cinemas with the release of 'The Fantastic Four: First Steps' on July 25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-us-trade-deal-stalemate-continues-talks-to-resume-in-august-sources-2759204-2025-07-21",
      "headline": "India-US trade deal stalemate continues, talks to resume in August: SourcesIndian negotiators recently returned from Washington after the fifth round of trade talks. Despite extensive dialogue, no formal announcement has been made as the August 1 tariff pause deadline approaches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/two-suspects-involved-in-bihar-gangster-chandan-mishra-hospital-murder-injured-in-encounter-with-police-in-arrah-2759334-2025-07-22",
      "headline": "2 suspects, involved in Bihar gangster's murder, injured in police encounterChandan Mishra, a resident of Buxar district, was serving his sentence in Beur Jail and had gone to the hospital for treatment when he was shot dead by a group of five armed men. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/what-rivals-ideate-nitish-kumar-inks-the-script-behind-the-bihar-election-sop-story-2025-bihar-assembly-elections-2759029-2025-07-21",
      "headline": "What rivals ideate, Nitish inks: The script behind the Bihar election sop storyCall him a borrower of plans or a master of the political long game, Nitish Kumar may well be turning Opposition blueprints into a poll-winning manifesto of his own"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-virat-kohli-manoj-tiwary-england-vs-india-2759315-2025-07-22",
      "headline": "Captain Gill trying to copy Kohli with aggression: Ex-India cricketerFormer India cricketer Manoj Tiwary criticised Shubman Gill and claimed the current Test captain is trying to copy Virat Kohli's aggression on the field. Gill was at the centre of controversy when he had run-ins with England players during Lord's Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/fk-him-hunter-biden-blasts-george-clooney-over-fathers-exit-from-2024-race-glbs-2759311-2025-07-22",
      "headline": "F**k him: Hunter Biden blasts George Clooney over father's exit from 2024 raceHunter's comments mark the first time a member of the Biden family has so explicitly addressed the wave of Democratic pressure -- including from party insiders and celebrities -- that led Joe Biden to end his re-election bid just months before the 2024 vote."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kerala-muslim-majority-2040-claim-sndp-natesan-sparks-political-row-cpim-congress-iulm-bjp-2759035-2025-07-21",
      "headline": "Kerala will be Muslim majority by 2040: How a claim got non-BJP parties sparringA claim by Vellappally Natesan, leader of the social service body SNDP representing the Ezhava community, that Muslims would form a majority in Kerala by 2040, has triggered a political row in the state. With the BJP watching from the sidelines, rivals CPI(M), which traditionally draws support from the Ezhava community, and the Congress and the Muslim League, are locked in a battle just ahead of the Assembly polls."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjp-sanjay-jaiswal-rahul-gandhi-slams-monsoon-session-parliament-gagged-2759302-2025-07-22",
      "headline": "BJP MP's 'arrogant' swipe at Rahul Gandhi after he claims being gaggedAfter Rahul Gandhi claimed he was not allowed to speak in Parliament despite being Leader of Opposition in Lok Sabha, BJP MP Sanjay Jaiswal slammed the Congress leader and called him arrogant."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-fahadh-faasil-nazriya-nazim-hridayapoorvam-moment-2759350-2025-07-22",
      "headline": "Mohanlal, Fahadh and Nazriya's night to remember after viral Hridayapoorvam momentMohanlal, his family, Fahadh Faasil and Nazriya enjoyed a get-together with their friends. This celebration comes after the release of 'Hridayapoorvam' teaser."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/avatar-fire-and-ash-introduces-new-villain-varang-see-first-look-poster-2759327-2025-07-22",
      "headline": "Avatar Fire and Ash introduces new villain Varang. See first look posterThe first-look poster for the much-anticipated film 'Avatar: Fire and Ash' was released on Tuesday. It introduces a new villain, Varang, who will be portrayed by actor Oona Chaplin. The film's trailer will be shown in cinemas with the release of 'The Fantastic Four: First Steps' on July 25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-embraces-femininity-mammootty-gay-kaathal-malayalam-superstars-redefine-heroism-2758928-2025-07-22",
      "headline": "Mohanlal embraces femininity, Mammootty plays gay: How superstars redefine heroismMohanlal wore diamond jewellery and struck feminine poses in a recent commercial for a jewellery brand. Mammootty, on the other hand, was praised for playing a homosexual in 'Kaathal'. The two Malayalam superstars are redefining heroism with inclusive choices.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-twirls-her-way-into-our-hearts-from-london-holiday-with-ranbir-kapoor-2759319-2025-07-22",
      "headline": "Alia Bhatt twirls her way into our hearts from London holiday with Ranbir KapoorAlia Bhatt gave a glimpse of her London holiday with her husband, Ranbir Kapoor, and daughter, Raha Kapoor. Sharing a cute reel, she called herself 'twirl girl'."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/cm-punk-rhea-ripley-netflix-unreal-john-cena-aj-lee-return-2759224-2025-07-22",
      "headline": "Punk, Ripley keep it Unreal: WWE stars on Netflix docuseries, Cena and moreIn an exclusive interaction with India Today, CM Punk and Rhea Ripley showed off their real-life personas and talked about WWE's new docuseries on NetFlix, John Cena and the return of AJ Lee to the company. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-sign-bryan-mbeumo-reaction-brentford-premier-league-2759328-2025-07-22",
      "headline": "Bryan Mbeumo completes Manchester United move: Club of my dreamsBryan Mbeumo has completed a £71 million transfer to Manchester United. The signing signals a major rebuild under Ruben Amorim amid high expectations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harry-brook-brendon-mccullum-england-vs-india-lords-2759333-2025-07-22",
      "headline": "No more nice guys: Brook on how McCullum encouraged England at Lord'sENG vs IND: Harry Brook said how Brendon McCullum motivated England not to be the guys in the Lord's Test, which the home team narrowly won by 22 runs to go 2-1 up in the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/brydon-carse-england-lords-test-2759320-2025-07-22",
      "headline": "England showed at Lord's that they can adapt and adjust: Brydon CarseENG vs IND: Brydon Carse said that England were happy with their approach in the Lord's Test, which they had won by 22 runs to take a crucial 2-1 lead in the five-match series. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-virat-kohli-manoj-tiwary-england-vs-india-2759315-2025-07-22",
      "headline": "Captain Gill trying to copy Kohli with aggression: Ex-India cricketerFormer India cricketer Manoj Tiwary criticised Shubman Gill and claimed the current Test captain is trying to copy Virat Kohli's aggression on the field. Gill was at the centre of controversy when he had run-ins with England players during Lord's Test. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/badminton/story/6-indian-badminton-players-out-of-world-university-games-over-administrative-lapse-2759279-2025-07-21",
      "headline": "6 Indian badminton players out of World University Games over admin lapseThe Indian badminton team that won mixed team bronze at the World University Games is facing controversy over player selection. Administrative errors barred six players from competing, prompting demands for accountability and justice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-manchester-test-rishabh-pant-fitness-akash-deep-injury-2759255-2025-07-21",
      "headline": "Pant shakes off injury concerns, Akash Deep all but out of Manchester TestRishabh Pant has shaken off injury concerns and took part in batting and wicketkeeping sessions as the Indian team's preparations for the Manchester Test was in full flow on Monday, July 21. However, Akash Deep seems to be all but ruled out of the match as the pacer continues to struggle with a groin issue. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/england-vs-india-mohammed-siraj-workload-management-manchester-test-2759231-2025-07-21",
      "headline": "Mohammed Siraj on workload management chatter: Almighty has kept me healthyMohammed Siraj has brushed aside talk about workload management, saying that he is focused on making most of the opportunity presented to him. Siraj has played all the matches so far in the series and has bowled a total of 109 overs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-playing-xi-liam-dawson-return-manchester-test-2759208-2025-07-21",
      "headline": "Liam Dawson returns after 8 years as England announce Manchester Test lineupLiam Dawson has made a return to the England Test team lineup after a gap of eight years as the hosts revealed their playing XI for the match against India in Manchester on Monday, July 18. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/eng-vs-ind-harry-brook-joe-root-best-test-batter-all-time-2759201-2025-07-21",
      "headline": "Not in the same league: Brook hails Root as best Test batter of all-timeHarry Brook opened up on the ongoing tussle in the ICC rankings between himself and Joe Root. Whilst he may be close to taking the number one spot, he acknowledged Joe Root as the best Test batter of all-time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-jasprit-bumrah-harry-brook-england-lords-test-payback-2759196-2025-07-21",
      "headline": "Bumrah bowled one over: Brook on England's moment of payback at Lord'sHarry Brook reveaed that it was that one over by Jasprit Bumrah on Day 3 that lit a fire in England's belly as they went on to give it back to India to take the win at Lord's. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-manchester-test-rishabh-pant-fitness-akash-deep-injury-2759255-2025-07-21",
      "headline": "Pant shakes off injury concerns, Akash Deep all but out of Manchester TestRishabh Pant has shaken off injury concerns and took part in batting and wicketkeeping sessions as the Indian team's preparations for the Manchester Test was in full flow on Monday, July 21. However, Akash Deep seems to be all but ruled out of the match as the pacer continues to struggle with a groin issue. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/england-vs-india-mohammed-siraj-workload-management-manchester-test-2759231-2025-07-21",
      "headline": "Mohammed Siraj on workload management chatter: Almighty has kept me healthyMohammed Siraj has brushed aside talk about workload management, saying that he is focused on making most of the opportunity presented to him. Siraj has played all the matches so far in the series and has bowled a total of 109 overs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-playing-xi-liam-dawson-return-manchester-test-2759208-2025-07-21",
      "headline": "Liam Dawson returns after 8 years as England announce Manchester Test lineupLiam Dawson has made a return to the England Test team lineup after a gap of eight years as the hosts revealed their playing XI for the match against India in Manchester on Monday, July 18. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/eng-vs-ind-harry-brook-joe-root-best-test-batter-all-time-2759201-2025-07-21",
      "headline": "Not in the same league: Brook hails Root as best Test batter of all-timeHarry Brook opened up on the ongoing tussle in the ICC rankings between himself and Joe Root. Whilst he may be close to taking the number one spot, he acknowledged Joe Root as the best Test batter of all-time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-jasprit-bumrah-harry-brook-england-lords-test-payback-2759196-2025-07-21",
      "headline": "Bumrah bowled one over: Brook on England's moment of payback at Lord'sHarry Brook reveaed that it was that one over by Jasprit Bumrah on Day 3 that lit a fire in England's belly as they went on to give it back to India to take the win at Lord's. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}