{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-layoffs-ai-automation-or-not-ceo-k-krithivasan-statement-skill-mismatch-2762417-2025-07-28",
      "headline": "Is TCS cutting jobs because of AI? Here's what CEO K Krithivasan saysTCS CEO K Krithivasan said that the company is still looking for highly skilled professionals, especially those who can support TCS's plans to expand into new technologies and markets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/what-homeowners-need-to-know-about-house-property-tax-rules-explains-tax-advisor-2762379-2025-07-28",
      "headline": "What homeowners need to know about house property tax rules, explains tax advisorBuying a home comes with more than just EMIs and maintenance; it brings tax implications too. Sujit Bangar, Founder of TaaxBuddy.com, breaks down the key rules every homeowner should be aware of to avoid surprises during filing season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/new-income-tax-bill-2025-3-key-changes-that-could-make-itr-filing-easier-2762342-2025-07-28",
      "headline": "New Income Tax Bill 2025: 3 key changes that could make ITR filing easierThe committee submitted its report to Parliament on 21 July. It's over 4,500 pages long and includes 285 suggestions to improve the draft New Income Tax Bill, 2025, which is meant to replace the old 1961 Act. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/blusmart-wallet-refund-90-day-period-lapse-app-not-working-fraud-sebi-jaggi-brothers-2762313-2025-07-28",
      "headline": "Have you got your BluSmart refund yet? It's been 90 daysBluSmart wallet refund: As July comes to an end, users say they have not received their money back and are struggling to even access the app."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/kotak-mahindra-bank-share-price-decline-reason-q1-results-analyst-views-2762288-2025-07-28",
      "headline": "Explained: Why Kotak Mahindra Bank share price fell over 6% todayThe decline came after the private lender posted a weaker-than-expected set of results for the April–June quarter. The stock decline comes in the wake of a 7% year-on-year drop in standalone net profit to Rs 3,282 crore, even though the bank reported steady growth in core lending activity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-over-300-points-lower-nifty-below-24800-kotak-bank-down-4-percent-2762275-2025-07-28",
      "headline": "Sensex opens over 300 points lower, Nifty below 24,800; Kotak Bank down 4%The S&P BSE Sensex was down by 225.28 points to 81,237.81, while the NSE Nifty50 lost 43.60 points to 24,793.40 as of 9:30 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/samsung-chip-deal-tesla-usd-165-billion-deal-share-price-jump-ai-2762270-2025-07-28",
      "headline": "Samsung to power Tesla's future with $16.5 billion chip deal: ReportThis long-term contract comes at a crucial time for Samsung. While the company is one of the world's biggest makers of memory chips, its foundry business, which produces chips for other companies, has struggled to keep up with demand and competition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/krutrim-layoffs-bhavish-aggarwal-ola-100-employees-second-round-job-cuts-report-2762254-2025-07-28",
      "headline": "Bhavish Aggarwal's Krutrim lays off over 100 employees in fresh job cuts: ReportThe layoffs at Krutrim affected a large part of the firm's linguistics team, which had only recently joined the company."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/gng-electronics-ipo-allotment-status-registrar-bishare-bse-website-gmp-today-listing-date-2762239-2025-07-28",
      "headline": "GNG Electronics IPO allotment out. Here's how to check status, what GMP signalsInvestors who applied for the IPO can check the allotment status through two official platforms: the BSE website and the website of the IPO registrar, Bigshare Services Pvt Ltd."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-layoff-job-cut-12000-what-it-company-offer-to-affected-employees-updated-hr-policy-ai-2762192-2025-07-27",
      "headline": "TCS layoff: What the company is offering to 12,000 affected employeesTCS job cut: The move is part of a broader plan to adapt to changing technology trends and streamline operations as the company aims to become a \"future-ready\" organisation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-uk-free-trade-agreement-boosts-exports-future-trade-deals-2762144-2025-07-27",
      "headline": "We negotiate confidently: Minister's signal to US after landmark UK trade pactIndia has signed a landmark free trade agreement with the UK, marking a new phase in bilateral economic ties. The government aims to use this momentum to secure future deals with the US and other key partners."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sona-blw-comstar-board-agm-vs-sunjay-kapur-mother-rani-over-shareholding-director-appointment-2761991-2025-07-27",
      "headline": "A will, a letter, and a brewing dispute: Sunjay Kapur's mother vs Sona ComstarAs Sunjay Kapur's mother takes on Sona Comstar, the unfolding dispute could shape into a high-stakes clash of legacy, legality, and loss in one of India's storied business families."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/joint-home-loan-or-personal-loan-what-smarter-for-young-couples-buying-property-tax-benefits-joint-home-loan-2761973-2025-07-27",
      "headline": "Joint home loan or personal loan? What's smarter for young couples buying propertyBuying your first home as a couple is exciting, but figuring out how to finance it? That's where things get tricky. Should you go for a joint home loan or take a personal loan? Let's break it down."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-formula-1-racing-dream-taxation-roadblock-motorsport-entertainment-tax-2761667-2025-07-26",
      "headline": "How taxes drove Formula 1 out of IndiaFormula 1 didn't leave India because of a lack of fans or infrastructure. It left because of unclear policies, tax confusion, and a system that didn't treat it like a sport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/meta-hires-chatgpt-co-creator-as-chief-scientist-to-lead-new-ai-lab-glbs-2761556-2025-07-26",
      "headline": "Meta hires ChatGPT co-creator as chief scientist to lead new AI labMeta has appointed ChatGPT co-creator Shengjia Zhao as chief scientist of its new Superintelligence Lab, aiming to advance AGI and regain AI leadership after Llama 4's weak performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/explained-why-india-uk-free-trade-agreement-is-a-big-deal-for-both-nations-2761520-2025-07-25",
      "headline": "Explained: Why India-UK free trade agreement is a big deal for both nationsIndia and the United Kingdom have formally sealed a Comprehensive Economic and Trade Agreement, a deal described as the \"biggest, most economically significant trade deal that the UK has made since leaving the EU.\" "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sona-comstar-denies-coercion-claims-by-sunjay-kapurs-mother-defends-agm-2761391-2025-07-25",
      "headline": "Not a shareholder, no coercion: Sunjay Kapur's firm counters mother's chargesThe clarification comes after it was reported that Rani Kapur had written a letter to delay the AGM and alleged that she was made to sign documents shortly after her son's death."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-uk-free-trade-agreement-hailed-as-key-post-brexit-success-by-the-british-media-2761344-2025-07-25",
      "headline": "Remainers will choke on their cornflakes: British media hails India trade dealThe India-UK Free Trade Agreement (FTA) or the Comprehensive Economic and Trade Agreement (CETA) seeks to enhance bilateral trade by around USD 34 billion annually, besides ensuring better market access."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ftas-with-eu-us-in-talks-says-commerce-secretary-after-india-uk-trade-deal-2761327-2025-07-25",
      "headline": "FTAs with EU, US in talks, says Commerce Secretary after India-UK trade dealThe agreement now needs to pass through both houses of the British Parliament. A special committee will study it before giving final approval."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/influencer-salary-insta-reels-economy-trending-online-vlogging-career-youtube-2761297-2025-07-25",
      "headline": "Everyone wants to be an influencer. But can it pay the bills?The creator economy in India is booming, but the economics remain shaky. What started as a hobby or side hustle for many is now a full-time hustle, and an increasingly competitive one."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-721-points-lower-nifty-below-24900-bajaj-finance-falls-5-2761243-2025-07-25",
      "headline": "Sensex ends 721 points lower, Nifty below 24,900; Bajaj Finance falls 5%The S&P BSE Sensex was down 721.08 points to 81,463.09 at the closing bell, while the NSE Nifty50 declined 225.10 points to trade at 24,837. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/rani-kapur-urges-agm-delay-at-sona-blw-after-son-sunjay-kapurs-death-2761168-2025-07-25",
      "headline": "Sunjay Kapur's mother alleges business coercion, attempt to 'usurp family legacy'Rani Kapur has publicly objected to what she calls an \"inappropriate and premature\" AGM, held during a period of deep mourning, and raised serious concerns over how decisions are being made in the aftermath."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-uk-fta-trade-deal-what-is-dcc-how-helps-indian-workers-more-jobs-2761167-2025-07-25",
      "headline": "This key agreement in UK trade deal will hugely benefit Indian firms, workersOne of the key parts of the India-UK trade deal is the introduction of the Double Contribution Convention (DCC), which is expected to help Indian professionals working in the UK by reducing their social security burden."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filing-itr-under-old-regime-claim-these-5-home-loan-tax-benefits-new-tax-regime-2761154-2025-07-25",
      "headline": "Filing ITR under old regime? Claim these 5 home loan tax benefits If you are sticking to the old tax regime this year, make sure you don't miss out on the big tax savings your home loan can offer. Here are five home loan benefits you must know for your ITR. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/who-has-to-file-itr-by-when-all-2025-deadlines-explained-income-tax-filing-2761076-2025-07-25",
      "headline": "Who has to file ITR by when? All 2025 deadlines explainedFiling your ITR on time can save you from paying extra penalties. But not everyone has the same deadline this year. Here's a quick look at who must file by when for the 2025 cycle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-400-points-why-stock-markets-are-in-the-red-today-2761014-2025-07-25",
      "headline": "Sensex tumbles over 700 points: Why stock markets are in the red today The benchmark S&P BSE Sensex fell 624.64 points to 81,559.53 by 10:41 am, while the NSE Nifty50 slipped 215.85 points to 24,846.25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/iex-share-price-gain-11-percent-why-reason-q1-results-indian-energy-exchange-stock-up-2761005-2025-07-25",
      "headline": "Explained: Why IEX share price gained 11% todayIEX stock opened at Rs 137.00 today, higher than the previous close of Rs 132.45. It climbed further to touch a high of Rs 149.45 in morning trade. As of 9:37 am, the share was trading at Rs 146.80, up 10.84%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/explained-why-bajaj-finance-shares-tumbled-up-to-6-percent-despite-strong-q1-results-2761000-2025-07-25",
      "headline": "Explained: Why Bajaj Finance shares tumbled 6% despite strong Q1 resultsThe Bajaj Finance stock was down 5.42% at Rs 907 on the BSE at around 9:28 am, while Bajaj Finserv also fell nearly 5%. Bajaj Finance touched an intraday low of Rs 898.10, marking a 6.3% decline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nsdl-ipo-check-price-band-gmp-key-dates-issue-size-and-more-2760994-2025-07-25",
      "headline": "NSDL IPO: Check price band, GMP, key dates, issue size and moreThe IPO, a pure offer for sale, aims to raise Rs 4,011 crore. It will open for subscription on July 30 and close on August 1, with anchor bids starting a day earlier on July 29."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-falls-300-points-at-opening-nifty-below-25000-bajaj-finance-tanks-5-percent-2760986-2025-07-25",
      "headline": "Sensex falls 300 points at opening, Nifty below 25,000; Bajaj Finance tanks 5%The S&P BSE Sensex was down by 389.42 points to 81,794.75, while the NSE Nifty50 lost 133.70 points to 24,928.40 as of 9:25 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/iex-share-price-q1-results-indian-energy-exchange-stock-in-focus-why-cerc-market-coupling-2760976-2025-07-25",
      "headline": "IEX stock: Indian Energy Exchange shares to be in focus today. Here's whyIEX shares fell sharply on Thursday, July 24. The stock dropped as much as 28% and touched a 52-week low of Rs 135.26 on the BSE. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/intel-layoffs-25000-job-cut-ceo-lip-bu-tan-chipmaker-cost-cutting-tech-roles-us-report-restructuring-2760964-2025-07-25",
      "headline": "Intel layoffs: 25,000 roles at risk as company braces for big reset, says reportIn a letter to employees, Intel's new CEO Lip-Bu Tan acknowledged the difficult period the company is going through."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/google-microsoft-tech-hiring-in-us-donald-trump-warning-indians-ai-race-america-first-policy-2760959-2025-07-25",
      "headline": "Why Donald Trump doesn't want Google, Microsoft to hire IndiansSpeaking at an AI Summit in Washington on Wednesday, Donald Trump said American companies must now put national interest first, especially in the fast-growing field of artificial intelligence."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/kristin-cabot-resigns-from-astronomer-after-viral-coldplay-kiss-cam-scandal-glbs-2760932-2025-07-25",
      "headline": "Kristin Cabot, Astronomer HR head, resigns after viral Coldplay kiss-cam scandalAstronomer's HR chief Kristin Cabot resigned days after being caught on a Coldplay kiss-cam with CEO Andy Byron, who also stepped down earlier amid the viral scandal and public backlash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sunder-pichai-net-worth-hits-usd-1-billion-alphabet-shares-rise-quarterly-results-google-ceo-money-salary-2760915-2025-07-25",
      "headline": "Billionaire behind your browser: Sundar Pichai's net worth crosses $1 billionAlphabet stock has returned around 120% to investors since 2023 and is now trading close to its all-time high. This has benefited top executives, including Sundar Pichai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-uk-free-trade-deal-how-the-deal-could-boost-bilateral-trade-2760706-2025-07-24",
      "headline": "India-UK free trade deal: How the deal could boost bilateral tradeThe deal is expected to provide greater market access for Indian products and services, while UK companies, particularly in sectors like automobiles and medical equipment, will also benefit from reduced tariffs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-some-purchases-are-priceless-startup-founder-shyam-achuthan-on-spending-and-living-well-2760739-2025-07-24",
      "headline": "Why some purchases are priceless: Startup founder on spending and living wellWe often treat money decisions like maths problems, but this startup founder says some buys, like a family car or your own home, bring wealth you can't count."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/pm-modi-in-uk-for-fta-cheaper-scotch-and-cars-on-cards-2760695-2025-07-24",
      "headline": "PM Modi in UK for FTA: Cheaper scotch and cars on cardsPrime Minister Narendra Modi is in the UK for a meeting with the UK Prime Minister and is also expected to meet King Charles III, with the India-UK Free Trade Agreement (FTA) being the main focus. This agreement is set to provide significant market access to Indian sectors like fisheries, textiles, gems, jewellery, and leather, with a potential market size of $5.2 billion in the UK for the fisheries sector alone. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/money-matters-but-joy-matters-more-edelweiss-mutual-fund-radhika-gupta-mantra-for-life-2760708-2025-07-24",
      "headline": "Money matters, but joy matters more: Edelweiss' Radhika Gupta's mantra for lifeMany young earners feel constant pressure to save every rupee for the future. It's common to hear advice about building a fat retirement fund or aiming for the highest returns. But Radhika Gupta wants people to know that money is only useful if it also makes your present better."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sanjay-dutt-on-bond-with-salman-khan-arshad-warsi-2762444-2025-07-28",
      "headline": "Sanjay Dutt opens up about bond with Salman Khan and Arshad Warsi: I can't detachSanjay Dutt talked about his friendship with Salman Khan and Arshad Warsi. He called Salman his brother and praised Arshad's comedy. He will soon be seen with Arshad in 'Welcome to the Jungle'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/pride-prejudice-returns-to-theatres-keira-knightley-matthew-macfadyen-2761695-2025-07-28",
      "headline": "Pride & Prejudice returns to theatres and it still says everything about love'Pride & Prejudice' re-release: Don't miss the iconic 2005 adaptation that defined the modern rom-coms and proved Jane Austen is still the queen of feminist love stories."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sunny-deol-meets-dalai-lama-during-unforgettable-ladadkh-trip-with-son-rajveer-2762372-2025-07-28",
      "headline": "Sunny Deol meets Dalai Lama during unforgettable Ladakh trip with son RajveerBollywood actor Sunny Deol met the Dalai Lama during a trip to Ladakh with his son, Rajveer. The actor shared the encounter on social media, expressing gratitude and admiration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kajol-channels-kabhi-khushi-kabhie-gham-anjali-at-daughter-nysa-devgn-graduation-2762339-2025-07-28",
      "headline": "Kajol channels K3G's Anjali at daughter Nysa's graduation. Video goes viralNysa Devgn and Raheema Rahman, daughters of Kajol-Ajay Devgn and AR Rahman, graduated from the Glion Institute of Higher Education in Switzerland. A video of Kajol cheering for Nysa during the ceremony caught fans' attention online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/hari-hara-veera-mallu-edits-scenes-to-improve-audience-reception-2762399-2025-07-28",
      "headline": "Pawan Kalyan's Hari Hara Veera Mallu trimmed, poor VFX scenes removedThe makers of Pawan Kalyan's 'Hari Hara Veera Mallu' trimmed certain scenes due to poor VFX. The film released in theatres on July 24."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshan-saba-azad-son-hrehaan-roshan-movie-date-ahead-of-war-2-release-2762402-2025-07-28",
      "headline": "Hrithik Roshan enjoys movie outing with Saba Azad and son Hrehaan ahead of War 2Hrithik Roshan was seen enjoying a movie outing with his son Hrehaan and girlfriend Saba Azad ahead of the release of his upcoming film 'War 2'. The action thriller, also starring Jr NTR and Kiara Advani, is set to release on August 14."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-hosts-ips-trainees-at-his-bandra-home-amid-speculation-2762351-2025-07-28",
      "headline": "Here's why a bus full of IPS officers visited Aamir Khan at his Bandra homeAamir Khan recently hosted a batch of IPS trainees at his Bandra residence, dispelling rumours about police visits and luxury car issues. On Sunday, a few videos of the officers leaving Khan's residence surfaced online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/jaya-bhattacharya-pay-inequality-kyunki-saas-bhi-kabhi-bahu-thi-2762374-2025-07-28",
      "headline": "Jaya Bhattacharya recalls being most underpaid actor on Kyunki: Got Rs 1000 raiseJaya Bhattacharya revealed she was the 'most underpaid actor' during her tenure on 'Kyunki Saas Bhi Kabhi Bahu Thi'. The actor received a raise of Rs 1000 once. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pawan-kalyan-hari-hara-veera-mallu-box-office-collections-steady-rs-75-crore-2762378-2025-07-28",
      "headline": "Hari Hara Veera Mallu box office Day 4: Pawan Kalyan's film sees mild recoveryThe historical drama 'Hari Hara Veera Mallu', starring Pawan Kalyan, experienced a modest rise in box office earnings on its fourth day amid mixed reviews. The film surpassed Rs 75 crore nett at the domestic box office."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/zayn-malik-daughter-khai-blackpink-concert-priyanka-chopra-malti-2762370-2025-07-28",
      "headline": "Zayn Malik attends Blackpink concert with daughter after Priyanka ChopraSinger-songwriter Zayn Malik attended the Blackpink concert with his daughter Khai. He posted a photo from the event on his social media."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ramya-files-police-complaint-online-abuse-darshan-fans-rape-death-2762335-2025-07-28",
      "headline": "Actor Ramya to file complaint against Darshan fans, slams trolls for rape, death threatsActor Ramya will file a complaint against social media harassment and called for necessary action. Actor Darshan's fans and Internet users issued rape and death threats."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/suniel-shetty-under-fire-over-wife-should-take-care-of-kids-comment-2762340-2025-07-28",
      "headline": "Suniel Shetty under fire over 'wife should take care of kids' commentActor Suniel Shetty faces criticism after suggesting that wives should concentrate on raising children while their husbands pursue their careers. Social media users have condemned his perspective on the roles and responsibilities within marriage.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-box-office-collection-day-10-detailed-report-ahaan-panday-film-does-the-unthinkable-in-2nd-weekend-2762322-2025-07-28",
      "headline": "Saiyaara box office Day 10: Ahaan Panday's film does the unthinkable in 2nd weekendYRF's 'Saiyaara' recorded another historic weekend at the Indian box office. The film is now eyeing the benchmark of Rs 300 crore by the end of its second week. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-nick-jonas-enjoy-aladdin-broadway-night-with-daughter-malti-disney-2762308-2025-07-28",
      "headline": "Priyanka Chopra, Nick Jonas' Aladdin Broadway outing with Malti is pure Disney magicPriyanka Chopra and Nick Jonas took their daughter Malti to watch the Broadway show of 'Aladdin' in New York, calling it a magical family experience. Priyanka praised the Indian leads in the show, saying they made her 'little heart flutter.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/smriti-irani-proved-miscarriage-kyunki-saas-bhi-kabhi-bahu-thi-makers-2762304-2025-07-28",
      "headline": "Smriti Irani recalls time when she had to prove miscarriage to Kyunki makersSmriti Irani is set to return to television with the revamped version of 'Kyunki Saas Bhi Kabhi Bahu Thi'. She will be making her comeback with this much-anticipated revival of the iconic series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/cha-eun-woo-actor-true-beauty-military-service-2762294-2025-07-28",
      "headline": "True Beauty actor Cha Eun-woo begins military service: I'll be back safeCha Eun-woo, ASTRO's singer and actor, has officially started his mandatory military service. Fans and fellow celebrities have given him an emotional send-off as he prepares to return in 2027."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sidharth-malhotra-seeks-blessings-newborn-daughter-siddhivinayak-temple-kiara-advani-2762269-2025-07-28",
      "headline": "Sidharth Malhotra visits Siddhivinayak with mother after daughter's birthBollywood actor Sidharth Malhotra visits Mumbai's Siddhivinayak Temple with his mother to seek blessings for his newborn daughter and family. Sidharth and Kiara Advani welcomed their first child on July 16."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kriti-sanon-gets-birthday-wish-rumoured-boyfriend-kabir-bahia-old-pic-2762260-2025-07-28",
      "headline": "Kriti Sanon's rumoured partner Kabir Bahia wishes her birthday with an old picActor Kriti Sanon's rumoured boyfriend, Kabir Bahia, posted a charming holiday snap to celebrate the occasion. The two have been rumoured to be dating for a while."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-girlfriend-rashmika-mandanna-cute-nickname-2762265-2025-07-28",
      "headline": "Vijay Deverakonda, Rashmika Mandanna's nicknames for each other are all things cuteVijay Deverakonda debuted his nickname for his rumoured girlfriend, Rashmika Mandanna, on X. The 'Pushpa' actor wished him ahead of the release of his upcoming film, 'Kingdom', slated to hit theatres on July 31."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/high-probability-of-pahalgam-attackers-being-trapped-in-operation-mahadev-three-foreign-terrorists-sources-2762404-2025-07-28",
      "headline": "3 suspected Pahalgam terrorists killed in Army's Operation Mahadev: SourcesThe Resistance Front (TRF), an offshoot of the Pakistan-based terror outfit Lashkar-e-Taiba, had claimed responsibility for the Pahalgam attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/parliament-monsoon-session-live-lok-sabha-op-sindoor-debate-opposition-pahalgam-centre-2762255-2025-07-28",
      "headline": "Live: Lok Sabha debate on Op Sindoor begins, Rajnath Singh addresses HouseParliament Session 2025 Live Updates: After a week of disruptions, Parliament's Monsoon Session is now poised to witness a high-stakes debate beginning today, with the focus on the Pahalgam terror attack and Operation Sindoor — two issues deeply tied to national security and foreign policy. Both the ruling BJP-led National Democratic Alliance and the Opposition are preparing for an intense face-off in the Lok Sabha and Rajya Sabha. The Congress has already issued a three-line whip, directing its Lok Sabha MPs to remain present in the House for the next three days. In a rare show of consensus, the two sides have agreed to a 16-hour debate in each House — though such sessions typically spill over beyond the allotted time. Senior leaders from both camps are expected to lead the charge during what promises to be a politically charged week in Parliament. Stay tuned to IndiaToday.in as we bring you the latest updates. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/any-document-can-be-forged-supreme-court-asks-poll-body-to-include-aadhaar-epic-in-bihar-voter-roll-revision-2762435-2025-07-28",
      "headline": "Top court asks poll body to include Aadhaar, EPIC in Bihar voter roll revisionAny document can be forged: Supreme Court asks poll body to include Aadhaar, EPIC in Bihar voter roll revision"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/dhyaansh-young-survivor-june-12-air-india-crash-mother-shield-skin-grafting-ic171-boeing-bj-medical-college-ahmedabad-2762361-2025-07-28",
      "headline": "With mother as shield and skin, 8-month-old Air India crash victim survivesEight-month-old Dhyaansh is the youngest survivor of the June 12 Air India crash. The infant's mother, Manisha Kachhadiya, shielded him as fire engulfed BJ Medical College's residential complex as the IC171 crashed into the building. As both battled burns, Manisha donated her skin to Dhyaansh for grafting. Now, mother and son have been discharged from the hospital."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/hepatitis-india-monsoon-spike-vaccines-hygiene-unsafe-medical-practices-2762375-2025-07-28",
      "headline": "Hepatitis in India: A preventable disease still claiming livesDecades later, while we've gained vaccines, better hygiene practices, and public health campaigns, hepatitis continues to claim thousands of lives annually in India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shashi-tharoor-refused-to-toe-party-line-on-op-sindoor-declined-to-take-part-in-lok-sabha-discussion-sources-2762389-2025-07-28",
      "headline": "Shashi Tharoor declined to speak on Op Sindoor, refused to toe party line: SourcesShashi Tharoor declined to take part in the Operation Sindoor discussion as he could not align with the party's current line of criticism against the government over the operation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-uk-high-commissioner-russia-oil-imports-switch-off-our-economy-2762307-2025-07-28",
      "headline": "Do we switch off our economy? Envoy's Jaishankar-esque reply on Russian oilDismissing Western criticism of India's ties with Russia, its High Commissioner to the UK said New Delhi cannot shut down its economy over geopolitical concerns."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-bjp-old-guard-in-punjab-national-leadership-arent-buying-the-sad-reunion-talk-2761653-2025-07-26",
      "headline": "Why BJP old guard in Punjab, national leadership aren't buying the SAD reunion talkFor the BJP, the goal isn't just to win elections in the state but build a political identity that resonates with Sikhs independently of the Akali Dal"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/should-you-double-check-your-doctor-with-chatgpt-yes-you-absolutely-should-2762357-2025-07-28",
      "headline": "Should you double-check your doctor with ChatGPT? Yes, you absolutely shouldNo one likes to be double-checked. And doctors in India particularly hate it. But that is precisely the reason they should be double-checked. Using ChatGPT or something like Google Gemini, you can re-verify your diagnostic tests or prescriptions, and you should. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/dog-babu-son-of-kutta-babu-gets-residence-certificate-in-bihar-amid-sir-row-2762408-2025-07-28",
      "headline": "'Dog Babu', son of 'Kutta Babu', gets key Bihar certificate amid voter roll rowA digitally signed residence certificate in the name of 'Dog Babu', complete with canine photo and names of canine parents, has emerged from Bihar's Masaurhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/justice-yashwant-varma-cash-row-xxx-supreme-court-petition-hides-identity-2762349-2025-07-28",
      "headline": "XXX vs Union of India: Justice Varma 'hides' identity in Supreme Court pleaJustice Yashwant Varma has concealed his identity in his petition in the Supreme Court challenging the findings of an inquiry panel that recommended his removal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shashi-tharoor-unlikely-to-speak-on-pahalgam-attack-op-sindoor-debate-in-parliament-lok-sabha-2762256-2025-07-28",
      "headline": "Opposition din drowns out Op Sindoor discussion start, Lok Sabha adjourned thrice Live UpdatesContinued disruptions in Parliament prevented the start of Operation Sindoor discussions in both the Lok Sabha and Rajya Sabha."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/bikes/story/kinetic-dx-returns-in-an-electric-avatar-priced-from-rs-111-lakh-2762433-2025-07-28",
      "headline": "Kinetic DX returns in an electric avatar, priced from Rs 1.11 lakhKinetic marks its return to the two-wheeler segment with the all-electric DX, blending retro design with modern features, priced from Rs 1.11 lakh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-manchester-test-draw-shubman-gill-ben-stokes-2762284-2025-07-28",
      "headline": "Manchester Test: A draw that felt like a winFrom 0 for 2 to 425 for 4 in the second innings, India turned what looked a defeat into a stirring draw in Manchester. A performance built on grit and defiance, it felt like a win and a momentum shift before the Oval finale."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bihar-rjd-mla-bhai-virendra-viral-audio-threaten-panchayat-sachiv-hit-with-shoes-2762242-2025-07-28",
      "headline": "RJD MLA's Panchayat-style threat gets Bihar Sachiv's 'not scared of you' responseAn audio clip, allegedly featuring RJD MLA Bhai Virendra, has gone viral, in which he is heard threatening a panchayat secretary who failed to recognise him during a call about a death certificate request."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/constitution-club-of-india-secretary-election-bjp-vs-bjp-rajeev-pratap-rudy-vs-sanjeev-balyan-congress-2762338-2025-07-28",
      "headline": "BJP vs BJP turns Constitution Club election into a thrillerA club election in the heart of New Delhi has turned into a BJP vs BJP thriller. After 25 years of uncontested reign as Secretary of the Constitution Club of India, BJP MP Rajiv Pratap Rudy is facing a surprise challenge from fellow party leader and former MP Sanjeev Balyan. The battle for the key post at the elite MPs' club has split loyalties across caste, region, and even party lines."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/mercedes-benz-adds-microsoft-teams-call-feature-cars-memes-jokes-x-reactions-2762353-2025-07-28",
      "headline": "Mercedes-Benz adds Teams call feature in cars. No thanks, says InternetMercedes-Benz has announced that Microsoft Teams will be integrated into its vehicles which allow drivers to make video calls on the go - a step that has sparked mixed reactions and meme storms online. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/forget-ghaziabad-fake-embassy-people-built-countries-nithyananda-kailasa-sealand-liberland-hemingway-new-atlantis-2761253-2025-07-28",
      "headline": "Forget Jain's fake embassy, Nithyananda, others have created countriesHarsh Vardhan Jain ran embassies of fake nations from a house in Ghaziabad. People who are more ingenious have built their own countries, and Nithyananda's Kailasa is just one of them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-takes-suo-motu-note-of-stray-dog-menace-in-delhi-ncr-deeply-disturbing-2762403-2025-07-28",
      "headline": "Deeply disturbing: Top court takes suo motu note of stray dog menace in Delhi-NCRThe Supreme Court flagged the \"deeply disturbing\" rise in rabies cases from dog bites, taking suo motu note after a report highlighted deaths of infants, elderly and civic failure in Delhi and surrounding regions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/p-chidambaram-homegrown-terrorist-remarks-bjp-slams-congress-pahalgam-op-sindoor-2762319-2025-07-28",
      "headline": "Chidambaram's 'homegrown terrorists' remark stirs row, MP slams 'misinformation'P Chidambaram's comment questioning Pakistan's role in the Pahalgam terror attack triggered a fierce political row, with BJP accusing Congress of aiding enemy narratives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-hosts-ips-trainees-at-his-bandra-home-amid-speculation-2762351-2025-07-28",
      "headline": "Here's why a bus full of IPS officers visited Aamir Khan at his Bandra homeAamir Khan recently hosted a batch of IPS trainees at his Bandra residence, dispelling rumours about police visits and luxury car issues. On Sunday, a few videos of the officers leaving Khan's residence surfaced online."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/blusmart-wallet-refund-90-day-period-lapse-app-not-working-fraud-sebi-jaggi-brothers-2762313-2025-07-28",
      "headline": "Have you got your BluSmart refund yet? It's been 90 daysBluSmart wallet refund: As July comes to an end, users say they have not received their money back and are struggling to even access the app."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/oscar-piatsri-formula-one-win-overtake-lando-norris-belgian-gp-2762333-2025-07-28",
      "headline": "Watch Piastri's audacious overtake on Norris that won him Belgian GPOscar Piastri won the rain-delayed Belgian Grand Prix with a bold move on teammate Lando Norris. This victory extends his championship lead and adds to McLaren's dominance this season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/tech-layoffs-tcs-microsoft-intel-among-5-slashing-thousands-of-jobs-in-apparent-ai-restructure-2762285-2025-07-28",
      "headline": "TCS, Microsoft, Intel among 5 slashing thousands of jobs in AI restructureSeveral global tech companies, including TCS, Microsoft, Intel, Meta, and Panasonic, are laying off thousands of employees this year as they adjust to changing business needs and the growing influence of artificial intelligence (AI)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sanjay-dutt-on-bond-with-salman-khan-arshad-warsi-2762444-2025-07-28",
      "headline": "Sanjay Dutt opens up about bond with Salman Khan and Arshad Warsi: I can't detachSanjay Dutt talked about his friendship with Salman Khan and Arshad Warsi. He called Salman his brother and praised Arshad's comedy. He will soon be seen with Arshad in 'Welcome to the Jungle'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/pride-prejudice-returns-to-theatres-keira-knightley-matthew-macfadyen-2761695-2025-07-28",
      "headline": "Pride & Prejudice returns to theatres and it still says everything about love'Pride & Prejudice' re-release: Don't miss the iconic 2005 adaptation that defined the modern rom-coms and proved Jane Austen is still the queen of feminist love stories."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sunny-deol-meets-dalai-lama-during-unforgettable-ladadkh-trip-with-son-rajveer-2762372-2025-07-28",
      "headline": "Sunny Deol meets Dalai Lama during unforgettable Ladakh trip with son RajveerBollywood actor Sunny Deol met the Dalai Lama during a trip to Ladakh with his son, Rajveer. The actor shared the encounter on social media, expressing gratitude and admiration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kajol-channels-kabhi-khushi-kabhie-gham-anjali-at-daughter-nysa-devgn-graduation-2762339-2025-07-28",
      "headline": "Kajol channels K3G's Anjali at daughter Nysa's graduation. Video goes viralNysa Devgn and Raheema Rahman, daughters of Kajol-Ajay Devgn and AR Rahman, graduated from the Glion Institute of Higher Education in Switzerland. A video of Kajol cheering for Nysa during the ceremony caught fans' attention online."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-manchester-test-anshul-kamboj-debut-kapil-dev-2762443-2025-07-28",
      "headline": "You expect him to take 10 wickets? Kapil Dev defends Anshul Kamboj after debutKapil Dev has jumped to the defence of young pacer Anshul Kamboj after his lacklustre debut in the Manchester Test for India. Kamboj failed to make a mark in his first match in India colours. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-manchester-test-draw-fiasco-ben-stokes-r-ashwin-2762387-2025-07-28",
      "headline": "Want a hundred against Brook? Of course! Ashwin slams Stokes for 4th Test fiascoR Ashwin slammed Ben Stokes and England for the fiasco they created by trying to end the Manchester Test early and deny Ravindra Jadeja and Washington Sundar hundreds on Sunday, July 27. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/oscar-piatsri-formula-one-win-overtake-lando-norris-belgian-gp-2762333-2025-07-28",
      "headline": "Watch Piastri's audacious overtake on Norris that won him Belgian GPOscar Piastri won the rain-delayed Belgian Grand Prix with a bold move on teammate Lando Norris. This victory extends his championship lead and adds to McLaren's dominance this season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-manchester-test-washington-sundar-mantra-century-2762337-2025-07-28",
      "headline": "Fight for entire day: Sundar on mantra after brave hundred in 4th Test drawWashington Sundar revealed his mantra while batting on Day 5 when he scored a brave hundred in the Manchester Test. Sundar played a valiant role in securing the draw in the 4th Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/injury-replacement-ben-stokes-gautam-gambhir-injury-replacement-2762316-2025-07-28",
      "headline": "Gambhir bats for injury replacements, Ben Stokes slams ridiculous ideaEngland captain Ben Stokes has voiced strong opposition to injury replacements in Test cricket. The debate follows Rishabh Pant's injury and contrasting views from India's coach Gautam Gambhir."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-manchester-test-rishabh-pant-injury-parting-message-2762300-2025-07-28",
      "headline": "Injured Pant sends parting message to Team India after heroic Manchester drawRishabh Pant sent a parting message to the Indian team after their heroic draw in the Manchester Test. Pant showed grit and fought through pain to score a valiant fifty in the first innings of the fourth Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-manchester-test-draw-shubman-gill-ben-stokes-2762284-2025-07-28",
      "headline": "Manchester Test: A draw that felt like a winFrom 0 for 2 to 425 for 4 in the second innings, India turned what looked a defeat into a stirring draw in Manchester. A performance built on grit and defiance, it felt like a win and a momentum shift before the Oval finale."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-jasprit-bumrah-workload-manchester-gambhir-2762220-2025-07-28",
      "headline": "Workload management can pause, India need Jasprit Bumrah in Oval Test deciderHaving secured a draw in the fourth Test against England at Old Trafford in Manchester, should India push Jasprit Bumrah to play in the fifth Test at the Oval with a chance of levelling the series still alive? With the series on the line, workload management can take a backseat, especially with no major tournaments lined up for the next four months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-ben-stokes-on-asking-for-early-draw-in-manchester-2762213-2025-07-28",
      "headline": "Ben Stokes on asking for early draw: Didn't want to risk front-line bowlersEngland captain Ben Stokes revealed that he didn't want to risk his front-line bowlers and hence asked for an early draw in the fourth Test against India at OId Trafford in Manchester."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/tejaswin-shankar-decathlon-national-record-2762257-2025-07-28",
      "headline": "Tejaswin Shankar breaks national record, betters his previous markIndia's Tejaswin Shankar broke his own national decathlon record with 7826 points in Poland. This achievement marks a new milestone for Indian athletics and raises hopes for future international success."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-sanjay-manjrekar-on-gautam-gambhir-2762229-2025-07-28",
      "headline": "Gambhir should tone it down, India succeeding despite his blunders: ManjrekarFormer India cricketer-turned commentator Sanjay Manjrekar has urged Gautam Gambhir to tone down during his press conference while answering tough questions and also highlighted his tactical blunders. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-manchester-test-draw-shubman-gill-ben-stokes-2762284-2025-07-28",
      "headline": "Manchester Test: A draw that felt like a winFrom 0 for 2 to 425 for 4 in the second innings, India turned what looked a defeat into a stirring draw in Manchester. A performance built on grit and defiance, it felt like a win and a momentum shift before the Oval finale."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-jasprit-bumrah-workload-manchester-gambhir-2762220-2025-07-28",
      "headline": "Workload management can pause, India need Jasprit Bumrah in Oval Test deciderHaving secured a draw in the fourth Test against England at Old Trafford in Manchester, should India push Jasprit Bumrah to play in the fifth Test at the Oval with a chance of levelling the series still alive? With the series on the line, workload management can take a backseat, especially with no major tournaments lined up for the next four months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-ben-stokes-on-asking-for-early-draw-in-manchester-2762213-2025-07-28",
      "headline": "Ben Stokes on asking for early draw: Didn't want to risk front-line bowlersEngland captain Ben Stokes revealed that he didn't want to risk his front-line bowlers and hence asked for an early draw in the fourth Test against India at OId Trafford in Manchester."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/tejaswin-shankar-decathlon-national-record-2762257-2025-07-28",
      "headline": "Tejaswin Shankar breaks national record, betters his previous markIndia's Tejaswin Shankar broke his own national decathlon record with 7826 points in Poland. This achievement marks a new milestone for Indian athletics and raises hopes for future international success."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-sanjay-manjrekar-on-gautam-gambhir-2762229-2025-07-28",
      "headline": "Gambhir should tone it down, India succeeding despite his blunders: ManjrekarFormer India cricketer-turned commentator Sanjay Manjrekar has urged Gautam Gambhir to tone down during his press conference while answering tough questions and also highlighted his tactical blunders. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}