{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-1-sahaj-vs-itr-4-sugam-which-itr-form-should-you-use-tax-filing-2025-2727615-2025-05-20",
      "headline": "ITR-1 Sahaj vs ITR-4 Sugam: Which ITR form should you use?ITR-1 is for straightforward income from salary or pension, while ITR-4 is suitable if you're into small business or freelance work and are using the presumptive taxation scheme. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sensex-closes-873-points-lower-nifty-falls-below-25000-eternal-down-4-2727592-2025-05-20",
      "headline": "Sensex closes 873 points lower, Nifty falls below 25,000; Eternal down 4%The S&P BSE Sensex lost 872.98 points to end at 81,186.44, while the NSE Nifty50 was down by 261.55 points to close at 24,683.90. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/what-is-itr-u-check-who-can-file-penalties-and-last-date-2727537-2025-05-20",
      "headline": "What is ITR-U? Check who can file, penalties, and last dateIf you missed filing your return on time or made a mistake in your previous ITR, the ITR-U gives you another chance to set things right—this time with more time on your hands."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/real-estate-gcc-coverage-south-city-bangalore-hyderabad-bengaluru-chennai-hyderabad-2727538-2025-05-20",
      "headline": "South India emerges as top choice for GCC offices in early 2025With Bengaluru, Chennai, and Hyderabad collectively securing a dominant 64% share of all GCC office leasing in Q1 2025, the southern region has firmly established itself as the preferred destination for global corporations setting up specialised capability centres in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/mutual-fund-boom-in-india-guess-what-is-fuelling-the-rs-65-lakh-crore-surge-2727514-2025-05-20",
      "headline": "Mutual fund boom in India: Guess what's fuelling the Rs 65 lakh crore surgeMumbai alone leads the chart, contributing 27% (Rs 17.75 lakh crore), followed by Delhi at 12.63%, Bengaluru at 5.39%, Pune at 4%, and Kolkata at 3.49%. These numbers haven't changed much since last year, according to data from the Association of Mutual Funds in India (AMFI)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-falls-after-positive-opening-reasons-behind-sensex-nifty-fall-explained-2727500-2025-05-20",
      "headline": "Explained: Why Sensex tanked nearly 900 points todayAt today's closing, the Sensex had plunged 872.98 points to settle at 81,186.44, while the Nifty 50 fell 261.55 points to end at 24,683.90. All major sectoral indices closed in the red, with Auto, Media, Financial Services, and Healthcare stocks among the worst hit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/defence-stocks-nifty-rally-pause-what-should-investors-do-book-profit-paras-cochin-shipyard-ideaforge-2727480-2025-05-20",
      "headline": "Is the defence stock party over? Here's what investors need to knowShares of Paras Defence and Cochin Shipyard dropped more than 6% each during the day. The broader Nifty India Defence index was also down. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/lost-your-uan-step-by-step-guide-to-get-it-back-in-minutes-2727476-2025-05-20",
      "headline": "Lost your UAN? Here's a step-by-step guide to get it back in minutesYour UAN is more than just a number. Without your UAN, you can't check your PF balance, update your account, or even withdraw money when you need it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/paras-defence-cochin-shipyard-why-these-defence-stocks-tumbled-over-6-today-2727451-2025-05-20",
      "headline": "Paras Defence, Cochin Shipyard: Why these defence stocks tumbled over 6% todayLeading the slide were Paras Defence, Cochin Shipyard. Both fell over 6% in intraday trade. The broader Nifty India Defence index dropped 1.4% to around 11:50 am, marking its second straight day of decline after a blistering multi-week rally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-checklist-who-must-file-deadlines-documents-and-the-truth-about-zero-tax-2727441-2025-05-20",
      "headline": "ITR checklist: Who must file, deadlines, documents and the truth about 'zero tax'In the 2025–26 Union Budget, the government gave a big relief, i.e., no tax on income up to Rs 12 lakh under the new tax regime. But here's the catch: You must file your ITR to claim it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/explained-why-protean-egov-shares-are-in-free-fall-2727426-2025-05-20",
      "headline": "Explained: Why Protean eGov shares are in free fallAfter crashing 20% on Monday, the stock fell another 13% in early trade, briefly hovering near the Rs 995 mark—perilously close to its 52-week low of Rs 930."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/pfizer-share-price-jump-12-percent-why-reason-q4-fy25-profit-rise-dividend-2727401-2025-05-20",
      "headline": "Pfizer share price rises 12% today. Here's whyPfizer stock: The stock jumped 11.91% during the day to touch a high of Rs 4,995.85 on the stock exchanges, after starting the day at Rs 4,698.80."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-bangladesh-trade-route-curbs-economic-impact-explained-2727389-2025-05-20",
      "headline": "Explained: How Bangladesh is hurting itself by curbing Indian exportsIndia's new import rules sharply limit Bangladesh's access through Northeast land ports, forcing key goods onto restricted sea routes. The move comes after Bangladesh imposed similar restrictions on Indian goods."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/forget-crypto-gold-and-stocks-why-indias-ultra-rich-are-buying-land-2727378-2025-05-20",
      "headline": "Forget crypto, gold and stocks: Why India's ultra-rich are buying landA luxury real estate advisor has said that India's top 0.001%, from unicorn founders to legacy dynasties, are quietly building Rs 75–500 crore portfolios, but not in stocks or crypto. Their focus is on land and branded real estate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-opening-bell-sensex-opens-150-points-up-nifty-below-25000-tata-steel-gains-2-percent-2727369-2025-05-20",
      "headline": "Sensex opens 150 points up, Nifty below 25,000; Tata Steel gains 3%The S&P BSE Sensex gained 150.58 points to 82,210.00, while the NSE Nifty50 added 20.45 points to 24,965.90 as of 9:25 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/borana-weaves-ipo-open-for-bidding-subscribe-skip-review-gmp-good-bad-listing-gain-price-band-2727363-2025-05-20",
      "headline": "Borana Weaves IPO open for bidding: Should you subscribe? Check latest GMPThe company aims to raise Rs 144.89 crore through a fresh issue of 67 lakh shares. Borana Weaves IPO will remain open for three days and will close on Thursday, May 22, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-today-sensex-nifty-fall-rise-prediction-trade-setup-nse-bse-2727357-2025-05-20",
      "headline": "Stock market opening: Will Sensex, Nifty rise or fall today?Foreign Portfolio Investors (FPIs) sold shares worth Rs 525.95 crore, which added pressure on stock prices. This selling by investors was one of the reasons why the market fell slightly on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-may-20-bel-indusind-bank-rvnl-bel-dlf-trading-nse-bse-2727351-2025-05-20",
      "headline": "Stocks to watch on May 20: BEL, IndusInd Bank, RVNL, BEL, DLFMarkets ended lower in the last session. This decline came after global markets reacted to Moody's decision to lower the credit rating of the United States. However, mid-cap and small-cap stocks continued to do wel. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/two-foreign-funds-with-investment-in-adani-group-under-sebi-scanner-2727060-2025-05-19",
      "headline": "Two foreign funds with investment in Adani Group under Sebi scannerThe Adani Group and its 13 offshore investors have been facing an investigation by the Securities and Exchange Board of India (Sebi) since Hindenburg Research in 2023 alleged improper use of tax havens by the group, triggering a stock sell-off."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/indusind-bank-insider-trading-sebi-probe-six-officials-accounting-error-report-2727042-2025-05-19",
      "headline": "Six IndusInd Bank officials under Sebi scanner for insider trading: ReportThe Securities and Exchange Board of India (Sebi) is checking the timing of these trades to find out whether the share sales broke Sebi's rules or the bank's own internal code of conduct."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/byju-raveendran-promises-comeback-despite-big-setbacks-i-am-not-giving-up-2727035-2025-05-19",
      "headline": "Byju's Raveendran promises comeback despite big setbacks: 'I am not giving up'Byju Raveendran, the founder of the edtech company, Byju's, admitted that the company made some business mistakes during its rapid global expansion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/boycott-turkey-hits-fashion-online-shopping-e-commerce-myntra-ajio-stop-selling-turkish-labels-2727016-2025-05-19",
      "headline": "'Boycott Turkey' hits fashion: Myntra, Ajio stop selling these Turkish labelsThe two leading online fashion platforms have removed Turkish products after growing boycott calls over Turkey's support to Pakistan during the recent India-Pakistan military conflict."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-closes-271-points-lower-nifty-below-25000-eternal-zomato-falls-3-percent-2727011-2025-05-19",
      "headline": "Sensex closes 271 points lower, Nifty below 25,000, Eternal falls 3%The S&P BSE Sensex was down 271.17 points to end at 82,059.42, while the NSE Nifty50 lost 74.35 points to close at 24,945.45. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/high-salaries-may-not-last-forever-zoho-ceo-sridhar-vembu-warns-software-engineers-2726990-2025-05-19",
      "headline": "'High salaries may not last forever': Zoho's Sridhar Vembu warns software engineersSridhar Vembu explained that the upcoming changes in software development, especially with large language models (LLMs) and new tools powered by artificial intelligence (AI), might lead to many software jobs being lost."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/vodafone-idea-share-price-fall-drop-10-percent-why-reason-supreme-court-hearing-agr-dues-plea-rejected-2726952-2025-05-19",
      "headline": "Vodafone Idea shares drop 10%. Here's whyVodafone Idea share price: Over the last month, Vodafone Idea's stock has gone down by 16.73%. In the last year, it has fallen over 50%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/what-is-new-in-itr-forms-for-fy-2024-25-5-key-changes-you-must-know-2726940-2025-05-19",
      "headline": "What's new in ITR Forms for FY 2024-25? 5 key changes you must knowNow taxpayers need to clearly mention the specific TDS section under which tax was deducted from your income. This change applies to ITR forms 1, 2, 3 and 5. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/supreme-court-dismisses-vodafone-idea-airtel-plea-on-agr-interest-dues-2726933-2025-05-19",
      "headline": "Supreme Court dismisses Vodafone Idea, Airtel plea on AGR interest duesThe court dismissed the writ petitions filed by the telecom operators, calling the move \"shocking\" and stating that the petitions were \"misconceived.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/brent-crude-oil-price-usd-65-stocks-that-may-benefit-investors-share-market-2726911-2025-05-19",
      "headline": "Brent crude slips below $65: These stocks may benefit investorsBrent futures for July delivery were trading at $64.98 a barrel, down 0.66%. This is a steep fall from January, when prices were above $80 a barrel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/once-earning-rs-128-crore-metaverse-engineer-now-sidelined-by-ai-and-delivering-food-2726903-2025-05-19",
      "headline": "Once earning Rs 1.28 crore, metaverse engineer now sidelined by AI and delivering foodShawn Kay has worked in tech for 20 years. He was involved in virtual reality, web development and artificial intelligence. But after being laid off in April last year, things took a turn for the worse. The metaverse boom faded and jobs in that space dried up, especially with the sudden rise of AI tools like ChatGPT."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/dreaming-of-a-job-abroad-these-are-the-easiest-countries-to-get-a-work-visa-2726861-2025-05-19",
      "headline": "Dreaming of a job abroad? These are the easiest countries to get a work visaLatvia is the easiest country to get a skilled worker visa. It scored 7.64 out of 10 for ease of entry. The visa itself costs around 83 pounds and typically gets approved in ten working days, according to a study conducted by Remitly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/share-crash-protean-egov-technologies-why-reason-income-tax-department-tech-revamp-project-2726833-2025-05-19",
      "headline": "Explained: Why did Protean shares crash 20% todayProtean eGov Technologies, earlier known as NSDL e-Governance Infrastructure, provides technology solutions for various citizen-focused services."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/india-turkey-relation-celebi-loss-usd-200-million-airport-operation-hit-market-cap-job-loss-2726820-2025-05-19",
      "headline": "India ousts Turkey's Celebi: $200 million lost in market-cap, jobs on the lineThe company, listed on the Istanbul Stock Exchange, saw its shares drop 20% in just two trading sessions. On 16 May, the stock fell 222 points to close at 2,002 lira. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-50-points-lower-nifty-above-25000-it-stocks-down-in-early-trade-2726798-2025-05-19",
      "headline": "Sensex opens 50 points lower, Nifty above 25,000; IT stocks down in early tradeThe S&P BSE Sensex was up 36.40 points to 82,366.99, while the NSE Nifty50 lost 5.65 points to 25,014.15 as of 9:26 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-opening-today-key-levels-sectors-to-watch-how-to-trade-share-market-trading-setup-2726797-2025-05-19",
      "headline": "Sensex, Nifty today: Key levels and sectors to watch. Here's how to tradeMarket experts say there is still positive momentum in the market, but traders should be cautious and focus on key levels."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-prediction-today-dalal-street-nse-bse-shares-trading-2726783-2025-05-19",
      "headline": "Stock market opening today: Sensex, Nifty to open flat. Here's whyThe Nifty50 index gained 4.2%, and foreign investors bought shares worth Rs 15,925 l . Thast week. This was the fifth week in a row of buying by foreign portfolio investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-may-19-bajaj-auto-delhivery-dr-reddys-jsw-steel-bel-2726770-2025-05-19",
      "headline": "Stocks to watch on May 19: Bajaj Auto, Delhivery, Dr Reddy's, JSW Steel, BELMany companies will be in focus due to their earnings and key updates, such as Power Grid Corporation of India, Bharat Electronics, DLF, ACME Solar Holdings, Bajaj Auto, Delhivery, Dr Reddy's, JSW Steel, etc. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bangladesh-port-import-restrictions-bengal-impact-processed-foods-garments-2726727-2025-05-18",
      "headline": "Bengal to be impacted by Bangladesh import curbs, but nation first: OfficialsThe central government on Saturday imposed port restrictions on the import of a few Bangladeshi goods, such as readymade garments and processed food items."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-restricts-bangladeshi-imports-via-northeast-check-posts-in-reciprocal-move-2726437-2025-05-18",
      "headline": "India restricts Bangladesh imports through northeast check postsA wide range of Bangladeshi products will be restricted via the Integrated Check Posts in the northeastern states of Assam, Meghalaya, Tripura, and Mizoram. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-us-trade-talks-piyush-goyal-to-lead-team-to-washington-for-bta-negotiations-ytvd-2726160-2025-05-17",
      "headline": "India-US Bilateral Trade Agreement: Final Phase Negotiations Aim For ConclusionUnion Minister Piyush Goyal will lead a team to the United States for trade talks. India and the US are working to finalize the Bilateral Trade Agreement (BTA) by early July. The US President has proposed a trade agreement with India that would have no tariffs on a wide range of American products. The US President stated, 'India is one of the highest tariff nations in the world. It's very hard to sell into India.'"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-drops-chinese-lounge-partner-dragonpass-what-it-means-for-indian-flyers-2726082-2025-05-16",
      "headline": "Adani drops Chinese lounge partner DragonPass: What it means for Indian flyersThe move, triggered by rising national security concerns, has ended DragonPass's access to Adani-managed airport lounges across the country."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/archana-puran-singh-addresses-marital-trouble-rumours-with-husband-parmeet-sethi-2727697-2025-05-20",
      "headline": "Archana Puran Singh reacts to marital trouble rumours with Parmeet SethiArchana Puran Singh has put an end to rumours about marital issues with husband Parmeet Sethi, clarifying in a recent vlog that their playful banter is often mistaken for tension."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/katy-perry-professionally-handles-wardrobe-malfunction-during-show-in-vegas-2727573-2025-05-20",
      "headline": "How Katy Perry managed to avoid a wardrobe malfunction during Las Vegas showKaty Perry gracefully managed a mid-show wardrobe slip during her Las Vegas concert, continuing her performance without missing a beat. The singer is currently on tour for her seventh studio album, 143."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aishwarya-rai-arrives-at-cannes-with-daughter-aaradhya-bachchan-2727680-2025-05-20",
      "headline": "Aishwarya Rai arrives in Cannes with daughter Aaradhya. WatchAishwarya Rai Bachchan has arrived at the Cannes Film Festival 2025 alongside her daughter Aaradhya. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/actor-vishal-jethwa-travels-to-cannes-with-his-mother-shares-adorable-pics-2727539-2025-05-20",
      "headline": "Actor Vishal Jethwa travels to Cannes with his mother, shares adorable picsActor Vishal Jethwa fulfilled his childhood dream by taking his mother to Cannes, where his film 'Homebound' will premiere on May 21. He shared photos with a heartfelt note, expressing gratitude to his fans for their support."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/mukesh-khanna-is-thrilled-to-return-as-shaktimaan-2727641-2025-05-20",
      "headline": "Mukesh Khanna returns as Shaktimaan: Thrilled to connect with today's youthMukesh Khanna is returning as India's first superhero Shaktimaan. The actor expressed excitement about connecting with a whole new generation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/raashii-khanna-hints-intense-new-role-with-bruised-behind-the-scene-pics-2727650-2025-05-20",
      "headline": "Raashii Khanna teases intense new role with bruised BTS picsRaashii Khanna shared bruised behind-the-scenes photos from her upcoming project, hinting at an intense and physically demanding role. While she didn't reveal the title, fans suspect she is shooting for 'Farzi 2'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/satyajit-ray-film-institute-student-kokob-gebrehaweria-at-cannes-la-cinef-want-to-be-voice-for-africans-2727597-2025-05-20",
      "headline": "Satyajit Ray film institute student at Cannes La Cinef: Want to be voice for AfricansEthiopian filmmaker Kokob Gebrehaweria's no-budget film featuring a Nigerian footballer has been selected for Cannes La Cinef 2025. The film sheds light on the exploitation faced by African footballers in India and aims to give them a strong voice through cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-portrait-made-of-jackfruits-ahead-of-birthday-2727628-2025-05-20",
      "headline": "Mohanlal gets sweet tribute as Kerala artist creates his jackfruit portrait. WatchAhead of Mohanlal's birthday, a Kerala-based artist created a portrait of the actor using jackfruits. It took five hours and 20 jackfruits to create the art."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/even-akshay-is-clueless-suniel-shetty-reacts-to-paresh-rawals-exit-from-hera-pheri-3-2727570-2025-05-20",
      "headline": "Even Akshay is clueless: Suniel Shetty on Paresh Rawal's exit from Hera Pheri 3Actor Suniel Shetty, in an exclusive interview with IndiaToday.in, said that the sudden announcement of Paresh Rawal's exit from 'Hera Pheri 3' was shocking, calling it a \"big crisis\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kiara-advani-on-her-first-bikini-shot-from-yrf-war-2-first-action-film-2727558-2025-05-20",
      "headline": "Kiara Advani lists her firsts from War 2: First action film, first bikini shotActor Kiara Advani listed her 'lots of firsts' from Hrithik Roshan and Jr NTR-starrer 'War 2.' This is the first time she has collaborated with filmmaker Ayan Mukerji for an action film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ravi-mohan-aarti-divorce-blames-keneeshaa-for-marriage-failure-2727575-2025-05-20",
      "headline": "Ravi Mohan's wife Aarti blames 'third person' for failure of marriage in new noteAarti Ravi, estranged wife of actor Ravi Mohan, blamed a third person in a new statement. She clarified the accusations levelled against her by Ravi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vj-aishwarya-hits-back-at-reporter-who-questioned-attire-film-event-slams-media-silence-2727515-2025-05-20",
      "headline": "Tamil actor blasts reporter for 'sleeveless' comment, questions media silenceA woman anchor called out a reporter who questioned her attire at a film event and criticised the media's silence. She said such incidents affected her mentally and questioned the ethics of the film press."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/k-pop-groups-twice-enhypen-announce-new-music-bts-to-reunite-next-month-2727492-2025-05-20",
      "headline": "K-pop groups TWICE, ENHYPEN, and BTS set for comebacks in 2025The second quarter of 2025 is shaping up to be a rollercoaster for K-pop fans—with groups like TWICE, ENHYPEN making a comeback and BTS all set to reunite after completing their mandatory military service. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/randeep-hooda-to-lead-as-major-general-punia-in-upcoming-war-drama-2727489-2025-05-20",
      "headline": "Operation Khukri: Randeep Hooda to lead as Major General Punia in war dramaRandeep Hooda will star as Major General Raj Pal Punia in 'Operation Khukri', a war drama based on the Indian Army's daring 2000 rescue mission in Sierra Leone. The film highlights the bravery of 233 Indian soldiers trapped for 75 days in enemy territory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/kumar-sanu-daughter-shannon-interview-coachella-cannes-2727493-2025-05-20",
      "headline": "Singer Shannon says 'didn't take' father Kumar Sanu's help: Had my own journeyShannon K has successfully established herself as an independent artist, performing at Coachella and contributing to the Cannes film 'Tanvi The Great'. She credits hard work to nepotism and aims to inspire young Indian musicians worldwide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ridhi-dogra-after-being-bullied-for-opposing-abir-gulaal-release-2727462-2025-05-20",
      "headline": "I'm a citizen too: Ridhi Dogra after being bullied for opposing Abir Gulaal releaseActor Ridhi Dogra recently revealed that she was bullied on social media for opposing her film 'Abir Gulaal's' release following the Pahalgam terror attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kamal-haasan-interview-thug-life-2727379-2025-05-20",
      "headline": "Ulaganayagan to Vinveli Nayaga: Kamal Haasan on Thug Life, death and legacyKamal Haasan is upbeat about his upcoming film, 'Thug Life', which marks his reunion with Mani Ratnam 37 years after their iconic 'Nayakan'. In a chat with India Today, he spoke in detail about the film, among several other topics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/denzel-washington-receives-honorary-palme-dor-at-cannes-film-festival-2025-2727450-2025-05-20",
      "headline": "Denzel Washington receives honorary Palme d'Or at Cannes: Blessed beyond measureHollywood actor Denzel Washington received the prestigious Honorary Palme d'Or at the Cannes Film Festival during the premiere of his new film 'Highest 2 Lowest'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/tom-cruise-hints-at-end-of-mission-impossible-the-final-reckoning-2727434-2025-05-20",
      "headline": "Tom Cruise hints at end of Mission Impossible franchiseTom Cruise has hinted that 'Mission Impossible: The Final Reckoning' could mark the end of the iconic franchise. The new title and his recent comments have fuelled speculation about Ethan Hunt's final mission. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-conflict-mallikarjun-kharge-operation-sindoor-small-war-bjp-hits-back-2727640-2025-05-20",
      "headline": "We're doing small war against Pak: Mallikarjun Kharge's veiled jab at Op SindoorSpeaking at a rally in Karnataka, Mallikarjun Kharge claimed that PM Modi cancelled his scheduled visit to Jammu and Kashmir after receiving intelligence about potential unrest three days before the Pahalgam terror attack."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-army-chief-gen-asim-munir-promoted-to-field-marshal-highest-military-rank-in-country-2727685-2025-05-20",
      "headline": "General Asim Munir promoted to Field Marshal, highest military rank in PakistanPakistan's Union Cabinet on Tuesday approved the proposal to promote Munir as Field Marshal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistan-spy-haryana-youtuber-jyoti-malhotras-diary-recover-copys-what-she-wrote-2727648-2025-05-20",
      "headline": "Cops recover 'spy' YouTuber Jyoti Malhotra's diary: What she wrote after Pak tripThe police have recovered a personal diary belonging to YouTuber Jyoti Malhotra, who was recently arrested on charges of spying for Pakistan. The diary contains notes and travel records of Jyoti. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bjp-slams-karnataka-cong-govt-for-bangalore-waterlogging-timing-of-two-year-anniversary-samavesha-2727620-2025-05-20",
      "headline": "Bengaluru flooded but Congress celebrates: BJP slams anniversary event timingBJP criticised the Karnataka government over its priorities, as while Bengaluru battled flooding and reported rain-related deaths, the Congress marked its government's two-year anniversary with a grand event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/luke-coutinho-on-the-rise-of-heart-attacks-in-the-fit-and-young-2727572-2025-05-20",
      "headline": "Luke Coutinho on the rise of heart attacks in the 'fit and young'In an exclusive interview, Luke Coutinho broke down how being 'fit' and working out isn't enough to keep your heart healthy; it's, at the end of the day, the overall lifestyle that counts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-venue-change-ahmedabad-eden-gardens-playoffs-mullanpur-2727653-2025-05-20",
      "headline": "IPL 2025 final taken out of Kolkata, to be played in AhmedabadThe Indian Premeir League final 2025 final will be played in Ahmedabad, the Indian Cricket Board announced on Tuesday, May 20. Two of the playoffs matches have been shifted to Mullanpur."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/asim-munir-becomes-field-marshal-decoding-the-pakistan-armys-top-rank-2727715-2025-05-20",
      "headline": "Asim Munir to become Field Marshal: Decoding the Pakistan Army's top rankThis elevation marks only the second time in Pakistan's history that the five-star rank has been awarded."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/is-donald-trump-familys-pakistan-crypto-deal-behind-his-india-pak-mediation-itch-2727652-2025-05-20",
      "headline": "Is Trump family's Pakistan crypto deal behind his Indo-Pak mediation itch?Donald Trump's family-backed World Liberty Financial signed a deal with Pakistan Crypto Council days after the Pahalgam attack. Was Trump's urge to mediate in the India-Pakistan war triggered by the deal? The WLF and its stablecoin have been questioned in the US over conflicts of interest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/even-akshay-is-clueless-suniel-shetty-reacts-to-paresh-rawals-exit-from-hera-pheri-3-2727570-2025-05-20",
      "headline": "Even Akshay is clueless: Suniel Shetty on Paresh Rawal's exit from Hera Pheri 3Actor Suniel Shetty, in an exclusive interview with IndiaToday.in, said that the sudden announcement of Paresh Rawal's exit from 'Hera Pheri 3' was shocking, calling it a \"big crisis\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/an-architectural-trail-in-gujarat-2723608-2025-05-15",
      "headline": "An Architectural Trail in GujaratPress Release | Vadnagar has substantial remains of its ancient Buddhist heritage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-awami-league-ban-muhammad-yunus-islamists-cant-kill-sheikh-hasina-al-sheikh-mujibur-rahman-2727402-2025-05-20",
      "headline": "Why Yunus govt, Bangladesh Islamists can't kill Awami LeagueThe Awami League, banned by Muhammad Yunus' interim government, isn't a political party but a cult. Outlawed thrice in the past, the party sprang back to life each time, and commands a 40% vote share. It is the inheritor of Mujibur Rahman's legacy, whose life is integral to Bangladesh's freedom struggle, and Bengali nationalism. This is why Islamists or Yunus won't be able to sink the AL boat."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/indian-origin-couple-neha-sharma-amandeep-sharma-swindle-nz2-million-flying-india-business-class-new-zealand-2727494-2025-05-20",
      "headline": "After Rs 10-crore scam, New Zealand couple flew business class to IndiaAn Indian-origin couple living in Christchurch, New Zealand, are alleged to have been involved in a scam that defrauded the country's child welfare agency of NZ$2 million (Rs 10 crore). After the scam was discovered, they flew business class to India in 2023, but the law caught up with them. While Neha Sharma was jailed earlier in May, her husband, Amandeep, has pleaded guilty recently."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/naani-ke-ghar-rasna-and-dark-room-the-indian-summer-vacation-in-the-90s-gave-us-2727541-2025-05-20",
      "headline": "The lost summers of 'naani ka ghar': What 90s kids had that Gen Z doesn'tBack when summer meant a train to Naani's house, not a flight to a resort. When cousins were your first best friends, not just names on a family WhatsApp group. Let's rewind to the Great Indian summer vacation of the 90s-the kind that today's kids may never truly know.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/covid-19-cases-surge-asia-mild-increase-india-vigilance-thailand-singapore-hong-kong-2727486-2025-05-20",
      "headline": "What's behind the sudden spike of Covid-19 cases in Asia?Covid-19 cases have surged in several Asian countries, including Hong Kong, Singapore, and Thailand. India, however, reports a mild increase."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-missile-drone-attack-golden-temple-army-guns-head-granthi-operation-sindoor-2727358-2025-05-20",
      "headline": "Army officer says Golden Temple gave nod to deploy guns, head granthi denies claimIn an unprecedented move, the chief religious official of the Golden Temple permitted the Indian Army to deploy air defence systems within the shrine's premises to counter Pakistani drone and missile attacks amid India's Operation Sindoor. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ashoka-university-professor-ali-khan-mahmudabad-sent-to-14-day-judicial-custody-over-op-sindoor-post-2727617-2025-05-20",
      "headline": "Ashoka University professor sent to jail for 14 days in Op Sindoor post caseAli Khan Mahmudabad was arrested on Sunday after his social media post was perceived as critical of the armed forces and disrespectful to women officers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aishwarya-rai-arrives-at-cannes-with-daughter-aaradhya-bachchan-2727680-2025-05-20",
      "headline": "Aishwarya Rai arrives in Cannes with daughter Aaradhya. WatchAishwarya Rai Bachchan has arrived at the Cannes Film Festival 2025 alongside her daughter Aaradhya. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-kanteerava-stadium-sampangi-lake-revival-rain-flood-water-traffic-bangalore-waterlogging-2727674-2025-05-20",
      "headline": "Beneath Bengaluru's iconic Kanteerava stadium, a lake stirs in fresh rain?Heavy rains left Bengaluru waterlogged, with a viral video showing flood water entering the popular Kanteerava Stadium. The stadium, which is home for Bengaluru FC, sits atop the old Sampangi Lake bed, reminding the city of its forgotten water heritage and urban planning gaps."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/anwar-dhebar-liquor-scam-rajasthan-supreme-court-bail-money-laundering-2727649-2025-05-20",
      "headline": "1-year jail not mandatory for bail: Supreme Court frees liqour scam accusedThe Supreme Court granted bail to businessman Anwar Dhebar in the alleged Rs 2,000 crore liquor scam case and said, \"It is not a rule to be in custody for a year to get bail\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/mumbai/story/covid-19-in-india-active-cases-in-mumbai-health-minister-prakash-abitkar-situation-under-control-2727629-2025-05-20",
      "headline": "Mumbai reports 53 active Covid cases, government says situation under controlMunicipal hospitals in the city are making arrangements for dedicated treatment facilities for Covid-19 patients, with the BMC urging calm, saying it is constantly monitoring the current situation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/alarm-snooze-disrupts-sleep-and-reduces-sleep-quality-harvard-study-reveals-2727590-2025-05-20",
      "headline": "Why hitting the snooze button is not great for your sleepA global study reveals that hitting the snooze button disrupts important REM sleep stages. Experts warn this habit may lead to grogginess and poorer sleep quality."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/environment/story/kerala-braces-for-early-monsoon-imds-prediction-may-miss-the-mark-2727635-2025-05-20",
      "headline": "Kerala braces for early monsoon, IMD's prediction may miss the markA low-pressure system forming in the Arabian Sea is expected to intensify into a cyclonic circulation in the next couple of days. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/former-rjd-mla-shares-video-of-distressed-air-india-passengers-after-ac-malfunction-2727636-2025-05-20",
      "headline": "Ex-RJD MLA shares video of distressed Air India passengers after AC malfunctionFormer Rashtriya Janata Dal MLA Rishi Mishra shared a video from inside an Air India flight, showing visibly distressed passengers after the AC malfunctioned."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kannada-actor-ranya-rao-gold-smuggling-case-granted-bail-but-to-remain-in-custody-under-cofeposa-2727633-2025-05-20",
      "headline": "Ranya Rao to remain in custody despite bail in gold smuggling caseKannada actor Ranya Rao and co-accused Kondaru Raju were granted conditional bail by a special court after the DRI failed to file a charge sheet. However, Rao remains in custody due to a separate case under more stringent law. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/csk-vs-rr-live-score-ipl-2025-updates-delhi-2727700-2025-05-20",
      "headline": "CSK vs RR, IPL 2025 Live Score: Chennai, Rajasthan lock horns to avoid last spotCSK vs RR, IPL 2025 Live Score: Chennai Super Kings and Rajasthan Royals are set to lock horns in the Match 62 of the Indian Premier League 2025 (IPL 2025) with an aim to avoid the last spot. CSK are coming into the fixture, having beaten KKR in their last game, while RR are on a three-match losing streak. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-jumps-fence-to-meet-little-fan-at-arun-jaitley-stadium-2727675-2025-05-20",
      "headline": "Watch: MS Dhoni jumps fence to meet little fan at Arun Jaitley StadiumChennai Super Kings (CSK) wicketkeeper batter MS Dhoni had a heartwarming meet-up with a young fan as he jumped over fence to meet him at the Arun Jaitley Stadium in Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-europa-league-final-manchester-united-injury-boost-zirkzee-yoro-dalot-2727678-2025-05-20",
      "headline": "Manchester United receive triple injury boost ahead of Europa League finalManchester United received a potential triple injury boost ahead of their UEFA Europa League final against Tottenham Hotspur on Wednesday, May 21. Leny Yoro, Joshua Zirkzee and Diogo Dalot took part in the training session before the final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-srh-venue-change-bengaluru-rains-lucknow-2727660-2025-05-20",
      "headline": "RCB vs SRH moved out of Bengaluru due to heavy rainfall, Lucknow new venueRCB's final home game against SRH has been moved out of Bengaluru due to the incessant rains in the city. The match on May 23 will now take place in Lucknow. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-venue-change-ahmedabad-eden-gardens-playoffs-mullanpur-2727653-2025-05-20",
      "headline": "IPL 2025 final taken out of Kolkata, to be played in AhmedabadThe Indian Premeir League final 2025 final will be played in Ahmedabad, the Indian Cricket Board announced on Tuesday, May 20. Two of the playoffs matches have been shifted to Mullanpur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-kevin-de-bruyne-manchester-city-club-world-cup-2727632-2025-05-20",
      "headline": "De Bruyne coy on playing Club World Cup for Manchester City: Maybe I won't playKevin de Bruyne admitted that he may not play the Club World Cup for Manchester City as he wants to take care of himself. De Bruyne is set to leave City in the summer. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rishabh-pant-needs-a-break-kris-srikkanth-vs-srh-playoffs-race-2727621-2025-05-20",
      "headline": "Rishabh Pant needs a break: Kris Srikkanth urges LSG to rest their skipperFormer India cricketer Kris Srikkanth believes Lucknow Super Giants should rest Rishabh Pant for the remainder of IPL 2025, citing the batter's prolonged slump in form and the team's exit from playoff contention."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-brendon-mccullum-ashes-ben-stokes-wtc-2727606-2025-05-20",
      "headline": "England coach Brendon McCullum aims for glory in decisive 2025: Time to shoot for starsEngland coach Brendon McCullum wants his side to chase glory with the India series and Ashes on the horizon. England will face India in a five-match Test series, starting from June 20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-r-ashwin-tom-moody-csk-2727588-2025-05-20",
      "headline": "CSK have to let go R Ashwin if they are to release funds: MoodyIPL 2025: Tom Moody said that the Chennai Super Kings (CSK) have to let go R Ashwin before the season to free up their purse. CSK bought Ashwin for Rs 9.75 crore in the mega auction last year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-srh-rishabh-pant-sanjiv-goenka-lucknow-2727582-2025-05-20",
      "headline": "LSG owner Sanjiv Goenka posts heartwarming image with Pant after IPL exitLSG owner Sanjiv Goenka shared a heartwarming image with Rishabh Pant after the team's exit from the IPL 2025. Lucknow were eliminated after their loss to Hyderabad at the Ekana stadium on May 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fc-barcelona-nico-williams-not-transfer-target-joan-laporta-confirms-2727550-2025-05-20",
      "headline": "FC Barcelona not looking at Nico Williams in transfer plans: Laporta confirmsBarcelona president Joan Laporta has confirmed that the club is no longer pursuing a move for Athletic Club winger Nico Williams. While the Spaniard was previously on their shortlist, Barcelona are now focusing on other targets ahead of the summer window."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rishabh-pant-needs-a-break-kris-srikkanth-vs-srh-playoffs-race-2727621-2025-05-20",
      "headline": "Rishabh Pant needs a break: Kris Srikkanth urges LSG to rest their skipperFormer India cricketer Kris Srikkanth believes Lucknow Super Giants should rest Rishabh Pant for the remainder of IPL 2025, citing the batter's prolonged slump in form and the team's exit from playoff contention."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-brendon-mccullum-ashes-ben-stokes-wtc-2727606-2025-05-20",
      "headline": "England coach Brendon McCullum aims for glory in decisive 2025: Time to shoot for starsEngland coach Brendon McCullum wants his side to chase glory with the India series and Ashes on the horizon. England will face India in a five-match Test series, starting from June 20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-r-ashwin-tom-moody-csk-2727588-2025-05-20",
      "headline": "CSK have to let go R Ashwin if they are to release funds: MoodyIPL 2025: Tom Moody said that the Chennai Super Kings (CSK) have to let go R Ashwin before the season to free up their purse. CSK bought Ashwin for Rs 9.75 crore in the mega auction last year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-srh-rishabh-pant-sanjiv-goenka-lucknow-2727582-2025-05-20",
      "headline": "LSG owner Sanjiv Goenka posts heartwarming image with Pant after IPL exitLSG owner Sanjiv Goenka shared a heartwarming image with Rishabh Pant after the team's exit from the IPL 2025. Lucknow were eliminated after their loss to Hyderabad at the Ekana stadium on May 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fc-barcelona-nico-williams-not-transfer-target-joan-laporta-confirms-2727550-2025-05-20",
      "headline": "FC Barcelona not looking at Nico Williams in transfer plans: Laporta confirmsBarcelona president Joan Laporta has confirmed that the club is no longer pursuing a move for Athletic Club winger Nico Williams. While the Spaniard was previously on their shortlist, Barcelona are now focusing on other targets ahead of the summer window."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}