{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-electronics-gets-rs-1500-crore-boost-as-apple-manufacturing-expands-in-india-2837871-2025-12-18",
      "headline": "Tata Electronics gets Rs 1,500 crore boost as Apple manufacturing expands in IndiaThe fresh funding underlines Tata Group's continued support for expanding capacity at Tata Electronics, which has emerged as one of Apple's largest iPhone manufacturing partners in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-is-the-demand-to-raise-the-minimum-eps-pension-to-rs-7500-still-stuck-at-rs-1000-2837808-2025-12-18",
      "headline": "Why hasn't the minimum EPS pension been raised from Rs 1,000 to Rs 7,500?The government has reiterated financial and actuarial constraints in response to renewed calls for an increase in the minimum EPS-95 pension, but no timeline or policy decision has been announced."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/amazon-to-lay-off-370-staff-in-luxembourg-whats-driving-the-job-cuts-2837784-2025-12-18",
      "headline": "Amazon to lay off 370 staff in Luxembourg. What's driving the job cuts?Amazon employs about 4,370 people in Luxembourg, and the planned cuts will affect nearly 8.5% of its workforce there. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/worst-behind-us-indigo-ceo-tells-staff-blames-compounding-effect-of-several-factors-for-cancellations-2837780-2025-12-18",
      "headline": "Worst behind us, IndiGo CEO tells staff after days of flight cancellations chaosAfter days of cancellation chaos, IndiGo said it has stabilised operations and restored its network to about 2,200 flights a day. Meanwhile, CEO Pieter Elbers has blamed the disruption on a compounding effect of several factors. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/why-founder-bhavish-aggarwal-is-selling-ola-electric-stake-shares-fall-all-time-low-promoter-sell-2837776-2025-12-18",
      "headline": "Why Ola Electric's Bhavish Aggarwal is selling stake as shares hit 52-week lowThe immediate reason for the latest fall of Ola Electric has been Bhavish Aggarwal's back‑to‑back selling of the stock in the open market over two days, worth well over Rs 200 crore in total."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/ola-electric-shares-fall-52-week-low-stake-sale-bhavish-aggarwal-offloading-promoter-2837729-2025-12-18",
      "headline": "Explained: Why Ola Electric shares fell 4% to hit 52-week low todayOla Electric share price: The stock hit a low of Rs 31.54 on December 18, marking its weakest level since listing."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/rrp-semiconductor-ltd-best-performing-stock-ai-bubble-concern-report-2837713-2025-12-18",
      "headline": "55,000% rally in Indian AI stock triggers bubble concerns: ReportA little-known Indian company has delivered a stunning 55,000% rise in just under two years, raising serious questions about hype, regulation and investor risk. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-189-points-lower-nifty-below-25800-infosys-up-1-percent-2837708-2025-12-18",
      "headline": "Sensex opens 189 points lower, Nifty below 25,800; Infosys up 1%The S&P BSE Sensex was down by 87.06 points to 84,472.59, while the NSE Nifty50 lost 24.30 points to 25,794.25 as of 9:28 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/gmp-icici-prudential-amc-expected-profit-share-price-listing-date-details-allotment-check-bse-kfin-2837690-2025-12-18",
      "headline": "ICICI Prudential AMC IPO GMP today: Is market hinting at listing gains tomorrow?The IPO allotment was finalised on Wednesday, following heavy demand from institutional investors over the three-day subscription window."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-eb4-visa-process-for-foreign-technical-experts-glbs-2837630-2025-12-18",
      "headline": "India eases visa process for foreign professionals, engineers hired by firmsIndia has introduced a simplified e-B-4 visa process to facilitate foreign experts' entry for manufacturing projects. The move aims to reduce visa processing time and support faster industrial execution."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/poses-risks-warner-bros-discovery-board-rejects-108-billion-rival-bid-from-paramount-netflix-in-race-2837474-2025-12-17",
      "headline": "Warner Bros rejects Paramount's $108-billion hostile bid, Netflix in raceThe board said Netflix's $27.75-per-share binding merger offers greater certainty, stronger finances and lower risk for shareholders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-walmart-to-reliance-meet-the-worlds-10-richest-families-2837436-2025-12-17",
      "headline": "From Walmart to Reliance: Meet the world's 10 richest familiesFrom retail giants to oil empires, the world's richest families control businesses that shape global markets. Let's look at the 10 richest families globally, with the Ambani family representing India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-nse-bse-rupee-gain-fii-selling-sbi-psu-bank-shares-2837335-2025-12-17",
      "headline": "Sensex ends 120 points lower, Nifty below 25,900; SBI gains 2%The S&P BSE Sensex was down 120.21 points to close at 84,559.65, while the NSE Nifty50 lost 41.55 points to end at 25,818.55. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/no-tax-gst-on-health-insurance-will-premium-come-down-low-cost-or-not-insurer-personal-finance-2837317-2025-12-17",
      "headline": "Zero GST on health insurance: What it means for your premium and your pocketFrom September 22, individual health and life insurance policies have become free from Goods and Services Tax, removing the 18% tax that policyholders were paying earlier."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/8th-pay-commission-when-will-it-be-implemented-and-how-much-can-you-expect-2837249-2025-12-17",
      "headline": "8th Pay Commission: When will it be implemented and how much can you expect?The 8th Pay Commission has officially been set up, but the big questions remain unanswered. When will the new pay structure be implemented, and how much of a salary hike can central government employees realistically expect?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/silver-prices-hit-record-high-gold-rate-today-mcx-should-you-invest-outshining-yellow-metal-2837224-2025-12-17",
      "headline": "Silver rates reach new high: Why is it beating gold prices, and should you buy?On the Multi Commodity Exchange (MCX), silver jumped over 4% during early trade. Around 9:20 am, MCX silver was trading 3.38% higher at Rs 2,04,445 per kg, touching a lifetime high."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/what-is-the-70-salary-rule-and-where-the-other-30-should-go-2837215-2025-12-17",
      "headline": "What is the 70% salary rule and where the other 30% should go?Abhishek Walia urges individuals to base their spending only on verified take-home pay, warning that relying on bonuses or predicted increments leads to financial stress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/planning-to-exit-nps-here-is-how-the-new-rules-affect-your-retirement-payout-2837175-2025-12-17",
      "headline": "Planning to exit NPS? Here's how the new rules affect your retirement payoutThe pension regulator has eased NPS exit rules, allowing subscribers to access more of their money upfront. If retirement is around the corner, these changes could directly impact your final payout."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/vedanta-demerger-news-shareholders-new-stock-anil-agarwal-statement-five-entities-share-price-today-2837128-2025-12-17",
      "headline": "Vedanta shares in focus as it gets NCLT approval for demerger. Check detailsVedanta share price: The approval clears a key legal hurdle and allows the company to move ahead with splitting its businesses into multiple listed entities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-nifty-open-higher-psu-banking-stocks-rally-eternal-up-2837071-2025-12-17",
      "headline": "Sensex, Nifty open marginally higher as banking stocks rally in early tradeThe S&P BSE Sensex was up by 91.32 points to 84,771.18, while the NSE Nifty50 added 44.40 points to 25,904.50 as of 9:22 am. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ek-deewane-ki-deewaniyat-harshvardhan-rane-sonam-bajwa-on-ott-when-where-to-watch-romantic-drama-2837917-2025-12-18",
      "headline": "Ek Deewane Ki Deewaniyat on OTT: When and where to watch romantic film online The romantic drama 'Ek Deewane Ki Deewaniyat' is set to stream on OTT. The film stars Harshvardhan Rane and Sonam Bajwa in leading roles and is directed by Milap Zaveri."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhurandhar-crushes-baahubali-at-box-office-in-13-days-eyes-rs-1000-crore-2837896-2025-12-18",
      "headline": "Dhurandhar crushes Baahubali at box office in 13 days, eyes Rs 1,000 crore Dhurandhar beat Baahubali's lifetime India and worldwide run in just 13 days. The A-rated spy thriller eyes the Rs 1,000-crore club amid a historic box office run. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/leonardo-dicaprio-says-he-has-never-watched-titanic-jennifer-lawrence-amused-2837848-2025-12-18",
      "headline": "Leonardo DiCaprio says he has never watched Titanic, Jennifer Lawrence is amused Leonardo DiCaprio has shared in a conversation with Jennifer Lawrence that he has never watched his iconic film Titanic. The actor discussed his tendency to avoid watching his own movies, touching on his experiences with a few notable projects."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/javed-akhtar-demands-unconditional-apology-from-nitish-kumar-over-hijab-incident-2837880-2025-12-18",
      "headline": "Javed Akhtar demands unconditional apology from Nitish Kumar over Hijab incident The viral video of Bihar CM Nitish Kumar pulling down a lady doctor's hijab drew strong condemnation from veteran lyricist Javed Akhtar. The lyricist asserted that Kumar must issue an \"unconditional apology to the lady.\"\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/fallout-season-2-review-bigger-stakes-darker-laughs-and-a-wilder-wasteland-2837730-2025-12-18",
      "headline": "Fallout Season 2 review: Bigger stakes, darker laughs and a wilder wastelandRelease Date:Wed Dec 17, 2025 Prime Video's Fallout Season 2 goes bigger and bolder, expanding the wasteland with darker humour, new characters and higher stakes. Read our review.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mohammad-kaif-joins-yuvraj-singh-virendra-sehwag-on-kapil-sharma-show-2837829-2025-12-18",
      "headline": "Mohammad Kaif reunites with Yuvraj Singh, Virendra Sehwag on Kapil Sharma's show Mohammad Kaif shared pictures from the set of 'The Great Indian Kapil Show', showing his reunion with Yuvraj Singh, Virendra Sehwag, Kapil Sharma and Navjot Singh Sidhu. The fourth season of the Netflix series will be releasing on December 20, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shraddha-kapoor-applauds-dhurandhar-technicians-calls-film-a-big-moment-2837851-2025-12-18",
      "headline": "Shraddha Kapoor applauds Dhurandhar technicians, calls film a big moment Shraddha Kapoor has praised the technical team of the film 'Dhurandhar'. She emphasised their often overlooked contributions and described the film as a significant moment for Indian cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anupam-kher-praises-varanasi-railway-station-cleanliness-congratulates-pm-modi-2837790-2025-12-18",
      "headline": "Anupam Kher praises Varanasi railway station's cleanliness, congratulates PM Modi Actor Anupam Kher, on his way to Khajuraho by train, filmed a video at the Varanasi railway station at 5 am. While highlighting the clean premises, Kher praised the efforts of the Indian Railways and Prime Minister Narendra Modi for transforming the Swachch Bharat initiative \"into a possible reality.\"\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/chiranjeevi-hanuman-the-eternal-first-look-released-2026-mythological-film-2837853-2025-12-18",
      "headline": "First look of Chiranjeevi Hanuman The Eternal out, film to release in 2026 The first look of Chiranjeevi Hanuman - The Eternal was unveiled today. The film that tells the story of the legendary Lord Hanuman is directed by National Award-winning filmmaker Rajesh Mapuskar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/yoon-bomi-music-producer-rado-marry-may-2026-nine-year-relationship-2837835-2025-12-18",
      "headline": "Apink's Yoon Bomi confirms marriage to producer Rado after nine years of dating Yoon Bomi of Apink and producer Rado have confirmed plans to marry in May 2026, following nine years as a couple. Both intend to continue their careers after marriage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-tops-weekly-tv-ratings-beats-anupamaa-2837839-2025-12-18",
      "headline": "Bigg Boss 19 grand finale records massive ratings, beats Anupamaa at the top Bigg Boss 19's grand finale recorded the highest viewership of the week, overtaking long-time leader Anupamaa on the television ratings chart. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dacoit-teaser-mrunal-thakur-takes-the-wheel-in-slick-heist-film-with-adivi-sesh-2837825-2025-12-18",
      "headline": "Dacoit teaser: Mrunal Thakur takes the wheel in slick heist film with Adivi Sesh Adivi Sesh and Mrunal Thakur teamed up for the high-octane heist thriller Dacoit, set to release on Ugadi 2026. The teaser for the upcoming Telugu film was released on December 18. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aditya-dhar-reacts-to-2611-survivors-dhurandhar-review-speaks-of-brutal-truth-2837823-2025-12-18",
      "headline": "Aditya Dhar reacts to 26/11 survivors' Dhurandhar review, speaks of brutal truth Aditya Dhar thanks 26/11 survivors for their Dhurandhar review, saying the film aimed to reflect the brutal truth and collective memory.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/tu-meri-main-tera-main-tera-tu-meri-trailer-kartik-aaryan-ananya-panday-holiday-romance-goes-awry-2837830-2025-12-18",
      "headline": "Tu Meri Main Tera trailer: Kartik Aaryan, Ananya Panday's holiday romance goes awry The trailer for 'Tu Meri Main Tera Main Tera Tu Meri', starring Kartik Aaryan and Ananya Panday, has been unveiled. The film, directed by Sameer Vidwans and produced by Dharma Productions and Namah Pictures, explores romance and emotional complexity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/pushpa-director-sukumar-praises-avatar-fire-and-ash-after-ss-rajamouli-2837783-2025-12-18",
      "headline": "After SS Rajamouli, Pushpa director Sukumar praises Avatar: Fire and Ash 'Pushpa' director Sukumar has praised James Cameron's film 'Avatar: Fire and Ash'. He called the third instalment of the Avatar franchise an absolute blockbuster. The filmmaker also recommended it as a must-see cinematic event for families."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actor-suriya-gifts-gold-chain-to-one-year-old-on-his-birthday-watch-viral-video-2837794-2025-12-18",
      "headline": "Actor Suriya gifts gold chain to one-year-old on his birthday. Watch viral video Actor Suriya recently surprised a family by gifting a gold chain to a toddler on his first birthday. The gesture was captured in a video shared online by the child's father."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/yoo-ah-in-jang-jae-hyun-vampire-film-casting-speculation-2837746-2025-12-18",
      "headline": "Yoo Ah-in set for comeback in Exhuma director's Vampire? Agency responds Uncertainty surrounds Yoo Ah-in's possible return to acting as reports link him to Jang Jae Hyun's upcoming vampire-themed film, with both the actor's agency and the director issuing cautious statements."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/how-anusha-rizvi-the-great-shamsuddin-family-normalises-muslim-womanhood-on-screen-2837760-2025-12-18",
      "headline": "The Great Shamsuddin Family: Where Muslim women are allowed to just be The Great Shamsuddin Family is a credible attempt to redefine the portrayal of Muslim women on Indian screens by showcasing their everyday lives beyond stereotypes. The film captures the complex, flawed, and resilient spirit of modern Indian women juggling family, faith, and the relentless hustle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/nick-reiner-charged-murder-rob-michele-reiner-los-angeles-tragedy-2837767-2025-12-18",
      "headline": "Rob Reiner's family issues first statement as Nick faces murder trial The children of Rob and Michele Reiner have issued a statement following the deaths of their parents, as their brother Nick Reiner appears in court charged with murder. Nick's arraignment has been postponed to January 7, amid ongoing legal proceedings."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mahatma-gandhis-name-was-added-to-nrega-with-eye-on-2009-polls-shivraj-singh-chouhan-in-lok-sabha-2837836-2025-12-18",
      "headline": "G RAM G Bill that will replace MNREGA clears Lok Sabha amid Opposition protestsThe G RAM G Bill guarantees 125 days of rural employment per household and mandates state-level alignment within six months, with the Opposition accusing Centre of mistreating Mahatma Gandhi's legacy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/h1b-india-news-us-visa-crisis-worsens-some-appointments-postponed-october-2026-deferred-america-h4-interview-2837806-2025-12-18",
      "headline": "US visa crisis worsens, H-1B interviews in India postponed to October 2026The crisis could deepen for hundreds of Indians with jobs in the US, with H-1B visa interviews postponed further to October 2026. Scores of Indians, some separated from their families, are stranded with jobs hanging by a thread. The US had earlier postponed H-1B interviews from December 2025 to March 2026 even as it expanded social media scrutiny."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/uttar-pradesh-jaunpur-horror-son-kills-parents-chops-bodies-muslim-woman-marriage-2837820-2025-12-18",
      "headline": "UP man kills parents, chops bodies with saw after dispute over Muslim wifeA five-day search for a missing elderly couple in Jaunpur ended after police found that their own son brutally killed them, chopped their bodies with a saw, and dumped them into rivers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/javed-akhtar-demands-unconditional-apology-from-nitish-kumar-over-hijab-incident-2837880-2025-12-18",
      "headline": "Javed Akhtar demands unconditional apology from Nitish Kumar over Hijab incidentThe viral video of Bihar CM Nitish Kumar pulling down a lady doctor's hijab drew strong condemnation from veteran lyricist Javed Akhtar. The lyricist asserted that Kumar must issue an \"unconditional apology to the lady.\"\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/how-anusha-rizvi-the-great-shamsuddin-family-normalises-muslim-womanhood-on-screen-2837760-2025-12-18",
      "headline": "The Great Shamsuddin Family: Where Muslim women are allowed to just beThe Great Shamsuddin Family is a credible attempt to redefine the portrayal of Muslim women on Indian screens by showcasing their everyday lives beyond stereotypes. The film captures the complex, flawed, and resilient spirit of modern Indian women juggling family, faith, and the relentless hustle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maharashtra-village-yavatmal-record-number-births-cyber-fraud-2837779-2025-12-18",
      "headline": "27,000 'births' in 3 months in this Maharashtra village of 1,500An investigation found that the birth and death registration system of the village in Maharashtra's Yavatmal had been compromised. The BJP said 99% of the names found in the entries belong to people from Bengal and Uttar Pradesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/over-2-lakh-giving-up-indian-citizenship-each-year-what-is-behind-the-exodus-to-usa-uk-canada-australia-explained-why-2837119-2025-12-18",
      "headline": "Over 2 lakh Indians giving up citizenship each year. What's behind the exodus?The Ministry of External Affairs told the Parliament that over nine lakh Indians have given up their citizenship in the last 5 years, with over 2 lakh per year since 2022. Why are Indians renouncing citizenship in record numbers?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nidhhi-agerwal-mobbed-the-raja-saab-song-launch-hyderabad-celebrity-safety-concerns-2837667-2025-12-18",
      "headline": "Worse than hyenas: Actor Nidhhi Agerwal swarmed by vulture-like crowd at eventActress Nidhhi Agerwal was mobbed while exiting The Raja Saab song launch in Hyderabad, leading to concern among fans and netizens about safety and event management."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-goat-india-tour-unites-top-indian-athletes-memorable-sports-exchange-2837902-2025-12-18",
      "headline": "Watch: Messi rocks India cricket jersey, leaves fanboy Kuldeep Yadav star struckLionel Messi, donning the Indian cricket jersey, met some of the country's top athletes, including Kuldeep Yadav, Renuka Singh Thakur, Nikhat Zareen and para stars Sumit Antil and Nishad Kumar. Messi visited India on a much-publicised four-day trip. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/parliament-winter-session-2025-live-updates-lok-sabha-rajya-sabha-discussions-pollution-delhi-air-quality-crisis-g-ram-g-bill-2837764-2025-12-18",
      "headline": "Live: Only oligarchisation, Trinamool MP slams SHANTI Bill in Rajya SabhaParliament Winter Session Live Updates: The Parliament has seen a hectic day so far, with the G RAM G bill getting the Lok Sabha nod before the House got adjourned for the day. The Rajya Sabha, meanwhile, remains functional for Day 14. This potentially means that a discussion on Delhi-NCR's worsening air quality that was scheduled to take place in Lok Sabha has been cancelled. It is not yet known whether it will happen tomorrow, which is also the final day of this year's winter session. Stay tuned and keep checking indiatoday.in for live updates on Parliament Winter Session 2025."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/european-union-leaders-ursula-von-der-leyen-antonio-costa-likely-republic-day-guests-2837935-2025-12-18",
      "headline": "EU leaders Ursula von der Leyen, Antonio Costa likely to be Republic Day guestsThe European Commission President Ursula von der Leyen and other leaders, including European Council President Antonio Costa, are likely to be the chief guests at next year's January 26 parade, sources told India Today TV."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/united-states-us-embassy-visa-expiry-date-duration-of-stay-length-donald-trump-immigration-migrants-homeland-i-94-forms-customs-officer-2837867-2025-12-18",
      "headline": "How long can visitors stay in US? Embassy clarifies on visa expiry dateThe US Embassy in India has reiterated how long international visitors heading to the country will be allowed to stay, clarifying that it's not as per their visa expiry date."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/science/story/snow-fake-snowfall-winters-india-europe-gulmarg-kashmir-nainital-mountain-regions-artifical-snow-climate-change-2837802-2025-12-18",
      "headline": "Fake snow, real crisis: How climate change is rewriting Indian wintersThis human rendition of snow is helping to revive a declining snow-tourism industry as snowfall grows rare due to climate change."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhurandhar-crushes-baahubali-at-box-office-in-13-days-eyes-rs-1000-crore-2837896-2025-12-18",
      "headline": "Dhurandhar crushes Baahubali at box office in 13 days, eyes Rs 1,000 croreDhurandhar beat Baahubali's lifetime India and worldwide run in just 13 days. The A-rated spy thriller eyes the Rs 1,000-crore club amid a historic box office run. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/features/story/quick-look-bharat-taxi-is-here-and-it-is-already-very-different-from-uber-ola-rapido-2837913-2025-12-18",
      "headline": "Quick look: Bharat Taxi is here and it is already very different from Uber, Ola, RapidoBharat Taxi is a new entrant in India's burgeoning ride-hailing space. In the coming days, it will take on Uber and Ola, with some unique feature-set and strong backing from the government of India. India Today Tech takes a look."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/why-founder-bhavish-aggarwal-is-selling-ola-electric-stake-shares-fall-all-time-low-promoter-sell-2837776-2025-12-18",
      "headline": "Why Ola Electric's Bhavish Aggarwal is selling stake as shares hit 52-week lowThe immediate reason for the latest fall of Ola Electric has been Bhavish Aggarwal's back‑to‑back selling of the stock in the open market over two days, worth well over Rs 200 crore in total."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/thar-stuck-on-railway-tracks-near-dimapur-station-driver-detained-viral-video-2837847-2025-12-18",
      "headline": "Thar stuck on railway tracks near Dimapur station, driver detained. Viral videoA video of a Mahindra Thar stranded on the railway tracks near Nagaland's Dimapur station has gone viral. The driver and vehicle have been detained."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tamil-nadu-vijay-erode-speech-dmk-evil-force-tvk-pure-force-2026-2837832-2025-12-18",
      "headline": "DMK evil, TVK pure: Vijay's poll pitch at 1st Tamil Nadu rally after Karur stampedeVijay attacked the DMK at a public meeting in Erode, calling it an \"evil force.\" He projected TVK as a \"clean and pure force\" ahead of 2026. He flagged failures in governance, irrigation, jobs, safety and farmer welfare."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/inside-philippines-hotel-room-bondi-beach-massacre-gunmen-holed-up-sajid-akram-naveed-sydney-mass-shooting-hanukkah-2837759-2025-12-18",
      "headline": "Room 315, fast food: What Bondi terrorists did in Philippines hotel for a monthThe two terrorists who killed 15 civilians at Australia's Bondi Beach travelled to the Philippines in November. For almost a month, Sajid Akram and his son Naveed spent most of the time in room 315 of GV Hotel in Davao city in southern Philippines. The room was sparsely furnished and hotel staff recount a quiet routine of the duo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/age-reversing-ceo-bryan-johnson-claims-his-body-functions-like-an-18-year-old-eyes-immortality-by-2039-2837822-2025-12-18",
      "headline": "'Age-reversing' CEO claims teenage-level health, eyes immortality by 2039'Age-reversing' CEO Bryan Johnson has revealed new details and ambitious goals for his quest to slow ageing, stating his aim to achieve 'immortality' by 2039. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/artificial-intelligence-ai-india-germany-spain-data-centres-natural-resources-climate-change-global-warming-2837736-2025-12-18",
      "headline": "ChatGPT is super thirsty: Your AI search is guzzling Earth's waterGlobally, around 45 per cent of data centres are located in river basins already facing high water availability risk."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/indians-abroad/story/lalit-modi-hosts-vijay-mallya-70th-birthday-at-london-home-pictures-fugitives-2837910-2025-12-18",
      "headline": "Lalit Modi hosts birthday bash for 'king of good times' Vijay Mallya in LondonLondon party photos show fugitives Vijay Mallya and Lalit Modi together again, years after both left India amid separate probes into alleged financial irregularities. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-lucknow-t20i-fog-abandoned-rajiv-shukla-weather-concerns-future-scheduling-2837837-2025-12-18",
      "headline": "BCCI to factor in weather when scheduling: Rajiv Shukla amid backlash on Lucknow T20IIND vs SA: The Lucknow T20I washout triggered widespread fan anger over scheduling in winter conditions. BCCI vice-president Rajiv Shukla assured weather and pollution will be key factors in future planning."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/career-minimalism-professional-goal-gen-z-hustle-culture-2837309-2025-12-18",
      "headline": "Career minimalism is Gen Z's way to escape hustle culture. But what is it?Gen Z is no longer chasing professional goals blindly; they are working with intention, choosing roles that align with their personal values, mental well-being, and long-term financial stability."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smat-2025-final-live-score-haryana-vs-jharkhand-ishan-kishan-ankit-kumar-2837921-2025-12-18",
      "headline": "SMAT 2025 final live score: Kishan's Jharkhand takes on Ankit Kumar's Haryana SMAT 2025 final live score: Haryana and Jharkhand are set to lock horns in the final of the Syed Mushtaq Ali Trophy 2025 on Thursday, December 18 at Maharashtra Cricket Association Stadium in Pune. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-goat-india-tour-unites-top-indian-athletes-memorable-sports-exchange-2837902-2025-12-18",
      "headline": "Watch: Messi rocks India cricket jersey, leaves fanboy Kuldeep Yadav star struck Lionel Messi, donning the Indian cricket jersey, met some of the country's top athletes, including Kuldeep Yadav, Renuka Singh Thakur, Nikhat Zareen and para stars Sumit Antil and Nishad Kumar. Messi visited India on a much-publicised four-day trip. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australias-disciplined-bowling-dominates-englands-ashes-hopes-fade-adelaide-test-2837870-2025-12-18",
      "headline": "Ashes slipping away after Australia give England a bowling masterclass: Hussain Nasser Hussain believes England's Ashes campaign is effectively over after a challenging second day at Adelaide, citing relentless Australian bowling and a lack of resilience from England's top order."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-openers-tom-latham-devon-conway-record-partnership-third-test-2837873-2025-12-18",
      "headline": "NZ vs WI: New Zealand seize control as Latham and Conway produce record opening stand New Zealand finished the opening day of the third Test against West Indies at Bay Oval on 334-1, with Devon Conway unbeaten on 178 and Tom Latham making 137 in a stand that broke records and set the tone for the series decider."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/video/india-vs-sa-4th-t20i-abandoned-in-lucknow-fog-or-smog-ytvd-2837860-2025-12-18",
      "headline": "India vs SA 4th T20I Abandoned in Lucknow: Fog or Smog? In this special report, India Today Principal Correspondent Samarth Srivastava investigates the cancellation of the 4th T20I between India and South Africa in Lucknow. While the BCCI and UP government cited fog as the reason, opposition parties claim smog caused the poor visibility. Reporting from the Ekana Stadium, Srivastava demonstrates the low visibility conditions faced by players, highlighting the risks of injury. The report also touches on the political blame game and the disappointment of fans as the match was abandoned without a toss."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2026-auction-review-kolkata-knight-riders-clarity-big-buys-problems-solved-cameron-green-matheesha-pathirana-2837854-2025-12-18",
      "headline": "KKR IPL 2026 auction: Kolkata get clarity, but are issues solved after big buys? IPL 2026 auction: KKR spent almost all of their purse and secured big buys in the form of Cameron Green and Matheesha Pathirana to emerge as potential title contenders for IPL 2026. But have the three-time champions really solved all their issues during the mini-auction?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-lucknow-t20i-fog-abandoned-rajiv-shukla-weather-concerns-future-scheduling-2837837-2025-12-18",
      "headline": "BCCI to factor in weather when scheduling: Rajiv Shukla amid backlash on Lucknow T20I IND vs SA: The Lucknow T20I washout triggered widespread fan anger over scheduling in winter conditions. BCCI vice-president Rajiv Shukla assured weather and pollution will be key factors in future planning."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-snicko-row-stokes-keeps-england-in-contest-2837834-2025-12-18",
      "headline": "Snicko row leaves England clinging on in Ashes contest despite Stokes' lone charge The Ashes, 3rd Test Day 2: Australia's dominance grew as Lyon's landmark double strike and a fragile English batting effort left Stokes fighting the lone fight."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ben-stokes-jofra-archer-heated-exchange-ashes-test-adelaide-oval-2837803-2025-12-18",
      "headline": "Ben Stokes' heated exchange with Jofra Archer goes viral: Just bowl at stumps A tense moment unfolded between England captain Ben Stokes and star bowler Jofra Archer during Day 2 of the third Ashes Test in Adelaide, as the pair engaged in a fiery exchange amidst a challenging start to the first session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fifa-intercontinental-cup-matvey-safonov-super-sub-penalties-psg-vs-flamengo-2837815-2025-12-18",
      "headline": "Super sub Matvey Safonov shines as PSG goalkeeper seals Intercontinental Cup win Back-up goalkeeper Matvey Safonov delivered a night to remember for PSG. His penalty heroics sealed the Intercontinental Cup and crowned a historic season for the French champions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sachin-tendulkar-meets-india-womens-blind-cricket-team-world-cup-2837777-2025-12-18",
      "headline": "Sachin Tendulkar honours India's World Cup winning women's blind cricket team Legendary cricketer Sachin Tendulkar met India's women's blind cricket team to honour their historic World Cup victory. India beat Nepal to clinch the inaugural women's world cup for the blind in Sri Lanka."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/joe-burns-dropped-internal-dispute-italy-cricket-axed-t20-world-cup-2026-2837766-2025-12-18",
      "headline": "Joe Burns axed from Italy's maiden T20 World Cup after internal dispute: ReportJoe Burns' shock omission from Italy's T20 World Cup 2026 squad has sparked controversy, with the former captain claiming he was pushed out after challenging cricket standards and off-field processes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-snicko-controversy-jamie-smith-dismissal-ben-stokes-fuming-adelaide-test-2837756-2025-12-18",
      "headline": "Ashes Snicko controversy erupts again: Stokes left fuming at Jamie Smith's dismissalEngland were left fuming in Adelaide after Jamie Smith was controversially given out despite replays showing daylight between bat and ball, putting the Snicko technology under scrutiny in the third Ashes Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-pat-cummins-dismisses-joe-root-adelaide-test-record-overtakes-jasprit-bumrah-2837742-2025-12-18",
      "headline": "Pat Cummins scalps Joe Root again: Australia skipper goes past Bumrah in key battleAustralia skipper Pat Cummins struck early to dismiss England's Joe Root again in the Ashes. The Adelaide wicket took Cummins clear as the bowler to have removed England's batting star most times in Tests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/monty-panesar-interview-on-steve-smith-ashes-2025-ben-stokes-2837726-2025-12-18",
      "headline": "Thanks to Steve Smith, he made me famous: Monty PanesarFormer England spinner Monty Panesar has taken another swipe at Australian batter Steve Smith, saying that Smith helped make him famous through their banter ahead of the Ashes 2025–26. Panesar had earlier suggested that the English media and fans should target Smith and remind him of his involvement in the Cape Town ball-tampering scandal. However, Smith responded by digging out an embarrassing video of Panesar's appearance on a quiz show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/monty-panesar-on-ashes-2025-26-steve-smith-ben-stokes-shoaib-bashir-2837702-2025-12-18",
      "headline": "Winning Test series in Australia harder than getting Olympic gold: Monty PanesarMonty Panesar recently caught up with India Today.in to discuss what all has gone wrong for Ben Stokes and his men in the ongoing Ashes. He also touched upon his banter with Steve Smith and revealed why he feels winning in Australia is far more difficult than winning an Olympic Gold."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-nathan-lyon-test-wickets-record-glenn-mcgrath-throws-chair-reaction-adelaide-2837704-2025-12-18",
      "headline": "Watch: Glenn McGrath jokingly throws chair as Nathan Lyon surpasses his Test recordAustralia spinner Nathan Lyon moved past Glenn McGrath on the Test wickets list during the Ashes, Adelaide Test. McGrath's light-hearted reaction summed up the moment as Lyon climbed to sixth all-time."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/video/smog-crisis-in-lucknow-t20-cricket-match-abandoned-due-to-poor-visibility-ytvd-2837700-2025-12-18",
      "headline": "India vs South Africa T20 Abandoned in Lucknow Due to Smog, Sparks Political RowA scheduled T20 cricket match between India and South Africa in Lucknow was abandoned without a ball being bowled due to excessive smog. The toss was delayed multiple times before officials called off the game citing poor visibility. The incident has sparked a political row, with opposition leaders criticizing the administration for the worsening air quality and suggesting alternative venues. The event highlights the growing environmental crisis affecting major cities beyond the national capital."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/syed-mushtaq-ali-trophy-2025-final-haryana-vs-jharkhand-live-streaming-2837687-2025-12-18",
      "headline": "SMAT 2025 final live streaming: All you need to know about Haryana vs JharkhandAfter a three-week contest, Haryana and Jharkhand will face off in the SMAT 2025 final in Pune. The summit clash will be played from 4:30 PM IST. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-alex-carey-snicko-controversy-bgg-statement-admits-technology-error-icc-reinstates-review-2837669-2025-12-18",
      "headline": "ICC reinstates England review after Alex Carey snicko controversy in Ashes: ExplainedA Snicko error turned day one of the Ashes Test into a technology debate. After England's protest, the ICC stepped in, reinstating a review and reopening questions over cricket's reliance on technology."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-handles-csk-auction-leak-accusations-humour-rebuttal-2837632-2025-12-18",
      "headline": "Ashwin accused of leaking CSK's IPL auction picks, spinner has a funny responseIPL auction 2026: Former spinner R Ashwin responded to trolls in his inimitable style after a few on social media accused him of leaking Chennai Super Kings auction picks before the five-time champions bought those players in Abu Dhabi on Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/video/lionel-messi-in-india-vantara-wildlife-centre-visit-anand-ambani-watch-video-2837665-2025-12-18",
      "headline": "Will surely visit again: Watch Lionel Messi's day at Anant Ambani's VantaraLionel Messi's India tour found a soulful pause at Vantara, where football met conservation. Guided by Anant Ambani, the global icon explored India's blend of tradition and modern wildlife care. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-copa-del-rey-vs-talavera-xabi-alonso-consistency-problem-2837662-2025-12-18",
      "headline": "Real Madrid still lacking consistency: coach Xabi Alonso after narrow Talavera winReal Madrid scraped past Talavera in the Copa del Rey but looked far from convincing. Xabi Alonso admitted his side still lack control and consistency despite progressing to the next round."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-shubman-gill-injured-or-dropped-fans-reaction-troll-vice-captain-poor-form-2837659-2025-12-18",
      "headline": "Injured or dropped? Fans speculate broader reason for Shubman Gill's T20I absenceShubman Gill's injury ruled him out of the Lucknow T20I, but questions around his form lingered. With India hit by injuries, selection debates intensified as the series entered a decisive phase."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-lucknow-t20i-fog-smog-match-cancelled-2837637-2025-12-18",
      "headline": "What the smog! Visibility low, common sense lower in Lucknow T20I fiascoIND vs SA: Fans waited more than three hours during the India vs South Africa 4th T20I for a toss that never came. In Lucknow, the BCCI once again left spectators aggrieved in what many saw as a shameful handling of the situation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/sandesh-jhingan-questions-crores-spent-messi-tour-indian-football-crisis-2837629-2025-12-18",
      "headline": "No will to invest in Indian football but crores spent on Messi tour: JhinganStar centre-back Sandesh Jhingan posted a hard-hitting message on social media, questioning the decision to spend crores on Lionel Messi's GOAT India Tour at a time when Indian football has hit rock bottom and the Indian Super League has been indefinitely postponed due to a lack of investment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fifa-world-cup-2026-prize-money-50-million-record-payout-ticket-price-controversy-2837621-2025-12-17",
      "headline": "FIFA World Cup winners to get record 50 million USD, much less than Club World CupFIFA has announced a 50 per cent increase in World Cup prize money for next year's tournament, with the champions set to take home a record $50 million (£37.5 million) for lifting the trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/satwik-rankireddy-chirag-shetty-improve-service-receive-top-badminton-pairs-2837571-2025-12-17",
      "headline": "Satwik and Chirag aim for improvement after gritty win in opening matchBWF World Tour Finals: Satwiksairaj Rankireddy and Chirag Shetty clinched a gritty win over Olympic silver medallists Liang Wei Keng and Wang Chang of China in their first group match in the season-ending tournament in Hangzhou. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-t20-world-cup-eden-gardens-ticket-prices-announced-2837610-2025-12-17",
      "headline": "T20 World Cup: Eden Gardens tickets start at Rs 100, India Super 8 game at Rs 900The Cricket Association of Bengal has revealed the ticket structure for ICC Men's T20 World Cup matches at Eden Gardens, with prices varying across group-stage and knockout fixtures."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}