{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sensex-tumbles-over-500-points-why-stock-market-is-down-today-2760574-2025-07-24",
      "headline": "Sensex tumbles over 500 points. Why stock market is down todayThe S&P BSE Sensex dropped 537.11 points to 82,189.53 by 12:37 pm, while the NSE Nifty50 fell 150.10 points to 25,069.80. All broader market indices were in the red as market sentiment weakened."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-now-on-digilocker-see-how-it-helps-you-pension-account-pf-balance-2760554-2025-07-24",
      "headline": "EPFO now on DigiLocker: See how it helps youThe government has been making several digital changes for EPFO members in the last few months. This new feature on DigiLocker is another step to make your provident fund details more accessible. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/anil-ambani-ed-raid-today-why-reason-loan-bribery-rs-3000-crore-fraud-sbi-sebi-2760549-2025-07-24",
      "headline": "Loan, lies and bribery? Why Anil Ambani is facing ED heatMultiple agencies, including the National Housing Bank, the Securities and Exchange Board of India (Sebi), the National Financial Reporting Authority (NFRA), and Bank of Baroda shared findings and inputs that contributed to the investigation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-uk-free-trade-agreement-whats-on-the-table-in-the-landmark-usd-34-billion-deal-2760546-2025-07-24",
      "headline": "India-UK FTA: What's on the table in landmark $34 billion deal?For Indian businesses, the FTA opens up wider access to British markets by slashing tariffs and easing compliance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/no-penalty-for-missed-income-tax-deadlines-panel-suggests-in-new-income-tax-bill-2025-2760516-2025-07-24",
      "headline": "No penalty for missed income tax deadlines? Panel suggests in New Tax BillThe suggestions come from the Select Committee, which has studied the new Income Tax Bill, 2025. This new Bill is meant to replace the old Income Tax Act of 1961."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/ed-conducts-raids-on-properties-linked-to-anil-ambani-in-mumbai-2760503-2025-07-24",
      "headline": "ED conducts raids on properties linked to Anil Ambani in MumbaiThe Enforcement Directorate (ED) on Thursday carried out searches at multiple locations in Mumbai connected to industrialist Anil Ambani's companies, days after the State Bank of India (SBI) classified Reliance Communications and Ambani himself as 'fraud'. While his personal residence wasn't searched, ED teams from Delhi and Mumbai targeted premises tied to Reliance Anil Ambani Group (RAAGA) companies in connection with an ongoing money laundering investigation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/iex-share-price-plunges-20-today-whats-behind-the-fall-2760496-2025-07-24",
      "headline": "IEX share price crashes 23% to hit 52-week low. What's behind the fall?IEX shares nosedived after CERC announced phased implementation of market coupling. The move aims to centralise price discovery, challenging IEX's dominance. Investors await clarity from the company's Q1FY26 results."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/enforcement-directorate-raids-anil-ambani-linked-premises-in-mumbai-days-after-sbi-declared-him-fraud-2760489-2025-07-24",
      "headline": "ED raids Anil Ambani-linked premises in Mumbai days after SBI's 'fraud' tagWhile Anil Ambani's personal residence was not part of the search operation, the ED teams from Delhi and Mumbai visited premises tied to some of his group companies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/nsdl-ipo-check-key-dates-issue-size-and-other-key-details-2760481-2025-07-24",
      "headline": "NSDL IPO: Check key dates, issue size and other key detailsThe NSDL IPO will open on July 30 and close on August 1, offering 5.01 crore shares through an offer for sale by existing institutional shareholders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/infosys-share-price-down-q1-results-buy-sell-hold-review-expert-outlook-price-target-2760467-2025-07-24",
      "headline": "Infosys shares down 1% despite good Q1 results. Should you buy, hold, or sell?Infosys posted a consolidated net profit of Rs 6,921 crore for the June quarter, up 8.7% compared to the same period last year. The revenue grew by 7.5% year-on-year to Rs 42,279 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/investment-advisor-on-whatsapp-telegram-stock-tip-groups-scam-2760465-2025-07-24",
      "headline": "Investment advisor explains how 'free' stock tip groups scam peopleThe investment advisor explains how so-called \"free\" stock tip groups on WhatsApp and Telegram are duping thousands of unsuspecting retail investors, all under the guise of financial advice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-44-points-lower-nifty-below-25300-tata-motors-up-1-percent-2760439-2025-07-24",
      "headline": "Sensex opens 44 points lower, Nifty below 25,300; Tata Motors up 1%The S&P BSE Sensex was down by 122.46 points to 82,604.18, while the NSE Nifty50 lost 14.95 points to 25,204.95. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tamannaah-bhatia-rahul-mishra-hyundai-india-couture-week-2025-sufi-inspired-love-collection-2760490-2025-07-24",
      "headline": "Tamannaah Bhatia dazzles in Rahul Mishra's Sufi-inspired couture collectionActor Tamannaah Bhatia walked the ramp for designer Rahul Mishraat at the Hyundai India Couture Week 2025 in New Delhi on Wednesday. She unveiled the 'Becoming Love' collection with two stunning outfits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/hari-hara-veera-mallu-box-office-day-1-prediction-detailed-report-pawan-kalyan-career-best-biggest-opener-to-beat-vakeel-saab-2760570-2025-07-24",
      "headline": "Hari Hara Veera Mallu box office Day 1 prediction: Pawan Kalyan's biggest opener yet'Hari Hara Veera Mallu' is looking at surpassing the opening-day figures of Pawan Kalyan's 'Vakeel Saab' to become the biggest opener of his career. The film has recorded tremendous traction in advance sales. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/janhvi-kapoor-reacts-man-kicking-clinic-receptionist-he-needs-to-be-in-jail-2760545-2025-07-24",
      "headline": "Janhvi Kapoor reacts to man kicking clinic receptionist: Nothing excuses thisActor Janhvi Kapoor recently reacted to the viral incident where a man allegedly kicked and dragged a clinic receptionist. The actor questioned such sort of upbringing and demanded strict punishment. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/prince-harry-meghan-markle-100-millon-dollar-netflix-deal-to-end-without-renewal-2760506-2025-07-24",
      "headline": "Prince Harry and Meghan Markle's $100 million Netflix deal to end without renewalPrince Harry and Meghan Markle's Netflix deal will end this year without renewal. The partnership, valued at approximately $100 million, has now reportedly \"run its course\". The deal was signed in 2020."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/uorfi-javeds-swollen-face-heals-attends-delhi-event-india-couture-week-after-lip-filler-removal-2760508-2025-07-24",
      "headline": "Uorfi Javed's swollen face heals, attends Delhi event after lip filler removalJust a day after revealing the swelling caused by dissolving her lip fillers, Uorfi Javed made a confident public appearance at India Couture Week in Delhi, looking completely normal. The actor-influencer recently got her lip fillers dissolved. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/don-3-makers-to-recreate-aaj-ki-raat-style-track-with-kriti-sanon-2760498-2025-07-24",
      "headline": "Exclusive: Don 3 makers to recreate 'Aaj Ki Raat' style track with Kriti Sanon 'Don 3', the highly anticipated Bollywood reboot, will star Ranveer Singh and Kriti Sanon in lead roles. The makers are planning a special dance track, similar to 'Aaj Ki Raat'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-box-office-collection-day-6-detailed-report-mohit-suri-film-remarkable-run-crosses-rs-150-crore-2760487-2025-07-24",
      "headline": "Saiyaara box office Day 6: Mohit Suri's film's remarkable run crosses Rs 150 crore'Saiyaara' has been making the perfect noise from Bollywood in theatres. The love story has been on a record-breaking spree, and there seems no stopping its extraordinary run - at least in the next 10 days. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-jonas-family-yacht-moment-with-daughter-malti-and-denise-jonas-shared-on-instagram-2760453-2025-07-24",
      "headline": "Aye aye captain, says Priyanka Chopra as daughter Malti steers yacht. See picActor Priyanka Chopra Jonas shared a cute photo of her daughter Malti and mother-in-law Denise Jonas on social media. She is currently on a holiday with her family. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/hans-zimmer-joins-euphoria-season-3-with-labrinth-soundtrack-2760462-2025-07-24",
      "headline": "Hans Zimmer joins Euphoria Season 3 as composer, Labrinth returnsLegendary music composer and producer Hans Zimmer has teamed up with English singer and songwriter Labrinth for 'Euphoria Season 3' music score. The upcoming season will release in 2026. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-ai-influencer-kavya-mehra-digital-contestant-salman-khan-host-august-premiere-2760431-2025-07-24",
      "headline": "Bigg Boss 19 to feature AI influencer Kavya Mehra as first digital contestant: ReportAI influencer Kavya Mehra may join the much-awaited 19th season of reality TV show Bigg Boss. She would be the first digital contestant in the show's history. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kalki-koechlin-says-her-parents-divorce-shaped-her-own-with-anurag-kashyap-2760443-2025-07-24",
      "headline": "Kalki Koechlin says her parents' divorce shaped her own with Anurag KashyapKalki Koechlin opened up about how her parents' divorce shaped her perspective on relationships, including her own separation from Anurag Kashyap. The two married in 2011 and officially parted ways in 2015."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kamal-haasan-reviews-fahadh-faasil-vadivelu-maareesan-2760447-2025-07-24",
      "headline": "Kamal Haasan reviews Fahadh Faasil-Vadivelu's Maareesan: Dances between wit, depthKamal Haasan appreciated the wit and depth of 'Maareesan', a Tamil comedy thriller by Sudheesh Sankar, set to release on 25 July 2025. The film features Fahadh Faasil and Vadivelu in lead roles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/benedict-cumberbatch-labels-hollywood-as-grossly-wasteful-urges-sustainability-2760423-2025-07-24",
      "headline": "Benedict Cumberbatch labels Hollywood as grossly wasteful, urges sustainabilityActor Benedict Cumberbatch recently criticised Hollywood as grossly wasteful in a food-focused podcast. He highlighted excessive resource consumption in filmmaking and advocated for increased sustainability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thalapathy-vijay-son-jason-sanjay-debut-directorial-shoot-salem-tamil-nadu-2760438-2025-07-24",
      "headline": "Thalapathy Vijay's son Jason Sanjay shoots for debut directorial in Salem. WatchThalapathy Vijay's son, Jason Sanjay, is currently shooting for his maiden directorial venture. The shooting of the film is currently progressing at a brisk pace in Tamil Nadu's Salem."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/meryl-streep-back-as-miranda-priestly-in-devil-wears-prada-2-1st-look-out-from-sets-2760430-2025-07-24",
      "headline": "Meryl Streep back as Miranda Priestly in Devil Wears Prada 2, 1st look out from setsMeryl Streep reprises her role as Miranda Priestly in 'The Devil Wears Prada 2' with production underway in New York City. Pictures from the sets have surfaced online. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/netflix-renews-jenna-ortegas-wednesday-for-season-3-2760418-2025-07-24",
      "headline": "Netflix renews Jenna Ortega's Wednesday for Season 3Netflix has renewed the hit supernatural drama 'Wednesday' for a third season, promising more eerie adventures at Nevermore Academy. Fans can look forward to a double-part Season 2 release next year, with creators hinting at potential spinoffs expanding the Addams Family universe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/divya-agarwal-husband-apurva-padgaonkar-apurva-padgaonkar-denies-separation-rumours-2760414-2025-07-24",
      "headline": "Divya Agarwal's husband trashes separation rumours, slams clickbait Insta postActor Divya Agarwal's husband Apurva Padgaonkar, in a recent comment, addressed and refuted claims about separation. He affirmed their togetherness and rejected separation rumours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/hari-hara-veera-mallu-movie-review-pawan-kalyan-star-power-cant-save-a-scattered-epic-2760398-2025-07-24",
      "headline": "Hari Hara Veera Mallu review: Pawan Kalyan's star power can't save scattered epicRelease Date:Thu Jul 24, 2025'Hari Hara Veera Mallu' movie review: After years of delays and sky-high expectations, 'Hari Hara Veera Mallu part 1' arrived in theatres with the promise of a grand historical adventure. With Pawan Kalyan's committed screen presence, a few standout action set pieces, and flashes of visual ambition, the film does manage to engage in parts.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/united-states-doctor-salvador-plasencia-pleads-guilty-supply-ketamine-friends-tv-show-star-matthew-perry-death-2760361-2025-07-23",
      "headline": "US doctor pleads guilty to supplying ketamine to Friends star Matthew PerryDoctor Salvador Plasencia pleaded guilty to illegally supplying ketamine to Matthew Perry in the weeks leading up to the actor's overdose death. He is the fourth of five accused to admit guilt in the case.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/russian-air-traffic-controllers-lose-contact-with-plane-carrying-50-people-search-on-news-agency-reuters-2760537-2025-07-24",
      "headline": "Missing Russian plane crashed, burning fuselage found, no survivors: ReportA passenger plane operated by Angara Airlines went missing in Russia's Far East with around 50 people on board, including children, and is believed to have crashed minutes later."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/enforcement-directorate-raids-anil-ambani-linked-premises-in-mumbai-days-after-sbi-declared-him-fraud-2760489-2025-07-24",
      "headline": "ED raids Anil Ambani-linked premises in Mumbai days after SBI's 'fraud' tagWhile Anil Ambani's personal residence was not part of the search operation, the ED teams from Delhi and Mumbai visited premises tied to some of his group companies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-partly-pauses-high-courts-mumbai-train-blasts-acquittal-order-accused-not-to-be-re-arrested-2760499-2025-07-24",
      "headline": "Mumbai blasts: Top court halts acquittal order, but accused won't be re-arrestedThe Supreme Court said the Bombay High Court judgment, acquitting all the accused in the 7/11 Mumbai blasts case, shall not be treated as a precedent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/no-more-tech-hiring-in-india-donald-trump-tells-google-apple-and-others-to-focus-on-americans-2760486-2025-07-24",
      "headline": "No more tech hiring in India, Donald Trump tells Google and MicrosoftUS President Donald Trump has sent a strong message to big tech companies like Google and Microsoft, asking them to stop hiring overseas, including in countries like India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jain-and-the-art-of-diplomatic-immunity-who-is-harsh-vardhan-jain-londonia-envoy-caught-for-running-fake-embassy-2760339-2025-07-24",
      "headline": "Jain & the art of diplomatic immunityIt was nothing short of a diplomatic Disneyland. The UP STF busted Harsh Vardhan Jain, \"Baron\" of Westarctica, who turned a rented Ghaziabad bungalow into a fake embassy for imaginary nations. With forged passports, luxury cars bearing diplomatic plates, and photos with real leaders, he scammed job-seekers and firms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/centre-tried-to-persuade-vice-president-jagdeep-dhankhar-thrice-but-he-acted-alone-on-justice-varma-impeachment-motion-2760303-2025-07-23",
      "headline": "Photo alongside PM, Mercedes fleet: Jagdeep Dhankhar's demands widened riftJagdeep Dhankhar's tussle with the government was not a one-day affair and had been brewing for long over a list of demands by the former Vice President. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-foot-injury-india-vs-england-ricky-ponting-series-concern-2760457-2025-07-24",
      "headline": "Ponting fears serious injury as Rishabh Pant's scans leave India camp on edgeEngland vs India: Ricky Ponting has voiced serious concern over Rishabh Pant's fitness after the India wicketkeeper-batter was forced to retire hurt on the opening day of the fourth Test against England at Old Trafford."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/the-looming-google-earth-lens-how-indias-strategic-assets-lie-exposed-vulnerable-to-harm-2760192-2025-07-23",
      "headline": "How India's strategic assets lie exposed, vulnerable to harmWith detailed imagery of military bases, nuclear plants, border posts and more easily accessible to Open Source Intelligence, how dangerous is this for national security?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/thailand-cambodia-exchange-firing-border-prasat-ta-muen-thom-temple-surin-province-2760437-2025-07-24",
      "headline": "Thailand, Cambodia trade fire along disputed border amid rapidly escalating disputeRelations between the Southeast Asian neighbours have deteriorated sharply since May when a Cambodian soldier was killed in an armed confrontation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/swaminarayan-temple-asian-restaurants-australia-melbourne-hate-graffiti-2760444-2025-07-24",
      "headline": "'Go home brown...': Temple, Asian eateries defaced with hate graffiti in AustraliaThe incident comes a day after reports of an Indian student being brutally assaulted in Australia sparked widespread outrage."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/anil-ambani-ed-raid-today-why-reason-loan-bribery-rs-3000-crore-fraud-sbi-sebi-2760549-2025-07-24",
      "headline": "Loan, lies and bribery? Why Anil Ambani is facing ED heatMultiple agencies, including the National Housing Bank, the Securities and Exchange Board of India (Sebi), the National Financial Reporting Authority (NFRA), and Bank of Baroda shared findings and inputs that contributed to the investigation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/election-commission-bihar-voter-list-revision-sir-constitution-parliament-protest-2760491-2025-07-24",
      "headline": "Should we go against Constitution? Poll body defends Bihar voter list revisionAmid ongoing protests over the revision of Bihar's voters list, the Election Commission defended the move as essential for fair elections and questioned whether it should ignore constitutional duties. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mamata-banerjee-west-bengal-durga-puja-angan-2026-elections-bjp-tmc-religious-politics-row-2760129-2025-07-24",
      "headline": "Dugga Dugga: BJP, Trinamool battle for Bengal's presiding deity DurgaWith West Bengal headed for the crucial Assembly election in 2026, goddess Durga, the presiding deity of the state, has taken centre stage in the political battlefield. From PM Modi's rally chant to CM Mamata Banerjee's proposed 'Durga Angan', both BJP and TMC are invoking the deity in a bid to sway voters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/parliament-monsoon-session-live-updates-lok-sabha-rajya-sabha-congress-bjp-vice-president-bihar-sir-protest-2760429-2025-07-24",
      "headline": "Live: Lok Sabha adjourned till 2 pm as Opposition continues uproar over Bihar roll revisionParliament Session 2025 Live Updates: Today marks the fourth day of the Monsoon Session of Parliament, which is expected to remain as stormy as the past three days, with the Opposition demanding a discussion on the revision of the Bihar voters' list, among other issues. The Readjustment of Representation of Scheduled Tribes in Assembly Constituencies of the State of Goa Bill and the Merchant Shipping Bill are scheduled to be discussed and passed in Parliament today. The debate over the sudden exit of the Vice President is also expected to continue. Stay tuned to IndiaToday.in for real-time updates from both Houses of Parliament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/openai-ceo-sam-altman-says-these-human-jobs-will-entirely-disappear-due-to-ai-advancements-2760275-2025-07-23",
      "headline": "Sam Altman says these human jobs will entirely disappear due to AI advancementsOpenAI CEO Sam Altman recently spoke at a Federal Reserve conference in Washington, offering a blunt view of how artificial intelligence may reshape the world of work."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/mf-husain-the-painter-of-signs-2759712-2025-07-24",
      "headline": "The Painter of Signs50 years after the Emergency, MF Husain may be having a moment. Again. He deserves to be remembered for more than his errors or the opulent squalor of his final years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/uorfi-javeds-swollen-face-heals-attends-delhi-event-india-couture-week-after-lip-filler-removal-2760508-2025-07-24",
      "headline": "Uorfi Javed's swollen face heals, attends Delhi event after lip filler removalJust a day after revealing the swelling caused by dissolving her lip fillers, Uorfi Javed made a confident public appearance at India Couture Week in Delhi, looking completely normal. The actor-influencer recently got her lip fillers dissolved. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-uk-free-trade-agreement-whats-on-the-table-in-the-landmark-usd-34-billion-deal-2760546-2025-07-24",
      "headline": "India-UK FTA: What's on the table in landmark $34 billion deal?For Indian businesses, the FTA opens up wider access to British markets by slashing tariffs and easing compliance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/can-art-therapy-sketch-out-the-storm-within-2760082-2025-07-24",
      "headline": "Can art therapy sketch out the storm within?With simple tools like paint-by-number kits, art therapy is becoming increasingly popular. But can it really help you unwind after a long, hectic day?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/bihari-vs-bahari-the-election-debate-in-nitish-land-2759995-2025-07-23",
      "headline": "Bihari vs 'Bahari': The election debate in Nitish landThe chief minister puts a binding clause on gender quotas: it will be exclusively for women domiciled in Bihar"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/meryl-streep-back-as-miranda-priestly-in-devil-wears-prada-2-1st-look-out-from-sets-2760430-2025-07-24",
      "headline": "Meryl Streep back as Miranda Priestly in Devil Wears Prada 2, 1st look out from setsMeryl Streep reprises her role as Miranda Priestly in 'The Devil Wears Prada 2' with production underway in New York City. Pictures from the sets have surfaced online. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-police-arrest-19-year-old-for-uploading-obscene-videos-of-women-under-bangalore-night-life-tag-mg-road-church-street-koramangala-2760435-2025-07-24",
      "headline": "Teen secretly films women, posts them on Instagram as 'Bangalore Night Life'Bengaluru Police arrested a 19-year-old for uploading obscene videos of women on Instagram. He shared the clips under the tag 'Bangalore Night Life' to gain followers. He was booked under the IT Act."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/hyderabad/story/hyderabad-man-dead-three-critical-after-eating-refrigerated-reheated-bonalu-meat-food-poisoning-2760501-2025-07-24",
      "headline": "Hyderabad man dies after eating leftover refrigerated meat, food poisoning suspectedA Hyderabad man died of suspected food poisoning after consuming leftover refrigerated meat. Three others remain critically ill."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/next-veep-to-be-from-bjp-speculations-on-jdus-ram-nath-thakur-baseless-sources-2760422-2025-07-24",
      "headline": "Next Vice President to be from BJP, deeply rooted to party line: SourcesAccording to sources, the BJP is likely to appoint someone strongly aligned with the party's core ideology. Speculation around Union Minister Ram Nath Thakur being considered for the role is baseless, they added."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tamannaah-bhatia-rahul-mishra-hyundai-india-couture-week-2025-sufi-inspired-love-collection-2760490-2025-07-24",
      "headline": "Tamannaah Bhatia dazzles in Rahul Mishra's Sufi-inspired couture collectionActor Tamannaah Bhatia walked the ramp for designer Rahul Mishraat at the Hyundai India Couture Week 2025 in New Delhi on Wednesday. She unveiled the 'Becoming Love' collection with two stunning outfits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/hari-hara-veera-mallu-box-office-day-1-prediction-detailed-report-pawan-kalyan-career-best-biggest-opener-to-beat-vakeel-saab-2760570-2025-07-24",
      "headline": "Hari Hara Veera Mallu box office Day 1 prediction: Pawan Kalyan's biggest opener yet'Hari Hara Veera Mallu' is looking at surpassing the opening-day figures of Pawan Kalyan's 'Vakeel Saab' to become the biggest opener of his career. The film has recorded tremendous traction in advance sales. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/janhvi-kapoor-reacts-man-kicking-clinic-receptionist-he-needs-to-be-in-jail-2760545-2025-07-24",
      "headline": "Janhvi Kapoor reacts to man kicking clinic receptionist: Nothing excuses thisActor Janhvi Kapoor recently reacted to the viral incident where a man allegedly kicked and dragged a clinic receptionist. The actor questioned such sort of upbringing and demanded strict punishment. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/don-3-makers-to-recreate-aaj-ki-raat-style-track-with-kriti-sanon-2760498-2025-07-24",
      "headline": "Exclusive: Don 3 makers to recreate 'Aaj Ki Raat' style track with Kriti Sanon 'Don 3', the highly anticipated Bollywood reboot, will star Ranveer Singh and Kriti Sanon in lead roles. The makers are planning a special dance track, similar to 'Aaj Ki Raat'."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-injury-comeback-cricket-career-challenges-sonchiriya-england-india-test-2760558-2025-07-24",
      "headline": "Rishabh Pant: Cricket's resilient Sonchiriya dancing to destiny's musicLike the dacoits in Sonchiriya, Rishabh Pant walks a path shadowed by omens. But each time, he lifts the dead snake and keeps moving, saying 'mai ka naam le ke aage badho'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-indian-batters-sanjay-manjrekar-proud-manchester-test-2760561-2025-07-24",
      "headline": "Manjrekar backs India's batters: Can do it in typical English conditionsSanjay Manjrekar was particularly proud of the Indian batters for coming through the overcast conditions in the Manchester Test with flying colours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-stuart-broad-england-vs-india-manchester-test-2760555-2025-07-24",
      "headline": "Stuart Broad backs Rishabh Pant to bat with 'bruised foot' in ManchesterENG vs IND, 4th Test: Rishabh Pant suffered a foot injury on Day 1 of the fourth Test at the Old Trafford in Manchester after being struck by a yorker from Chris Woakes.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/zahaan-hemrajani-top-10-finish-u17-open-skiff-world-championships-india-sailing-success-2760535-2025-07-24",
      "headline": "Zahaan Hemrajani secures historic top 10 finish at U17 sailing worldsMumbai's Zahaan Hemrajani secured a top 10 overall finish at the prestigious U17 O'pen Skiff World Championships, held from July 17 to 23 in Nishinomiya, Japan. His result marks one of the highest-ever finishes by an Indian sailor at this global youth event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/satwiksairaj-rankireddy-chirag-shetty-china-open-quarterfinal-win-indonesia-2760518-2025-07-24",
      "headline": "China Open: Satwik-Chirag reach quarterfinals, HS Prannoy crashes outSatwiksairaj Rankireddy and Chirag Shetty advanced to the quarterfinals of the China Open with a commanding win over Indonesia's top doubles pair. However, India's singles campaign came to an end as HS Prannoy bowed out after a hard-fought three-game loss."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravindra-jadeja-gary-sobers-england-vs-india-4th-test-record-2760505-2025-07-24",
      "headline": "Ravindra Jadeja aims for Gary Sobers' historic Test double in EnglandENG vs IND: Ravindra Jadeja is on the cusp of reaching the unique double of 1000 runs and 30 wickets in Tests on English soil. Gary Sobers is the only visiting cricketer to have achieved the feat. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-shardul-thakur-washington-sundar-4th-test-karthik-ponting-2760500-2025-07-24",
      "headline": "Dinesh Karthik questions India's call to send Shardul ahead of SundarFormer India batter Dinesh Karthik has questioned the Indian team management to promote Shardul Thakur ahead of Washington Sundar after Rishabh Pant retired hurt in the fourth Test against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sai-sudharsan-manchester-england-vs-india-4th-test-press-conference-2760472-2025-07-24",
      "headline": "Sai Sudharsan impresses: How shadow batting helped India's new No.3ENG vs IND, 4th Test: Sai Sudharsan said that shadow batting helped him get mentally prepared for the ongoing Manchester Test, where he notched his maiden Test fifty. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-injury-india-vs-england-4th-test-michael-atherton-2760466-2025-07-24",
      "headline": "Rishabh Pant's injury is quite serious, could be series-ending: Michael AthertonEngland vs India: Former England captain Michael Atherton has voiced grave concern over wicketkeeper Rishabh Pant's injury, warning it could rule him out of the remainder of the series-a potential body blow for India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-foot-injury-india-vs-england-ricky-ponting-series-concern-2760457-2025-07-24",
      "headline": "Ponting fears serious injury as Rishabh Pant's scans leave India camp on edgeEngland vs India: Ricky Ponting has voiced serious concern over Rishabh Pant's fitness after the India wicketkeeper-batter was forced to retire hurt on the opening day of the fourth Test against England at Old Trafford."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/liverpool-sign-hugo-ekitike-from-eintracht-frankfurt-2025-squad-2760445-2025-07-24",
      "headline": "Liverpool sign Hugo Ekitike from Frankfurt to strengthen squadLiverpool have signed French striker Hugo Ekitike from Eintracht Frankfurt, the Premier League club announced on Wednesday. Ekitike will wear the number 54 jersey as a temporary squad number during the club's pre-season tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-shardul-thakur-washington-sundar-4th-test-karthik-ponting-2760500-2025-07-24",
      "headline": "Dinesh Karthik questions India's call to send Shardul ahead of SundarFormer India batter Dinesh Karthik has questioned the Indian team management to promote Shardul Thakur ahead of Washington Sundar after Rishabh Pant retired hurt in the fourth Test against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sai-sudharsan-manchester-england-vs-india-4th-test-press-conference-2760472-2025-07-24",
      "headline": "Sai Sudharsan impresses: How shadow batting helped India's new No.3ENG vs IND, 4th Test: Sai Sudharsan said that shadow batting helped him get mentally prepared for the ongoing Manchester Test, where he notched his maiden Test fifty. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-injury-india-vs-england-4th-test-michael-atherton-2760466-2025-07-24",
      "headline": "Rishabh Pant's injury is quite serious, could be series-ending: Michael AthertonEngland vs India: Former England captain Michael Atherton has voiced grave concern over wicketkeeper Rishabh Pant's injury, warning it could rule him out of the remainder of the series-a potential body blow for India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-foot-injury-india-vs-england-ricky-ponting-series-concern-2760457-2025-07-24",
      "headline": "Ponting fears serious injury as Rishabh Pant's scans leave India camp on edgeEngland vs India: Ricky Ponting has voiced serious concern over Rishabh Pant's fitness after the India wicketkeeper-batter was forced to retire hurt on the opening day of the fourth Test against England at Old Trafford."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/liverpool-sign-hugo-ekitike-from-eintracht-frankfurt-2025-squad-2760445-2025-07-24",
      "headline": "Liverpool sign Hugo Ekitike from Frankfurt to strengthen squadLiverpool have signed French striker Hugo Ekitike from Eintracht Frankfurt, the Premier League club announced on Wednesday. Ekitike will wear the number 54 jersey as a temporary squad number during the club's pre-season tour."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}