{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-upper-middle-income-country-2030-third-largest-economy-2028-sbi-glbs-2854618-2026-01-20",
      "headline": "India to be upper-middle income by 2030, third largest economy by 2028: SBIIndia is projected to become an upper-middle income country by 2030 and the third-largest economy by 2028. This economic transition reflects sustained growth and reform efforts but also poses challenges to maintain momentum."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-contributing-to-20-of-overall-global-growth-wef-chief-borge-brende-2854566-2026-01-19",
      "headline": "India contributing to 20% of overall global growth: WEF chief Borge BrendeIn an exclusive interview with India Today, World Economic Forum President Borge Brende hailed India as the fastest growing of the large economies in the world, contributing to 20% of the overall global growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-ranks-16th-responsible-nations-index-singapore-tops-global-list-2854538-2026-01-19",
      "headline": "India ranks above US, China in new Responsible Nations IndexThe Responsible Nations Index, or RNI, is an initiative of the World Intellectual Foundation and is the outcome of a three-year academic and policy exercise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-on-track-to-achieve-500-gw-renewable-energy-target-by-2030-pralhad-joshi-world-economic-forum-wef-meeting-in-davos-2854495-2026-01-19",
      "headline": "India on track to achieve 500 GW renewable energy target by 2030: Pralhad JoshiJoshi said investor interest in India's renewable sector has been strong, with over $145 billion invested in the past 10 years, including $20 billion in foreign direct investment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hcltech-ceo-c-vijayakumar-explains-how-ai-is-reshaping-tech-jobs-and-revenues-wef-davos-2854420-2026-01-19",
      "headline": "HCLTech CEO explains how AI is reshaping IT jobs and revenuesVijayakumar said the global business environment has been turbulent over the past few years, but things now appear to be stabilising."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/video/borge-brende-to-india-today-the-ukraine-war-possibly-could-end-this-year-after-four-years-ytvd-2854381-2026-01-19",
      "headline": "Børge Brende to India Today: 'The Ukraine war possibly could end this year' after four yearsWorld Economic Forum President Børge Brende joins India Today's Rajdeep Sardesai at Davos to discuss the most complex geopolitical landscape since 1945. Brende highlights that despite global tensions, including potential friction between Europe and the US over Greenland, global growth remains resilient at over 3%. He notes that 'the Ukraine war possibly could end this year' if there is sufficient willingness for a solution. The discussion covers India's rising economic influence, with Brende describing India as a 'US$10 trillion economy pretty soon' that contributes 20% to global growth. He addresses the 'Trumpian world order,' suggesting that while media focuses on the 'noise,' quiet bilateral cooperation continues to drive the global agenda. Brende identifies escalating conflict in the Gulf, debt bubbles, and 'black swan' events like cyber warfare as the primary risks to global stability in 2026. He emphasizes that the WEF remains an impartial platform where competing powers like the US, China, and India can engage in essential dialogue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/aishwarya-paliwal-on-imf-revising-indias-fy26-gdp-growth-forecast-upward-to-73-ytvd-2854328-2026-01-19",
      "headline": "IMF Hikes India's GDP Growth Estimate to 7.3% for 2025-26The International Monetary Fund (IMF) has revised India's GDP growth estimate for the financial year 2025-26 upward to 7.3 percent. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-proposes-linking-brics-digital-currencies-to-ease-trade-and-tourism-payments-report-2854346-2026-01-19",
      "headline": "RBI proposes linking BRICS digital currencies to ease cross-border trade: ReportIf accepted, it would mark the first formal attempt to link the central bank digital currencies (CBDCs) of BRICS members, a move that could reduce dependence on the US dollar at a time of heightened geopolitical tensions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/global-trade-moving-towards-mini-lateral-and-plurilateral-deals-says-wefs-kimberley-botwright-2854341-2026-01-19",
      "headline": "Global trade moving towards mini-lateral and plurilateral deals, says WEF's Kimberley BotwrightGlobal trade is entering a new phase, with countries moving away from broad multilateral agreements and increasingly turning to smaller, targeted trade deals, says Kimberley Botwright."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-sensex-tanks-over-300-points-nifty-tumbles-amid-global-uncertainty-2854308-2026-01-19",
      "headline": "Sensex tanks over 300 points, Nifty tumbles amid global uncertaintyThe Sensex fell more than 300 points, while the Nifty slipped below the crucial 25,600 mark as investors remained cautious through the session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-can-strike-trade-deals-on-its-own-terms-says-wef-chief-borge-brende-2854289-2026-01-19",
      "headline": "India can strike trade deals on its own terms, says WEF chief Borge BrendeBorge Brende said that India's rise over the past few years has reshaped its leverage in the global economy, giving New Delhi far more room to decide when and with whom it wants to sign trade deals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/imf-revises-indias-growth-outlook-upward-to-73-for-fy26-despite-tariffs-and-global-uncertainty-2854270-2026-01-19",
      "headline": "IMF lifts India's FY26 growth forecast to 7.3% amid global uncertaintyIn its latest World Economic Outlook report, the IMF said India's economy is now expected to grow by 7.3% in FY26, up 0.7 percentage points from its earlier estimate. The upgrade reflects better-than-expected growth in the third quarter and continued strength in the fourth quarter of the current fiscal year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/can-budget-2026-deliver-scale-skills-and-digital-growth-for-manufacturing-2854216-2026-01-19",
      "headline": "Can Budget 2026 deliver scale, skills and digital growth for manufacturing?Budget 2026 is expected to play a key role in shaping the future of India's manufacturing sector. From expanding scale to building skilled manpower and driving digital adoption, the industry has clear expectations from the government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/taxes-jobs-credit-policies-what-consumers-can-expect-from-budget-2026-2854197-2026-01-19",
      "headline": "Taxes, jobs, credit policies: What consumers can expect from Budget 2026Budget 2026 is expected to touch everyday finances, from how much tax people pay to how easily they can access credit. Consumers are hoping for measures that ease costs and support stable income growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/rera-real-estate-delays-homebuyers-uttar-pradesh-township-policy-stalled-projects-2854161-2026-01-19",
      "headline": "From ruin to reform: My 12-year real estate nightmare and why RERA is a lifelineA decade-long struggle through stalled projects reveals why strong regulation matters. RERA restored accountability in a sector where delays were normal and buyers carried all the risk."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/shadowfax-technologies-ipo-opens-tomorrow-check-price-gmp-and-other-details-2854168-2026-01-19",
      "headline": "Shadowfax Technologies IPO opens tomorrow: Check price, GMP and other detailsShadowfax Technologies is set to enter the primary market tomorrow with its much-watched IPO. The issue comes at a time when online shopping and same-day delivery services are seeing steady growth across India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/silver-crosses-rs-3-lakh-per-kg-first-time-gold-price-today-india-2854140-2026-01-19",
      "headline": "Silver crosses Rs 3 lakh per kg for first time: What's driving the rally?Silve price today: The rate for 10 grams of silver stood at Rs 3,180 in Chennai, Hyderabad and Kerala. In Mumbai, Delhi, Kolkata, Bengaluru, Pune, Vadodara and Ahmedabad, silver was priced at Rs 3,050 per 10 grams"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/bharat-coking-coal-shares-bccl-stock-open-at-97-percent-premium-hold-or-sell-2854111-2026-01-19",
      "headline": "Bharat Coking Coal opens at 97% premium: Should you hold or sell BCCL shares?BCCL share price: The stock listed at around a 97% gain over the issue price of Rs 23, reflecting the very high demand seen during the IPO phase. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/trumps-greenland-tariff-threat-rattles-global-markets-sends-dollar-lower-2854101-2026-01-19",
      "headline": "Trump's Greenland tariff threat rattles global markets, sends dollar lowerGlobal equities softened as investors moved out of risk-heavy assets. Asian and European markets opened lower, while US futures signalled a cautious start."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-down-sensex-falls-over-600-points-key-reasons-why-2854096-2026-01-19",
      "headline": "Sensex tanks over 600 points: 4 reasons why the stock market is down todayA mix of global tension, weak heavyweights, and sustained foreign selling hit investor sentiment right at the open."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/a-knight-of-the-seven-kingdoms-showrunner-this-got-spin-off-needs-patience-2854617-2026-01-20",
      "headline": "A Knight of the Seven Kingdoms showrunner: This GoT spin-off needs patience A Knight of the Seven Kingdoms showrunner Ira Parker spoke to India Today on why this Game of Thrones spin-off needs patience. Parker highlighted how the prequel prioritises intimacy over dragons, focusing on the grounded bond between Dunk and Egg while remaining faithful to George R. R. Martin's original novellas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-explores-tokyo-with-wife-sneha-and-kids-amid-pushpa-2-promotions-2854563-2026-01-19",
      "headline": "Allu Arjun explores Tokyo with wife Sneha and kids amid Pushpa 2 promotions Actor Allu Arjun's wife Sneha Reddy shared a video of the family from their Tokyo trip. The actor is in Japan as the Japanese-dubbed version of his film Pushpa: The Rule has been released."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/akshay-kumar-convoy-hit-after-mercedes-crashes-into-auto-in-juhu-actor-wife-twinkle-khanna-in-another-car-2854590-2026-01-19",
      "headline": "Akshay Kumar's convoy vehicle in freak accident; actor and wife Twinkle unhurt Akshay Kumar's convoy vehicle was hit by an auto rickshaw involved in an accident with another car. The actor and his wife Twinkle Khanna were in a different car ahead, which suffered a minor impact."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/srk-takes-away-fan-phone-for-trying-to-click-selfie-on-stage-protocol-say-users-2854546-2026-01-19",
      "headline": "SRK takes away fan's phone for trying to click selfie on stage: Protocol, say users Shah Rukh Khan took away a fan's phone as the latter tried to click selfie on stage. The internet defended the actor by highlighting that he was following protocol.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/why-is-jana-nayagan-actor-pooja-hegde-trending-all-you-need-to-know-2854486-2026-01-19",
      "headline": "Why is Jana Nayagan actor Pooja Hegde trending? All you need to know A reported interview attributed to Pooja Hegde, alleging misconduct by a co-star, has sparked intense discussion across social media platforms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/haq-is-a-landmark-case-emraan-hashmi-on-why-the-film-will-age-well-on-ott-2854506-2026-01-19",
      "headline": "Haq is a landmark case: Emraan Hashmi on why the film will age well on OTT Emraan Hashmi expressed happiness over his legal drama 'Haq' being praised ever since its OTT release. The film also features Yami Gautam in a pivotal character."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mark-45-digital-release-jio-hotstar-zee5-23-january-2026-2854244-2026-01-19",
      "headline": "Mark and 45 set for OTT face-off after theatrical clash. Check release date Action thriller Mark and fantasy drama 45, both released in cinemas during Christmas 2025, are preparing for a digital face-off as they debut on different OTT platforms on January 23."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/tovino-thomas-stars-in-athiradi-as-sreekuttan-vellayani-ahead-of-14-may-release-2854301-2026-01-19",
      "headline": "Tovino Thomas is singer Sreekuttan in Athiradi, character poster out The makers of Athiradi have unveiled a poster of Tovino Thomas, offering a glimpse into his character ahead of the film's scheduled global release in May. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dhurandhar-2-r-madhavan-salt-and-pepper-look-bike-ride-viral-photos-2854484-2026-01-19",
      "headline": "Amid Dhurandhar 2 buzz, R Madhavan's salt-and-pepper look goes viral. See pics Actor R Madhavan has captured widespread attention with a striking new look after his recent performance in Aditya Dhar's film Dhurandhar. The second part of the film is set for release on March 19."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/junglee-pictures-teams-up-with-raj-kumar-gupta-for-new-film-after-success-of-haq-2854498-2026-01-19",
      "headline": "Junglee Pictures teams up with Raj Kumar Gupta for new film after success of Haq Junglee Pictures and director Raj Kumar Gupta announce a new collaboration for an ambitious film, with casting soon to begin and high expectations for a powerful, audience-focused narrative."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/border-2-depicts-india-crushing-response-to-pak-operation-changez-khan-reports-2854441-2026-01-19",
      "headline": "Border 2 depicts India's crushing response to Pak's Operation Changez Khan: Reports Actor Sunny Deol's upcoming film, Border 2, is reportedly based on India's triple-front response to Pakistan's Operation Changez Khan in 1971. The film is a sequel to the 1997 superhit, Border."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sanjay-leela-bhansalis-love-and-war-starring-alia-bhatt-ranbir-kapoor-vicky-kaushal-shifts-release-to-early-2027-report-2854471-2026-01-19",
      "headline": "Sanjay Leela Bhansali's Love And War shifts release to early 2027: Report The release of Sanjay Leela Bhansali's film Love And War has been postponed to 2027 due to the film's large-scale production and overlapping schedules with other major releases."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dhanush-kriti-tere-ishk-mein-on-ott-amid-rs-84-crore-lawsuit-release-details-2854391-2026-01-19",
      "headline": "Dhanush-Kriti's Tere Ishk Mein on OTT amid Rs 84 crore lawsuit. Release details Anand L Rai's 'Tere Ishk Mein' is set for its OTT release. The film features Dhanush and Kriti Sanon in pivotal  characters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shankar-mahadevan-backs-ar-rahman-communal-controversy-destiny-of-music-lies-with-non-musical-people-2854443-2026-01-19",
      "headline": "Destiny of Music lies with non-musical people: Shankar Mahadevan backs AR Rahman AR Rahman's recent remarks implying that the Hindi music industry is \"communal\" sparked widespread backlash. Music composer Shankar Mahadevan now offers a more nuanced take, framing the debate as a divide between creative forces and those who control the industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/naagin-7-blood-wedding-inspired-by-game-of-thrones-red-wedding-2854426-2026-01-19",
      "headline": "Naagin 7 pulls a GOT–style Red Wedding moment with its Blood Wedding rehash Naagin 7's Blood Wedding sequence drew clear inspiration from Game of Thrones' iconic Red Wedding. Despite differences in scale and intensity, the episode marked a pivotal moment in the show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/friendship-goals-nayanthara-posts-candid-yacht-photos-with-trisha-2854422-2026-01-19",
      "headline": "Friendship goals: Nayanthara posts candid yacht photos with Trisha Nayanthara's latest Instagram post featuring candid yacht moments with Trisha Krishnan has drawn attention online, fuelling conversation around the duo's long-discussed equation.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shahid-kapoor-meets-fan-cafe-oremo-release-film-excitement-2854222-2026-01-19",
      "headline": "Shahid Kapoor's wholesome fan moment proves why he's loved by millions. Watch Shahid Kapoor's recent interaction with a fan has gone viral. The actor is gearing up for the release of his upcoming film 'O'Romeo', which is set for theatrical run on February 13, 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/asin-husband-rahul-sharma-calls-her-co-founder-in-10th-anniversary-note-2854413-2026-01-19",
      "headline": "Asin's husband Rahul Sharma calls her 'co-founder' in 10th anniversary note To mark a decade of marriage, Ghajini actor Asin's husband Rahul Sharma shared a heartfelt note on social media. In the note, Rahul called Asin an incredible co-founder and their relationship a high-growth startup. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/k-pop-supergroup-exo-step-back-into-the-spotlight-with-reverxe-2854375-2026-01-19",
      "headline": "K-pop supergroup EXO step back into the spotlight with REVERXE K-Pop EXO has returned after two and a half years with their eighth album REVERXE. The album reflects their early mythology while embracing a confident new sound amid lineup changes."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/terrorism-ai-defence-inside-pm-modis-meet-with-uae-president-during-his-2-hour-india-visit-2854514-2026-01-19",
      "headline": "Nuclear reactors, AI, terrorism: Inside PM Modi's short meet with UAE PresidentA key outcome of the visit was the signing of a Letter of Intent to work towards concluding a framework agreement for a Strategic Defence Partnership between India and the UAE."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/akshay-kumar-convoy-hit-after-mercedes-crashes-into-auto-in-juhu-actor-wife-twinkle-khanna-in-another-car-2854590-2026-01-19",
      "headline": "Akshay Kumar's convoy vehicle in freak accident; actor and wife Twinkle unhurtAkshay Kumar's convoy vehicle was hit by an auto rickshaw involved in an accident with another car. The actor and his wife Twinkle Khanna were in a different car ahead, which suffered a minor impact."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/noida/story/yogi-adityanath-orders-sit-probe-into-death-of-noida-techie-whose-car-plunged-into-pit-seeks-report-in-5-days-2854455-2026-01-19",
      "headline": "Noida CEO sacked over techie's death; Yogi Adityanath orders SIT probeNoida Authority CEO M Lokesh was removed days after a 27-year-old techie died when his car fell into a water-filled pit amid dense fog. Uttar Pradesh Chief Minister Yogi Adityanath ordered an SIT probe into the incident."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/study-abroad/story/ireland-education-irish-embassy-india-students-visa-ireland-jobs-dublin-racism-attacks-2854451-2026-01-19",
      "headline": "Ireland reacts after India Today report flags Indian students' struggle, racismIn an official response to India Today's article on challenges faced by Indian students, the Embassy of Ireland in India reaffirmed that the country remains safe, inclusive, and welcoming for Indian students and workers."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/fact-check/story/pit-of-corruption-site-of-techie-yuvrajs-death-was-under-cbi-investigation-2854500-2026-01-19",
      "headline": "Pit of corruption: Site of Noida techie's death was under CBI investigationThe nexus between negligent builders and the Noida Authority runs deeper than that pit that engulfed techie Yuvraj Mehta, who drowned after his car plunged into a water-filled pit."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/karnataka-dgp-ramachandra-rao-viral-video-intimate-act-compromising-position-official-chamber-2854295-2026-01-19",
      "headline": "DGP-level Karnataka cop Ramachandra Rao allegedly caught in intimate act in officeA video showing DGP Ramachandra Rao in compromising acts inside his office has stirred major controversy in Karnataka. The Chief Minister has expressed anger and demanded an explanation while the officer denies the allegations, calling the video morphed.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-news-pak-can-now-acheive-purpose-why-it-was-created-says-pakistan-army-cheif-asim-munir-thanks-allah-2854225-2026-01-19",
      "headline": "Pak can now achieve purpose of its creation, says Munir. What is he hinting at?Pakistan's Chief of Defence Forces, Asim Munir, said the country was at a juncture where it could achieve the purpose of its creation. He said Pakistan was created in the name of Islam and now enjoyed a special status among Islamic countries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/poland-s-jaishankar-cross-border-terrorism-pakistan-support-bilateral-meeting-2854272-2026-01-19",
      "headline": "Don't fuel terrorism in our neighbourhood, Jaishankar tells Polish counterpartIn a blunt message, External Affairs Minister S Jaishankar told Polish Foreign Minister Radoslaw Sikorski that Warsaw must adopt zero tolerance for terrorism and avoid actions that enable terrorist infrastructure in the region."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iconic-italian-fashion-designer-valentino-garavani-dies-at-93-2854582-2026-01-19",
      "headline": "Iconic Italian fashion designer Valentino Garavani dies at 93Legendary Italian fashion designer Valentino Garavani, founder of the Valentino brand and one of the last giants of pre-commercial haute couture, died at his Rome residence at the age of 93, his foundation announced."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-runs-global-affairs-like-a-mafia-boss-says-journalist-ishaan-tharoor-2854403-2026-01-19",
      "headline": "Trump runs global affairs like a mafia boss, says journalist Ishaan TharoorSeated next to Ishaan Tharoor, Financial Times columnist Gideon Rachman chimed in, saying, \"With mafia families, you get periods of peace, but eventually they start shooting at each other.\" Rachman further noted that Trump's entire modus operandi is strikingly reminiscent of how mafia bosses are portrayed in films.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/features/story/navarro-is-wrong-american-ai-companies-not-doing-any-charity-in-india-instead-they-are-using-indians-2854304-2026-01-19",
      "headline": "Navarro is wrong, American AI companies not doing any charity in IndiaPeter Navarro says Americans are paying for AI usage in India. That, all evidence suggests, can't be further from the truth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/saina-nehwal-confirms-retirement-from-badminton-2854607-2026-01-19",
      "headline": "Saina Nehwal confirms retirement from badminton: Can't push it anymoreFormer world No.1 Saina Nehwal has confirmed her retirement from badminton, revealing her body can no longer handle the sport's physical demands after two years away from the court. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/srk-takes-away-fan-phone-for-trying-to-click-selfie-on-stage-protocol-say-users-2854546-2026-01-19",
      "headline": "SRK takes away fan's phone for trying to click selfie on stage: Protocol, say usersShah Rukh Khan took away a fan's phone as the latter tried to click selfie on stage. The internet defended the actor by highlighting that he was following protocol.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-prime-minsiter-power-limit-muhammad-yunus-seeks-yes-vote-referendum-glbs-2854614-2026-01-20",
      "headline": "Bangladesh to limit PM's tenure to 10 years? Yunus seeks 'yes' vote in referendumThe push comes after Bangladesh spent much of the past decade under the leadership of Sheikh Hasina, whose multiple terms made her one of the country's longest-serving prime ministers and concentrated power in the executive branch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/airport-pick-up-and-a-hug-pm-modi-receives-uae-president-as-he-lands-in-delhi-on-a-2-hour-visit-2854369-2026-01-19",
      "headline": "Airport pick-up, hug: PM's rare gesture for UAE President on 2-hour Delhi visitSheikh Mohamed bin Zayed Al Nahyan's short visit to New Delhi marks a significant moment in India-UAE relations. Prime Minister Modi's warm welcome reflects the deepening friendship and expanding cooperation between the two nations.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/gurugram/story/swiggy-rider-run-over-scorpio-driver-gurugram-protest-police-action-2854417-2026-01-19",
      "headline": "CCTV: Scorpio driver runs over Swiggy rider in shocking Gurugram road rageA Swiggy delivery rider was critically injured in Gurugram after being run over by a Scorpio driver who knocked down his bike. The incident was captured on CCTV. Police have seized the vehicle and identified the driver."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/jupiter-uranus-neptune-venus-solar-sytem-planets-parade-visible-astronomy-spectacle-how-to-see-2854277-2026-01-19",
      "headline": "Not one, not two, you can see six planets in the sky. Here's whenFour of the planets, which are Mercury, Venus, Jupiter and Saturn, are bright enough to be spotted with the naked eye in clear conditions. However, Uranus and Neptune are significantly fainter and will require at least binoculars or a small telescope to observe. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/javed-akhtar-says-he-refused-border-2-what-is-the-need-to-rewrite-songs-2854317-2026-01-19",
      "headline": "Javed Akhtar says he refused Border 2: What is the need to rewrite songs?Javed Akhtar refused to write lyrics for Border 2. In an exclusive interview, he criticised the trend of reworking old songs and called it a creative bankruptcy. Akhtar urged filmmakers to create new music instead."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rift-in-assam-bjp-sarbananda-sonowal-busts-fake-letter-himanta-biswa-sarma-party-national-president-2854288-2026-01-19",
      "headline": "Rift in Assam BJP? Sarbananda Sonowal busts fake letter claiming Himanta stand-offA fake letter, circulated in the name of Union minister Sarbananda Sonowal calling for a leadership change in the Assam BJP, has been busted by his office. The forged document, which went viral, targeted Assam Chief Minister Himanta Biswa Sarma and called for a leadership change ahead of the 2026 Assembly elections."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/rahman-bakait-did-the-maestro-fall-for-bias-and-bait-2854223-2026-01-19",
      "headline": "Rahman Bakait: The maestro fell for bias and baitAR Rahman might just have been baited to say what he did in his latest interview that has sparked off a national controversy. Or, was he led by some sort of bias that crept into him over the years?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/vande-bharat-train-littered-within-hours-of-launch-sparks-civic-sense-outrage-2854408-2026-01-19",
      "headline": "Vande Bharat train littered within hours of launch, sparks civic sense outrageThe new Vande Bharat Sleeper Express, connecting Howrah and Guwahati, began operations amid public interest and debate about passenger behavior after a viral video highlighted littering during its inaugural run."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/donald-trump-gaza-peace-board-india-invitation-challenges-states-united-nations-multilateralism-palestine-pakistan-2854142-2026-01-19",
      "headline": "Why a seat on Trump's Gaza Peace Board could be a landmine for IndiaFor New Delhi, US President Donald Trump's invitation to its much-hyped Gaza Peace Board could be less of an easy opportunity and more of a diplomatic tight-rope walk. Here we tell you why the membership could force India to balance the pull of a Trump-led platform against its long-standing principles and commitments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/greenland-news-europe-vows-to-defend-itself-from-donald-trump-united-kingdom-sends-one-soldier-finland-two-norway-two-2853632-2026-01-19",
      "headline": "Europe shows intent in defending Greenland: UK sends 1 soldier, Finland 2, Norway 2US President Donald Trump's constant threats of annexing Greenland have finally moved Europe to send a military team to the island. Though termed a reconnaissance mission, the commitment of just 37 personnel amid Trump threats might reveal Europe's military seriousness.  Is Europe capable of resisting armed aggression without help from the US? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-muhammad-yunus-anti-india-game-china-envoy-teesta-project-masterplan-chicken-neck-siliguri-2854253-2026-01-19",
      "headline": "Yunus upping anti-India game? China envoy to visit Teesta site near Chicken's NeckMonths after torchlight rallies demanding a \"fair share\" of Teesta waters swept northern Bangladesh, the Chinese ambassador to Dhaka is planning a visit to the river project site near India's sensitive Siliguri Corridor. Framed as development cooperation, the move comes amid stalled India-Bangladesh talks and a sharpening of Dhaka's anti-India posturing under Muhammad Yunus's administration."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/saina-nehwal-confirms-retirement-from-badminton-2854607-2026-01-19",
      "headline": "Saina Nehwal confirms retirement from badminton: Can't push it anymore Former world No.1 Saina Nehwal has confirmed her retirement from badminton, revealing her body can no longer handle the sport's physical demands after two years away from the court. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-champions-league-monaco-fan-frustration-team-unity-2854555-2026-01-19",
      "headline": "Kylian Mbappe urges Real Madrid fans to back Vinicius Jr. amid poor form Kylian Mbappe has urged the Real Madrid fans to back Vinicius Jr. amidst the Brazilian's poor run of form in recent games. Mbappe said it wasn't good to blame just a player and the whole squad deserves to get stick with their performances. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-vs-gujarat-giants-wpl-2026-playoffs-gautami-naik-2854591-2026-01-19",
      "headline": "RCB march into WPL 2026 playoffs with 5th straight win, thrash Gujarat in Vadodara RCB marched into the playoffs of the WPL 2026 season with a comprehensive 61-run win over a hapless Gujarat Giants side, who failed to deliver with the bat in Vadodara on Monday, Janaury 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/dev-meena-kuldeep-yadav-pole-vault-tte-panvel-station-2854589-2026-01-19",
      "headline": "India's top pole-vaulter thrown off train by TTE, viral video sparks controversy National record holder Dev Meena and fellow athlete Kuldeep Yadav were told to deboard the train at Panvel station. Their mistake? Carry the essential gear of their sport – the pole, while returning from a competition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-ravichandran-ashwin-ravindra-jadeja-2854569-2026-01-19",
      "headline": "Ashwin urges Jadeja to reinvent, find joy like Virat Kohli in twilight phase Former India cricketer Ravichandran Ashwin has urged Ravindra Jadeja to reinvent himself in the twilight phase of his career. Ashwin's advice comes after Jadeja struggled to have any impact in the ODI series against New Zealand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/afcon-final-morocco-vs-senegal-legal-action-fifa-2854562-2026-01-19",
      "headline": "AFCON: Morocco threaten to take legal action against Senegal after final fiasco Morocco Football Federation has threatened legal action against Senegal after Sunday's fiasco in the AFCON final. The game between the two teams saw incredible chaos as Senegal threatened to walk out of the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/marc-guehi-joins-manchester-city-30-million-transfer-defensive-strength-2854558-2026-01-19",
      "headline": "Manchester City sign Marc Guehi from Palace, defender explains reason for move Manchester City has completed the transfer of England international Marc Guehi from Crystal Palace, with the 25-year-old defender joining the Premier League champions on a long-term contract after extensive negotiations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/gaurav-sawant-reports-icc-issues-ultimatum-to-bangladesh-over-world-cup-participation-in-india-ytvd-2854548-2026-01-19",
      "headline": "Gaurav Sawant Reports: ICC Issues Ultimatum to Bangladesh Over World Cup Participation in India On this Special Report, host Gaurav Sawant examines the escalating tension between the International Cricket Council (ICC) and the Bangladesh Cricket Board (BCB). The discussion centers on Bangladesh's hesitation to play World Cup matches in India, citing security concerns following the return of player Mustafizur Rahman. Gaurav Sawant notes, 'So the ICC has read the riot act to Bangladesh,' highlighting the ultimatum that the team must either participate or be replaced by Scotland. The panel, featuring sports editors Vikrant Gupta and Nikhil Naaz, explores whether these concerns are genuine or politically motivated by Bangladesh's interim government. Major Mohammad Ashraful Zaman defends the BCB's stance as a 'genuine concern' rather than politics, while other analysts suggest a potential 'logjam' that could split the cricketing world. The programme delves into the diplomatic friction and the potential long-term impact on bilateral cricket relations between India and Bangladesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-2026-day-3-order-of-play-january-20-2854516-2026-01-19",
      "headline": "Australian Open 2026, Day 3 order of play: Defending champions Sinner, Keys in action Defending champions Jannik Sinner and Madison Keys will be in action as the Australian Open 2026 rolls on to Day 3 on Tuesday, January 20. Naomi Osaka and Ben Shelton will also start their campaigns in Melbourne. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ajinkya-rahane-gautam-gambhir-india-lose-odi-series-new-zealand-2854529-2026-01-19",
      "headline": "Did Ajinkya Rahane blame Gautam Gambhir for ODI series loss to New Zealand? Former India captain Ajinkya Rahane questioned the Gautam Gambhir-led team management for making frequent changes after the home ODI series loss to New Zealand, stressing the need for clarity and a settled XI ahead of the 2027 ODI World Cup."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-goat-tour-organiser-shatadru-dutta-2854505-2026-01-19",
      "headline": "Arrested for GOAT tour mismanagement, organiser Satadru gets bail after 37 days Lionel Messi's GOAT tour organiser, Satadru Dutta, was granted bail after 37 days in custody. Dutta was jailed after chaos broke out at the Salt Lake Stadium during Messi's event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-australian-open-100th-match-win-reaction-2854494-2026-01-19",
      "headline": "Djokovic begins 25th Grand Slam quest with milestone 100th Australian Open victoryNovak Djokovic kick-started his quest for a record 25th Grand Slam title by registering his 100th career win at the Australian Open. The Serb defeated Spain's Pedro Martinez in straight sets in the opening round in Melbourne."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/steve-smith-olympics-batting-t20-world-cup-bbl-2854466-2026-01-19",
      "headline": "Steve Smith accepts T20 World Cup fate, targets LA Olympics 2028Australia's Steve Smith might have been snubbed from the T20 World Cup squad, but the 36-year-old is not ready to retire from the format yet. Smith has revealed that he wants to play in the LA Olympics, set to be played in 2028."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-virat-kohli-retirement-age-simon-doull-2854454-2026-01-19",
      "headline": "Virat Kohli still the fittest, he can play ODIs until he is 45: Simon DoullIndia vs New Zealand: Former New Zealand fast bowler Simon Doull said Virat Kohli has it in him to continue until the age of 45, noting that the India great remains one of the fittest cricketers around. Kohli has scored more than 600 runs in nine matches since returning to action in October 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/priscilla-hon-advances-australian-open-second-round-opponent-retires-cramps-2854434-2026-01-19",
      "headline": "Pure class: Hon helps injured opponent Stakusic get off court in wheelchairPriscilla Hon showed pure class as she helped her opponent Marina Stakusic leave the court in a wheelchair after getting injured and being forced to retire from their first round clash on Monday, January 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/nikhil-naz-slams-bcci-silence-after-gautam-gambhirs-india-loses-historic-odi-series-to-new-zealand-ytvd-2854450-2026-01-19",
      "headline": "Nikhil Naz Slams BCCI Silence After Gautam Gambhir's India Loses Historic ODI Series To New ZealandOn this India Today special report, sports journalist Nikhil Naz analyses the crisis in Indian cricket following a historic ODI series defeat against New Zealand. For the first time since 1988, New Zealand has secured a bilateral ODI series win on Indian soil, also marking India's first ever defeat at Indore's Holkar Stadium. Naz highlights that 'it definitely is a Gambhir situation', pointing to the turbulent tenure of head coach Gautam Gambhir, under whom India has now lost three ODI series. The discussion shifts to the perceived inaction of the Board of Control for Cricket in India (BCCI). Naz criticises the board for failing to hold review meetings or address systemic issues, contrasting their silence with the proactive approach of the English Cricket Board. The report questions whether the management and selectors are being held accountable for the team's declining performance across formats ahead of the 2027 ODI World Cup."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/video/icc-issues-ultimatum-to-bangladesh-over-t20-world-cup-participation-in-india-ytvd-2854447-2026-01-19",
      "headline": "ICC Issues Ultimatum To Bangladesh Over T20 World Cup Participation In IndiaThis report examines the escalating crisis surrounding the ICC Men's T20 World Cup 2026 as Bangladesh faces a potential exit from the tournament. The International Cricket Council (ICC) has reportedly issued a firm ultimatum, stating 'you let us know by Wednesday' if a solution can be reached regarding their participation in India. Bangladesh has expressed reluctance to travel to India, requesting a move to neutral venues or a group swap, both of which the ICC has rejected. The programme highlights that Scotland is on standby as a replacement team. Furthermore, the situation has 'snowballed' with reports that Pakistan may also review its participation if Bangladesh is removed. This marks a historic tension where a team faces complete removal rather than just forfeiting points for individual matches, threatening the integrity of the upcoming global event."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/video/sonal-mehrotra-kapoor-on-how-pollution-is-shattering-indias-khelo-india-dream-ytvd-2854438-2026-01-19",
      "headline": "Nikhil Naz Discusses Impact Of Delhi's Toxic Air On India's Global Sporting ImageOn this Special Report, Sonal Mehrotra Kapoor and Nikhil Naz discuss the alarming impact of air pollution on India's status as a global sporting hub. The discussion follows reports of Danish shuttler Mia Blichfeldt withdrawing from the India Open and paying a heavy fine to avoid Delhi's toxic air. Indian chess grandmaster Vidit Gujrathi is also quoted, stating that 'People are slowly being poisoned in Delhi and nobody seems to care.' The programme highlights how environmental conditions and poor hygiene at venues are deterring international athletes and affecting the training of budding domestic sportspersons. Nikhil Naz points out that while international players voice concerns, Indian athletes often remain silent due to fear of social media trolling or administrative backlash. The report raises critical questions about India's preparedness for major upcoming events like the World Championships and the Olympics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-t20-world-cup-squad-updates-cummins-out-opener-hazlewood-optimistic-tim-david-fit-2854363-2026-01-19",
      "headline": "Australia to do a Travis Head with Cummins at T20 World Cup? Bailey respondsAustralia's chief selector, George Bailey, has confirmed Pat Cummins will miss the T20 World Cup opener, while Tim David is expected to be fit despite a minor injury setback. Updates on Josh Hazlewood and squad selection deadlines were also provided."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/daniil-medvedev-australian-open-win-challenge-carlos-alcaraz-jannik-sinner-2854367-2026-01-19",
      "headline": "Medvedev says he can beat SinCaraz after winning first Grand Slam match in a yearFormer world No.1 Daniil Medvedev believes he can still take down Carlos Alcaraz and Jannik Sinner after ending a 370-day drought for a Grand Slam victory at the Australian Open."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/malinda-pushpakumara-becomes-fourth-sri-lankan-to-take-1000-first-class-wickets-2854262-2026-01-19",
      "headline": "Malinda Pushpakumara becomes fourth Sri Lankan to take 1,000 first-class wicketsMalinda Pushpakumara entered an exclusive club on Wednesday by becoming only the fourth Sri Lankan cricketer to claim 1,000 wickets in first-class cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-daniil-medvedev-stanislas-wawrinka-marin-cilic-2854264-2026-01-19",
      "headline": "Fire still burning for Stan Wawrinka, Daniil Medvedev ends year-long waitAustralian Open 2026: Former champion Stan Wawrinka recovered from a set down to beat Laslo Djere and book his place in the second round. Daniil Medvedev ended a year's wait for a first-round win at a Grand Slam while 37-year-old Marin Cilic power through to the second round. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/video/nikhil-naz-on-icc-ultimatum-to-bangladesh-over-india-hosted-t20-world-cup-ytvd-2854242-2026-01-19",
      "headline": "Nikhil Naz On ICC Ultimatum To Bangladesh Over India-Hosted T20 World CupOn this Special Report, sports editor Nikhil Naz discusses the escalating tension between the International Cricket Council (ICC) and the Bangladesh Cricket Board (BCB). The ICC has issued a firm ultimatum to Bangladesh, demanding confirmation by Wednesday, January 21, regarding their participation in the T20 World Cup hosted by India. Nikhil Naz notes, 'If you do not confirm your participation, then we will be forced to replace you with another team based on rankings.' The standoff follows the BCB's refusal to travel to India citing security concerns, a situation triggered after the BCCI reportedly requested an IPL franchise to drop Mustafizur Ahmed. While Bangladesh has proposed moving their matches to Sri Lanka or adopting a hybrid model, the ICC has rejected these alternatives. If Bangladesh fails to comply by the deadline, they risk being replaced by Scotland, marking an unprecedented logjam in international cricket history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-3rd-odi-daryl-mitchell-explains-plan-to-attack-kuldeep-yadav-2854221-2026-01-19",
      "headline": "Targeting Kuldeep Yadav was part of New Zealand's plan, reveals Daryl MitchellNew Zealand's Indore ODI hero Daryl Mitchell revealed that going after \"world-class\" spinner Kuldeep Yadav from ball one was a planned move, aimed at preventing the wrist-spinner from settling into a match-controlling rhythm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/pullela-gopichand-coaching-methods-shape-indian-badminton-champions-2854217-2026-01-19",
      "headline": "Can't eat biryani and win World Champs: Taskmaster Gopichand explains his methodsLegendary shuttler Pullela Gopichand explained why he opts for tough training regimes for his wards, acknowledging that some of his methods have been labelled extreme. The former All England Open champion played a key role in shaping Saina Nehwal and PV Sindhu into world beaters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-super-league-auction-system-psl-draft-system-removed-2854204-2026-01-19",
      "headline": "Pakistan Super League to switch to IPL-style auction, scrap draft systemThe Pakistan Cricket Board has confirmed sweeping structural reforms to the Pakistan Super League (PSL), with the league set to move from a draft system to a player auction model."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-rohit-sharma-odi-poor-form-new-zealand-future-questioned-2854189-2026-01-19",
      "headline": "Rohit's hunger questioned after poor show vs New Zealand: 2027 too far awayRohit Sharma's recent poor performance in the ODI series against New Zealand has raised questions about his hunger and future in the Indian team. Former cricketer Simon Doull doubts whether Rohit remains motivated for the 2027 World Cup amid limited upcoming ODI opportunities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-virat-kohli-mentality-sunil-gavaskar-lesson-2854182-2026-01-19",
      "headline": "What sets Virat Kohli apart in ODIs? Gavaskar shares a lesson for youngstersIndia vs New Zealand: Former India captain Sunil Gavaskar has explained what sets Virat Kohli apart in ODIs and urged young batters to take a leaf out of his book to master the art of pacing an innings while chasing stiff targets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-harshit-rana-praise-batting-indore-kris-srikkanth-2854162-2026-01-19",
      "headline": "Harshit Rana's biggest critic turns his fan: New Zealand were scared by his hittingIndia vs New Zealand: Former India opener Kris Srikkanth praised Harshit Rana's batting, saying the young all-rounder entertained with his six-hitting in India's defeat to New Zealand in Indore on Sunday, January 18."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}