{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/musks-starlink-gets-licence-for-satcom-services-in-india-news-agency-pti-quoting-sources-2736832-2025-06-06",
      "headline": "Musk's Starlink gets licence for satcom services in India: News agency PTI quoting sourcesMusk's Starlink gets licence for satcom services in India: News agency PTI quoting sources"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-jumps-over-700-points-nifty-goes-past-25000-rbi-mpc-rate-cut-bajaj-finance-gains-5-percent-2736785-2025-06-06",
      "headline": "Sensex jumps over 700 points, Nifty goes past 25,000; Bajaj Finance gains 5%The S&P BSE Sensex jumped 746.95 points to end at 82,188.99, while the NSE Nifty50 gained 252.15 points to close at 25,003.05. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/us-donald-trump-double-tariff-steel-aluminium-india-trade-export-impact-expert-view-2736782-2025-06-06",
      "headline": "US doubles steel, aluminium tariff: Is it a big worry for India?The tariff hike does not apply to all countries. The United Kingdom has been excluded because of a trade agreement already in place with the US. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rbi-rate-cut-may-hurt-fds-interest-rate-heres-what-investors-should-do-now-mpc-meeting-repo-rate-reduction-crr-phased-cut-2736729-2025-06-06",
      "headline": "RBI rate cut may hurt FDs. Here's what investors should do nowBanks have already begun adjusting their FD rates downward following the RBI's earlier moves since February 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-spacex-elon-musk-fallout-with-donald-trump-beyond-politics-big-losses-2736697-2025-06-06",
      "headline": "Elon Musk thought he could play politics. Now Tesla's paying the priceElon Musk's fallout with Donald Trump cost Tesla $150 billion in a day. His gamble with power seems to be backfiring fast, and the fallout could reach far beyond the stock market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-repo-rate-news-lending-cut-by-50-basis-points-front-loading-sanjay-malhotra-2736688-2025-06-06",
      "headline": "Explained: What does the RBI mean by front-loading the rate cutThe RBI's latest rate cut is being called a \"front-loaded\" rate cut, meaning the central bank is cutting interest rates earlier and by a bigger margin than usual."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbis-big-crr-boost-what-it-means-for-banks-and-you-2736664-2025-06-06",
      "headline": "RBI's big CRR boost: What it means for banks and youIf you're eyeing a home loan, car loan, or personal loan, this development could work in your favour. With banks gaining access to more funds, interest rates on loans are likely to drop, which means your monthly EMIs could reduce."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-cuts-repo-rate-again-by-50-bps-to-550-percent-5-key-takeaways-you-must-know-home-loans-may-get-cheaper-2736602-2025-06-06",
      "headline": "RBI cuts repo rate again: 5 key takeaways you must knowSince February 2025, the RBI has slashed the repo rate by a full 100 basis points. With this sharp reduction, it believes there's now less room left to cut rates further to support growth. So, the RBI has changed its policy stance from \"accommodative\" to \"neutral\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/rbi-slashes-repo-rate-by-50-basis-points-to-55-third-consecutive-cut-2736588-2025-06-06",
      "headline": "RBI slashes repo rate by 50 basis points to 5.5%, third consecutive cutThe Reserve Bank of India (RBI) has reduced the repo rate by 50 basis points to 5.5%, marking the third consecutive rate cut. This decision comes amid a sharp drop in retail inflation to 3.16% in April and strong economic growth of 7.4% in the January-March quarter. The move is expected to make loans cheaper, benefiting borrowers, especially home buyers. The RBI has also changed its stance from accommodative to neutral, indicating a data-driven approach moving forward."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rally-sensex-up-500-points-rbi-repo-rate-cut-50-bps-nifty-gain-nse-bse-rise-2736592-2025-06-06",
      "headline": "Sensex jumps 700 points: Why RBI's bumper rate cut has Dalal Street buzzingStock market today: The S&P BSE Sensex was up by 731.61 points to 82,173.65, while the NSE Nifty rallied by 236.30 points to 24,987.20 as of 11:21 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbis-bumper-rate-cut-to-lower-home-auto-loan-emis-what-it-means-for-you-2736562-2025-06-06",
      "headline": "RBI's bumper rate cut to lower home, auto loan EMIs: What it means for youThe decision was announced after RBI Governor Sanjay Malhotra and the six-member Monetary Policy Committee (MPC) wrapped up their three-day review on Friday. This is the third consecutive rate cut, following back-to-back reductions earlier this year, including a 25-basis point cut in April."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-slashes-key-lending-rate-for-3rd-consecutive-time-brings-it-down-to-55-2736557-2025-06-06",
      "headline": "RBI slashes key lending rate for 3rd consecutive time, brings it down to 5.5%The decision was announced after the central bank's Monetary Policy Committee (MPC), led by Governor Sanjay Malhotra, concluded its three-day meeting that began on June 4."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kim-soo-hyuns-global-rise-amid-scandal-as-anti-garosero-petition-grows-2735538-2025-06-06",
      "headline": "Kim Soo Hyun's global rise amid scandal as anti-GaroSero petition growsKim Soo Hyun is regaining global popularity as his hit drama 'My Love from the Star' debuts in Brazil on SBT, despite ongoing controversy in South Korea involving allegations related to the late Kim Sae Ron. The show's international success marks a key moment in his image revival."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-jin-j-hope-impress-in-classic-suits-ahead-of-bts-festa-2025-2736615-2025-06-06",
      "headline": "BTS Jin, J-Hope impress in classic suits ahead of BTS Festa 2025BTS members Jin and J-Hope shared new photos for Festa 2025, marking BTS's 12th anniversary and upcoming reunion after military service."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-farhan-akhtar-sivakarthikeyan-almost-signed-for-sitare-zameen-par-2736821-2025-06-06",
      "headline": "Aamir Khan reveals Sitaare Zameen Par almost starred Farhan Akhtar, SivakarthikeyanAamir Khan, in a recent round-table interaction, revealed that he had initially backed out of 'Sitare Zameen Par'. The actor recalled that Farhan Akhtar and Sivakarthikeyan were signed in for the film's Hindi and "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/javed-akhtar-receives-dostoevsky-star-award-shabana-azmi-reacts-2736753-2025-06-06",
      "headline": "Javed Akhtar receives Dostoevsky Star Award, Shabana Azmi shares glimpsesVeteran poet and lyricist Javed Akhtar has been honoured with the prestigious Dostoevsky Star Award by the Russian House for his global literary impact. This adds to his long list of accolades, including the Padma Bhushan and Sahitya Akademi Award."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pawan-kalyans-hari-hara-veera-mallu-postponed-again-will-be-worth-the-wait-2736787-2025-06-06",
      "headline": "Pawan Kalyan's Hari Hara Veera Mallu postponed again: Will be worth the waitAfter months of speculation, the release of Pawan Kalyan's long-delayed period action drama, 'Hari Hara Veera Mallu', has officially been postponed once again. It was slated for a grand release on June 12."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ap-dhillon-loses-cool-at-mumbai-airport-after-fan-persistent-request-for-selfie-2736532-2025-06-06",
      "headline": "AP Dhillon loses cool at Mumbai airport after fan's persistent request for selfieAP Dhillon was visibly uncomfortable at Mumbai airport after a fan repeatedly asked for selfies and invaded his personal space. Annoyed at the fan's request, AP Dhillon asked,\"Kitni photos lega yaar? (How many photos will you take)\". The singer firmly said \"enough\" before walking away."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/housefull-5-movie-review-cringe-and-chaos-in-this-mystery-of-who-killed-comedy-2736724-2025-06-06",
      "headline": "Housefull 5 review: Cringe and chaos in this mystery of who killed comedyReleased-Fri Jun 06, 2025Housefull 5 movie review: In the Akshay Kumar-starrer, the real comedian, Johnny Lever, takes a backseat while the cruise sails full speed ahead in a tide of obscene jokes and crass humour. If this is what Bollywood thinks comedy is, we might need a national sense of humour check. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/hina-khan-rocky-jaiwal-wedding-resumes-work-award-show-2736672-2025-06-06",
      "headline": "Hina Khan resumes work a day after wedding with Rocky JaiswalActor Hina Khan resumed work a day after her wedding with long-time boyfriend Rocky Jaiswal. She was clicked at an event in Mumbai.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aamir-khan-theatre-only-release-sitaare-zameen-par-amitabh-bachchan-encouragement-2736669-2025-06-06",
      "headline": "Aamir Khan: Amitabh Bachchan encouraged Sitaare Zameen Par's theatre-only releaseBollywood actor Aamir Khan has decided to release Sitaare Zameen Par exclusively in theatres, rejecting early digital release. He revealed that Amitabh Bachchan's support played a key role in this risky but cinema-loyal decision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/netflix-dept-q-redefines-slow-burn-police-procedural-drama-scottish-noir-2736675-2025-06-06",
      "headline": "Netflix's Dept.Q is a masterful Scottish crime drama that rewards patienceIn 'Dept. Q', Netflix delivers a masterful Scottish thriller that combines authentic character development with methodical storytelling. This slow-burn procedural proves the audience's patience pays off in the end. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/sapphire-out-ed-sheeran-sings-in-punjabi-as-he-collaborates-with-arijit-singh-2736677-2025-06-06",
      "headline": "Sapphire out: Ed Sheeran sings in Punjabi as he collaborates with Arijit SinghEd Sheeran's latest song 'Sapphire' is finally out, and it is sure to give major Goa vibes. The English singer has collaborated with Arijit Singh, and the video also features a glimpse of Shah Rukh Khan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/good-boy-review-park-bo-gum-action-comedy-kdrama-2736612-2025-06-06",
      "headline": "Good Boy review: Park Bo-gum shines in goofy and gutsy KdramaReleased-Sat May 31, 2025Good Boy series review: Good Boy stars Park Bo-gum as a rookie cop in a quirky action-comedy drama. The show blends humour and thrilling fights, promising a fresh take on Kdrama police stories."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tom-felton-returns-as-draco-malfoy-for-broadway-harry-potter-and-the-cursed-child-2736606-2025-06-06",
      "headline": "Tom Felton returns as Draco Malfoy for Broadway's Harry Potter and the Cursed ChildActor Tom Felton is all set to make his Broadway debut in 'Harry Potter and the Cursed Child.' He will reprise his role of Draco Malfoy in the play set 19 years after the events of the final book."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nagarjuna-son-akhil-akkineni-zainab-ravdjee-married-2736628-2025-06-06",
      "headline": "Nagarjuna's son Akhil Akkineni and Zainab Ravdjee are married. First pics outNagarjuna and Amala Akkineni's youngest son, Akhil Akkineni, married his fiancée, Zainab Ravdjee, in an intimate wedding on June 6. Their photos from the traditional wedding ceremony are doing the rounds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/abhishek-bachchan-garmi-hook-step-housefull-5-bts-amitabh-bachchan-reacts-2736583-2025-06-06",
      "headline": "Abhishek Bachchan nails Garmi hook step in Housefull 5 BTS, Big B reactsAbhishek Bachchan showed off his moves with Nora Fatehi's Garmi hook step in a fun 'Housefull 5' BTS video. Amitabh Bachchan watched the clip and reacted with amusement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/housefull-5-x-reviews-fans-call-it-entertaining-yet-illogical-bollywood-masala-2736611-2025-06-06",
      "headline": "Housefull 5 X reviews: Fans call it entertaining yet illogical Bollywood masalaAkshay Kumar's 'Housefull 5' has received positive reviews from fans on X, praising its comedy, star performances, and thrilling murder mystery twist. Audiences are eagerly waiting for the release of the second part to see how the story unfolds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/virat-kohli-sister-bhawna-kohli-rubbishes-speculations-rift-with-anushka-sharma-2736596-2025-06-06",
      "headline": "Virat Kohli's sister rubbishes speculation of rift with brother and Anushka SharmaVirat Kohli's sister Bhawna Kohli has shut down speculations of any rift between her brother and Anushka Sharma. Bhawna set the record straight in a now-deleted post. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tom-cruise-sets-guinness-world-record-for-parachute-stunt-in-mission-impossible-8-2736565-2025-06-06",
      "headline": "Tom Cruise sets Guinness World Record for parachute stunt in Mission Impossible 8Tom Cruise has been awarded a Guinness World Record for performing burning parachute jumps in 'Mission: Impossible – The Final Reckoning'. He jumped out of a helicopter 16 times with a flaming, fuel-soaked parachute with a 50-pound camera rig on his body."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/chiranjeevi-sobhita-naga-chaitanya-ram-charan-akhil-akkineni-zainab-ravdjee-nagarjuna-wedding-festivities-2736581-2025-06-06",
      "headline": "Chiranjeevi, Sobhita-Naga Chaitanya, celebs at Akhil-Zainab's wedding festivitiesNagarjuna's younger son, Akhil Akkineni, is all set to get married to Zainab Ravdjee today, June 6, in Hyderabad. Ahead of the grand day, wedding festivities began at the Akkineni house with several celebs in attendance. \r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/musks-starlink-gets-licence-for-satcom-services-in-india-news-agency-pti-quoting-sources-2736832-2025-06-06",
      "headline": "Elon Musk's Starlink gets licence to launch in IndiaMusk's Starlink gets licence for satcom services in India: News agency PTI quoting sources"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jammu-and-kashmir-omar-abdullah-pm-modi-jk-statehood-chief-minister-demoted-2736741-2025-06-06",
      "headline": "I got demoted: Omar Abdullah shares stage with PM, pushes for J&K statehoodWhile sharing the stage with PM Modi, Jammu and Kashmir Chief Minister Omar Abdullah renewed his call for restoring J&K's statehood. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/no-coercive-steps-against-state-cricket-body-for-now-karnataka-high-court-day-after-stampede-case-filed-2736818-2025-06-06",
      "headline": "High Court bars coercive steps against Karnataka cricket body in stampede caseJustice SR Krishna Kumar, directing the petitioner to not leave the jurisdiction of the court without permission, also instructed KSCA officials to cooperate with the probe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-inaugurates-worlds-highest-rail-bridge-over-river-chenab-that-will-link-kashmir-valley-to-rest-of-countr-2736622-2025-06-06",
      "headline": "PM opens landmark Chenab Bridge, flags off Vande Bharat in massive Kashmir pushThe inauguration of multiple all-weather infrastructure projects in Kashmir served as a strong message from PM Modi that his government remains committed to the development of the region."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/housefull-5-movie-review-cringe-and-chaos-in-this-mystery-of-who-killed-comedy-2736724-2025-06-06",
      "headline": "Housefull 5 review: Cringe and chaos in this mystery of who killed comedyReleased-Fri Jun 06, 2025Housefull 5 movie review: In the Akshay Kumar-starrer, the real comedian, Johnny Lever, takes a backseat while the cruise sails full speed ahead in a tide of obscene jokes and crass humour. If this is what Bollywood thinks comedy is, we might need a national sense of humour check. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-chief-minister-siddaramaiahs-political-secretary-shunted-amid-massive-anger-over-bengaluru-stampede-2736784-2025-06-06",
      "headline": "Siddaramaiah's political secretary sacked after Bengaluru stampede deathsThe Karnataka government has removed K Govindraj from his post as the Chief Minister Siddaramaiah's political secretary. The move follows the stampede outside Chinnaswamy Stadium that claimed 11 lives. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-remembers-hero-pahalgam-pony-ride-operator-adil-says-pak-attacked-tourists-as-they-wanted-to-trigger-riots-2736718-2025-06-06",
      "headline": "PM remembers Pahalgam's hero pony ride operator, says Pak wanted riots in IndiaPM Modi praised the bravery of citizens of Jammu and Kashmir for standing firmly against Pakistan-backed terrorism. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/b-dayananda-suspension-creates-online-backlash-against-ktaka-govt-support-for-bangalore-police-commissioner-ove-stadium-stampede-case-2736681-2025-06-06",
      "headline": "Support pours in for Bengaluru top cop B Dayananda after suspension over stampedePublic and political backlash has erupted online after Bengaluru Police Commissioner B Dayanand was suspended following the June 4 stampede, with calls for accountability redirected at the government itself. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/donald-trump-elon-musk-breakup-saga-wrecks-the-maga-soap-opera-2736695-2025-06-06",
      "headline": "Trump-Musk breakup saga wrecks the MAGA soap operaDonald Trump and Elon Musk's public feud erupts, turning their bromance into a bitter spectacle. Egos clash, secrets spill, and empires tremble in this chaotic, meme-fuelled theatre of the absurd. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kashmir-kanyakumari-railway-chenab-bridge-srinagar-vande-bharat-jammu-130-year-old-dream-maharaja-pratap-singh-history-2736605-2025-06-06",
      "headline": "A 140-year-old dream gets fulfilled with Kashmir-Kanyakumari rail linkThe inauguration of the last section of the Udhampur-Baramulla-Srinagar Rail Link, Chenab Bridge and Ajni Bridge will enable direct train travel from Kashmir to Kanyakumari. The project, which needed modern engineering capabilities, was a dream of the Dogra king of Jammu and Kashmir, Maharaja Pratap Singh, who in the late 1880s envisioned the route and engaged British engineers for surveys."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-chenab-rail-bridge-jammu-kashmir-vande-bharat-trains-omar-abdullah-2736738-2025-06-06",
      "headline": "Omar Abdullah's childhood dream came true, proud to finish unfinished projects: PMPM Modi said Omar Abdullah's school-time dream was fulfilled with the completion of the Udhampur-Srinagar-Baramulla rail link, calling it a symbol of national unity and infrastructural resolve."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/in-trump-vs-musk-battle-nasa-is-the-biggest-loser-2736631-2025-06-06",
      "headline": "In Trump vs Musk battle, Nasa is the biggest loserWhile Trump has certain plans for Nasa, the American space agency is heavily dependent on Musk's SpaceX for most of its operations in the Low Earth Orbit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/first-pictures-of-dragon-spacecraft-that-shubhanshu-shukla-will-pilot-to-space-2736696-2025-06-06",
      "headline": "First pictures of Dragon that Shubhanshu Shukla will pilot to spaceThe spacecraft that will carry four Ax-4 astronauts and return them to Earth arrived at the hangar at pad 39A in Florida ahead of its first flight."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/no-role-in-organising-event-cricket-body-distances-itself-from-bengaluru-stampede-blames-state-organisers-2736739-2025-06-06",
      "headline": "Karnataka cricket body denies role in RCB event stampede, blames state, organisersThe Karnataka State Cricket Association (KSCA) distanced itself from the stampede that occurred during the RCB felicitation event, blaming the state government, RCB, and event organisers for crowd mismanagement. It claimed no role in planning or executing the event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/hemant-nimbalkar-karnataka-intelligence-chief-transferred-as-state-takes-action-after-stampede-2736770-2025-06-06",
      "headline": "Bengaluru stampede: After action on cops, Karnataka transfers intelligence chiefFollowing suspension of top police officials, Intelligence Chief Hemanth Nimbalkar has now been transferred as part of the Karnataka government's administrative shake-up over the stampede outside M Chinnaswamy Stadium that claimed eleven lives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kashmir-to-kanyakumari-has-become-a-reality-proud-that-we-completed-unfinished-project-pm-modi-in-jammu-2736702-2025-06-06",
      "headline": "Kashmir to Kanyakumari rail connectivity now a reality: PM Modi in JammuCalling it a deeply emotional and symbolic achievement for the nation, PM Modi said, \"The dream of lakhs of people in Jammu & Kashmir has finally been fulfilled.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/netflix-dept-q-redefines-slow-burn-police-procedural-drama-scottish-noir-2736675-2025-06-06",
      "headline": "Netflix's Dept.Q is a masterful Scottish crime drama that rewards patienceIn 'Dept. Q', Netflix delivers a masterful Scottish thriller that combines authentic character development with methodical storytelling. This slow-burn procedural proves the audience's patience pays off in the end. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/elon-musk-donald-trump-feud-doge-argument-epstein-files-national-secret-new-bill-tesla-spacex-2736601-2025-06-06",
      "headline": "We're 4-5 tweets away from national secrets: Internet grabs popcorn as Trump, Musk sparThe dramatic fallout between Donald Trump and Elon Musk has captivated global attention, with their escalating feud playing out online. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/chenab-bridge-inauguration-pm-modi-kashmir-visit-congress-jairam-ramesh-2736661-2025-06-06",
      "headline": "Don't hog credit: Congress targets PM as record-setting Chenab rail bridge opensThe Congress accused PM Modi of claiming sole credit for the Chenab rail bridge, highlighting contributions by past prime ministers, including the late Manmohan Singh and Atal Bihari Bajpayee. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-musk-blowup-public-spat-spending-bill-doge-cuts-tesla-shares-spacex-threat-2736477-2025-06-06",
      "headline": "When unstoppable ego met immovable megalomaniac: Trump-Musk breakup in 4 ActsMusk bankrolled Trump's return to power, stood by him on election night, and was crowned a 'super genius' from the inaugural podium. But in just six months, Musk went from kingmaker to enemy number one — as ego clash led to a breakup that rocked Washington and Wall Street alike."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/japans-resilience-lander-crashes-on-the-moon-heres-what-went-wrong-2736656-2025-06-06",
      "headline": "Why did Japanese ispace's Resilience lander crash on the Moon?Hours after the spacecraft crashed on the Moon, ispace revealed the initial findings from data it received moments before the spacecraft had a hard landing on the Moon. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-spacex-elon-musk-fallout-with-donald-trump-beyond-politics-big-losses-2736697-2025-06-06",
      "headline": "Elon Musk thought he could play politics. Now Tesla's paying the priceElon Musk's fallout with Donald Trump cost Tesla $150 billion in a day. His gamble with power seems to be backfiring fast, and the fallout could reach far beyond the stock market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbis-bumper-rate-cut-to-lower-home-auto-loan-emis-what-it-means-for-you-2736562-2025-06-06",
      "headline": "RBI's bumper rate cut to lower home, auto loan EMIs: What it means for youThe decision was announced after RBI Governor Sanjay Malhotra and the six-member Monetary Policy Committee (MPC) wrapped up their three-day review on Friday. This is the third consecutive rate cut, following back-to-back reductions earlier this year, including a 25-basis point cut in April."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/operation-sindoor-united-abroad-divided-at-home-2736389-2025-06-06",
      "headline": "Operation Sindoor: United abroad, divided at homeWhen an all-party meeting is called to discuss Operation Sindoor, the prime minister doesn't even attend it. Now, when a special session is demanded on the post-Pahalgam situation, the government ignores the plea. When debate is strangulated, democracy is weakened. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/fih-pro-league-india-world-cup-spot-craig-fulton-2736826-2025-06-06",
      "headline": "World Cup qualification via Hockey Pro League a priority for India: Coach Craig FultonIn an exclusive interaction with India Today, men's hockey team coach Craig Fulton said that India will be aiming to secure their spot in the World Cup next year by finishing in the top spot in the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-test-shubman-gill-pack-of-wolves-virat-kohli-2736794-2025-06-06",
      "headline": "Shubman Gill should create a pack of wolves: Ex India cricketerShubman Gill has been named India's new Test captain. Akash Chopra has urged the batters to create a pack of wolves."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mitchell-starc-opens-up-on-not-returning-to-india-for-ipl-2736781-2025-06-06",
      "headline": "Mitchell Starc opens up on not returning to India for IPL: We saw what happenedAustralia fast bowler Mitchell Starc recently opened up on his decision to pull out of the last leg of the Indian Premier League 2025 (IPL 2025) and revealed that a variety of factors influenced his decision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-lions-vs-india-a-2nd-unofficial-test-live-score-and-updates-2736772-2025-06-06",
      "headline": "England Lions vs India A Live: Rain stops play after Chris Woakes' doublestrikeEngland Lions vs India A 2nd Unofficial Test: Chris Woakes has sent back Yashasvi Jaiswal and Abhimanyu Easwaran in his first spell. KL Rahul is still out there and now has Karun Nair by his side. Earlier, England Lions won the match and opted to bowl first in overcast conditions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-west-indies-t20i-series-schedule-squads-livestreaming-details-2736747-2025-06-06",
      "headline": "ENG vs WI T20I series: live-streaming details and all you need to knowEngland and West Indies are all set to begin their journey to the T20 World Cup 2026 with a three-match series, which will begin on Friday, June 6. England and West Indies will have new captains at the helm. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/piyush-chawla-retires-from-all-forms-of-cricket-2736731-2025-06-06",
      "headline": "3rd highest wicket-taker in IPL history, Piyush Chawla retires from all forms of cricketIndian leg spinner Piyush Chawla called his time on his cricketing career on Friday, June 6. A multi-time World Cup, Chawla, retires as the third-highest wicket-taker in the history of the Indian Premier League."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/mark-wood-likely-to-be-fit-by-fourth-test-against-india-luke-wright-2736716-2025-06-06",
      "headline": "Mark Wood likely to be fit by 4th Test against India: England national selectorEngland fast bowler Mark Wood is likely to be fit by the fourth Test of the series against India, revealed England's national selector Luke Wright. Engalnd and India will lock horns in a five-match Test series from June 20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/uefa-nations-league-semi-final-spain-vs-france-lamine-yamal-cristiano-ronaldo-2736690-2025-06-06",
      "headline": "Lamine Yamal relishing challenge of facing Cristiano Ronaldo in Nations League finalLamine Yamal said that he is relishing the challenge of facing Cristiano Ronaldo in the UEFA Nations League final after Spain defeated France in the semi-final on June 5. Spain defeated France 5-4 in Stuttgart. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/norway-chess-magnus-carlsen-d-gukesh-final-2736673-2025-06-06",
      "headline": "Norway Chess: D Gukesh, Magnus Carlsen leading race going into final roundIndia's D Gukesh and the legendary Magnus Carlsen are leading the race in Norway Chess going into the final round of the tournament. The two players are divided by just half a point, with Carlsen having the lead after Round 9.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/rohit-sharma-father-was-disappointed-with-his-test-retirement-2736649-2025-06-06",
      "headline": "Rohit's father was disappointed with his Test retirement, India batter revealsStar India batter Rohit Sharma has revealed that his father was left disappointed following his retirement from Tests. Rohit called time on his Test career ahead of the all-important tour of England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/piyush-chawla-retires-from-all-forms-of-cricket-2736731-2025-06-06",
      "headline": "3rd highest wicket-taker in IPL history, Piyush Chawla retires from all forms of cricketIndian leg spinner Piyush Chawla called his time on his cricketing career on Friday, June 6. A multi-time World Cup, Chawla, retires as the third-highest wicket-taker in the history of the Indian Premier League."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/mark-wood-likely-to-be-fit-by-fourth-test-against-india-luke-wright-2736716-2025-06-06",
      "headline": "Mark Wood likely to be fit by 4th Test against India: England national selectorEngland fast bowler Mark Wood is likely to be fit by the fourth Test of the series against India, revealed England's national selector Luke Wright. Engalnd and India will lock horns in a five-match Test series from June 20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/uefa-nations-league-semi-final-spain-vs-france-lamine-yamal-cristiano-ronaldo-2736690-2025-06-06",
      "headline": "Lamine Yamal relishing challenge of facing Cristiano Ronaldo in Nations League finalLamine Yamal said that he is relishing the challenge of facing Cristiano Ronaldo in the UEFA Nations League final after Spain defeated France in the semi-final on June 5. Spain defeated France 5-4 in Stuttgart. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/norway-chess-magnus-carlsen-d-gukesh-final-2736673-2025-06-06",
      "headline": "Norway Chess: D Gukesh, Magnus Carlsen leading race going into final roundIndia's D Gukesh and the legendary Magnus Carlsen are leading the race in Norway Chess going into the final round of the tournament. The two players are divided by just half a point, with Carlsen having the lead after Round 9.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/rohit-sharma-father-was-disappointed-with-his-test-retirement-2736649-2025-06-06",
      "headline": "Rohit's father was disappointed with his Test retirement, India batter revealsStar India batter Rohit Sharma has revealed that his father was left disappointed following his retirement from Tests. Rohit called time on his Test career ahead of the all-important tour of England."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}