{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/succession-wars-modi-vs-modi-in-godfrey-phillips-family-saga-2608095-2024-09-29",
      "headline": "Succession Wars: Bina Modi takes on sons in fight for Godfrey Phillips throneAs the legal showdown unfolds, it's Modi vs. Modi in a gripping battle that tests family bonds and determines the future of Godfrey Phillips India, highlighting ambition, legacy, and loyalty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/meet-alakh-pandey-young-entrepreneur-behind-physics-wallah-hurun-list-under-35-2607727-2024-09-28",
      "headline": "Meet Alakh Pandey, the young Edtech visionary behind Physics WallahFrom a humble tutor to a trailblazing entrepreneur, Alakh Pandey's journey with Physics Wallah shows how passion and perseverance can turn even the simplest beginnings into a $2.8 billion empire—reshaping education, one formula at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/akriti-chopra-zomato-co-founder-and-chief-people-officer-resigns-2607590-2024-09-27",
      "headline": "Akriti Chopra, Zomato co-founder and Chief People's Officer, resignsIn an email to Zomato CEO Deepinder Goyal, Akriti Chopra announced her decision to resign with immediate effect."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sjvn-share-price-gains-6-percent-mou-maharashtra-rs-48000-crore-2607462-2024-09-27",
      "headline": "Explained: Why SJVN shares gained over 6% todayThe stock rose 6.03% to Rs 133.60 on the Bombay Stock Exchange (BSE), with a market capitalisation of Rs 52,520 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-end-lower-after-hitting-record-highs-as-financial-stocks-fall-2607414-2024-09-27",
      "headline": "Sensex, Nifty end lower after hitting record highs as financial stocks fallThe S&P BSE Sensex ended 264.27 points lower at 85,571.85, while the NSE Nifty50 settled 37.10 points lower at 26,178.95."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/swiggy-ipo-draft-paper-drhp-sebi-rs-10000-crore-ofs-promoters-zomato-2607407-2024-09-27",
      "headline": "Swiggy files for Rs 10,000 crore IPO: Here's all you need to knowSwiggy's IPO will consist of two main parts: a fresh issue of equity shares worth Rs 3,750 crore, and an offer for sale (OFS) of 18.52 crore shares by existing stakeholders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-once-had-a-rs-10000-note-rbi-1938-know-why-it-was-discontinued-2607398-2024-09-27",
      "headline": "India once had a Rs 10,000 note. Know why it was discontinuedThe history of India's Rs 10,000 note dates back to the pre-independence era. In 1938, the Reserve Bank of India (RBI) issued its first Rs 10,000 note, the largest denomination ever printed in the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/multi-asset-funds-investment-benefits-tips-strategy-taxation-explained-2607331-2024-09-27",
      "headline": "What are multi-asset funds and are they good for your investment portfolio?Multi-asset funds are schemes that invest in a combination of three or more assets, such as equities, bonds, and gold."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/china-boosts-exports-solar-ev-will-it-hurt-india-other-global-markets-2607297-2024-09-27",
      "headline": "China boosts exports: Will it hurt India, other global markets?With a slowing domestic economy, China is looking to global markets to absorb its excess production. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/signature-global-real-estate-multibagger-surges-260-in-1-year-since-ipo-have-you-invested-2607293-2024-09-27",
      "headline": "Real estate multibagger stock soars 260% in 1 year since IPO. Have you invested?Since its debut on the stock exchanges on September 27, 2023, the stock has outperformed not only its peers but also the broader real estate market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/credit-card-spending-rising-defaults-debt-in-india-crisis-2607259-2024-09-27",
      "headline": "Swipe, spend, struggle: How credit card defaults are spiking in IndiaOnce a symbol of freedom, credit cards now trap young Indians in growing debt. Could defaults be the new norm?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/krn-heat-exchanger-ipo-check-latest-gmp-subscription-status-allotment-expected-listing-gain-2607230-2024-09-27",
      "headline": "KRN Heat Exchanger IPO: Check latest GMP, subscription status, other detailsKRN Heat Exchanger opened for subscription on September 25 looking to raise Rs 341.95 crore from its public issue, and has already seen bids of over 80 times. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-wipro-it-stocks-rally-4-percent-accenture-fy25-guidance-boost-2607196-2024-09-27",
      "headline": "Accenture guidance boost lifts Infosys, Wipro; IT stocks rally up to 4%Accenture not only exceeded market expectations for its Q4 results but also raised its revenue guidance for FY25 to a range of 3-6%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hurun-under-35-list-isha-akash-ambani-alakh-pandey-top-young-entrepreneurs-ghazal-alagh-2607171-2024-09-27",
      "headline": "Isha, Akash Ambani among top young entrepreneurs in Hurun's under-35 listThe Hurun list celebrates 150 entrepreneurs aged 35 or younger from across India, marking their achievements in fields ranging from retail to tech startups."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-hit-record-high-for-6th-straight-session-2607157-2024-09-27",
      "headline": "Sensex, Nifty hit record high for 6th straight sessionThe S&P BSE Sensex added 67.47 points to 85,903.59, while the NSE Nifty50 gained 14.70 points to 26,230.75. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/swiggy-files-for-ipo-aims-to-raise-about-rs-3750-crore-2607074-2024-09-26",
      "headline": "Swiggy files for IPO, aims to raise about Rs 3,750 croreSwiggy, backed by investment group Prosus and Japan's SoftBank, competes with Zomato in India's online restaurant and cafe food deliveries sector."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-stock-market-outlook-middle-east-conflict-dampen-dalal-street-rally-heres-what-experts-say-2606949-2024-09-26",
      "headline": "Will Middle East conflict dampen Dalal Street's rally? Here's what experts say Despite the uncertainty arising from the Middle East conflict, Indian stocks have surged, with benchmarks like the Sensex and Nifty showing strong gains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vedanta-shares-cross-rs-500-mark-after-gaining-5-more-gains-ahead-2606881-2024-09-26",
      "headline": "Vedanta shares cross Rs 500 mark after gaining 5%. More gains ahead?Vedanta's performance in 2024 has been impressive, with the stock climbing 95% so far this year and gaining 124.35% over the last 12 months. Over a five-year period, the stock has risen by 202%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-all-time-high-market-rally-metal-auto-stocks-2606880-2024-09-26",
      "headline": "Sensex, Nifty close at all-time high led by rally in auto and metal stocksThe S&P BSE Sensex added 666.25 points to end at 85,836.12, while the NSE Nifty50 gained 211.90 points to close at 26,216.05. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/hashem-safieddine-replace-hassan-nasarullah-hezbollah-chief-israel-lebanon-conflict-2608178-2024-09-29",
      "headline": "Hashem Safieddine to replace Hassan Nasrallah as Hezbollah chief Hashem Safieddine will replace Hassan Nasrallah as Hezbollah chief after latter's death. Nasrallah was killed on Saturday in Israel's airstrikes on Lebanon's capital Beirut. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/ground-report-hundreds-huddle-beirut-streets-beaches-amid-israeli-airstrike-hezbollah-leader-killed-sayyed-hassan-nasrallah-2608185-2024-09-29",
      "headline": "Ground Report: Hundreds huddle on Beirut's streets, beaches amid Israeli strikesHundreds of Beirut residents fled to streets and makeshift shelters after Israeli airstrikes hit Hezbollah strongholds, leaving buildings in rubble and families camped out in fear. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistan-cross-border-terrorism-policy-s-jaishankar-at-un-general-assembly-shehbaz-sharif-2608075-2024-09-28",
      "headline": "S Jaishankar's 'karma' jibe at Pak: Its GDP measured in terms of radicalisationPakistani Prime Minister Shehbaz Sharif, in his speech to the UNGA on Friday, compared the situation in Jammu and Kashmir to that of Palestine, saying the people had \"struggled for a century for their freedom and right to self-determination\". "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/59-killed-nepal-heavy-rain-floods-search-operations-on-for-44-missing-2608114-2024-09-29",
      "headline": "112 killed in Nepal due to heavy rain, floods, 68 missingLarge swathes of Nepal have been inundated since Friday, prompting disaster authorities to warn of flash floods in multiple rivers. Rivers around the capital Kathmandu burst their banks, inundating nearby houses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/indians-chronically-overworked-what-is-solution-to-prevent-burnout-big-fours-unemployment-anna-sebastian-periyal-2607329-2024-09-29",
      "headline": "Indians chronically overworked. How to avoid burnout, save yourselfProfessionals in India are among the world's most overworked people. Some sectors are worse than others and people reveal why they find it difficult to switch off after work hours. Health experts tell us how to identify signs of burnout, prevent getting overworked and not getting killed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-uncapped-player-retention-rule-ms-dhoni-all-teams-aakash-chopra-2608167-2024-09-29",
      "headline": "MS Dhoni as uncapped player? IPL's revived rule will not just benefit CSKIPL 2025: MS Dhoni fans were overjoyed after the BCCI brought back the 'uncapped player' rule for retentions ahead of the mega auction. Former India opener Aakash Chopra highlighted that the rule will not just benefit CSK and the former India captain. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/succession-wars-modi-vs-modi-in-godfrey-phillips-family-saga-2608095-2024-09-29",
      "headline": "Succession Wars: Bina Modi takes on sons in fight for Godfrey Phillips throneAs the legal showdown unfolds, it's Modi vs. Modi in a gripping battle that tests family bonds and determines the future of Godfrey Phillips India, highlighting ambition, legacy, and loyalty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-un-security-council-meeting-avenge-hezbollah-leader-hassan-nasrallah-killing-2608123-2024-09-29",
      "headline": "Iran vows to avenge Nasrallah's death, calls for Security Council meeting Live UpdatesIn the past 24 hours, fresh Israeli strikes in Lebanon killed 33 people and injured 195 others, the Lebanese health ministry said. Over 1,000 people have been killed in Israeli attacks since two weeks, while around 6,000 have been injured. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/why-are-men-more-prone-to-heart-disease-than-women-2608148-2024-09-29",
      "headline": "Why men are more prone to heart disease than womenMen are more susceptible to heart disease than women due to various factors. The WHO reports that cardiovascular diseases cause nearly 17.9 million deaths each year, with men being more frequently affected at younger ages."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jammu-and-kashmir-congress-priyanka-gandhi-chopper-sabotage-kathua-billawar-2608116-2024-09-29",
      "headline": "Priyanka Gandhi's chopper fails to land in J&K, Congress calls it 'sabotage'The Congress accused the Jammu and Kashmir administration of sabotaging the party's campaign through its alleged failure in helping Priyanka Gandhi Vadra's chopper to land in Kathua district's Billawar constituency."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tamil-nadu-mk-stalin-udhayanidhi-deputy-chief-minister-dmk-oath-taking-dynastic-politics-2608080-2024-09-29",
      "headline": "Another 'son rise' in Tamil Nadu as Udhayanidhi promoted as MK Stalin's deputyAfter being delayed by controversies, elections, and other recent crises, Tamil Nadu Sports Minister Udhayanidhi Stalin, son of Chief Minister MK Stalin, is set to become the state's new Deputy Chief Minister on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-claims-to-kill-another-top-hezbollah-leader-hassan-khalil-yassin-in-beirut-strike-after-hassan-nasrallah-2608150-2024-09-29",
      "headline": "Israel claims to kill another top Hezbollah leader after Hassan NasrallahThe Israeli military claimed that Hassan Khalil Yassin worked closely with Hezbollah's missile and drone units. He was planning to carry out attacks in Israel in the coming days, the military claimed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/delhi-man-says-work-from-home-with-parents-is-like-playing-squid-game-viral-x-post-2608169-2024-09-29",
      "headline": "Delhi man's take on work from home with parents divides Internet. See postA Delhi man shared his perspective on working from home (WFH) while living with his parents. He said it was like playing 'Squid Game'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/crew-9-mission-to-return-sunita-williams-from-space-launched-2608071-2024-09-28",
      "headline": "Crew-9 mission to return Sunita Williams from space launchedThis flight features only two crew members instead of the usual four, as the remaining seats are reserved for Williams and Wilmore's return journey."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/delhi-police-constable-crushed-to-death-by-liquor-supplier-car-2608151-2024-09-29",
      "headline": "Delhi Police constable dies after car rams bike, dragged for 10 metres on roadThe incident occurred around 3 am, when the victim signalled the car to stop. The driver did not comply and hit the constable, resulting in his death."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/iifa-2024-winners-list-shah-rukh-khan-rani-mukerji-sandeep-reddy-vanga-animal-2608152-2024-09-29",
      "headline": "IIFA 2024 winners: SRK, Rani Mukerji crowned Best Actors, Animal takes Best FilmShah Rukh Khan and Rani Mukerji took the top honours at IIFA 2024. Sandeep Reddy Vanga's Animal also won several awards, including Best Film. Here's a full list of winners. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-entertainment-sports-business-politics-423-27-09-2024",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/us-elections-donald-trump-touts-elon-musk-to-be-heading-a-government-department-of-efficiency-if-elected-2608079-2024-09-29",
      "headline": "Trump touts possibility of Elon Musk heading 'department of efficiency'US Vice President Kamala Harris and her Republican rival Donald Trump will soon be heading to settle the electoral competition, with both making promises to give something different to the public. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/hezbollah-chief-hassan-nasrallah-killing-lebanon-gaza-israel-mehbooba-mufti-election-campaign-2608056-2024-09-28",
      "headline": "Hezbollah chief's killing sparks protest in J&K, Mehbooba Mufti calls him martyrMehbooba Mufti announced that her party's campaign for the Jammu and Kashmir Assembly election will be called off on Sunday in solidarity with the people of Palestine and Lebanon, particularly in response to the killing of Hezbollah chief. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/food/story/is-flavoured-yogurt-good-for-health-2607320-2024-09-29",
      "headline": "Is flavoured yoghurt good for health?If you relish flavoured yoghurts thinking they are healthy, you might want to negotiate your choices again!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-settled-score-by-killing-hezbollah-chief-says-benjamin-netanyahu-2608085-2024-09-29",
      "headline": "Death of Hezbollah's Nasrallah historic turning point, settles score: NetanyahuIn his first public statement since Israel killed Nasrallah, Netanyahu said that Israel has \"settled the account\" with a \"mass murderer\" responsible for the killings of several Israelis and many American and French citizens, The Times of Israel reported."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tamil-nadu-virudhunagar-firecracker-factory-blast-diwali-stocks-2608067-2024-09-29",
      "headline": "Massive fire at Tamil Nadu firecracker unit, huge Diwali stock goes up in flamesExplosions at the firecracker factory in Tamil Nadu's Virudhunagar continued for over two hours due to the extensive stockpile."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/netherlands-dutch-leader-geerth-wilders-iran-supreme-leader-kamenei-israel-attack-hezbollah-nasrallah-killed-bunker-zionist-2608093-2024-09-29",
      "headline": "Dutch leader's 'find a bunker' jab at Iran's Khamenei after Nasrallah's deathIn response to Khamenei's social media post, Geert Wilders said, \"Well, maybe you'd better look for a good bunker @khamenei_ir.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/devara-box-office-day-jr-ntr-saif-ali-khan-film-beyond-rs-200-crore-mark-globally-stree-2-kalki-2608204-2024-09-29",
      "headline": "Devara box office Day 2: Jr NTR's film surges beyond Rs 200 crore mark globallyDevara Part 1, directed by Koratala Siva and starring Jr. NTR, was released worldwide on September 27. Though it received mixed reviews, the film earned Rs 120 crore in India and Rs 243 crore globally. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rekha-iifa-2024-performance-dance-piya-tose-pardesiya-watch-videos-2608182-2024-09-29",
      "headline": "'Ever glowing' Rekha dazzles at IIFA 2024, dances to Piya Tose, Pardesiya. WatchVeteran Bollywood actor Rekha mesmerised audiences at IIFA 2024 with a stunning dance performance on classics like Piya Tose Naina Laage Re and Pardesiya."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/diljit-dosanjh-mother-breaks-down-as-he-introduces-her-for-the-first-time-watch-video-2608157-2024-09-29",
      "headline": "Watch: Diljit Dosanjh's mother breaks down as he introduces her for the first timeA video of Diljit Dosanjh introducing his mother and sister for the first time at his Manchester concert is being widely shared on the internet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/iifa-2024-winners-list-shah-rukh-khan-rani-mukerji-sandeep-reddy-vanga-animal-2608152-2024-09-29",
      "headline": "IIFA 2024 winners: SRK, Rani Mukerji crowned Best Actors, Animal takes Best FilmShah Rukh Khan and Rani Mukerji took the top honours at IIFA 2024. Sandeep Reddy Vanga's Animal also won several awards, including Best Film. Here's a full list of winners. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-t20i-series-mayank-yadav-selection-gautam-gambhir-2608203-2024-09-29",
      "headline": "IND vs BAN: Mayank Yadav selection shows India's focus on format specialistsMayank Yadav was amongst some of the big call-ups by India for the upcoming T20I series against Bangladesh. The selection of the pacer shows India's new-found focus on using format specialists. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-uncapped-player-retention-rule-ms-dhoni-all-teams-aakash-chopra-2608167-2024-09-29",
      "headline": "MS Dhoni as uncapped player? IPL's revived rule will not just benefit CSKIPL 2025: MS Dhoni fans were overjoyed after the BCCI brought back the 'uncapped player' rule for retentions ahead of the mega auction. Former India opener Aakash Chopra highlighted that the rule will not just benefit CSK and the former India captain. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/laliga-barcelona-boss-hansi-flick-takes-blame-for-osasuna-loss-2608154-2024-09-29",
      "headline": "Barcelona boss Hansi Flick takes blame for Osasuna loss: It's my responsibilityBarcelona boss Hansi Flick has taken the blame for the 4-2 loss against Osasuna on Saturday, September 28. Barcelona decided to rotate their team a lot for the game against Osasuna. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-liverpool-go-top-with-wolves-win-arsenal-survive-leicester-scare-2608143-2024-09-29",
      "headline": "Premier League: Liverpool go top with Wolves win, Arsenal survive Leicester scareLiverpool went to the top of the Premier League points table, while Arsenal were able to survive a scare at the Emirates stadium against Leicester City on Saturday, September 28. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-retention-rule-uncapped-player-ms-dhoni-chennai-super-kings-memes-viral-2608137-2024-09-29",
      "headline": "IPL Retention: MS Dhoni memes viral after BCCI reintroduces uncapped player ruleIPL 2025 Retention: The Indian cricket board reintroduced the uncapped player rule which enables a team to retain an Indian player who has not played international cricket in the last five calendar years for a reported sum of Rs 4 crore. The rule is likely to enable Chennai Super Kings retain MS Dhoni at a cost that would still enable them to go for big-money buys in the mega auction. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-dog-stops-play-as-hilarious-scenes-unfold-during-durham-vs-kent-match-2608127-2024-09-29",
      "headline": "Watch: 'Dog stops play' as hilarious scenes unfold during Durham vs Kent matchThe county championship match between Kent and Durham had an unexpected pitch invasion by a dog, which hilariously stopped action for a few moments on Saturday, September 28. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/laliga-barcelonas-perfect-start-ended-after-4-2-osasuna-thrashing-2608115-2024-09-29",
      "headline": "LaLiga: Barcelona's perfect start ended after 4-2 Osasuna thrashingBarcelona's perfect start to the LaLiga season came to a screeching halt as Osasuna thrashed them 4-2 on Saturday, September 28. Hansi Flick's idea to rotate his side backfired as Osasuna moved to 6th in the points table. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-player-regulations-ipl-player-retention-rules-ipl-2025-auction-rules-2608084-2024-09-29",
      "headline": "IPL announces landmark retention and auction rules for 2025 season: ExplainedThe Indian Premier League Governing Council announced the Player regulations for the 2025 season as several landmark decisions were taken for the next three editions of the T20 extravaganza."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-csk-ipl-2025-retention-rules-uncapped-players-rule-2608083-2024-09-29",
      "headline": "MS Dhoni to continue playing for CSK? IPL brings back uncapped player rule for 2025The IPL governing council re-introduced the uncapped player rule for the IPL 2025 which could pave the path for Dhoni's return in the next season of the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-dog-stops-play-as-hilarious-scenes-unfold-during-durham-vs-kent-match-2608127-2024-09-29",
      "headline": "Watch: 'Dog stops play' as hilarious scenes unfold during Durham vs Kent matchThe county championship match between Kent and Durham had an unexpected pitch invasion by a dog, which hilariously stopped action for a few moments on Saturday, September 28. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/laliga-barcelonas-perfect-start-ended-after-4-2-osasuna-thrashing-2608115-2024-09-29",
      "headline": "LaLiga: Barcelona's perfect start ended after 4-2 Osasuna thrashingBarcelona's perfect start to the LaLiga season came to a screeching halt as Osasuna thrashed them 4-2 on Saturday, September 28. Hansi Flick's idea to rotate his side backfired as Osasuna moved to 6th in the points table. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-player-regulations-ipl-player-retention-rules-ipl-2025-auction-rules-2608084-2024-09-29",
      "headline": "IPL announces landmark retention and auction rules for 2025 season: ExplainedThe Indian Premier League Governing Council announced the Player regulations for the 2025 season as several landmark decisions were taken for the next three editions of the T20 extravaganza."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-csk-ipl-2025-retention-rules-uncapped-players-rule-2608083-2024-09-29",
      "headline": "MS Dhoni to continue playing for CSK? IPL brings back uncapped player rule for 2025The IPL governing council re-introduced the uncapped player rule for the IPL 2025 which could pave the path for Dhoni's return in the next season of the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rules-bcci-to-ban-players-for-pulling-out-after-auction-deal-2608073-2024-09-28",
      "headline": "IPL 2025 rules: BCCI to ban players for pulling out after auction dealThe BCCI and the IPL governing council will ban the players for pulling out of the league after the auction deal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pace-king-mayank-yadav-earns-maiden-india-call-up-after-overcoming-injury-woes-2608066-2024-09-28",
      "headline": "Pace King Mayank Yadav earns maiden India call-up after overcoming injury woesThe newest fast bowling sensation, Mayank Yadav, earned his maiden India call-up, overcoming injury concerns. He is part of India's 15-member squad vs Bangladesh for the 3-match T20I series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-ban-t20is-mayank-yadav-varun-chakravarthy-suryakumar-yadav-2608061-2024-09-28",
      "headline": "Varun Chakravarthy returns, Mayank Yadav called up as India announce T20I squadThe BCCI announced the squad for the upcoming three-match T20I series against Bangladesh set to begin from October 6. Mayank Yadav has earned his maiden India call up while Varun Chakravarthy has returned to the side after three years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-retention-rules-rtm-card-2608045-2024-09-28",
      "headline": "IPL 2025 retention rules: 6 retentions and RTM with total purse of Rs 120 croreThe Indian Premier League (IPL) Governing Council announced retention rules for the ten franchises ahead of the mega auction for the upcoming season. All teams have been allowed to retain six players and will also be given Right to Match cards."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jofra-archer-eyeing-test-return-after-a-brilliant-comeback-in-odis-for-england-2608044-2024-09-28",
      "headline": "Jofra Archer eyeing Test return after a brilliant comeback in ODIs for EnglandJofra Archer is using his impressive white-ball performances to build his fitness and aims for a Test comeback but is not rushing it. With England managing his return carefully, Archer is focusing on taking it \"series by series\" for now."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jay-shah-announces-additional-match-fee-for-players-ahead-of-ipl-2025-2608029-2024-09-28",
      "headline": "IPL players to get richer, BCCI announces Rs 7.5 lakh match fee from 2025 seasonThe BCCI introduced a match fee of Rs 7.5 lakh for players ahead of IPL 2025. The players who will play all the games in the league will get an additional Rs 1.05 crore alongside their contract amount. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanjay-manjrekar-ravindra-jadeja-rohit-sharma-alastair-cook-2608026-2024-09-28",
      "headline": "Sanjay Manjrekar draws Rohit Sharma's attention to Jadeja's incredible recordFormer India cricketer Sanjay Manjrekar brought Ravindra Jadeja's incredible record against left-handers to the attention of the Indian captain Rohit Sharma."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-newcastle-united-vs-manchester-city-draw-josko-gvardiol-anthony-gordon-2608024-2024-09-28",
      "headline": "Manchester City held to a gruelling 1-1 draw by Newcastle UnitedReigning champions Manchester City were held to a second consecutive draw in a feisty 1-1 clash against Newcastle United. Despite Josko Gvardiol's opener, Anthony Gordon's equaliser earned Newcastle a crucial point at St. James' Park."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jofra-archer-eyeing-test-return-after-a-brilliant-comeback-in-odis-for-england-2608044-2024-09-28",
      "headline": "Jofra Archer eyeing Test return after a brilliant comeback in ODIs for EnglandJofra Archer is using his impressive white-ball performances to build his fitness and aims for a Test comeback but is not rushing it. With England managing his return carefully, Archer is focusing on taking it \"series by series\" for now."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jay-shah-announces-additional-match-fee-for-players-ahead-of-ipl-2025-2608029-2024-09-28",
      "headline": "IPL players to get richer, BCCI announces Rs 7.5 lakh match fee from 2025 seasonThe BCCI introduced a match fee of Rs 7.5 lakh for players ahead of IPL 2025. The players who will play all the games in the league will get an additional Rs 1.05 crore alongside their contract amount. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanjay-manjrekar-ravindra-jadeja-rohit-sharma-alastair-cook-2608026-2024-09-28",
      "headline": "Sanjay Manjrekar draws Rohit Sharma's attention to Jadeja's incredible recordFormer India cricketer Sanjay Manjrekar brought Ravindra Jadeja's incredible record against left-handers to the attention of the Indian captain Rohit Sharma."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-newcastle-united-vs-manchester-city-draw-josko-gvardiol-anthony-gordon-2608024-2024-09-28",
      "headline": "Manchester City held to a gruelling 1-1 draw by Newcastle UnitedReigning champions Manchester City were held to a second consecutive draw in a feisty 1-1 clash against Newcastle United. Despite Josko Gvardiol's opener, Anthony Gordon's equaliser earned Newcastle a crucial point at St. James' Park."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pooran-thanks-dwayne-bravo-for-taking-chance-on-17-year-old-in-heartfelt-post-2608022-2024-09-28",
      "headline": "Pooran thanks Dwayne Bravo for 'taking chance on 17-year-old' in heartfelt postNicholas Pooran shared a heartfelt tribute to Dwayne Bravo on Instagram after the legendary all-rounder retired from cricket. Bravo, the highest wicket-taker in T20 history, ended his 21-year career following an injury during the 2024 Caribbean Premier League."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-united-vs-tottenham-hotspur-old-trafford-erik-ten-hag-2608020-2024-09-28",
      "headline": "Manchester United face Tottenham test at home: All you need to know'Erik ten Hag's Manchester United face a crucial test against Tottenham Hotspur, with pressure mounting after a poor start to the season. A win at Old Trafford could reignite their campaign and restore faith in the Dutch manager."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kane-williamson-virat-kohli-sl-vs-nz-galle-prabath-jayasuriya-2608017-2024-09-28",
      "headline": "Kane Williamson surpasses Virat Kohli in major list on Day 3 of 2nd Test vs SLStar New Zealand batter Kane Williamson left Virat Kohli behind in the list of leading run scorers in Test cricket during his 46-run knock against Sri Lanka on Day 3 of the second Test at Galle."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/parthiv-reveals-reason-behind-hardik-bowling-with-red-ball-amid-test-return-rumors-2608002-2024-09-28",
      "headline": "Parthiv reveals reason behind Hardik bowling with red ball amid Test return rumoursParthiv Patel opened up about Hardik Pandya bowling with a red ball and revealed that he opted for the red cherry as the white ball wasn't available for practice. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}