{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/companies/story/gig-economy-debate-zomato-blinkit-eternal-deepinder-goyal-2845626-2026-01-02",
      "headline": "Ban gig work and you don't solve inequality: Eternal CEO Deepinder GoyalEternal founder Deepinder Goyal argued that the gig economy debate is less about wages and more about discomfort with inequality, warning that bans and over-regulation could erase livelihoods instead of fixing systemic gaps."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-573-points-higher-nifty-hits-fresh-high-ntpc-up-5-percent-2845552-2026-01-02",
      "headline": "Sensex closes 573 points higher, Nifty hits fresh high; NTPC up 5%The S&P BSE Sensex added 573.41 points to close at 85,762.01, while the Nifty50 jumped 182 points to end at 26,328.55​​​​​​​. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cigarette-prices-to-rise-from-february-1-new-tax-calculation-explained-brand-name-cost-cess-2845490-2026-01-02",
      "headline": "Cigarettes to cost more from February 1. Here's how new rates will be decidedThe new levies on tobacco and pan masala will be imposed over and above the applicable GST rates. These measures will replace the GST compensation cess, which is currently charged at varying rates on sin products."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/revised-itr-filing-window-closed-tax-refund-eligiblity-2845428-2026-01-02",
      "headline": "Missed the revised ITR filing deadline? Know what happens to tax refundIn most cases, refunds are issued within a few weeks to a few months. Delays may occur due to mismatches in TDS details, bank account validation issues, or cases selected for scrutiny."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/itc-share-price-update-brokerage-targets-views-buy-sell-hold-2845403-2026-01-02",
      "headline": "ITC shares tumble 4%, down 13% in 2 days: Buy the dip or stay away?The sharp sell-off comes after the finance ministry revised the taxation structure for cigarettes, effective February 1, 2026. Here is all you need to know. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/mcx-share-price-crash-explained-stock-split-ex-split-adjustment-2845396-2026-01-02",
      "headline": "MCX shares crash 80% in early deals, but the fall is not what it seemsMCX shares fell by more than 80% on trading screens on Friday, hitting an intraday low of Rs 2,192 on the BSE. This was compared with Thursday's closing price of Rs 10,988.60. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/devyani-international-share-price-sapphire-foods-merger-shares-in-focus-kfc-pizza-hut-india-2845368-2026-01-02",
      "headline": "Devyani International and Sapphire Foods India shares in focus. Here's whyDevyani International shares were trading at Rs 152.80, up Rs 5.37 or 3.64% during the morning session as of 9:39 am. In contrast, Sapphire Foods India shares were trading lower at Rs 253.95, down Rs 8.75 or 3.33%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-nifty-auto-shares-rise-fmcg-itc-godfrey-phillips-2845357-2026-01-02",
      "headline": "Sensex, Nifty open higher driven by auto, metal stocks as FMCG continues to fallThe S&P BSE Sensex was up 172.34 points to 85,360.94, while the NSE Nifty50 rose 44.10 points to 26,190.65 as of 9:26 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-silver-price-today-precious-metals-start-2026-after-record-2025-gains-2845353-2026-01-02",
      "headline": "Gold, silver price today: How have precious metals started 2026?Gold and silver prices moved higher on Friday, recovering part of the losses seen late last week, even as investors looked back at the historic gains these metals delivered through 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-founder-10-minute-delivery-unsafe-gig-workers-explained-deepinder-goyal-2845337-2026-01-02",
      "headline": "Is 10-minute delivery really unsafe? Zomato CEO answers after gig workers strikeWhile delivery services on platforms such as Zomato and Blinkit were largely unaffected on New Year's Eve, questions around whether 10-minute delivery models put pressure on riders gained traction on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/deepinder-goyal-defends-gig-economy-as-zomato-blinkit-unaffected-by-gig-workers-strike-2845287-2026-01-01",
      "headline": "If system was unfair...: Deepinder Goyal as Zomato unaffected by gig workers' strikeZomato and its quick-commerce arm Blinkit recorded their highest-ever single-day orders on New Year's Eve, delivering over 75 lakh orders despite a nationwide gig workers' strike. Founder and CEO Deepinder Goyal said such scale shows a system seen as unfair cannot consistently attract or retain workers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/special-report-indias-economy-faces-trump-tariffs-and-trade-impasse-entering-2026-ytvd-2845174-2026-01-01",
      "headline": "Special Report: India's Economy Faces Trump Tariffs and Trade Impasse Entering 2026In this Special Report, an unidentified speaker analyses the state of the Indian economy as the nation steps into 2026. While highlighting a 'stupendous 2025' marked by major reforms like GST simplification and the Jan Vishwas Bill, the report warns that India enters the new year 'playing on a strong economic pitch, but also on a sticky wicket'. Key challenges identified include the ongoing trade impasse with the US, punitive 'Trump tariffs' of 50%, and a depreciating rupee which breached the 91 mark against the dollar. The programme notes that while GDP growth remains robust at 8%, high food inflation and sluggish job creation persist. With five state elections due in 2026, the report also flags concerns over rising state debts due to populist spending, even as all eyes turn to the upcoming Union Budget in February to restore confidence and boost private investment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/commercial-lpg-cylinder-prices-hiked-new-year-domestic-lpg-rates-no-change-oil-companies-atf-2845096-2026-01-01",
      "headline": "Commercial LPG cylinder price hiked by Rs 111 on New Year, highest since June 2025On New Year's Day, the price of a 19-kg commercial LPG cylinder was increased by Rs 111 — the steepest hike in six months, — with effect from today. The price of a 14.2-kg domestic LPG cylinder, however, remains unchanged."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-end-lower-itc-godfrey-phillips-crash-tobacco-cess-move-2845086-2026-01-01",
      "headline": "Sensex, Nifty end lower as ITC, Godfrey Phillipss crash on tobacco cess moveThe S&P BSE Sensex fell 32 points to close at 85,188.60, while the NSE Nifty50 was up by 16.95 points to end at 26,146.55. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/silver-gold-stocks-real-estate-best-investment-2026-money-compound-wealth-creation-2845060-2026-01-01",
      "headline": "Silver vs gold vs stock vs real estate: What can deliver most gains in 2026Should it be gold, which has just seen its strongest year since 1979? Or silver, which has surged over 150%, marking one of its best-ever annual performances?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/centre-draft-rules-four-labour-codes-wages-working-hours-women-workers-feedback-45-days-2844974-2026-01-01",
      "headline": "Inside draft labour code rules. What the fine print says on wages, working hoursThe draft Rules relate to the Code on Wages, the Code on Social Security, the Industrial Relations Code and the Code on Occupational Safety, Health and Working Conditions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/itc-godfrey-phillips-shares-fall-tobacco-stocks-down-excise-duty-health-national-security-cess-2026-2844941-2026-01-01",
      "headline": "ITC, Godfrey Phillips shares tank up to 16%: Why are tobacco shares falling todayShares of Godfrey Phillips India Ltd fell sharply in early trade, sliding nearly 16%. Shares of ITC Ltd also came under pressure, falling around 9% during early trade. The stock slipped to about Rs 362.70, touching its 52-week low."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-openinh-bell-sensex-opens-180-points-higher-nifty-abover-26150-itc-down-2-percent-2844928-2026-01-01",
      "headline": "Sensex opens 180 points higher, Nifty above 26,150; ITC down 2%The S&P BSE Sensex was up 104.21 points to 85,324.81, while the NSE Nifty50 gained 28.60 points to 26,158.20 as of 9:25 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/is-stock-market-open-today-bse-mcx-holiday-new-year-2026-commodity-nse-list-holidays-2844921-2026-01-01",
      "headline": "Stock market holiday today? Check if NSE and BSE are closed for New Year 2026Major international stock markets across China, Hong Kong, Japan, Singapore, France, Germany, the UAE, the UK and the US are closed on New Year's Day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/centre-tobacco-pan-masala-tax-hike-2026-excise-cess-replacement-glbs-2844873-2026-01-01",
      "headline": "Extra excise duty on tobacco products, cess on pan masala to take effect February 1The new levies on tobacco and pan masala will be imposed over and above the applicable GST rates. These measures will replace the GST compensation cess, which is currently charged at varying rates on sin products."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/chatha-pacha-locks-january-22-release-poster-hints-at-mammootty-connection-2845749-2026-01-02",
      "headline": "Chatha Pacha locks January 22 release, poster hints at Mammootty connection The wrestling-based Malayalam action entertainer has locked its theatrical release date, with a new poster subtly hinting at a possible Mammootty association."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/border-2-launch-longewala-sunny-deol-patriotic-dharmendra-haqeeqat-2845817-2026-01-02",
      "headline": "Sunny Deol shares story of father Dharmendra inspiring him to do Border. Video Sunny Deol shared personal insights at the launch of Ghar Kab Aaoge from Border 2, detailing how his father's film Haqeeqat influenced his career and the making of the Border series. The event, held at Longewala–Tanot, featured emotional moments and tributes to the military."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sunny-deol-emotional-border-2-song-launch-bsf-jawans-jaisalmer-2845800-2026-01-02",
      "headline": "Mera dimaag thoda hila hua hai: Emotional Sunny Deol at Border 2 song launch At the unveiling of Ghar Kab Aaoge from Border 2, Sunny Deol expresses strong emotions alongside the armed forces at Longewala–Tanot sector, with the event highlighting respect and remembrance for his legacy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ghar-kab-aaoge-launch-longewala-border-2-sunny-deol-ahan-shetty-touches-feet-2845789-2026-01-02",
      "headline": "Ahan Shetty touches Sunny Deol's feet at Border 2 song launch. Watch video The launch of the song 'Ghar Kab Aaoge' from the film Border 2 took place at the historic Longewala–Tanot landscape in Jaisalmer, bringing together armed forces personnel and the film's cast and crew in a show of respect and national pride."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/border-2-ghar-kab-aaoge-song-launch-sunny-deol-varun-dhawan-diljit-dosanjh-ahan-shetty-2845778-2026-01-02",
      "headline": "Border 2: Sunny Deol reignites patriotic nostalgia in Ghar Kab Aaoge Border 2 makers unveiled the reimagined song Ghar Kab Aaoge in Jaisalmer. The soulful tribute honours Indian soldiers while connecting legacy with modern voices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/nicole-kidman-looks-forward-in-post-ringing-in-2026-amid-divorce-with-keith-urban-2845684-2026-01-02",
      "headline": "Nicole Kidman looks forward in post ringing in 2026 amid divorce with Keith Urban Nicole Kidman shared a message about \"looking forward\", while ringing in 2026 with her daughters. She recently separated from Keith Urban after 20 years of marriage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shark-tank-india-season-5-returns-new-judges-startups-2845734-2026-01-02",
      "headline": "Shark Tank India Season 5: Full judges list, new faces and returns The fifth season of Shark Tank India launches on January 5, 2026, introducing a refreshed panel of judges comprising both established entrepreneurs and new faces from diverse sectors."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/battle-of-galwan-leak-viral-salman-khan-war-clip-turns-out-to-be-ai-2845703-2026-01-02",
      "headline": "Battle of Galwan leak? Viral Salman Khan war clip turns out to be AI Amid heightened anticipation of Battle of Galwan, a video claiming to be a scene from the Salman Khan starrer has gone viral. However, here's the catch. The video is not real."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/stranger-things-cast-share-behind-the-scenes-moments-series-finale-netflix-2845680-2026-01-02",
      "headline": "Stranger Things' Karen Wheeler welcomes 2026 with bestie Vecna Actress Cara Buono shared a light-hearted photograph with co-star Jamie Campbell Bower, dressed as Vecna, to welcome 2026 and offer fans a look behind the scenes after the release of the Stranger Things finale on Netflix."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/mtv-india-shuts-down-end-of-traditional-music-tv-youth-culture-2845665-2026-01-02",
      "headline": "MTV shutting down feels personal, 90s kids are heartbroken MTV India is shutting down after shaping youth culture for decades. This marks the end of an era as digital platforms replace traditional music television."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/duffer-brothers-reveal-stranger-things-spin-off-will-feature-new-town-and-mythology-2845619-2026-01-02",
      "headline": "Duffer Brothers reveal Stranger Things spin-off will feature new town and mythology The Duffer Brothers revealed they are actively developing a 'Stranger Things' spin-off, promising a \"completely different mythology\" set in a new town with fresh characters. 'Stranger Things' is available for streaming on Netflix."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/prime-video-zee5-jiohotstar-follow-my-voice-love-beyond-wicket-and-more-2845616-2026-01-02",
      "headline": "Prime Video, ZEE5, JioHotstar: Follow my voice, Love beyond wicket and more OTT platforms, including Prime Video, Zee5, and JioHotstar, have launched a fresh lineup of original titles on the first weekend of 2026. These include Spanish, Telugu, and Tamil dramas. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhurandhar-declared-tax-free-ladakh-box-office-success-2845642-2026-01-02",
      "headline": "Ranveer Singh, Akshaye Khanna's Dhurandhar gets tax-free status in Ladakh The Union Territory of Ladakh has made the espionage thriller Dhurandhar tax-free after the film's impressive box office run and strong audience response in India and abroad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/how-south-korean-dating-shows-turned-restraint-into-romance-2844013-2026-01-02",
      "headline": "How South Korean dating shows turned restraint into romance From Single's Inferno to Transit Love, South Korean dating shows favour restraint over chaos. Here's why their slow-burn romance has become a global obsession."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/band-baaja-baaraat-re-release-pvr-inox-ranveer-singh-anushka-sharma-2845583-2026-01-02",
      "headline": "Ranveer-Anushka's Band Baaja Baaraat returns to cinemas soon. Check out the date Ranveer Singh and Anushka Sharma's romantic drama 'Band Baaja Baaraat' is set to re-release in theatres on January 16. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/four-more-shots-please-actors-prefer-agency-over-intimacy-coordinators-rangita-nandy-2845547-2026-01-02",
      "headline": "Four More Shots Please creator: Actors don't always want intimacy coordinators now Rangita Pritish Nandy discusses the evolving role of intimacy coordinators in Four More Shots Please. The show highlights actors' growing preference for personal agency and safe storytelling."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/netflix-this-week-stranger-things-finale-haq-my-korean-boyfriend-and-more-2845567-2026-01-02",
      "headline": "Netflix this week: Stranger Things finale, Haq, My Korean Boyfriend and more The much-anticipated Stranger Things finale and the courtroom drama Haq, lead Netflix's lineup for the first weekend of January 2026. Additional offerings include the international docu-reality series My Korean Boyfriend."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ap-dhillon-celebrates-new-year-with-bsf-jawans-at-longewala-post-see-post-2845528-2026-01-02",
      "headline": "AP Dhillon celebrates New Year with BSF jawans at Longewala post. See post AP Dhillon spent the first day of 2026 at Longewala Post, Rajasthan, meeting Border Security Force soldiers. During his meeting, the singer learnt about their experiences, and and expressed gratitude for their service."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/abhishek-malhan-denies-romance-rumours-jiyaa-shankar-bigg-boss-ott-2-2845533-2026-01-02",
      "headline": "After Jiyaa Shankar, Abhishek Malhan shuts romance rumours, seeks privacy Abhishek Malhan has addressed growing speculation about his relationship with 'Bigg Boss OTT 2' co-contestant Jiyaa Shankar. He clarified his position and urged people to refrain from linking his name with anyone."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/iran-mocks-us-president-donald-trump-after-locked-and-loaded-threat-we-know-us-rescue-record-well-2845728-2026-01-02",
      "headline": "Iran mocks Trump after 'locked and loaded' threat: We know US rescue record wellAli Shamkhani was referring to the US Army's rapid exit from Afghanistan in 2021 after maintaining a stronghold there for two decades, leaving behind one million weapons and military equipment - mostly funded by Washington DC- to the Taliban."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-arrests-north-carolina-man-over-alleged-isis-terror-plot-on-new-years-eve-2845835-2026-01-02",
      "headline": "US arrests 18-year-old North Carolina man over alleged IS New Year's Eve plotProsecutors allege the accused planned to stab up to 20 civilians on New Year's Eve, targeting public locations and preparing to attack police in an IS-inspired plot."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/iran-protests-live-updates-anti-ayatollah-khamenei-economy-crisis-currency-collapse-trump-shia-qom-2845443-2026-01-02",
      "headline": "Live: Anti-Khamenei chants at funerals, unrest spreads to 50 cities on 6th dayAnti-Khamenei Protests live updates: At the funerals of protesters who died in security forces' crackdown, chants of \"Death to Khamenei\" and \"Shah will return\" echo as unrest across Iran enters sixth day. Protests over the deteriorating economy turned violent across at least 50 cities, including the Shia clerical stronghold of Qom. At least six people were killed amid clashes with the regime's security forces. US President Donald Trump warned Iran against targeting demonstrators."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/raihan-vadra-aviva-baig-engagement-rajasthan-private-family-ceremony-2845836-2026-01-03",
      "headline": "Best friends since 3: Priyanka Gandhi's post for son Raihan, his fiancee Aviva BaigAhead of their engagement later this month, Congress MP Priyanka Gandhi Vadra wrote a heartfelt post for son Raihan Vadra and his fiancee Aviva Baig, calling them \"best friends since the age of three.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/these-cities-will-see-the-first-supermoon-of-2026-rise-in-january-2845614-2026-01-02",
      "headline": "These cities will see the first supermoon of 2026 rise in JanuaryThis full Moon is getting a \"triple boost\": it is full, near perigee, and occurs when Earth is close to the Sun (near perihelion), increasing the sunlight falling on the lunar surface. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-weather-north-india-fog-cold-wave-imd-temperature-delhi-snowfall-2845755-2026-01-02",
      "headline": "Cold to tighten its hold on north India: Icy wind, dense fog on Jan 3Northern India is set to face a severe cold spell with dense fog and plummeting temperatures starting January 3. The IMD has issued alerts for reduced visibility and icy winds sweeping across the plains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/world-news-saudi-strikes-uae-backed-separatists-in-yemen-kills-7-as-region-turns-war-zone-middle-east-news-afp-2845795-2026-01-02",
      "headline": "Saudi strikes UAE-backed forces in Yemen, kills 7 as region turns into war zoneFighter jets of Saudi Arabia rained deaths on UAE-backed separatist forces in southern Yemen, killing at least seven people. The Saudi airstrikes came after forces of the Southern Transitional Council (STC) attempted to retake control of military sites in Hadramawt. Yemen had issued a 24-hour deadline for the UAE to leave the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/abhay-chautala-protest-call-against-government-sparks-bjp-anti-constitutional-accusations-2845783-2026-01-02",
      "headline": "Bangladesh-like protests needed to remove Modi govt: Opposition leader sparks rowA controversial statement by INLD national president Abhay Singh Chautala urging protest movements akin to those in neighbouring countries has sparked sharp responses from BJP leaders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/switzerland-crowded-luxury-bar-fire-social-media-posts-ceiling-foam-cause-probe-2845623-2026-01-02",
      "headline": "Ceiling foam behind Swiss bar fire that killed 47? Viral videos spark buzzDays after 47 people were killed in a massive New Year's Eve fire at a crowded luxury bar in Switzerland, social media posts have gone viral claiming to show the moment the blaze began. An image shows a soundproofing foam in the ceiling catching fire."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/grok-ai-being-misused-to-create-womens-obscene-pics-centre-asks-x-to-act-after-priyanka-chaturvedis-letter-2845781-2026-01-02",
      "headline": "Centre's 72-hour ultimatum to X to remove sexually explicit content on Grok AIThe Centre took note of X's AI chatbot, Grok, being misused by users to create and share sexually explicit images and videos of women on the platform and asked the company to take down such posts in 72 hours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/himachal-pradesh/story/himachal-girl-dies-after-sexual-harassment-ragging-on-college-campus-2845557-2026-01-02",
      "headline": "Himachal woman dies after ragging assault, sexual harassment on college campusDue to the alleged beating and harassment, the girl was hospitalised. She was treated at multiple hospitals across Himachal Pradesh and was later referred to Dayanand Medical College and Hospital (DMC), Ludhiana, for advanced treatment. She succumbed during treatment on December 26, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sewer-bacteria-contamination-indore-drinking-water-deaths-illness-madhya-pradesh-2845706-2026-01-02",
      "headline": "Bacteria in Indore drinking water; 3 top officials suspended after 10 deathsSewer bacteria was found in Indore's drinking water as 10 people died due to diarrhoea, raising alarm over pipeline safety in Madhya Pradesh's commercial capital. The crisis casts a shadow on Indore's reputation as India's cleanest city for the past eight years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/border-2-launch-longewala-sunny-deol-patriotic-dharmendra-haqeeqat-2845817-2026-01-02",
      "headline": "Sunny Deol shares story of father Dharmendra inspiring him to do Border. VideoSunny Deol shared personal insights at the launch of Ghar Kab Aaoge from Border 2, detailing how his father's film Haqeeqat influenced his career and the making of the Border series. The event, held at Longewala–Tanot, featured emotional moments and tributes to the military."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/find-everything-your-baby-needs-this-holiday-season-on-amazons-everyday-essentials-2842500-2025-12-27",
      "headline": "Find everything your baby needs this holiday season on Amazon's Everyday EssentialsAs part of the New Year selections, the specially curated New Year Store —available until 31 December 2025—brings up to 50% off across a wide selection of everyday essentials."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-2024-us-meeting-janice-schakowsky-anti-india-allegations-bjp-2845554-2026-01-02",
      "headline": "After Mamdani's letter to Umar Khalid, BJP alleges Rahul Gandhi-US lobby linkThe BJP cited a 2024 meeting between Rahul Gandhi and US lawmaker Janice Schakowsky as evidence of what it called the Congress leader's \"anti-India\" connections. Schakowsky was among seven others who urged India to grant bail to Umar Khalid, who was arrested in connection to the 2020 Delhi riots."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pakistan-shares-fake-satellite-pics-claiming-strikes-in-punjab-during-op-sindoor-gets-fact-checked-2845823-2026-01-02",
      "headline": "Pak shares fake pics claiming strikes in Punjab during Op Sindoor, gets fact-checkedRecent social media activity from Pakistan has focused on unsubstantiated satellite images alleging strikes on Indian military installations in Punjab during Operation Sindoor. Independent verification has found no evidence supporting these claims."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/indian-astronaut-shubhanshu-shukla-shux-shares-video-space-axiom-4-space-mission-gaganyaan-mission-2845537-2026-01-02",
      "headline": "Moon makes cameo in stunning space timelapse made by astro ShuxShukla, who captured the video during his latest trip to space last year for the Axiom-4 mission, admitted that even after circling the planet numerous times, he finds the view the same as the last one. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shah-rukh-khan-kolkata-knight-riders-bjp-leader-threat-mustafizur-rahman-kolkata-ipl-2026-2845832-2026-01-02",
      "headline": "Shah Rukh Khan, KKR face BJP leader's threat: If any Bangladeshi plays…The inclusion of Bangladeshi fast bowler Mustafizur Rahman in Kolkata Knight Riders for the 2026 IPL season has sparked sharp reactions from political and religious leaders, raising concerns about the participation of foreign players amid regional tensions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/mumbai/story/marriage-refusal-triggers-mumbai-woman-slashes-private-parts-of-lover-2845392-2026-01-02",
      "headline": "Mumbai woman calls lover home for New Year party, chops off his private partsThe accused, a 25-year-old woman, has been booked for grievous assault after she attacked her 42-year-old partner with a sharp weapon. The incident occurred at Kalina in Santacruz East in Mumbai, where the woman resides."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/mtv-india-shuts-down-end-of-traditional-music-tv-youth-culture-2845665-2026-01-02",
      "headline": "MTV shutting down feels personal, 90s kids are heartbrokenMTV India is shutting down after shaping youth culture for decades. This marks the end of an era as digital platforms replace traditional music television."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/sunil-chhetri-indian-players-fifa-plea-save-indian-football-isl-crisis-2845788-2026-01-02",
      "headline": "Sunil Chhetri leads Indian players' video appeal to FIFA amid ongoing football crisisSunil Chhetri and the Indian players have made a last-ditch video appeal to FIFA amidst the ongoing football crisis in the country. The Indian Super League, which was supposed to start in September, is yet to get underway, causing uncertainty amongst the teams and players. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/grap-3-restrictions-lifted-in-delhi-ncr-as-air-quality-improves-aqi-at-236-2845650-2026-01-02",
      "headline": "GRAP-III curbs lifted in Delhi-NCR as air quality improves day after rainGRAP-III restrictions were lifted in Delhi-NCR after the national capital and its adjoining areas saw light rain early on Thursday followed by strong winds, resulting in a marked improvement in the air quality. However, GRAP-I and II curbs will remain in place."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cigarette-prices-to-rise-from-february-1-new-tax-calculation-explained-brand-name-cost-cess-2845490-2026-01-02",
      "headline": "Cigarettes to cost more from February 1. Here's how new rates will be decidedThe new levies on tobacco and pan masala will be imposed over and above the applicable GST rates. These measures will replace the GST compensation cess, which is currently charged at varying rates on sin products."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/hindu-businessman-attacked-stabbed-set-on-fire-bangladesh-family-justice-unrest-2845799-2026-01-02",
      "headline": "He was about to reach home when...: Wife of Hindu trader attacked in BangladeshThe family of Khokon Chandra Das, a Bangladeshi Hindu businessman, said the motive behind the brutal attack on him remains unclear as he had no enmity with anyone. His wife said he was attacked by a mob just as he was about to enter their home."
    }
  ],
  "sports": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-vijay-hazare-trophy-return-livestreaming-details-schedule-2845804-2026-01-03",
      "headline": "Shubman Gill back in VHT: Will he move on from T20 World Cup snub? Following his snub from India's T20 World Cup squad, Shubman Gill is all set to make his return to the field as he will step out for Punjab during the Vijay Hazare Trophy on Saturday, January 3. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-cricket-bcci-charity-game-t20-world-cup-preparations-2845838-2026-01-03",
      "headline": "BCCI reject IND vs SL charity game in December: Sri Lanka cricket chairman Sri Lanka Cricket has revealed that BCCI has rejected their proposal for a charity game in December between India and Sri Lanka for victims affected by Cyclone Ditwah. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shah-rukh-khan-kolkata-knight-riders-bjp-leader-threat-mustafizur-rahman-kolkata-ipl-2026-2845832-2026-01-02",
      "headline": "Shah Rukh Khan, KKR face BJP leader's threat: If any Bangladeshi plays… The inclusion of Bangladeshi fast bowler Mustafizur Rahman in Kolkata Knight Riders for the 2026 IPL season has sparked sharp reactions from political and religious leaders, raising concerns about the participation of foreign players amid regional tensions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zimbabwe-2026-t20-world-cup-squad-announced-cremer-muzarabani-returning-2845796-2026-01-02",
      "headline": "Cremer returns as Zimbabwe reveal Raza-led T20 World Cup 2026 squad Former captain Graeme Cremer returns to Zimbabwe's squad for the 2026 T20 World Cup, joining a side led by Sikandar Raza and featuring a blend of experience and recent performers. Zimbabwe will open their group campaign against Oman in Sri Lanka."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-vijay-hazare-trophy-match-closed-doors-security-seating-issues-2845787-2026-01-02",
      "headline": "Shubman Gill's Vijay Hazare Trophy game vs Sikkim not open to general public: Report Shubman Gill's Punjab match against Sikkim will be played without spectators at Jaipuria College ground. This decision follows security concerns and lack of seating arrangements, impacting live coverage and fan access."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/sunil-chhetri-indian-players-fifa-plea-save-indian-football-isl-crisis-2845788-2026-01-02",
      "headline": "Sunil Chhetri leads Indian players' video appeal to FIFA amid ongoing football crisis Sunil Chhetri and the Indian players have made a last-ditch video appeal to FIFA amidst the ongoing football crisis in the country. The Indian Super League, which was supposed to start in September, is yet to get underway, causing uncertainty amongst the teams and players. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/haris-rauf-smashed-all-over-the-park-melbourne-stars-first-defeat-bbl-2025-26-2845784-2026-01-02",
      "headline": "Haris Rauf taken to the cleaners as Melbourne Stars suffer first loss in BBL 2025-26 Haris Rauf endured a tough night at the Gabba as Brisbane Heat chased down 196, with Max Bryant leading a late assault that handed Melbourne Stars their first loss of the BBL season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/nick-kyrgios-aryna-sabalenka-battle-of-the-sexes-rematch-backlash-2845742-2026-01-02",
      "headline": "Nick Kyrgios, Aryna Sabalenka down for Battle of the Sexes rematch despite backlash Nick Kyrgios and Aryna Sabalenka reflect on the controversial 'Battle of the Sexes' exhibition, addressing criticism and calling for renewed competition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-cricket-review-brendon-mccullum-future-ben-stokes-t20-world-cup-performance-ashes-2845701-2026-01-02",
      "headline": "Despite Ashes flopshow, Ben Stokes wants Brendon McCullum to stay on as coach Ben Stokes affirms his support for Brendon McCullum as England faces scrutiny following the Ashes series, with internal reviews focusing on team culture and coaching structure. Stokes feels that McCullum is the right man to take the team forward. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-sachin-yadav-indian-athletes-world-athletics-anti-doping-rtp-2026-2845708-2026-01-02",
      "headline": "Only two Indians in World Athletics' top anti-doping testing list Only two Indian athletes — Neeraj Chopra and Sachin Yadav — have been named in World Athletics' anti-doping Registered Testing Pool for early 2026, even as India has led global doping violations for three consecutive years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-t20-world-cup-squad-markram-captain-stubbs-rickleton-dropped-2845687-2026-01-02",
      "headline": "South Africa drop Tristan Stubbs, Ryan Rickelton from 15-man T20 World Cup squad Aiden Markram will lead South Africa at the ICC Men's T20 World Cup, with the squad also featuring Quinton de Kock, who recently came out of international retirement, and Anrich Nortje, who has returned to action following his recovery from injury."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-to-play-more-t20is-in-sri-lanka-to-aid-cyclone-hit-regions-report-2845664-2026-01-02",
      "headline": "India to play additional T20Is in Sri Lanka to aid cyclone-hit regions: ReportSri Lanka Cricket (SLC) Chairman Shammi Silva has claimed the BCCI has agreed to add T20Is to India's August 2026 tour of Sri Lanka to support relief and reconstruction efforts after Cyclone Ditwah."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/usman-khawaja-racial-stereotyping-claims-jason-gillespie-questions-ashes-2845641-2026-01-02",
      "headline": "Usman Khawaja's racial stereotyping allegations questioned by Australian legendAustralian legend Jason Gillespie questioned Usman Khawaja's claims of racial stereotyping. Khawaja claimed that he was personally attacked by pundits and the media for suffering an injury during the Perth Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/washington-sundar-skip-photo-autograph-fans-question-attitude-video-watch-2845633-2026-01-02",
      "headline": "Washington Sundar denies photos and autographs, fans question his attitude: WatchWashington Sundar sparked debate online after a video showed him avoiding fan requests for photos and autographs. While some criticised his attitude, others defended him, citing privacy and discomfort."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-tour-bangladesh-white-ball-series-2026-schedule-report-2845578-2026-01-02",
      "headline": "India to tour Bangladesh for white-ball series in September 2026: ReportThe Bangladesh Cricket Board reportedly announced on Friday that India will tour Bangladesh for a three-match ODI series and three T20Is in August–September 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sai-sudharsan-rib-injury-vijay-hazare-trophy-ipl-2026-2845598-2026-01-02",
      "headline": "Sai Sudharsan faces weeks out after rib injury ahead of IPL 2026Tamil Nadu batter Sai Sudharsan is expected to be sidelined for a couple of weeks after suffering a rib injury during a Vijay Hazare Trophy match in December. The left-hander has since reported to the BCCI's Centre of Excellence in Bengaluru, where he is undergoing rehabilitation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-zak-crawley-leads-england-attack-against-australia-final-ashes-test-2025-26-2845577-2026-01-02",
      "headline": "England to maintain pressure on Australia following Melbourne victory: CrawleyEngland ended a long victory drought in Australia by winning the fourth Test of the Ashes 2025–26 series. Zak Crawley says the team will continue their aggressive approach to finish the series strongly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/chris-gayle-carnival-dance-video-west-indies-watch-2845575-2026-01-02",
      "headline": "Chris Gayle dances his way to 2026, Universe Boss style: WatchChris Gayle rang in the New Year in trademark style, sharing a dancing video on Instagram. As 2026 begins, the Universe Boss remains away from international cricket, with no official retirement announced."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-next-virat-kohli-irfan-pathan-captaincy-2845582-2026-01-02",
      "headline": "Can Shubman Gill become the new Virat Kohli? Ex-India cricketer weighs inFormer India cricketer Irfan Pathan feels that Shubman Gill has the capability to be the next Virat Kohli. Gill has been pushed as the next big all-format star in Indian cricket. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-pat-cummins-special-request-to-usman-khawaja-sydney-farewell-test-2845527-2026-01-02",
      "headline": "Cummins makes special request to Usman Khawaja ahead of farewell Test in SydneyAustralia's Usman Khawaja is set to retire after the final Test of the Ashes 2025-26 at the Sydney Cricket Ground. Pat Cummins has made a special request to the 39-year-old ahead of his farewell game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-dropped-india-t20-world-cup-yograj-singh-criticizes-selectors-2845503-2026-01-02",
      "headline": "Yograj Singh slams Shubman Gill's T20 World Cup snub, drags Kapil Dev into debateYograj Singh has publicly criticised India's selectors for omitting Shubman Gill from the T20 World Cup squad, questioning the lack of support for the vice-captain despite recent struggles in form and citing historical examples of players who were given opportunities during lean patches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-warning-to-icc-no-one-will-watch-2026-t20-world-cup-2845481-2026-01-02",
      "headline": "R Ashwin delivers blunt warning to ICC: No one will watch 2026 T20 World CupFormer India spinner Ravichandran Ashwin has questioned the appeal of the 2026 ICC Men's T20 World Cup, warning that the tournament risks losing viewer interest due to the frequency of ICC events and a widening gap in quality between competing teams."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-england-squad-sydney-test-shoaib-bashir-matthew-potts-gus-atkinmson-2845463-2026-01-02",
      "headline": "Ashes: England include Bashir, Potts in 12-member team for fifth Test in SydneyEngland have named their 12-member team for the fifth Ashes Test at Sydney Cricket Ground. The management has included Shoaib Bashir and  Matthew Potts in the team for the final game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyer-match-simulations-india-vs-new-zealand-fitness-clearance-injury-comeback-2845458-2026-01-02",
      "headline": "Shreyas Iyer's comeback route revealed: India batter set for simulation matchesShreyas Iyer is nearing full fitness after months of rehabilitation at the COE. However, with squad decisions looming, his inclusion in India's ODI plans for New Zealand may hinge on timing rather than form."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/sjoerd-marijne-returns-indian-womens-hockey-coach-2026-world-cup-qualifiers-2845451-2026-01-02",
      "headline": "Sjoerd Marijne returns as head coach of Indian women's hockey teamSjoerd Marijne has returned as head coach of the Indian women's hockey team, taking charge at a crucial juncture ahead of the 2026 FIH Women's World Cup Qualifiers in Hyderabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/irfan-pathan-on-virat-kohli-rohit-sharma-more-odis-bcci-2845427-2026-01-02",
      "headline": "BCCI should host more ODIs to keep Kohli, Rohit in action: Irfan PathanFormer all-rounder Irfan Pathan has urged the BCCI to organise longer ODI series and multi-nation tournaments, to keep Virat Kohli and Rohit Sharma in action for long. Both Kohli and Rohit now only play one format, having retired from Tests and T20Is."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-aus-vs-eng-scg-curator-reveals-sydney-pitch-for-fifth-test-2845416-2026-01-02",
      "headline": "SCG curator shrugs off pressure ahead of Ashes finaleSCG curator Adam Lewis admits he and his team have a few pre-match nerves but insists there is no pressure on them to produce a quality pitch for the fifth Ashes Test."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/usman-khawaja-retirement-sydney-press-conference-racial-bias-islam-2845413-2026-01-02",
      "headline": "Targeted for who I am, what I say: Usman Khawaja alleges racial stereotypingUsman Khawaja, in an emotional 50-minute address to the press, spoke of race, faith and belonging, describing years of scrutiny and stereotyping that, he said, shaped his career. The Australian opener announced he would retire from international cricket at the end of the ongoing Ashes series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/indian-football-future-fifa-world-cup-qualification-dream-isl-sponsor-new-season-2845389-2026-01-02",
      "headline": "Dear Indian football, give us the World Cup dream back, and this time a real oneIndian football still lives inside the dreams of its children, even as the system around them crumbles. In 2026, the game must choose whether to rebuild belief or quietly watch that dream slip away."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jason-gillespie-declines-coaching-india-test-cricket-gautam-gambhir-struggles-2845412-2026-01-02",
      "headline": "Australian legend refutes suggestion to replace Gambhir as Indian Test coachFormer Australia cricketer Jason Gillespie has declined fan's request to coach the Indian Test team amid their ongoing struggles. India faces a tough rebuilding phase after losing key players and facing criticism over coaching and selection policies."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}