{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-jumps-595-points-nifty-above-25200-kotak-bank-gains-3-percent-2788193-2025-09-16",
      "headline": "Sensex jumps 595 points, Nifty above 25,200; Kotak Bank gains 3%Sensex jumps 595 points, Nifty above 25,200; Kotak Bank gains 3%"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/apollo-tyres-shares-jump-2-percent-reason-bcci-new-sponsor-team-india-2788188-2025-09-16",
      "headline": "Apollo Tyres shares jump 2% after it's named India cricket team new sponsorApollo Tyres shares jumped to the day's high of Rs 490.80 after opening at Rs 479.45. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/can-a-rs-25000-salary-fund-both-your-home-and-car-2788098-2025-09-16",
      "headline": "Can a Rs 25,000 salary fund both your home and car?Think a Rs 25,000 salary can't get you a house and a car? Think again. With the right strategy and disciplined savings, even modest paychecks can turn into big dreams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/after-gst-overhaul-mother-dairy-slashes-product-prices-milk-cheaper-by-rs-2-2788112-2025-09-16",
      "headline": "After GST overhaul, Mother Dairy slashes product prices; milk cheaper by Rs 2Mother Dairy announced a cut in prices across its portfolio of dairy and processed foods, saying it is passing on the benefits of the government's GST 2.0 reforms directly to consumers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/urban-company-ipo-listing-september-17-bse-nse-strong-subscription-expected-gains-gmp-2788093-2025-09-16",
      "headline": "Urban Company to debut on BSE, NSE: What investors can expect on listing dayUrban Company is set to list on the BSE and NSE on September 17, 2025 after its IPO was subscribed nearly 109 times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-deal-talks-trump-blinks-cheese-corn-agriculture-dairy-sectors-2788074-2025-09-16",
      "headline": "Say cheese: Trump blinks on trade as talks resume with IndiaIndia-US trade negotiations have resumed, weeks after Trump imposed steep 50% tariffs last month. The US, now, doesn't want sweeping access to India's agricultural and dairy markets. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/income-tax-portal-still-facing-glitches-is-1-day-extension-enough-for-taxpayers-2788012-2025-09-16",
      "headline": "1-day ITR extension: Is it enough for taxpayers?Filing income tax returns turned into a nightmare this year, as taxpayers battled login errors, frozen screens and missed payments. Now, with just a one-day extension, many are asking, is that really enough?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/delhi-family-rs-55000-national-insurance-mdindia-rejected-claim-denied-series-2787789-2025-09-16",
      "headline": "System is tainted: Delhi family's 6-year fight over Rs 55,000 insurance claimIn this week's story, part of our ongoing series' Claim Denied,' we tell the story of a Delhi family whose insurance claim was denied and whose battle is still ongoing after six years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/stock-market-tips-top-buys-defence-infra-best-bets-govt-spending-it-shares-2787985-2025-09-16",
      "headline": "Want to invest in stock market? Defence and infra may be your best betsExperts highlighted the current opportunities in the market and suggested which sectors could perform well in the coming months."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/india-us-crucial-trade-talks-begin-after-donald-trumps-50-tariff-move-2787911-2025-09-16",
      "headline": "India-US crucial trade talks begin after Donald Trump's 50% tariff moveThe Trump administration's chief negotiator, Brendan Lynch, is in India for trade discussions following Washington's decision to impose a 50% tariff on Indian goods, a move New Delhi termed \"unfair, unjustified and unreasonable.\" The visit is an initial meeting to ease tensions, not a formal round of negotiations. This follows five previous rounds of talks. Prime Minister Narendra Modi responded to the trade situation by promising to protect local interests and stating his government would not let farmers, small entrepreneurs, or animal breeders be harmed. He also promoted a 'swadeshi' philosophy of encouraging products made in India. US President Donald Trump, while noting his friendly relationship with PM Modi, expressed disappointment over India buying Russian oil but affirmed the special relationship means there is \"nothing to worry about.\""
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/cas-taxpayers-slam-governments-midnight-1-day-itr-income-tax-filing-deadline-extension-2787951-2025-09-16",
      "headline": "One day is an insult: CAs, taxpayers slam last-minute ITR deadline extensionThe government's last-minute one-day ITR extension has ignited anger, with taxpayers and chartered accountants slamming it as tokenism, mocking portal glitches and questioning accountability in digital governance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-sensex-nifty-dalal-street-us-fed-rate-decision-september-16-2787943-2025-09-16",
      "headline": "Sensex, Nifty open flat as investors await key US Fed decisions on rate cutThe S&P BSE Sensex added 148.51 points to 81,934.25, while the NSE Nifty50 gained 40.25 points to 25,109.50 as of 9:28 am."
    }
  ],
  "entertainment": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/abir-gulaal-first-reviews-out-critics-call-fawad-khan-vaani-kapoor-film-frustrating-2788190-2025-09-16",
      "headline": "Abir Gulaal first reviews out: Critics call Fawad Khan-Vaani's film frustratingFawad Khan and Vaani Kapoor's film 'Abir Gulaal' is barred from Indian release following the Pahalgam terror attack. It has drawn negative responses from critics worldwide, citing incoherent storytelling and lacklustre performances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/vir-das-announces-new-tour-not-stand-up-but-sounds-of-india-2788189-2025-09-16",
      "headline": "Vir Das ditches stand-up for a new cultural tour, announces Sounds of IndiaActor-comedian Vir Das has announced a new tour, 'Sounds of India'. The tickets for the tour will go live on September 18. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/varun-dhawan-says-actors-cannot-be-entirely-blamed-for-rising-entourage-costs-2788156-2025-09-16",
      "headline": "Varun Dhawan says actors cannot be entirely blamed for rising entourage costsActor Varun Dhawan addresses the ongoing debate about escalating actor entourage expenses. He emphasised that both actors and producers must share responsibility for industry costs and collaborate accordingly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tanushree-dutta-rejects-bigg-boss-despite-rs-165-crore-offer-2787996-2025-09-16",
      "headline": "I'm not that cheap: Tanushree Dutta rejects Bigg Boss despite Rs 1.65 crore offerActor Tanushree Dutta shared that she has rejected offers to join 'Bigg Boss' for 11 years, despite being offered Rs 1.65 crore. She said the reality show is not aligned with her values, adding she is \"not that cheap\" to compromise her privacy for TRPs."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/netflix-monster-ed-gein-story-trailer-release-october-2025-2788011-2025-09-16",
      "headline": "Monster trailer: Charlie Hunnam serves horror straight from its darkest sourceNetflix released the trailer for 'Monster: The Ed Gein Story', starring Charlie Hunnam. The series explores Ed Gein's crimes and their influence on Hollywood horror."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-wears-septum-ring-holds-trident-in-vrusshabha-poster-teaser-date-out-2788127-2025-09-16",
      "headline": "Mohanlal wears septum ring, holds trident in Vrusshabha poster, teaser date outThe makers of Mohanlal's upcoming period epic 'Vrusshabha' have announced that its first teaser will be unveiled on September 18. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-episode-23-day-22-written-update-amaal-mallik-nehal-chudasama-kunickaa-sadanand-2788060-2025-09-16",
      "headline": "Bigg Boss 19 episode 23: Amaal's aggressive captaincy leaves housemates miffedThe kitchen continues to be the hotspot of all major fights in 'Bigg Boss 19'. The latest episode of the reality show was no exception, with fights breaking out between Nehal Chudasama, Kunickaa Sadanand, and Amaal Mallik.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ul-jalool-ishq-vijay-fatima-revisit-old-school-romance-gustaakh-ishq-2788080-2025-09-16",
      "headline": "Ul Jalool Ishq: Vijay, Fatima revisit old-school romance in Gustaakh IshqProducer Manish Malhotra released the first track 'Ul Jalool Ishq' from 'Gustaakh Ishq', following the audience response. The song features actors Fatima Sana Shaikh and Vijay Varma, who play lead roles in the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/shailene-woodley-lucas-bravo-end-relationship-remove-photos-2788099-2025-09-16",
      "headline": "Actors Shailene Woodley-Lucas Bravo break up months after going public: ReportShailene Woodley and Lucas Bravo have quietly ended their breezy Parisian romance, removing all traces of each other from social media. Their relationship, which blossomed publicly earlier this year, has come to a close without any official statement from either party."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-girlfriend-review-women-play-dirty-in-this-dark-addictive-thriller-robin-wright-olivia-cooke-2787809-2025-09-16",
      "headline": "The Girlfriend review: Women play dirty in this dark, addictive thrillerRelease Date:Wed Sep 10, 2025The Girlfriend series review: 'The Girlfriend' is a binge-worthy psychological thriller where two women from completely different worlds go head-to-head in a game of power, secrets, and manipulation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nafisa-ali-shares-update-on-her-cancer-battle-resumes-chemotherapy-2788097-2025-09-16",
      "headline": "Nafisa Ali shares update on her cancer battle, resumes chemotherapyVeteran actor and politician Nafisa Ali shared that she will resume chemotherapy as surgery is not an option in her cancer treatment. Sharing an emotional Instagram post, she said she loves life and is beginning \"a new chapter\" in her journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jolly-llb-3-advance-booking-day-1-detailed-report-akshay-kumar-arshad-warsi-film-set-for-good-box-office-traction-2788102-2025-09-16",
      "headline": "Jolly LLB 3 advance booking: Akshay-Arshad's film set for good box office traction'Jolly LLB 3' advance booking hints at a strong response as Akshay Kumar and Arshad Warsi reunite for the legal-comedy franchise. With over Rs 62 lakh in pre-sales, the film is set for a double-digit opening if word-of-mouth clicks. Here's how the franchise power and courtroom drama could shape its box office journey."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/gauahar-khan-supports-kunickaa-bigg-boss-19-house-tensions-2788002-2025-09-16",
      "headline": "Gauahar slams Amaal for disrespecting 61-year-old Kunickaa on Bigg Boss 19Gauahar Khan has expressed sympathy for Kunickaa Sadanand on social media, highlighting concerns about the tone used by other Amaal Mallik towards her on Bigg Boss 19."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/two-much-without-shah-rukh-khan-kajol-and-twinkle-khanna-explain-with-humour-2788008-2025-09-16",
      "headline": "Two Much without Shah Rukh Khan? Kajol and Twinkle Khanna explain with humourKajol and Twinkle Khanna offer witty explanations for Shah Rukh Khan's absence from their upcoming talk show 'Two Much', which features several major Bollywood stars, including Salman Khan and Aamir Khan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dulquer-salmaan-reflects-unexpected-success-lokah-chapter-1-chandra-2787991-2025-09-16",
      "headline": "Dulquer Salmaan amazed by Lokah's unexpected success, says was prepared for a lossDulquer Salmaan's 'Lokah Chapter 1: Chandra' has become a pan-India sensation, surpassing all expectations and sparking excitement about the franchise's future. The actor admitted he and the team weren't prepared for the strong reception. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priya-sachdev-kapur-appears-amid-sanjay-kapur-inheritance-dispute-2787932-2025-09-16",
      "headline": "Priya Sachdev makes first public appearance amid property disputePriya Sachdev Kapur has made her first public appearance since the death of her husband, Sunjay Kapur, while legal proceedings continue over his estate. The Delhi High Court has ordered Priya to disclose all assets, as Sunjay's children contest the validity of his will."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/zootopia-2-release-november-26-new-cast-lynxley-family-disney-2787960-2025-09-16",
      "headline": "Zootopia 2 announces new cast members Andy Samberg, Macaulay Culkin, Brenda Song'Zootopia 2' is scheduled for release on November 26 with new and returning voice cast members. The sequel introduces the Lynxley family alongside other notable characters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/travis-kelce-emotional-proposal-taylor-swift-nfl-engagement-2787979-2025-09-16",
      "headline": "Travis Kelce admits he cried while proposing to Taylor SwiftTravis Kelce and Taylor Swift revealed their engagement on August 26. Kelce described his proposal as highly emotional and shared his admiration for Swift."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/demon-slayer-infinity-castle-box-office-collection-day-4-detailed-report-monday-drop-but-historic-run-goes-on-2787986-2025-09-16",
      "headline": "Demon Slayer Infinity Castle box office Day 4: Monday dips but historic run goes on'Demon Slayer: Infinity Castle' earns Rs 44.50 crore in India despite a drop on Monday, becoming the biggest non-Hollywood foreign film and rewriting records worldwide."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/masood-azhar-family-killed-bahawalpur-operation-sindoor-jaish-commander-admits-2788096-2025-09-16",
      "headline": "Masood Azhar's family 'torn into pieces' by India: Jaish admits Op Sindoor impactThis is the first public confirmation from within the Jaish-e-Mohammad regarding the fate of Masood Azhar's family after India hit the terror outfit's headquarters in Bahwalpur."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/icc-rejects-pakistans-demand-to-remove-match-referee-andy-pycroft-from-asia-cup-amid-handshake-row-with-india-2788050-2025-09-16",
      "headline": "ICC rejects Pak's demand to drop Asia Cup match referee over handshake rowThe International Cricket Council has rejected Pakistan's demand to remove match referee Andy Pycroft from Asia Cup. Pakistan had threatened that if Pycroft was not removed, they would withdraw from the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/qatar-arab-islamic-summit-nations-nato-military-alliance-pakistan-turkey-nexus-impact-on-india-middle-east-security-israel-2788111-2025-09-16",
      "headline": "Push for Arab-Islamic Nato in meeting attended by Pak, TurkeyLeaders of Arab and Islamic nations pushed for an \"Arab Nato\" in a meeting of over 40 Muslim countries, including Pakistan and Turkey. Egypt, which has the Arab world's largest army, pitched it as a collective defence shield."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/apollo-tyres-new-sponsor-indian-cricket-team-after-dream11-exit-2788181-2025-09-16",
      "headline": "Apollo Tyres named new sponsor for Indian cricket team after Dream11 exitApollo Tyres has replaced Dream11 as the official sponsor of the Indian cricket team. Both the men's side, currently competing in the Asia Cup, and the women's team, playing an ODI series against Australia, have been without a sponsor in recent matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-deal-talks-trump-blinks-cheese-corn-agriculture-dairy-sectors-2788074-2025-09-16",
      "headline": "Say cheese: Trump blinks on trade as talks resume with IndiaIndia-US trade negotiations have resumed, weeks after Trump imposed steep 50% tariffs last month. The US, now, doesn't want sweeping access to India's agricultural and dairy markets. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/landslides-waterlogging-bring-states-to-a-halt-as-relentless-rain-batters-india-2787975-2025-09-16",
      "headline": "7 dead in landslide, cloudburst as relentless rain paralyses states across IndiaWith the monsoon showing no signs of relenting, several states continue to battle floods, landslides, and waterlogging. Authorities remain on high alert as heavy rainfall disrupts daily life and threatens more damage across the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/shahid-afridi-accuses-modi-government-hindu-muslim-politics-praises-rahul-gandhi-2788160-2025-09-16",
      "headline": "Shahid Afridi's anti-India rant amid handshake row has a Rahul Gandhi mentionShahid Afridi's tirade came on the heels of a controversy at the Asia Cup 2025, where Indian players pointedly refused to shake hands with their Pakistani counterparts after their Sunday match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/uk-news/story/anti-immigrant-uk-unite-the-kingdom-rally-leader-tommy-robinson-surprising-take-on-indians-hindus-allies-britain-2788130-2025-09-16",
      "headline": "Anti-immigrant UK leader Tommy Robinson has surprising take on IndiansDespite his hardline anti-immigrant stance, UK leader Tommy Robinson has repeatedly praised Indians, particularly Hindus, calling them allies who integrate into British life. Robinson, who recently led a massive rally through the heart of London, had pledged street muscle for Hindus, who he saw as distinctly different from other immigrants."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/iit-bombay-humanities-liberat-arts-workshop-courses-controversy-left-liberal-agenda-debate-iim-nep-2020-2787574-2025-09-16",
      "headline": "Why humanities at IITs? Arts courses spark debate on Left liberal agendaAn illustration for a workshop on 'South Asian Capitalism(s)' at IIT Bombay sparked a controversy. Though IIT Bombay distanced itself from the event, the row has snowballed into a debate, with critics alleging that humanities were being used by Left liberals to \"capture\" India's tech institutes. Here are both sides of the argument and a balanced takeaway."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/the-80-gap-why-most-indians-are-underinsured-and-why-its-time-to-act-2787740-2025-09-15",
      "headline": "The 80% gap: Why most Indians are underinsured and why it's time to actThe solution lies in choosing a comprehensive life cover that reflects modern realities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/gujarat-high-court-orders-tmc-mp-yusuf-pathan-to-vacate-government-land-vadodara-2788159-2025-09-16",
      "headline": "Celebrities not above law: High Court declares Yusuf Pathan an encroacherThe dispute originated in 2012, when the Vadodara Municipal Corporation (VMC) issued a notice asking the Trinamool lawmaker to vacate the government land he had occupied since that year. Yusuf Pathan challenged this notice and approached the Gujarat High Court."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/maruti-suzuki-victoris-vs-grand-vitara-comparison-what-makes-the-new-suv-stand-out-2788071-2025-09-16",
      "headline": "Maruti Suzuki Victoris vs Grand Vitara: What makes the new SUV stand out?Maruti Suzuki's new Victoris takes on its sibling, the Grand Vitara, sharing the same platform and engines but offering more features and safety tech for a competitive edge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/is-us-howard-lutnick-donald-trump-aide-corn-attack-linked-to-india-ethanol-rush-2787793-2025-09-16",
      "headline": "Is US corn attack linked to India's ethanol rush?US Commerce Secretary Howard Lutnick attacked India for not importing American corn. India was an exporter of maize till 2023 but the diversion of corn to produce ethanol for fuel blending turned it into an importer. DC's desperation as China skips its grains and India's corn imports are behind the Trump aide's attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/the-kerala-story-a-health-model-haunted-by-serial-outbreaks-nippah-zika-brain-eating-amoeba-2788103-2025-09-16",
      "headline": "The Kerala Story: A health model haunted by serial outbreaksTouted as India's healthcare success story, Kerala now finds itself battling a grim pattern, one deadly outbreak after another. Experts warn: it's time to look beyond the applause and confront the cracks."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-vs-pakistan-boycott-mohsin-naqvi-2787989-2025-09-16",
      "headline": "Asia Cup withdrawal only honourable exit for below-par PakistanPakistan have threatened to withdraw from the Asia Cup if match referee Andy Pycroft is not removed for the remainder of the tournament. Is the abrupt exit the only way for Pakistan to avoid humiliation in the Super 4 stage?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/uttar-pradesh/story/neet-aspirant-killed-by-cattle-smugglers-in-uttar-pradesh-gorakhpur-protests-erupt-2788014-2025-09-16",
      "headline": "NEET aspirant, 19, killed by cattle smugglers in UP's Gorakhpur; protests eruptA NEET aspirant was killed in Gorakhpur during a confrontation with suspected cattle smugglers. The incident sparked violent protests in the village."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/delhi-family-rs-55000-national-insurance-mdindia-rejected-claim-denied-series-2787789-2025-09-16",
      "headline": "System is tainted: Delhi family's 6-year fight over Rs 55,000 insurance claimIn this week's story, part of our ongoing series' Claim Denied,' we tell the story of a Delhi family whose insurance claim was denied and whose battle is still ongoing after six years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/assam-bureaucrat-acs-raided-guwahati-residence-cash-jewellery-found-2788044-2025-09-16",
      "headline": "Assam bureaucrat Nupur Bora raided, Rs 2.02 crore in cash and jewellery foundAn Assam Civil Service (ACS) officer was arrested for allegedly possessing disproportionate assets. Cash worth Rs 1.02 crore and jewellery amounting to Rs 1 crore was found from her residence in Guwahati and rented house in Barpeta."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-pm-shehbaz-sharif-may-meet-trump-next-week-asim-munir-to-join-talks-report-2788192-2025-09-16",
      "headline": "Pak PM Shehbaz Sharif may meet Trump next week, Asim Munir to join talks: ReportPakistan PM Shehbaz Sharif is likely to meet US President Donald Trump next week, with Army chief Asim Munir accompanying him for the talks, as per a report."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/ias-officer-swapnil-wankhede-warm-interaction-with-orphan-girl-viral-video-2788041-2025-09-16",
      "headline": "Viral video of IAS officer's warm interaction with orphan girl delights InternetA touching video of Swapnil Wankhede, a 2016-batch IAS officer and Collector of Datia district in Madhya Pradesh, warmly interacting with an orphaned girl has gone viral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-athletics-championships-steeplechase-el-bakkali-2787993-2025-09-16",
      "headline": "Life in 8 minutes: The tears, euphoria, and a final kick for the agesNew Zealand's Geordie Beamish stunned the athletics world by winning gold in the 3000m steeplechase. The dramatic finish saw reigning champion Bakkali fall short of a historic three-peat in the world champs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/vantara-reliance-foundation-clean-chit-supreme-court-reasons-animal-smuggling-funds-2788163-2025-09-16",
      "headline": "3 reasons behind Supreme Court clean chit to Reliance-owned VantaraThe SIT was set up by the Supreme Court after two writ petitions alleged that animals were being unlawfully procured and mistreated in captivity by Vantara. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/gaza-is-burning-israel-announces-launch-of-ground-operation-2788133-2025-09-16",
      "headline": "Gaza is burning: Israel announces launch of ground op to root out HamasIsrael has officially launched its long-awaited ground operation into Gaza City, saying that \"Gaza is burning\". The Israeli military said its troops had begun \"dismantling Hamas terrorist infrastructure in Gaza City\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priya-sachdev-kapur-appears-amid-sanjay-kapur-inheritance-dispute-2787932-2025-09-16",
      "headline": "Priya Sachdev makes first public appearance amid property disputePriya Sachdev Kapur has made her first public appearance since the death of her husband, Sunjay Kapur, while legal proceedings continue over his estate. The Delhi High Court has ordered Priya to disclose all assets, as Sunjay's children contest the validity of his will."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/apollo-tyres-new-sponsor-indian-cricket-team-after-dream11-exit-2788181-2025-09-16",
      "headline": "Apollo Tyres named new sponsor for Indian cricket team after Dream11 exitApollo Tyres has replaced Dream11 as the official sponsor of the Indian cricket team. Suryakumar Yadav's men are playing in the Asia Cup without a sponsor. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-athletics-championships-murali-sreeshankar-2788169-2025-09-16",
      "headline": "Was told I won't jump again: Sreeshankar satisfied despite early exitMurali Sreeshankar is happy despite a mellow ending to the 2025 season. Told he would never jump again, the athlete is satisfied with the progress that he made this season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-regains-no-1-odi-ranking-resilient-half-century-australia-2788150-2025-09-16",
      "headline": "Smriti Mandhana reclaims No.1 ODI ranking after fluent 58 vs AustraliaSmriti Mandhana reclaimed the No.1 ODI ranking with a half-century against Australia on September 14 in Mullanpur. She replaced England captain Nat Sciver-Brunt at the top."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-asia-cup-controversy-2788120-2025-09-16",
      "headline": "From legends to letdowns: Pakistan cricket at mercy of prayers, miraclesPakistan cricket's former glory fades amid Asia Cup 2025 struggles, a sour handshake controversy, and threats of tournament withdrawal, exposing deep cricketing and administrative crises."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/pakistans-demand-to-remove-asia-cup-match-referee-rejected-by-icc-2788105-2025-09-16",
      "headline": "Pakistan's demand to remove Asia Cup match referee rejected by ICCThe International Cricket Council (ICC) has turned down Pakistan's demand to remove match referee Andy Pycroft from the ongoing Asia Cup following the India-Pakistan handshake controversy. After an internal review, the ICC informed the PCB that the matter required no further action. Sources also revealed that several Asian Cricket Council officials, including the PCB director, already knew beforehand that no handshake between the two captains was planned."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2026-starts-early-five-teams-mumbai-indians-defend-title-2788100-2025-09-16",
      "headline": "Women's Premier League 2026 set to start in January first week: ReportsThe Women's Premier League (WPL) 2026 is set to start in early January, featuring the same five teams as previous seasons, with Mumbai Indians entering as defending champions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ricky-ponting-denies-fake-quote-india-pakistan-asia-cup-handshake-controversy-2788064-2025-09-16",
      "headline": "Ricky Ponting slams fake comments amid Asia Cup controversyRicky Ponting dismissed a fake quote circulating online that falsely claimed he criticised India and praised Pakistan after their Asia Cup clash, clarifying he never made any such remarks."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/icc-rejects-pakistans-demand-to-remove-match-referee-andy-pycroft-from-asia-cup-amid-handshake-row-with-india-2788050-2025-09-16",
      "headline": "ICC rejects Pak's demand to drop Asia Cup match referee over handshake rowThe International Cricket Council has rejected Pakistan's demand to remove match referee Andy Pycroft from Asia Cup. Pakistan had threatened that if Pycroft was not removed, they would withdraw from the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-athletics-championships-steeplechase-el-bakkali-2787993-2025-09-16",
      "headline": "Life in 8 minutes: The tears, euphoria, and a final kick for the agesNew Zealand's Geordie Beamish stunned the athletics world by winning gold in the 3000m steeplechase. The dramatic finish saw reigning champion Bakkali fall short of a historic three-peat in the world champs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/anandkumar-velkumar-pm-modi-gold-speed-skating-world-championships-india-world-champion-2788021-2025-09-16",
      "headline": "PM Modi praises Anandkumar Velkumar after Speed Skating World Championships goldPM Narendra Modi hailed Anandkumar Velkumar for becoming India's first-ever world champion in speed skating after his historic gold in the men's 1000m sprint at the World Championships in China."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-coach-trott-mistakenly-claims-bangladesh-won-asia-cup-2025-clash-2788001-2025-09-16",
      "headline": "Trott calls Bangladesh Asia Cup winners in funny goof-up, googles to confirm: WatchJonathan Trott sparked laughter at the pre-match press conference by mistakenly claiming Bangladesh had won the Asia Cup, before admitting his blunder. He later praised Bangladesh's match-winners and said Afghanistan's week-long break would help them recharge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ricky-ponting-denies-fake-quote-india-pakistan-asia-cup-handshake-controversy-2788064-2025-09-16",
      "headline": "Ricky Ponting slams fake comments amid Asia Cup controversyRicky Ponting dismissed a fake quote circulating online that falsely claimed he criticised India and praised Pakistan after their Asia Cup clash, clarifying he never made any such remarks."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/icc-rejects-pakistans-demand-to-remove-match-referee-andy-pycroft-from-asia-cup-amid-handshake-row-with-india-2788050-2025-09-16",
      "headline": "ICC rejects Pak's demand to drop Asia Cup match referee over handshake rowThe International Cricket Council has rejected Pakistan's demand to remove match referee Andy Pycroft from Asia Cup. Pakistan had threatened that if Pycroft was not removed, they would withdraw from the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-athletics-championships-steeplechase-el-bakkali-2787993-2025-09-16",
      "headline": "Life in 8 minutes: The tears, euphoria, and a final kick for the agesNew Zealand's Geordie Beamish stunned the athletics world by winning gold in the 3000m steeplechase. The dramatic finish saw reigning champion Bakkali fall short of a historic three-peat in the world champs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/anandkumar-velkumar-pm-modi-gold-speed-skating-world-championships-india-world-champion-2788021-2025-09-16",
      "headline": "PM Modi praises Anandkumar Velkumar after Speed Skating World Championships goldPM Narendra Modi hailed Anandkumar Velkumar for becoming India's first-ever world champion in speed skating after his historic gold in the men's 1000m sprint at the World Championships in China."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-coach-trott-mistakenly-claims-bangladesh-won-asia-cup-2025-clash-2788001-2025-09-16",
      "headline": "Trott calls Bangladesh Asia Cup winners in funny goof-up, googles to confirm: WatchJonathan Trott sparked laughter at the pre-match press conference by mistakenly claiming Bangladesh had won the Asia Cup, before admitting his blunder. He later praised Bangladesh's match-winners and said Afghanistan's week-long break would help them recharge."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}