{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-posts-rs-123-crore-profit-in-q1fy26-strengthens-lead-in-merchant-payments-2759667-2025-07-22",
      "headline": "Paytm posts Rs 123 crore profit in Q1FY26, strengthens lead in merchant paymentsOperating revenue rises 28% YoY; contribution profit up 52% as AI-led efficiencies and financial services boost bottom line."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-anish-shah-ceo-mahindra-annual-salary-top-paid-auto-sector-ceo-95-percent-hike-rs-47-crore-2759620-2025-07-22",
      "headline": "Who Is Anish Shah, the auto CEO whose salary nearly doubled to Rs 47 crore?Anish Shah, Group CEO and managing director of the Mahindra Group, entered the list of top 5 paid auto CEOs for the first time. He received a 95% hike in pay, with his total earnings touching Rs 47.33 crore in FY25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-a-small-ais-check-can-save-you-from-a-tax-notice-2759547-2025-07-22",
      "headline": "How a small AIS check can save you from a tax noticeIf you skip checking your AIS, you might end up missing some income details. This can lead to a mismatch between what you file and what the tax department already knows, and that can easily get you a notice later."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-closes-flat-nifty-below-25100-eternal-up-11-percent-tata-motors-down-2759578-2025-07-22",
      "headline": "Sensex closes flat, Nifty below 25,100; Eternal up 11%The S&P BSE Sensex lost 13.53 points to end at 82,186.81, while the NSE Nifty50 ended lower by 29.80 points to close at 25,060.90. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-entry-india-problem-competition-model-y-price-ev-sector-news-mahindra-tata-mg-2759556-2025-07-22",
      "headline": "Why Tesla's ride into India's EV market won't be a smooth oneTesla's entry comes at a time when it is facing its biggest drop in global sales to date. Its domestic sales in the US fell 6.3% in the second quarter of 2025, the third straight quarterly decline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/noida-is-now-tax-free-check-who-benefits-and-how-income-tax-exemption-2759508-2025-07-22",
      "headline": "NOIDA is now tax-free. Check who benefits and howAt a time when cities are competing hard to attract businesses and investors, this tax relief could give NOIDA a fresh edge. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-receives-plea-to-cut-28-percent-gst-on-aerated-drinks-2759502-2025-07-22",
      "headline": "Government receives plea to cut 28% GST on aerated drinksThe matter is likely to be taken up at the upcoming 56th GST Council meeting, expected to be held in mid-August. The meeting is already set to review a broader rate rationalisation framework, with officials indicating that certain slabs and cesses may be simplified or merged."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ex-icici-ceo-chanda-kochhar-rs-64-crore-vibe-videocon-tribunal-bribe-case-report-2759484-2025-07-22",
      "headline": "Chanda Kochhar found guilty in Rs 64-crore Videocon bribe case: ReportAn appellate tribunal gave this ruling in an order dated July 3. The tribunal said that the money was routed through Kochhar's husband Deepak Kochhar, using a company connected to Videocon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/are-indian-homebuyers-growing-wealth-or-buying-liabilities-explains-consultant-2759436-2025-07-22",
      "headline": "Are Indian homebuyers growing wealth or buying liabilities? Explains consultantA real-estate consultant points out that the middle class often assumes owning a house means they are moving forward, but in reality, possession alone does not guarantee real financial progress."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/anil-ambani-rcom-fraud-sbi-allegation-cbi-case-trouble-reliance-communications-2759429-2025-07-22",
      "headline": "SBI to approach CBI after tagging Anil Ambani and RCom as 'fraud'SBI's exposure to Reliance Communications includes a fund-based principal outstanding of Rs 2,227.64 crore, along with interest and expenses since August 26, 2016. In addition, there is a non-fund based bank guarantee exposure of Rs 786.52 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-proposes-stricter-digital-banking-rules-what-it-means-for-you-2759405-2025-07-22",
      "headline": "RBI proposes stricter digital banking rules: What it means for youTo keep online fraud in check, all banks must use proper fraud detection tools and keep an eye on unusual transactions. They should also study how customers usually spend money so that any odd activity can be spotted quickly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/astronomer-now-a-household-name-new-ceos-first-statement-after-kiss-cam-scandal-2759370-2025-07-22",
      "headline": "Astronomer now a household name: New CEO's first statement after kiss-cam scandalFormer CEO Andy Byron stepped down days after a video of him and Chief People Officer Kristin Cabot appearing on a 'kiss cam' at a Coldplay concert near Boston went viral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/jane-street-ban-sebi-removal-with-conditions-investigation-ongoing-stock-market-manipulation-2759369-2025-07-22",
      "headline": "Sebi clears Jane Street to resume trading, with strings attachedJane Street was allowed to return to the markets after it complied with a key part of Sebi's interim order. The firm deposited Rs 4,844 crore in an escrow account held with a scheduled commercial bank in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/eternal-shares-see-sharp-rally-after-q1-results-buy-sell-or-hold-2759367-2025-07-22",
      "headline": "Eternal shares see sharp rally after Q1 results. Buy, sell or hold?The rally comes on the back of strong performance across verticals, with quick commerce overtaking food delivery in terms of Net Order Value (NOV) for the first time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/eternal-shares-jump-14-after-q1-results-check-target-price-brokerage-views-2759364-2025-07-22",
      "headline": "Eternal shares jump 14% after Q1 results. Check target price, brokerage viewsThe stock rose 13.38% to Rs 307.50 on the Bombay Stock Exchange at 9:34 am, crossing the Rs 300 milestone for the first time and extending its recent upward trajectory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-finance-md-anup-kumar-resigns-fuels-buzz-around-indusind-bank-ceo-role-2759355-2025-07-22",
      "headline": "Bajaj Finance MD Anup Kumar Sinha resigns amid IndusInd Bank CEO role buzBajaj Finance shares were up 0.82% on the Bombay Stock Exchange around 9:17 am, while IndusInd Bank rose nearly 2.4%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-opening-bell-rally-sensex-opens-267-points-higher-nifty-above-25100-eternal-jumps-10-2759351-2025-07-22",
      "headline": "Sensex opens 267 points higher, Nifty above 25,100; Eternal jumps 10%The S&P BSE Sensex was up by 204.96 points to 82,405.30, while the NSE Nifty5o gained 43.90 points to 25,123.55 as of 9:30 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/top-paid-auto-sector-ceo-salary-pawan-munjal-hero-rajiv-bajaj-anish-shah-mahindra-jayadev-galla-2759339-2025-07-22",
      "headline": "Pawan Munjal top paid auto sector CEO in India. Check others on the listHero MotoCorp chairman and managing director Pawan Munjal remained the highest-paid auto sector CEO in FY25. His total pay stood at Rs 109.41 crore, the same as in FY24."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/8th-pay-commission-update-news-government-starts-talks-with-states-ministries-da-hike-salary-news-2759330-2025-07-22",
      "headline": "8th Pay Commission update: Government kickstarts talks with states, ministriesThe government adjusts the salaries of employees and pensioners through dearness allowance (DA), which is reviewed every six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/books/story/mango-millionaire-makes-money-feel-relatable-radhika-gupta-niranjan-awasthi-2758912-2025-07-21",
      "headline": "From Bollywood to dal-chawal, Mango Millionaire makes money feel relatable'Mango Millionaire' turns personal finance into a relatable conversation, using Bollywood, family meals, and everyday metaphors to explain money matters. It's simple, practical, and feels more like advice from a friend than a finance manual."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/louis-vuitton-faces-scrutiny-over-hong-kong-data-leak-2759100-2025-07-21",
      "headline": "Louis Vuitton faces scrutiny over Hong Kong data leakHong Kong's Office of the Privacy Commissioner for Personal Data said on Monday that it has started an investigation into how this happened and whether the company told the authorities on time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/salary-survey-2025-foundit-appraisals-done-not-enough-employees-want-to-change-jobs-2759058-2025-07-21",
      "headline": "Over 85% of employees plan to change jobs after salary hikes in 2025: SurveyMost hikes fell in the 5–10% range, with only a small fraction crossing the 20% mark. Advertising, education, and IT saw the highest share of professionals reporting no hike at all, while sectors like energy and BFSI offered relatively better payouts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-shock-for-karnataka-vendor-raises-concerns-among-small-upi-users-2759049-2025-07-21",
      "headline": "GST shock for Karnataka vendor raises concerns among small UPI usersThe incident shows why small traders might stop taking UPI payments out of fear. Many would rather handle cash than deal with confusing tax demands. This goes against the government's aim of building a cashless economy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/real-estate-homes-under-rs-1-crore-metro-city-property-price-rs-1-crore-new-delhi-mumbai-bangalore-2759033-2025-07-21",
      "headline": "Affordable homes are vanishing. Can you still get a 2BHK under Rs 1 crore?Real estate prices across major metros have surged due to strong demand, high construction costs, and a steady flow of luxury housing projects. Yet, there are still locations in both Tier-1 and Tier-2 cities where a 2BHK under Rs 1 crore is within reach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-gains-442-points-nifty-ends-above-25000-eternal-jumps-over-7-2759031-2025-07-21",
      "headline": "Sensex gains 442 points, Nifty ends above 25,000; Eternal jumps over 7%The S&P BSE Sensex gained 442.61 points to close at 82,200.34, while the NSE Nifty50 added 122.30 points to end at 25,090.70. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/have-not-got-your-tax-refund-yet-here-is-why-it-may-be-delayed-wrong-hra-claims-mismatch-itr-ais-data-2758954-2025-07-21",
      "headline": "Haven't got your tax refund yet? Here's why it may be delayedSometimes, taxpayers claim deductions like HRA or medical insurance without having proper proof. If the tax department finds something suspicious, they may stop your refund and send you a notice for more details."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-now-hosts-over-half-the-worlds-gccs-led-by-bengaluru-2758930-2025-07-21",
      "headline": "India now hosts over half the world's GCCs, led by BengaluruFrom cost-saving outposts to strategic anchors, India's GCC evolution is reshaping global operations. As Tier-2 cities gear up, the next big wave might come from smaller, smarter urban bets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-in-lok-sabha-today-how-it-impacts-you-2758892-2025-07-21",
      "headline": "New income tax bill in Lok Sabha today: How it impacts youThe Bill aims to make clearer rules for exemptions, TDS, TCS, and not-for-profit organisations. All this, the government hopes, will cut down on confusion and save everyone time and trouble."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/karnataka-vegetable-vendor-hit-with-rs-29-lakh-gst-notice-here-is-why-2758841-2025-07-21",
      "headline": "Karnataka vegetable vendor hit with Rs 29 lakh GST notice. Here's whySelling veggies for four years and accepting UPI has landed Shankargouda with a Rs 29 lakh GST notice on Rs 1.63 crore turnover."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/anthem-biosciences-share-price-nse-bse-27-percent-premium-market-debut-review-2758793-2025-07-21",
      "headline": "Anthem Biosciences share price: Stock lists at 27% premium on market debutAnthem Biosciences stock price: The company's shares opened at Rs 723.05 on the NSE and Rs 723.10 on the BSE. This was about 27% higher than its issue price of Rs 570."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/burger-singh-hilariously-debunks-rs-47-crore-funding-report-clatification-goes-viral-2758780-2025-07-21",
      "headline": "Burger Singh debunks Rs 47 crore funding claim with viral statementIn a statement that's equal parts denial and stand-up comedy set, the homegrown burger chain responded to reports that it had secured a Rs 47.15 crore investment round, calling the claims premature, misleading, and just plain wrong—at least for now."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-flat-nifty-below-25000-ril-reliance-shares-falls-2-percent-2758766-2025-07-21",
      "headline": "Sensex opens flat, Nifty below 25,000; RIL falls 2%The S&P BSE Sensex was down by 130.29 points to 81,627.44, while the NSE Nifty50 lost 48.95 points to 24,919.45 as of 9:22 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/coindcx-hacked-usd-44-million-lost-cyberattack-what-crypto-platform-said-user-money-wallet-2758748-2025-07-21",
      "headline": "CoinDCX loses $44 million in cyberattack: Here's what the crypto platform saidThis is the second large-scale hack involving an Indian crypto exchange in the past year. In July 2024, WazirX lost $234 million when one of its wallets hosted on Liminal was compromised."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/anthem-biosciences-ipo-listing-share-price-strong-market-debut-nse-bse-check-gmp-2758737-2025-07-21",
      "headline": "Anthem Biosciences IPO listing: Shares to make strong market debut? Check GMPAnthem Biosciences share price: The IPO opened for subscription between July 14 and July 16, and was subscribed 67.42 times in total. Highest demand came from qualified institutional buyers (QIBs), who bid 192.80 times the reserved portion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/standard-not-met-what-astronomer-said-on-ceo-andy-byron-kristine-cabot-coldplay-kiss-cam-scandal-2758498-2025-07-20",
      "headline": "Standard not met: What Astronomer said on CEO Andy Byron's Coldplay kiss cam rowAstronomer responded to the viral video by placing CEO Andy Byron on leave, later confirming his resignation after stating that leadership standards had not been met. The company emphasised its commitment to accountability and the core values it was founded on."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-rich-are-swapping-gold-for-bitcoin-here-is-why-gold-vs-bitcoin-2758472-2025-07-20",
      "headline": "India's rich are swapping gold for bitcoin. Here's WhyNow-a-days more of India's rich are putting a slice of their gold-backed wealth into shiny new digital coins like Bitcoin."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/astronomer-ceo-andy-byron-quits-after-coldplay-kiss-cam-scandal-2758451-2025-07-20",
      "headline": "Astronomer CEO Andy Byron quits after Coldplay kiss cam scandalDataOps firm Astronomer's CEO, Andy Byron, has resigned following a scandal at a Coldplay concert which also involved the firm's HR head, Kristen Cabot. In a statement, the company announced the board of directors had accepted the resignation, stating that \"the company's standard wasn't met.\" The New York-based unicorn company, founded in 2018, confirmed that a search for a new CEO is underway. The resignation followed a board-initiated investigation after an incident at a Coldplay event involving the CEO went viral. The board said that leaders are expected to set the standard in conduct and accountability. There has been no official update regarding any action taken against the HR head, Kristen Cabot, who is the Chief People's Officer at the company."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/andy-byron-astronomer-ceo-caught-in-coldplay-kiss-cam-scandal-resigns-glbs-2758389-2025-07-20",
      "headline": "Andy Byron, Astronomer CEO caught in Coldplay kiss cam scandal, resignsAndy Byron resigns as CEO of AI firm Astronomer after a viral 'kiss cam' video with HR chief Kristin Cabot sparked online speculation and prompted an internal review by the company."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/shloka-ambani-interview-she-shares-what-keeps-her-going-career-kids-and-cause-2758378-2025-07-19",
      "headline": "Career, kids and a cause: Shloka Ambani shares what keeps her goingIn a heart-to-heart on Masoom Minawala's podcast, Shloka opened up about her journey—balancing kids, career, and a cause she truly believes in."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/astronomer-ceo-andy-byron-cpo-kristin-cabot-leave-coldplay-concert-video-investigation-statement-2758075-2025-07-19",
      "headline": "Astronomer CEO, HR head sent on leave after Coldplay kiss cam outs 'affair'The company issued an official statement two days after the incident, announcing that its board had initiated an internal investigation. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/lady-gaga-tumbles-mid-performance-meyhem-ball-tour-las-vegas-2759672-2025-07-22",
      "headline": "Lady Gaga tumbles mid-performance during Mayhem Ball Tour in Las VegasThe iconic singer fell awkwardly after her cameraman nearly lost his balance. Watch the video. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-restores-fathers-vintage-triumph-tiger-100-2759647-2025-07-22",
      "headline": "Salman Khan restores vintage Triumph bike bought by father Salim Khan in 1956Salman Khan shares a heartfelt story about restoring his father's first bike, a Triumph Tiger 100, from a Hyderabad junkyard."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dulquer-salmaan-to-distribute-raj-b-shetty-su-from-so-in-malayalam-2759654-2025-07-22",
      "headline": "Dulquer Salmaan to distribute Raj B Shetty's Su From So in MalayalamMalayalam actor Dulquer Salman will be distributing the Malayalam dubbed version of Kannada film 'Su From So' under his banner, Wayfarer Films. 'Su From So' has been produced under Kannada actor Raj B Shetty's Lighter Buddha Films."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-breaks-silence-on-rumours-of-making-a-film-on-meghalaya-murder-case-2759643-2025-07-22",
      "headline": "Aamir Khan breaks silence on rumours of making a film on Meghalaya murder caseAamir Khan clarifies he is not working on a film about a recent murder case in Meghalaya, dismissing circulating rumours. The actor addressed speculation in an interview, stating such reports are unfounded."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/son-of-sardaar-2-duja-trailer-ajay-devgn-caught-between-love-mafia-and-mayhem-2759603-2025-07-22",
      "headline": "Son of Sardaar 2 duja trailer: Ajay Devgn caught between love, mafia and mayhemA new trailer for actor Ajay Devgn's 'Son of Sardaar 2' was released on Wednesday. It offers a deeper look into the comedic chaos surrounding Jassi's life. The film also stars Neeru Bajwa, Mrunal Thakur, Deepak Dobriyal and Ravi Kishan in key roles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/fatima-sana-shaikh-would-surrender-in-love-dating-bollywood-exclusive-interview-2759610-2025-07-22",
      "headline": "I would love to surrender in love: Fatima Sana Shaikh l ExclusiveActor Fatima Sana Shaikh recently opened up on what love means to her in today's world. In an interaction with India Today, she also highlighted the challenges of dating apps and the craving for genuine connection in modern times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ahaan-panday-father-chikki-panday-bailed-shah-rukh-khan-out-of-prison-2759431-2025-07-22",
      "headline": "Did you know Ahaan Panday's father Chikki once bailed SRK out of prison?Ahaan Panday's father, Chikki Panday, has shared a close friendship with Shah Rukh Khan. They've known each other for more than thirty years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/gen-z-freaks-out-over-the-love-hypothesis-casting-tom-bateman-lili-reinhart-2759469-2025-07-22",
      "headline": "Why Gen Z is freaking out over The Love Hypothesis movie castingFrom fanfiction roots to casting headlines, 'The Love Hypothesis' movie is making waves. Here's everything you need to know.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/cho-yi-hyun-cannot-get-over-choo-young-woo-shirtless-head-over-heels-2759611-2025-07-22",
      "headline": "Actor Cho Yi-hyun can't get over Choo Young-woo's shirtless charm in BTS. WatchKorean actor Cho Yi Hyun posts a fun behind-the-scenes clip featuring her shirtless co-star Choo Young Woo. The video has fans melting over their undeniable chemistry in Head Over Heels."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sanjay-dutt-wishes-wife-maanayata-on-her-47th-birthday-2759553-2025-07-22",
      "headline": "Sanjay Dutt wishes wife Maanayata on 47th birthday: My strength, my supportSanjay Dutt shared a heartfelt birthday message to his wife Maanayata on her 47th birthday, calling her his strength and support. Their children, along with Trishala Dutt, also posted loving wishes, making it a special family celebration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahavatar-narsimha-trailer-success-toy-company-rights-interest-3d-film-release-july-2025-2759564-2025-07-22",
      "headline": "Mahavatar Narasimha trailer generates buzz, toy company eyes rightsDirector Ashwin Kumar's animated film 'Mahavatar Narsimha' is set to release on July 25 and has gained traction following its trailer. A major toy company has now reportedly approached the makers for merchandising rights. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pawan-kalyan-calls-trivikram-srinivas-godsend-explains-reasons-for-choosing-remakes-2759555-2025-07-22",
      "headline": "Pawan Kalyan calls Trivikram a godsend, explains reasons for choosing remakesAs 'Hari Hara Veera Mallu Part-1' inches closer to release, Pawan Kalyan has joined the promotions. At the pre-release event in Hyderabad on July 21, the actor-politician spoke about how personal and professional challenges shaped his choices, from embracing remakes to his enduring bond with director Trivikram Srinivas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahavatar-narsimha-director-ashwin-kumar-want-to-see-hrithik-roshan-ias-nataraja-2759567-2025-07-22",
      "headline": "Mahavatar Narsimha director Ashwin Kumar: Want to see Hrithik Roshan ias NatarajaFilmmaker Ashwin Kumar is set to release his debut mythological epic 'Mahavatar Narsimha' on July 25. He also shares exciting updates on two more live-action mythological projects featuring Hrithik Roshan in a divine role."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/mohit-suri-saiyaara-sleeper-hit-revives-classic-bollywood-romance-newcomers-2759535-2025-07-22",
      "headline": "Mohit Suri says big filmmakers warned him against making a love story with newcomersMohit Suri reveals how Saiyaara became a sleeper hit despite industry doubts. The film challenges current action trends by reviving a classic romantic genre."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/why-is-saiyaara-winning-hearts-and-the-box-office-is-it-that-good-decoding-aahaan-panday-aneet-padda-film-success-among-gen-z-2759519-2025-07-22",
      "headline": "Why is Saiyaara winning hearts (and the box office)?In a world constantly chasing virality, 'Saiyaara' chooses vulnerability. It doesn't offer a spectacle - it offers sincerity. And if you are still wondering why it's working, here's what you probably don't know. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mari-selvaraj-dhanush-new-tamil-film-project-2759490-2025-07-22",
      "headline": "Director Mari Selvaraj calls film with Dhanush a milestone, filming to begin soonDuring a recent awards ceremony, director Mari Selvaraj confirmed starting work on his next project with Dhanush, after wrapping his current film 'Bison' with Dhruv Vikram. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vaani-kapoor-opens-up-about-facing-colour-bias-and-body-shaming-in-bollywood-2759521-2025-07-22",
      "headline": "Vaani Kapoor opens up about colour bias and body shaming in the film industryVaani Kapoor shared that she faced rejection early in her career due to her skin tone and was often body-shamed for being too skinny. Despite the criticism, she remains confident and is now set to lead Netflix's upcoming thriller 'Mandala Murders'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/krish-jagarlamudi-calls-pawan-kalyan-soul-and-storm-of-hhvm-shares-emotional-note-2759501-2025-07-22",
      "headline": "Director Krish calls Pawan Kalyan soul and storm of HHVM, shares emotional noteAhead of the release of the long-delayed period action drama 'Hari Hara Veera Mallu', director Krish Jagarlamudi, who helmed the initial portions of the film, shared an emotional note reflecting on his journey with the project. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/hrithik-roshan-calls-vir-das-fool-volume-the-best-stand-up-reinstalls-app-to-say-2759489-2025-07-22",
      "headline": "Hrithik Roshan calls Vir Das Fool Volume best stand-up everHrithik Roshan praised Vir Das' Netflix special 'Fool Volume', calling it the best stand-up show ever. The actor shared that he even reinstalled Instagram just to say so. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jagdeep-dhankar-resignation-vice-president-how-normal-day-turned-extraordinary-nadda-jairam-ramesh-kharge-2759531-2025-07-22",
      "headline": "Dhankhar exit: What happened between 1 pm and 4.30 pm broke the camel's backVice-President Jagdeep Dhankhar surprised one and all by resigning late Monday evening, citing health as the reason. Opposition leaders and developments of the day suggest there's more to the story than what meets the eye. What happened between 1 pm and 4.30 pm that turned a normal day into an extraordinary evening?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-india-hong-kong-delhi-flight-caught-fire-on-monday-as-passengers-were-disembarking-post-landing-all-safe-2759675-2025-07-22",
      "headline": "Air India Hong Kong-Delhi flight catches fire as passengers get off, all safeAn Air India flight coming from Hong Kong caught fire as passengers were disembarking at Delhi airport. The aircraft suffered some damage and was grounded, but all passengers were safe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/setback-for-congress-as-it-tribunal-says-no-exemption-on-income-tax-on-rs-199-crore-donations-2759618-2025-07-22",
      "headline": "No tax relief for Congress, tribunal says no exemption on Rs 199 crore donationsThe IT tribunal upheld the decision of the tax authorities, ruling that the party must pay income tax on the donations received during that financial year."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/caught-on-cctv-receptionist-kicked-dragged-by-hair-for-telling-patient-to-wait-2759695-2025-07-22",
      "headline": "Caught on CCTV: Receptionist kicked, dragged by hair for telling patient to waitMan tries to enter the doctor's cabin, when stopped by receptionist, he kicks her and drags her by the hair across the reception area."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/why-is-saiyaara-winning-hearts-and-the-box-office-is-it-that-good-decoding-aahaan-panday-aneet-padda-film-success-among-gen-z-2759519-2025-07-22",
      "headline": "Why is Saiyaara winning hearts (and the box office)?In a world constantly chasing virality, 'Saiyaara' chooses vulnerability. It doesn't offer a spectacle - it offers sincerity. And if you are still wondering why it's working, here's what you probably don't know. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/apache-power-us-made-chopper-is-indian-armys-big-move-to-control-aviation-assets-2759648-2025-07-22",
      "headline": "Apache power: US-made chopper is Indian Army's big move to control aviation assetsThe AH-64E Apache attack helicopters—nicknamed 'Flying Tank' for their heavy firepower and battlefield resilience—are to be deployed along the western front with Pakistan"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/akash-deep-ruled-out-rishabh-pant-returns-india-england-4th-test-2759665-2025-07-22",
      "headline": "Akash Deep ruled out, Kamboj likely to make Test debut: Shubman GillIndia's seamer Akash Deep has been ruled out of the 4th Test against England. Shubman Gill confirmed the news and revealed that young Anshul Kamboj was likely to make his debut in Manchester."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jagdeep-dhankhar-resigns-resignation-news-india-vice-president-vv-giri-cji-hidayatullah-nixon-visit-2759559-2025-07-22",
      "headline": "When Vice-President quit mid-term and CJI had to fill in as PresidentIn 1969, Vice-President VV Giri's resignation to run for the President's post, after President Zakir Hussain's death, created a rare situation. With both top offices vacant, Chief Justice of India, M Hidayatullah, had to step in as the acting President for over a month. The CJI, as the acting President, also hosted US President Nixon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/is-delhi-headed-for-a-big-quake-what-recent-tremors-could-be-warning-us-about-2759655-2025-07-22",
      "headline": "Delhi-NCR shaken by multiple tremors: Is a bigger earthquake coming?Delhi falls under Seismic Zone IV, indicating a high vulnerability to significant earthquakes. Beneath the city lie several fault lines, the cracks in the earth's crust that have the potential to unleash powerful tremors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/ssvm-institutions-from-cradle-to-cosmos-2754432-2025-07-11",
      "headline": "SSVM Institutions: From Cradle to CosmosForging Futures with Foresight, Flair, and Faith"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-cji-gavai-blasts-woman-demanding-rs-12-crore-mumbai-flat-bmw-alimony-2759656-2025-07-22",
      "headline": "Why don't you earn? Supreme Court on Rs 12 crore, Mumbai flat, BMW alimony demandDuring the hearing, CJI Gavai questioned the scale of her demand, stating, \"Your marriage lasted only 18 months, and now you want a BMW too? One crore every month?\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/we-are-in-shame-supreme-court-seeks-suggestions-on-empowering-girls-after-odisha-student-self-immolates-2759612-2025-07-22",
      "headline": "We are in shame: Supreme Court after Odisha student self-immolatesDescribing the Odisha self-immolation case, in which a student died over inaction on a sexual harassment complaint against her college professor, the Supreme Court sought guidelines to improve the safety of women across different fields."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/employees-welcome-client-office-dance-performance-video-telugu-mera-tera-boyfriend-divides-internet-outrage-2759629-2025-07-22",
      "headline": "Employees welcome client to office with dance performance. Video sparks outrageA now-viral video showing employees welcoming a foreign client with a dance performance at their office has sparked outrage online. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/travel/story/indian-passport-jumps-8-spots-on-global-index-visa-free-travel-now-to-59-countries-2759660-2025-07-22",
      "headline": "Indian passport sees highest climb on global index. 59 countries now visa-freeIn the latest Henley Passport Index update, India vaulted from 85th to 77th position, making it the largest mover globally over the past six months by climbing eight spots. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/diu/story/vice-president-chair-is-empty-right-now-but-who-can-fill-it-2759605-2025-07-22",
      "headline": "The Vice President's chair is empty right now, but who can fill it?Under the current strength of Parliament, the magic number to win the vice-presidential election is 392 votes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/board-of-control-for-cricket-in-india-bcci-national-sports-bill-2759600-2025-07-22",
      "headline": "BCCI to come under National Sports Bill, say sources. How will it impact it?The Board of Control for Cricket in India (BCCI) will come under the national sports bill, a top sports ministry source has confirmed to India Today on Tuesday, July 22. Here's a look at how the bill will impact the cricket body going forward. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/anand-mahindra-shares-video-of-ex-ips-officer-cleaning-chandigarh-streets-at-dawn-2759637-2025-07-22",
      "headline": "Anand Mahindra shares video of ex-IPS officer, 88, cleaning Chandigarh streets at dawnIn a post on X, Anand Mahindra shared a video of 88-year-old retired IPS officer Inderjit Singh Sidhu cleaning Chandigarh streets at dawn. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/madhya-pradesh-rattled-by-spate-of-love-jihad-cases-what-police-found-2759593-2025-07-22",
      "headline": "Madhya Pradesh rattled by spate of 'love jihad' cases: What police foundGyms in the state are the new communal battlegrounds, with some Hindu groups demanding that Hindu women be trained only by members of their community"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/is-food-incompatibility-between-vegetarians-and-non-vegetarians-a-deal-breaker-in-relationships-2759549-2025-07-22",
      "headline": "Is food incompatibility a deal-breaker in relationships?In India, food preferences go way beyond vegetarian or non-vegetarian. From 'egg in cake is fine' to 'no meat on Mondays', these choices can shake up your dating life, especially if you're part of the swipe-right generation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-narendra-modi-uk-visit-july-23-trade-deal-fugitives-extradition-khalistani-extremism-2759652-2025-07-22",
      "headline": "Khalistanis, extradition of fugitives: What's on agenda for PM's UK visitForeign Secretary Vikram Misri, during a press conference on Prime Minister Modi's upcoming visit to the UK, said that in addition to discussions on the trade agreement, issues such as the presence of Khalistanis and extradition of fugitives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/fatima-sana-shaikh-would-surrender-in-love-dating-bollywood-exclusive-interview-2759610-2025-07-22",
      "headline": "I would love to surrender in love: Fatima Sana Shaikh l ExclusiveActor Fatima Sana Shaikh recently opened up on what love means to her in today's world. In an interaction with India Today, she also highlighted the challenges of dating apps and the craving for genuine connection in modern times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/from-agra-space-arvi-bahal-fly-on-blue-origin-ns-34-mission-karman-line-jeff-bezos-space-company-russel-pitchford-2759588-2025-07-22",
      "headline": "From Agra to edge of space: Arvi Bahal to fly on Bezos' Blue Origin spaceflightAn India-born businessman, Arvi Bahal, is set to fly to space aboard Blue Origin's NS-34 mission, the 14th human flight of the New Shepard programme. Part of a six-member international crew, Bahal is a real estate investor and adventurous traveller who holds a private pilot's licence."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jagdeep-dhankhar-collapsed-during-an-event-in-delhi-rajya-sabha-parliament-vice-president-resignation-lok-sabha-monsoon-2759496-2025-07-22",
      "headline": "Jagdeep Dhankhar collapsed at Delhi event days before shock resignation: SourcesJagdeep Dhankhar had collapsed during an event in Delhi on July 17, days before his resignation as Vice President citing health reasons, sources said."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/lucknow/story/uttar-pradesh-police-solve-lucknow-coconut-water-seller-murder-decade-old-revenge-arrests-2759619-2025-07-22",
      "headline": "A neighbour insulted his mother. He waited 10 years to take revengeThe motive traces back to an incident in their former neighborhood, where Manoj and his family allegedly insulted and assaulted the accused's mother. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/avatar-fire-and-ash-trailer-debuts-cinemas-fantastic-four-screenings-2759676-2025-07-22",
      "headline": "Avatar: Fire and Ash trailer to premiere in theatres before Fantastic FourThe trailer for 'Avatar: Fire and Ash' will be shown exclusively with 'The Fantastic Four: First Steps'. It will offer a glimpse into the new Na'vi tribes and their conflicts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-restores-fathers-vintage-triumph-tiger-100-2759647-2025-07-22",
      "headline": "Salman Khan restores vintage Triumph bike bought by father Salim Khan in 1956Salman Khan shares a heartfelt story about restoring his father's first bike, a Triumph Tiger 100, from a Hyderabad junkyard."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dulquer-salmaan-to-distribute-raj-b-shetty-su-from-so-in-malayalam-2759654-2025-07-22",
      "headline": "Dulquer Salmaan to distribute Raj B Shetty's Su From So in MalayalamMalayalam actor Dulquer Salman will be distributing the Malayalam dubbed version of Kannada film 'Su From So' under his banner, Wayfarer Films. 'Su From So' has been produced under Kannada actor Raj B Shetty's Lighter Buddha Films."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-breaks-silence-on-rumours-of-making-a-film-on-meghalaya-murder-case-2759643-2025-07-22",
      "headline": "Aamir Khan breaks silence on rumours of making a film on Meghalaya murder caseAamir Khan clarifies he is not working on a film about a recent murder case in Meghalaya, dismissing circulating rumours. The actor addressed speculation in an interview, stating such reports are unfounded."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-manchester-test-shubman-gill-lords-controversy-reaction-2759686-2025-07-22",
      "headline": "Gill sticks his ground on 3rd Test controversy: It didn't come out of nowhereIndia captain Shubman Gill stood his ground regarding the Lord's Test controversy and blasted England for their time-wasting antics ahead of the fourth match of the series. Gill had a heated run-in with England openers Zak Crawley and Ben Duckett. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/akash-deep-ruled-out-rishabh-pant-returns-india-england-4th-test-2759665-2025-07-22",
      "headline": "Akash Deep ruled out, Kamboj likely to make Test debut: Shubman GillIndia's seamer Akash Deep has been ruled out of the 4th Test against England. Shubman Gill confirmed the news and revealed that young Anshul Kamboj was likely to make his debut in Manchester."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-4th-test-weather-forecast-manchester-rain-2759666-2025-07-22",
      "headline": "IND vs ENG, 4th Test Weather forecast: Will rain spoil Gill's redemption plan?India head into the fourth Test at Old Trafford with the series on the line and rain looming large. With weather likely to disrupt play, Shubman Gill faces a stern test in fighting for the fate of his captaincy debut series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-manchester-test-ben-stokes-sledging-battle-2759658-2025-07-22",
      "headline": "England won't start sledging on purpose, but won't back down either: Ben StokesEngland captain Ben Stokes has issued a warning to India ahead of the Manchester Test. He emphasised that while England won't seek sledging battles, they won't back down from confrontations either."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/board-of-control-for-cricket-in-india-bcci-national-sports-bill-2759600-2025-07-22",
      "headline": "BCCI to come under National Sports Bill, say sources. How will it impact it?The Board of Control for Cricket in India (BCCI) will come under the national sports bill, a top sports ministry source has confirmed to India Today on Tuesday, July 22. Here's a look at how the bill will impact the cricket body going forward. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sarfaraz-khan-body-transformation-diet-naushad-khan-reveals-2759583-2025-07-22",
      "headline": "No roti and rice: Inside Sarfaraz Khan's incredible body transformationSarfaraz Khan's father revealed the strict diet plan the 27-year-old has been following as he has shed close to 17 kilos over the course of the past two months. Sarfaraz is aiming to continue to work on his physique in a bid to return to the Indian team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/venus-williams-washington-open-doubles-2759542-2025-07-22",
      "headline": "45-year-old Venus Williams makes stunning comeback in Washington OpenWashington Open: Venus Williams and Hailey Baptiste defeated Eugenie Bouchard and Clervie Ngounoue 6-3, 6-1 in the Round of 16 of the women's doubles on Monday. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/china-open-hs-prannoy-advances-five-match-points-lakshya-sen-exits-2759514-2025-07-22",
      "headline": "HS Prannoy advances after saving five match points, Lakshya Sen exitsIndian shuttler HS Prannoy saved five match points and clawed his way back from a game down to beat Japan's Koki Watanabe in the opening round of the China Open Super 1000 badminton tournament on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/board-of-control-for-cricket-in-india-bcci-national-sports-bill-2759600-2025-07-22",
      "headline": "BCCI to come under National Sports Bill, say sources. How will it impact it?The Board of Control for Cricket in India (BCCI) will come under the national sports bill, a top sports ministry source has confirmed to India Today on Tuesday, July 22. Here's a look at how the bill will impact the cricket body going forward. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sarfaraz-khan-body-transformation-diet-naushad-khan-reveals-2759583-2025-07-22",
      "headline": "No roti and rice: Inside Sarfaraz Khan's incredible body transformationSarfaraz Khan's father revealed the strict diet plan the 27-year-old has been following as he has shed close to 17 kilos over the course of the past two months. Sarfaraz is aiming to continue to work on his physique in a bid to return to the Indian team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/venus-williams-washington-open-doubles-2759542-2025-07-22",
      "headline": "45-year-old Venus Williams makes stunning comeback in Washington OpenWashington Open: Venus Williams and Hailey Baptiste defeated Eugenie Bouchard and Clervie Ngounoue 6-3, 6-1 in the Round of 16 of the women's doubles on Monday. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/china-open-hs-prannoy-advances-five-match-points-lakshya-sen-exits-2759514-2025-07-22",
      "headline": "HS Prannoy advances after saving five match points, Lakshya Sen exitsIndian shuttler HS Prannoy saved five match points and clawed his way back from a game down to beat Japan's Koki Watanabe in the opening round of the China Open Super 1000 badminton tournament on Tuesday."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}