{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-ipo-stock-market-listing-ipo-latest-gmp-what-to-expect-2620506-2024-10-21",
      "headline": "Hyundai IPO GMP improves slightly ahead of market listing. What to expect?Hyundai stock market listing: The initial public offering, which opened on October 15, has seen a rollercoaster ride in terms of investor interest and grey market performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/manappuram-finance-shares-drop-5-percent-today-24-percent-in-8-days-what-is-behind-the-fall-2620496-2024-10-21",
      "headline": "Manappuram Finance shares drop 5% today, 24% in 8 days: What's behind fall?The shares of Manappuram Finance hit a low of Rs 145.50, marking a decline of nearly 24% over the past eight trading sessions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/no-gst-on-life-and-health-insurance-how-it-will-impact-you-expert-view-2620423-2024-10-21",
      "headline": "No GST on life and health insurance? Here's how it will impact youThis change, if implemented, could bring relief to policyholders and support the insurance sector by lowering the costs of these essential services."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-consumer-products-share-price-down-7-percent-weak-q2-growth-concerns-brokerage-views-explained-2620405-2024-10-21",
      "headline": "Tata Consumer Products shares plunge over 7% today. Here's whyTata Consumer Products share price: At 1:27 pm, the stock was trading at Rs 1015.85 on the Bombay Stock Exchange (BSE), down by 7.2%, as investors reacted to its muted performance.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbl-bank-share-price-declines-q2-results-analyst-brokerage-views-2620396-2024-10-21",
      "headline": "RBL Bank shares crash 15% after Q2 results: What analysts are sayingRBL Bank share price: The private lender's shares plunged in intraday trading following the release of its Q2 FY25 earnings over the weekend."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-share-price-expectation-check-latest-gmp-before-dalal-street-debut-2620389-2024-10-21",
      "headline": "Hyundai Motor India share price expectation: Check latest gmp before D-Street debut Hyundai Motor India IPO: The public issue opened on October 15, was initially met with hesitation from investors, but by the close on Thursday, October 17, 2024, it had been subscribed more than twice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/kotak-mahindra-bank-share-price-decline-q2-results-nim-asset-quarlity-concerns-2620383-2024-10-21",
      "headline": "Explained: Why Kotak Mahindra Bank shares plunged 7% after Q2 resultsAt 1:02 pm, Kotak Mahindra Bank shares were down 5.18% to Rs 1,773 on the Bombay Stock Exchange."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/axis-bank-share-price-down-marginally-q2-results-good-time-to-buy-brokerage-target-price-2620335-2024-10-21",
      "headline": "Axis Bank shares dip slightly today after strong Q2 gains. Good time to buy? Despite a strong Q2, analysts are divided on Axis Bank's future prospects. Many brokerages have adjusted their target prices, reflecting a cautious outlook on the bank's near-term growth trajectory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/waaree-energies-ipo-opens-for-bidding-should-you-subscribe-skip-review-analyst-view-2620334-2024-10-21",
      "headline": "Waaree Energies IPO opens for bidding: Should you subscribe? Check latest GMPThe Waaree Energies IPO consists of a fresh issue of 2.4 crore shares, amounting to Rs 3,600 crore, along with an offer for sale of 0.48 crore shares, totalling Rs 721.44 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wipro-share-price-gains-early-trade-q2-results-what-investors-need-to-know-2620322-2024-10-21",
      "headline": "Wipro shares gain 1% in early trade. What investors need to knowThe stock's rise comes after Wipro posted better-than-expected Q2 results, including a 21.3% year-on-year (YoY) increase in net profit to Rs 3,209 crore and the announcement of a 1:1 bonus issue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adar-poonawalla-serene-production-acquires-50-percent-stake-in-karan-johar-dharma-productions-rs-1000-crore-2620307-2024-10-21",
      "headline": "Adar Poonawalla acquires 50% stake in Karan Johar's Dharma ProductionsKaran Johar's Dharma Productions sells 50% stake to Adar Poonawalla: The deal, valued at Rs 1,000 crore, will see Poonawalla's Serene Production acquire a 50% stake in the renowned production house, with Johar retaining the remaining 50%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-marginally-lower-dragged-by-fmcg-stocks-hdfc-bank-2620301-2024-10-21",
      "headline": "Sensex, Nifty open marginally lower dragged by FMCG stocks; HDFC Bank up 3%The S&P BSE Sensex was down 70.87 points to 81,153.88, while the NSE Nifty50 lost 58.90 points to 24,795.15 "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/domestic-mutual-funds-boost-paytm-stake-by-1-this-quarter-total-holdings-now-at-8-2620108-2024-10-20",
      "headline": "Domestic mutual funds boost Paytm stake by 1% this quarter, total holdings now at 8%The latest shareholding pattern filed by the company shows a 1% increase in stake by mutual funds as the trust grows on the brand and its ability to bounce back. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/succession-wars-how-betrayal-murder-greed-tore-apart-house-of-gucci-maurizio-tom-ford-2619906-2024-10-20",
      "headline": "Succession Wars: How betrayal, murder and greed tore apart 'House of Gucci'Maurizio Gucci's quest to perfect the family empire ended in four gunshots on March 27, 1995, on the steps of his Milan office."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/isha-ambani-is-harpers-bazaar-icon-of-the-year-dedicates-award-to-mother-daughter-2619809-2024-10-19",
      "headline": "Isha Ambani is Harper's Bazaar Icon of the Year, dedicates award to mother, daughterIsha Ambani dedicated the award to her mother, Nita Ambani, the Chairperson of Reliance Foundation. Isha said her mother is her role model who has \"paved the way for me\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-packaged-water-and-bicycles-senior-citizens-health-insurance-2619791-2024-10-19",
      "headline": "Centre recommends reducing GST on packaged water and bicycles below Rs 10,000The Group of Ministers (GoM) to decide on GST on health and life insurance premiums in its meeting on Saturday decided to exempt GST on premiums paid by individuals, other than senior citizens, for health insurance with coverage of up to Rs 5 lakh."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/vasundhra-oswal-detailed-uganda-india-businessman-oswal-group-2619747-2024-10-19",
      "headline": "Who is Vasundhara Oswal, daughter of Indian billionaire, detained in Uganda?Vasundhara Oswal was reportedly seized by a group of 20 armed men at the family's extra neutral alcohol (ENA) plant. Local officials have connected her arrest to an ongoing investigation into the case of a missing person."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdfc-bank-q2-financial-results-net-profit-rises-5-percent-to-rs-16820-crore-2619683-2024-10-19",
      "headline": "HDFC Bank Q2 results: Net profit rises 5% to Rs 16,820 croreHDFC Bank's net interest income (NII), a key measure of profitability, came in at Rs 30,114 crore, reflecting a 10% year-on-year increase, although slightly below the market expectation of Rs 30,306 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/karnataka-impose-cess-zomato-swiggy-uber-oia-payments-support-gig-workers-bill-passed-december-2619633-2024-10-19",
      "headline": "Karnataka to impose cess on Zomato, Uber, payments to support gig workersKarnataka Labour Minister Santosh Lad said that the charge would be levied only on transport and not on the purchase of products. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-chinaagreement-line-of-actual-control-issues-restart-patrolling-foreign-secretary-vikram-misri-2620465-2024-10-21",
      "headline": "India, China agree to patrolling along 'LAC leading to disengagement'Foreign Secretary Vikram Misri announced on Monday, that India and China have reached an agreement to disengage along the border and resume patrolling of the Line of Actual Control (LAC). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/samajwadi-party-mp-ram-gopal-yadav-abuses-chief-justice-dy-chandrachud-on-camera-controversy-2620433-2024-10-21",
      "headline": "Samajwadi MP Ram Gopal Yadav abuses Chief Justice on camera, sparks huge rowRam Gopal Yadav used a cuss word for Chief Justice DY Chandrachud when asked to react to the latter's 'prayed to God' remark made in reference to the Ayodhya case."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/union-aviation-minister-ram-mohan-naidu-hoax-bomb-threat-calls-cognisable-offence-perpetrators-nofly-list-2620414-2024-10-21",
      "headline": "Hoax calls to be made cognisable offence, situation sensitive: Aviation MinisterMaking hoax bomb threat calls to airlines will be classified as a cognizable offense, and the perpetrators will be placed on airlines' no-fly lists, Civil Aviation Minister Ram Mohan Naidu said."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/india-canada-row-cooperating-us-pannun-case-contrast-response-nijjar-probe-allegation-justin-trudeau-2620417-2024-10-21",
      "headline": "Why India is cooperating with US in Pannun case but not in Canada's Nijjar probeThe US and Canada look to be coordinating their probes into the alleged role of India-linked agents in the plot against two Khalistani terrorists. While India is cooperating with the US in the Gurpatwant Singh Pannun probe, it has rejected Canada's charges in the Hardeep Singh Nijjar case. This is why India is taking divergent stances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-on-shooting-bigg-boss-18-amid-death-threats-2620310-2024-10-21",
      "headline": "Salman Khan raps Bigg Boss contestants: I'm going through lot in life and yet…Salman Khan discussed hosting Bigg Boss 18 while dealing with a lot on the personal front. He told the contestants that although he didn't want to come for the shoot, he was there due to his commitments."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/chief-justice-dy-chandrachud-ayodhya-babri-masjid-supreme-court-verdict-prayed-to-god-2620363-2024-10-21",
      "headline": "Congress leader on Chief Justice's Ayodhya dispute remarks: Had he prayed for...Chief Justice DY Chandrachud mentioned that he sat before God and asked for a solution to the Ram Janmabhoomi-Babri Masjid case when it was before a Supreme Court bench of which he was a member."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/canada-news/story/canada-spy-agency-mole-1985-kanishka-bombing-air-india-flight-rcmp-report-justin-trudeaj-hardeep-singh-nijjar-2618683-2024-10-21",
      "headline": "Canada spy agency pulled out its mole just ahead of Air India Kanishka bombingEven as Gurpatwant Singh Pannun, a Khalistani terrorist and American-Canadian citizen, issued threats to Air India planes, a report from 2003 shows how Canadian spy agency CSIS had a mole among Khalistanis, and could have prevented the 1985 Kanishka bombing. Instead, the CSIS pulled out the mole just ahead of the bombing that killed 329 people."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ganderbal-terror-attack-jammu-and-kashmir-pakistan-trf-lashkar-offshoot-migrants-doctor-killed-2620245-2024-10-21",
      "headline": "Pak-based Lashkar front claims J&K attack that killed doctor, 6 others: SourcesPakistan-based The Resistance Front, LeT's offshoot, carried out the attack in Ganderbal, killing seven people, thereby targeting both Kashmiris and non-Kashmiris for the first time."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/gurugram-man-zomato-hyperpure-selling-fake-paneer-analogue-viral-post-2620445-2024-10-21",
      "headline": "Gurugram man's post on Zomato Hyperpure selling 'fake paneer' goes viralA Gurugram man has accused Zomato Hyperpure of selling \"fake paneer\" to restaurants in a post on X.   "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/iit-delhis-technology-ai-leadership-programme-shaping-the-future-of-tech-leadership-2616457-2024-10-14",
      "headline": "IIT Delhi's Technology & AI Leadership Programme: Shaping the Future of Tech LeadershipAdvance your career with IIT Delhi's Technology & AI Leadership Programme. Designed for aspiring tech leaders, this programme offers cutting-edge insights, practical experience, and strategic acumen to navigate the digital era. Gain the skills to drive innovation, lead digital transformations, and position yourself as a visionary in technology leadership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/australian-senator-lidia-thorpe-king-charles-parliament-great-hall-canberra-visit-anti-colonial-slogans-2620338-2024-10-21",
      "headline": "Not my king: Australian senator heckles King Charles at parliament, escorted outKing Charles, on a visit to Australia, was heckled by Indigenous Australian senator Lidia Thorpe, who shouted anti-colonial slogans in the parliament. Thorpe is known to be a fierce opponent of monarchy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/no-gst-on-life-and-health-insurance-how-it-will-impact-you-expert-view-2620423-2024-10-21",
      "headline": "No GST on life and health insurance? Here's how it will impact youThis change, if implemented, could bring relief to policyholders and support the insurance sector by lowering the costs of these essential services."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/chennai-beaches-lit-up-by-enchanting-bioluminescence-what-is-it-2620477-2024-10-21",
      "headline": "Chennai beaches lit up by enchanting bioluminescence: What is it?Bioluminescence is a natural phenomenon produced by certain marine organisms, primarily microscopic plankton called dinoflagellates. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/khalistani-terrorist-gurpatwant-pannun-fresh-warning-international-passengers-dont-fly-air-india-2620288-2024-10-21",
      "headline": "Don't fly Air India from November 1-19: Khalistani terrorist Pannun's new threatKhalistani terrorist Gurpatwant Singh Pannun warned of an attack on Air India between November 1 and 19, citing the 40th anniversary of the anti-Sikh riots."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-bbc-documentary-pm-india-modi-question-ban-2620435-2024-10-21",
      "headline": "Supreme Court adjourns hearing on BBC documentary on PM Modi till January 2025A bench of Justices Sanjiv Khanna and Sanjay Kumar adjourned the case to January 2025 since a counter affidavit by the Centre has not yet been recorded."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adar-poonawalla-serene-production-acquires-50-percent-stake-in-karan-johar-dharma-productions-rs-1000-crore-2620307-2024-10-21",
      "headline": "Adar Poonawalla acquires 50% stake in Karan Johar's Dharma ProductionsKaran Johar's Dharma Productions sells 50% stake to Adar Poonawalla: The deal, valued at Rs 1,000 crore, will see Poonawalla's Serene Production acquire a 50% stake in the renowned production house, with Johar retaining the remaining 50%."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sunny-leone-shines-as-a-bride-on-the-ramp-but-her-children-steal-the-spotlight-watch-video-2620456-2024-10-21",
      "headline": "Sunny Leone shines as a bride on the ramp, but her children steal the spotlightSunny Leone dazzled as a bride on the ramp at the latest fashion show. She was joined by her three children and husband Daniel, who gave her the loudest cheer. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-school-blast-crpf-school-police-fir-explosives-nature-investigation-wall-hole-2620276-2024-10-21",
      "headline": "Blast created hole in Delhi school wall, nature of explosives under probe: ReportThe explosion outside a CRPF school in Delhi on Sunday created a large hole in the school wall due to its impact and the nature of explosives used in the blast was under investigation, as per an FIR filed over the incident."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/will-amit-thackeray-join-the-electoral-fray-2620121-2024-10-20",
      "headline": "Will Amit Thackeray join the electoral fray?MNS founder Raj Thackeray's son may be the next man to break an unwritten convention of the late Shiv Sena supremo Bal Thackeray's clan"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/elon-musk-says-spacex-was-forced-to-kindnap-seals-experiment-on-them-2620325-2024-10-21",
      "headline": "SpaceX was forced to kidnap seals, experiment on them: Elon MuskThe experiment, which Musk insists actually took place, was reportedly conducted to address concerns about the effect of sonic booms from rocket launches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/new-launches/story/jeep-meridian-2025-launched-at-rs-2499-lakh-toyota-fortuner-and-mg-gloster-rival-2620455-2024-10-21",
      "headline": "Jeep Meridian 2025 launched at Rs 24.99 lakhJeep Meridian 2025 is available in Longitude, Longitude Plus, Limited (O) and Overland trims."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/new-zealand-dunedin-airport-south-island-hugging-three-minute-rule-2620331-2024-10-21",
      "headline": "Inhumane: New Zealand airport slammed over 3-minute time limit for farewell hugsHugging your loved ones could get you in trouble at a New Zealand airport, where a time limit has been imposed on emotional farewells."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/jaipur/story/jaipur-couple-dies-by-suicide-after-spat-over-husband-coming-late-on-karwa-chauth-2620407-2024-10-21",
      "headline": "Jaipur woman dies by suicide after spat on Karwa Chauth, husband also kills selfAn argument broke out between the couple after the husband reached home late on Karwa Chauth, following which the wife died by suicide. Distributed by the wife's death, the husband also hanged himself with her saree."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/yahya-israel-sinwar-house-video-footage-tunnel-hamas-leader-killed-gaza-israel-palestine-attack-2620239-2024-10-21",
      "headline": "Cash, personal shower, UN ration supplies: Inside Yahya Sinwar's bunker in GazaAccording to a video released by Israel, the bunker where Yahya Sinwar stayed was fully stocked with UN food supplies, substantial amounts of cash, perfume, and various personal facilities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kartik-aaryan-promotes-bhool-bhulaiyaa-3-at-dj-alan-walkers-concert-2620489-2024-10-21",
      "headline": "Watch: Kartik Aaryan promotes Bhool Bhulaiyaa 3 at DJ Alan Walker's concertKartik Aaryan made a surprise appearance at DJ Alan Walker's concert in Mumbai. He promoted his upcoming film Bhool Bhulaiyaa 3. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mani-ratnam-sai-pallavi-amaran-audio-launch-sivakarthikeyan-2620490-2024-10-21",
      "headline": "Mani Ratnam to Sai Pallavi at Amaran audio launch: Hope to work with you one dayDirector Mani Ratnam was one of the chief guests at the Amaran audio launch, which was held recently. At the event, he expressed his interest in working with Sai Pallavi, who plays one of the lead roles in Amaran."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/watch-viral-video-shreya-ghoshal-surprised-sings-in-background-as-couple-gets-engaged-at-her-concert-2620458-2024-10-21",
      "headline": "Surprised Shreya Ghoshal sings in background as couple gets engaged at her concertSinger Shreya Ghoshal was left surprised by a couple who decided to get engaged at her concert in Kolkata last weekend. The entire incident was captured on a video which is now going viral on social media. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sunny-leone-shines-as-a-bride-on-the-ramp-but-her-children-steal-the-spotlight-watch-video-2620456-2024-10-21",
      "headline": "Sunny Leone shines as a bride on the ramp, but her children steal the spotlightSunny Leone dazzled as a bride on the ramp at the latest fashion show. She was joined by her three children and husband Daniel, who gave her the loudest cheer. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/border-gavaskar-trophy-steve-smith-opening-breaks-silence-2620503-2024-10-21",
      "headline": "Steve Smith breaks silence on decision to not open in Border-Gavaskar TrophyAhead of the Border-Gavaskar Trophy, it emerged that Steve Smith would not continue opening the batting for Australia and return to the No. 4 spot. The superstar batter explained how him and the team management arrived at the call. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-tests-washington-sundar-r-ashwin-fitness-aakash-chopra-2620502-2024-10-21",
      "headline": "Is R Ashwin not fully fit? Aakash Chopra reacts to Washington Sundar inclusionAakash Chopra is puzzled by Washington Sundar's sudden inclusion in the Indian cricket squad, questioning if it's due to R Ashwin's fitness issues. Sundar's recent performance in the Ranji Trophy raises eyebrows as Ashwin struggles against New Zealand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-shami-knee-injury-fitness-india-vs-australia-test-series-ranji-trophy-2620481-2024-10-21",
      "headline": "'Pain free' Mohammed Shami aims India comeback in Australia Test seriesInjured pacer Mohammed Shami said on Monday, October 21 that he is pain-free and aiming for a comeback in the Border Gavaskar Trophy against Australia. Shami said that he will play a couple of Ranji Trophy matches to get some miles in his legs.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-vs-south-africa-tests-shakib-al-hasan-fans-attacked-dhaka-sher-e-bangla-stadium-2620447-2024-10-21",
      "headline": "BAN vs SA: Shakib Al Hasan fans attacked by rival protesters in DhakaSupporters of Shakib Al Hasan clashed with rival protesters outside Dhaka's Sher-e-Bangla National Cricket Stadium. The cricketer's political ties and silence during recent unrest have fuelled public anger."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/marnus-labuschagne-virat-kohli-bgt-india-vs-australia-test-2620439-2024-10-21",
      "headline": "Labuschagne wants to bowl bouncers to Virat Kohli: What will he do? Duck it?Australia batter Marnus Labuschagne has joked that he wants to bowl bouncers to Virat Kohli. In a Channel 7 video, Marnus has challenged Kohli to face him in the upcoming India vs Australia Test series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-test-series-sarfaraz-khan-fitness-sunil-gavaskar-2620427-2024-10-21",
      "headline": "Sarfaraz Khan's batting heroics more prodigious than his waistline: Sunil GavaskarSunil Gavaskar has criticised the Indian cricket team's obsession with fitness, claiming it has led to the exclusion of talented players like Sarfaraz Khan in the past. Gavaskar argues that performance on the field should be prioritised over waist size."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/indian-super-league-kerala-blasters-fans-attacked-bottles-stones-mohammedan-sc-kolkata-2620406-2024-10-21",
      "headline": "Watch: Kerala Blasters fans pelted with bottles, stones during Mohammedan winKerala Blasters' 2-1 win over Mohammedan SC in the ISL was marred by crowd violence. Fans of the home team threw bottles and stones, causing a temporary suspension of the match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-vs-south-africa-1st-test-lowest-total-106-kagiso-rabada-2620401-2024-10-21",
      "headline": "Bangladesh bowled out for their 5th lowest Test total at homeBangladesh suffered a batting collapse on the opening day of their Test series against South Africa, recording their fifth-lowest total at home. The visitors' pace and spin attack proved too much for the hosts, marking a challenging start for new head coach Phil Simmons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/laliga-gavi-acl-injury-barcelona-return-sevilla-win-reaction-2620380-2024-10-21",
      "headline": "Gavi delighted with Barcelona return after 348-day injury layoff: Missed playingBarcelona midfielder Gavi's felt delighted to be back on the pitch as he returned after a 348-day layoff during the win over Sevilla. Gavi sustained an ACL Injury last year and was out of action until Sunday, October 20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/archery-world-cup-final-deepika-kumari-silver-medal-dhiraj-bommadevara-2620371-2024-10-21",
      "headline": "Deepika Kumari  bags her fifth silver at Archery World Cup Final; Dhiraj falls earlyArchery World Cup Final: Deepika Kumari, returning to the stage after three years, won a silver medal in the women's individual recurve category. Dhiraj Bommadevara crashed out after losing the opening round. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/formula-one-us-grand-prix-results-charles-leclerc-carlos-sainz-ferrari-one-two-austin-texas-2620357-2024-10-21",
      "headline": "Charles Leclerc wins US GP as Ferrari complete fantastic 1-2Charles Leclerc and Carlos Sainz secured a commanding 1-2 finish for Ferrari at the U.S. Grand Prix, while a tense battle between Max Verstappen and Lando Norris was decided by a contentious penalty on October 20, Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/indian-super-league-kerala-blasters-fans-attacked-bottles-stones-mohammedan-sc-kolkata-2620406-2024-10-21",
      "headline": "Watch: Kerala Blasters fans pelted with bottles, stones during Mohammedan winKerala Blasters' 2-1 win over Mohammedan SC in the ISL was marred by crowd violence. Fans of the home team threw bottles and stones, causing a temporary suspension of the match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-vs-south-africa-1st-test-lowest-total-106-kagiso-rabada-2620401-2024-10-21",
      "headline": "Bangladesh bowled out for their 5th lowest Test total at homeBangladesh suffered a batting collapse on the opening day of their Test series against South Africa, recording their fifth-lowest total at home. The visitors' pace and spin attack proved too much for the hosts, marking a challenging start for new head coach Phil Simmons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/laliga-gavi-acl-injury-barcelona-return-sevilla-win-reaction-2620380-2024-10-21",
      "headline": "Gavi delighted with Barcelona return after 348-day injury layoff: Missed playingBarcelona midfielder Gavi's felt delighted to be back on the pitch as he returned after a 348-day layoff during the win over Sevilla. Gavi sustained an ACL Injury last year and was out of action until Sunday, October 20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/archery-world-cup-final-deepika-kumari-silver-medal-dhiraj-bommadevara-2620371-2024-10-21",
      "headline": "Deepika Kumari  bags her fifth silver at Archery World Cup Final; Dhiraj falls earlyArchery World Cup Final: Deepika Kumari, returning to the stage after three years, won a silver medal in the women's individual recurve category. Dhiraj Bommadevara crashed out after losing the opening round. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/formula-one-us-grand-prix-results-charles-leclerc-carlos-sainz-ferrari-one-two-austin-texas-2620357-2024-10-21",
      "headline": "Charles Leclerc wins US GP as Ferrari complete fantastic 1-2Charles Leclerc and Carlos Sainz secured a commanding 1-2 finish for Ferrari at the U.S. Grand Prix, while a tense battle between Max Verstappen and Lando Norris was decided by a contentious penalty on October 20, Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-abdul-samad-twin-hundreds-jammu-and-kashmir-vs-odisha-2620328-2024-10-21",
      "headline": "Abdul Samad scripts history for Jammu & Kashmir with twin hundredsRanji Trophy 2024-25: 22-year-old Abdul Samad became the first Jammu and Kashmir batter to hit two hundreds in the same Ranji Trophy match. Samad's heroics has put J & K in a strong position against Odisha in their second-round match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-cheteshwar-pujara-overtakes-brian-lara-most-first-class-hundreds-2620324-2024-10-21",
      "headline": "Pujara overtakes Brian Lara in list of First Class hundredsVeteran India batter Cheteshwar Pujara has overtaken Brian Lara in the list of most first class hundreds. Pujara, while batting in the Ranji Trophy, hit his 66th FC hundred on Monday, 21 October."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-need-to-get-out-of-their-slump-gary-neville-explains-2620311-2024-10-21",
      "headline": "What do Man United need to get out of their slump? Gary Neville explainsFormer Manchester United defender Gary Neville believes that the current team can come out of its slump only if it stays together. Neville believes that the October break will help the side regroup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kagiso-rabada-300-test-wickets-fastest-south-africa-bangladesh-tour-2620306-2024-10-21",
      "headline": "Kagiso Rabada becomes 3rd fastest South African to take 300 Test wicketsBangladesh vs South Africa: Kagiso Rabada became the third-fastest South African bowler to take 300 wickets in Test cricket. He achieved the milestone on Day 1 of their first Test in Dhaka on October 21. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-amelia-kerr-primary-school-writing-new-zealand-suzie-bates-sophie-devine-2620282-2024-10-21",
      "headline": "Amelia Kerr recalls primary school essay after New Zealand's World Cup triumphT20 World Cup 2024: All-rounder Amelia Kerr said it was a dream for her to win the World Cup with legendary Suzie Bates and Sophie Devine. The 24-year-old star won the Player of the Tournament award for her all-round efforts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-new-zealand-south-africa-final-sophie-devine-suzie-bates-grandmas-2620201-2024-10-21",
      "headline": "'Grandmas' show the way for New Zealand in epic underdog storyWomen's T20 World Cup: New Zealand went into the tournament with 10 losses on the trot, but Sophie Devine and Co. raised their game just when it mattered the most. In the final, the White Ferns beat South Africa by 32 runs at the Dubai International Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-siraj-vs-akash-deep-should-india-rest-hyderabad-pacer-in-pune-test-2620261-2024-10-21",
      "headline": "Siraj vs Akash Deep: Should India rest Hyderabad pacer in Pune TestMohammed Siraj failed to impress with the new ball against New Zealand in the Bengaluru Test. The pacer was not able to pick a single wicket with the new ball on Day 5 of the Test match. Should the pacer be dropped for the Pune Test match to draft in Akash Deep?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-amelia-kerr-primary-school-writing-new-zealand-suzie-bates-sophie-devine-2620282-2024-10-21",
      "headline": "Amelia Kerr recalls primary school essay after New Zealand's World Cup triumphT20 World Cup 2024: All-rounder Amelia Kerr said it was a dream for her to win the World Cup with legendary Suzie Bates and Sophie Devine. The 24-year-old star won the Player of the Tournament award for her all-round efforts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-new-zealand-south-africa-final-sophie-devine-suzie-bates-grandmas-2620201-2024-10-21",
      "headline": "'Grandmas' show the way for New Zealand in epic underdog storyWomen's T20 World Cup: New Zealand went into the tournament with 10 losses on the trot, but Sophie Devine and Co. raised their game just when it mattered the most. In the final, the White Ferns beat South Africa by 32 runs at the Dubai International Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-siraj-vs-akash-deep-should-india-rest-hyderabad-pacer-in-pune-test-2620261-2024-10-21",
      "headline": "Siraj vs Akash Deep: Should India rest Hyderabad pacer in Pune TestMohammed Siraj failed to impress with the new ball against New Zealand in the Bengaluru Test. The pacer was not able to pick a single wicket with the new ball on Day 5 of the Test match. Should the pacer be dropped for the Pune Test match to draft in Akash Deep?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/amelia-kerr-on-guitar-new-zealand-womens-t20-world-cup-win-maori-song-2620257-2024-10-21",
      "headline": "Watch: Amelia Kerr on guitar, NZ stars celebrate World Cup win with songAmelia Kerr and the entire New Zealand women's cricket team came together to celebrate their maiden T20 World Cup victory with a stunning Maori song. ICC posted the video of the 'pitch perfect' tribute where player of the match Kerr was seen on the guitar.pitch-perfect"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-players-in-tears-as-nations-heartbreak-womens-t20-world-cup-final-2620241-2024-10-21",
      "headline": "Players in tears as South Africa's heartbreak continues in World Cup FinalSouth Africa women's team were in tears as they lost their second straight Women's T20 World Cup final. The Laura Wolvaardt team was not able to chase down 159 runs in the final against NZ on Sunday, October 20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lewandowski-pablo-torre-help-barcelona-thrash-sevilla-5-1-in-on-gavis-return-2620225-2024-10-21",
      "headline": "LaLiga: Barcelona thrash Sevilla 5-1 in on Gavi's returnFC Barcelona thrashed Sevilla 5-1 in the LaLiga restart. The team would take a lot of confidence from the win going into a tough week where they face Bayern Munich and Real Madrid."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-amelia-kerr-greatness-feature-final-2620209-2024-10-21",
      "headline": "Spunky and audacious, Amelia Kerr is destined for greatness. Period Women's T20 World Cup: Amelia Kerr played a massive role for New Zealand in claiming the title for the first time. The 24-year-old picked up 15 wickets and scored 135 runs from six games to torment oppositions in the multi-nation event. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}