{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-to-swiggy-5-big-ipos-set-to-light-up-dalal-street-before-2024-ends-ntpc-ather-energy-hdb-2606435-2024-09-25",
      "headline": "Hyundai to Swiggy: 5 big IPOs set to light up Dalal Street before 2024 endsFrom Hyundai Motors' massive offering to Swiggy's much-anticipated debut, the year's final IPOs could be the most exciting ones yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-hit-record-high-as-power-financial-stock-drive-market-rally-2606268-2024-09-25",
      "headline": "Sensex, Nifty hit record high as power and financial stock drive market rallyThe S&P BSE Sensex added 255.83 points to end at 85,169.87, while the NSE Nifty50 gained 63.75 points to close at 26,004.15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pnb-sbi-uco-canara-jm-financial-brokerage-11-psu-bank-stocks-buying-opportunities-selloff-2606209-2024-09-25",
      "headline": "PNB, SBI, UCO: JM Financial lists 11 PSU bank stocks worth buying after selloffSince reaching its 52-week high, the PSU Bank index has dropped by 15%, with banks like UCO Bank, Bank of India (BOI), Indian Overseas Bank (IOB), and Union Bank of India seeing sharper declines of 25-30%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/easy-trip-planners-easemytrip-shares-plunge-20-to-record-low-block-deal-nishant-pitti-2606182-2024-09-25",
      "headline": "Easy Trip Planners shares plunge 20% to record low. Here's what happenedThe steep decline in share price was triggered by news that promoter Nishant Pitti plans to sell 15 crore shares, representing 8.5% of the company's total share capital, in a block deal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/madhya-pradesh-gujarat-see-lowest-youth-unemployment-kerala-struggles-2606173-2024-09-25",
      "headline": " Madhya Pradesh, Gujarat see lowest youth unemployment, Kerala strugglesMadhya Pradesh and Gujarat have emerged as the best performers, boasting the lowest youth unemployment rates, while Kerala struggles with one of the highest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/coldplay-concert-ticket-mumbai-hotel-prices-surge-taj-jw-marriott-westin-2606167-2024-09-25",
      "headline": "Coldplay mania: Mumbai hotel rates up by 300% for concert weekendWith Coldplay set to perform at DY Patil Stadium on January 18-19 and 21, 2025, hotel prices in Mumbai have skyrocketed, which might leave fans scrambling for accommodation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-power-share-price-upper-circuit-5-percent-52-week-high-explained-2606115-2024-09-25",
      "headline": "Explained: Why Reliance Power shares hit 5% upper circuit today Reliance Power stock: What's behind the fresh rally? Investors are buzzing as the company makes big moves—find out what's driving the surge.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/salaried-employees-work-longer-hours-than-casual-workers-finds-survey-2606102-2024-09-25",
      "headline": "Salaried employees work longer hours than casual workers, finds surveyFor many corporate workers, these 48-hour weeks translate to roughly 9 hours of work each day if they're working five days a week, or 8 hours if it's a six-day work week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-motors-rs-25000-crore-ipo-to-hit-markets-soon-gets-sebi-nod-likely-october-2606092-2024-09-25",
      "headline": "Hyundai IPO gets Sebi clearence. Check expected listing date The company submitted its draft papers in June 2024 and the IPO may be launched as soon as October."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/krn-heat-exchanger-ipo-opens-for-bidding-details-subscribe-skip-good-bad-expert-review-listing-gains-gmp-2606061-2024-09-25",
      "headline": "KRN Heat Exchanger IPO opens for bidding: Subscribe or skip? The IPO of KRN Heat Exchanger is entirely a fresh issue of 1.55 crore shares and will be open for subscription till September 27. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-prices-today-september-25-2024-yellow-metal-trades-higher-silver-records-dip-mcx-latest-rates-2606054-2024-09-25",
      "headline": "Gold, silver price today, September 25, 2024: Yellow metal trades higher, silver records dip on MCXGold Price Today 25 September 2024: Gold is trading on the higher side while silver rates have recorded a dip on the Multi Commodity Exchange (MCX) on Wednesday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/foxconn-display-module-plant-tamil-nadu-oragadam-usd-1-billion-apple-iphone-production-report-2606044-2024-09-25",
      "headline": "Foxconn eyes $1 billion display module plant in Tamil Nadu: ReportThis will be the first display module facility Foxconn has built in India, and it is expected to mainly support the production of Apple's iPhones."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-open-flat-as-investors-take-breather-after-record-run-2606042-2024-09-25",
      "headline": "Sensex, Nifty open flat as investors take breather after record runThe S&P BSE Sensex was down 20.70 points to 84,893.34 at 10:23 am, while the NSE Nifty50 fell 18.20 points to trade at 25,922.20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/shankh-air-gets-approval-union-civil-aviation-ministry-all-you-need-to-know-about-india-new-airline-2605789-2024-09-24",
      "headline": "Shankh Air ready for takeoff: All you need to know about India's new airlineShankh Air, owned by Shankh Aviation Private Limited, has been granted a No Objection Certificate (NOC) by the ministry, valid for three years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-record-high-sensex-nifty-milestones-investor-trading-strategy-2605705-2024-09-24",
      "headline": "Sensex crosses 85,000, Nifty hits 26,000: Will bull run continue on D-Street? While Sensex and Nifty closed below record highs amid volatility, analysts remain cautiously optimistic, noting that Indian equities have defied global uncertainty to post strong gains this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-nifty-record-high-levels-tata-steel-2605624-2024-09-24",
      "headline": "Sensex, Nifty dip after hitting record highs; Tata Steel jumps 4%The Sensex settled 14.57 points lower at 84,929.25 after crossing 85,000 for the first time, while the NSE Nifty50 ended 1.35 points higher at 25,940.40 after crossing 26,000."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nps-vatsalya-expert-review-is-it-right-choice-for-parents-investment-tip-for-children-parents-2605608-2024-09-24",
      "headline": "NPS Vatsalya: Is it the right choice for parents?Unlike other financial products aimed at short-term goals like education or marriage, NPS Vatsalya focusses solely on long-term retirement savings for the child."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/western-carriers-shares-list-at-1-percent-discount-rs-170-hold-or-sell-expert-views-2605565-2024-09-24",
      "headline": "Western Carriers shares list at 1% discount. Should you hold or sell? Western Carriers market listing: The company's stock opened at Rs 170 on the BSE, which is 1.16% below its issue price of Rs 172. On the NSE, the shares listed at Rs 171, down by Rs 1, or 0.6%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/exxaro-tiles-share-price-jumps-18-percent-today-stock-split-2605552-2024-09-24",
      "headline": "Explained: Why Exxaro Tiles shares jumped over 18% todayThe company stock price rose as much as 18.4% to Rs 94.96 in early trade. At 2 pm, shares of Exxaro Tiles were trading 17.24% higher at Rs 94.25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/northern-arc-capital-ipo-stock-market-listing-share-price-hold-sell-book-profit-expert-view-2605538-2024-09-24",
      "headline": "Northern Arc Capital shares list at 33% premium over IPO price. Hold or sell?Northern Arc Capital IPO listing: The stock opened at Rs 351 on the Bombay Stock Exchange, up 33.5% from its issue price of Rs 263. Similarly, it listed at Rs 350 on the National Stock Exchange."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/supriya-sule-ncp-sharad-pawar-ajit-pawar-division-maharashtra-assembly-election-2606426-2024-09-25",
      "headline": "NCP was Ajit Pawar's to keep but he chose to disrupt our lives: Supriya SuleSpeaking about Ajit Pawar, whose rebellion led to the division of the NCP, Supriya Sule said she was happy to give the mantle of the party to him, but he chose to go the wrong way."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kangana-ranaut-farm-law-remark-rahul-gandhi-slams-pm-modi-bjp-mandi-mp-congress-2606350-2024-09-25",
      "headline": "Who is behind government policy? Rahul Gandhi on Kangana Ranaut's farm laws remarkTaking to X, the Congress leader also warned the Prime Minister that if the repealed farm laws are revived again, the entire INDIA alliance will stand against it. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/chirag-paswan-political-future-nda-alliance-caste-census-lateral-entry-bihar-election-2606473-2024-09-25",
      "headline": "Chirag Paswan on building political future: Don't want to limit myself to BiharAddressing a session at India Today Mumbai Conclave, Union Minister Chirag Paswan spoke in detail about his political aspirations, his party being part of NDA, the Assembly elections in Bihar in 2025, and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-lg-vk-saxena-urges-centre-to-link-vehicle-insurance-premiums-to-challans-2606462-2024-09-25",
      "headline": "Delhi Lt Governor proposes linking of vehicle insurance to traffic violationsDelhi Lt Governor VK Saxena urged Finance Minister Nirmala Sitharaman to link vehicle insurance premiums to traffic violations, aimed to curb reckless driving and enhance road safety. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/lab-grown-diamonds-ethical-cheaper-blood-less-so-why-arent-they-as-popular-2606175-2024-09-25",
      "headline": "Lab-grown diamonds are ethical, cheaper, blood-less. So why aren't they as popular?Celebrities like Meghan Markle, Zoe Kravitz, Lady Gaga, and even Prime Minister Narendra Modi approve of lab-grown diamonds. They are cheaper and conflict-free, but why aren't they mainstream yet?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/enforcement-directorate-ed-case-surender-panwar-congress-haryana-questioning-2606452-2024-09-25",
      "headline": "14-hour interrogation not heroic: High Court orders time limit on ED questioningThe Punjab and Haryana High Court asked the Enforcement Directorate to take measures to sensitise its officers, noting that interrogation lasting for around 15 hours in a case was \"not heroic\", rather, it is \"against the dignity of a human being."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/paracetamol-antacid-pan-d-high-shelcal-high-blood-pressure-paracetamol-drugs-fail-quality-test-2606302-2024-09-25",
      "headline": "Paracetamol among 53 drugs to fail quality test, raises safety concernsIn its latest monthly drug alert list, the Central Drugs Standards Control Organisation (CDSCO) declared 53 drugs, including paracetamol, as \"Not of Standard Quality (NSQ) Alert.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ajit-pawar-maharashtra-election-sharad-pawar-mahayuti-alliance-india-today-conclave-2606323-2024-09-25",
      "headline": "Want to become Chief Minister but always get stuck as deputy: Ajit PawarThe Maharashtra Deputy Chief Minister said the NCP had a chance to occupy the Chief Minister's post after the 2004 polls, but the party leadership gave up its claim."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/elon-musk-giorgia-meloni-dating-rumours-tesla-ceo-reacts-viral-pic-italy-pm-2606342-2024-09-25",
      "headline": "Is Elon Musk dating Giorgia Meloni? Tesla CEO reacts to viral pic with Italy PMElon Musk has reacted to dating rumours with Italian Prime Minister Giorgia Meloni after their picture went viral on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/self-defence-what-if-he-had-run-away-eknath-shinde-defends-cops-in-badlapur-encounter-at-mumbai-conclave-2606240-2024-09-25",
      "headline": "What if Badlapur sex assault accused had run away: Eknath Shinde defends copsMaharashtra Chief Minister Eknath Shinde defended the action of police who killed Akshay Shinde, the Badlapur sexual assault accused, saying they did so in self-defence else he would have escaped."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/beggars-from-pakistan-going-to-saudi-arabia-uae-international-relations-hajj-pilgrims-worried-visa-scrutiny-rejection-2606304-2024-09-25",
      "headline": "Why beggars flying to beg abroad have Pakistanis worriedThe world is flustered as beggars from Pakistan flood its cities. Saudi Arabia this week asked Pakistan to prevent beggars from misusing Umrah visas to reach the holy cities of Mecca and Medina for begging. This trend of beggars abusing visas to beg in foreign countries has Pakistan and its genuine Pakistani visa-seekers worried."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/tirupati-laddu-row-jagan-reddy-calls-for-pooja-to-clear-chandrababu-naidus-sin-2606389-2024-09-25",
      "headline": "Jagan Reddy calls for temple pooja in Andhra to cleanse Chandrababu Naidu's 'sin'YS Jagan Mohan Reddy has called for statewide poojas on September 28 to restore Tirumala's sanctity, accusing Chandrababu Naidu of defiling the revered shrine's image with false claims about its sacred laddu prasadam.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kiran-rao-fresh-faces-laapataa-ladies-worked-in-their-favour-aamir-khan-sparsh-shrivastava-2606372-2024-09-25",
      "headline": "Kiran Rao shares how fresh faces in Laapataa Ladies worked in their favourDirector Kiran Rao recently spoke about her film Laapataa Ladies and why she cast fresh faces in it. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-today-conclave-aaditya-thackeray-badlapur-encounter-eknath-shinde-apte-2606224-2024-09-25",
      "headline": "Aaditya Thackeray on Badlapur encounter: A Shinde killed to protect an Apte?Aaditya Thackeray emphasised that multiple questions surround the encounter, where Shinde was reportedly killed in retaliatory fire after allegedly opening fire on the police. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-durga-puja-hindu-temples-extortion-threat-letters-islamist-groups-2606385-2024-09-25",
      "headline": "Hindu temples in Bangladesh receive extortion threats ahead of Durga PujaHindu community members in Bangladesh's Khulna said there have been several incidents of extortion threats and vandalism of Durga idols."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/arvind-kejriwal-letter-rss-chief-mohan-bhagwat-5-questions-bjp-politics-pm-modi-2606306-2024-09-25",
      "headline": "Arvind Kejriwal's 5 questions to RSS chief Mohan Bhagwat on BJP's politicsAmong the five key questions posed to Mohan Bhagwat, Arvind Kejriwal asked whether the RSS's age limit for retirement also applies to PM Modi, who is currently 73. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mountaineers-unchartered-peak-arunachal-pradesh-6th-dalai-lama-rigzen-tsangyang-gyatso-2606373-2024-09-25",
      "headline": "Mountaineers scale unchartered peak in Arunachal, name it after 6th Dalai LamaA team from the National Institute of Mountaineering and Adventure Sports (NIMAS) successfully scaled an unnamed and unclimbed peak in the Tawang-West Kameng region and named it after the 6th Dalai Lama Rigzen Tsangyang Gyatso."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ey-employee-death-ernst-young-anna-sebastian-perayil-work-pressure-shashi-tharoor-2606312-2024-09-25",
      "headline": "Shashi Tharoor meets parents of EY employee who died, slams 'toxic work culture'Shashi Tharoor stressed the need for a proper enquiry and accountability in the death of the EY employee who suffered a heart attack, allegedly due to overwork."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-karnataka-high-court-judge-pakistan-v-srishananda-2606333-2024-09-25",
      "headline": "Answer to sunlight is more sunlight: Supreme Court raps High Court judgeThe Supreme Court, while closing proceedings on Justice V. Srishananda's remarks, stressed that transparency is key, observing, \"The answer to sunlight is more sunlight, not shutting doors or restricting court access\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iron-dome-israel-lebanon-hezbollah-cost-success-rate-what-is-it-export-us-war-gaza-hamas-pager-bombs-2605860-2024-09-25",
      "headline": "What's Iron Dome's success rate, cost of shooting down missile? 7 FAQs answeredVideos of Israel's Iron Dome shooting down rockets fired by Hezbollah and lighting up the night sky went viral. Though the Iron Dome is well known, there are some frequently asked questions (FAQs) like what is its success rate, how much does it cost to shoot down a missile, and how it feels on the ground? Here are answers to some of the FAQs.    "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/video/rekha-new-airport-look-is-just-another-proof-she-will-forever-be-a-style-icon-2606188-2024-09-25",
      "headline": "Rekha's new airport look is just another proof she will forever be a style iconRekha was clicked at the Mumbai airport this morning. She made a stylish appearance and yet again proved that she is an evergreen style icon. The actor was seen in a black ensemble with an ivory scarf wrapped around her neck. She also rocked a black turban-like headgear. It was quite reminiscent of her glam diaries in the film Khoon Bhari Maang. This was the veteran actor's rare public appearance. She was accompanied by her secretary, Farzana. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-chief-minister-siddaramaiah-muda-case-probe-bm-parvathi-flat-allotment-2606280-2024-09-25",
      "headline": "Siddaramaiah reacts as court orders Lokayukta probe in Mysuru land case: Not afraidSiddaramaiah said the matter has been referred to the Mysuru Lokayukta police by the Special Court because the complaint was lodged in Mysuru and MUDA is also located in that city."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/tirupati-tirumala-devotees-animal-beef-fat-row-srivari-laddus-sales-2606313-2024-09-25",
      "headline": "Tirupati devotees unfazed by animal fat row, 13 lakh laddus sold in 4 daysDespite nationwide outrage over the adulteration in the Tirupati laddu prasadam, the laddu sales remain unaffected. From September 20, over three lakh laddus were sold every day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bengaluru-youtuber-3-things-he-noticed-delhi-most-expensive-mall-dlf-emporio-2606249-2024-09-25",
      "headline": "Bengaluru man shares 3 observations after visiting Delhi's 'most expensive mall'A Bengaluru YouTuber shared three things he noticed after visiting Delhi's \"most expensive mall\" DLF-Emporio. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/kartik-aaryan-triptii-dimri-kiran-rao-richa-chadha-guneet-monga-stars-at-day-1-of-india-today-mumbai-conclave-2024-2606500-2024-09-25",
      "headline": "Kartik Aaryan to Triptii Dimri, stars at Day 1 of India Today Mumbai Conclave 2024India Today Mumbai Conclave 2024 hosted an array of celebrities on day one. From Triptii Dimri to Kartik Aaryan, various Bollywood luminaries attended the event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/manoj-bajpayee-on-stereotyping-directors-cannot-think-of-me-as-a-rich-and-high-society-guy-2606339-2024-09-25",
      "headline": "Manoj Bajpayee: Directors couldn't think of me as a rich, high-society guyThe versatile Manoj Bajpayee recently spoke about how most directors see him from a limited lens, and that he is never cast as a 'rich, high-society guy.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/amitabh-bachchan-electric-shock-sara-zamana-song-jacket-kbc-16-2606483-2024-09-25",
      "headline": "Big B recalls getting electric shock from his jacket in Sara Zamana songAmitabh Bachchan shares amusing anecdotes from the shoot of the song Sara Zamana from Yaarana during Kaun Banega Crorepati 16. He shared that he danced because he was getting electric shocks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/sandhya-suris-film-santosh-selected-as-uks-official-entry-for-oscars-2025-2606406-2024-09-25",
      "headline": "Sandhya Suri's film Santosh selected as UK's official entry for Oscars 2025Sandhya Suri's Santosh has been selected by the UK for the Best International Feature Film category at the 2025 Oscars. The film, starring Shahana Goswami and Sunita Rajwar, had its world premiere at Cannes."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-sumit-antil-accident-conclave-mumbai-2606481-2024-09-25",
      "headline": "Took me two years to accept myself: Paralympian Sumit recalls accidentParalympics 2024: Sumit Antil went down the memory lane to the times when he met with an accident back in 2015. The 26-year-old para-athlete bagged the gold medal in Paris with a throw of 70.59 metres, also breaking his own Paralympics record twice. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/avani-lekhara-paralympics-shooter-gold-medal-driving-car-return-accident-reveals-2606478-2024-09-25",
      "headline": "Paralympics star Avani Lekhara reveals return to driving after accidentParalympic gold medallist Avani Lekhara shared her inspiring journey of conquering her fear of driving after a life-changing accident. Avani Lekhara inspired millions after defending her 10m Air Rifle SH1 title at the 2024 Paralympics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/navdeep-singh-javelin-india-today-conclave-virat-kohli-2606461-2024-09-25",
      "headline": "People called me mini Kohli: Navdeep on viral Paralympics celebration videoParis Paralympics star Navdeep Singh recalled that people started calling him mini Virat Kohli after his celebration video went viral on social media. Navdeep won gold medal in Paralympics 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-olympiad-pm-modi-greets-enjoys-praggnanandhaa-arjun-erigaisi-watch-2606454-2024-09-25",
      "headline": "Watch: PM Modi enjoys Pragg vs Arjun chess game, hosts Olympiad winnersPrime Minister Narendra Modi hosted India's Chess Olympiad champions, celebrating their historic double victory in Budapest. PM Modi felicitated stars like D Gukesh and Divya Deshmukh, engaging with them and enjoying a special match between Praggnanandhaa and Arjun Erigaisi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/armless-archer-sheetal-devi-recalls-support-from-academy-in-heartfelt-post-2606434-2024-09-25",
      "headline": "Armless archer Sheetal Devi recalls support from academy in heartfelt postParis Paralympics bronze medallist Sheetal Devi recalled support from her academy in her early days of archery. The armless archer has been one of fan favourites since bursting onto the archery scene.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-con-2606432-2024-09-25",
      "headline": "Where is Dhoka Cup Talent? Ghulam left out of squad, Shahzad slams PCBPAK vs ENG: Ahmed Shehzad slammed PCB for leaving out Kamran Ghulam and Mohammad Ali for the opening Test against England to be held in Multan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-2nd-test-rohit-gambhir-kanpur-pitch-report-2606422-2024-09-25",
      "headline": "Rohit Sharma, Gautam Gambhir inspect Kanpur pitch ahead of 2nd TestThe Indian team went straight to training a day after reaching Kanpur on September 24. Rohit Sharma and Gautam Gambhir had a long look at the wicket ahead of the 2nd Test match against Bangladesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-kylian-mbappe-thigh-injury-club-statement-atletico-madrid-unsure-2606405-2024-09-25",
      "headline": "Real Madrid suffer big blow as in-form Kylian Mbappe suffers thing injury, club confirmsReal Madrid confirmed Kylian Mbappe's thigh injury, casting doubt over his availability for the crucial Madrid derby against Atletico. Coach Carlo Ancelotti faces the challenge of reshaping his attack amid Mbappe's uncertain recovery timeline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-deepti-sharma-veda-krishnamurthy-deadly-2606387-2024-09-25",
      "headline": "Deepti Sharma will be deadly for India in T20 World Cup: KrishnamurthyWomen's T20 World Cup 2024: Veda Krishnamurthy said that Deepti Sharma's role for India in the United Arab Emirates (UAE) will hold a lot of importance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/gxr-where-to-watch-laliga-2606378-2024-09-25",
      "headline": "GXR becomes India's leading football streaming platform with LaLiga, Serie A rightsGalaxy Racer (GXR), a leading transmedia powerhouse based in Dubai, has emerged as the home for European football fans across the Indian subcontinent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-odi-batters-ranking-rahmanullah-gurbaz-first-ever-afghanistan-batter-top-ten-2606375-2024-09-25",
      "headline": "Rahmanullah Gurbaz becomes first Afghanistan batter to enter ODI top 10Rahmanullah Gurbaz made history as the first Afghan batter to enter the ICC ODI top 10 rankings, following his match-winning performances that led Afghanistan to a historic series victory against South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-2nd-test-rohit-gambhir-kanpur-pitch-report-2606422-2024-09-25",
      "headline": "Rohit Sharma, Gautam Gambhir inspect Kanpur pitch ahead of 2nd TestThe Indian team went straight to training a day after reaching Kanpur on September 24. Rohit Sharma and Gautam Gambhir had a long look at the wicket ahead of the 2nd Test match against Bangladesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-kylian-mbappe-thigh-injury-club-statement-atletico-madrid-unsure-2606405-2024-09-25",
      "headline": "Real Madrid suffer big blow as in-form Kylian Mbappe suffers thing injury, club confirmsReal Madrid confirmed Kylian Mbappe's thigh injury, casting doubt over his availability for the crucial Madrid derby against Atletico. Coach Carlo Ancelotti faces the challenge of reshaping his attack amid Mbappe's uncertain recovery timeline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-deepti-sharma-veda-krishnamurthy-deadly-2606387-2024-09-25",
      "headline": "Deepti Sharma will be deadly for India in T20 World Cup: KrishnamurthyWomen's T20 World Cup 2024: Veda Krishnamurthy said that Deepti Sharma's role for India in the United Arab Emirates (UAE) will hold a lot of importance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/gxr-where-to-watch-laliga-2606378-2024-09-25",
      "headline": "GXR becomes India's leading football streaming platform with LaLiga, Serie A rightsGalaxy Racer (GXR), a leading transmedia powerhouse based in Dubai, has emerged as the home for European football fans across the Indian subcontinent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-odi-batters-ranking-rahmanullah-gurbaz-first-ever-afghanistan-batter-top-ten-2606375-2024-09-25",
      "headline": "Rahmanullah Gurbaz becomes first Afghanistan batter to enter ODI top 10Rahmanullah Gurbaz made history as the first Afghan batter to enter the ICC ODI top 10 rankings, following his match-winning performances that led Afghanistan to a historic series victory against South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-alyssa-healy-expectations-2606374-2024-09-25",
      "headline": "Australia going into T20 World Cup with 'no real expectations': HealyWomen's T20 World Cup: Alyssa Healy said that Australia won't go into the tournament with a lot of expectations. Australia's first match is against Sri Lanka on October 5. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shakib-al-hasan-kanpur-test-bangladesh-chandika-hathurusingha-fitness-2606298-2024-09-25",
      "headline": "Shakib is available for selection in Kanpur Test: HathurusinghaIND vs BAN: Shakib Al Hasan's position in the Bangladesh team was questioned after he failed to perform to expectations in the opening Test at the MA Chidambaram Stadium. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ind-vs-ban-is-rishabh-pant-indias-best-wicketkeeper-batter-in-tests-2606250-2024-09-25",
      "headline": "IND vs BAN: Is Rishabh Pant India's best wicketkeeper-batter in TestsRishabh Pant recently equalled MS Dhoni's record for the most number of centuries by an Indian wicketkeeper-batter in Test cricket. Has he already established himself as India's best wicketkeeper-batter in the red-ball format? Diya Kakkar and Akshay Ramesh discuss. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/border-gavaskar-trophy-india-vs-australia-steve-smith-opener-slot-deep-dasgupta-2606284-2024-09-25",
      "headline": "Steve Smith 'thinking about' opening in Border Gavaskar Trophy: Deep DasguptaDeep Dasgupta has revealed that Steve Smith is thinking about opening the batting in the Border Gavaskar Trophy against India. Smith has taken up the new role of opening in Tests after David Warner's retirement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-ban-what-happened-last-time-when-india-played-a-test-match-in-kanpur-2606277-2024-09-25",
      "headline": "IND vs BAN: What happened last time when India played a Test match in KanpurIndia is set to face Bangladesh in the 2nd Test match at the Green Park Stadium in Kanpur. Let us have a look at India's record at the stadium and what happened the last time India played here. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-city-rodri-ligament-injury-confirms-ruled-out-2606271-2024-09-25",
      "headline": "Manchester City confirm Rodri ruled out with ligament injury Manchester City confirmed Rodri's right knee ligament injury, sidelining the star midfielder for an extended period. The absence of the key player leaves Pep Guardiola rethinking his squad amidst a congested fixture schedule."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-test-rankings-new-update-rishabh-pant-virat-kohli-rohit-sharma-2606252-2024-09-25",
      "headline": "ICC Test Rankings: Rishabh Pant re-enters list in 6th, Virat Kohli out of top 10Rishabh Pant has re-entered the ICC Test rankings in the 6th spot, while Virat Kohli went out of the top 10 following the latest update in the ICC Test rankings on September 25, Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-poonam-yadav-backs-australia-india-to-reach-semis-from-group-a-2606237-2024-09-25",
      "headline": "T20 World Cup: Poonam Yadav backs Australia, India to reach semis from Group AIndia spinner Poonam Yadav believes that India and Australia will qualify for the semi-finals from Group A in the women's T20 World Cup 2024. Yadav said that Sri Lanka might pose a difficult challenge for India.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-ban-what-happened-last-time-when-india-played-a-test-match-in-kanpur-2606277-2024-09-25",
      "headline": "IND vs BAN: What happened last time when India played a Test match in KanpurIndia is set to face Bangladesh in the 2nd Test match at the Green Park Stadium in Kanpur. Let us have a look at India's record at the stadium and what happened the last time India played here. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-city-rodri-ligament-injury-confirms-ruled-out-2606271-2024-09-25",
      "headline": "Manchester City confirm Rodri ruled out with ligament injury Manchester City confirmed Rodri's right knee ligament injury, sidelining the star midfielder for an extended period. The absence of the key player leaves Pep Guardiola rethinking his squad amidst a congested fixture schedule."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-test-rankings-new-update-rishabh-pant-virat-kohli-rohit-sharma-2606252-2024-09-25",
      "headline": "ICC Test Rankings: Rishabh Pant re-enters list in 6th, Virat Kohli out of top 10Rishabh Pant has re-entered the ICC Test rankings in the 6th spot, while Virat Kohli went out of the top 10 following the latest update in the ICC Test rankings on September 25, Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-poonam-yadav-backs-australia-india-to-reach-semis-from-group-a-2606237-2024-09-25",
      "headline": "T20 World Cup: Poonam Yadav backs Australia, India to reach semis from Group AIndia spinner Poonam Yadav believes that India and Australia will qualify for the semi-finals from Group A in the women's T20 World Cup 2024. Yadav said that Sri Lanka might pose a difficult challenge for India.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/joe-root-england-greatest-batter-even-if-he-does-not-go-past-sachin-tendulkar-ian-bell-2606223-2024-09-25",
      "headline": "Root is England's greatest batter even if he does not go past Sachin: Ian BellFormer England batter Ian Bell believes Joe Root will be remembered as England's greatest batter in Test cricket, regardless of whether he surpasses Sachin Tendulkar's record. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/olympics/story/manu-bhaker-trolls-paris-olympics-medals-2606222-2024-09-25",
      "headline": "Manu Bhaker hits back at social media trolls: 'Wear my Olympic medals with pride'Olympian Manu Bhaker hit back at social media trolls who criticised her for showing off her medals in promotional events. Bhaker, in a scathing post, said that she wore the medals with pride and loved sharing her journey.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manolo-marquez-india-set-to-play-malaysia-in-november-in-international-friendly-2606215-2024-09-25",
      "headline": "Manolo Marquez' India set to play Malaysia in November in international friendlyIndia are all set to play Malaysia in an international friendly on November 19, 2024, the AIFF announced on Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/pv-sindhu-coaching-staff-finland-open-2606211-2024-09-25",
      "headline": "After Anup Sridhar, PV Sindhu adds Korean Lee Hyun-il to coaching staffIndia's star shuttler PV Sindhu bolstered her coaching staff with South Korean legend Lee Hyun-il. Sindhu appointed the former player as the interim coach till December 2024.\r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}