{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-flat-nifty-below-25000-ril-reliance-shares-falls-2-percent-2758766-2025-07-21",
      "headline": "Sensex opens flat, Nifty below 25,000; RIL falls 2%The S&P BSE Sensex was down by 130.29 points to 81,627.44, while the NSE Nifty50 lost 48.95 points to 24,919.45 as of 9:22 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/coindcx-hacked-usd-44-million-lost-cyberattack-what-crypto-platform-said-user-money-wallet-2758748-2025-07-21",
      "headline": "CoinDCX loses $44 million in cyberattack: Here's what the crypto platform saidThis is the second large-scale hack involving an Indian crypto exchange in the past year. In July 2024, WazirX lost $234 million when one of its wallets hosted on Liminal was compromised."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/anthem-biosciences-ipo-listing-share-price-strong-market-debut-nse-bse-check-gmp-2758737-2025-07-21",
      "headline": "Anthem Biosciences IPO listing: Shares to make strong market debut? Check GMPAnthem Biosciences share price: The IPO opened for subscription between July 14 and July 16, and was subscribed 67.42 times in total. Highest demand came from qualified institutional buyers (QIBs), who bid 192.80 times the reserved portion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/standard-not-met-what-astronomer-said-on-ceo-andy-byron-kristine-cabot-coldplay-kiss-cam-scandal-2758498-2025-07-20",
      "headline": "Standard not met: What Astronomer said on CEO Andy Byron's Coldplay kiss cam rowAstronomer responded to the viral video by placing CEO Andy Byron on leave, later confirming his resignation after stating that leadership standards had not been met. The company emphasised its commitment to accountability and the core values it was founded on."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-rich-are-swapping-gold-for-bitcoin-here-is-why-gold-vs-bitcoin-2758472-2025-07-20",
      "headline": "India's rich are swapping gold for bitcoin. Here's WhyNow-a-days more of India's rich are putting a slice of their gold-backed wealth into shiny new digital coins like Bitcoin."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/astronomer-ceo-andy-byron-quits-after-coldplay-kiss-cam-scandal-2758451-2025-07-20",
      "headline": "Astronomer CEO Andy Byron quits after Coldplay kiss cam scandalDataOps firm Astronomer's CEO, Andy Byron, has resigned following a scandal at a Coldplay concert which also involved the firm's HR head, Kristen Cabot. In a statement, the company announced the board of directors had accepted the resignation, stating that \"the company's standard wasn't met.\" The New York-based unicorn company, founded in 2018, confirmed that a search for a new CEO is underway. The resignation followed a board-initiated investigation after an incident at a Coldplay event involving the CEO went viral. The board said that leaders are expected to set the standard in conduct and accountability. There has been no official update regarding any action taken against the HR head, Kristen Cabot, who is the Chief People's Officer at the company."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/andy-byron-astronomer-ceo-caught-in-coldplay-kiss-cam-scandal-resigns-glbs-2758389-2025-07-20",
      "headline": "Andy Byron, Astronomer CEO caught in Coldplay kiss cam scandal, resignsAndy Byron resigns as CEO of AI firm Astronomer after a viral 'kiss cam' video with HR chief Kristin Cabot sparked online speculation and prompted an internal review by the company."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/shloka-ambani-interview-she-shares-what-keeps-her-going-career-kids-and-cause-2758378-2025-07-19",
      "headline": "Career, kids and a cause: Shloka Ambani shares what keeps her goingIn a heart-to-heart on Masoom Minawala's podcast, Shloka opened up about her journey—balancing kids, career, and a cause she truly believes in."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/astronomer-ceo-andy-byron-cpo-kristin-cabot-leave-coldplay-concert-video-investigation-statement-2758075-2025-07-19",
      "headline": "Astronomer CEO, HR head sent on leave after Coldplay kiss cam outs 'affair'The company issued an official statement two days after the incident, announcing that its board had initiated an internal investigation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-sons-forms-ai-171-memorial-trust-ex-gratia-ahmedabad-plane-crash-victims-families-2757926-2025-07-18",
      "headline": "Tata Sons forms AI 171 memorial trust, pledges Rs 1 crore to victims' familiesTata Sons has set up the AI 171 Memorial and Welfare Trust, pledging Rs 1 crore ex gratia per victim and Rs 500 crore in total, to support crash victims, families, and responders. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/sold-property-and-want-to-save-tax-this-tax-expert-suggests-a-smarter-way-2757911-2025-07-18",
      "headline": "Sold property and want to save tax? This tax expert suggests a smarter waySelling a property can bring in a tidy profit, but it also comes with a hefty tax bill. Many turn to 54EC bonds to save tax — but tax expert Sujit Bangar says there's a smarter way."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-over-500-points-lower-nifty-below-25000-axis-bank-falls-5-2757793-2025-07-18",
      "headline": "Sensex ends over 500 points lower, Nifty below 25,000; Axis Bank falls 5%The S&P BSE Sensex was down 501.51 points to 81,757.73 at the closing bell, while the NSE Nifty50 settled 143.05 points lower at 24,968.40. Most of the broader market indices also reflected the weak sentiments on Dalal Street."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/chris-martin-cheeky-warning-following-viral-kiss-cam-incident-coldplay-concert-2758735-2025-07-21",
      "headline": "Coldplay's Chris Martin issues cheeky warning following viral kiss cam incidentAfter the viral kiss cam controversy accidentally outing Astronomer CEO's affair, Coldplay lead singer Chris Martin playfully warned the concert-goers to be camera-ready. His remark came at the band's subsequent performance at Camp Randall Stadium in Madison, Martin. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-escapes-accident-misano-gt4-european-series-italy-debris-clean-up-2758733-2025-07-21",
      "headline": "Ajith Kumar's car crashes at Italy race, actor helps clean up debris. WatchActor Ajith Kumar's car crashed at Misano during the GT4 European Series. Although uninjured, the actor was seen helping the staff clean up the debris on the racetrack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saiyaara-fan-watches-film-in-theatre-with-iv-drip-mohit-suri-ahaan-panday-aneet-padda-2758721-2025-07-21",
      "headline": "Saiyaara craze hits the roof as man watches film in theatre with IV drip. WatchSaiyaara, featuring Ahaan Panday and Aneet Padda, has been ruling the theatres ever since it hit theatres. The craze for the film rose sky-high as a man watched the film in a theatre with an IV drip in his hand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/mohit-suri-copy-saiyaara-from-a-moment-to-remember-internet-thinks-2758633-2025-07-20",
      "headline": "Is Mohit Suri's Saiyaara copy of a Korean film? Internet thinks soMohit Suri's 'Saiyaara', featuring Ahaan Panday and Aneet Padda, hit cinemas on Friday. Soon after its release, viewers began drawing attention to noticeable similarities with a Korean film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-loses-patience-with-paparazzi-outside-jalsa-2758592-2025-07-20",
      "headline": "Band karo: Amitabh Bachchan loses patience with paps for filming outside JalsaAmitabh Bachchan was seen scolding paparazzi outside his home, Jalsa for filming his house. Take a look at the viral video."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-mourns-don-director-chandra-barots-death-2758579-2025-07-20",
      "headline": "Amitabh Bachchan mourns dear friend and Don director Chandra Barot's deathAmitabh Bachchan paid heartfelt tribute to his director-friend, Chandra Barot. They worked together in the cult classic 'Don'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/parineeti-chopra-raghav-chadha-leave-great-indian-kapil-sharma-show-shoot-midway-after-politicians-mother-falls-ill-2758569-2025-07-20",
      "headline": "Parineeti-Raghav leave Kapil's shoot midway after politician's mother falls illParineeti Chopra and Raghav Chadha's debut appearance on Kapil Sharma's show was unexpectedly halted due to a medical emergency involving Raghav's mother. The couple reportedly had to leave the show mid-shoot to visit the hospital. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/anirudh-ravichander-chennai-concert-postponed-overwhelming-ticket-demand-2758566-2025-07-20",
      "headline": "Anirudh Ravichander's Chennai concert postponed over overwhelming ticket demandSinger-composer Anirudh Ravichander postponed his Chennai concert due to overwhelming ticket demand. He was scheduled to perform on July 26 at Thiruvidanthai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/between-kapil-sharma-and-gong-yoo-vir-das-fool-volume-debuts-strong-on-netflix-2758539-2025-07-20",
      "headline": "Between Kapil Sharma and Gong Yoo: Vir Das's Fool Volume debuts strong on NetflixVir Das humourously celebrated his Netflix special 'Fool Volume', debuting at Number 3 in India, sandwiched between popular shows 'The Great Indian Kapil Show' and 'Squid Game: Season 3'. He shared a fun AI image caught between Kapil Sharma and Gong Yoo. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajamouli-wife-rama-watch-brad-pitt-f1-hyderabad-prasads-theatre-2758519-2025-07-20",
      "headline": "Rajamouli, wife Rama enjoy Brad Pitt's F1 at Hyderabad's Prasads theatre. WatchFilmmaker SS Rajamouli was captured watching actor Brad Pitt's 'F1 The Movie'. Videos of him leaving the theatres went viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mamata-banerjee-wishes-speedy-recovery-to-shah-rukh-khan-after-injury-2758513-2025-07-20",
      "headline": "Mamata Banerjee wishes speedy recovery to brother Shah Rukh Khan after injuryWest Bengal Chief Minister Mamata Banerjee expressed concern for Shah Rukh Khan's injury during 'King' shoot. He is currently in the UK recovering. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nick-jonas-celebrates-priyanka-chopra-43-birthday-new-post-2758500-2025-07-20",
      "headline": "Nothing brings Nick Jonas more joy than celebrating Priyanka, his new post has it allPop star Nick Jonas penned a heartfelt birthday tribute for his wife, Priyanka Chopra, accompanied by a romantic photo. The couple, who have been married since 2018, continue to serve major relationship goals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/don-director-chandra-barot-dies-of-pulmonary-disease-at-86-2758494-2025-07-20",
      "headline": "Don director Chandra Barot dies at 86, Farhan Akhtar pays tributeVeteran filmmaker Chandra Barot died at the age of 86. He was best known for his work in Amitabh Bachchan's 'Don'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/charli-xcx-marries-the-1975-george-daniel-london-town-hall-ceremony-2758485-2025-07-20",
      "headline": "Charli XCX marries The 1975's George Daniel in London town hall ceremonyPop sensation Charli XCX married George Daniel of The 1975 in an intimate ceremony held in London. The bride turned heads in a stylish white mini dress paired with her trademark sunglasses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahesh-babu-namrata-shirodkar-wish-daughter-sitara-ghattamaneni-on-birthday-just-like-that-shes-a-teenager-2758483-2025-07-20",
      "headline": "Just like that she's a teen: Mahesh Babu, Namrata wish daughter Sitara on birthdaySitara Ghattamaneni, daughter of Telugu superstar Mahesh Babu and Namrata Shirodkar, celebrated her 13th birthday surrounded by heartfelt wishes from family and fans. The teenager, already popular on social media, continues to charm the Telugu film fraternity with her growing presence and talent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vicky-kaushal-father-sham-suicidal-after-cancer-diagnosis-ready-to-jump-third-floor-2758473-2025-07-20",
      "headline": "Sham Kaushal was suicidal after cancer diagnosis: Wanted to jump from third floorActor Vicky Kaushal's father, Sham Kaushal, recalled that after undergoing surgery, his doctor had warned him he might not survive. He believes it was his prayers and faith that helped him pull through."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/parag-tyagis-emotional-post-remembers-wife-shefali-jariwala-as-beloved-maasi-2758469-2025-07-20",
      "headline": "Parag Tyagi calls Shefali Jariwala a beloved maasi in emotional postParag Tyagi continues to honour his late wife Shefali Jariwala with touching posts celebrating her loving nature and their cherished memories together. On Sunday, he shared a post remembering the best aunt that she was to her nephew and niece."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/paul-wesley-engaged-to-model-natalie-kuckenburg-after-romantic-italy-trip-2758452-2025-07-20",
      "headline": "Vampire Diaries's Paul Wesley engaged to model-girlfriend Natalie KuckenburgPaul Wesley, known for his role in 'The Vampire Diaries', is engaged to model Natalie Kuckenburg. The couple shared the news privately on Instagram during a trip to Italy, where they have reportedly been visiting since 2022."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-box-office-day-2-ahaan-panday-aneet-padda-film-shines-brighter-nears-rs-50-crore-2758434-2025-07-20",
      "headline": "Saiyaara box office Day 2: Ahaan-Aneet's film shines brighter, nears Rs 50 croreMohit Suri's 'Saiyaara' has taken the Indian box office by storm, becoming the biggest surprise hit of the year with a Rs 48.25 crore collection in just two days. The film's success without star power or heavy promotion signals a strong comeback for romantic dramas, especially among the Gen Z audience."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/parliament-monsoon-session-updates-pm-modi-speech-opposition-sindoor-trump-bihar-voter-list-2758725-2025-07-21",
      "headline": "1st Parliament session after Op Sindoor to be stormy. Trump, Bihar list in focus Live updatesThe opposition is set to corner the government over a host of issues, including US President Donald Trump's repeated claims of brokering a ceasefire with Pakistan and the Bihar voter list revision exercise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shashi-tharoor-no-longer-one-of-us-congress-leader-k-muraleedharan-barb-blows-rift-wide-open-2758659-2025-07-20",
      "headline": "Shashi Tharoor no longer one of us: Congress leader's jab blows rift wide openSenior Congress leader K Muraleedharan said that his party colleague Shashi Tharoor was no longer considered 'one of us.' He added that the party's national leadership would decide what action was required against the Congress MP."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/barack-obama-arrest-video-ai-donald-trump-no-one-above-law-2758738-2025-07-21",
      "headline": "Obama handcuffed, put in jail: Trump posts AI video amid poll fraud chargeThe video comes after the Trump administration accused Obama of election fraud in 2016, with the US President backing calls for his prosecution."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/coindcx-hacked-usd-44-million-lost-cyberattack-what-crypto-platform-said-user-money-wallet-2758748-2025-07-21",
      "headline": "CoinDCX loses $44 million in cyberattack: Here's what the crypto platform saidThis is the second large-scale hack involving an Indian crypto exchange in the past year. In July 2024, WazirX lost $234 million when one of its wallets hosted on Liminal was compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pit-bull-bites-child-in-mankhurd-mumbai-man-unleashes-dog-on-boy-inside-auto-laughs-as-dog-attacks-2758648-2025-07-20",
      "headline": "Video: Mumbai man unleashes pit bull on boy inside auto, laughs as dog attacksThe dog's owner entered the auto with the pit bull, prompting all the children to flee in fear. However, the victim was unable to escape in time. What followed was extremely disturbing. Sohail first scared the boy, Hamza, with the dog and then unleashed it on him."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/kerala/story/kerala-woman-from-kollam-found-dead-in-uae-after-years-of-alleged-dowry-harassment-family-says-husband-strangled-and-kicked-her-demands-justice-2758761-2025-07-21",
      "headline": "Another Kerala woman found dead in UAE, family alleges dowry harrasment by husbandThe Kerala police registered a case against a man for the murder of his wife, Athulya, who was found dead in the UAE. The complaint was filed by her mother, and her family alleged dowry harassment and violent abuse."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kanwar-yatra-more-goons-than-shiva-devotees-samajwadi-mla-iqbal-mehmood-2758770-2025-07-21",
      "headline": "More goons than Shiv devotees in Kanwar Yatra: Samajwadi MLA amid assault cases More goons than Shiv devotees in Kanwar Yatra: Samajwadi MLA amid assault cases"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-injury-crisis-nitish-reddy-ligament-tear-knee-2758664-2025-07-20",
      "headline": "Injured Nitish, Arshdeep ruled out of 4th Test against EnglandIndia vs England: India's injury woes have continued ahead of the 4th Test match in Manchester. Nitish Kumar Reddy has suffered a knee injury just days ahead of the 4th Test match and has been ruled out of the game. Additionally, seamer Akash Deep is also doubtful for the game as well."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/faith-call-in-tamil-nadu-should-temple-funds-build-colleges-2757978-2025-07-18",
      "headline": "Faith call in Tamil Nadu: Should temple funds build colleges?An old debate about state control of temples heats up with political rhetoric in the poll-bound state. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/ssvm-institutions-from-cradle-to-cosmos-2754432-2025-07-11",
      "headline": "SSVM Institutions: From Cradle to CosmosForging Futures with Foresight, Flair, and Faith"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/tirupati-to-hyderabad-indigo-flight-cancelled-after-suffering-technical-glitch-2758696-2025-07-21",
      "headline": "IndiGo flight to Hyderabad suffers glitch, circles for 40 minutes before returnIn a separate incident earlier in the day, flight 6E 2696 on the same route also faced a similar issue."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/maharashtra-sambhajinagar-aurangabad-godman-forces-urine-drinking-shoe-beatings-in-exorcism-flees-after-police-case-2758625-2025-07-20",
      "headline": "Maharashtra 'godman' beat followers with shoes, fed them urine; now on the runThe self-styled godman carried out inhumane acts — beating people with sticks, forcing them to hold shoes in their mouths, and even making them drink urine — all in the name of exorcism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/chris-martin-cheeky-warning-following-viral-kiss-cam-incident-coldplay-concert-2758735-2025-07-21",
      "headline": "Coldplay's Chris Martin issues cheeky warning following viral kiss cam incidentAfter the viral kiss cam controversy accidentally outing Astronomer CEO's affair, Coldplay lead singer Chris Martin playfully warned the concert-goers to be camera-ready. His remark came at the band's subsequent performance at Camp Randall Stadium in Madison, Martin. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/people-dont-explain-to-me-i-explain-trump-blasts-wsj-again-on-firing-powell-glbs-2758715-2025-07-21",
      "headline": "People don't explain to me, I do: Trump blasts WSJ over Fed chair reportThe WSJ report said Treasury Secretary Scott Bessent had warned Trump about the possible legal, political, and market consequences of firing Jerome Powell before his term ends in May 2026. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tamil-nadu-girl-was-bitten-raped-by-suspect-fought-him-off-saved-another-child-2758637-2025-07-20",
      "headline": "Tamil Nadu girl was bitten, raped by suspect; fought him off, saved another childA 10-year-old girl, who was kidnapped and allegedly raped in Tamil Nadu on July 12, was assaulted several times by the suspect before fighting him off and saving another minor, who approached the crime spot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/lid-blows-off-excise-scam-in-jharkhand-whats-brewing-2757977-2025-07-18",
      "headline": "Lid blows off excise scam in Jharkhand: What's brewing?Rs 38 crore lost, the scam has exposed a network of forged guarantees, policy manipulation and bureaucratic connivance\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saiyaara-fan-watches-film-in-theatre-with-iv-drip-mohit-suri-ahaan-panday-aneet-padda-2758721-2025-07-21",
      "headline": "Saiyaara craze hits the roof as man watches film in theatre with IV drip. WatchSaiyaara, featuring Ahaan Panday and Aneet Padda, has been ruling the theatres ever since it hit theatres. The craze for the film rose sky-high as a man watched the film in a theatre with an IV drip in his hand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/solemn-ishiba-accepts-defeat-japans-shaky-coalition-loses-upper-house-control-glbs-2758712-2025-07-21",
      "headline": "'Solemn' Ishiba accepts defeat as Japan's ruling bloc loses upper house controlExit polls suggest that Ishiba's Liberal Democratic Party (LDP) and its coalition partner Komeito will secure only 32 to 51 of the 124 contested seats in the 248-seat chamber. They needed at least 50 seats to maintain their grip on power."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/harbhajan-singh-recalls-sreesanths-daughter-slapgate-incident-2758734-2025-07-21",
      "headline": "Harbhajan Singh recalls Sreesanth's daughter confronting him: You hit my fatherFormer India cricketer Harbhajan Singh recalled his infamous slapgate incident with Sreesanth and how the latter's daughter confronted him for his mistake years later."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/agra-conversion-racket-up-police-hindu-girls-radicalised-kashmir-islam-arrested-2758745-2025-07-21",
      "headline": "'ISIS-style' conversion gang busted in Agra: Girls forced into Islam, radicalisedA suspected ISIS-inspired syndicate in Uttar Pradesh's Agra allegedly targeted Hindu girls for religious conversion using brainwashing, suspected Lashkar-e-Taiba (LeT) funding and fake identities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-rich-are-swapping-gold-for-bitcoin-here-is-why-gold-vs-bitcoin-2758472-2025-07-20",
      "headline": "India's rich are swapping gold for bitcoin. Here's WhyNow-a-days more of India's rich are putting a slice of their gold-backed wealth into shiny new digital coins like Bitcoin."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/not-a-fun-day-at-work-delta-pilots-aggressive-maneuver-evades-b-52-bomber-collision-glbs-2758709-2025-07-21",
      "headline": "Not a fun day: Delta pilot's 'aggressive maneuver' evades B-52 bomber collisionThe flight, operated by SkyWest as Delta Connection Flight 3788, was heading to its destination when the military jet suddenly appeared on a converging path. The pilot of the commercial Embraer 175 aircraft immediately took action to avoid the US bomber."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/odisha-student-set-herself-afire-due-to-non-validation-of-complaint-crime-branch-2758700-2025-07-21",
      "headline": "Odisha student set herself afire due to 'non-validation' of complaint: PoliceA 20-year-old woman, pursuing B.Ed. at Fakir Mohan Autonomous College, died days after she set herself ablaze on campus after her repeated complaints of sexual harassment by a professor allegedly went unaddressed by college authorities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-escapes-accident-misano-gt4-european-series-italy-debris-clean-up-2758733-2025-07-21",
      "headline": "Ajith Kumar's car crashes at Italy race, actor helps clean up debris. WatchActor Ajith Kumar's car crashed at Misano during the GT4 European Series. Although uninjured, the actor was seen helping the staff clean up the debris on the racetrack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-escapes-accident-misano-gt4-european-series-italy-debris-clean-up-2758733-2025-07-21",
      "headline": "Ajith Kumar's car crashes at Italy race, actor helps clean up debris. WatchActor Ajith Kumar's car crashed at Misano during the GT4 European Series. Although uninjured, the actor was seen helping the staff clean up the debris on the racetrack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saiyaara-fan-watches-film-in-theatre-with-iv-drip-mohit-suri-ahaan-panday-aneet-padda-2758721-2025-07-21",
      "headline": "Saiyaara craze hits the roof as man watches film in theatre with IV drip. WatchSaiyaara, featuring Ahaan Panday and Aneet Padda, has been ruling the theatres ever since it hit theatres. The craze for the film rose sky-high as a man watched the film in a theatre with an IV drip in his hand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/mohit-suri-copy-saiyaara-from-a-moment-to-remember-internet-thinks-2758633-2025-07-20",
      "headline": "Is Mohit Suri's Saiyaara copy of a Korean film? Internet thinks soMohit Suri's 'Saiyaara', featuring Ahaan Panday and Aneet Padda, hit cinemas on Friday. Soon after its release, viewers began drawing attention to noticeable similarities with a Korean film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-loses-patience-with-paparazzi-outside-jalsa-2758592-2025-07-20",
      "headline": "Band karo: Amitabh Bachchan loses patience with paps for filming outside JalsaAmitabh Bachchan was seen scolding paparazzi outside his home, Jalsa for filming his house. Take a look at the viral video."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-australia-1st-t20i-report-mitchell-owen-cameron-green-2758769-2025-07-21",
      "headline": "1st T20I: Green, Owen help Australia take 1-0 series lead in West IndiesAustralia drew first blood in the T20I series against the West Indies, clinching a thrilling three-wicket victory in Kingstown on Sunday to take a 1-0 lead in the five-match contest. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ban-vs-pak-pakistan-head-coach-mike-hesson-slams-dhaka-pitch-2758755-2025-07-21",
      "headline": "Pakistan head coach slams pitch after crushing defeat vs Bangladesh in 1st T20IPakistan head coach Mike Hesson has slammed the Dhaka pitch following his team's horrendous batting performance in the first T20I vs Bangladesh, which led to a seven-wicket defeat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-support-afghan-women-cricketers-2025-2026-world-cups-2758741-2025-07-21",
      "headline": "ICC provides update on displaced Afghan women cricketers' initiativeThe displaced women cricketers from Afghanistan, who fled their country due to Taliban rule, will receive key engagement opportunities during the next two global events, the ICC said during its annual conference on Sunday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/harbhajan-singh-recalls-sreesanths-daughter-slapgate-incident-2758734-2025-07-21",
      "headline": "Harbhajan Singh recalls Sreesanth's daughter confronting him: You hit my fatherFormer India cricketer Harbhajan Singh recalled his infamous slapgate incident with Sreesanth and how the latter's daughter confronted him for his mistake years later."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/wcl-2025-india-vs-pakistan-shahid-afridi-comments-shikhar-dhawan-rotten-egg-2758698-2025-07-21",
      "headline": "Shahid Afridi on India-Pakistan match fiasco: There is one rotten eggSeveral Indian cricketers pulled out of the India-Pakistan WCL match over the participation of Shahid Afridi. The former Pakistan player has now come out and attacked Shikhar Dhawan for influencing other Indian players against him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-world-cup-koneru-humpy-semi-final-harika-divya-tiebreak-2758693-2025-07-21",
      "headline": "Humpy reaches Chess World Cup semis, Harika-Divya set for tiebreak deciderKoneru Humpy became the first Indian to reach the semifinals of the FIDE Women's Chess World Cup 2025. Meanwhile, Harika and Divya Deshmukh head into tiebreaks, ensuring India at least two semifinalists in Baku."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/srihari-nataraj-breaks-best-indian-time-100m-freestyle-world-university-games-2758683-2025-07-20",
      "headline": "Swimmer Srihari Nataraj breaks national record in World University GamesSrihari Nataraj broke the Best Indian Time in the men's 100m freestyle at the World University Games. His record-breaking swim highlights India's rising talent in competitive swimming."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-bangladesh-1st-t20i-match-report-2758677-2025-07-20",
      "headline": "Pakistan fizzle out in opener, Bangladesh claim mega victory in DhakaBangladesh secured a commanding seven-wicket victory over Pakistan in the opening T20I at Dhaka. Bangladesh chased down Pakistan's 111-run target inside 16 overs."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-injury-crisis-nitish-reddy-ligament-tear-knee-2758664-2025-07-20",
      "headline": "Injured Nitish, Arshdeep ruled out of 4th Test against EnglandIndia vs England: India's injury woes have continued ahead of the 4th Test match in Manchester. Nitish Kumar Reddy has suffered a knee injury just days ahead of the 4th Test match and has been ruled out of the game. Additionally, seamer Akash Deep is also doubtful for the game as well."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-bangladesh-match-t20i-fakhar-zaman-run-out-khushdil-shah-2758634-2025-07-20",
      "headline": "New Pakistan, same old run-outs: Team bowled out for 110 vs BangladeshPakistan's T20I team continues to be a comedy of errors. The latest incident happened in the 1st T20I against Bangladesh, where Fakhar Zaman was run out by Khushdil Shah."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-world-cup-koneru-humpy-semi-final-harika-divya-tiebreak-2758693-2025-07-21",
      "headline": "Humpy reaches Chess World Cup semis, Harika-Divya set for tiebreak deciderKoneru Humpy became the first Indian to reach the semifinals of the FIDE Women's Chess World Cup 2025. Meanwhile, Harika and Divya Deshmukh head into tiebreaks, ensuring India at least two semifinalists in Baku."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/srihari-nataraj-breaks-best-indian-time-100m-freestyle-world-university-games-2758683-2025-07-20",
      "headline": "Swimmer Srihari Nataraj breaks national record in World University GamesSrihari Nataraj broke the Best Indian Time in the men's 100m freestyle at the World University Games. His record-breaking swim highlights India's rising talent in competitive swimming."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-bangladesh-1st-t20i-match-report-2758677-2025-07-20",
      "headline": "Pakistan fizzle out in opener, Bangladesh claim mega victory in DhakaBangladesh secured a commanding seven-wicket victory over Pakistan in the opening T20I at Dhaka. Bangladesh chased down Pakistan's 111-run target inside 16 overs."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-injury-crisis-nitish-reddy-ligament-tear-knee-2758664-2025-07-20",
      "headline": "Injured Nitish, Arshdeep ruled out of 4th Test against EnglandIndia vs England: India's injury woes have continued ahead of the 4th Test match in Manchester. Nitish Kumar Reddy has suffered a knee injury just days ahead of the 4th Test match and has been ruled out of the game. Additionally, seamer Akash Deep is also doubtful for the game as well."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-bangladesh-match-t20i-fakhar-zaman-run-out-khushdil-shah-2758634-2025-07-20",
      "headline": "New Pakistan, same old run-outs: Team bowled out for 110 vs BangladeshPakistan's T20I team continues to be a comedy of errors. The latest incident happened in the 1st T20I against Bangladesh, where Fakhar Zaman was run out by Khushdil Shah."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}