{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/home-loan-easy-method-ai-tool-hom-i-basic-home-loan-fintech-atul-monga-2788796-2025-09-17",
      "headline": "Want a home loan without the headache? Here's how AI can help youFrom lengthy paperwork to long waiting periods, applying for a home loan often becomes a tedious process filled with red tape, but an AI tool can now make it easy for you. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/cotton-farmers-face-new-challenge-as-quality-issues-threaten-msp-2788758-2025-09-17",
      "headline": "Cotton farmers face new challenge as quality issues threaten MSPDuring this Kharif season, northern states such as Haryana, Punjab, and Rajasthan, and southern states including Andhra Pradesh and Telangana, experienced prolonged and abnormal rainfall."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-india-launch-siddharth-jain-first-india-inc-tesla-owner-boost-ev-adoption-2788714-2025-09-17",
      "headline": "Elon Musk congratulates Siddharth Jain on owning 1st Tesla by India Inc bossElon Musk congratulated Siddharth Jain of INOX Group on owning the first Tesla in India Inc."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/blackbuck-startup-usd-1-billion-leaves-office-bengaluru-pothole-ceo-rajesh-kumar-yabaji-2788677-2025-09-17",
      "headline": "$1 billion startup BlackBuck leaves Bengaluru office, blames potholesBengaluru firm BlackBuck, worth over $1 billion has decided to move out of their office in the city due to worsening pothole conditions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/bel-share-price-new-order-should-you-buy-explained-2788588-2025-09-17",
      "headline": "BEL share price: Why is it rising today and should you buy?BEL shares rose during the trading session on strong Rs 712 crore order inflow, supported by robust backlog and bullish technicals, keeping investor sentiment positive and suggesting potential further upside in the near-term trading sessions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/urban-company-shares-list-at-58-premium-over-ipo-price-book-profit-or-hold-explained-2788567-2025-09-17",
      "headline": "Urban Company shares list at 58% premium: Should you book profit or hold?Urban Company share price: The strong debut reflects the high demand for Urban Company's IPO, which had been among the most closely watched offerings of 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/urban-company-share-price-bse-nse-58-percent-premium-2788559-2025-09-17",
      "headline": "Urban Company share price: Stock makes bumper debut at 58% premiumUrban Company listed at a 57.5% premium at Rs 162.25 on the NSE. On the BSE, the shares opened at Rs 161, marking a 56% gain over the Rs 103 issue price."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/experts-bet-big-financial-stock-bajaj-finance-record-high-psu-banking-sbi-defence-idea-forge-2788554-2025-09-17",
      "headline": "Experts bet big on this financial stock at record high. Should you buy?Experts recommend the financial stock as a strong buy for investors focusing on financial stocks, while also suggesting PSU banks, defence tech firms, and auto ancillary stocks as potential picks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/dreamfolks-share-price-tumble-5-today-why-is-it-under-pressure-2788555-2025-09-17",
      "headline": "DreamFolks share price tumble 5% today. Why is it under pressure?DreamFolks shares fell sharply in early trade after the company quit the domestic lounge business, a move that could reshape its position in India's fast-evolving airport services market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/urban-company-shares-debut-on-bse-nse-today-will-it-be-a-blockbuster-listing-2788548-2025-09-17",
      "headline": "Urban Company shares debut on BSE, NSE today. Will it be a blockbuster listing?Urban Company share price: The company's stock market debut also comes at a time when benchmark indices are riding high on optimism around US-India trade talks and a widely expected Fed rate cut, factors that could further shape sentiment on its first trading day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-rises-over-150-points-nifty-above-25300-tata-consumer-products-gains-3-2788539-2025-09-17",
      "headline": "Sensex, Nifty open higher on upbeat trade talks, Fed rate cut in focusThe S&P BSE Sensex was trading 250.84 points higher at 82,631.53 at 9:24 am, while the NSE Nifty50 was up 78.15 points to 25,317.25. Volatility dropped sharply and most of the broader market indices were trading in the green."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/apollo-tyres-lead-sponsorship-team-india-579-crore-cricket-deal-2788535-2025-09-17",
      "headline": "Explained: Why Apollo Tyres shares are in focus todayApollo Tyres shares have gained 6% over the past month, even as they remain over 6% lower on a year-to-date basis. Analysts say the brand exposure from the deal could create long-term consumer stickiness, though the immediate financial payoff remains a question for the market."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anurag-kashyap-on-nishaanchi-not-sequel-or-launch-just-most-filmy-film-of-my-life-2788553-2025-09-17",
      "headline": "Anurag Kashyap on Nishaanchi: Not sequel or launch, just most filmy film of my lifeFrom rediscovering his filmy side in 'Nishaanchi' to mentoring fresh talent, Anurag Kashyap gets candid about cinema, crisis, and his uncompromising passion for filmmaking.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kavin-disappointing-performance-of-star-and-bloody-beggar-cannot-blame-audience-2788771-2025-09-17",
      "headline": "Actor Kavin discusses Bloody Beggar's disappointing run: Can't blame audienceTamil actor Kavin, in a recent interview, opened up about the disappointing performance of 'Star' and 'Bloody Beggar', his last two films. The actor also talked about the learnings from the films' performance in theatres."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kaun-banega-crorepati-17-amitabh-bachchan-moved-by-inspiring-ias-officer-ayushis-journey-2788756-2025-09-17",
      "headline": "KBC 17: Visually impaired IAS officer Ayushi's story leaves Big B emotionalIn the latest episode of 'Kuan Banega Crorepati 17', a visually-impaired contestant shared her inspiring journey. She also spoke about her mother's tireless support in raising her up. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kgf-and-salaar-composer-ravi-basrur-have-24tb-of-unused-music-2788720-2025-09-17",
      "headline": "KGF and Salaar composer Ravi Basrur: Have 24TB of unused musicRavi Basrur, the composer behind the powerful soundtracks of 'KGF' and 'Salaar', revealed that he created nearly 18 versions and about 24TB of unused music before arriving at the final scores for the three films."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/seth-rogen-the-studio-platonic-apple-tv-rose-byrne-2788194-2025-09-17",
      "headline": "Loved Seth Rogen in The Studio? You cannot miss Platonic on Apple TVWatched 'The Studio' and loved Seth Rogen's performance in it? You cannot skip 'Platonic' on Apple TV. The show is a beautiful representation of how a man and a woman can be \"just\" friends. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jolly-llb-3-advance-booking-day-1-latest-update-akshay-kumar-arshad-warsi-film-depends-heavily-on-word-on-mouth-2788691-2025-09-17",
      "headline": "Jolly LLB 3 advance booking: Akshay-Arshad's film depends heavily on word-on-mouth'Jolly LLB 3', starring Akshay Kumar and Arshad Warsi, opens with slow advance bookings but strong franchise goodwill. Check early box office collection, ticket sales, story highlights, and why spot bookings could turn the game."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/dipika-kakar-shares-health-update-opens-up-about-scary-hair-loss-amid-cancer-treatment-2788657-2025-09-17",
      "headline": "Dipika Kakar shares health update, opens up about scary hair loss amid treatmentTelevision actor Dipika Kakar, who is undergoing treatment for stage 2 liver cancer, shared that while she has adjusted to most side effects, severe hair fall continues to scare her."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/pm-modi-turns-75-birthday-aamir-khan-ss-rajamouli-anupam-kher-ajay-devgn-celebs-salute-vision-2788683-2025-09-17",
      "headline": "PM Modi turns 75: SRK, Aamir Khan, Rajamouli, celebs salute his visionOn Prime Minister Narendra Modi's 75th birthday today, several celebrities extended their warm wishes while praising his leadership and vision. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-kamal-haasan-film-director-script-yet-to-decide-2788672-2025-09-17",
      "headline": "Rajinikanth hints at collaboration with Kamal Haasan: Yet to decide directorRajinikanth announced that he has signed a film that will be jointly produced by Raaj Kamal Films International and Red Giant Movies. He also hinted at a possible collaboration with Kamal Haasan."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-episode-24-day-23-written-update-shehbaz-badesha-amaal-mallik-prank-housemates-lash-out-2788651-2025-09-17",
      "headline": "Bigg Boss 19 episode 24: Shehbaz-Amaal's prank goes awry, housemates lash outThe first wild card contestant of 'Bigg Boss 19', Shehbaz Badesha, found himself at the centre of controversy in the latest episode of the reality show. A prank he pulled with Amaal Mallik led the other contestants to call for a boycott against him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/aryan-khan-bads-of-bollywood-cast-spills-the-beans-behind-the-asterisk-mystery-2788620-2025-09-17",
      "headline": "Why the asterisks? Aryan Khan's B***ds of Bollywood cast finally explains reasonAryan Khan's debut, 'The Ba***ds of Bollywood', is already turning heads! With its mysterious title and all-star cast, the series – dropping on September 18 – promises a quirky, one-of-a-kind ride, with the asterisks added just for that extra flair."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-birthday-wish-pm-narendra-modi-praises-spirit-at-75-folded-hands-video-message-2788647-2025-09-17",
      "headline": "SRK commends PM Modi's spirit at 75, wishes him with folded hands on birthdayShah Rukh Khan wished Prime Minister Narendra Modi on his 75th birthday with folded hands, praising his inspiring journey, discipline, and youthful energy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/maa-vande-biopic-prime-minister-narendra-modi-announced-unni-mukundan-2788643-2025-09-17",
      "headline": "Maa Vande: Biopic on PM Modi announced with Marco star Unni Mukundan in leadMalayalam actor Unni Mukundan to portray Prime Minister Narendra Modi in 'Maa Vande', a grand biopic tracing his inspiring journey and bond with his mother."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prime-minister-narendra-modi-turns-75-rajinikanth-to-pawan-kalyan-south-celebs-extend-birthday-wishes-2788600-2025-09-17",
      "headline": "PM Modi turns 75: Rajinikanth to Pawan Kalyan, South celebs extend birthday wishesOn Prime Minister Narendra Modi's 75th birthday, several notable figures from the South Indian film industry including Rajinikanth, Kamal Haasan, Pawan Kalyan, among others expressed their heartfelt wishes on social media.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/natalia-janoszek-bigg-boss-19-exit-ties-baseer-ali-mridul-tiwari-2788557-2025-09-17",
      "headline": "Natalia Janoszek on whether bonds with Mridul, Baseer hurt her Bigg Boss 19 gameNatalia Janoszek reflects on her brief stint on 'Bigg Boss 19' and clarifies rumours about her ties with co-contestants Mridul Tiwari and Baseer Ali. She emphasises her individual identity and shares lessons learned during the show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahesh-babu-praises-little-hearts-telugu-film-success-2788563-2025-09-17",
      "headline": "Mahesh Babu reviews Telugu film Little Hearts, has a special message for composerMahesh Babu has publicly praised the Telugu film 'Little Hearts' for its fresh approach and cast performance. The movie has emerged as a box office hit, driven by strong word of mouth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/jennifer-aniston-reese-witherspoon-the-morning-show-renewed-for-season-5-on-apple-tv-2788591-2025-09-17",
      "headline": "Jennifer Aniston's The Morning Show renewed for Season 5 ahead of Season 4 premiereApple TV+ has renewed 'The Morning Show' for its fifth season just a day before the launch of Season 4. Featuring a stellar cast and creative team, the show delves into pressing themes of truth and trust in a divided society. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/demon-slayer-infinity-castle-box-office-collection-day-5-detailed-report-bigger-tuesday-rs-50-crore-in-sight-2788601-2025-09-17",
      "headline": "Demon Slayer Infinity Castle box office Day 5: Bigger Tuesday, Rs 50 crore in sight'Demon Slayer: Kimetsu no Yaiba – Infinity Castle' crossed Rs 47.70 crore in 5 days at the Indian box office. With a stronger Tuesday than Monday, the anime epic is now the biggest non-Hollywood and highest-grossing foreign anime in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/sydney-sweeney-amanda-seyfried-the-housemaid-thriller-release-19-december-2788562-2025-09-17",
      "headline": "The Housemaid: Sydney Sweeney gets pulled into web of secrets in suspense thrillerThe Housemaid', starring a star-studded cast, will hit theatres this December. Directed by Paul Feig, the film explores a young woman's struggle amidst a wealthy couple's tangled web of deception."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/new-india-is-not-afraid-of-anyones-nuclear-threats-pm-cites-jaish-admitting-op-sindoor-losses-2788705-2025-09-17",
      "headline": "New India not afraid of nuclear threats: PM cites Jaish admitting Op Sindoor lossesPM Modi said the confession by a top Jaish commander of losses during Operation Sindoor was proof that New India not only responds firmly to terror but also fears no one's nuclear threats."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/masood-azhar-jem-terrorist-implicated-delhi-mumbai-attacks-balakot-base-2788741-2025-09-17",
      "headline": "Masood Azhar behind Parliament attack, 26/11: Jaish leader's 2nd admission nails PakMasood Ilyas Kashmiri, a top Jaish commander, admitted in a video that Masood Azhar orchestrated deadly terror attacks in India from his base in Pakistan's Balakot, knocking Islamabad's denials of harbouring terror groups on its soil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-donald-trump-birthday-phone-call-social-media-narrative-india-us-ties-2788653-2025-09-17",
      "headline": "PM Modi got birthday call from Trump, but his post took the cakePM Modi, who turned 75 today, knows very well that Trump thrives on spectacle and loves dominating the news cycle. Thus, in a departure from the script, this time PM Modi beat Trump in posting about the call on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/on-75th-birthday-pm-modis-signature-outfit-shines-with-a-touch-of-madhya-pradesh-2788775-2025-09-17",
      "headline": "On 75th birthday, PM Modi's signature outfit shines with a touch of Madhya PradeshOn stage, Prime Minister Modi was presented with a traditional pink headgear (pagdi) along with a jacket that featured Lambani embroidery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/the-lowdown/story/khalistan-movement-complex-journey-from-india-to-canada-the-lowdown-2788767-2025-09-17",
      "headline": "Khalistan Movement's Complex Journey From India to CanadaFrom its roots in colonial India to its deep entrenchment in Canada's Sikh diaspora, the Khalistan movement remains a complex and sensitive issue, marked by political tension, historical trauma, and transnational activism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/varun-chakravarthy-no1-t20i-rankings-asia-cup-india-vs-oman-2788768-2025-09-17",
      "headline": "Varun Chakravarthy storms to No.1 T20I ranking ahead of Asia Cup clash vs OmanVarun Chakravarthy stormed to the top spot in the men's T20I rankings ahead of India's final Asia Cup group-stage match against Oman."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-75th-birthday-donald-trump-phone-call-social-media-post-tariff-trade-talks-russia-ukraine-war-2788680-2025-09-17",
      "headline": "Modi, Trump, message in 293 characters, and the unsaidAfter several missed calls from US President Donald Trump, he finally spoke to PM Narendra Modi on his 75th birthday, with both leaders calling each other \"my friend\". In just 293 characters, PM Modi managed to reaffirm Indo-US ties, signal India's balanced stance on Ukraine, and leave trade troubles unsaid."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/pappu-yadav-modi-purnea-airport-purnia-congress-mahagathbandhan-politics-strategy-seemanchal-bihar-2025-elections-2788575-2025-09-17",
      "headline": "Is this Yadav making a Pappu out of Congress?Purnia's Independent MP and Bihar strongman Pappu Yadav shared the stage with PM Modi. Yadav, who has vowed allegiance to Rahul Gandhi, might be making the most of his Independent status from both the NDA and the Mahagathbandhan. Is it his ploy to extract the most out of Congress ahead of the Bihar election?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pm-modi-birthday-viswanathan-anand-story-gujarati-thali-chess-2788544-2025-09-17",
      "headline": "Vishy Anand remembers best Gujarati thali ever. Guess who treated him to it?As India celebrates Prime Minister Narendra Modi's 75th birthday, tributes have poured in from across the nation. Grandmaster Viswanathan Anand recalled a moment with the Prime Minister that went far beyond the chessboard."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/the-80-gap-why-most-indians-are-underinsured-and-why-its-time-to-act-2787740-2025-09-15",
      "headline": "The 80% gap: Why most Indians are underinsured and why it's time to actThe solution lies in choosing a comprehensive life cover that reflects modern realities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/university-of-bath-school-of-management-where-careers-begin-with-confidence-2788009-2025-09-16",
      "headline": "University of Bath School of Management: Where Careers Begin With ConfidenceWith students from over 160 countries and a strong alumni network spanning 130 nations, the School creates a community that feels global in reach yet personal in experience. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anurag-kashyap-on-nishaanchi-not-sequel-or-launch-just-most-filmy-film-of-my-life-2788553-2025-09-17",
      "headline": "Anurag Kashyap on Nishaanchi: Not sequel or launch, just most filmy film of my lifeFrom rediscovering his filmy side in 'Nishaanchi' to mentoring fresh talent, Anurag Kashyap gets candid about cinema, crisis, and his uncompromising passion for filmmaking.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-india-launch-siddharth-jain-first-india-inc-tesla-owner-boost-ev-adoption-2788714-2025-09-17",
      "headline": "Elon Musk congratulates Siddharth Jain on owning 1st Tesla by India Inc bossElon Musk congratulated Siddharth Jain of INOX Group on owning the first Tesla in India Inc."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/perimenopause-crippling-fatigue-weight-gain-mood-changes-low-hemoglobin-anemia-silent-struggles-menopause-2788610-2025-09-17",
      "headline": "Perimenopause, the silent battle before menopause that no one talks aboutUnderstanding that perimenopause exists is the first point of change. It needs to be treated, managed, and nurtured by all — women, and especially their loved ones."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/dhruvee-patel-tourist-accuses-georgia-border-officials-inhuman-treatment-treated-like-cattle-passports-seized-no-food-2788632-2025-09-17",
      "headline": "No food, no washroom: Woman says Indians treated inhumanely at Georgia borderIn an Instagram post, Dhruvee Patel even claimed that the Georgian authorities confiscated the passports of the 56 Indian travellers, while also denying access to any form of communication."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/ap-class-6-girl-skull-fracture-chittoor-teacher-assault-steel-tiffin-box-lunch-bag-complaint-filed-2788764-2025-09-17",
      "headline": "Andhra Class 6 girl suffers skull fracture after teacher hits her with lunch box bagA Class 6 student in Andhra Pradesh's Chittoor district sustained a skull fracture after allegedly being struck on the head by her teacher with a school bag containing a steel tiffin box. Police have registered a case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/from-the-india-today-archives-2014-the-man-behind-narendra-modi-2788258-2025-09-16",
      "headline": "From the India Today archives (2014) | The man behind Narendra ModiNarendra Modi turning 75 is also time to remember Lakshmanrao Inamdar, the RSS veteran who perhaps had the most profound impact on the prime minister's early years"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/how-prime-minister-narendra-modi-celebrated-his-birthday-every-year-since-pm-75-birthday-2788704-2025-09-17",
      "headline": "No birthday cake, this is how PM Modi spends his birthdaysPrime Minister Narendra Modi, known for working tirelessly, rarely marks his birthdays the way most people do. There is neither a cake, nor pomp and show. From releasing cheetahs in the wild to launching housing projects to spending time with disabled kids, he dedicates the day, like all days, to the nation. Also, Modi would meet his mother on this day without fail till she was alive."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/uttar-pradesh/story/varanasi-police-inspector-assaulted-by-lawyers-case-registered-court-attack-2788686-2025-09-17",
      "headline": "Varanasi court turns battleground as lawyers rain blows on cop, video is viralCCTV footage shows a group of lawyers beating Sub-Inspector Mithilesh Prajapati unconscious on court premises. The attack, reportedly in retaliation to an earlier dispute, has led to a police case against 60 individuals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/the-summer-i-turned-season-3-final-pretty-indian-clubs-gen-z-party-screening-2788360-2025-09-17",
      "headline": "The Summer I Turned Pretty watch parties take over Indian clubsThe Summer I Turned Pretty has brought the West's beloved web-series watch party culture to India. Fans are excited to bond over shared gasps, tears, and heated team debates at hep clubs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/chennai-woman-chat-with-indigo-airhostess-is-about-life-little-things-video-viral-2788613-2025-09-17",
      "headline": "Chennai woman's chat with IndiGo airhostess is about life's little things. Video viralA Chennai woman's video of a heartwarming conversation with an IndiGo airhostess has gone viral, with social media users calling it the \"best thing\" online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-narendra-modi-birthday-75-world-leaders-rare-video-messages-netanyahu-albanese-2788743-2025-09-17",
      "headline": "From Israel to Australia, leaders line up with rare video wishes for PMAs Prime Minister Narendra Modi celebrated his 75th birthday, a string of video messages from several world leaders flooded social media in a rare move."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/uk-news/story/pakistani-doctor-left-surgery-sex-with-nurse-uk-manchester-suhail-anjum-anaesthetist-lahore-2788731-2025-09-17",
      "headline": "Pakistani doctor who left patient in OT to have sex with nurse can practice in UKA Pakistani-origin doctor, who left a patient midway through a surgery to have sex with a nurse, has been cleared to resume his medical career by a UK medical tribunal. However, a written warning will remain on his registration for two years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/nasa-names-feature-on-deep-space-asteroid-donald-johanson-after-indias-narmada-valley-2788696-2025-09-17",
      "headline": "Nasa names unique feature on asteroid after India's Narmada valleyThe small asteroid, located in the main belt between Mars and Jupiter, was visited by Lucy on April 20, 2025, during a successful flyby that served as a crucial rehearsal for the spacecraft's main mission to Jupiter's Trojan asteroids."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/varun-chakravarthy-no1-t20i-rankings-asia-cup-india-vs-oman-2788768-2025-09-17",
      "headline": "Varun Chakravarthy storms to No.1 T20I ranking ahead of Asia Cup clash vs OmanVarun Chakravarthy stormed to the top spot in the men's T20I rankings ahead of India's final Asia Cup group-stage match against Oman."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jemimah-rodrigues-ruled-out-odi-series-viral-fever-india-australia-world-cup-2788747-2025-09-17",
      "headline": "Jemimah ruled out of Australia ODIs, adds to India's concerns before World CupJemimah Rodrigues has been ruled out of the ongoing ODI series against Australia due to viral fever, adding to India's worries before the Women's World Cup to start on September 30."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/china-masters-satwik-chirag-shetty-round-one-result-2788738-2025-09-17",
      "headline": "Twice in 5 days: Sat-Chi hammer Arif-Yap, storm into Round 2 of China MastersIndia's Satwiksairaj Rankireddy and Chirag Shetty hammered Malaysia's Junaidi Arif and Roy King Yap to reach the second round of the China Masters. This was Sat-Chi's second win against the duo inside one week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-athletics-championships-day-5-live-results-neeraj-arshad-animesh-kujur-2788748-2025-09-17",
      "headline": "Day 4 Live Updates: Neeraj Chopra, Arshad Nadeem take centre stageWorld Athletics Championships Day 5 Live Updates: It is a very big day for Indian athletics in the World Championships. Neeraj Chopra and Animesh Kujur are set to take stage in the evening session in Tokyo. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/viswanathan-anand-bumps-r-viashali-chennai-airport-grand-swiss-chess-funny-post-2788725-2025-09-17",
      "headline": "Random bump 2.0: Viswanathan Anand welcomes back R Vaishali after Grand Swiss winViswanathan Anand bumped into R Vaishali, the two-time Grand Swiss winner, which sparked a fun social media post from the former. Viashali retruned home after defending her Grand Sweiss crown."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-michael-bracewell-captain-mitchell-santner-injury-chappell-hadlee-t20i-series-2788678-2025-09-17",
      "headline": "Santner ruled out, Jamieson returns in New Zealand squad for Australia T20IsNZ vs AUS T20I series: Mitchell Santner has been ruled out of the Chappell-Hadlee T20I series against Australia after abdominal surgery, with Michael Bracewell stepping in as captain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-quest-25th-slam-backed-yannick-noah-alcaraz-sinner-rise-2788469-2025-09-17",
      "headline": "Yannick Noah backs Djokovic, warns against writing him off too soonYannick Noah praises Novak Djokovic's resilience and potential to win his 25th Grand Slam. He warns against underestimating Djokovic despite the rise of younger stars like Alcaraz and Sinner."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rp-singh-pragyan-ojha-india-selection-panel-bcci-agm-meeting-reports-2788664-2025-09-17",
      "headline": "India bowling duo RP Singh, Pragyan Ojha in line for India selection panel: ReportsFormer India pacers RP Singh and Pragyan Ojha are set to join the senior selection committee, bringing their vast international and domestic experience to India's bowling talent pipeline. Their appointments aim to strengthen the BCCI's talent identification process."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/luka-doncic-trade-dallas-mavericks-los-angeles-lakers-new-beginnings-2788472-2025-09-17",
      "headline": "7 months after shock trade, Luka Doncic opens up on his move to LakersLuka Doncic was surprised with his trade from Dallas Mavericks to Los Angeles Lakers. He stated that he respects both fanbases and is focused on his future with the Lakers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-sri-lanka-vs-afghanistan-dubai-super-four-qualification-2788641-2025-09-17",
      "headline": "Super 4 Scenario: How can Bangladesh, Afghanistan, Sri Lanka qualifyAsia Cup 2025 sees a key Group B clash between Sri Lanka and Afghanistan in Dubai. The match will decide who advances to the Super Four and could lead to surprising eliminations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-michael-bracewell-captain-mitchell-santner-injury-chappell-hadlee-t20i-series-2788678-2025-09-17",
      "headline": "Santner ruled out, Jamieson returns in New Zealand squad for Australia T20IsNZ vs AUS T20I series: Mitchell Santner has been ruled out of the Chappell-Hadlee T20I series against Australia after abdominal surgery, with Michael Bracewell stepping in as captain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-quest-25th-slam-backed-yannick-noah-alcaraz-sinner-rise-2788469-2025-09-17",
      "headline": "Yannick Noah backs Djokovic, warns against writing him off too soonYannick Noah praises Novak Djokovic's resilience and potential to win his 25th Grand Slam. He warns against underestimating Djokovic despite the rise of younger stars like Alcaraz and Sinner."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rp-singh-pragyan-ojha-india-selection-panel-bcci-agm-meeting-reports-2788664-2025-09-17",
      "headline": "India bowling duo RP Singh, Pragyan Ojha in line for India selection panel: ReportsFormer India pacers RP Singh and Pragyan Ojha are set to join the senior selection committee, bringing their vast international and domestic experience to India's bowling talent pipeline. Their appointments aim to strengthen the BCCI's talent identification process."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/luka-doncic-trade-dallas-mavericks-los-angeles-lakers-new-beginnings-2788472-2025-09-17",
      "headline": "7 months after shock trade, Luka Doncic opens up on his move to LakersLuka Doncic was surprised with his trade from Dallas Mavericks to Los Angeles Lakers. He stated that he respects both fanbases and is focused on his future with the Lakers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-sri-lanka-vs-afghanistan-dubai-super-four-qualification-2788641-2025-09-17",
      "headline": "Super 4 Scenario: How can Bangladesh, Afghanistan, Sri Lanka qualifyAsia Cup 2025 sees a key Group B clash between Sri Lanka and Afghanistan in Dubai. The match will decide who advances to the Super Four and could lead to surprising eliminations."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}