{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/upcoming-ipos-5-best-review-gmp-vikram-solar-patel-retail-mangal-gem-aromatics-shreeji-2771335-2025-08-14",
      "headline": "5 IPOs to open for bidding next week: Which is best based on GMP?Next week will see the IPOs of Patel Retail, Vikram Solar, Gem Aromatics, Shreeji Shipping Global and Mangal Electrical. Together, they are looking to raise Rs 3,584.09 crore from the market. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-your-45-day-credit-card-grace-period-might-be-a-debt-trap-explains-ca-2771271-2025-08-14",
      "headline": "Why your 45-day credit card grace period might be a debt trap, explains CAMany believe a credit card's 45-day grace period means free borrowing time. But as an expert explains, even a small unpaid balance can turn it into a costly debt trap."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-it-stocks-gain-offset-broad-decline-infosys-rise-2-percent-2771269-2025-08-14",
      "headline": "Sensex, Nifty end marginally higher as investors await Trump-Putin meet outcomeThe S&P BSE Sensex gained 57.75 points to end at 80,597.66, while the NSE Nifty50 added just 11.95 points to close at 24,631.30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-upgraded-to-bbb-on-economic-resilience-and-sustained-fiscal-consolidation-outlook-stable-sp-global-2771259-2025-08-14",
      "headline": "S&P upgrades India's sovereign rating to 'BBB' on growth, fiscal disciplineThe move comes more than a year after S&P revised India's outlook to positive from stable in May 2024, on the back of robust growth and improved expenditure quality. The rating agency also revised India's transfer and convertibility assessment to 'A-' from 'BBB+'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/fedex-ups-dhl-courier-service-top-executives-india-antitrust-probe-cci-report-2771243-2025-08-14",
      "headline": "Fresh scrutiny on FedEx, UPS, DHL top brass in antitrust case: ReportExecutives set to be questioned include Subhasish Chakraborty, Managing Director of DTDC Express; R.S. Subramanian, Managing Director of DHL Express India, and more. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/7-major-income-tax-changes-in-2025-that-will-impact-your-money-2771231-2025-08-14",
      "headline": "7 major income tax changes in 2025 that will impact your money2025 has brought a wave of changes to India's income tax rules, from bigger exemptions to extended filing deadlines. Here's a simple breakdown of the seven key updates that could directly affect your finances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cognizant-salary-hike-eligible-employees-november-1-2771152-2025-08-14",
      "headline": "Cognizant to roll out wage hikes for 80% of eligible employees. Details hereIT giant Cognizant is set to give salary hikes to 80% of eligible employees from November 1, with top performers in India receiving high single-digit increases."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/jsw-cement-share-price-market-debut-stock-fall-2-percent-buy-sell-book-profit-review-2771158-2025-08-14",
      "headline": "JSW Cement shares fall after listing at 4% premium: Should you hold or sell?JSW Cement's share price listed at 4% above its issue price of Rs 147. On the BSE, the stock opened at Rs 153, up 4.1%, while on the NSE it debuted at Rs 153.50, a gain of 4.4%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/man-invested-rs-18000month-for-4-years-earned-less-than-fds-ca-explains-why-2771104-2025-08-14",
      "headline": "Man invested Rs 18,000/month for 4 years, earned less than FDs. CA explains whyThe investor believed he was on the right track. His funds showed a compound annual growth rate (CAGR) of 11%. But when he calculated his portfolio XIRR—the actual return on his money—it was just 6%. That's less than the 7% a fixed deposit would have paid over the same period."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pakistan-economy-credit-rating-improve-moodys-fitch-reason-inflation-forex-reserve-2771031-2025-08-14",
      "headline": "Pakistan's credit rating gets a lift from Moody's. Here's whyS&P Global Ratings raised Pakistan's rating to B- from CCC+ on July 24, while Fitch Ratings did the same in April. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rbi-cheque-clear-rule-faster-october-4-few-hours-personal-finance-trending-news-money-tips-2771065-2025-08-14",
      "headline": "RBI's new rule: Cheques to clear in just hours starting this dateUnder the new rule, cheques will be scanned, presented, and cleared continuously during business hours, reducing the clearing cycle from the current T+1 days to just a few hours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/icici-bank-cuts-minimum-balance-after-backlash-check-new-rules-and-penalties-2771058-2025-08-14",
      "headline": "ICICI Bank cuts minimum balance after backlash. Check new rules and penaltiesThe bank's decision comes after strong public criticism, particularly over the earlier increase in urban and metro monthly average balance levels. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/war-2-day-1-box-office-collection-early-estimates-detailed-report-hrithik-roshan-jr-ntr-may-have-spy-universe-lowest-opener-2771458-2025-08-14",
      "headline": "War 2 Day 1 early box office: Hrithik-Jr NTR may have spy universe's lowest openerThe trade industry was expecting 'War 2' to open in the range of Rs 40 crore nett in Hindi - like 'Tiger 3' - but things don't seem promising enough. The film might have just opened in the range of Rs 60 crore in the overall domestic market. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/wednesday-season-2-part-2-trailer-final-episodes-netflix-jenna-ortega-meets-spirit-guide-2771400-2025-08-14",
      "headline": "Wednesday Season 2 Part 2 trailer: Jenna Ortega meets spirit-guide as mayhem unfoldsThe trailer for the last four episodes of 'Wednesday: Season 2 - Part 2' has been released on Netflix. The show is headed towards more chaos as Wednesday wakes from a coma and meets a new spirit guide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/coolie-early-box-office-day-1-detailed-estimates-report-rajinikanth-inks-tamil-cinema-history-in-rs-150-crore-gold-2771451-2025-08-14",
      "headline": "Coolie early box office Day 1: Rajinikanth inks Tamil history in Rs 150 crore goldRajinikanth has cemented his God-like stature in the Tamil film industry as his film 'Coolie' made a thunderous opening of around Rs 150 crore gross worldwide. At least the initial trends suggest the same. Here's the detailed report. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mrunal-thakur-apologises-body-shaming-bipasha-basu-old-video-2771429-2025-08-14",
      "headline": "Mrunal Thakur apologises for body-shaming Bipasha Basu, calls it a teenager's mistakeActor Mrunal Thakur has apologised for body-shaming actor Bipasha Basu in a resurfaced video. The apology comes amid widespread criticism and renewed conversations on body positivity in Bollywood."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-thanks-travis-kelce-football-new-album-announcement-2771354-2025-08-14",
      "headline": "Taylor Swift thanks Travis Kelce on his podcast for introducing her to footballSinger Taylor Swift has revealed that she knew nothing about football until meeting NFL star Travis Kelce. She also announced her new album on his podcast, highlighting their growing bond and shared interests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bipasha-basu-nostalgic-video-ronaldo-georgina-rodriguez-engagement-2771363-2025-08-14",
      "headline": "Bipasha Basu shares nostalgic video after Ronaldo announces engagementActor Bipasha Basu recalled her encounter with footballer Cristiano Ronaldo on social media. The nostalgic video was from the time she shared on stage with Ronaldo. Her post came shortly after Ronaldo and Rodriguez confirmed their engagement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/homi-adajania-post-kriti-sanon-cocktail-2-italy-2771308-2025-08-14",
      "headline": "Homi Adajania sets the record straight as Kriti Sanon begins Cocktail 2 in ItalyDirector Homi Adajania confirmed that actor Kriti Sanon is confirmed to star in 'Cocktail 2'. He shared that the shooting schedule would soon start in Italy. The film will reportedly also star Shahid Kapoor and Rashmika Mandanna."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/orry-slams-mrunal-thakur-old-video-bipasha-basu-body-shaming-comment-social-media-reactions-2771304-2025-08-14",
      "headline": "Orry slams Mrunal Thakur body-shaming Bipasha Basu in viral videoAn old video of Mrunal Thakur making remarks about Bipasha Basu has resurfaced, causing a stir on social media. Influencer Orhan Awatramani aka Orry also responded to the viral clip."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sholay-completes-50-years-its-iconic-dialogues-and-how-to-use-them-2771331-2025-08-14",
      "headline": "Sholay@50: Its iconic dialogues, and how to use themSholay (1975), directed by Ramesh Sippy, is not just a film; it's a cultural juggernaut that has shaped India's cinematic and social landscape for decades. From Gabbar Singh's villainous zingers to Basanti's chatterbox charm, its dialogues have hijacked India's lingua franca, folklore, and meme culture like a rogue Dhanno on a rampage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/john-abraham-tehran-movie-review-geopolitical-thriller-india-iran-israel-conflict-2771280-2025-08-14",
      "headline": "Tehran review: John Abraham's geopolitical thriller is a terrific watchRelease Date:Thu Aug 14, 2025Tehran movie review: John Abraham stars in 'Tehran', a geopolitical thriller set against Iran-Israel tensions. The film highlights the human cost of conflict and offers sharp performances and gripping storytelling, says our review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/janhvi-kapoor-khushi-kapoor-emotional-tribute-mother-sridevi-birth-anniversary-photos-2771093-2025-08-14",
      "headline": "Janhvi and Khushi Kapoor pay emotional tribute to their mother Sridevi. See photosA day after the late actor Sridevi's birth anniversary, actor Janhvi Kapoor shared throwback photos in remembrance of her mother. Khushi also paid an emotional tribute on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/video/india-exclusive-kim-tae-hee-on-hollywood-debut-butterfly-taking-a-break-hi-bye-mama-stairway-to-heaven-love-from-india-2771255-2025-08-14",
      "headline": "India Exclusive: Kim Tae-hee on Hollywood debut Butterfly, taking a break and love from IndiaIn this exclusive chat with India Today's Bhavna Agarwal, Kim Tae-hee opens up about feeling liberated to take on more challenging roles, why she's now more comfortable with natural acting over heavy makeup, and the overwhelming love she receives from India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/independence-day-song-ae-mere-watan-ke-logon-made-nehru-cry-still-plays-nationwide-2771174-2025-08-14",
      "headline": "Ae Mere Watan ke…: India's favourite I-Day song, the one that made Nehru weepIn every lane, every loudspeaker, 'Ae Mere Watan Ke Logon' still lives on. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-shehnaz-gill-brother-shehbaz-badesha-mridul-tiwari-salman-khan-fans-ka-faisla-2771197-2025-08-14",
      "headline": "BB 19: Shehnaz Gill's brother Shehbaz Badesha or Mridul Tiwari, who will fans pick?'Bigg Boss 19' is set to premiere on August 14. Ahead of the grand launch, the makers announced a major twist in this year's season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karan-johar-nadaaniyan-criticism-khushi-kapoor-ibrahim-ali-khan-2771230-2025-08-14",
      "headline": "Karan Johar asks Nadaaniyan critics to move on: Let it goFilmmaker Karan Johar addressed the social media backlash against 'Nadaaniyan'. The film received poor reviews and sparked widespread trolling. Johar reflected on the lessons learnt and asked people to move on."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/war-2-movie-review-hrithik-roshan-jr-ntr-take-a-world-tour-story-stays-home-2771233-2025-08-14",
      "headline": "War 2 review: Hrithik Roshan, Jr NTR take a world tour, story stays homeRelease Date:Thu Aug 14, 2025War 2 movie review: The Hrithik Roshan and Jr NTR-starrer is more like a travel brochure tirelessly shot for three hours. The only real mission is to save the story, but how can you save something that doesn't exist? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/zoe-kravitz-shares-hilarious-snake-mishap-destroyed-taylor-swift-bathroom-2771192-2025-08-14",
      "headline": "Zoe Kravitz shares hilarious snake mishap that destroyed Taylor Swift's bathroomActor Zoe Kravitz shares how a pet snake, a wildfire evacuation, and Taylor Swift's Beverly Hills mansion led to an unforgettable, and destructive celebrity sleepover."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sidharth-malhotra-janhvi-kapoor-seek-blessings-tirupati-param-sundari-2771153-2025-08-14",
      "headline": "Sidharth and Janhvi seek blessings at Tirupati ahead of Param Sundari releaseActors Sidharth Malhotra and Janhvi Kapoor visited the Tirumala temple in Tirupati on Wednesday. Their visit came ahead of the release of their film 'Param Sundari' on August 29. Malhotra opened up about his experience in an Instagram video. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actor-sadaa-sayed-breaks-down-over-supreme-court-stray-dog-removal-verdict-2771147-2025-08-14",
      "headline": "Actor Sadaa Sayed moved to tears over top court's stray dog order: I feel ashamedActor Sadaa Sayed broke down in tears over the Supreme Court's order to remove all stray dogs from Delhi. Her emotional response highlights the controversy and public concern surrounding the ruling."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/massive-cloudburst-in-jks-chositi-union-minster-says-substantial-casualties-feared-2771209-2025-08-14",
      "headline": "45 dead, over 200 missing as cloudburst in J&K's Kishtwar triggers flash flood UpdatesA massive cloudburst struck Chositi in Jammu and Kashmir near the Machail Mata Shrine on Thursday, killing at least 44. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-claims-credit-again-for-india-pakistan-ceasefire-glbs-2771473-2025-08-15",
      "headline": "We solved that: Trump at it again, claims credit for India-Pakistan ceasefireDespite India repeatedly rejecting any third-party mediation in the ceasefire, stating that no foreign leader asked it to halt military operations, Trump has claimed since May 10 that he helped secure a \"full and immediate\" ceasefire."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-gallantry-awards-operation-sindoor-air-warriors-vir-chakra-2771299-2025-08-14",
      "headline": "Gallantry awards for 36 Op Sindoor air warriors, 9 IAF officers get Vir ChakraNine Indian Air Force officers, including fighter pilots who targeted terrorist groups' headquarters in Muridke and Bahawalpur and Pakistan military assets in Operation Sindoor were awarded the Vir Chakra - the third-highest wartime gallantry medal."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/trump-says-tariffs-on-india-probably-pushed-putin-to-negotiating-table-2771446-2025-08-14",
      "headline": "Trump says tariffs on India 'probably' pushed Putin to negotiating tableTrump noted that the additional tariffs he imposed against India \"essentially took them out of buying oil from Russia,\" adding that India was Moscow's second-largest customer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/photo-essay/sholay-completes-50-years-iconic-dialogues-and-how-to-use-them-288-14-08-2025",
      "headline": "Sholay@50: Its iconic dialogues, and how to use themSholay (1975), directed by Ramesh Sippy, is not just a film; it's a cultural juggernaut that has shaped India's cinematic and social landscape for decades. From Gabbar Singh's villainous zingers to Basanti's chatterbox charm, its dialogues have hijacked India's lingua franca, folklore, and meme culture like a rogue Dhanno on a rampage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/putin-praises-trumps-energetic-and-sincere-efforts-to-end-ukraine-war-glbs-2771461-2025-08-15",
      "headline": "Energetic, sincere efforts to end war: Putin praises Trump ahead of Alaska summitPutin praised Trump's \"energetic and sincere\" efforts to end the Ukraine war ahead of Alaska summit, hinting at nuclear arms talks and potential peace agreements.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/op-sindoor-will-be-recorded-in-history-as-precedent-in-fight-against-terrorism-president-in-i-day-speech-2771371-2025-08-14",
      "headline": "Op Sindoor historic example in fight against terror: President in I-Day speechIn her address to the nation on the eve of 79th Independence Day, President Droupadi Murmu said Operation Sindoor was carried out \"in a decisive manner and with steely resolve\" and showed that \"our armed forces are prepared to meet any eventuality when it comes to guarding the nation.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jangli-maharaj-road-pune-history-hot-mix-technology-pothole-free-indian-streets-pothole-plague-pmc-civil-engineering-2770138-2025-08-14",
      "headline": "How Pune's indestructible JM Road shames contractors, babus, netas alikeCan a road in India remain pothole-free for 50 years? A 2.5-km stretch in Pune, known as Jangli Maharaj Road, shines as an example of civic engineering amid the pan-India pothole plague. Built in 1976, the road came with a 10-year warranty and hasn't needed major repairs in all these years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/does-mamata-banerjee-west-bengal-bangla-industry-film-diktat-suffer-from-devdas-syndrome-deep-rooted-2771336-2025-08-14",
      "headline": "Mamata's Bangla film diktat and the Devdas syndromeCM Mamata Banerjee-led West Bengal government made it a must for movie halls to screen a Bengali film every day in the peak 3 to 9 PM slot. Though corralling might help local film industries, deep-rooted problems need to be addressed. Self-pity, which this move reeks of, is the worst enemy of improvement. And who epitomises it more than the hero of Devdas, a movie first released in Bengali in 1935."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/flashfloods-hit-popular-religious-trek-to-shree-machail-mata-temple-in-kishtwar-district-of-jammu-and-kashmir-2771357-2025-08-14",
      "headline": "Kishtwar Flash Floods: What happened on the Machail Mata Yatra routeThe mud-laden floods hit homes and temporary camps set up by pilgrims at Chashoti village, which falls nearly 8 km away from their temple destination. The village is situated at an altitude of 8,000 feet. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jinnah-escape-gandhi-struggle-nehru-tryst-the-last-24-hours-of-british-raj-2771200-2025-08-14",
      "headline": "Jinnah's escape, Gandhi's struggle, Nehru's tryst: The last 24 hours of British RajOn August 14, 1947, tension, hope, and tragedy swirled, as the countdown to the end of the British Raj began. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-chinas-xinjiang-tibet-rail-plan-near-india-border-is-a-red-flag-2770665-2025-08-13",
      "headline": "Why China's Xinjiang-Tibet rail plan near India border is a red flagThe railway line plan emerges at a time PM Narendra Modi is set to visit Tianjin in China for the Shanghai Cooperation Organisation (SCO) Summit in August"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jammu-kishtwar-cloudburst-flash-floods-rescue-efforts-ongoing-2771444-2025-08-14",
      "headline": "Faces soaked in blood, bodies battered, Kishtwar's cloudburst nightmare in picturesWith over 1,000 people estimated to have been at the cloudburst site, the Army, disaster relief forces, and locals are racing against time to pull the injured from piles of slush and rocks and rush them to hospitals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/deal-or-disaster-how-donald-trump-vladimir-putin-closed-door-meet-will-end-three-points-explained-2771342-2025-08-14",
      "headline": "Deal or disaster? How Trump-Putin closed-door meet might end | 3 big pointsAs Donald Trump and Vladimir Putin meet for a high-stakes closed-door meeting in Alaska, fears mount over risky \"peace\" deals, and a tempting Arctic resources offer. From rewarding Russia's aggression to fracturing Nato unity, the summit could reshape global alliances, and test the West's ability to stand firm against Moscow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/dharmasthala-karnataka-mass-burial-case-whistleblower-revelations-buried-bodies-myself-2771214-2025-08-14",
      "headline": "Buried 80 bodies myself: Dharmasthala whistleblower's explosive 'revelations'The whistleblower in the Dharmasthala mass burial case revealed how the bodies, allegedly of sexual assault victims, were buried in forest areas without documentation or official oversight."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/government-should-not-succumb-to-us-tariff-pressure-by-donald-trump-says-former-niti-aayog-ceo-amitabh-kant-2771445-2025-08-14",
      "headline": "India should not succumb: Amitabh Kant urges government to resist Trump tariffsFormer NITI Aayog CEO Amitabh Kant advised the government to take the path of negotiation before imposing any retaliatory tariffs on the US.   "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/mahindra-be-6-batman-edition-launched-at-rs-2779-lakh-2771422-2025-08-14",
      "headline": "Mahindra meets Batman. Meet the BE 6, world's first Batman-inspired SUVThe Mahindra BE 6 is limited to just 300 units, bookings will open on August 23 and it is priced at Rs 27.79 lakh (ex-showroom).\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/passengers-sit-on-dharna-on-the-runway-of-delhi-airport-after-flight-cancelled-due-to-landing-restrictions-2771433-2025-08-14",
      "headline": "Passengers stage brief protest on Delhi airport runway after IndiGo flight returnsAccording to sources, the Delhi–Darbhanga flight was initially delayed due to weather conditions in the Delhi-NCR region. After take-off, the aircraft was forced to return to its base as Darbhanga Airport had landing restrictions due to operational timing limits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/any-misadventure-will-have-painful-consequences-india-slams-hateful-comments-by-pakistani-leadership-2771282-2025-08-14",
      "headline": "Any misadventure will have painful consequences: India slams Asim Munir's remarksIndia lashed out at Pakistan Army chief Asim Munir's \"reckless\" nuclear threats, saying such war-mongering comments were part of Islamabad's playbook to distract from its domestic failures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/coolie-review-rajinikanth-lokesh-kanagaraj-too-many-ideas-too-little-impact-2771082-2025-08-14",
      "headline": "Coolie review: Rajinikanth's film has too many ideas, but too little impactRelease Date:Thu Aug 14, 2025Coolie movie review: Director Lokesh Kanagaraj's 'Coolie', starring Rajinikanth, Shruti Haasan and Sathyaraj, is a template revenge thriller that takes more detours than it should. Keeping Rajinikanth's charm aside, the film hardly offers anything new or substantial."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/italian-brain-rot-tiktoks-weirdest-meme-craze-explained-2771334-2025-08-14",
      "headline": "Italian brain rot: TikTok's weirdest meme craze, explainedWhile the name, Italian brain rot, might suggest some connection to Italy, child psychologist Riddhi Doshi is quick to clarify that it has nothing to do with Italian culture and everything to do with chaotic, nonsensical, AI-generated content."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/wall-collapses-due-to-heavy-rain-in-southwest-delhis-vasant-vihar-two-boys-killed-2771394-2025-08-14",
      "headline": "2 boys killed after wall collapses due to heavy rain in Delhi's Vasant ViharThe wall that collapsed belonged to the Delhi Development Authority (DDA). The victims were rescued from the debris and rushed to AIIMS Trauma Centre in PCR vans, where doctors declared them dead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-and-china-holding-talks-to-resume-trade-between-the-two-nations-through-lipulekh-shipki-la-nathu-la-passes-2771312-2025-08-14",
      "headline": "India-China in talks to resume border trade after 5-year gap as tensions easeBoth nations are working together to resume trade through the mountain passes of Lipulekh, Shipki La, Nathu La, said Ministry of External Affairs (MEA) spokesperson Randhir Jaiswal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/burial-orders-from-temples-information-centre-locals-saw-burials-least-bothered-dharmasthala-whistleblower-2771186-2025-08-14",
      "headline": "Exclusive: Dharmasthala whistleblower claims burial orders came from templeIn an exclusive India Today interview, the Dharmasthala whistle-blower alleged decades-long undocumented burials in forest areas. He claimed temple authorities ordered the burials, many showing assault marks, while locals remained silent. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/war-2-day-1-box-office-collection-early-estimates-detailed-report-hrithik-roshan-jr-ntr-may-have-spy-universe-lowest-opener-2771458-2025-08-14",
      "headline": "War 2 Day 1 early box office: Hrithik-Jr NTR may have spy universe's lowest openerThe trade industry was expecting 'War 2' to open in the range of Rs 40 crore nett in Hindi - like 'Tiger 3' - but things don't seem promising enough. The film might have just opened in the range of Rs 60 crore in the overall domestic market. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/wednesday-season-2-part-2-trailer-final-episodes-netflix-jenna-ortega-meets-spirit-guide-2771400-2025-08-14",
      "headline": "Wednesday Season 2 Part 2 trailer: Jenna Ortega meets spirit-guide as mayhem unfoldsThe trailer for the last four episodes of 'Wednesday: Season 2 - Part 2' has been released on Netflix. The show is headed towards more chaos as Wednesday wakes from a coma and meets a new spirit guide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/coolie-early-box-office-day-1-detailed-estimates-report-rajinikanth-inks-tamil-cinema-history-in-rs-150-crore-gold-2771451-2025-08-14",
      "headline": "Coolie early box office Day 1: Rajinikanth inks Tamil history in Rs 150 crore goldRajinikanth has cemented his God-like stature in the Tamil film industry as his film 'Coolie' made a thunderous opening of around Rs 150 crore gross worldwide. At least the initial trends suggest the same. Here's the detailed report. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mrunal-thakur-apologises-body-shaming-bipasha-basu-old-video-2771429-2025-08-14",
      "headline": "Mrunal Thakur apologises for body-shaming Bipasha Basu, calls it a teenager's mistakeActor Mrunal Thakur has apologised for body-shaming actor Bipasha Basu in a resurfaced video. The apology comes amid widespread criticism and renewed conversations on body positivity in Bollywood."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-badge-bravery-spirit-new-mantra-revival-2771457-2025-08-14",
      "headline": "Badge, Bravery and Spirit: The new mantra driving Man United's revivalMan United CEO Omar Berrada has laid out a bold vision built on 'Badge, bravery, spirit' to revive the club's culture. Staff responses ranged from praise to pointed criticism, as Sesko and Bruno Fernandes drew plaudits for their loyalty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2025-matteo-berrettini-withdraws-injury-2771456-2025-08-14",
      "headline": "Italy's Matteo Berrettini pulls out of tournament due to injuryItalian tennis star Matteo Berrettini has withdrawn from the 2025 US Open due to ongoing injury problems. Earlier, Bulgarian veteran Grigor Dimitrov and Spain's Paula Badosa also pulled out from the major. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/aiff-supreme-court-isl-crisis-season-delay-2025-2771453-2025-08-14",
      "headline": "AIFF to approach Supreme Court over the ISL impasse after discussions with clubsThe All India Football Federation (AIFF) has agreed to bring the prevailing legal uncertainty and administrative vacuum to the Supreme Court's attention next week, following a meeting with the lawyers of Indian Super League clubs on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chennai-grand-masters-vincent-keymer-wins-title-2771448-2025-08-14",
      "headline": "Chennai Grand Masters: Vincent Keymer secures draw to seal Masters titleVincent Keymer clinched the Chennai Grand Masters title with a round to spare, becoming its first sole champion. The German also broke into the live FIDE top 10, while the Masters' podium race and the Challengers title battle remain wide open."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/sry-gene-test-mandatory-women-athletes-world-athletics-championships-tokyo-2771447-2025-08-14",
      "headline": "AFI introduces SRY gene test for female athletes on World Athletics' directiveFollowing the World Athletics rule requiring female athletes to undergo an SRY gene test to compete in world ranking events, the Athletics Federation of India (AFI) has announced that eligible athletes must complete the mandatory test before next month's World Championships in Tokyo, Japan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-in-odi-cricket-guide-juniors-shubman-gill-suresh-raina-2771443-2025-08-14",
      "headline": "Virat Kohli, Rohit Sharma should keep playing ODIs to guide juniors: RainaSuresh Raina says Virat Kohli and Rohit Sharma's ODI experience is vital to guide India's youngsters. He also backs Mohammed Siraj as an all-format bowler after his stellar England series, highlighting his consistency and durability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-premier-league-chittagong-kings-dispute-termination-bpl-2771440-2025-08-14",
      "headline": "Bangladesh Cricket Board terminates BPL franchise over 46 crore taka disputeThe Bangladesh Cricket Board has suspended BPL franchise Chittagong Kings after terminating its deal with SQ Sports Enterprise Ltd. over unpaid dues exceeding 46 crore taka. The franchise repeatedly defaulted on payments prompting legal action and the continuation of proceedings.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-womens-world-cup-2025-mithali-raj-india-seize-small-moments-2771432-2025-08-14",
      "headline": "Seize small moments: Mithali Raj on how India can end World Cup droughtMithali Raj believes India can end their ICC title drought at the Women's ODI World Cup by seizing key moments in big games. She says a home win could transform women's cricket, with youngsters Kranti Goud and Shree Charani already making their mark."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-england-chris-woakes-shoulder-injury-recovery-ashes-2771423-2025-08-14",
      "headline": "Chris Woakes offers positive shoulder injury update ahead of AshesEngland pacer Chris Woakes has provided an encouraging update on his recovery from a dislocated shoulder, raising hopes of his participation in the Ashes later this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-women-a-vs-india-women-a-2nd-one-dayer-2771419-2025-08-14",
      "headline": "Australia A vs India A, 2nd Women's One-Dayer: When and where to watchAUS-W A vs IND-W A: Radha Yadav's India Women A and Tahlia McGrath's Australia A will lock horns in the second One-Dayer on Friday, August 15 at the Ian Healy Oval in Brisbane. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/muheet-shabir-journey-from-kashmir-to-punjab-fc-growth-ambition-2771396-2025-08-14",
      "headline": "Goalkeeper Muheet Shabir's story: From valleys of Kashmir to heartland of PunjabWhen Muheet Shabir pulls on his gloves for Punjab FC, he carries more than the responsibility of guarding the goal - he carries the spirit of the Kashmir Valley. The 23-year-old from Srinagar traded the snow-clad mountains of his homeland for the flat, fertile plains of Punjab when he joined the club last year from Real Kashmir."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-premier-league-chittagong-kings-dispute-termination-bpl-2771440-2025-08-14",
      "headline": "Bangladesh Cricket Board terminates BPL franchise over 46 crore taka disputeThe Bangladesh Cricket Board has suspended BPL franchise Chittagong Kings after terminating its deal with SQ Sports Enterprise Ltd. over unpaid dues exceeding 46 crore taka. The franchise repeatedly defaulted on payments prompting legal action and the continuation of proceedings.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-womens-world-cup-2025-mithali-raj-india-seize-small-moments-2771432-2025-08-14",
      "headline": "Seize small moments: Mithali Raj on how India can end World Cup droughtMithali Raj believes India can end their ICC title drought at the Women's ODI World Cup by seizing key moments in big games. She says a home win could transform women's cricket, with youngsters Kranti Goud and Shree Charani already making their mark."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-england-chris-woakes-shoulder-injury-recovery-ashes-2771423-2025-08-14",
      "headline": "Chris Woakes offers positive shoulder injury update ahead of AshesEngland pacer Chris Woakes has provided an encouraging update on his recovery from a dislocated shoulder, raising hopes of his participation in the Ashes later this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-women-a-vs-india-women-a-2nd-one-dayer-2771419-2025-08-14",
      "headline": "Australia A vs India A, 2nd Women's One-Dayer: When and where to watchAUS-W A vs IND-W A: Radha Yadav's India Women A and Tahlia McGrath's Australia A will lock horns in the second One-Dayer on Friday, August 15 at the Ian Healy Oval in Brisbane. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/muheet-shabir-journey-from-kashmir-to-punjab-fc-growth-ambition-2771396-2025-08-14",
      "headline": "Goalkeeper Muheet Shabir's story: From valleys of Kashmir to heartland of PunjabWhen Muheet Shabir pulls on his gloves for Punjab FC, he carries more than the responsibility of guarding the goal - he carries the spirit of the Kashmir Valley. The 23-year-old from Srinagar traded the snow-clad mountains of his homeland for the flat, fertile plains of Punjab when he joined the club last year from Real Kashmir."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}