{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-settles-170-points-lower-nifty-below-25500-maruti-down-1-percent-2750131-2025-07-03",
      "headline": "Sensex settles 170 points lower, Nifty below 25,500; Maruti down 1%Sensex settles 170 points lower, Nifty below 25,500; Maruti down 1%"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/investing-mutual-fund-sip-regular-checks-money-management-portfolio-review-2750107-2025-07-03",
      "headline": "Don't set and forget: Why your SIPs need regular check-upsWhile the idea of 'set it and forget it' may seem peaceful, doing so could lead to long-term underperformance, missed opportunities, or even a shortfall in your retirement goals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zerodha-founder-and-ceo-nithin-kamath-cautions-investors-against-risks-in-unlisted-shares-2750088-2025-07-03",
      "headline": "Zerodha's Nithin Kamath cautions investors against risks in unlisted sharesNithin Kamath said that many people get carried away by the hype around buying shares of companies before they go public. But in reality, unlisted shares are risky and can leave investors stuck without a way to sell."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/crude-oil-wti-brent-forecast-middle-east-tension-iran-israel-conflict-sp-global-2750084-2025-07-03",
      "headline": "Has the oil market grown numb to conflict in the Middle East?Global oil demand growth in 2025 is on track to be just 870,000 barrels per day. This would make it the weakest year for oil demand since 2001, except during major economic disruptions like the 2008 financial crisis and the COVID-19 pandemic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/india-income-inequality-now-worse-than-british-era-says-financial-analyst-2750041-2025-07-03",
      "headline": "India's income inequality now worse than British era, says financial analystThe divide between India's rich and poor is bigger than ever, with almost half the people surviving on very little, while a privileged few hold most of the wealth, says Hardik Joshi, a financial analyst."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdfc-bank-ceo-sashidhar-jagdishan-moves-supreme-court-against-lilavati-hospital-fir-2749997-2025-07-03",
      "headline": "HDFC Bank CEO moves Supreme Court against Lilavati Hospital FIRThe clash between one of India's largest private banks and a big Mumbai hospital is linked to a financial transaction, but the exact details of the FIR or the amount involved were not shared in court."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/lost-your-itr-login-here-is-how-to-file-income-tax-using-net-banking-2749970-2025-07-03",
      "headline": "Lost your ITR login? Here's how to file income tax using net bankingIf you can't remember your Income Tax portal password, you don't need to reset it straight away. Most major banks in India allow you to access the e-Filing portal through their net banking services. It's a safe and easy way to file your return on time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/nestle-axis-bank-dividend-stock-ex-date-share-price-stock-market-july-3-2749960-2025-07-03",
      "headline": "Axis Bank, Nestle India set dividend record dates; last day to buy shares todayNestle India and Axis Bank have fixed July 4 as the record date, which will decide who is eligible to receive the dividend payouts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/foxconn-pulls-out-chinese-staff-from-plants-south-india-iphone-production-takes-hit-report-2749935-2025-07-03",
      "headline": "The quiet Chinese game to disrupt iPhone production in IndiaThe latest model, the iPhone 17, was to be a huge step in Apple's plans to make India its second home for high-end production. That roadmap now looks uncertain as Foxconn has pulled out Chinese staff. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-soham-parekh-the-indian-techie-accused-of-moonlighting-in-us-2749908-2025-07-03",
      "headline": "Who is Soham Parekh, Indian techie who worked at 4-5 US startups at same time?Soham Parekh, who is believed to be based in India, is alleged to have simultaneously worked at up to four or five startups—many of them backed by Y Combinator—raising questions about hiring practices in remote-first tech culture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-157-points-higher-nifty-above-25500-eternal-up-2-percent-2749901-2025-07-03",
      "headline": "Sensex, Nifty struggle for direction as markets await India-US deal newsThe S&P BSE Sensex was down by 13.01 points to 83,396.68, while the NSE Nifty50 lost 3.70 points to 25,449.70 as of 9:29 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-expectation-sensex-nifty-trading-setup-bse-nse-us-vietnam-trade-deal-china-2749878-2025-07-03",
      "headline": "Will Sensex, Nifty open higher amid US–Vietnam trade deal impact?Gift Nifty futures were trading at 25,584 points at 8:18 am, suggesting an increase from the previous close of 25,574.50."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ramayana-first-glimpse-review-with-ranbir-kapoor-yash-nitesh-tiwari-feels-like-a-moment-for-indian-cinema-2750117-2025-07-03",
      "headline": "Why Ranbir Kapoor-Yash's Ramayana feels like a moment for Indian cinemaNitesh Tiwari's 'Ramayana' is a cinematic moment shaped by faith, scale, and storytelling ambition. With Ranbir Kapoor, Sai Pallavi, Yash, and Sunny Deol leading a power-packed cast, the film dares to honour the epic as more than mythology. The first glimpse feels less like a teaser and more like the beginning of something historic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kyunki-saas-bhi-kabhi-bahu-thi-turns-25-when-people-fell-at-ekta-kapoor-feet-cried-over-mihir-death-smriti-irani-2750111-2025-07-03",
      "headline": "Kyunki… turns 25: When people fell at Ekta Kapoor's feet, cried over Mihir's death'Kyunki Saas Bhi Kabhi Bahu Thi', the iconic Indian television show that redefined the small screen 25 years ago, is all set for a grand comeback with a new season. On the note, its creative director, Nivedita Basu, spoke to us discussing its relevance, craze and BTS moments. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anupam-kher-clash-with-aamir-khan-dil-hai-ke-manta-nahin-shoot-2750080-2025-07-03",
      "headline": "Anupam Kher recalls clash with Aamir Khan during Dil Hai Ke Manta Nahin shootAnupam Kher recalled a past disagreement with Aamir Khan during the shoot of 'Dil Hai Ke Manta Nahin', where Aamir criticised his scene interpretation. The actor shared the story while promoting his upcoming film 'Metro... In Dino', releasing on 4 July 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ramayana-first-glimpse-background-score-gives-goosebumps-fans-praise-ranbir-kapoor-sai-pallavi-2750063-2025-07-03",
      "headline": "Ramayana 1st look: Fans praise Ranbir Kapoor, background score gives goosebumpsNitesh Tiwari's 'Ramayana's first glimpse is finally out. The film starring Ranbir Kapoor has given goosebumps to fans, with many praising the background score. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/parag-tyagi-consoles-shefali-jariwala-father-at-prayer-meet-2750030-2025-07-03",
      "headline": "Parag Tyagi consoles Shefali Jariwala's father as he breaks down at prayer meetAn emotional video of late actor Shefali Jariwala's husband, Parag Tyagi, consoling her father has surfaced on social media. The video is from her prayer meeting held in Mumbai on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/deepika-padukone-not-first-indian-hollywood-walk-of-fame-meet-sabu-dastagir-elephant-boy-2750051-2025-07-03",
      "headline": "Deepika's honour is big, but she's not 1st Indian on Hollywood Walk of FameDeepika Padukone has been named a 2025 Hollywood Walk of Fame honouree. However, many don't know that the first Indian to receive this honour was Sabu Dastagir, a famous actor in Hollywood over 80 years ago."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mumtaz-shammi-kapoor-love-affair-interview-wife-neila-devi-doesnt-like-her-talking-about-him-2749999-2025-07-03",
      "headline": "Actor Mumtaz says Shammi Kapoor's wife doesn't like her talking about himMumtaz recently shared that she doesn't talk about Shammi Kapoor to avoid upsetting his wife, Neila Devi. The couple worked together on several Bollywood classics, and were also in a relationship. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/hari-hara-veera-mallu-trailer-event-cancelled-in-hyderabad-sandhya-theatre-due-to-huge-fan-gathering-2750007-2025-07-03",
      "headline": "Hari Hara Veera Mallu trailer event cancelled in Hyderabad due to huge fan gatheringThe trailer screening event for 'Hari Hara Veera Mallu' at Hyderabad's Sandhya Theatre was cancelled due to an overwhelming turnout of fans raising safety concerns. Despite this, the trailer was released and screenings continued at other venues, generating excitement for the film's July 24 release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ramayana-first-glimpse-out-ranbir-kapoor-as-ram-sai-pallavi-sita-yash-ravana-nitesh-tiwari-2750026-2025-07-03",
      "headline": "Ramayana 1st glimpse out: Ranbir Kapoor, Yash, Sai Pallavi's film teases epic sagaThe first glimpse of Ranbir Kapoor's 'Ramayana' is finally out, offering a stunning visual spectacle. Directed by Nitesh Tiwari, the film also stars Sai Pallavi and Yash, and marks the beginning of a two-part epic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kamal-haasan-thug-life-netflix-release-karnataka-ban-2749998-2025-07-03",
      "headline": "Kamal Haasan's Thug Life releases on Netflix, a month after theatrical release'Thug Life', starring Kamal Haasan and directed by Mani Ratnam, is now available on Netflix, streaming in five languages. The film began streaming on the platform 28 days after its theatrical release. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/hari-hara-veera-mallu-trailer-pawan-kalyan-warrior-hero-bobby-deol-2749996-2025-07-03",
      "headline": "Hari Hara Veera Mallu trailer: Pawan Kalyan battles Bobby Deol in quest for dharmaThe trailer for 'Hari Hara Veera Mallu', starring Pawan Kalyan, promises a grand period action drama filled with powerful visuals and intense battle scenes. Bobby Deol plays a fierce villain in the film scheduled for release on July 24, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kriti-sanon-dhanush-aanand-l-rai-tere-ishk-mein-wrap-up-party-pics-with-cake-selfies-emotions-pics-2749953-2025-07-03",
      "headline": "Kriti-Dhanush celebrate Tere Ishk Mein with cake, selfies, emotions. PicsKriti Sanon and Dhanush concluded the shooting for 'Tere Ishk Mein' with Aanand L Rai. The director shared insights and celebratory moments from their wrap-up party on social media. The film is set for release on November 28 this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-chief-guest-at-16th-indian-film-festival-of-melbourne-2749979-2025-07-03",
      "headline": "Aamir Khan to be the chief guest at 16th Indian Film Festival of MelbourneAamir Khan will be the chief guest at the 16th edition of the Indian Film Festival of Melbourne 2025, where a special retrospective will celebrate his iconic film career. His latest film, 'Sitaare Zameen Par', will be screened at the event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-sethupathi-hugs-son-surya-phoenix-premiere-in-chennai-2749987-2025-07-03",
      "headline": "Vijay Sethupathi hugs son Surya at premiere of his debut film, Phoenix. WatchVijay Sethupathi congratulated his son, Surya, and the team of his debut film, 'Phoenix'. A special premiere was arranged in Chennai on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kajol-twinkle-khanna-new-ott-chat-show-on-amazon-prime-video-india-2749963-2025-07-03",
      "headline": "Kajol and Twinkle Khanna to host new chat show on OTT platform: ReportBollywood stars Kajol and Twinkle Khanna are reportedly joining forces for a new chat show. The show will reportedly feature prominent names from the film industry and will reportedly stream on Prime Video."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kerala-high-court-film-review-jsk-janaki-vs-state-cbfc-title-dispute-2749946-2025-07-03",
      "headline": "Kerala High Court to watch Janaki vs State of Kerala amid censorship controversyKerala High Court will watch Suresh Gopi and Anupama Parameswaran's 'Janaki Vs State of Kerala' on July 5. The Censor Board of Film Certification demanded a change of the film's title over objections to the use of the name Janaki as it refers to Goddess Sita."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-nick-jonas-serve-style-goals-at-wimbledon-2025-amid-heads-of-state-promotions-2749936-2025-07-03",
      "headline": "Priyanka Chopra-Nick Jonas serve style goals at Wimbledon 2025 amid film promotionsPriyanka Chopra took a stylish break from promoting her Hollywood film 'Heads of State' to attend Wimbledon 2025 with husband Nick Jonas. Her latest film, also starring John Cena and Idris Alba, is streaming on Prime Video. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/ekta-kapoor-reacts-smriti-irani-refusing-kyunki-saas-bhi-kabhi-bahu-thi-2-2014-2749934-2025-07-03",
      "headline": "Ekta Kapoor reacts to Smriti Irani's claim of refusing Kyunki 2 in 2014Ekta Kapoor reacted to Smriti Irani's comment on refusing the sequel to 'Kyunki Saas Bhi Kabhi Bahu Thi' in 2014. The show's reboot was originally scheduled for July 3 this year, but has now been postponed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/amitabh-bachchan-kbc-was-a-media-quake-says-shows-producer-siddhartha-basu-exclusive-2749933-2025-07-03",
      "headline": "KBC turns 25: Amitabh Bachchan-show was a media quake, says creator Siddhartha Basu'Kaun Banega Crorepati', which launched in 2000, revolutionised Indian television and revitalised Amitabh Bachchan's career. As it marked 25 years, its creator Siddhartha Basu reflected on the show's enduring appeal and its impact on countless lives across the nation."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/thiruvananthapuram/story/uk-unable-to-repair-f-35-stranded-in-kerala-likely-to-dismantle-fighter-jet-to-transport-it-back-sources-2750082-2025-07-03",
      "headline": "UK's Royal F-35 jet can't fly back, may be dismantled to move from KeralaThe British Royal Navy's F-35 fighter jet that made an emergency landing in Kerala on June 14 remains grounded due to unresolved issues and may be dismantled for airlifting to the UK."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/tortured-students-stabbed-my-friend-chilling-allegations-against-kolkata-rapist-2750118-2025-07-03",
      "headline": "Tortured students, stabbed my friend: Chilling allegations against Kolkata 'rapist'Another student has come forward with disturbing allegations against Monojit Mishra, claiming that he routinely subjected students to mental harassment and even physical assault."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/brazil-eyes-india-akash-missile-operation-sindoor-pakistan-china-pm-modi-brics-summit-air-defence-2750095-2025-07-03",
      "headline": "Brazil eyes India's Akash system that killed Pak missiles during Op SindoorBrics member Brazil has shown keen interest in India's Akash supersonic missiles, among other India-made military hardware. Brazil's interest in Akash comes after its stellar performance against Pakistani attacks during Operation Sindoor. PM Modi will be visiting Brazil this week and talks are likely to include defence cooperation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-live-score-2nd-test-day-2-updates-edgbaston-2750085-2025-07-03",
      "headline": "2nd Test, Day 2 Live: Gill and Jadeja look to stretch India's totalEngland (ENG) vs India (IND), 2nd Test Day 2 Live Updates: Shubman Gill, batting on 114, will look to continue his solid approach as India eye a big first innings total. He has Ravindra Jadeja for company as England look to break this big sixth-wicket partnership with the second new ball. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ramayana-first-glimpse-review-with-ranbir-kapoor-yash-nitesh-tiwari-feels-like-a-moment-for-indian-cinema-2750117-2025-07-03",
      "headline": "Why Ranbir Kapoor-Yash's Ramayana feels like a moment for Indian cinemaNitesh Tiwari's 'Ramayana' is a cinematic moment shaped by faith, scale, and storytelling ambition. With Ranbir Kapoor, Sai Pallavi, Yash, and Sunny Deol leading a power-packed cast, the film dares to honour the epic as more than mythology. The first glimpse feels less like a teaser and more like the beginning of something historic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/our-vaccine-safe-no-link-to-sudden-deaths-covishield-makers-after-siddaramaiah-links-shots-to-heart-attacks-2750083-2025-07-03",
      "headline": "Our vaccines are safe: Covishield makers over link with heart attack deathsThe Serum Institute of India confirmed that the vaccines used during the Covid-19 pandemic are safe and have no causal link to cardiac fatalities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/diogo-jota-liverpool-dead-car-accident-weeks-after-wedding-report-2750076-2025-07-03",
      "headline": "Liverpool footballer Diogo Jota dies in car accident, 10 days after weddingLiverpool and Portugal forward Diogo Jota has reportedly died in a car accident in Spain, just days after his wedding. His brother André, also a footballer, was travelling with him and also died in the crash."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/disha-salian-death-case-mva-devendra-fadnavis-apology-linking-aaditya-thackeray-foul-play-2750112-2025-07-03",
      "headline": "Devendra Fadnavis must apologise: MVA after no foul play in Disha Salian's deathMumbai Police told Bombay High Court there was no foul play in Disha Salian's death, prompting opposition leaders to demand an apology from Devendra Fadnavis and the BJP for targetting Aaditya Thackeray."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/melania-einstein-visa-why-some-americans-want-flotus-deported-us-donald-trump-immigration-policy-eb1-2750034-2025-07-03",
      "headline": "Melania and Einstein visa: Why some Americans want FLOTUS deportedA petition campaign demanding that First Lady Melania Trump, her parents, and son Barron be deported from the US has gained traction with thousands signing it. Melania reportedly entered the US on an EB-1 \"Einstein visa\", meant for individuals with exceptional ability. President Trump's critics are using the Melania case to slam his immigration policies as hypocritical."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/no-one-except-dalai-lama-can-decide-his-successor-says-union-minister-kiren-rijiju-snubs-china-2750002-2025-07-03",
      "headline": "India says no one except Dalai Lama can decide his successor, snubs ChinaChina insisted the Dalai Lama's next reincarnation must follow Beijing laws, but the Tibetan leader's office asserted the Gaden Phodrang Trust alone holds the power to decide the Buddhist monk's successor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-soham-parekh-the-indian-techie-accused-of-moonlighting-in-us-2749908-2025-07-03",
      "headline": "Who is Soham Parekh, Indian techie who worked at 4-5 US startups at same time?Soham Parekh, who is believed to be based in India, is alleged to have simultaneously worked at up to four or five startups—many of them backed by Y Combinator—raising questions about hiring practices in remote-first tech culture."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/siddaramaiah-asks-reporter-are-you-from-bjp-over-asp-nv-baramani-resignation-question-public-humiliation-2750016-2025-07-03",
      "headline": "Are you from BJP? Siddaramaiah snaps at reporter over cop's resignation questionKarnataka Chief Minister Siddaramaiah appeared visibly irritated after a reporter questioned him on Karnataka police officer's resignation. The ASP tendered his resignation and cited public rebuke by Siddaramaiah as humiliating."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/soham-parekh-memes-jokes-crown-him-ceo-of-multitasking-mystery-moonlighting-viral-claims-2750048-2025-07-03",
      "headline": "Internet attempts to solve the curious case of Soham Parekh with memes and jokesSeveral US-based startup founders alleged that Soham Parekh, apparently based in India, was secretly working at multiple places without informing any of them.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/foxconn-pulls-out-chinese-staff-from-plants-south-india-iphone-production-takes-hit-report-2749935-2025-07-03",
      "headline": "The quiet Chinese game to disrupt iPhone production in IndiaThe latest model, the iPhone 17, was to be a huge step in Apple's plans to make India its second home for high-end production. That roadmap now looks uncertain as Foxconn has pulled out Chinese staff. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-us-trade-talks-agriculture-dairy-sector-donald-trump-explain-bilateral-trade-gm-crops-subsidy-explained-2749828-2025-07-03",
      "headline": "The thick red line: Why India shouldn't agree with US on agriThe India-US trade deal is reportedly stuck because of DC's tough demands on the agriculture and dairy sectors. India shouldn't give in to Donald Trump's demands because agriculture is hugely subsidised in the US, with farmers there getting over $61,000 against India's $282. If concessions are to be made, it should be by the US, and not India. Here's why."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/chennai/story/chennai-teen-dies-of-electrocution-locals-blame-power-board-say-complaints-were-ignored-2750049-2025-07-03",
      "headline": "Chennai teen electrocuted in waterlogged street, residents blame power boardA 17-year-old boy returning home from tuition died of electrocution after stepping into a flooded street in Chennai's Tiruvottiyur. Residents say repeated complaints to the electricity board about exposed wires were ignored."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/gold-medal-no-job-inside-the-irony-of-indian-merit-2749992-2025-07-03",
      "headline": "Gold medal, no job: Inside the irony of Indian 'Merit'They aced every exam, collected medals like trophies, and made their families proud. But when it came time to get hired, India's toppers were left staring at empty inboxes. Welcome to the curious case of academic merit without market value."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/woman-teen-son-found-dead-in-delhis-lajpat-nagar-servant-arrested-2749915-2025-07-03",
      "headline": "Househelp murders woman, teen in Delhi's Lajpat Nagar after she scolds himThe main suspect, identified as Mukesh, 24, originally from Bihar and currently residing in nearby Amar Colony, was employed by the Sewanis as a driver and helper in their shop."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/four-men-attacks-bengaluru-restaurant-staff-for-not-providing-extra-cup-2750014-2025-07-03",
      "headline": "Video: Staffer assaulted for refusing to provide extra cup at Bengaluru coffee shopFour men brutally assaulted a hotel staffer at a popular coffee shop in central Bengaluru for refusing to provide an extra cup. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/pune/story/man-posing-as-delivery-agent-rapes-pune-woman-clicks-selfie-on-her-phone-2749947-2025-07-03",
      "headline": "'Delivery boy' rapes Pune woman in her flat, clicks selfie, leaves chilling textThe man left behind a threatening message on the woman's phone which read, \"I will come again.\" The accused had also taken a selfie on her phone."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/one-year-on-this-newly-discovered-alien-plant-is-just-seven-days-on-earth-2750100-2025-07-03",
      "headline": "One year on this newly discovered plant is just seven days on EarthThe team found that the planet, dubbed HIP 67522 b, orbits its parent star so tightly that it appears to cause frequent flares from the star's surface. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/features/story/rs-800-crore-joining-bonus-once-in-accenture-iitian-trapit-bansal-has-joined-meta-ai-superintelligence-team-2749437-2025-07-02",
      "headline": "Rs 800 crore bonus? Top IITian Trapit Bansal joins Meta AI superintelligence teamTrapit Bansal, an IIT-Kanpur alumnus and former OpenAI researcher, has joined Meta's new AI superintelligence team, bringing his deep learning and reasoning expertise to Zuckerberg's ambitious frontier model effort."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/kerala/story/kottayam-medical-college-collapse-woman-trapped-for-hours-dies-as-kerala-health-minister-veena-george-says-no-serious-situation-2750087-2025-07-03",
      "headline": "Kerala medical college block caves in, woman stuck under debris for 2 hours diesA portion of the Kottayam Medical College building in Kerala collapsed Thursday morning, killing a woman and injuring two others. The section was reportedly unused. Health Minister Veena George earlier stated that the situation was under control and there were \"no serious injuries.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/australian-man-sonny-blundell-dies-after-of-brain-bleed-after-backflip-celebrating-new-apartment-in-queensland-2750059-2025-07-03",
      "headline": "Australian man dies doing backflip to celebrate new life with partner in new homeAn 18-year-old man in Australia suffered fatal strokes and brain bleeding following a backflip injury during a housewarming celebration. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-live-score-2nd-test-day-2-updates-edgbaston-2750085-2025-07-03",
      "headline": "2nd Test, Day 2 Live: Shubman Gill, Jadeja look to stretch India's totalEngland (ENG) vs India (IND), 2nd Test Day 2 Live Updates: Shubman Gill, batting on 114, will look to continue his solid approach as India eye a big first innings total. He has Ravindra Jadeja for company as England look to break this big sixth-wicket partnership with the second new ball. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/diogo-jota-liverpool-dead-car-accident-weeks-after-wedding-report-2750076-2025-07-03",
      "headline": "Liverpool footballer Diogo Jota dies in car accident, 10 days after weddingLiverpool and Portugal forward Diogo Jota has reportedly died in a car accident in Spain, just days after his wedding. His brother André, also a footballer, was travelling with him and also died in the crash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-emma-raducanu-mental-health-alexander-zverev-therapy-2750058-2025-07-03",
      "headline": "Tennis is difficult: Emma Raducanu after Zverev sparks mental health chatEmma Raducanu opened up about the emotional toll of professional tennis amid Alexander Zverev's candid revelation, stressing the importance of mental resilience and support systems in a sport where defeat is more common than victory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ishan-kishan-bowling-county-championship-harbhajan-action-2750011-2025-07-03",
      "headline": "Watch: Ishan Kishan imitates Harbhajan Singh in rare County bowling chanceIshan Kishan has been enjoying his time in the UK. After hitting back-to-back fifties for Nottinghamshire in County Championships, Ishan entertained when he was given an opportunity to bowl on Wednesday, July 02. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-shubman-gill-no-4-role-always-belonged-bimingham-test-century-2749975-2025-07-03",
      "headline": "ENG vs IND: Shubman Gill slots into No. 4 like he has always belongedOn a day that was dominated by Jasprit Bumrah being rested for the Edgbaston Test, Shubman Gill showed why he was the best man to take up the mantle and continue India's rich tradition of having the best players at No.4 in Tests. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-top-seeds-advance-alcaraz-sabalenka-win-paolini-out-2749964-2025-07-03",
      "headline": "Day 4 schedule: Novak Djokovic, Jannik Sinner eye Round 3 berthsNormalcy returned to Wimbledon as top seeds comfortably won their second-round matches. Early exits by Paolini and others add drama ahead of Djokovic and Sinner's matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-ravindra-jaeja-proactive-intent-shoaib-bashir-varun-aaron-2749958-2025-07-03",
      "headline": "Ravindra Jadeja guiding India lower order vs England with intent: AaronENG vs IND: Ravindra Jadeja's composed 41* and a steady 99-run stand with skipper Shubman Gill helped India recover from a top-order collapse and end Day 1 of the Birmingham Test against England in a strong position."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/england-vs-india-yashasvi-jaiswal-press-conference-2nd-test-day-1-2749929-2025-07-03",
      "headline": "Shubman Gill has been an amazing captain, says Yashasvi JaiswalENG vs IND, 2nd Test: Yashasvi Jaiswal praised captain Shubman Gill, who scored a dogged hundred off 199 balls. It was his back-to-back centuries for the Indian skipper, having scored one on his Test captaincy debut in Leeds.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-2nd-test-yashasvi-jaiswal-achilles-heel-pujara-2749918-2025-07-03",
      "headline": "What's Yashasvi Jaiswal's Achilles heel? Cheteshwar Pujara weighs inENG vs IND: Yashasvi Jaiswal scored 87 runs off 107 balls as India posted 310 for five at Stumps on Day 1 of their second Test at the Edgbaston in Birmingham. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-2nd-test-chris-woakes-umpiring-calls-edgbaston-2749912-2025-07-03",
      "headline": "Chris Woakes not happy with close umpiring calls in Edgbaston TestENG vs IND: Chris Woakes was not happy with a couple of umpiring decisions that didn't go in his favour on the opening day of the second Test in Birmingham. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-2nd-test-gautam-gambhir-selection-calls-edgbaston-2749893-2025-07-03",
      "headline": "Tough talk, tame tactics: Gambhir faces heat over Edgbaston Test selection callsEngland vs India, 2nd Test: India head coach Gautam Gambhir's bold words after the Headingley Test defeat rang hollow at Edgbaston, where India's defensive team selection for the Edgbaston Test exposed a growing gap between his statements and actions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-ravindra-jaeja-proactive-intent-shoaib-bashir-varun-aaron-2749958-2025-07-03",
      "headline": "Ravindra Jadeja guiding India lower order vs England with intent: AaronENG vs IND: Ravindra Jadeja's composed 41* and a steady 99-run stand with skipper Shubman Gill helped India recover from a top-order collapse and end Day 1 of the Birmingham Test against England in a strong position."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/england-vs-india-yashasvi-jaiswal-press-conference-2nd-test-day-1-2749929-2025-07-03",
      "headline": "Shubman Gill has been an amazing captain, says Yashasvi JaiswalENG vs IND, 2nd Test: Yashasvi Jaiswal praised captain Shubman Gill, who scored a dogged hundred off 199 balls. It was his back-to-back centuries for the Indian skipper, having scored one on his Test captaincy debut in Leeds.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-2nd-test-yashasvi-jaiswal-achilles-heel-pujara-2749918-2025-07-03",
      "headline": "What's Yashasvi Jaiswal's Achilles heel? Cheteshwar Pujara weighs inENG vs IND: Yashasvi Jaiswal scored 87 runs off 107 balls as India posted 310 for five at Stumps on Day 1 of their second Test at the Edgbaston in Birmingham. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-2nd-test-chris-woakes-umpiring-calls-edgbaston-2749912-2025-07-03",
      "headline": "Chris Woakes not happy with close umpiring calls in Edgbaston TestENG vs IND: Chris Woakes was not happy with a couple of umpiring decisions that didn't go in his favour on the opening day of the second Test in Birmingham. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-2nd-test-gautam-gambhir-selection-calls-edgbaston-2749893-2025-07-03",
      "headline": "Tough talk, tame tactics: Gambhir faces heat over Edgbaston Test selection callsEngland vs India, 2nd Test: India head coach Gautam Gambhir's bold words after the Headingley Test defeat rang hollow at Edgbaston, where India's defensive team selection for the Edgbaston Test exposed a growing gap between his statements and actions."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}