{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-slashes-import-duty-on-bourbon-whiskey-to-50-per-cent-pm-modi-donald-trump-talks-2680358-2025-02-15",
      "headline": "India slashes import duty on bourbon whisky to 100% after Trump's criticismThe reduction in customs duty on bourbon whisky was notified on February 13 just ahead of Prime Minister Narendra Modi's talks with US President Donald Trump."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/what-is-digital-lending-5-key-benefits-you-should-know-2680169-2025-02-14",
      "headline": "What is digital lending? 5 key benefits you should know Digital lending platforms make use of advanced technology, thereby making the loan process faster, simpler and more efficient."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-has-it-really-been-simplified-for-taxpayers-2680087-2025-02-14",
      "headline": "New Income Tax bill: Has it really been simplified for taxpayers?The proposed income tax bill seeks to simplify and revamp the Income Tax Act of 1961, which has often been criticised for its complexity, making it challenging for ordinary taxpayers to navigate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/upi-transactions-changes-from-february-15-all-you-need-to-know-2680055-2025-02-14",
      "headline": "New UPI transaction rule: All you need to know about auto chargeback processThe changes are primarily regarding auto acceptance and rejection of chargebacks, thereby making the system more efficient."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-nifty-end-lower-fiis-continue-to-exit-dalal-street-2680072-2025-02-14",
      "headline": "Sensex, Nifty end lower as FIIs continue to exit Dalal StreetThe S&P BSE Sensex lost 199.76 points to end at 75,939.21, while the NSE Nifty50 lost 102.15 points to close at 22,929.25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vodafone-idea-stock-price-tumbles-6-today-what-triggered-the-slide-2680054-2025-02-14",
      "headline": "Explained: Why Vodafone Idea share price tumbled nearly 6%VI shares were down 5.09% to Rs 8.22 at around 3:15 pm. Earlier during the trading session, shares of the telecom operator fell as much as 6%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ambanis-top-asias-rich-list-here-are-other-indians-who-made-it-mistry-birla-bajaj-hinduja-2680007-2025-02-14",
      "headline": "Ambani family richest in Asia. Check which Indian families made the top 20The Ambani family tops Bloomberg's list of Asia's 20 richest families. The family's flagship company, Reliance Industries, is presently headed by Mukesh Ambani, son of late industrialist Dhirubhai Ambani. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-curbs-on-new-india-co-operative-bank-how-does-it-impact-customers-what-to-do-2680031-2025-02-14",
      "headline": "RBI curbs on New India Co-operative Bank: How does it impact customers?New India Co-operative Bank has been struggling with financial losses in recent years. According to its annual report, the bank recorded a loss of Rs 22.78 crore in the financial year ending March 2024, following a loss of Rs 30.75 crore in the previous year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/new-india-co-operative-banks-financial-operations-halted-after-notice-from-rbi-2680025-2025-02-14",
      "headline": "New India Co-operative Bank's financial operations halted after notice from RBIThe Reserve Bank of India (RBI) has restricted Mumbai-based New India Co-operative Bank from issuing loans, accepting deposits, or permitting withdrawals for six months. The move comes amid concerns over the bank's financial health and liquidity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/not-trump-tariffs-but-this-is-whats-making-stock-market-investors-anxious-fii-selling-stock-market-fall-2680000-2025-02-14",
      "headline": "Not Trump's tariffs, but this is what's making stock market investors anxiousThe stock market jitters have occurred despite government measures, including tax relief and the Reserve Bank of India's (RBI) decision to reduce the repo rate by 25 basis points."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/rbi-issues-notice-to-halt-all-financial-operations-of-new-india-co-operative-bank-2679968-2025-02-14",
      "headline": "RBI issues notice to halt all financial operations of New India Co-operative BankRBI's move comes after what it called 'recent material developments' at the bank. Although the central bank did not provide specific details, it stated that these directions were issued to protect depositors' interests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-all-your-questions-answered-2679917-2025-02-14",
      "headline": "New income tax bill: All you questions answeredThe new income tax bill, compared to the Income Tax Act, 1961, is nearly half the size, containing 259,676 words, 23 chapters, 536 sections, 57 tables and 46 formulae."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-down-500-points-nifty-falls-3-things-you-need-to-know-2679965-2025-02-14",
      "headline": "Sensex tanks over 600 points: Why is the stock market down today?The Sensex and Nifty fell sharply after rising in early trade. Here are three things you need to know about today's stock market weakness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/explained-why-senco-gold-share-price-crashed-20-percent-after-q3-results-2679889-2025-02-14",
      "headline": "Explained: Why Senco Gold shares crashed 20% after Q3 results Senco Gold share price: In the third quarter, Senco Gold reported a nearly 70% drop in consolidated net profit to Rs 33 crore, compared to Rs 109 crore in the same period last year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jiocinema-disney-hotstar-merge-to-launch-jiohotstar-what-it-means-for-you-subscription-plans-ott-2679869-2025-02-14",
      "headline": "JioCinema, Disney+ Hotstar merge to launch JioHotstar: What it means for youReliance Industries and Walt Disney's India business finalised their merger in November 2024, creating a joint venture with Viacom18 Media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-bell-sensex-nifty-gain-as-us-india-trade-talks-show-positive-signs-2679851-2025-02-14",
      "headline": "Sensex, Nifty gain as US-India trade talks show positive signsThe S&P BSE Sensex was up 86.75 points to 76,225.72, while the NSE Nifty50 added 12.50 points to 23,043.90 as of 9:46 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-stock-market-nasdaq-rises-1-percent-on-inflation-relief-tesla-soars-6-nvidia-up-4-2679839-2025-02-14",
      "headline": "Nasdaq rises over 1% on inflation relief; Tesla soars 6%, Nvidia up 4%The Nasdaq Composite jumped 1.5%, the S&P 500 gained 1.04%, and the Dow Jones Industrial Average rose 0.77%"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-explained-tabled-parliament-what-is-changing-and-what-is-not-2679826-2025-02-14",
      "headline": "New Income Tax bill explained: What's changing and what's notNew Income Tax bill: It aims to simplify the existing Income Tax Act, 1961, by making it more structured and easier to understand. If passed, the new law will come into effect from April 1, 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/epfo-likely-to-maintain-825-percent-interest-rate-on-pf-depsoits-2679563-2025-02-13",
      "headline": "EPFO likely to maintain 8.25% interest rate on PF deposits EPFO interest rate: In 2024-25, EPFO processed over 50.8 million claims worth Rs 2.05 lakh crore when compared to 44.5 million claims amounting to Rs 1.82 lakh crore settled in the previous year, as per the official data."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-green-energy-exits-sri-lanka-wind-power-deal-stock-down-1-percent-2679469-2025-02-13",
      "headline": "Adani Green Energy exits Sri Lanka wind power deal; stock down 1%Adani Green Energy shares: As per the agreement with Sri Lanka, Adani Green was to construct two wind power projects in Mannar town and Pooneryn village, both located in the northern province of the country. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-erase-gains-to-end-lower-as-it-stocks-weigh-in-adani-enterprises-down-5-percent-2679429-2025-02-13",
      "headline": "Sensex, Nifty erase gains to end lower as IT stocks weigh in on stock marketsThe S&P BSE Sensex was down by 32.11 points to close at 76,138.97, while the NSE Nifty50 lost 13.85 points to end at 23,031.40. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/finance-minister-nirmala-sitharaman-introduces-new-income-tax-bill-in-lok-sabha-2679394-2025-02-13",
      "headline": "Finance Minister Nirmala SItharaman introduces new Income Tax Bill in Lok SabhaFinance Minister Nirmala Sitharaman tabled the new Income Tax bill in Lok Sabha amid the huge uproar by the opposition MPs. The bill will now be referred to the Select Committee of Lok Sabha for further review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/finance-minister-nirmala-sitharaman-introduces-new-income-tax-bill-in-lok-sabha-overhaul-2679363-2025-02-13",
      "headline": "New Income Tax Bill tabled in Lok Sabha, faces select panel reviewThe government, in a bid to simplify the present Income Tax Act, 1961, has introduced a new income tax bill in Parliament today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/explained-why-are-large-cap-mutual-funds-back-in-demand-stock-market-volatility-2679356-2025-02-13",
      "headline": "Explained: Why are large-cap mutual funds back in demandWith small-cap and mid-cap stocks experiencing corrections, investors are moving towards large-cap funds, which are considered safer and more stable in volatile times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/quality-power-ipo-10-things-investors-must-know-before-subscribing-2679309-2025-02-13",
      "headline": "Quality Power IPO: 10 things investors must know before subscribing Quality Power Electrical Equipments Limited offers high-voltage electrical equipment and solutions for grid connectivity and energy transition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-how-will-it-make-taxpayers-lives-simpler-2679254-2025-02-13",
      "headline": "New Income Tax Bill: How will it make taxpayers' lives simpler?The new income tax bill would be almost half of the current law, as the existing Income Tax Act,1961 contained 880 pages when it came into existence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-gains-450-points-3-reasons-why-stock-market-is-rising-today-inflation-data-pm-modi-us-visit-2679218-2025-02-13",
      "headline": "Sensex gains 500 points: 3 reasons why stock market is rising todayAs of 10:48 AM, the S&P BSE Sensex was up 47.85 points at 76,644.93, while the NSE Nifty50 gained 137.75 points to 23,183.00."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/opening-bell-sensex-nifty-up-as-cooling-inflation-boosts-market-sentiment-share-market-today-2679189-2025-02-13",
      "headline": "Sensex, Nifty open higher as cooling inflation boosts market sentimentShare Market Today: The S&P BSE Sensex was up 163.21 points to 76,334.39, while the NSE Nifty50 gained 46.25 points to 23,091.50 as of 9:30 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ajax-engineering-ipo-check-allotment-status-online-guide-listing-date-latest-gmp-2679171-2025-02-13",
      "headline": "Ajax Engineering IPO: Check allotment status, listing date and latest GMPAjax Engineering IPO allotment status: The IPO price band was set at Rs 599 to Rs 629 per share. The minimum lot size for the application was 23 shares. For retail investors, the minimum investment required was Rs 13,777."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-2025-to-be-tabled-today-parliament-heres-what-you-can-expect-2679153-2025-02-13",
      "headline": "New Income Tax Bill to be tabled today: Here's what you can expectNew Income Tax Bill is expected to come into effect on April 1, 2026. The bill aims to simplify tax laws, remove outdated provisions, and make compliance easier for taxpayers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/can-a-married-couple-save-more-taxes-using-both-old-and-new-tax-regime-2678890-2025-02-13",
      "headline": "Can a married couple save more taxes using both old and new tax regime?Married couples need to determine which tax regime offers lower tax liability for each spouse considering their income structure and deductions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-retail-inflation-dips-to-431-percent-in-january-2678907-2025-02-12",
      "headline": "India's retail inflation dips to 4.31% in January, hits a five-month lowThe country's retail inflation witnessed a drop in January majorly due to declining food prices, according to data released by the National Statistics Office on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-sensex-nifty-dalal-street-2678823-2025-02-12",
      "headline": "Sensex, Nifty recover sharply but end in red; M&M falls 3%The S&P BSE Sensex settled 122.52 points lower at 76,171.08. Earlier in the day, the 30-share index had plunged 850 points. Nifty, too, recovered strongly to end 26.55 points lower at 23,045.25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mutual-fund-inflows-see-slight-dip-in-january-heres-why-2678801-2025-02-12",
      "headline": "Mutual fund inflows see slight dip in January. Here's whyThe flows declined 3.6% month-on-month to 396.88 billion rupees ($4.57 billion) from 411.56 billion rupees in December 2024, according to data by the Association of Mutual Funds in India (AMFI)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-to-be-simpler-and-clearer-likely-to-be-presented-tomorrow-2678762-2025-02-12",
      "headline": "New Income Tax Bill to introduce simpler 'tax year' concept: All you need to knowWhen the Income Tax Act of 1961 came into being it had 880 pages. Over the years, the act contained several amendments introduced in the various budgets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-trading-strategy-what-should-investors-do-key-things-to-know-2678731-2025-02-12",
      "headline": "Stock market bloodbath: Should buy the dip, exit or stay invested? The stock market correction has particularly hit retail investors, many of whom are contemplating selling their holdings at a loss. But is that the right move? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/after-90-hour-workweek-remark-l-and-t-chief-stirs-wfh-debate-2678704-2025-02-12",
      "headline": "After 90-hour workweek remark, L&T chief stirs work-from-home debateThis is not the first time that the L&T Chairman's remarks have sparked a debate.  Earlier, he advocated a 90-hour workweek, which drew huge criticism. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/will-retail-inflation-cool-down-further-in-january-here-is-all-you-need-to-know-2678656-2025-02-12",
      "headline": "Will retail inflation cool down further in January? Here's all you need to know The RBI mentioned continued reduction in rice prices and sharp corrections in the prices of vegetables, especially in the prices of onions, potatoes and tomatoes, in its January 2025 Bulletin. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/larsen-and-toubro-cmd-sn-subrahmanyan-raises-alarm-over-labour-shortage-blames-welfare-schemes-2678648-2025-02-12",
      "headline": "L&T chief stirs fresh row with remark on labour crisis: Workers unwilling to moveSpeaking at CII's Mystic South Global Linkages Summit 2025 in Chennai, Subrahmanyan spoke about the difficulties faced by the construction industry in hiring and mobilising workers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-down-over-700-points-nifty-falls-4-factors-behind-stock-market-crash-2678623-2025-02-12",
      "headline": "Sensex falls 700 points: 4 reasons why stock market is falling todayStock market crash: The S&P BSE Sensex plunged over 850 points before trimming some losses, trading 748.13 points lower at 75,545.47 by 10:23 am. The NSE Nifty50 also slipped nearly 1%, reflecting weakness across broader markets."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/mahabharat-actor-saurav-gurjar-threatens-ranveer-allahbadia-samay-raina-controversy-indias-got-latent-stmp-2680542-2025-02-15",
      "headline": " No one can save him: Mahabharat actor threatens Ranveer Allahbadia Actor Saurav Gurjar openly threatened Ranveer Allahbadia over his recent remarks on India's Got Latent. In a video message, the actor requested the government to take strict action against the podcaster. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/drake-releases-new-album-amid-feud-with-kendrick-lamar-fails-to-impress-fans-2680481-2025-02-15",
      "headline": "Drake releases new album amid feud with Kendrick Lamar, fails to impress fansDrake appears to have ended his feud with Kendrick Lamar in his latest album, but fans remain unimpressed. Released on Valentine's Day, the album in collaboration with PartyNextDoor marks his first new work since the Super Bowl halftime show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bharti-singh-supports-samay-raina-indias-got-latent-controversy-ranveer-allahbadia-good-talented-guy-2680407-2025-02-15",
      "headline": "Bharti Singh supports Samay Raina amid India's Got Latent controversyComedian Bharti Singh supported Samay Raina amid the India's Got Latent controversy. The comedian praised Samay and said that he is very sweet, and anyone can become his fan once they get to meet him. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-18-chum-darang-elvish-yadav-racist-remarks-2680401-2025-02-15",
      "headline": "Women's panel summons Elvish Yadav over remarks against Chum Darang on Feb 17YouTuber Elvish Yadav has been summoned by a women's panel following his racist remarks against Chum Darang. Yadav criticised her name and nationality, sparking courage among northeastern citizens. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/apoorva-mukhija-aka-rebel-kid-removed-from-official-iifa-ambassador-list-indias-got-latent-controversy-2680258-2025-02-14",
      "headline": "Apoorva Mukhija aka Rebel Kid removed from official IIFA ambassador listApoorva Mukhija, known as Rebel Kid, has been removed from the IIFA ambassador list following controversy over her appearance in Samay Raina's show, India's Got Latent. The decision follows threats from Karni Sena to disrupt her upcoming shoot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/fighting-zombies-to-playing-a-psychopath-the-many-faces-of-choi-woo-shik-2680124-2025-02-14",
      "headline": "Fighting zombies to playing a psychopath: The many faces of Choi Woo-shikLong before Choi Woo-shik became a household name thanks to Parasite, he had already amassed an impressive filmography. On this week's K-Fix, we'll have a closer look at his notable works, crafted long before his Oscar-winning turn in Parasite."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/the-potato-lab-trailer-kang-tae-oh-is-set-to-headline-upcoming-rom-com-2680071-2025-02-14",
      "headline": "The Potato Lab trailer: Kang Tae-oh is set to headline upcoming rom-comThe trailer for The Potato Lab, a romantic comedy-drama starring Kang Tae-oh and Lee Sun-bin, has been released. The series, set in a rural potato research institute, promises a blend of romance, comedy, and workplace drama."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dhoom-dhaam-review-yami-gautam-pratik-gandhi-2679912-2025-02-14",
      "headline": "Dhoom Dhaam review: Romance meets thrill in this Yami Gautam-Pratik Gandhi filmReleased-Fri Feb 14, 2025Dhoom Dhaam movie review: Dhoom Dhaam blends romance with action and comedy, offering a refreshing alternative to traditional Valentine's Day films. Starring Yami Gautam and Pratik Gandhi, the movie delivers a thrilling and entertaining experience perfect for a cosy night in."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/selena-gomez-benny-blanco-song-scared-of-loving-you-released-new-album-i-said-i-love-you-first-2679975-2025-02-14",
      "headline": "Scared of Loving You: Selena Gomez's new song for her Valentine Benny Blanco out Lovebirds Selena Gomez and Benny Blanco have now collaborated for a new album titled I Said I Love You First. On the occasion of Valentine's Day 2025, Selena released the first single from the album, Scared of Loving You.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/music-composer-ilayaraja-madras-high-court-dispute-with-music-master-over-his-compositions-2679766-2025-02-14",
      "headline": "Ilaiyaraaja appears in Court in dispute with music company over his compositionsIn 2010, Music Master filed a lawsuit seeking a ban on the use of these songs on YouTube and social media platforms, calling it \"unauthorised\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/are-k-drama-men-written-by-women-too-good-to-be-true-valentine-day-special-2679923-2025-02-14",
      "headline": "Are K-Drama men written by women too good to be true? | Valentine Special K-drama male leads have captivated audiences with their idealised traits, offering a romantic fantasy of the perfect partner. These characters, crafted by female screenwriters, challenge traditional portrayals. This Valentine's Day we analyse if they are too good to be true. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/prime-videos-rings-of-power-renewed-for-third-season-2679924-2025-02-14",
      "headline": "Prime Video's Rings of Power renewed for third seasonPrime Video's Rings of Power has been renewed for the third installment, the makers announced recently. Its second season was released last year. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maharashtra-love-jihad-religious-conversion-law-committee-formed-2680501-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Law against 'love jihad' in Maharashtra soon? 7-member committee formedThe committee, which will be headed by the Maharashtra Director General of Police, will suggest measures to tackle complaints related to forced conversions and 'love jihad'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/s-jaishankar-west-global-democracy-double-standards-munich-security-conference-panel-2680452-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "S Jaishankar tears into West over global democracy: 'Practice what you preach'Flagging the \"double standards\" of the West over its view on global democracy, External Affairs Minister S Jaishankar said Western leaders treated democracy as a \"Western characteristic\". He urged them to embrace the successful models of non-Western countries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-donald-trump-meeting-agreements-trade-tariffs-american-experts-decode-takeaways-2680431-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Modi has pulled off magic in US, says Ashley Tellis: India Today ExclusiveModi-Trump meet: American foreign policy experts were unanimous in their verdict that the wide-ranging agreements, from defence equipment to trade, left no doubt that the US-India relationship was off to a very good start during Trump 2.0. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/darien-gap-most-dangerous-stretch-on-donkey-route-indian-deported-from-us-trump-darien-gap-explained-2676300-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Where the dead warn the living: Darien Gap, deadliest stretch on donkey routeA second flight with over 100 Indians who migrated illegally to the US will land in Amritsar today. Most of them and others who are in the US illegally took the donkey route. The Darien Gap -- a 97-km stretch on the border of Columbia and Panama -- is the most dangerous part of the South American donkey route. Here's all about the Darien Gap and its dangers that have forced immigrants even to abandon their children."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-shah-rukh-khan-aamir-khan-last-bollywood-superstars-pankaj-tripathi-sooraj-barjatya-2679306-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "The last of the stars: Why Bollywood has a superstar crisis after the Khans The Khans-Salman Khan, Shah Rukh Khan, and Aamir Khan - share an indelible stardom like no other. But, will there be any successor to their superstardom throne? Industry veterans discuss how digital accessibility has diminished the aura of superstardom.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-illegal-immigration-more-and-more-indian-asylum-seekers-to-us-are-speaking-a-different-tongue-immighrants-2679990-2025-02-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "More and more Indian asylum seekers to US are speaking a different tonguePunjabi speakers formed 66% of all asylum-seekers from India from 2001 to 2022, according to an analysis by Johns Hopkins University researchers. However, the five years from 2017 to 2022 saw a 30% rise in asylum petitions being filed in the US by Hindi-speaking Indians. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/jannik-sinner-ban-doping-2680538-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "World No.1 Jannik Sinner banned for 3 months on doping chargesWorld No.1 Jannik Sinner has accepted a 3-month doping ban having tested positive for a banned substance in 2024. Sinner's ban comes weeks after his Australian Open victory where he beat Germany's Alexander Zverev in straight sets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/hamas-releases-three-more-israeli-hostages-gaza-ceasefire-deal-palestinian-prisoners-idf-2680513-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Hamas frees 3 more hostages, including an American, under Gaza truce dealThree more Israeli hostages, including an American, were released by Hamas after 498 days, after the Palestinian group and Israel threatened each other with resuming fighting over alleged violation of a ceasefire deal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/vicky-kaushal-master-of-period-dramas-perfect-chameleon-chhaava-sam-bahadur-sardar-udham-2680500-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "The Perfect Chameleon: What makes Vicky Kaushal master of period dramasVicky Kaushal has mastered period dramas, seamlessly embodying real-life figures like Udham Singh, Sam Manekshaw, and Chhatrapati Sambhaji Maharaj. His intense prep, physical transformations, and emotional depth make history compelling on screen, cementing his legacy in Bollywood."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/revanth-reddy-pm-modi-remark-on-caste-birth-row-bjp-congress-hyderabad-2680471-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Revanth Reddy claims PM is 'legally converted backward class', BJP hits backTelangana Chief Minister Revanth Reddy claimed that Prime Minister Narendra Modi is from the \"legally converted Backward Class (BC)\" and not born in the BC category. The BJP hit back at Revanth Reddy for his remarks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/sunita-williamss-homecoming-how-gravity-will-punish-her-for-returning-to-earth-2680172-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sunita Williams braces for life on Earth: Even lifting a pencil will be a workoutButch Wilmore, a fellow astronaut, stuck in space with Williams, revealed how gravity will be the biggest challenge when the two astronauts return home."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/us-flight-indian-deportees-amritsar-donald-trump-immigration-crackdown-government-shackles-2680508-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US plane with 120 Indian migrants to land today; most from Punjab, HaryanaA second flight carrying 120 illegal Indian immigrants deported from the US will land at the Amritsar airport around 10 pm today, official sources said. A third plane with 157 deportees is expected to land on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/which-walk-is-more-effective-for-weight-loss-empty-stomach-or-post-meal-stmp-2679595-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Walking on an empty stomach vs after a meal: Which one burns more fat?While many head out for a walk after hearty meals, others prefer walking on an empty stomach, thinking that it will burn more calories. Know it from experts on which one is more effective."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/new-india-co-operative-bank-ex-manager-under-probe-crore-fraud-cops-2680488-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "New India Co-operative Bank ex-manager under probe for Rs 122-crore fraud: CopsThe RBI barred the Mumbai-based bank from issuing new loans, accepting fresh deposits, and suspended withdrawals for six months due to supervisory concerns and liquidity issues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-government-accountability-office-gao-report-flags-performance-cost-issues-of-f-35-amid-trump-offer-to-india-2680522-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US report flags performance, cost issues of F-35 amid Trump's offer to IndiaThe United States Government Accountability Office is an independent, nonpartisan government agency within the legislative branch that provides auditing, evaluative, and investigative services for the United States Congress."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/sheeshmahal-row-delhi-chief-minister-bungalow-used-by-arvind-kejriwal-faces-probe-2680438-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Sheeshmahal' row: Chief Minister's bungalow used by Arvind Kejriwal faces probeThe complaint by the BJP leader highlighted that government properties, including Plot Nos. 45 and 47 on Rajpur Road—previously housing senior officers and judges in Type-V flats—along with two bungalows on Flag Staff Road, were demolished and merged into the new residence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/blinkit-delivery-agent-grwm-video-goes-viral-internet-says-his-sass-is-contagious-2680447-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Blinkit delivery agent's sassy style in GRWM video is off the charts. Watch videoA Blinkit delivery agent's GRWM video has gone viral on social media. The internet, impressed by his effortless confidence, says his sass is contagious. Scroll down to watch the video. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-450-14-02-2025?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/swanand-kirkire-ranveer-allahbadia-indias-got-latent-samay-raina-controversy-2680527-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "They should be forgiven: Swanand Kirkire on Ranveer Allahbadia rowLyricist and singer Swanand Kirkire, at the Sahitya Aaj Tak event on Saturday, reacted to the ongoing Ranveer Allahbadia and India's Got Latent controversy. He said that the podcaster should be forgiven. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/jd-vance-munich-conference-trump-new-sheriff-in-town-europe-free-speech-migration-2680482-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "New sheriff in town: JD Vance's takedown of Europe over free speech, migrationJD Vance, speaking at a conference in Munich, argued that the true threat to Europe was not from external actors like Russia or China, but from some of its own 'fundamental values'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/can-ozempic-curb-alcohol-cravings-new-study-2680146-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Can Ozempic help curb alcohol cravings?A new study published in the journal JAMA Psychiatry found that semaglutide (sold under brand names like Ozempic and Wegovy) can help curb alcohol cravings. But the limitations of the study, such as the small sample size, can't be overlooked."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/row-erupts-more-us-flights-with-illegal-migrants-to-land-in-punjab-why-not-in-gujarat-2680460-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Opposition, Centre spar over US flights with Indian deportees landing in PunjabPunjab politics is simmering again with the opposition slamming the Centre for choosing Amritsar as a landing port. The first flight landed in Amritsar on February 5, now two more are coming this Saturday and Sunday.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-virat-kohli-rohit-sharma-ravindra-jadeja-last-icc-event-aakash-chopra-2680449-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Champions Trophy will be Kohli, Rohit, and Jadeja's last ICC event: ChopraAakash Chopra believes the Champions Trophy 2025 will be the final ICC event for Virat Kohli, Rohit Sharma, and Ravindra Jadeja, as the senior trio may not wait until the 2027 ODI World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/cbse-class-10-english-paper-analysis-balanced-but-with-errors-and-vague-wording-2680504-2025-02-15?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "CBSE Class 10 English paper analysis: Well-balanced but needs refinementThe CBSE Class 10 English board exam was well-structured but had errors, repetition, and vague language, said an expert."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/17-years-jodhaa-akbar-hrithik-roshan-aishwarya-rai-the-academy-host-special-screening-march-oscars-2025-2680549-2025-02-15",
      "headline": "17 years of Jodhaa Akbar: The Academy to host special screening in MarchHrithik Roshan and Aishwarya Rai's Jodhaa Akbar completed 17 years on February 15. On the special occasion, The Academy announced the film's special screening in March 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/sai-pallavi-praises-sivakarthikeyans-transformation-in-parasakthi-stmp-2680543-2025-02-15",
      "headline": "Sai Pallavi praises Sivakarthikeyan's transformation in ParasakthiSai Pallavi gave a shout-out to Sivakarthikeyan after watching his first glimpse from the upcoming film Parasakthi. She appreciated his continued efforts to reinvent himself in the industry.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nani-collaborate-sekhar-kammula-heres-what-we-know-2680545-2025-02-15",
      "headline": "Actor Nani to collaborate with Sekhar Kammula? Here's what we knowActor Nani is set to team up with director Sekhar Kammula for their upcoming project. The two are expected to begin production after completing their current commitments. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/swanand-kirkire-ranveer-allahbadia-indias-got-latent-samay-raina-controversy-2680527-2025-02-15",
      "headline": "They should be forgiven: Swanand Kirkire on Ranveer Allahbadia rowLyricist and singer Swanand Kirkire, at the Sahitya Aaj Tak event on Saturday, reacted to the ongoing Ranveer Allahbadia and India's Got Latent controversy. He said that the podcaster should be forgiven. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-virat-kohli-signs-autographs-for-fans-before-leaving-for-dubai-2680541-2025-02-15",
      "headline": "Watch: Virat Kohli signs autographs for fans before leaving for Champions TrophyStar India batter Virat Kohli was seen signing autographs for fans at the Mumbai airport before leaving for Dubai for the ICC Champions Trophy 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/jannik-sinner-ban-doping-2680538-2025-02-15",
      "headline": "World No.1 Jannik Sinner banned for 3 months on doping chargesWorld No.1 Jannik Sinner has accepted a 3-month doping ban having tested positive for a banned substance in 2024. Sinner's ban comes weeks after his Australian Open victory where he beat Germany's Alexander Zverev in straight sets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-team-india-first-batch-rohit-sharma-virat-kohli-gautam-gambhir-take-off-dubai-2680523-2025-02-15",
      "headline": "Watch: India's first batch takes off for Dubai ahead of Champions TrophyThe first batch of India Champions Trophy squad, including captain Rohit Sharma, Virat Kohli, Gautam Gambhir and other staff members took off for Dubai, where they will be playing all their group stage clashes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-australia-team-analysis-2680519-2025-02-15",
      "headline": "Will Champions Trophy turn out to be Australia's worst-ever ICC tournament?An injury-stricken Australia fell to their worst defeat in Asia on Friday, February 14, losing Sri Lanka by 174 runs. Without their entire first choice fast bowling group, could the Champions Trophy turn out to be Australia's worst outing ever in ICC tournaments?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-2025-pbks-priyansh-arya-reveals-special-message-from-india-captain-suryakumar-yadav-after-record-feat-2680509-2025-02-15",
      "headline": "PBKS' Priyansh Arya reveals special message from Suryakumar after record featPBKS batter Priyansh Arya revealed the special message he got from India T20I captain Suryakumar Yadav after his record feat in the Delhi Premier League 2024. Priyansh hit 6 sixes in an over during the DPL match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-england-cannot-win-less-odi-matches-mark-butcher-india-series-defeat-2680490-2025-02-15",
      "headline": "England cannot win Champions Trophy due to lack of ODI experience: ButcherMark Butcher questions England's Champions Trophy readiness, citing a lack of ODI match practice as a major hurdle. Following their 3-0 series loss to India, concerns grew over England's ability to compete against top teams."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-champions-trophy-ben-duckett-england-india-series-loss-remark-r-ashwin-2680489-2025-02-15",
      "headline": "R Ashwin slams Ben Duckett's India series remark: You are hiding your failuresR Ashwin has slammed Ben Duckett after his India series loss remark ahead of the Champions Trophy 2025. Duckett had claimed he didn't care about the loss to India as long as England go on to win the Champions Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-tri-series-final-pakistan-vs-new-zealand-mohammad-rizwan-toss-ahmed-shehzad-2680469-2025-02-15",
      "headline": "Mohammad Rizwan's tri-series final toss call was brainless: Ahmed ShehzadAhmed Shehzad slammed Pakistan captain Mohammad Rizwan and the team management after they decided to bat first in Karachi during the tri-series final. Pakistan's decision backfired as they lost the match to New Zealand. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-free-ride-is-over-for-fans-whats-jiohotstar-planning-2680451-2025-02-15",
      "headline": "IPL free ride is over for fans, what's JioHotstar planning?The IPL free ride may be over for the Indian cricket fans as JioHotstar is all set to introduce a hybrid subscription model. JioHotstar was formed on Friday, February 14 after the merger between Disney+ Hotstar and JioCinema was completed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-virat-kohli-rohit-sharma-ravindra-jadeja-last-icc-event-aakash-chopra-2680449-2025-02-15",
      "headline": "Champions Trophy will be Kohli, Rohit, and Jadeja's last ICC event: ChopraAakash Chopra believes the Champions Trophy 2025 will be the final ICC event for Virat Kohli, Rohit Sharma, and Ravindra Jadeja, as the senior trio may not wait until the 2027 ODI World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-champions-trophy-classics-india-2013-win-ms-dhoni-ishant-sharma-england-2680437-2025-02-15",
      "headline": "Champions Trophy classics: When Dhoni-led India outsmarted England to win titleMS Dhoni's tactical prowess and some brave performances from Ravindra Jadeja and Virat Kohli saw India defeat England by 5 runs to win the Champions Trophy 2013 final in Birmingham. This was the last time India lifted the Champions Trophy. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-champions-trophy-ben-duckett-england-india-series-loss-remark-r-ashwin-2680489-2025-02-15",
      "headline": "R Ashwin slams Ben Duckett's India series remark: You are hiding your failuresR Ashwin has slammed Ben Duckett after his India series loss remark ahead of the Champions Trophy 2025. Duckett had claimed he didn't care about the loss to India as long as England go on to win the Champions Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-tri-series-final-pakistan-vs-new-zealand-mohammad-rizwan-toss-ahmed-shehzad-2680469-2025-02-15",
      "headline": "Mohammad Rizwan's tri-series final toss call was brainless: Ahmed ShehzadAhmed Shehzad slammed Pakistan captain Mohammad Rizwan and the team management after they decided to bat first in Karachi during the tri-series final. Pakistan's decision backfired as they lost the match to New Zealand. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-free-ride-is-over-for-fans-whats-jiohotstar-planning-2680451-2025-02-15",
      "headline": "IPL free ride is over for fans, what's JioHotstar planning?The IPL free ride may be over for the Indian cricket fans as JioHotstar is all set to introduce a hybrid subscription model. JioHotstar was formed on Friday, February 14 after the merger between Disney+ Hotstar and JioCinema was completed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-virat-kohli-rohit-sharma-ravindra-jadeja-last-icc-event-aakash-chopra-2680449-2025-02-15",
      "headline": "Champions Trophy will be Kohli, Rohit, and Jadeja's last ICC event: ChopraAakash Chopra believes the Champions Trophy 2025 will be the final ICC event for Virat Kohli, Rohit Sharma, and Ravindra Jadeja, as the senior trio may not wait until the 2027 ODI World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-champions-trophy-classics-india-2013-win-ms-dhoni-ishant-sharma-england-2680437-2025-02-15",
      "headline": "Champions Trophy classics: When Dhoni-led India outsmarted England to win titleMS Dhoni's tactical prowess and some brave performances from Ravindra Jadeja and Virat Kohli saw India defeat England by 5 runs to win the Champions Trophy 2013 final in Birmingham. This was the last time India lifted the Champions Trophy. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}