{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/volkswagen-to-trim-35000-jobs-in-germany-by-2030-german-carmakers-plans-layoffs-2735697-2025-06-04",
      "headline": "Volkswagen to trim 35,000 jobs in Germany by 2030Volkswagen is planning to cut 35,000 jobs in Germany by the year 2030. To make the transition easier, Volkswagen is preparing severance packages for affected employees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-ends-261-points-higher-nifty-above-24600-eternal-gains-over-3-percent-2735618-2025-06-04",
      "headline": "Sensex ends 261 points higher; Nifty above 24,600; Eternal gains over 3%The S&P BSE Sensex added 261 points to end at 80,998.25, while the NSE Nifty50 was up by 77.70 points to close at 24,620.20. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/india-green-steel-production-energy-costs-green-hydrogen-incentives-2735598-2025-06-04",
      "headline": "Government seeks lower energy costs for backing green steel incentives: ReportIndia's finance ministry calls for lower energy prices to facilitate incentives for green steel production, amidst concerns over high green hydrogen costs and inflation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-ay-2025-26-itr-1-and-itr-4-enabled-on-e-filing-portal-who-can-file-online-check-eligibility-2735586-2025-06-04",
      "headline": "ITR-1, ITR-4 filing begins for AY 2025–26: Are you eligible?The Income Tax Department has enabled online filing of ITR-1 and ITR-4 forms for the assessment year 2025-26. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/rbi-mpc-rate-cut-sector-stock-market-news-trading-tips-expert-recommendation-buy-shares-2735591-2025-06-04",
      "headline": "RBI policy meet begins today: These stocks could rally if rate cut happensThe market is expecting a cut of 25 to 50 basis points (bps), mainly because inflation has been coming down and there are growing worries about slower economic growth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/china-rare-earth-export-controls-disrupt-global-supply-chains-2735550-2025-06-04",
      "headline": "Why China's rare earth export curbs are shaking global supply chainsChina's recent restrictions on rare earth exports are causing global industry disruptions, prompting urgent diplomatic and economic responses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/grse-stock-jumps-10-percent-mou-kongsberg-polar-research-vessel-2735536-2025-06-04",
      "headline": "GRSE shares jump 10% today: What's fuelling the rally?GRSE shares surged by up to 10% after sealing a partnership with Norway's Kongsberg for India's first Polar Research Vessel, highlighting a pivotal moment in deep-sea research and defence shipbuilding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/1-crore-salary-mumbai-cost-living-wealth-perception-2735511-2025-06-04",
      "headline": "Is Rs 1 crore salary still a big deal? Depends on where you live and who you askAn alumnus of IIM Ahmedabad has raised questions about the real value of a 1 crore annual salary in Mumbai. He pointed out that in areas like Borivali or Thane, a Rs 1 crore salary might still make one stand out, but in South Mumbai's boardrooms, where finance and tech executives frequently earn between Rs 1 crore and Rs 5 crore, this income is seen as average."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-steel-aluminium-tariffs-50-percent-double-impact-india-donald-trump-2735508-2025-06-04",
      "headline": "Trump doubles metal tariffs to 50% but skips UK. What it means for IndiaUS President Donald Trump plans to double tariffs on imported steel and aluminium, affecting global trade dynamics. The UK's exemption contrasts with challenges for India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/coforge-stock-split-shares-drop-80-percent-explained-2735506-2025-06-04",
      "headline": "Did Coforge shares drop 80% today? Here's all you need to knowInvestors might have initially mistaken this adjustment for a loss. Despite the apparent drop, the stock actually opened higher at Rs 1,720.05 on Wednesday, with a 0.60% increase. It was up 1.4% on the BSE at 12:18 pm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pm-kisan-20th-instalment-june-2025-e-kyc-eligibility-aadhaar-linkage-check-date-beneficiary-list-and-full-scheme-details-2735475-2025-06-04",
      "headline": "Are you eligible for PM-Kisan yojana? Check 20th instalment and requirementsThe upcoming 20th instalment is anticipated to be disbursed in the first or second week of June 2025. Under this scheme, farmers can receive the annual financial aid of Rs 6,000, distributed in three equal instalments of Rs 2,000 every four months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stop-sudden-tax-demands-raghuram-rajan-on-fixing-indias-business-environment-2735480-2025-06-04",
      "headline": "Stop sudden tax demands: Raghuram Rajan on fixing India's business environmentRaghuram Rajan says India must fix its business environment, starting with killing off surprise tax shocks that are scaring investors and strangling the country's shot at global supply chain glory."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pawan-kalyans-ustaad-bhagat-singh-shoot-to-resume-in-june-confirms-director-2735569-2025-06-04",
      "headline": "Pawan Kalyan's Ustaad Bhagat Singh shoot to resume in June, confirms directorPawan Kalyan is set to return to the sets of 'Ustaad Bhagat Singh' as the long-delayed cop drama gears up to resume shoot in June."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pawan-kalyans-hari-hara-veera-mallu-postponed-over-vfx-finance-issues-report-2735726-2025-06-04",
      "headline": "Pawan Kalyan's Hari Hara Veera Mallu postponed over VFX, finance issues: ReportAfter several postponements, reports now suggest that Pawan Kalyan's long-delayed period epic 'Hari Hara Veera Mallu' may also miss its June 11 release due to complex production issues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/hina-khan-rocky-jaiswal-married-wedding-pictures-2735710-2025-06-04",
      "headline": "We are our home and light: Hina Khan and Rocky Jaiswal are married. PicsActor Hina Khan got married to her longtime boyfriend, Rocky Jaiswal. Khan shared pictures from the wedding on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/indian-rock-band-girish-and-the-chronicles-wins-hearts-on-americas-got-talent-2735701-2025-06-04",
      "headline": "Indian rock band Girish and the Chronicles wins hearts on America's Got TalentIndian rock band 'Girish and the Chronicles' wowed the judges on 'America's Got Talent' with a powerful rock version of Adele's 'Set Fire to the Rain'. The performance received a standing ovation and four 'yes' from the judges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anushka-sharma-virat-kohli-reach-bengaluru-after-rcb-ipl-win-pbks-fans-throng-streets-to-celebrate-2735671-2025-06-04",
      "headline": "Anushka-Virat receive grand welcome as they arrive in Bengaluru after RCB's IPL winAnushka Sharma and Virat Kohli reached Bengaluru, and fans thronged to their bus to catch a glimpse of the team after RCB won the IPL. The actor shared videos from their visit along with a beautiful note."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/virat-kohli-cheers-for-her-bangalore-girl-anushka-sharma-in-loving-post-after-ipl-win-2735668-2025-06-04",
      "headline": "Together all the way through: Virat dedicates IPL win to his Bangalore girl AnushkaVirat Kohli shared a loving post for his wife, Anushka Sharma, after the RCB ended its dry spell and lifted its first IPL trophy in 18 years. The cricketer referred to her as his 'Bangalore girl'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kamal-haasan-thug-life-ban-in-karnataka-box-office-prediction-2735648-2025-06-04",
      "headline": "Thug Life banned in Karnataka - what does it mean for film's box officeKamal Haasan and director Mani Ratnam's 'Thug Life' is just hours away from its global release on June 5. With the film banned in Karnataka, will it impact the box office?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/exclusive-rana-daggubati-interview-on-netflix-series-rana-naidu-2-and-need-to-turn-lens-on-important-things-2735632-2025-06-04",
      "headline": "Exclusive: Rana Daggubati on Rana Naidu 2, and need to turn lens on important thingsActor Rana Daggubati brings the new season of his popular Netflix series 'Rana Naidu'. In an exclusive interview with IndiaToday.in, the actor, along with Kriti Kharbanda, Abhishek Banerjee and director Karan Anshuman, spoke about the criticism that they received for featuring explicit scenes in the first season of the show, and what has changed this time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/prakash-jha-confirms-raajneeti-2-i-am-working-on-it-casting-underway-2735636-2025-06-04",
      "headline": "Prakash Jha confirms Raajneeti 2: I am working on it, casting underwayDirector Prakash Jha confirmed that he is currently working on 'Raajneeti 2'. He added that casting is underway. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/metroin-dino-trailer-anurag-basu-film-explores-love-life-longing-in-busy-city-2735589-2025-06-04",
      "headline": "Metro...In Dino trailer: Anurag Basu film explores love, life, longing in busy cityAnurag Basu returns with 'Metro…In Dino', a film that explores modern love stories set in fast-paced city life. The trailer promises emotional depth, relatable characters, and soulful music by Pritam.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kgf-director-prashanth-neel-hits-friend-rcb-ipl-win-2735523-2025-06-04",
      "headline": "KGF director playfully hits friend in excitement after RCB's IPL win. Watch'KGF' director Prashanth Neel was joyful after Royal Challengers Bengaluru (RCB) lifted the IPL trophy for the first time. He playfully hit his friend in extreme excitement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/adolescence-becomes-netflix-stranger-things-season-4-2735444-2025-06-04",
      "headline": "Adolescence becomes Netflix's 2nd most-watched English show surpassing Stranger Things 4'Adolescence' has become Netflix's second most-watched English-language series, surpassing 'Stranger Things Season 4' with 141.2 million views in 80 days. Besides, the show 'Wednesday' and non-English hits like 'Squid Game' rank higher in Netflix's all-time viewership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/nimrit-kaur-ahluwalia-missed-diljit-dosanjh-film-choti-sarrdaarni-shoot-2735434-2025-06-04",
      "headline": "Actor Nimrit Ahluwalia skipped Diljit Dosanjh's film due to Choti Sarrdaarni shootActor Nimrit Kaur Ahluwalia revealed she missed a film with Diljit Dosanjh due to her 'Choti Sarrdaarni' schedule. She later made her Punjabi debut with 'Shaunki Sardar.'.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/janhvi-kapoor-khushi-kapoor-orry-at-cannes-2025-2735498-2025-06-04",
      "headline": "Janhvi Kapoor's 'champi' session with Khushi was perfect prep before Cannes. WatchBefore actor Janhvi Kapoor's Cannes debut, she enjoyed a relaxing 'champi' from her sister Khushi. Orry posted the video along with other behind-the-scenes glimpses from Cannes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/preity-zinta-is-visibly-in-tears-after-pbks-loses-to-rcb-fans-extend-support-2735470-2025-06-04",
      "headline": "Preity Zinta's fans heartbroken as PBKS loses IPL: She deserves the trophyPreity Zinta looked upset and emotional after her co-owned team, PBKS, lost the IPL trophy to RCB. Several pictures of the actor's disappointed expressions have gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thug-life-advance-booking-for-day-1-india-detailed-report-kamal-haasan-film-gears-up-for-solid-opening-2735478-2025-06-04",
      "headline": "Thug Life advance booking: Kamal Haasan's film gears up for solid openingEven with all the controversy around the film, 'Thug Life' is generating significant buzz in advance booking. The Kamal Haasan film is looking at collecting a good number on its opening day. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/stolen-movie-review-karan-talwar-director-steals-your-attention-2735454-2025-06-04",
      "headline": "Stolen review: Karan Tejpal's film steals your attention and never lets it goReleased-Wed Jun 04, 2025Actor Abhishek Banerjee delivers a powerful performance in the tense thriller 'Stolen', directed by newcomer Karan Tejpal. The film explores dark social themes while keeping viewers hooked from start to finish. Read our review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dept-q-review-matthew-goode-cold-case-series-gripping-2735148-2025-06-04",
      "headline": "Department Q review: Matthew Goode shines in gripping slow-burn thrillerReleased-Thu May 29, 2025Dept Q review: Crime thriller 'Dept. Q' adapts Jussi Adler-Olsen's noir novels into a gripping series. The show delves into complex characters and slow-burning mysteries, promising an intense viewing experience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/jaya-bachchan-schools-paps-again-as-they-follow-her-to-car-watch-viral-video-as-she-says-chaliye-aap-bhi-2735436-2025-06-04",
      "headline": "Chaliye aap bhi: Jaya Bachchan schools paps again as they follow her to carVeteran actor Jaya Bachchan is often seen asking paparazzi to behave themselves. This time too, she sarcastically asked them to back-off as they followed her to her car. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bengaluru-in-stampede-rcbs-ipl-win-celebrations-chinnaswamy-stadium-dead-injured-2735686-2025-06-04",
      "headline": "11 dead in stampede outside Bengaluru stadium during RCB's IPL win celebrationsAt least 11 people died in a stampede during the Karnataka government's felicitation of Royal Challengers Bengaluru for their IPL 2025 win. The crowd surge which led to the stampede occurred outside the Chinnaswamy Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-stampede-dead-chinnaswamy-stadium-amid-rcb-ipl-victory-celebrations-2735702-2025-06-04",
      "headline": "BJP slams Karnataka government over chaos, wants judicial inquiryBengaluru Stampede News Live Updates: Seven people died in the stampede in Bengaluru on Thursday amid the victory celebrations of the Royal Challengers Bengaluru in IPL 2025. The Karnataka government on Wednesday felicitated the Royal Challengers Bengaluru team, which won their maiden IPL title, ending an 18-year wait for the coveted trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/rcb-win-celebrations-inside-chinnaswamy-stadium-stampede-bengaluru-congress-bjp-spar-2735717-2025-06-04",
      "headline": "Stampede claimed lives outside Bengaluru stadium, RCB celebrations continued insideThe RCB team was being felicitated inside the Chinnaswamy Stadium after their win over Punjab Kings in the final on Tuesday. But while the celebration went on inside, chaos unfolded outside the venue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/population-count-caste-census-likely-to-begin-from-march-1-2027-sources-2735672-2025-06-04",
      "headline": "Population count, caste census to begin from March 1, 2027The census 2027 exercise will be conducted in two phases, and the reference date for the count will be March 1, 2027, the government notification said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/hina-khan-rocky-jaiswal-married-wedding-pictures-2735710-2025-06-04",
      "headline": "We are our home and light: Hina Khan and Rocky Jaiswal are married. PicsActor Hina Khan got married to her longtime boyfriend, Rocky Jaiswal. Khan shared pictures from the wedding on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/dk-shivakumar-amid-criticism-that-event-continued-despite-stampede-wrapped-up-bengaluru-2735733-2025-06-04",
      "headline": "Amid stampede criticism, Shivakumar says RCB felicitation finished in 15 minutesAmid criticism over crowd mismanagement following a stampede outside the stadium that killed eleven, Karnataka Deputy Chief Minister DK Shivakumar said the RCB felicitation event was wrapped up within 10-15 minutes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kamal-haasan-firm-stand-commending-him-thug-life-controversy-karnataka-ban-high-court-statements-outrage-2735545-2025-06-04",
      "headline": "Commending Kamal: Haasan isn't a linguist, neither is the Kannada lobbyThe ban on Kamal Haasan's film Thug Life in Karnataka over a passing remark on language, has the High Court nudging him to apologise despite no evidence of malice. By refusing to tender an apology, Haasan has upheld his right to expression, making his stand one of quiet conviction, not defiance."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/environment/story/how-global-wars-are-violently-escalating-earths-climate-crisis-2735680-2025-06-04",
      "headline": "How global wars are violently escalating Earth's climate crisisFrom the oil infernos of 1990s Kuwait to Ukraine's flooded habitats and Gaza's ecocide, armed conflicts have become accelerants of environmental collapse. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/video/video-moment-stampede-broke-out-during-rcbs-victory-celebrations-in-bengaluru-2735734-2025-06-04",
      "headline": "Video: Moment stampede broke out during RCB's victory celebrations in BengaluruIndia Today has accessed exclusive video of the moment a stampede broke out outside Bengaluru's Chinnaswamy Stadium when a drain slab collapsed, trapping over 50 people during RCB's victory celebrations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-verdict-delhi-waqf-board-gurdwara-property-claim-shahdara-2735685-2025-06-04",
      "headline": "There is a gurdwara, let it be: Supreme Court rejects Delhi Waqf board's claimThe order comes at a time when another bench of the top court has reserved its decision on petitions challenging the constitutional validity of the Waqf (Amendment) Act, 2025."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/house-collapses-in-delhi-rohini-sector-7-several-likely-trapped-injured-casualties-2735692-2025-06-04",
      "headline": "3-storey building collapses in Delhi's Rohini, several likely trappedA three-storey building collapsed in Delhi's Rohini. Several people are feared to be trapped under the debris."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/indore-couple-missing-in-meghalaya-last-audio-sonam-raghuvanshi-raja-tourists-2735593-2025-06-04",
      "headline": "I'm exhausted: Missing woman's audio surfaces after husband's murder in MeghalayaMadhya Pradesh residents Raja Raghuvanshi and his wife Sonam travelled to Meghalaya for their honeymoon and went missing on May 23, hours after they checked out of a homestay at Nongriat village."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/features/story/silicon-valley-wealth-creators-are-immigrants-donald-trump-policies-may-see-them-lose-interest-in-us-2735659-2025-06-04",
      "headline": "Trump policies may drive immigrant wealth creators away from Silicon ValleySergey Brin, Sundar Pichai, Jensen Huang, Elon Musk, Satya Nadella, Dara Khosrowshahi, and Eric Yuan – what do these titans of Silicon Valley have in common?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-russia-partnership-military-weapons-sales-united-states-objections-2735650-2025-06-04",
      "headline": "Despite US objections, 5 reasons why India-Russia partnership will endureThe Trump administration said India's military purchases from Russia had 'rubbed the United States the wrong way'. However, there are several reasons why India buys Russian weapons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/indian-students-delete-posts-accounts-social-media-study-visa-vetting-american-colleges-admission-deport-2735103-2025-06-04",
      "headline": "Indian students are rushing to delete posts for US visa, but that's risky tooAfter the Trump administration's decision to vet social media posts thoroughly for US visas, Indian students are rushing to delete posts and even accounts to fulfil their dream of studying in the US. However, experts suggest this could raise red flags. And it isn't just about posts, even likes and shares could lead to visa denials by the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/virat-kohli-cheers-for-her-bangalore-girl-anushka-sharma-in-loving-post-after-ipl-win-2735668-2025-06-04",
      "headline": "Together all the way through: Virat dedicates IPL win to his Bangalore girl AnushkaVirat Kohli shared a loving post for his wife, Anushka Sharma, after the RCB ended its dry spell and lifted its first IPL trophy in 18 years. The cricketer referred to her as his 'Bangalore girl'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/virat-kohli-anushka-sharma-loved-up-pics-posts-videos-rcb-ipl-2025-big-victory-2735709-2025-06-04",
      "headline": "Virat Kohli, Anushka Sharma's loved-up pics and posts are all over X. No surprise thereVirat Kohli and Anushka Sharma celebrated their big victory at the Narendra Modi Stadium in Ahmedabad where RCB clinched the IPL 2025 trophy with a six-run win over Punjab Kings (PBKS). "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/free-speech-doesnt-extend-to-defaming-army-high-court-slams-rahul-gandhis-thrashing-soldiers-remark-2735608-2025-06-04",
      "headline": "Free speech doesn't extend to defaming Army: High Court raps Rahul GandhiThe High Court made the remarks in connection with Rahul Gandhi's \"Chinese troops are thrashing Indian soldiers in Arunachal\" remark during Bharat Jodod Yatra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-team-brings-up-india-pakistan-truce-claim-us-court-tariff-defend-2735637-2025-06-04",
      "headline": "Averted war: Trump team repeats Pak ceasefire claim in court to defend tariffsThe Trump administration claimed that tariffs imposed under his presidency were not only economic tools but also part of successful diplomatic efforts, referring to the India-Pakistan truce."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pakistan-asian-development-bank-bailout-package-india-objections-terrorism-support-2735574-2025-06-04",
      "headline": "Pak gets Asian Development Bank bailout despite India's objectionsThe development comes a month after Pakistan secured a $1 billion (around Rs 8,500 crore) package from the International Monetary Fund (IMF)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/colour-theory-philosophy-descartes-hume-science-perception-newton-galileo-stephen-palmer-heres-more-2733356-2025-06-04",
      "headline": "Why we see a red apple red. Is colour in our eyes or in the mind's eye?Colour isn't just a physical property; it's how our brains interpret light reflected from objects. Different creatures perceive colours differently, so colour might be more about perception than reality. Philosophers debate whether colour is real, mental, or a mix of both. Simply put: colour is partly in the world and partly in the mind."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/canada-news/story/two-indian-origin-men-arrested-for-killing-sikh-businessman-harjeet-dhadda-in-canada-brampton-crime-extortion-2735515-2025-06-04",
      "headline": "Two Indian-origin men held for Sikh businessman's murder in CanadaTwo 21-year-old Indian-origin men were arrested for their alleged involvement in the killing of an Indo-Canadian businessman in Mississauga last month. Harjeet Dhadda was shot dead amid concerns about rising extortion and violence targeting South Asian entrepreneurs in Canada."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kamal-haasan-thug-life-ban-in-karnataka-box-office-prediction-2735648-2025-06-04",
      "headline": "Thug Life banned in Karnataka - what does it mean for film's box officeKamal Haasan and director Mani Ratnam's 'Thug Life' is just hours away from its global release on June 5. With the film banned in Karnataka, will it impact the box office?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anushka-sharma-virat-kohli-reach-bengaluru-after-rcb-ipl-win-pbks-fans-throng-streets-to-celebrate-2735671-2025-06-04",
      "headline": "Anushka-Virat receive grand welcome as they arrive in Bengaluru after RCB's IPL winAnushka Sharma and Virat Kohli reached Bengaluru, and fans thronged to their bus to catch a glimpse of the team after RCB won the IPL. The actor shared videos from their visit along with a beautiful note."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virat-kohli-bengaluru-m-chinnaswamy-stadium-fans-celebration-2735743-2025-06-04",
      "headline": "Virat Kohli thanks RCB fans at Bengaluru bash: No fanbase like this in the worldIPL 2025: Batting star Virat Kohli addressed a huge gathering of fans at the M Chinnaswamy Stadium, calling them the best in the world. RCB celebrated their IPL triumph with fans in Bengaluru on Wednesday, June 04. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-victory-sends-kohli-social-stocks-soaring-iyer-shines-too-2735724-2025-06-04",
      "headline": "IPL victory sends Kohli's social stocks soaring, Iyer shines tooFollowing RCB's win over Punjab Kings, Virat Kohli gained 4.4 lakh new followers on Instagram and over 13,000 on Facebook in just two days. Shreyas Iyer, captain of the runner-up Punjab Kings, saw a surge of over 7 lakh followers in the last three days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-win-ipl-2025-mo-bobat-reaction-title-defence-2026-2735708-2025-06-04",
      "headline": "Get addicted to titles, defend IPL crown in 2026: Director Mo Babat to RCBAfter 17 years of heartbreak and near misses, Royal Challengers Bengaluru finally ended their title drought-and their Director of Cricket, Mo Bobat, isn't letting the squad rest on their laurels."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kuldeep-yadav-gets-engaged-to-childhood-friend-vanshika-in-private-ceremony-2735699-2025-06-04",
      "headline": "Kuldeep Yadav gets engaged to childhood friend Vanshika in private ceremonyStar Indian spinner Kuldeep Yadav got engaged to his childhood friend Vanshika just days before departing for the England tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-bengaluru-victory-bash-dk-shivakumar-virat-kohli-airport-2735662-2025-06-04",
      "headline": "Bengaluru IPL bash: Deputy CM DK Shivakumar receives Virat Kohli, RCB at airportIPL 2025: Bengaluru deputy Chief Minister DK Shivakumar received the RCB players, including Virat Kohli and captain Rajat Patidar, at the airport on Wednesday. Thousands gathered outside the Vidhana Soudha where the RCB stars will meet Chief Minister Siddaramaiah."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/rcb-ipl-champions-arrive-bengaluru-deputy-cheif-minister-welcome-2735627-2025-06-04",
      "headline": "IPL champions RCB welcomed by Karnataka Deputy CM on arrival in BengaluruKarnataka Deputy CM DK Shivakumar warmly welcomed IPL champions RCB in Bengaluru. Star players Virat Kohli and Rajat Patidar received special bouquets, as fans celebrated the team's historic maiden IPL 2025 title victory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/groom-stops-wedding-rituals-to-witness-rcb-winning-ipl-trophy-after-18-years-2735620-2025-06-04",
      "headline": "Watch: Groom stops wedding rituals to witness RCB winning IPL trophy after 18 yearsA groom stopped his wedding rituals midway to witness Royal Challengers Bengaluru (RCB) winning their maiden IPL trophy after 18 years. RCB beat Punjab Kings (PBKS) by six runs to win the IPL 2025 final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-jitesh-sharma-rcb-vs-pbks-virat-kohli-2735605-2025-06-04",
      "headline": "Jitesh Sharma emotional as IPL 2025 title dream manifests into realityIPL 2025: Jitesh Sharma was over the moon as his manifestation came true - Royal Challengers Bengaluru lifted their maiden IPL trophy after a six-wicket win over Punjab Kings on Wednesday.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-bengaluru-winning-celebration-live-updates-virat-kohli-ab-de-villiers-chris-gayle-rajat-patidar-2735585-2025-06-04",
      "headline": "RCB celebrations Highlights: Chaos mars RCB's tribute to fansRCB IPL 2025 victory celebrations Bengaluru Highlights: Royal Challengers Bengaluru stars finished up with the trophy presentation ceremony at the M Chinnaswamy stadium and then went on to their victory lap around the ground. Reports have emerged that atleast 7 people have been feared dead due to a stampede outside the stadium, which was expected to be a fan engagement show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishi-sunak-poses-with-virat-kohli-and-anushka-sharma-after-rcbs-ipl-triumph-2735572-2025-06-04",
      "headline": "Rishi Sunak poses with Virat Kohli and Anushka Sharma after RCB's IPL triumphFormer UK Prime Minister Rishi Sunak was seen celebrating with Virat Kohli and Anushka Sharma as Royal Challengers Bengaluru (RCB) beat Punjab Kings (PBKS) by five runs in the Indian Premier League 2025 (IPL 2025 final)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-day-11-live-novak-djokovic-coco-gauff-jannik-sinner-mirra-andreeva-2735573-2025-06-04",
      "headline": "French Open Day 11 LIVE: Gauff reaches semi-final in ParisFrench Open Day 11 Live Updates: Coco Gauff kept her dream of a maiden French Open singles title alive with another straight-sets win to book her place in the semi-finals. Mirra Andreeva is taking on Lois Boisson in the second women's quarter-final of the day. Later in the day, Novak Djokovic and Jannik Sinner will be in action on Centre Court."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/groom-stops-wedding-rituals-to-witness-rcb-winning-ipl-trophy-after-18-years-2735620-2025-06-04",
      "headline": "Watch: Groom stops wedding rituals to witness RCB winning IPL trophy after 18 yearsA groom stopped his wedding rituals midway to witness Royal Challengers Bengaluru (RCB) winning their maiden IPL trophy after 18 years. RCB beat Punjab Kings (PBKS) by six runs to win the IPL 2025 final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-jitesh-sharma-rcb-vs-pbks-virat-kohli-2735605-2025-06-04",
      "headline": "Jitesh Sharma emotional as IPL 2025 title dream manifests into realityIPL 2025: Jitesh Sharma was over the moon as his manifestation came true - Royal Challengers Bengaluru lifted their maiden IPL trophy after a six-wicket win over Punjab Kings on Wednesday.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-bengaluru-winning-celebration-live-updates-virat-kohli-ab-de-villiers-chris-gayle-rajat-patidar-2735585-2025-06-04",
      "headline": "RCB celebrations Highlights: Chaos mars RCB's tribute to fansRCB IPL 2025 victory celebrations Bengaluru Highlights: Royal Challengers Bengaluru stars finished up with the trophy presentation ceremony at the M Chinnaswamy stadium and then went on to their victory lap around the ground. Reports have emerged that atleast 7 people have been feared dead due to a stampede outside the stadium, which was expected to be a fan engagement show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishi-sunak-poses-with-virat-kohli-and-anushka-sharma-after-rcbs-ipl-triumph-2735572-2025-06-04",
      "headline": "Rishi Sunak poses with Virat Kohli and Anushka Sharma after RCB's IPL triumphFormer UK Prime Minister Rishi Sunak was seen celebrating with Virat Kohli and Anushka Sharma as Royal Challengers Bengaluru (RCB) beat Punjab Kings (PBKS) by five runs in the Indian Premier League 2025 (IPL 2025 final)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-day-11-live-novak-djokovic-coco-gauff-jannik-sinner-mirra-andreeva-2735573-2025-06-04",
      "headline": "French Open Day 11 LIVE: Gauff reaches semi-final in ParisFrench Open Day 11 Live Updates: Coco Gauff kept her dream of a maiden French Open singles title alive with another straight-sets win to book her place in the semi-finals. Mirra Andreeva is taking on Lois Boisson in the second women's quarter-final of the day. Later in the day, Novak Djokovic and Jannik Sinner will be in action on Centre Court."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcbs-open-top-bus-parade-in-bengaluru-cancelled-2735537-2025-06-04",
      "headline": "No open bus parade for RCB due to traffic congestion fearsIPL 2025: The open bus parade for Royal Challengers Bengaluru after their Indian Premier League win has been called off due to traffic congestion in the city. On Tuesday, RCB won their maiden title after beating Punjab Kings. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/rcbs-victory-parade-grand-celebration-awaits-in-bengaluru-after-18-year-title-wait-2735477-2025-06-04",
      "headline": "RCB to return to Bengaluru for grand victory parade after historic IPL winRoyal Challengers Bangalore (RCB) are heading back to Bengaluru after their historic IPL victory. A grand celebration awaits the team, including a victory parade starting at 3:30 PM from Akku Vidhan Soda and ending at Chinnaswamy Stadium. The team, led by Virat Kohli, won the title after an 18-year wait. Players will visit the assembly and meet the Chief Minister as part of the celebrations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-pbks-ricky-ponting-not-searching-for-excuses-after-loss-2735524-2025-06-04",
      "headline": "Ponting not searching for excuses after PBKS' loss, vows to win IPL next yearPunjab Kings (PBKS) head coach Ricky Ponting refrained from giving any excuses following his team's loss in the final of the Indian Premier League 2025 (IPL 2025). RCB beat PBKS by six runs in the final to claim their maiden IPL title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-title-bowling-crown-jewel-hazlewood-bhuvneshwar-krunal-2735502-2025-06-04",
      "headline": "Meme-material to game-changers: How bowling became RCB's IPL crown jewelOnce ridiculed for their toothless attack, Royal Challengers Bengaluru's bowling unit turned the narrative on its head in IPL 2025. Long seen as meme-material in a batting-heavy franchise, the bowlers rose to the occasion when it mattered most—delivering the knockout punch in the final and sealing RCB's maiden title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-pbks-virat-kohli-remembers-ab-de-villiers-legacy-2735487-2025-06-04",
      "headline": "Kohli recalls AB de Villiers' eternal legacy: Still has most POTM awards in IPLRoyal Challengers Bengaluru (RCB) batter Virat Kohli recalled AB de Villiers' legacy for the Royal Challengers Bengaluru (RCB) as the team ended their 18-year-long ICC trophy drought."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-order-of-play-novak-djokovic-jannik-sinner-coco-gauff-2735488-2025-06-04",
      "headline": "French Open Day 11: Djokovic, Sinner, Gauff eye semis berthFrench Open 2025 Day 11 Order of Play: Novak Djokovic, Jannik Sinner, Coco Gauff, Mirra Andreeva and others will be looking to secure their berths in the semi-finals of the clay-court major. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-rcb-vs-pbks-sachin-tendulkar-reactions-2735461-2025-06-04",
      "headline": "From Harry Kane to Vijay Mallya: How RCB's title win wowed the worldIPL 2025: Harry Kane, Vijay Mallya and Sachin Tendulkar congratulated Royal Challengers Bengaluru for winning the Indian Premier League title for the first time in 18 seasons.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcbs-trophy-breakthrough-was-built-at-the-auction-table-andy-flower-2735450-2025-06-04",
      "headline": "RCB's trophy breakthrough was built at the auction table: Andy FlowerRoyal Challengers Bengaluru (RCB) head coach Andy Flower has revealed how their smart auction strategy helped them to end 18-year long IPL trophy drought. RCB beat PBKS by six runs in the IPL 2025 final to clinch their maiden title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-pbks-virat-kohli-remembers-ab-de-villiers-legacy-2735487-2025-06-04",
      "headline": "Kohli recalls AB de Villiers' eternal legacy: Still has most POTM awards in IPLRoyal Challengers Bengaluru (RCB) batter Virat Kohli recalled AB de Villiers' legacy for the Royal Challengers Bengaluru (RCB) as the team ended their 18-year-long ICC trophy drought."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-order-of-play-novak-djokovic-jannik-sinner-coco-gauff-2735488-2025-06-04",
      "headline": "French Open Day 11: Djokovic, Sinner, Gauff eye semis berthFrench Open 2025 Day 11 Order of Play: Novak Djokovic, Jannik Sinner, Coco Gauff, Mirra Andreeva and others will be looking to secure their berths in the semi-finals of the clay-court major. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-rcb-vs-pbks-sachin-tendulkar-reactions-2735461-2025-06-04",
      "headline": "From Harry Kane to Vijay Mallya: How RCB's title win wowed the worldIPL 2025: Harry Kane, Vijay Mallya and Sachin Tendulkar congratulated Royal Challengers Bengaluru for winning the Indian Premier League title for the first time in 18 seasons.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcbs-trophy-breakthrough-was-built-at-the-auction-table-andy-flower-2735450-2025-06-04",
      "headline": "RCB's trophy breakthrough was built at the auction table: Andy FlowerRoyal Challengers Bengaluru (RCB) head coach Andy Flower has revealed how their smart auction strategy helped them to end 18-year long IPL trophy drought. RCB beat PBKS by six runs in the IPL 2025 final to clinch their maiden title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-victory-parade-rcb-vs-pbks-full-schedule-2735442-2025-06-04",
      "headline": "RCB victory celebrations after IPL 2025 win: Full scheduleIPL 2025, RCB vs PBKS: Here's the full schedule of Royal Challengers Bengaluru's victory celebration after they won their maiden Indian Premier League title on Tuesday with a six-run win over Punjab Kings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-virat-kohli-rcb-vs-pbks-emotional-2735421-2025-06-04",
      "headline": "A season I'll never forget: Virat Kohli shares emotional note after RCB's winIPL 2025, RCB vs PBKS: Virat Kohli had a special message for his fans after the Royal Challengers Bengaluru won the title for the maiden time with a six-run win over Punjab Kings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-pbks-shreyas-iyer-ricky-ponting-priyansh-arya-prabhsimran-singh-2735408-2025-06-04",
      "headline": "Project Punjab isn't a failure, but it needs a few tweaks after IPL 2025 heartbreakPunjab Kings faced heartbreak in the IPL 2025 Final, but 'Project Punjab' is off to a great start. The Kings will have to maintain consistency and they should  make a few tweaks ahead of next year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/sunil-gavaskar-names-rcbs-best-performance-in-ipl-2025-2735403-2025-06-04",
      "headline": "Sunil Gavaskar names RCB's best performance in IPL 2025Legendary India batter Sunil Gavaskar picked his best performance of the Royal Challengers Bengaluru (RCB) in the Indian Premier League 2025 (IPL 2025) after they finally ended their 18-year-long trophy drought. RCB beat PBKS by six runs in the final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ee-sala-cup-namde-was-like-a-jinx-staying-quiet-worked-for-rcb-sunil-gavaskar-2735396-2025-06-04",
      "headline": "'Ee Sala Cup Namde' felt like a jinx, staying quiet worked for RCB: Sunil GavaskarLegendary India cricketer Sunil Gavaskar said toning down 'Ee Sala Cup Namde' slogan helped Royal Challengers Bengaluru (RCB) massively as it helped them break the jinx and lift the title after 18 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-the-loyal-challenger-from-royal-challengers-bangalore-2735397-2025-06-04",
      "headline": "Virat Kohli, the Loyal Challenger from Royal Challengers BangaloreVirat Kohli's 18-year journey with RCB is a testament to unwavering loyalty, perseverance, and the transformation of raw potential into greatness. The long-awaited IPL triumph not only marked the end of RCB's title drought but also elevated him as a symbol of devotion, character, and the enduring bond between a player and his team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/rcb-ipl-2025-final-rajeev-shukla-interview-2735394-2025-06-04",
      "headline": "Knew RCB would win IPL, but didn't think it would take this long: Rajeev ShuklaIPL 2025 Final, RCB vs PBKS: In an interview with India Today, Rajeev Shukla said that he didn't believe that Royal Challengers Bengaluru would take 18 seasons to win their maiden Indian Premier League trophy. On Tuesday, RCB beat PBKS by six runs at the Narendra Modi Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-virat-kohli-rajeev-shukla-interview-2735391-2025-06-04",
      "headline": "Virat Kohli isn't right for an IPL team, people said: Rajeev Shukla slams criticsIPL 2025, RCB vs PBKS: In an interview with India Today, Rajeev Shukla praised Virat Kohli as the latter won his maiden title after waiting for 18 long seasons. On Tuesday, Bengaluru beat Punjab by six runs at the Narendra Modi Stadium. \r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}