{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/swiggy-launches-new-standalone-app-snacc-heres-all-you-need-to-know-2661621-2025-01-08",
      "headline": "Swiggy launches new standalone app SNACC. Here's all you need to know The app, which is currently available in select Bengaluru neighbourhoods, is aimed at urban consumers who prioritise speed and convenience when it comes to food delivery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-fy25-gdp-may-hit-a-4-year-low-whats-dragging-economic-growth-2661602-2025-01-08",
      "headline": "GDP growth in FY25 may hit 4-year low. Is Indian economy losing steam?While a slowdown in the ongoing financial year was anticipated, the steep downward revision in GDP growth for FY25 has taken many by surprise. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-new-credit-reporting-rules-check-how-it-will-affect-loan-borrowers-2661599-2025-01-08",
      "headline": "RBI's new credit reporting rules: Check how it will affect loan borrowersFrom January 1, 2025, RBI's bi-monthly credit updates aim to boost credit scores, empower borrowers, and improve lender risk assessments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-easier-itr-filing-and-tax-dispute-reduction-expected-says-report-2661579-2025-01-08",
      "headline": "Budget 2025: Easier ITR filing and tax dispute reduction expected, says reportBudget 2025 aims to simplify tax filing, reduce disputes, and foster a transparent, taxpayer-friendly system."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-end-lower-in-volatile-session-reliance-jumps-nearly-2-percent-2661563-2025-01-08",
      "headline": "Sensex, Nifty end lower in volatile session; Reliance jumps nearly 2%Stock market today: The S&P BSE Sensex ended 50.62 points lower to 78,148.49 at the closing bell, while the NSE Nifty50 fell 18.95 points to 23,688.95."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pan-card-fraud-know-details-how-to-stay-safe-from-phishing-scam-2661555-2025-01-08",
      "headline": "PAN card fraud: Know details, how to stay safe from phishing scamA new phishing scam claiming PAN card updates is targeting India Post Payments Bank customers, with PIB urging caution."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-share-price-target-jefferies-30-percent-upside-should-you-buy-2661550-2025-01-08",
      "headline": "Reliance share price jumps nearly 2%. Is there more upside and should you buy?Reliance share price: At 3:26 pm on the Bombay Stock Exchange (BSE), RIL shares were trading 1.81% higher at Rs 1,263.30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/power-output-growth-in-2024-slowest-since-pandemic-report-2661527-2025-01-08",
      "headline": "India's power output growth in 2024 slowest since pandemic: ReportThe deceleration was especially pronounced in the second half of the year, where power generation rose by only 2.3%, compared to a 9.6% rise in the first half."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-can-you-expect-rs-10-lakh-tax-free-income-extending-the-mgnrega-program-ayushman-bharat-scheme-2661478-2025-01-08",
      "headline": "Budget 2025: Can you expect Rs 10 lakh tax-free income?As Budget 2025 nears, the Bharatiya Mazdoor Sangh calls for tax reforms, pension hikes, and worker benefits to ease middle-class burdens."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/sensex-tumbles-600-points-today-3-reasons-why-stock-market-is-falling-2661467-2025-01-08",
      "headline": "Sensex tumbles 600 points today. 3 reasons why stock market is falling Stock market today: Multiple factors were behind today's nervousness on Dalal Street, including weaker growth estimates for FY25, worries over Q3 corporate earnings and the likelihood of fewer US rate cuts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/real-money-is-with-gujjus-nithin-kamath-on-equity-trade-dominance-2661449-2025-01-08",
      "headline": "'Real money is with Gujjus': Nithin Kamath on equity trade dominanceNithin Kamath revealed Mumbai and Ahmedabad drive 80% of equity trades, despite Gujarat having only 8% of registered investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-spandana-sphoorty-stock-price-surged-over-15-percent-today-stmp-2661442-2025-01-08",
      "headline": "Explained: Why Spandana Sphoorty share price surged over 15% todaySpandana Sphoorty share price: At around 10 am, Spandana Sphoorty shares were trading at Rs 461.40 on the National Stock Exchange (NSE), marking a remarkable 35% gain in just two days. By 12:56 pm, the stock had risen 14.62% to Rs 459, signalling strong investor interest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/delta-autocorp-ipo-check-latest-gmp-subscription-status-on-day-2-stmp-2661422-2025-01-08",
      "headline": "Delta Autocorp IPO: Check latest GMP, subscription status on Day 2Delta Autocorp IPO: The IPO opened for subscription on Tuesday and has already been subscribed 13.81 times as of the end of Day 1. By Wednesday afternoon, subscription levels continued to rise, with the issue subscribed 29.54 times as of 12:33 pm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-salaried-earners-up-to-rs-15-lakh-may-get-tax-relief-details-here-2661409-2025-01-08",
      "headline": "Budget 2025: Salaried earners up to Rs 15 lakh may get tax relief. Details hereBudget 2025-26 may offer tax benefits for incomes up to Rs 15 lakh, boosting disposable income and driving economic growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-stock-price-falls-3-percent-today-buy-sell-hold-avoid-explained-stmp-2661396-2025-01-08",
      "headline": "Zomato share price tumbles 3% today as poor market run continues. What's next?  Zomato's shares had already fallen nearly 5% in the previous session, contributing to an 11% drop over the past five trading days. Over the last month, the stock has lost more than 16% of its value."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/why-ola-electric-stock-price-fell-over-5-today-explained-sebi-letter-disclosure-warning-stmp-2661376-2025-01-08",
      "headline": "Explained: Why Ola Electric share price fell over 5% todayOla Electric stock price: The shares of the company hit a low of Rs 75.36 on the Bombay Stock Exchange (BSE), down 4.8% during the session. At around 11:35 am, shares of the company recovered slightly, but were still trading 1.47% lower at Rs 78."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/quadrant-future-tek-ipo-day-2-check-latest-subscription-gmp-and-price-band-stmp-2661351-2025-01-08",
      "headline": "Quadrant Future Tek IPO Day 2: Check latest subscription, GMP and price band Quadrant Future Tek IPO: The grey market premium (GMP) for Quadrant Future Tek IPO stood at Rs 210 as of Wednesday, signalling a premium of approximately 73% over the issue's upper price band of Rs 290. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indo-farm-equipment-share-price-rose-over-7-percent-in-early-trade-strong-ipo-debut-2661338-2025-01-08",
      "headline": "Explained: Why Indo Farm Equipment share price rose over 7% in early tradeOn January 7, Indo Farm Equipment's shares closed with a premium of over 27% against the issue price of Rs 215."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indobell-insulation-ipo-day-3-check-latest-subscription-status-and-gmp-stmp-2661330-2025-01-08",
      "headline": "Indobell Insulation IPO Day 3: Check latest subscription status and GMPIndobell Insulation IPO: The Rs 10.14 crore initial public offering was fully subscribed on the first day itself and continues to attract bids as it enters its final day today, January 8."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-open-lower-amid-weak-sentiments-reliance-jumps-2-2661327-2025-01-08",
      "headline": "Sensex, Nifty open lower amid weak sentiments; Reliance jumps 2%The S&P BSE Sensex was down 141.64 points to 78,057.47 at 10:09 am, while the NSE Nifty50 was trading 42.60 points lower at 23,665.30."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/arvind-kejriwal-aam-aadmi-party-trinamool-congress-support-delhi-assembly-elections-samajwadi-party-india-allies-congress-2661540-2025-01-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "INDIA allies rally around Arvind Kejriwal for Delhi polls, Congress isolatedThe Trinamool Congress, the Shiv Sena (UBT) and the Samajwadi Party have extended their support to the Aam Aadmi Party (AAP) in the upcoming Delhi Assembly elections."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/uttar-pradesh-police-dsp-pp-singh-denies-action-compensation-to-family-alleging-man-died-in-custody-2661574-2025-01-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Video: UP cop brushes off grieving family, says 'Keep the body, do what you want'Samajwadi Party (SP) chief Akhilesh Yadav took note of the turn of events, and also shared the video of PP Singh confronting Ramchandra's family members on X."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/elon-musk-trolls-justin-trudeau-governor-donald-trump-us-canada-merger-threat-2661615-2025-01-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Girl, you're no longer Governor: Elon Musk trolls Trudeau for rejecting merger callElon Musk's remarks came hours after Justin Trudeau asserted that there 'isn't a snowball's chance in hell' that Canada would become part of the United States, as pitched by Donald Trump."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pakistan-board-rumours-stadium-rennovation-tri-series-2661622-2025-01-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Pakistan denies stadium concerns, says Champions Trophy preparation on track Champions Trophy 2025: Pakistan Cricket Board rubbished rumours of under-prepared stadiums, asserting that renovation work at all three venues -- Lahore, Karachi and Rawalpindi -- will be completed on time. Three venues in Pakistan and Dubai will host the premier 50-over tournament, starting February 19. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/los-angeles-wildfire-video-evacuations-pacific-palisades-santa-monica-malibu-traffic-jam-cars-houses-2661473-2025-01-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Inferno in Los Angeles: Frantic scenes as thousands abandon cars, flee on footA massive wildfire in Los Angeles' upscale Pacific Palisades area forced tens of thousands to flee as flames rapidly destroyed homes, gutted vehicles, and overwhelmed emergency services."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-salaried-earners-up-to-rs-15-lakh-may-get-tax-relief-details-here-2661409-2025-01-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Budget 2025: Salaried earners up to Rs 15 lakh may get tax relief. Details hereBudget 2025-26 may offer tax benefits for incomes up to Rs 15 lakh, boosting disposable income and driving economic growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/new-isro-chief-narayanan-priorities-gaganyaan-chandrayaan-space-station-venus-mission-2661575-2025-01-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "New Isro chief lists priorities: Gaganyaan, Chandrayaan 4, own space station Dr V Narayanan, in an exclusive interview with India Today, said the manned mission to space, Chandrayaan-4, and the development of a space station were the priorities of the space agency. He will replace S Somnath."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/travel/story/whats-the-real-story-of-tourism-in-goa-right-now-2661259-2025-01-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "What's the real story of tourism in Goa right now?Is tourism in Goa really declining, or are we missing an undercurrent, a positive one, that can reposition the state's identity as the \"party capital of India\"?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/celebrity/story/ekta-kapoor-slams-unprofessional-actors-ram-kapoor-bade-achhe-lagte-hain-kiss-scene-2661311-2025-01-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ekta Kapoor slams 'unprofessional actors' after Ram Kapoor's remarks on Bade Achhe…Ekta Kapoor called out 'unprofessional actors' after Ram Kapoor spoke about a controversial kissing scene in Bade Achhe Lagte Hain. Ram revealed he had reservations about the scene, but Ekta wanted it. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-rohit-sharma-successor-test-captaincy-not-good-idea-mohammad-kaif-2661498-2025-01-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Jasprit Bumrah for Test captaincy? Don't kill the golden goose, says KaifMohammad Kaif has advised against Jasprit Bumrah as India's Test captain, suggesting that batters KL Rahul or Rishabh Pant would be better options to maintain team balance if Rohit Sharma steps down from the leadership role. The former batter said it's difficult for Bumrah to handle captaincy and manage his workload. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-acquire-control-canada-panama-canal-buy-greenland-arctic-ocean-climate-change-explained-2661429-2025-01-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "What's Trump eyeing with claims on Canada, Panama Canal and GreenlandWeeks before his inauguration, US President-elect Donald Trump stated his intention to make Canada the 51st state of the US, retake the Panama Canal, and acquire Greenland from Denmark. Do the 78-year-old's territorial ambitions reflect mere desires, or do they show strategic, economic, security, and geopolitical foresight in a changing global order?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-rahul-gandhi-vietnam-trip-sharmishtha-mukherjee-pranab-mukherjee-daughter-political-row-2661505-2025-01-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why couldn't Rahul Gandhi wait? Pranab Mukherjee's daughter on Vietnam trip rowSharmistha Mukherjee's comments came about more than a week after the BJP accused the Congress of insensitivity in the wake of the alleged trip, triggering a fresh political row between the two parties."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/man-pleads-cop-rescue-dogs-palisades-home-los-angeles-wildfire-viral-video-2661585-2025-01-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "They're my family: Man urges cop to rescue dogs amid Los Angeles wildfire. VideoA now-viral video showed a man desperately pleading with an officer, saying, \"I need my dogs. They're my family.\" "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-new-credit-reporting-rules-check-how-it-will-affect-loan-borrowers-2661599-2025-01-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "RBI's new credit reporting rules: Check how it will affect loan borrowersFrom January 1, 2025, RBI's bi-monthly credit updates aim to boost credit scores, empower borrowers, and improve lender risk assessments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/delhi-chief-minister-residence-aap-bjp-protest-police-block-sanjay-singh-saurabh-bharadwaj-atishi-2661369-2025-01-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "AAP at PM house, BJP at Delhi Chief Minister's residence as bungalow row hots upThe Delhi Police thwarted AAP leaders' attempt to conduct a media tour at the Chief Minister's residence to counter BJP's allegations of luxurious renovation, resulting in a standoff."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/former-bangladesh-prime-minister-sheikh-hasina-india-visa-extended-amid-extradition-request-2661502-2025-01-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sheikh Hasina's visa extended by India amid extradition demand: SourcesThe move comes against the backdrop of mounting demands from Bangladesh for Sheikh Hasina's extradition. Sources, however, refuted claims of Hasina being granted asylum."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/woman-calmly-walks-away-after-train-passes-over-her-shocking-viral-video-2661650-2025-01-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Woman gets up from tracks, walks calmly after train passes over her. Shocking videoA video of a woman lying on railway tracks as a speeding train passes over her went viral on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/iaf-chief-ap-singh-tejas-fighter-jets-production-delay-china-sixth-generation-aircraft-2661342-2025-01-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Yet to get 40 Tejas ordered in 2010: IAF chief as China tests sixth-gen jetsIndian Air Force (IAF) chief AP Singh has raised concerns over China's astonishing pace of air force modernisation while expressing frustration over the sluggish pace of the delivery of Tejas jets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/unni-mukundan-marco-ending-post-credit-scene-explained-2661450-2025-01-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Marco ending explained: What Unni Mukundan film's post-credit scene meansUnni Mukundan's film Marco is making waves at the box office across India, and its intriguing post-credit scene has sparked several speculations. Is a sequel underway or was Marco a prequel to Mikhael? Here's decoding what the ending and post-credit scene of Marco meant."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-to-announce-champions-trophy-2025-squad-before-january-12-sources-2661554-2025-01-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India to announce Champions Trophy 2025 squad before January 12: SourcesThe BCCI is expected to announce India's squad for the ICC Men's Champions Trophy 2025 by January 12, while the team for the five-match T20I series against England is likely to be revealed a day earlier.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/galileo-galilei-death-stephen-hawking-birth-300-years-apart-united-by-the-cosmos-2661532-2025-01-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Galileo Galilei and Stephen Hawking: 300 years apart, united by the cosmosStephen Hawking was born exactly 300 years after Galileo Galilei died. Their death and birth, exactly 300 years apart on January 8, link two scientific pioneers who turned our understanding of the universe upside down. On this symbolic day, we celebrate their spirit, their genius, and the unbroken thread of human enquiry that connects them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-probable-squad-yashasvi-shami-rohit-virat-rahul-jadeja-2661426-2025-01-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India probable squad: Yashasvi set to be considered; doubts over Shami, JadejaRohit Sharma and Virat Kohli remain central to India's ODI squad, but the futures of KL Rahul, Mohammed Shami, and Ravindra Jadeja are uncertain as selectors prepare for the Champions Trophy. Yashasvi Jaiswal is a strong contender for a spot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bengaluru-techie-atul-subhash-suicide-case-missing-son-haryana-faridabad-school-hostel-2661266-2025-01-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Missing' child of Atul Subhash in Haryana boarding school, Bengaluru cops toldAtul Subhash suicide case: A school in Faridabad confirmed that Atul Subhash's missing child was staying at its hostel. The development comes at a time when the Supreme Court is hearing the plea of Atul's mother seeking custody of her grandson."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kangana-ranaut-invites-priyanka-gandhi-to-watch-emergency-2661361-2025-01-08?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kangana Ranaut invites Priyanka Gandhi to watch Emergency: You will like itActor Kangana Ranaut invited Priyanka Gandhi Vadra to watch Emergency. The actor stressed the film's dignified portrayal of former Indian PM Indira Gandhi, avoiding sensationalism. The film releases on January 17."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/television/reality-tv/story/food-blogger-slams-masterchef-india-makers-after-show-replaced-by-celebrity-edition-2661630-2025-01-08",
      "headline": "Food blogger slams MasterChef India makers after show replaced by celebrity editionA food blogger voiced her disappointment after discovering that MasterChef India, for which she cleared three audition rounds, was replaced by a celebrity edition. She expressed frustration over the lack of communication from the show's producers, learning about the change from external sources."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/abhishek-sharma-recalls-kaho-naa-pyaar-hai-shoot-hrithik-roshan-2661597-2025-01-08",
      "headline": "Abhishek Sharma recalls Kaho Naa... shoot: Was blown by Hrithik's dedicationActor Abhishek Sharma spoke about playing Hrithik Roshan's younger brother in Kaho Naa Pyaar Hai. The film will be re-releasing in cinemas on January 10, coinciding with the star's birthday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/poonam-dhillon-house-theft-man-arrested-2661601-2025-01-08",
      "headline": "Poonam Dhillon on theft at her house: It's not about valuables but the invasionA 37-year-old man was arrested for stealing valuable items from Bollywood actor Poonam Dhillon's home in Mumbai, including a diamond earring and cash. The suspect, who was hired to paint the flat, took advantage of an unlocked cupboard to commit the theft."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/game-changer-box-office-prediction-ram-charan-last-five-films-collection-2661565-2025-01-08",
      "headline": "Game Changer box office prediction and what Ram Charan's last five films madeRam Charan and director Shankar's Game Changer is all set for a grand release in theatres on January 10. Will the film manage to create history at the box office?"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/michael-vaughans-on-archie-to-lead-england-u-19-vs-south-africa-2661651-2025-01-08",
      "headline": "Michael Vaughan's son Archie to lead England U-19 vs South AfricaArchie Vaughan's leadership of England Under-19s during their tour of South Africa marks a significant milestone in his career. Following a successful season with Somerset, Vaughan aims to inspire his team and build on his rapid rise in cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-vs-australia-test-series-glenn-maxwell-inclusion-ricky-ponting-justin-langer-2661643-2025-01-08",
      "headline": "Glenn Maxwell for Sri Lanka tour? Backward step for Australia, says Ricky PontingRicky Ponting feels that Glenn Maxwell being included in the Australia squad for the Sri Lanka tour will be a backward step for the side. Maxwell has been pushing to make it into the squad for the tour of the island nation in recent times. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sa20-2025-live-streaming-squads-schedule-sunrisers-eastern-cape-2661628-2025-01-08",
      "headline": "SA20 2025 Live Streaming: Squads, schedule and all you need to know SA20 2025: Sunrisers Eastern Cape and MI Cape Town will face each other in the opening match of the tournament. 34 games will take place in the championship with the grand final on Saturday, February 8. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pakistan-board-rumours-stadium-rennovation-tri-series-2661622-2025-01-08",
      "headline": "Pakistan denies stadium concerns, says Champions Trophy preparation on track Champions Trophy 2025: Pakistan Cricket Board rubbished rumours of under-prepared stadiums, asserting that renovation work at all three venues -- Lahore, Karachi and Rawalpindi -- will be completed on time. Three venues in Pakistan and Dubai will host the premier 50-over tournament, starting February 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-batter-martin-guptill-confirms-retirement-from-international-cricket-2661576-2025-01-08",
      "headline": "New Zealand batter Martin Guptill confirms retirement from international cricketOne of New Zealand's white-ball greats, Martin Guptill, announced on Wednesday, January 8 that he is retiring from international cricket. Guptill played a total of 367 games for New Zealand during his career. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sunil-gavaskar-alan-border-should-have-presented-border-gavaskar-trophy-together-michael-clarke-2661571-2025-01-08",
      "headline": "Gavaskar and Border should have presented BGT trophy together: ClarkeMichael Clarke criticised the absence of Sunil Gavaskar at the Border-Gavaskar Trophy presentation, suggesting both legends should have been present to honour the series' legacy. Cricket Australia admitted the oversight, agreeing it would have been preferable to include Gavaskar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/fakhar-zaman-champions-trophy-pakistan-selection-2661559-2025-01-08",
      "headline": "100 percent, I will play for Pakistan again: Fakhar on playing Champions Trophy Fakhar Zaman said that he is confident of making a comeback for Pakistan and take part in the Champions Trophy. The 34-year-old hasn't played for Pakistan since the T20 World Cup last year in the West Indies and USA. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/malaysia-open-hs-prannoy-overcomes-brian-yang-and-delay-malvika-bansod-advances-2661567-2025-01-08",
      "headline": "Malaysia Open: HS Prannoy overcomes Brian Yang and delay, Malvika Bansod advancesHS Prannoy overcame a major delay and Brian Yang to progress to the pre-quarters of the Malaysia Open on Wednesday, January 8. Malvika Bansod continued her fine form as she reached the next stage as well. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-to-announce-champions-trophy-2025-squad-before-january-12-sources-2661554-2025-01-08",
      "headline": "India to announce Champions Trophy 2025 squad before January 12: SourcesThe BCCI is expected to announce India's squad for the ICC Men's Champions Trophy 2025 by January 12, while the team for the five-match T20I series against England is likely to be revealed a day earlier.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/didier-deschamps-france-national-football-team-coach-not-renewing-contract-reason-2661549-2025-01-08",
      "headline": "Didier Deschamps on stepping down as France coach: 2026 a very good time to stopDidier Deschamps said that 2026 is a good time for him to stop as the France coach as he decided against renewing his current contract. Deschamps will be leaving the job which he took over in 2012. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-vs-sri-lanka-2nd-odi-report-rain-kusal-nz-series-win-rachin-2661526-2025-01-08",
      "headline": "New Zealand seal series with 113-run win over Sri Lanka in rain-marred 2nd ODI NZ vs SL: New Zealand defeated Sri Lanka by 113 runs in the rain-hit 2nd ODI to take a 2-0 unassailable lead in the three-match series in Hamilton."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/fakhar-zaman-champions-trophy-pakistan-selection-2661559-2025-01-08",
      "headline": "100 percent, I will play for Pakistan again: Fakhar on playing Champions Trophy Fakhar Zaman said that he is confident of making a comeback for Pakistan and take part in the Champions Trophy. The 34-year-old hasn't played for Pakistan since the T20 World Cup last year in the West Indies and USA. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/malaysia-open-hs-prannoy-overcomes-brian-yang-and-delay-malvika-bansod-advances-2661567-2025-01-08",
      "headline": "Malaysia Open: HS Prannoy overcomes Brian Yang and delay, Malvika Bansod advancesHS Prannoy overcame a major delay and Brian Yang to progress to the pre-quarters of the Malaysia Open on Wednesday, January 8. Malvika Bansod continued her fine form as she reached the next stage as well. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-to-announce-champions-trophy-2025-squad-before-january-12-sources-2661554-2025-01-08",
      "headline": "India to announce Champions Trophy 2025 squad before January 12: SourcesThe BCCI is expected to announce India's squad for the ICC Men's Champions Trophy 2025 by January 12, while the team for the five-match T20I series against England is likely to be revealed a day earlier.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/didier-deschamps-france-national-football-team-coach-not-renewing-contract-reason-2661549-2025-01-08",
      "headline": "Didier Deschamps on stepping down as France coach: 2026 a very good time to stopDidier Deschamps said that 2026 is a good time for him to stop as the France coach as he decided against renewing his current contract. Deschamps will be leaving the job which he took over in 2012. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-vs-sri-lanka-2nd-odi-report-rain-kusal-nz-series-win-rachin-2661526-2025-01-08",
      "headline": "New Zealand seal series with 113-run win over Sri Lanka in rain-marred 2nd ODI NZ vs SL: New Zealand defeated Sri Lanka by 113 runs in the rain-hit 2nd ODI to take a 2-0 unassailable lead in the three-match series in Hamilton."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-achieves-career-best-rankings-after-indias-test-series-loss-2661533-2025-01-08",
      "headline": "Jasprit Bumrah achieves career-best rating after India's Test series lossJasprit Bumrah's career-best ICC rating of 908 points highlights his dominance in Test cricket, even as India suffered a 3-1 loss to Australia in the Border Gavaskar Trophy, missing out on the World Test Championship 2025 final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-jasprit-bumrah-rohit-sharma-future-virat-kohli-captain-adam-gilchrist-2661515-2025-01-08",
      "headline": "I won't be surprised if Virat Kohli captains Test team again: Adam GilchristAustralia vs India: Former Australia wicketkeeper said Jasprit Bumrah might find it challenging to handle the full-time captaincy of the Test team. The legendary gloveman said he wouldn't be surprised if Virat Kohli takes up the leadership role in the Test team again. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-rohit-sharma-successor-test-captaincy-not-good-idea-mohammad-kaif-2661498-2025-01-08",
      "headline": "Jasprit Bumrah for Test captaincy? Don't kill the golden goose, says KaifMohammad Kaif has advised against Jasprit Bumrah as India's Test captain, suggesting that batters KL Rahul or Rishabh Pant would be better options to maintain team balance if Rohit Sharma steps down from the leadership role. The former batter said it's difficult for Bumrah to handle captaincy and manage his workload. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-rishabh-pant-arrives-in-india-from-sydney-meets-fans-at-airport-2661485-2025-01-08",
      "headline": "Watch: Rishabh Pant arrives in India from Sydney, meets fans at airportRishabh Pant returned to India after a tough Border-Gavaskar Trophy, warmly greeting fans at Delhi Airport. Despite a forgettable series, his fiery knock in the final Test and charisma off the field keep fans hopeful for his resurgence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nitish-kumar-reddy-ranji-trophy-second-phase-prasidh-krishna-devdutt-padikkal-2661459-2025-01-08",
      "headline": "Nitish Reddy to play Ranji Trophy after impressive Border-Gavaskar TrophyWhile Nitish Reddy is likely to feature in the last two rounds of Ranji Trophy for Andhra, Prasidh Krishna and Devdutt Padikkal are likely to link up with the Karnataka squad for the Vijay Hazare Trophy knockout stages. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealaned-vs-sri-lanka-score-maheesh-theekshana-hat-trick-odi-hamilton-2661438-2025-01-08",
      "headline": "Maheesh Theekshana bags ODI hat-trick, joins Vaas and Malinga in elite listNew Zealand vs Sri Lanka, 2nd ODI: Maheesh Theekshana became the seventh Sri Lankan bowler to take a hat-trick in men's ODI cricket. He achieved the landmark on Wednesday at Seddon Park in Hamilton. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-probable-squad-yashasvi-shami-rohit-virat-rahul-jadeja-2661426-2025-01-08",
      "headline": "India probable squad: Yashasvi set to be considered; doubts over Shami, JadejaRohit Sharma and Virat Kohli remain central to India's ODI squad, but the futures of KL Rahul, Mohammed Shami, and Ravindra Jadeja are uncertain as selectors prepare for the Champions Trophy. Yashasvi Jaiswal is a strong contender for a spot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-2025-afghanistan-appoint-pakistan-great-younis-khan-as-mentor-2661436-2025-01-08",
      "headline": "Champions Trophy 2025: Afghanistan appoint Pakistan great Younis Khan as mentorAfghanistan bolsters its coaching setup with Pakistan legend Younis Khan as mentor for the ICC Champions Trophy 2025. Known for his leadership and batting expertise, Younis aims to guide the team to new heights on the global stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nitish-kumar-reddy-ranji-trophy-second-phase-prasidh-krishna-devdutt-padikkal-2661459-2025-01-08",
      "headline": "Nitish Reddy to play Ranji Trophy after impressive Border-Gavaskar TrophyWhile Nitish Reddy is likely to feature in the last two rounds of Ranji Trophy for Andhra, Prasidh Krishna and Devdutt Padikkal are likely to link up with the Karnataka squad for the Vijay Hazare Trophy knockout stages. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealaned-vs-sri-lanka-score-maheesh-theekshana-hat-trick-odi-hamilton-2661438-2025-01-08",
      "headline": "Maheesh Theekshana bags ODI hat-trick, joins Vaas and Malinga in elite listNew Zealand vs Sri Lanka, 2nd ODI: Maheesh Theekshana became the seventh Sri Lankan bowler to take a hat-trick in men's ODI cricket. He achieved the landmark on Wednesday at Seddon Park in Hamilton. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-probable-squad-yashasvi-shami-rohit-virat-rahul-jadeja-2661426-2025-01-08",
      "headline": "India probable squad: Yashasvi set to be considered; doubts over Shami, JadejaRohit Sharma and Virat Kohli remain central to India's ODI squad, but the futures of KL Rahul, Mohammed Shami, and Ravindra Jadeja are uncertain as selectors prepare for the Champions Trophy. Yashasvi Jaiswal is a strong contender for a spot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-2025-afghanistan-appoint-pakistan-great-younis-khan-as-mentor-2661436-2025-01-08",
      "headline": "Champions Trophy 2025: Afghanistan appoint Pakistan great Younis Khan as mentorAfghanistan bolsters its coaching setup with Pakistan legend Younis Khan as mentor for the ICC Champions Trophy 2025. Known for his leadership and batting expertise, Younis aims to guide the team to new heights on the global stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-pitch-ratings-icc-sydney-test-satisfactory-points-2661394-2025-01-08",
      "headline": "Sydney Test odd one out as ICC releases pitch ratings for Border-Gavaskar TrophyAustralia vs India: The pitches in Perth, Adelaide, Brisbane and Melbourne received the best rating from the International Cricket Council. Sydney pitch was rated average after the series finale at the iconic SCG ended in three days. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/neymar-agrees-cristiano-ronaldo-saudi-pro-league-better-than-ligue-1-comment-2661392-2025-01-08",
      "headline": "Neymar agrees with Cristiano Ronaldo: Saudi Pro League better than Ligue 1Neymar has echoed Cristiano Ronaldo's remarks on the Saudi Pro League, endorsing its competitiveness over Ligue 1. Drawing from his experiences with Al Hilal, the Brazilian superstar highlighted the league's rising quality and influx of top-tier talent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-best-ever-all-format-fast-bowler-michael-clarke-2661379-2025-01-08",
      "headline": "Michael Clarke praises Bumrah as best ever all-format pacerFormer Australia captain Michael Clarke said Jasprit Bumrah was the best all-format fast bowler after the Indian pacer took 32 wickets to rattle Australian batters in the recently concluded Test series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-possible-january-transfer-manchester-united-victor-osimhen-nuno-mendes-2661364-2025-01-08",
      "headline": "Premier League: 7 potential January transfer deals to watch out forThe January transfer window promises excitement for Premier League fans, with Manchester United, Liverpool, and Manchester City preparing to make crucial moves to strengthen their squads for the second half of the season, ensuring high-stakes drama unfolds."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}