{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-rules-know-all-the-rates-slabs-deductions-zero-tax-on-incomes-up-to-rs-12-lakh-and-more-2702350-2025-04-02",
      "headline": "New Income Tax rules: Know all rates, slabs, deductions and moreThe government has amended the income tax slabs under the new tax regime for FY 2025-26. According to the new structure, those earning up to Rs 4 lakh will pay no taxes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-lays-off-600-customer-support-employees-report-2702418-2025-04-01",
      "headline": "Zomato lays off 600 customer support employees: ReportThe company hired nearly 1,500 customer support staff under Zomato's Zomato Associate Accelerator Program (ZAAP), with the goal of promoting them into various roles in sales, operations, supply chains and other departments, within a year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-top-gainers-loser-key-insights-sensex-nifty-technical-indicators-2702333-2025-04-01",
      "headline": "1st trading day of FY26 ends in bloodbath: Top gainers, losers, key insightsThe S&P BSE Sensex ended nearly 1,400 points lower, while the NSE Nifty50 closed below 23,200. The uncertainty surrounding the Trump administration's expected reciprocal tariff imposition on imported goods triggered a significant sell-off, causing the domestic market to underperform other global indices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-falls-nearly-1400-points-nifty-tumbles-350-points-hcltech-tanks-4-percent-2702286-2025-04-01",
      "headline": "Sensex falls nearly 1,400 points, Nifty tumbles 350 points; HCLTech tanks 4%The S&P BSE Sensex plunged 1,390.41 points to close at 76,024.51, while the NSE Nifty50 tanked 353.65 points to end at 23,165.70. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-crash-vix-volatility-fear-index-rise-10-percent-what-should-investors-know-expert-view-2702281-2025-04-01",
      "headline": "Stock market crash: Why should investors watch out for rising volatility?The stock market fear index surged 10% on Tuesday as investors braced for the impact of US reciprocal tariffs, which are set to take effect from April 2."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/us-reciprocal-tariff-impact-on-india-stock-market-crash-sensex-nifty-correction-explained-2702178-2025-04-01",
      "headline": "Sensex down over 1,400 points: US tariff panic or other factors at play?Is the surrounding uncertainty reciprocal tariffs the only factor behind today's stock market bloodbath, or are other underlying issues driving the sharp correction? Read on to find out what's spooking Dalal Street investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/will-epfo-raise-claim-withdrawal-limit-from-rs-1-lakh-to-rs-5-lakh-in-april-2025-check-here-2702170-2025-04-01",
      "headline": "Will EPFO raise claim withdrawal limit to Rs 5 lakh in April 2025? Check hereEPFO is planning to allow Provident Fund (PF) withdrawals via UPI and ATMs soon. This move will make it easier for members to withdraw their PF money without delays."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-will-what-is-no-contest-clause-meaning-rs-3800-crore-wealth-distribution-2702173-2025-04-01",
      "headline": "Ratan Tata's will includes a 'no-contest' clause: What does it mean?Ratan Tata dedicated most of his fortune, including his Tata Sons shares, to charity. However, he also ensured that his family, close friends, employees, and even his cherished pets were taken care of."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/10-major-financial-rule-changes-from-april-1-new-tax-rules-upi-updates-pan-aadhaar-updates-tds-gst-rules-2702124-2025-04-01",
      "headline": "10 major financial rule changes from April 1: Tax, UPI updates and moreFrom April 1, you won't have to pay income tax if your annual income is up to Rs 12 lakh. Also, with a standard deduction of Rs 75,000, income up to Rs 12.75 lakh is tax-free under the new tax system."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-will-rs-3800-crore-who-gets-what-family-trust-pet-dog-2702120-2025-04-01",
      "headline": "Ratan Tata's Rs 3,800 crore will: Who gets what?Ratan Tata will: The industrialist, who died on October 9, 2024, left most of his wealth, including shares in Tata Sons, to charitable causes. At the same time, he did not forget his family, close friends, staff, and even his beloved pets."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/commercial-lpg-cylinder-prices-slashed-by-rs-41-from-today-2702099-2025-04-01",
      "headline": "Commercial LPG cylinder prices slashed by Rs 41 from todayWhile the price of commercial LPG cylinders has been reduced, the price of domestic cylinders used by households has not changed."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/vodafone-idea-share-price-rise-10-percent-reason-government-stake-increase-2702091-2025-04-01",
      "headline": "Explained: Why Vodafone Idea shares hit 10% upper circuit todayVodafone Idea share price: The stock has gained 4.47% in the past five days and 0.27% over the past month. However, it remains 26.45% lower over the past six months and has dropped 46.57% in the last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-tcs-hcltech-stock-price-why-are-it-shares-falling-today-key-reasons-explained-2702090-2025-04-01",
      "headline": "Infosys, TCS, HCLTech: Why are IT stocks down today?Shares of IT companies such as Tata Consultancy Services (TCS), Infosys and HCLTech took a big hit during intraday trade. Infosys was down over 2.3%, while HCLTech and TCS fell as much as 1.7% at around 10:10 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-mobility-stock-price-rising-today-reasons-march-vehicle-registrations-update-2702080-2025-04-01",
      "headline": "Ola Electric shares gain 2% after update on March vehicle registrationsOla Electric shares were trading 2.15% higher at Rs 54.11 on the Bombay Stock Exchange (BSE) at around 9:55 am. The jump in its share price came after the company said there had been an improvement in vehicles registered in March. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-falling-today-sensex-nifty-decline-us-donald-trump-reciprocal-tariff-impact-2702063-2025-04-01",
      "headline": "Sensex crashes 1,400 points. What's behind the stock market bloodbath?Stock market crash: The Sensex and Nifty fell sharply as investors on Dalal Street are worried about the impact of US reciprocal tariffs, which will take effect on April 2. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-bell-sensex-falls-400-points-nifty-slips-below-23500-as-tariff-jitters-hit-dalal-street-2702058-2025-04-01",
      "headline": "Sensex falls 400 points, Nifty slips below 23,500 as tariff jitters hit Dalal StreetThe S&P BSE Sensex was down 253.38 points to 77,161.54, while the NSE Nifty50 fell 46.80 points to 23,472.55 as of 9:31 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-sensex-nifty-april-1-key-levels-to-watch-dalal-street-trump-tariff-2702027-2025-04-01",
      "headline": "Stock market opening on April 1: What to expect from Sensex, Nifty todayStock market today: Market experts believe that the early days of April 2025 will be important for investors due to several key events lined up this month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-april-1-sensex-nifty-today-stock-market-news-ola-electric-indigo-hcltech-adani-energy-2702020-2025-04-01",
      "headline": "Stocks to watch on April 1: Shares in news; IndiGo, Ola, HCLTech, Vodafone IdeaAs markets resume trading, several stocks such as Adani Energy Solutions, IndiGo, Ola Electric, Vodafone Idea, HCLTech among others, are expected to be in focus due to company-specific updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-announces-small-savings-schemes-interest-rates-check-latest-ppf-ssy-and-others-2701779-2025-04-01",
      "headline": "Small savings interest rates: Check latest PPF, SSY and othersThe government examines and fixes interest rates on such schemes quarterly, depending on the economic scenario and market situation.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sp-500-nasdaq-fall-to-lowest-levels-in-over-six-months-amid-tariff-worries-glbs-2701933-2025-03-31",
      "headline": "S&P 500, Nasdaq fall to lowest levels in over six months amid tariff worriesUS stocks tumbled to their lowest levels in over six months as worries over new tariffs weighed on investor sentiment. With fears of a global slowdown and rising inflation, the S&P 500 and Nasdaq saw sharp declines. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/credit-card-spending-drops-in-what-causing-indians-to-spend-less-2701752-2025-03-31",
      "headline": "Credit card spending drops. What's causing Indians to spend less?Big credit card issuers like HDFC Bank, SBI Cards, and ICICI Bank witnessed fewer new customers in February. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/us-reciprocal-tariffs-could-lead-to-another-round-of-stock-market-correction-key-things-to-know-2701667-2025-03-31",
      "headline": "US reciprocal tariffs: Will Dalal Street face more turbulence from April 2?US reciprocal tariffs have put Dalal Street on edge as investors brace for potential market swings. With FPIs cautious and auto stocks under pressure, domestic markets could face more turbulence in the near term.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-tariff-stock-market-impact-9-stocks-to-watch-buy-sell-hold-investor-advice-expert-view-2701644-2025-03-31",
      "headline": "Trump tariffs could hit these 9 stocks. Should you sell?The IT sector is under pressure due to concerns over Trump's trade policies and potential increases in H-1B visa costs. Indian IT firms earn over 50% of their revenue from the US, making them vulnerable to higher hiring costs and reduced outsourcing contracts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/uk-primark-boss-paul-marchant-resigns-after-error-of-judgement-2701626-2025-03-31",
      "headline": "UK's Primark boss resigns after 'error of judgement' in social settingThe group said on Monday that Paul Marchant had cooperated with an investigation led by external lawyers, acknowledged his \"error of judgement\" and accepted that his actions fell below the standards expected by AB Foods."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/claiming-hra-but-not-paying-tds-beware-of-tax-notices-and-penalties-2701582-2025-03-31",
      "headline": "Claiming HRA but not paying TDS? Beware of tax notices and penaltiesThe landlord's PAN must be mentioned in the TDS challan. However, if the PAN is missing or inactive, the TDS is levied at 20% under Section 206AA. On the other hand, for Non-Resident Indian (NRI) landlords, the rate of TDS is 30%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/upcoming-ipos-fy26-slow-start-4-listings-sme-platform-desco-infratech-shri-ahimsa-naturals-atc-energies-2701574-2025-03-31",
      "headline": "IPO market off to a slow start in FY26, but these 4 firms to debut soonThe IPO pipeline for FY26 could be worth nearly Rs 2 lakh crore. Some major companies, including Zepto, Reliance Jio, and LG Electronics, are reportedly in the process of finalising their listing plans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/haldiram-stake-sale-temasek-pwc-expansion-snacks-packaged-foods-market-2701531-2025-03-31",
      "headline": "Haldiram's to sell stake to Singapore's Temasek, says PwCThis stake sale is expected to help Haldiram expand both in India and internationally, strengthening its position in the highly competitive snacks and packaged foods market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/atm-cash-withdrawal-to-get-costlier-may-1-rs-23-charges-go-up-check-new-rbi-rules-here-2701499-2025-03-31",
      "headline": "ATM withdrawals to cost Rs 23 from May 1 as RBI hikes fee. Check detailsATM cash withdrawal will see an increase from the current charge of Rs 21 per transaction. Despite the fee hike, customers will continue to receive a limited number of free ATM transactions every month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-holiday-eid-2025-is-nse-bse-closed-for-trading-monday-dalal-street-sensex-nifty-2701479-2025-03-31",
      "headline": "Is stock market closed today for Eid?The stock market follows a five-day workweek, operating from Monday to Friday. Regular trading hours are from 9:15 am to 3:30 pm. Markets remain closed on weekends and designated public holidays as per the official schedule."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indigo-parent-tax-penalty-order-income-tax-department-airline-contest-frivolous-directive-2701324-2025-03-30",
      "headline": "IndiGo gets Rs 944 crore tax penalty, calls it erroneous and frivolousBudget carrier IndiGo's parent company said it had received a Rs 944 crore tax penalty order from the Income Tax Department. The company plans to challenge the order legally and called it \"frivolous and erroneous\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/top-gainers-losers-stock-market-sensex-nifty-nse-bse-shares-it-auto-trump-tariff-2700664-2025-03-28",
      "headline": "Sensex, Nifty closing: Top stocks that gained and lost on BSE, NSEIT and auto sector stocks dragged the market down. The fall in IT and auto stocks is linked to concerns over US reciprocal tariffs, which are set to come into effect on April 2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/thailand-stock-exchange-halts-trading-after-earthquake-hits-myanmar-2700603-2025-03-28",
      "headline": "Thailand stock exchange halts trading after earthquake hits MyanmarFollowing tremors from the Myanmar earthquake, the Stock Exchange of Thailand suspended all trading for the Friday afternoon session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/da-hiked-by-2-percent-how-much-salary-will-central-government-employees-get-2700579-2025-03-28",
      "headline": "DA hiked by 2%: Here's how much central government employees will earn nowWith the 2% hike, DA has now risen from 53% to 55%. Pensioners will also experience a similar increase in their Dearness Relief (DR)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-ends-191-points-lower-nifty-settles-above-23500-it-stocks-tumble-2700566-2025-03-28",
      "headline": "Sensex, Nifty end FY25 on a weak note as Trump tariffs weigh on Dalal StreetThe S&P BSE Sensex lost 191.51 points to close at 77,414.92, while the NSE Nifty50 was down 72.60 points to end at 23,519.35.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tracking-india-billionaire-growth-from-2014-to-2025-massive-surge-hurun-rich-list-2025-key-data-explained-2700554-2025-03-28",
      "headline": "How India saw a billionaire boom in just 10 yearsIndia's billionaire club isn't just growing—it's thriving. A decade ago, cracking this list was a rare feat. Now, it's happening faster than ever. Even with market swings and economic headwinds, the country keeps adding new names to its billionaire ranks."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/cabinet-approves-da-hike-salary-government-employees-2700544-2025-03-28",
      "headline": "Salary boost for central government employees, DA hiked by 2%With this revision, DA will rise from 53% to 55%, offering a salary boost to employees. The last DA increase took place in July 2024, when it was raised from 50% to 53%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/missed-tax-deducted-at-source-tds-on-rent-here-is-what-tax-department-is-doing-2700536-2025-03-28",
      "headline": "Missed TDS on rent? Here's what tax department is doingThe law requires tenants to deduct TDS at 2% on rent above Rs 50,000 per month, in case the landlord is a resident Indian. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-bilateral-talk-offers-to-lower-us-farm-tariffs-strengthen-trade-ties-diary-report-2700508-2025-03-28",
      "headline": "India offers to lower US farm tariffs, looks to strengthen trade ties: ReportIndia-US trade talk: The government has proposed reducing import duties on several US agricultural products, including almonds, walnuts, cranberries, pistachios, and lentils. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-falling-on-march-28-3-things-explained-for-retail-investors-2700495-2025-03-28",
      "headline": "Why is stock market falling today? 3 things investors need to knowThe S&P BSE Sensex was down 339.66 points to 77,266.77 at 1:13 pm and the NSE Nifty50 traded 100.45 points lower to trade at 23,491.50. Here are three important points retail investors need to know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hurun-global-rich-list-india-billionaire-more-money-saudi-arabia-gdp-mukesh-ambani-adani-roshni-nadar-2700490-2025-03-28",
      "headline": "India's billionaires have wealth bigger than Saudi Arabia's GDP. Check detailsIndia's billionaires now have a combined wealth that exceeds the entire economy of Saudi Arabia. India ranks third globally in the number of billionaires, behind the United States and China."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/sydney-sweeney-splits-from-fiance-jonathan-davino-heres-why-glbs-2702597-2025-04-01",
      "headline": "Sydney Sweeney splits from fiancé Jonathan Davino: Here's whySydney Sweeney has ended her engagement to Jonathan Davino, prioritising her career over wedding plans. The Madame Webb star is focused on upcoming projects, including Euphoria and The Housemaid."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/blake-lively-justin-baldoni-legal-battle-docuseries-on-discovery-2702577-2025-04-01",
      "headline": "Docuseries on Justin Baldoni, Blake Lively's legal feud in worksA docuseries on the legal battle between actors Blake Lively and Justin Baldoni's will be available on Discovery, promising an intriguing look into the complexities of legal disputes.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jennifer-lawrence-welcomes-baby-no-2-with-husband-cooke-maroney-glbs-2702587-2025-04-01",
      "headline": "Jennifer Lawrence welcomes second child with husband Cooke MaroneyActor Jennifer Lawrence welcomed her second child with her husband Cooke Maroney. The got married in October 2019."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/zoe-saldana-joins-kendrick-lamar-and-gracie-abrams-in-webby-nominations-glbs-2702567-2025-04-01",
      "headline": "Zoe Saldaña joins Kendrick Lamar and Gracie Abrams in Webby nominationsWith nearly 13,000 entries from over 70 countries, the competition includes viral music videos, top podcasts, and unexpected social media sensations. Voting for the Webby People's Voice Award is open until April 17, with winners announced on April 22."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/kevin-hart-to-perform-in-india-on-april-30-2702524-2025-04-01",
      "headline": "Actor-comedian Kevin Hart to perform in India for the first timePopular actor-comedian Kevin Hart is set to make his first-ever performance in India as part of his global comedy tour. He is set to perform in the country on April 30. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/fawad-khan-vaani-kapoor-abir-gulaal-faces-scrutiny-release-uncertain-2702507-2025-04-01",
      "headline": "Fawad Khan's comeback to Indian theatres already under scannerFawad Khan and Vaani Kapoor's upcoming film, Abir Gulaal, faces opposition from film associations in India, despite the Bombay High Court rejecting a 2023 petition to ban Pakistani artists. With producer groups and political parties firm in their stance, the film's future remains uncertain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jason-momoa-confirms-he-is-returning-to-the-dune-universe-2702481-2025-04-01",
      "headline": "Jason Momoa confirms he is returning to the Dune universeHollywood star Jason Momoa will be returning to the science-fiction world of Dune, the actor confirmed in a recent interview. He played Duncan Idaho in the first part. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/barkha-bisht-karan-singh-grover-relationship-got-attracted-to-his-kindness-2702505-2025-04-01",
      "headline": "Barkha Bisht recalls relationship with Karan Singh GroverIn a candid interview, Barkha Bisht discussed her past relationships, revealing the reasons behind her breakup with Karan Singh Grover. She shared that she was attracted to his kindness, and grew apart."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/karthi-on-sardar-2-the-sequel-will-feature-a-much-bigger-war-2702468-2025-04-01",
      "headline": "Karthi on Sardar 2: The sequel will feature a much bigger warThe teaser for the highly anticipated sequel, Sardar 2, showcases Karthi reprising his dual roles as Indian spy Sardar and his son Vijay, gearing up for a much larger war."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/gulshan-devaiah-on-working-with-anurag-kashyap-hes-so-full-of-himself-2702491-2025-04-01",
      "headline": "Gulshan Devaiah on working with Anurag Kashyap: He's so full of himself but...Gulshan Devaiah recently revealed his thoughts on working with Anurag Kashyap, calling him confident yet collaborative. The actor shared his experience during a Reddit AMA session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/asit-modi-reacts-to-disha-vakanis-return-to-taarak-mehta-we-can-only-pray-2702490-2025-04-01",
      "headline": "Asit Modi reacts to Disha Vakani's return to Taarak Mehta: We can only prayProducer Asit Kumar Modi broke his silence on the ongoing rumours about the possibility of the return of the character Dayaben in Taarak Mehta Ka Ooltah Chashmah. He also revealed whether there's a possibility of actor Disha Vakani's return. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/5-south-indian-sequels-beyond-baahubali-kgf-pushpa-that-clicked-with-fans-2702416-2025-04-01",
      "headline": "5 South Indian sequels beyond Baahubali, KGF, Pushpa, that clicked with fansLast weekend witnessed a slew of film releases, including sequels like Mohanlal's L2: Empuraan and Mad Square, as well as prequels such as Veera Dheera Sooran Part 2 and Robinhood. Here are five recent South Indian sequels that struck a chord with audiences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/esha-deol-wants-dhoom-to-re-release-2702424-2025-04-01",
      "headline": "Esha Deol wants Dhoom to re-release: Kids still remember me for the filmActor Esha Deol recently said she wants Dhoom to be released again in cinemas. Apart from Deol, the film starred Abhishek Bachchan, Uday Chopra and John Abraham in the lead. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/subham-teaser-samantha-turns-producer-with-a-quirky-horror-comedy-2702405-2025-04-01",
      "headline": "Subham teaser: Samantha turns producer with the quirky horror-comedyActor Samantha released the teaser of her debut production, Subham. The Telugu horror-comedy offers a sneak peek into its intriguing premise, showcasing the film's distinct blend of horror and humour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/john-abraham-the-diplomat-screened-in-israel-as-tribute-to-india-israel-relations-2702394-2025-04-01",
      "headline": "John Abraham's Diplomat screened in Israel as tribute to India-Israel relationsIn a gesture celebrating India-Israel relations, Israel has screened John Abraham's film The Diplomat. Directed by Shivam Nair, the film hit theatres on March 14. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/jessica-simpson-vocal-cord-remedy-chinese-herb-cocktail-with-snake-sperm-2702368-2025-04-01",
      "headline": "Drink snake sperm if you want good vocal: Singer Jessica SimpsonAmerican singer and actor Jessica Simpson recently shared her unusual method for maintaining her vocal cords, involving a Chinese herb cocktail containing snake sperm. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/andaz-apna-apna-salman-khan-aamir-khans-cult-comedy-to-re-release-on-april-25-2702393-2025-04-01",
      "headline": "Andaz Apna Apna: Salman Khan, Aamir Khan's cult comedy to re-release on April 25Bollywood's beloved comedy 'Andaz Apna Apna' is making a comeback to the big screen. The cult classic will be re-released in cinemas nationwide, delighting both new and old fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shalini-pandey-south-director-entered-van-when-she-was-changing-2702297-2025-04-01",
      "headline": "Actor Shalini Pandey says South director entered her van when she was changingActor Shalini Pandey, who made her debut with the Telugu film Arjun Reddy, said that a South director entered her van without knocking on the door. She also recalled how she reacted at the moment."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kim-soo-hyuns-press-meet-draws-flak-from-fans-being-highest-paid-actor-backfired-2702346-2025-04-01",
      "headline": "Being highest paid actor backfired: Internet after Kim Soo-hyun's conferenceActor Kim Soo-hyun's recent press conference regarding the Kim Sae-ron death controversy has been met with significant backlash. Internet accused him of being overly rehearsed and failing to convince the public of his innocence."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/opposition-parties-waqf-bill-debate-parliament-oppose-lok-sabha-meeting-budget-session-2702478-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Opposition united against government's 'divisive' agenda on Waqf billOpposition parties have said they will oppose the Waqf bill \"tooth and nail\" when the proposed legislation is taken up for discussion and passage in the Lok Sabha on Wednesday, sources told India Today TV."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/reciprocal-tariffs-to-be-effective-immediately-white-house-ahead-of-trumps-move-glbs-2702576-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Tariffs announced on April 2 to be effective immediately: White HouseThe White House confirmed that President Trump will announce reciprocal tariffs on April 2, with auto tariffs set to take effect on April 3. Press Secretary Karoline Leavitt stated Trump is fine-tuning his tariff strategy with trade advisors for a \"perfect deal\" for Americans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjp-new-national-president-announcement-post-parliament-session-april-end-jp-nadda-successor-2702571-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "BJP likely to get new national president by third week of April: SourcesThe BJP's search for a new party president to succeed Jagat Prakash Nadda is likely to pick speed once the Parliament session is over, sources said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/why-a-usual-us-bombing-campaign-will-not-bring-iran-to-heel-2702482-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why a usual US bombing campaign will not bring Iran to heelFor Trump, any amplified war with Iran will stand against his promises of not dragging the US into wars in faraway lands. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/who-is-to-be-blamed-for-sikandar-salman-khan-magnum-opus-by-ar-murugadoss-which-failed-to-impress-his-fans-2702250-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Who is to be blamed for Sikandar?'Sikandar' is like the final nail in the coffin for the audience who have loved, celebrated and almost worshipped Salman Khan for being this undisputable, badass superstar, with a command on the big-screen like no other. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bangaldesh-awami-league-member-fled-india-2702626-2025-04-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Over 1 lakh Awami League members fled to India, claims Bangladesh advisorA Bangladesh government advisor claims over 1 lakh Awami League members fled to India. He accuses Sheikh Hasina of conspiring from abroad and criticises her tenure.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistan-violates-ceasefire-agreement-loc-poonch-jammu-kashmir-indian-army-retaliates-2702528-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Pak violates ceasefire at LoC in Poonch, Indian Army retaliatesThe Indian Army successfully thwarted an infiltration attempt by the Pakistan Army in the Krishna Ghati area of Poonch district."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mumbai-police-third-summon-kunal-kamra-joke-row-2702623-2025-04-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Mumbai Police summons Kunal Kamra for third time over Eknath Shinde joke rowMumbai Police has issued a third summons to comedian Kunal Kamra over his parody video mocking Deputy Chief Minister Eknath Shinde.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/democratic-party-cory-booker-record-senate-speech-protest-donald-trump-2702628-2025-04-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Democrat Cory Booker sets Senate 25-hour speech record, protests Trump actionsSen. Cory Booker set a 25-hour Senate speech record, protesting Trump's tariff plans and policies. Meanwhile, Trump announced new tariffs and layoffs affecting thousands.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/university-of-bath-school-of-management-a-pathway-to-global-career-success-2702196-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "University of Bath School of Management: A Pathway to Global Career SuccessBath's School of Management blends top academics, hands-on learning, and career support to help students secure jobs at leading global companies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-pbks-score-shreyas-iyer-big-win-lucknow-2702569-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Shreyas Iyer's PBKS lay down early marker after crushing LSG in LucknowIPL 2025, LSG vs PBKS: Shreyas Iyer led from the front once again as Punjab Kings hammered Lucknow Super Giants, chasing a 172-run target in just 16.2 overs. Rishabh Pant failed for the third successive match as Lucknow's new skipper in the 2025 season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/elon-musks-team-to-fire-all-local-workers-diplomats-from-usaid-report-glbs-2702581-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Elon Musk's team to fire all local workers, diplomats from USAID: ReportElon Musk's cost-cutting team is finalizing the shutdown of USAID, ordering mass layoffs of diplomats and civil servants. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/after-brain-rot-instagram-reels-are-now-leading-to-eye-disorders-doctors-issue-urgent-warning-2702381-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "After 'brain rot', reels now leading to eye disorders: Docs raise concernExcessive screen time, particularly binge-watching reels on social media platforms is leading to a spike in eye disorders across all age groups, especially among children and young adults."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-diesel-price-hiked-by-rs-2-per-litre-after-tax-increase-from-april-1-2702518-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Karnataka hikes diesel tax, pushing prices up by Rs 2 per litre from April 1The Karnataka government has raised the sales tax on diesel, increasing its price by Rs 2 per litre. The move comes amid rising costs in fuel, property tax, electricity, and essential goods.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-indias-northeast-must-worry-about-muhammad-yunuss-statement-in-china-2702439-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why India's Northeast must worry about Muhammad Yunus's statement in ChinaBy calling Bangladesh the 'guardian' of ocean access for the northeastern states, Yunus has drawn China in, weaponised geography and triggered regional security alarms"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/sanitation-worker-income-tax-notice-rs-33-crore-uttar-pradesh-aligarh-2702503-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "UP sanitation worker earning Rs 15,000 monthly gets tax notice of Rs 33.88 croreThe man, who works as a cleaner at a SBI branch, receives a monthly salary of Rs 15,000. Last month, he received an Income Tax notice of over Rs 33 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/up-man-wife-married-lover-brings-her-back-sant-kabir-nagar-regrets-mistake-2702380-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "UP man regrets getting wife married to lover, brings her back homeA man in Uttar Pradesh's Sant Kabir Nagar recently arranged his wife's marriage to her lover. But just a few days later, he went to her new husband's house, asking her to return as he was struggling to take care of their two children."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/after-deepseek-r1-china-to-stun-world-with-nuclear-game-chang-er-xinghuo-fusion-fission-reactor-2702175-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "After DeepSeek R1, China might stun world with a nuclear game-chang​erChina recently shook the AI space with its DeepSeek R1. China's next surprise could be in the field of energy as it works to operationalise a fusion-fission reactor, the world's first, in the next five years. This is why its Xinghuo reactor could be a game-changer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/kevin-hart-to-perform-in-india-on-april-30-2702524-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Actor-comedian Kevin Hart to perform in India for the first timePopular actor-comedian Kevin Hart is set to make his first-ever performance in India as part of his global comedy tour. He is set to perform in the country on April 30. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/canada-mexico-discuss-us-trade-action-response-tariff-mark-carney-claudia-sheinbaum-2702622-2025-04-02#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Canada, Mexico discuss response to US 'unjustified trade actions'Canada's Prime Minister Mark Carney and Mexico's President Claudia Sheinbaum discussed strategies to counter US trade actions and safeguard North American competitiveness. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/fawad-khan-vaani-kapoor-abir-gulaal-faces-scrutiny-release-uncertain-2702507-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Fawad Khan's comeback to Indian theatres already under scannerFawad Khan and Vaani Kapoor's upcoming film, Abir Gulaal, faces opposition from film associations in India, despite the Bombay High Court rejecting a 2023 petition to ban Pakistani artists. With producer groups and political parties firm in their stance, the film's future remains uncertain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/death-penalty-luigi-mangione-unitedhealthcare-ceo-brian-thompson-murder-us-prosecutors-2702509-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Death penalty sought for Luigi Mangione in UnitedHealthcare CEO's murder caseUS Attorney General Pamela Bondi has directed federal prosecutors to seek the death penalty for Luigi Mangione, accused of killing UnitedHealth CEO Brian Thompson in New York."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/waqf-amendment-bill-parliament-controversial-provisions-explained-2702387-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ahead of Waqf bill war in Parliament, a look at what fuelled the controversyA big showdown is expected in Parliament today as the Waqf (Amendment) Bill will be taken up for discussion and passage. While the BJP and many of its allies have rallied behind the bill, the Opposition has vowed to stand against it. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/diu/story/india-apparel-sector-may-be-hit-hardest-by-trump-us-reciprocal-tariffs-2702410-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why India's apparel sector may be hit hardest by Trump's reciprocal tariffsAccording to Emkay Research, while India could be among the worst-hit nations per broad reciprocal differentials, the key susceptible sectors (auto, pharma, electronics) are far better placed than feared. Apparel and gems/jewellery are the most exposed."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-2011-world-cup-final-ms-dhoni-gautam-gambhir-anniversary-14-2702615-2025-04-02",
      "headline": "India's 2011 World Cup winning squad: Where are they now on 14th anniversary?14 years ago on this very day, MS Dhoni's India won the ODI World Cup after beating Sri Lanka by six wickets in front of a packed house at the Wankhede Stadium in Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-zaheer-khan-lsg-vs-pbks-press-conference-2702618-2025-04-02",
      "headline": "Zaheer Khan takes a dig at LSG curator: Didn't seem like a home gameIPL 2025, LSG vs PBKS: Mentor Zaheer Khan said that the Lucknow Super Giants didn't get the home advantage they would have expected in their clash against the Punjab Kings on Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-points-table-lsg-vs-pbks-second-spot-lucknow-2702617-2025-04-02",
      "headline": "IPL 2025 Points Table, April 1: PBKS jump to 2nd after thrashing LSGPunjab Kings jumped to second in IPL 2025 points table after thrashing Lucknow Super Giants, as skipper Shreyas Iyer and Prabhsimran Singh star in a dominant chase at the Ekana Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-hyderabad-cricket-association-complimentary-passes-agreement-2702616-2025-04-02",
      "headline": "IPL 2025: SRH, Hyderabad board bury the hatchet over free ticket rowSunrisers Hyderabad and the Hyderabad Cricket Association reached a resolution over complimentary ticket distribution, safeguarding home IPL 2025 matches at the Rajiv Gandhi International Stadium in Hyderabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-pbks-rishabh-pant-trolled-auction-tension-comment-2702600-2025-04-01",
      "headline": "Punjab Kings troll Rishabh Pant for auction tension joke after hammering LucknowIPL 2025, LSG vs PBKS: Punjab Kings took a cheeky dig at Rishabh Pant for his viral 'tension' comment earlier this year after hammering Lucknow Super Giants by 8 wickets on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-coach-ricky-ponting-always-positive-lsg-vs-pbks-2702589-2025-04-01",
      "headline": "No ifs and buts, best coach Ricky Ponting is always positive: PBKS starsRicky Ponting's positivity earned praise from PBKS stars Prabhsimran Singh and Nehal Wadhera, who credit the head coach's mindset for motivating the team's strong start to the IPL 2025 season with two wins in two matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-pbks-ricky-ponting-catch-boundary-video-2702585-2025-04-01",
      "headline": "Watch: Ball boy takes stunning catch, impresses Ricky PontingIPL 2025: Punjab Kings' head coach Ricky Ponting was impressed with a ball boy who took a sharp catch outside the boundary in the match against Lucknow Super Giants. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-isaiah-stewart-and-four-others-face-suspension-as-scuffle-broke-out-during-pistons-vs-timberwolves-glbs-2702582-2025-04-01",
      "headline": "NBA: Isaiah Stewart and four others face suspension as scuffle broke out during Pistons vs TimberwolvesDuring the NBA regular game between the Detroit Pistons and Minnesota Timberwolves on Sunday, March 30, at Target Center, five players faced a one-game suspension due to an on-court altercation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-pbks-score-shreyas-iyer-big-win-lucknow-2702569-2025-04-01",
      "headline": "Shreyas Iyer's PBKS lay down early marker after crushing LSG in LucknowIPL 2025, LSG vs PBKS: Shreyas Iyer led from the front once again as Punjab Kings hammered Lucknow Super Giants, chasing a 172-run target in just 16.2 overs. Rishabh Pant failed for the third successive match as Lucknow's new skipper in the 2025 season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-gt-mo-bobat-rajat-patidar-2702568-2025-04-01",
      "headline": "Rajat Patidar been everything we expected: RCB director Mo BobatIPL 2025: RCB Director of Cricket Mo Bobat praised Rajat Patidar for his captaincy as the Royal Challengers Bengaluru are sitting on top of the table in the ongoing tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-coach-ricky-ponting-always-positive-lsg-vs-pbks-2702589-2025-04-01",
      "headline": "No ifs and buts, best coach Ricky Ponting is always positive: PBKS starsRicky Ponting's positivity earned praise from PBKS stars Prabhsimran Singh and Nehal Wadhera, who credit the head coach's mindset for motivating the team's strong start to the IPL 2025 season with two wins in two matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-pbks-ricky-ponting-catch-boundary-video-2702585-2025-04-01",
      "headline": "Watch: Ball boy takes stunning catch, impresses Ricky PontingIPL 2025: Punjab Kings' head coach Ricky Ponting was impressed with a ball boy who took a sharp catch outside the boundary in the match against Lucknow Super Giants. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-isaiah-stewart-and-four-others-face-suspension-as-scuffle-broke-out-during-pistons-vs-timberwolves-glbs-2702582-2025-04-01",
      "headline": "NBA: Isaiah Stewart and four others face suspension as scuffle broke out during Pistons vs TimberwolvesDuring the NBA regular game between the Detroit Pistons and Minnesota Timberwolves on Sunday, March 30, at Target Center, five players faced a one-game suspension due to an on-court altercation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-pbks-score-shreyas-iyer-big-win-lucknow-2702569-2025-04-01",
      "headline": "Shreyas Iyer's PBKS lay down early marker after crushing LSG in LucknowIPL 2025, LSG vs PBKS: Shreyas Iyer led from the front once again as Punjab Kings hammered Lucknow Super Giants, chasing a 172-run target in just 16.2 overs. Rishabh Pant failed for the third successive match as Lucknow's new skipper in the 2025 season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-gt-mo-bobat-rajat-patidar-2702568-2025-04-01",
      "headline": "Rajat Patidar been everything we expected: RCB director Mo BobatIPL 2025: RCB Director of Cricket Mo Bobat praised Rajat Patidar for his captaincy as the Royal Challengers Bengaluru are sitting on top of the table in the ongoing tournament. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}