{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/terrific-effort-but-still-away-from-being-good-and-simple-tax-ex-cea-on-gst-20-2782748-2025-09-05",
      "headline": "Terrific effort but still away from being Good and Simple Tax: Ex-CEA on GST 2.0Former Chief Economic Advisor Arvind Subramanian analyses the recent GST rationalisation. He states the tax has become \"more good and more simple\" with the removal of the 28% slab, but cautions, \"we're still some ways away from reaching that goal.\" "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-prices-in-delhi-rates-surge-by-rs-900-to-rs-107-lakh-amid-interest-rate-cut-hopes-2782688-2025-09-05",
      "headline": "Gold prices surge by Rs 900 to Rs 1.07 lakh amid interest rate cut hopesGold of 99.5 per cent purity advanced by Rs 900 to Rs 1,06,100 per 10 grams (inclusive of all taxes) on Friday, from the previous close of Rs 1,05,200 per 10 grams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-forex-reserves-usd-35-billion-to-usd-694-billion-says-reserve-bank-of-india-2782682-2025-09-05",
      "headline": "India's forex reserves rise by $3.5 billion to $694 billion, says RBIFor the week ended August 29, foreign currency assets, a major component of the reserves, increased by USD 1.686 billion to USD 583.937 billion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/upcoming-ipos-urban-company-dev-accelerator-shringar-house-of-mangalsutra-details-gmp-review-2782623-2025-09-05",
      "headline": "Urban Company and 2 IPOs lined for next week. Check GMP and detailsUrban Company, Dev Accelerator and Shringar House of Mangalsutra will all launch their IPOs on September 10, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/the-truth-behind-guaranteed-8-10-returns-expert-explains-the-reality-2782468-2025-09-05",
      "headline": "The truth behind \"Guaranteed 8–10% Returns\": Expert explains the realityMany savers in India are often attracted to insurance plans that promise \"guaranteed\" returns, offering the appeal of steady growth without exposure to market risks. But do these policies actually deliver what they claim?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/nirmala-sitharaman-on-gst-20-citizen-relief-and-way-forward-2782535-2025-09-05",
      "headline": "Nirmala Sitharaman on GST 2.0, citizen relief, and way forwardIn an exclusive interview with India Today TV, Finance Minister Nirmala Sitharaman talked about the next-generation GST reforms, GST classification, how the GST reforms benefits will be passed on to common man, the opposition's 'Gabbar Singh Tax' jibe on GST and much more. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/finance-minister-on-gst-slabs-medicine-taxes-and-us-india-tariff-war-ytvd-2782566-2025-09-05",
      "headline": "Finance Minister on GST Slabs, Medicine Taxes, and US-India Tariff WarFinance Minister Nirmala Sitharaman, during an exclusive interview with India Today TV, addressed public's queries from Lucknow on key economic issues, including GST slabs and international trade tariffs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/nirmala-sitharaman-answers-questions-on-gst-reforms-from-kolkata-2782553-2025-09-05",
      "headline": "Nirmala Sitharaman answers questions on GST reforms from KolkataFinance Minister Nirmala Sitharaman, during an exclusive interview with India Today TV, addressed questions of public from Kolkata regarding recent GST reforms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-auto-sector-stocks-gain-it-shares-down-mahindra-ril-2782548-2025-09-05",
      "headline": "Sensex, Nifty end flat as auto sector stocks offset losses by IT sharesThe S&P BSE Sensex was down by just 7.25 points to close at 80,710.76, while the NSE Nifty50 gained a paltry 6.70 points to end at 24,741.00. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-gst-started-with-four-slabs-finance-minister-nirmala-sitharaman-explains-exclusive-interview-with-india-today-2782539-2025-09-05",
      "headline": "Exclusive: Why GST started with 4 slabs? Nirmala Sitharaman explainsWhen GST was launched in 2017, it came with four slabs, 5%, 12%, 18% and 28%. With GST 2.0 now moving to a simpler two-slab system, Nirmala Sitharaman has explained why the original multi-slab structure was necessary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/insurance-tax-free-benefit-pass-to-people-private-public-sector-finance-minister-nirmala-sitharaman-2782521-2025-09-05",
      "headline": "Exclusive: Will common man get insurance rate cut benefits in GST 2.0? FM answersFinance Minister Nirmala Sitharaman made it clear that the tax relief was introduced for citizens and not for insurance companies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/popcorn-puzzle-solved-nirmala-sitharaman-explains-gst-classification-2782506-2025-09-05",
      "headline": "Popcorn puzzle solved: Nirmala Sitharaman explains GST classificationIn an exclusive interview with India Today TV, Finance Minister Nirmala Sitharaman explained why salted and chocolate-coated variants had earlier attracted different GST rates."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rakesh-roshan-turns-76-ameesha-simi-garewal-extend-wishes-throwback-pics-2783021-2025-09-06",
      "headline": "Rakesh Roshan turns 76: Ameesha, Simi Garewal extend wishes with throwback picsActor Ameesha Patel wished her mentor Rakesh Roshan on his 76th birthday. She called him a 'beacon of hope' by sharing a throwback photo. His actor-friend Simi Garewal also wrote a sweet birthday note for him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-cheers-for-kalyani-priyadarshan-lokah-chandra-gave-me-goosebumps-2783018-2025-09-06",
      "headline": "Chandra gave me goosebumps: Samantha cheers for Kalyani Priyadarshan's Lokah'Lokah: Chapter 1', featuring Kalyani Priyadarshan as India's first female superhero, has garnered widespread acclaim for its captivating blend of mythology and fantasy. Recently, Samantha joined the list of celebs who hailed the movie. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-salman-khan-scolds-amaal-malik-asks-if-he-only-came-to-sleep-2783002-2025-09-06",
      "headline": "Bigg Boss 19: Salman Khan scolds Amaal Malik, asks if he only came to sleepBigg Boss 19 host Salman Khan scolded singer Amaal Malik for not living up to the audience's expectations as a contestant on the reality show. Salman asked Amaal whether he wanted to make a difference or not."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amol-parashar-responds-to-relationship-buzz-with-konkona-sensharma-people-made-it-official-2782999-2025-09-06",
      "headline": "Amol Parashar responds to relationship buzz with Konkona: People made it officialAmol Parashar addressed rumours about his relationship with Konkona Sensharma, clarifying their public appearance was just a casual event with friends and family. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/siima-2025-full-winners-list-allu-arjun-rashmika-mandanna-win-big-2782980-2025-09-06",
      "headline": "SIIMA 2025 full winners list: Allu Arjun, Rashmika Mandanna win bigThe South Indian International Movie Awards 2025 celebrated outstanding achievements in South Indian cinema, with 'Kalki 2898 AD' winning Best Film and multiple honours for 'Pushpa 2: The Rule'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/director-vikram-bhatts-mother-dies-at-85-after-prolonged-illness-report-2782978-2025-09-06",
      "headline": "Director Vikram Bhatt's mother dies at 85 after prolonged illness. ReportDirector-producer Vikram Bhatt's mother Varsha Bhatt died at 85 after a prolonged illness, according to reports. The family is yet to release an official statement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-tanya-mittal-family-reacts-criticism-requests-kindness-humanity-2782961-2025-09-06",
      "headline": "Bigg Boss 19: Tanya Mittal's family reacts to criticism, requests people to be kind'Bigg Boss 19' contestant Tanya Mittal is currently at the centre of social media debates. Her parents have now appealed for fairness and asked viewers to reserve judgment until the show ends."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/die-my-love-trailer-robert-pattinson-jennifer-lawrence-play-chaotic-couple-2782937-2025-09-06",
      "headline": "Die My Love trailer: Robert Pattinson, Jennifer Lawrence play a chaotic coupleLynne Ramsay has returned to direction with her new film 'Die My Love', featuring Jennifer Lawrence and Robert Pattinson. The movie shows a chaotic life of a couple living in rural Montana."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-reacts-to-stepping-down-from-malayalam-film-body-it-was-time-to-move-on-2782968-2025-09-06",
      "headline": "Mohanlal reacts to stepping down from Malayalam film body: It was time to move onMohanlal resigned as AMMA president following criticism over the handling of sexual abuse complaints, clarifying his decision was a timely conclusion rather than a response to public pressure. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/a-very-jonas-christmas-teaser-kevin-jonas-joe-jonas-nick-jonas-bring-holiday-mischief-to-screens-2782945-2025-09-06",
      "headline": "A Very Jonas Christmas teaser: The Jonas Brothers' festive fun is here to sleighThe Jonas Brothers have delighted fans with a sneak peek of their festive film 'A Very Jonas Christmas Movie', premiering on Disney+ this November. Featuring comedy, music, and family moments, the movie promises a joyous holiday experience with a star-studded cast and original songs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/nostalgia-save-theatres-bollywood-hollywood-bet-cinema-icons-meena-kumari-biopic-rocky-2782582-2025-09-06",
      "headline": "Can nostalgia save theatres? Bollywood-Hollywood bet on cinema icons and memoriesPop culture icons are the new flavour of the season in Indian cinema and Hollywood. Where is cinema headings with the announcement of Sourav Ganguly and Meena Kumari biopics, 'Rambo' origins story, 'I Play Rocky' and 'The Smashing Machine'? On Cinematic Saturday, we reflect on the future of storytelling as filmmakers recreate nostalgia to evoke audience emotions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhamaal-4-shoot-wrap-ajay-devgn-eid-2026-comedy-2782903-2025-09-06",
      "headline": "Dhamaal 4 shoot wraps up, set for Eid 2026 releaseActor Ajay Devgn has officially wrapped up 'Dhamaal 4' shoot in Mumbai after six months. The film promises a unique blend of comedy, drama and action for its Eid 2026 release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/who-is-ashish-warang-remembering-the-marathi-actor-who-died-at-55-2782913-2025-09-06",
      "headline": "Who is Ashish Warang? Remembering the Marathi actor who died at 55Ashish Warang, a versatile actor known for his impactful supporting roles across Bollywood, Marathi and South Indian cinema, has died at 55. His memorable performances in films like 'Drishyam' and 'Sooryavanshi' will continue to be cherished by audiences and peers alike."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jonathan-bailey-announces-break-from-acting-2782902-2025-09-06",
      "headline": "Jonathan Bailey announces break from actingJonathan Bailey is taking a break from acting next year to focus on The Shameless Fund, an LGBTQ+ charity he founded. He was last seen in 'Jurassic World Rebirth'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/madharaasi-vs-ghaati-box-office-day-1-sivakarthikeyan-film-races-ahead-anushka-shetty-film-2782874-2025-09-06",
      "headline": "Madharaasi vs Ghaati box office Day 1: Sivakarthikeyan-Murugadoss film races aheadSivakarthikeyan's 'Madharaasi' has opened to a strong box office response, overshadowing Anushka Shetty's 'Ghaati' on its first day. Both films received mixed reviews. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/baaghi-4-vs-bengal-files-box-office-day-1-tiger-shroff-actioner-dominates-vivek-agnihotri-film-lags-2782858-2025-09-06",
      "headline": "Baaghi 4 vs Bengal Files box office Day 1: Tiger Shroff's actioner dominates'Baaghi 4' and 'The Bengal Files' clashed at the box office with contrasting opening performances. While Tiger Shroff's action-packed 'Baaghi 4' impressed with strong collections, Vivek Agnihotri's complex drama struggled to make an impact amid stiff competition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ahaan-panday-aneet-padda-celebrate-saiyaara-50-day-run-with-dreamy-pictures-2782848-2025-09-06",
      "headline": "Ahaan Panday-Aneet Padda celebrate Saiyaara's 50-day run with dreamy picturesMohit Suri's 'Saiyaara', starring debutants Ahaan Panday and Aneet Padda, has completed 50 days in theatres, crossing Rs 500 crore worldwide to become Indian cinema's highest-grossing love story."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kiku-sharda-shuts-down-rumours-of-rift-with-krushna-abhishek-says-bond-is-unbreakable-2782843-2025-09-06",
      "headline": "Kiku Sharda shuts down rumours of rift with Krushna Abhishek, says bond is unbreakableComedian Kiku Sharda has dismissed rumours of a fallout with co-star Krushna Abhishek, affirming his ongoing role in 'The Great Indian Kapil Show'. Fans can look forward to the remaining episodes on Netflix as the cast's strong camaraderie remains intact."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/reviews/story/bad-girl-review-varsha-bharath-anjali-sivaraman-coming-of-age-master-break-patriarchal-chains-2782729-2025-09-05",
      "headline": "Bad Girl review: A coming-of-age masterpiece about breaking patriarchal chainsRelease Date:Fri Sep 05, 2025Bad Girl movie review: Director Varsha Bharath's 'Bad Girl' is a fantastic coming-of-age film of a woman. This lovely gem of a film lays bare patriarchy and showcases how women are slowly breaking away from generational trauma. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-donald-trump-friends-india-us-relationship-thaw-amid-tariffs-trade-deal-2783022-2025-09-06",
      "headline": "India-US thaw incoming? Trump lowers offensive, PM 'deeply appreciates'Donald Trump appeared to break the ice amid the strain in India-US ties, harping on the strong personal bond between him and PM Modi. PM Modi was quick to respond. Is a thaw between India and the US incoming?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/deeply-appreciate-fully-reciprocate-trumps-sentiments-pm-after-us-presidents-always-be-friends-remark-2782859-2025-09-06",
      "headline": "Fully reciprocate his sentiments: PM as Trump dials down with 'friends' remarkThe Prime Minister's remarks come after Trump said he would 'always be friends' with Modi, in an apparent climbdown, a day after he asserted that the US had 'lost India to China'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-and-french-president-macron-exchange-views-on-efforts-to-end-ukraine-war-2783052-2025-09-06",
      "headline": "PM Modi, French President Macron discuss efforts to end Ukraine warOwing to his close ties with Russian President Vladimir Putin, European leaders are increasingly engaging with PM Modi regarding the war in Ukraine."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/6-killed-after-cargo-ropeway-at-shakti-peeth-collapses-in-gujarats-pavagadh-2783027-2025-09-06",
      "headline": "6 killed after wire of cargo ropeway snaps at Gujarat templeSix people, including workers and liftmen, died after a cargo ropeway crashed at Pavagadh's hill temple on Saturday. The accident occurred due to a rope break, and an investigation is underway."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-imported-insects-to-fight-foreign-pests-classical-biological-control-locusts-cassava-mealybug-2782880-2025-09-06",
      "headline": "When India imported insects to fight pestsWhat does a country do when pests end up flying across borders, stuck on ships or hidden in food consignments, threatening crops and native plants? Faced with such destruction, India has imported insects from the UK and Africa to fight the pest menace."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/khalistani-extremist-funding-canada-finance-report-2025-justin-trudeau-mark-carney-2782901-2025-09-06",
      "headline": "Khalistani terror groups operate, raise funds, Canada admits in new risk reportCanada has long ignored India's repeated concerns about Khalistani elements' anti-India activities on Canadian soil, an issue that has soured relations between the two countries."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/amity-university-law-student-lucknow-slapped-assaulted-classmates-viral-video-2782960-2025-09-06",
      "headline": "'Move hand from your face': Amity student slapped 26 times in viral videoThe video shows two people, including a woman, repeatedly raining blows on the law student of Lucknow's Amity University. The student was slapped as many as '25-30' times over 90 seconds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/donald-trump-why-pentagon-pizza-index-orders-tracked-amid-us-president-dead-buzz-dominos-papa-johns-viral-trend-tracker-2782030-2025-09-05",
      "headline": "How pizza deliveries signal US military, political emergencyEarlier this week, when speculation over Donald Trump's alleged death was swirling, the Pentagon Pizza Index surged by 800%. Pizza orders near the Pentagon—the headquarters of the US Defence Department—are considered a barometer, hinting at officials at work for hours, during a crunch situation. This was also the case in June when the US bombed Iran. Even Soviet spies kept an eye on pizza orders during the Cold War. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/typhoon-peipah-causes-floods-power-outages-and-transport-disruption-in-japan-2782992-2025-09-06",
      "headline": "Typhoon Peipah makes landfall twice in Japan; triggers flooding, power outageTyphoon Peipah, this year's 15th typhoon, made landfall twice in western Japan: first near Sukumo in Kochi Prefecture at approximately 1 am on Friday and again in northern Wakayama Prefecture around 9 am."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bulldozer-action-demolishes-illegal-animal-husbandry-lab-uttar-pradesh-shri-ramswaroop-memorial-university-2783048-2025-09-06",
      "headline": "Bulldozer action on UP University after land encroachment survey, protests The administration initiated the demolition in response to both the land encroachment findings and the student group's demands."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/kerala/story/bjp-kerala-president-rajeev-chandrasekhar-demands-withdrawal-fir-rss-flag-floral-carpet-2783013-2025-09-06",
      "headline": "RSS flag with 'Op Sindoor' written on floral carpet at Kerala temple sparks rowCalling the case against RSS and BJP workers over a floral carpet displaying the RSS flag \"shameful and seditious\", Kerala BJP chief Rajeev Chandrasekhar demanded its immediate withdrawal, saying it insulted both the armed forces and the victims of terrorism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/next-generation-gst-reform-and-relief-by-narendra-modi-government-2782929-2025-09-06",
      "headline": "Next-generation GST: Reform and relief by Narendra Modi governmentThe Modi government's GST rationalisation introduced a dual-rate structure, reduced taxes on essentials, healthcare, and agriculture, and simplified compliance, aiming to ease household budgets, boost consumption, and strengthen India's taxation system."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/photo/ganesh-visarjan-2025-mumbai-ganpati-bappa-immersion-farewell-india-celebration-photos-2783020-2025-09-06",
      "headline": "Ganesh Visarjan 2025: Devotees bid farewell to Bappa with grandeur across IndiaAs chants of Ganpati Bappa Morya echoed across the nation, devotees bid an emotional farewell to Lord Ganesha. The vibrant visarjan processions lit up streets with music, dance, and devotion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jammu-kashmir-waqf-board-case-against-hazratbal-shrine-plaque-vandals-2782740-2025-09-05",
      "headline": "Ashoka Emblem at J&K's Hazratbal shrine vandalised, Omar Abdullah defends itA political and religious controversy erupted over the engraving of the national emblem on the renovation plaque at Hazratbal Shrine in Jammu and Kashmir. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/sambhal-uttar-pradesh-government-bulldozer-action-land-reclamation-mla-nawab-iqbal-mahmood-2782984-2025-09-06",
      "headline": "Bulldozer action on Samajwadi MLA's orchard in Sambhal to reclaim government landThe orchard, spread over 123 bighas, is registered in the names of  Samajwadi Party MLA Nawab Iqbal Mahmood and his sons, Faiz and Suhail Iqbal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/indians-perform-ganpati-visarjan-rituals-in-london-viral-video-sparks-debate-2783017-2025-09-06",
      "headline": "Indians perform Ganpati Visarjan rituals in London. Viral video sparks debateA video of Indians performing Ganpati Visarjan rituals at a London water body has gone viral on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/nostalgia-save-theatres-bollywood-hollywood-bet-cinema-icons-meena-kumari-biopic-rocky-2782582-2025-09-06",
      "headline": "Can nostalgia save theatres? Bollywood-Hollywood bet on cinema icons and memoriesPop culture icons are the new flavour of the season in Indian cinema and Hollywood. Where is cinema headings with the announcement of Sourav Ganguly and Meena Kumari biopics, 'Rambo' origins story, 'I Play Rocky' and 'The Smashing Machine'? On Cinematic Saturday, we reflect on the future of storytelling as filmmakers recreate nostalgia to evoke audience emotions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-520-05-09-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/noida-man-held-for-hoax-bomb-threat-in-mumbai-ahead-of-anant-chaturdashi-last-day-ganesh-visarjan-2782852-2025-09-06",
      "headline": "Noida man arrested for Mumbai bomb threat claiming 14 Pak terrorists, 400 kg RDXThe police have arrested Ashwin Kumar Supra (50) from Noida for sending a WhatsApp message threatening serial blasts across Mumbai on Anant Chaturdashi. The sender alleged that 14 Pakistani terrorists had infiltrated the city and planned to detonate 400 kg of RDX, killing as many as \"one crore people.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/viral-video-us-man-dances-during-town-hall-meeting-as-a-sign-of-protest-2782951-2025-09-06",
      "headline": "US man dances during town hall meeting as a sign of protest. Video goes viralIn a video shared on X by Collin Rugg, Thilly dropped to the floor and break-danced in the middle of the meeting.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-carlos-alcaraz-grand-slam-history-us-open-final-open-era-djokovic-2782892-2025-09-06",
      "headline": "Sinner, Alcaraz reach US Open final, end Big Three's 23-year-old Slam streakThe Jannik Sinner-Carlos Alcaraz era in men's tennis has taken full flight after a sensational Grand Slam season in 2025. For the first time since 2003, a season has passed without Novak Djokovic, Roger Federer or Rafael Nadal featuring in a Grand Slam final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/food/story/indian-restaurants-turning-into-art-galleries-experiential-dining-2782910-2025-09-06",
      "headline": "Why Indian restaurants are now also turning into art galleriesArt today isn't confined to museums or galleries. With guests increasingly seeking unique experiences, several Indian restaurants are transforming their dining spaces into art galleries. Here's why it's a win-win for both the culinary and art worlds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/woman-accused-haryanvi-singer-uttam-kumar-rape-sets-herself-ablaze-outside-yogi-adityanath-home-2782993-2025-09-06",
      "headline": "Woman alleges rape by singer, sets herself ablaze outside Yogi Adityanath's homeThe woman had filed a complaint on June 24 at Shalimar Garden police station in Ghaziabad, accusing Uttar Kumar of sexual assault. She attempted self-immolation over alleged inaction by police in the case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tv-actor-ashish-kapoor-sent-to-14-day-judicial-custody-in-rape-case-2783005-2025-09-06",
      "headline": "TV actor Ashish Kapoor sent to 14-day judicial custody in rape caseA woman accused the Yeh Rishta-fame actor of sexually assaulting her inside a washroom during a house party in Delhi in the second week of August."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/india-vs-china-hockey-asia-cup-live-updates-super-4s-harmanpreet-singh-rajgir-2783060-2025-09-06",
      "headline": "India vs China, Hockey Asia Cup Live Score and Updates: Teams battle for spot in finalsIndia vs China, Hockey Asia Cup 2025 Live Updates: Table-toppers India take on the 2nd-placed China in the Super-4 stages of the tournament at Rajgir where a spot in the finals could be at stake. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-shivam-dube-gautam-gambhir-message-training-opportunity-2783049-2025-09-06",
      "headline": "Shivam Dube reveals Gautam Gambhir's inspirational message before Asia Cup 2025India commenced their Asia Cup 2025 preparations with an inspiring session led by coach Gautam Gambhir. The team aims to build on recent successes as they face tough group stage opponents in the UAE."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/devajit-saikia-on-india-vs-pakistan-asia-cup-2025-2783039-2025-09-06",
      "headline": "No government restrictions, India will play vs every team in Asia Cup: BCCIThe BCCI (Board of Control for Cricket in India) secretary Devajit Saika has said that the board is following the government's stance ahead of playing against Pakistan in the upcoming Asia Cup 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyer-appeals-for-donations-to-support-flood-hit-punjab-2783010-2025-09-06",
      "headline": "Shreyas Iyer appeals for donations to support flood-hit PunjabPunjab Kings (PBKS) captain and India batter Shreyas Iyer has appealed to the fans, asking for donations to provide relief to the victims of the flood-hit Punjab."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/daniel-ricciardo-retires-from-formula-one-joins-ford-racing-ambassador-2782998-2025-09-06",
      "headline": "Daniel Ricciardo confirms racing retirement, joins Ford as racing ambassadorDaniel Ricciardo has confirmed that his racing days are behind him. He however, has now taken a new ambassadorial role with Ford. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-to-get-new-president-on-september-28-as-elections-in-agm-in-mumbai-2782988-2025-09-06",
      "headline": "BCCI to get new president on September 28 as elections in AGM in MumbaiThe Board of Control for Cricket in India (BCCI) will elect a new president at its 94th Annual General Meeting (AGM), scheduled for 11:30 am on 28 September 2025 at the board's headquarters in Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyer-named-india-a-captain-for-australia-a-tour-2782973-2025-09-06",
      "headline": "After Asia Cup snub, Shreyas Iyer named India A captain for Australia A tourShreyas Iyer has been named the India A captain for the upcoming two multi-day matches against Australia A, beginning on September 16. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-team-new-jersey-dream11-sponsor-2782967-2025-09-06",
      "headline": "Looks much better: Fans give thumbs to India training kit minus Dream11 logoThe Indian Cricket Board is without a lead jersey sponsor in the Asia Cup. As the photos of new 'sponsorless' jersey emerged, the fans gave it a thumbs up for aesthetics.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-urges-fans-to-stop-mumbai-cha-raja-chants-at-ganesh-temple-2782948-2025-09-06",
      "headline": "Watch: Rohit Sharma urges fans to stop 'Mumbai cha Raja' chants at Ganesh templeIndia ODI captain Rohit Sharma sought blessings at Lord Ganesh temple before his international return. He urged his fans to stop chanting his name out of reverence for the almighty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/alyssa-healy-on-womens-world-cup-2025-india-vs-australia-2782936-2025-09-06",
      "headline": "Australia ready for challenging Indian conditions in Women's World Cup: HealyAustralia women's cricket team captain Alyssa Healy expresses confidence ahead of the 2025 Women's World Cup in India. The defending champions are focused on overcoming local challenges and achieving back-to-back titles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-to-get-new-president-on-september-28-as-elections-in-agm-in-mumbai-2782988-2025-09-06",
      "headline": "BCCI to get new president on September 28 as elections in AGM in MumbaiThe Board of Control for Cricket in India (BCCI) will elect a new president at its 94th Annual General Meeting (AGM), scheduled for 11:30 am on 28 September 2025 at the board's headquarters in Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyer-named-india-a-captain-for-australia-a-tour-2782973-2025-09-06",
      "headline": "After Asia Cup snub, Shreyas Iyer named India A captain for Australia A tourShreyas Iyer has been named the India A captain for the upcoming two multi-day matches against Australia A, beginning on September 16. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-team-new-jersey-dream11-sponsor-2782967-2025-09-06",
      "headline": "Looks much better: Fans give thumbs to India training kit minus Dream11 logoThe Indian Cricket Board is without a lead jersey sponsor in the Asia Cup. As the photos of new 'sponsorless' jersey emerged, the fans gave it a thumbs up for aesthetics.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-urges-fans-to-stop-mumbai-cha-raja-chants-at-ganesh-temple-2782948-2025-09-06",
      "headline": "Watch: Rohit Sharma urges fans to stop 'Mumbai cha Raja' chants at Ganesh templeIndia ODI captain Rohit Sharma sought blessings at Lord Ganesh temple before his international return. He urged his fans to stop chanting his name out of reverence for the almighty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/alyssa-healy-on-womens-world-cup-2025-india-vs-australia-2782936-2025-09-06",
      "headline": "Australia ready for challenging Indian conditions in Women's World Cup: HealyAustralia women's cricket team captain Alyssa Healy expresses confidence ahead of the 2025 Women's World Cup in India. The defending champions are focused on overcoming local challenges and achieving back-to-back titles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-mitchell-starc-plan-t20i-retirement-test-cricket-priority-2782918-2025-09-06",
      "headline": "Test cricket will always remain my priority: Starc after T20I retirementAustralia pacer Mitchell Starc has stated that he is willing to push his body to its limits to continue playing Test cricket. Starc recently retired from T20Is to concentrate on the ODI World Cup and his Test career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-preview-batting-shubman-gill-suryakumar-yadav-jasprit-bumrah-2782724-2025-09-06",
      "headline": "Asia Cup: India look to continue fearless mode as road to T20 World Cup beginsIndia enter the Asia Cup 2025 as defending champions, combining youth and experience. With Shubman Gill back in the squad, Jasprit Bumrah's expertise, and Arshdeep Singh's rise, the Men in Blue aim to fine-tune a team for the next era of T20 cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-carlos-alcaraz-grand-slam-history-us-open-final-open-era-djokovic-2782892-2025-09-06",
      "headline": "Sinner, Alcaraz reach US Open final, end Big Three's 23-year-old Slam streakThe Jannik Sinner-Carlos Alcaraz era in men's tennis has taken full flight after a sensational Grand Slam season in 2025. For the first time since 2003, a season has passed without Novak Djokovic, Roger Federer or Rafael Nadal featuring in a Grand Slam final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-us-open-final-sinner-federer-advice-2782873-2025-09-06",
      "headline": "Carlos Alcaraz shares Roger Federer's advice ahead of US Open finalCarlos Alcaraz stormed into the final of the US Open after beating Novak Djokovic. After setting up the final against Jannik Sinner, Alcaraz recounted Roger Federer's advice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/ioc-creates-panel-to-review-female-issues-in-olympic-sports-protects-experts-identity-2782862-2025-09-06",
      "headline": "IOC creates panel to review female issues in Olympic sportsThe IOC has formed a confidential female protection panel ahead of the 2028 Los Angeles Olympics. This move aims to address gender issues while maintaining the integrity of the group's work amid ongoing sports controversies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-final-sinner-vs-alcaraz-battle-for-world-no-1-2782849-2025-09-06",
      "headline": "Sinner vs Alcaraz: How US Open 2025 final will settle race for World No. 1The US Open final between Jannik Sinner and Carlos Alcaraz will decide not only the season's last Grand Slam title but also the battle for World No. 1 in the PIF ATP Rankings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-sinner-semifinal-match-report-2782846-2025-09-06",
      "headline": "Jannik Sinner sets up grand Sincaraz final after 4-set battle vs Auger AliassimeWorld No.1 Jannik Sinner set up a grand US Open final against Carlos Alcaraz. On Saturday, Sinner beat Canada's Felix Auger Aliassime with mechanical precision in a 4-set battle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/fide-grand-swiss-d-gukesh-draw-14-year-old-erdogmus-vaishali-joint-lead-women-section-2782826-2025-09-06",
      "headline": "FIDE Grand Swiss: Gukesh held by 14-year-old Erdogmus; Vaishali in joint leadWorld Champion D. Gukesh was held to a draw by the 14-year-old Turkish prodigy Yagiz Khan Erdogmus while Vaishali impressed with consecutive wins, strengthening her lead in the women's section."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/ioc-creates-panel-to-review-female-issues-in-olympic-sports-protects-experts-identity-2782862-2025-09-06",
      "headline": "IOC creates panel to review female issues in Olympic sportsThe IOC has formed a confidential female protection panel ahead of the 2028 Los Angeles Olympics. This move aims to address gender issues while maintaining the integrity of the group's work amid ongoing sports controversies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-final-sinner-vs-alcaraz-battle-for-world-no-1-2782849-2025-09-06",
      "headline": "Sinner vs Alcaraz: How US Open 2025 final will settle race for World No. 1The US Open final between Jannik Sinner and Carlos Alcaraz will decide not only the season's last Grand Slam title but also the battle for World No. 1 in the PIF ATP Rankings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-sinner-semifinal-match-report-2782846-2025-09-06",
      "headline": "Jannik Sinner sets up grand Sincaraz final after 4-set battle vs Auger AliassimeWorld No.1 Jannik Sinner set up a grand US Open final against Carlos Alcaraz. On Saturday, Sinner beat Canada's Felix Auger Aliassime with mechanical precision in a 4-set battle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/fide-grand-swiss-d-gukesh-draw-14-year-old-erdogmus-vaishali-joint-lead-women-section-2782826-2025-09-06",
      "headline": "FIDE Grand Swiss: Gukesh held by 14-year-old Erdogmus; Vaishali in joint leadWorld Champion D. Gukesh was held to a draw by the 14-year-old Turkish prodigy Yagiz Khan Erdogmus while Vaishali impressed with consecutive wins, strengthening her lead in the women's section."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/luis-suarez-spitting-ban-inter-miami-2782825-2025-09-06",
      "headline": "Luis Suarez banned for 6 games after spitting saga in Leagues Cup finalInter Miami's Luis Suarez has been handed a 6-game ban for his antics in the Leagues Cup final against Seattle Sounders. Suarez had spit on the face of one of the opposition staff."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/rajgir-sports-complex-bihar-sporting-revival-hockey-asia-cup-2782820-2025-09-06",
      "headline": "Inside Rajgir sports complex: Cradle of Bihar's sporting culture revival, dreamsWith world-class facilities and an international cricket stadium on the way, the Rajgir Sports Complex is leading a revolution in Bihar by reviving the state's sporting culture and laying out new dreams. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-tim-henman-novak-djokovic-retirement-prediction-alcaraz-defeat-2782822-2025-09-06",
      "headline": "Tim Henman makes Novak Djokovic retirement prediction after US Open lossFormer British No.1 Tim Henman has tipped Novak Djokovic to make one final push at the Australian Open before considering retirement, after the Serbian great's US Open exit at the hands of Carlos Alcaraz."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/aryna-sabalenka-vs-amanda-anisimova-2025-us-open-womens-final-preview-2782811-2025-09-06",
      "headline": "Sabalenka vs Anisimova Live Streaming: All you need to know about finalUS Open 2025: World No.1 Aryna Sabalenka and Amanda Anisimova of the United States will be up against each other in the women's singles final at Flushing Meadows on Saturday, September 6."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovc-us-open-defeat-carlos-alcaraz-jannik-sinner-analysis-2782813-2025-09-06",
      "headline": "Once ageless, now 38, Djokovic just can't stop the Sincaraz partyAt 38, Novak Djokovic still chases a record-breaking 25th Grand Slam, but the Sincaraz party shows no mercy. Even the GOAT may need something extraordinary to crash it. And whether he can is anyone's guess as the young guns keep raising the bar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-targets-2026-grand-slam-season-after-us-open-2025-exit-2782809-2025-09-06",
      "headline": "Djokovic quashes retirement buzz after US Open exit: Want to play majors in 2026Novak Djokovic confirmed he is not retiring after his US Open 2025 loss to Carlos Alcaraz. He plans to compete in the 2026 Grand Slam season despite physical challenges in longer matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-defeats-novak-djokovic-us-open-2025-semifinal-2782805-2025-09-06",
      "headline": "Novak Djokovic no match for ruthless Carlos Alcaraz in one-sided semisCarlos Alcaraz defeated Novak Djokovic to reach the US Open 2025 men's singles final. Alcaraz took two hours and 23 minutes to register a 6-4, 7-6 (4), 6-2 victory at Arthur Ashe Stadium.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/luis-enrique-collarbone-fracture-surgery-psg-coach-cycling-accident-2782803-2025-09-06",
      "headline": "PSG coach Luis Enrique sidelined after cycling accident and surgery setbackParis Saint-Germain boss Luis Enrique faces surgery after a cycling accident left him with a fractured collarbone. The setback comes as PSG chase another strong season in Ligue 1 and Europe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/afghanistan-win-uae-sharjah-tri-series-close-finish-2782794-2025-09-06",
      "headline": "Afghanistan survive late UAE charge to secure narrow win in tri-seriesAfghanistan secured a thrilling 4-run victory over UAE in the Sharjah tri-series, giving them more momentum before the grand finale against Pakistan on September 7."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-india-preparations-training-dubai-jasprit-bumrah-hardik-pandya-sanju-samson-2782792-2025-09-06",
      "headline": "Asia Cup: India begin training in Dubai, spotlight on Jasprit Bumrah and Sanju SamsonAsia Cup 2025: India completed their first full practice session ahead of the Asia Cup, which starts on September 10. The team focusses on key players' fitness and acclimatisation ahead of crucial matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/gabriela-dabrowski-erin-routliffe-katerina-siniakova-taylor-townsend-us-open-doubles-2782791-2025-09-06",
      "headline": "Dabrowski, Routliffe stun Siniakova, Townsend to win women's doubles titleGabriela Dabrowski and Erin Routliffe triumphed in the 2025 US Open women's doubles final. Dabrowski's victory is especially poignant as it follows her breast cancer treatment, while Taylor Townsend faced heartbreak in both singles and doubles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2025-semi-final-live-updates-carlos-alcaraz-novak-djokovic-new-york-2782727-2025-09-05",
      "headline": "US Open Highlights: Sinner beats Aliassime, sets up final vs Carlos AlcarazUS Open 2025 Semifinal Highlights: World No1. Jannik Sinner sets up the grand final against Carlos Alcaraz. He beats Canada's Felix Auger Aliassime in a 4-set battle that lasted for nearly three hours and thirty minutes."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}