{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-food-delivery-service-share-price-all-time-high-price-target-ubs-2598355-2024-09-12",
      "headline": "Zomato shares jump 4% to hit all-time high. Will it gain further? Zomato shares hit a record high of Rs 283.50 on the Bombay Stock Exchange. Can the stock continue its upward streak? Read on to find out.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ayushman-bharat-health-insurance-to-cover-senior-citizens-above-70-all-you-need-to-know-details-2598354-2024-09-12",
      "headline": "Ayushman Bharat to cover senior citizens above 70: All you need to knowThe expansion of the Ayushman Bharat scheme aims to address the healthcare needs of the elderly, who often face higher medical expenses as they age."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-in-green-as-fed-rate-cut-hopes-grow-after-us-inflation-data-2598327-2024-09-12",
      "headline": "Sensex, Nifty gain as Fed rate cut hopes grow after US inflation dataThe S&P BSE Sensex added230.45 points to 81,753.61, while the NSE Nifty50 gained 97.40 points to 25,015.85 "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-ipo-allotment-online-guide-steps-to-check-status-gmp-2598211-2024-09-12",
      "headline": "Bajaj Housing Finance IPO allotment: Step-by-step guide to check status Bajaj Housing Finance IPO allotment: Investors who applied for the IPO can check their allotment status online through the BSE portal or on Kfin Technologies Limited, the registrar for the issue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-ipo-subscription-details-sees-rs-32-lakh-crore-bids-gmp-crosses-100-percent-2598016-2024-09-11",
      "headline": "Bajaj Housing Finance IPO sees Rs 3.2 lakh crore bids, GMP crosses 100%Bajaj Housing Finance IPO: Before the public issue, Bajaj Housing Finance managed to raise Rs 1,758 crore from 104 anchor investors. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-toll-collection-explained-how-gnss-will-change-your-highway-experience-2597975-2024-09-11",
      "headline": "New toll collection explained: How GNSS will change your highway experienceUnder the new rules, the GNSS will automatically grant exemptions for travel up to 20 km per day, charging toll fees only for the distance travelled beyond this limit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/thematic-mutual-funds-explained-should-you-invest-all-you-need-to-know-2597951-2024-09-11",
      "headline": "Thematic mutual funds explained: Are they the right bet for investors?Thematic funds have outpaced traditional categories in popularity. But what are they, and why are AMCs launching so many? Here's what you need to know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mutual-funds-sahi-hai-amfi-data-why-so-many-indians-are-betting-big-on-sips-2597876-2024-09-11",
      "headline": "Mutual funds sahi hai? Why so many Indians are betting big on SIPsIt took 50 years to build Rs 10 lakh crore in AUM from 1963 to 2013, but in just six more years, it reached Rs 23 lakh crore by 2019. As of August 2024, the AUM has tripled to Rs 66.70 lakh crore, demonstrating strong investor confidence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-nifty-fall-tata-motors-share-price-2597865-2024-09-11",
      "headline": "Sensex dips 400 points, Nifty ends below 25,000; Tata Motors tanks 6%The S&P BSE Sensex fell 398.13 points to 81,523.16 at the closing bell, while the NSE Nifty50 declined 122.65 points to settle at 24,918.45."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/samsung-electronics-global-job-cuts-layoffs-india-employees-2597858-2024-09-11",
      "headline": "Samsung plans global job cuts up to 30%, 1,000 layoffs likely in India: Report In India, Samsung has already begun offering severance packages to mid-level employees, with up to 1,000 jobs expected to be affected."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-motors-maruti-mm-mahindra-why-auto-stocks-are-in-red-today-ubs-2597849-2024-09-11",
      "headline": "Tata Motors, Maruti, M&M: Why auto stocks are in red today Among the major components of the BSE Auto index, Tata Motors Ltd experienced the largest drop, falling by 5.60%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/semicon-2024-5-things-pm-modi-shared-on-india-semiconductor-ambitions-chips-2597811-2024-09-11",
      "headline": "Semicon 2024: 5 things PM Modi shared on India's semiconductor ambitionsSemicon India 2024: PM Modi shared a plan to create a workforce of 85,000 skilled professionals, including technicians, engineers, and R&D experts, who will be industry-ready in the coming years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ubs-view-tata-motors-share-price-sell-rating-20-percent-downside-risk-investors-buy-or-sell-stock-2597798-2024-09-11",
      "headline": "UBS sees 20% downside potential in Tata Motors stock. Should you hold or sell? UBS, which holds a \"sell\" rating on the stock, cited concerns that moderating demand, rising discounts, and the absence of new internal combustion engine and hybrid launches could severely impact JLR's financial performance by fiscal 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hindenburg-research-questions-madhabi-puri-buchs-silence-on-congress-allegations-2597756-2024-09-11",
      "headline": "Hindenburg questions Sebi chief Madhabi Buch's silence on Congress's new chargeHindenburg Research's statement comes after the Congress party raised fresh allegations about Buch's links to listed companies regulated by Sebi. The short-seller also said that Madhabi Puri Buch has remained silent on the accusations for weeks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/suzlon-energy-share-price-upper-circuit-5-percent-up-more-gains-left-2597705-2024-09-11",
      "headline": "Suzlon Energy hits 5% upper circuit for 2nd straight day. More upside left?Suzlon Energy has seen its stock value more than triple in the last year, gaining 223% over the past 12 months and 102% in 2024 alone.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/semicon-india-2024-pm-modi-you-can-bet-on-india-when-chips-are-down-2597684-2024-09-11",
      "headline": "You can bet on India when chips are down: PM Modi at Semicon India 2024Semicon India 2024 is a three-day event aimed at showcasing India's semiconductor strategy and policies, with the goal of establishing the country as a global hub for semiconductor manufacturing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-shares-hit-52-week-high-5-percent-rise-early-trade-more-upside-expert-view-2597669-2024-09-11",
      "headline": "Zomato shares hit 52-week high. Is there more upside? Global brokerage firms like Jefferies and JP Morgan have also shown optimism, maintaining a 'buy' recommendation. Jefferies set a target price of Rs 335 for Zomato, reinforcing the positive sentiment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-motors-share-price-slumps-6-percent-today-ubs-sell-rating-2597653-2024-09-11",
      "headline": "Explained: Why Tata Motors shares slumped nearly 6% today At 11:30 am, Tata Motors shares were trading 5.57% lower at Rs 977.80 on the Bombay Stock Exchange."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-gain-in-volatile-trade-tata-motors-plunges-5-zomato-up-3-2597639-2024-09-11",
      "headline": "Sensex, Nifty gain in volatile trade, Tata Motors plunges 5%, Zomato up 3%The S&P BSE was up 106.96 points at 82,030.60, while the NSE Nifty50 rose 32.85 points to 25,073.95 at 11:20 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/samsung-india-layoff-job-cut-executive-roles-over-200-business-slowdown-report-2597628-2024-09-11",
      "headline": "Samsung India layoffs: Tech giant set to cut 200 jobs, says reportSamsung layoffs: The job cuts will affect various departments, including mobile phones, consumer electronics, home appliances, and support functions. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/story/jammu-kashmir-assembly-election-lt-governor-pakistan-conspiracy-poll-issues-2598320-2024-09-12",
      "headline": "Do a secret ballot, I will resign if...: Manoj Sinha on Rahul Gandhi's 'king' jabSpeaking at Aaj Tak's 'Panchayat', Manoj Sinha said a secret ballot could be conducted to gauge the public sentiment following the abrogation of Article 370 in 2019."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/story/iltija-mufti-peoples-democratic-party-jammu-kashmir-assembly-election-2598331-2024-09-12",
      "headline": "Don't want to be known just as Mehbooba Mufti's daughter: Iltija MuftiIltija Mufti, 37, will contest the upcoming Assembly elections in Jammu and Kashmir, as a People's Democratic Party's (PDP) candidate from Bijbehara, which has proved to be a stronghold for the Mufti family in the past."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ayushman-bharat-health-insurance-to-cover-senior-citizens-above-70-all-you-need-to-know-details-2598354-2024-09-12",
      "headline": "Ayushman Bharat to cover senior citizens above 70: All you need to knowThe expansion of the Ayushman Bharat scheme aims to address the healthcare needs of the elderly, who often face higher medical expenses as they age."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/story/malaika-arora-father-anil-mehta-death-postmortem-report-autopsy-cause-of-death-multiple-injuries-2598341-2024-09-12",
      "headline": "Autopsy reveals actor Malaika Arora's father died of multiple injuries: Police sourcesSpeaking to India Today TV, the police sources, citing the autopsy report, said that the father of actor-model Malaika Arora died due to multiple injuries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/video/kamala-harris-donald-trump-shake-hands-at-911-memorial-after-debate-2598284-2024-09-12",
      "headline": "Watch: Kamala Harris, Donald Trump shake hands again at 9/11 memorialUS Vice President Kamala Harris and Republican candidate Donald Trump shook hands at the 9/11 memorial in New York after a fiery second presidential debate on Wednesday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/mandya-communal-clashes-ganesh-procession-stone-pelting-several-arrested-2598303-2024-09-12",
      "headline": "52 detained after communal clashes in Mandya during Ganpati processionThe Karnataka Police detained 52 people for questioning in connection with the communal clashes that broke out in the state's Mandya district during a Ganpati procession."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/video/watch-pm-attends-ganpati-puja-celebrations-at-chief-justice-chandrachuds-home-2598144-2024-09-11",
      "headline": "Watch: PM attends Ganpati Puja celebrations at Chief Justice Chandrachud's homePrime Minister Narendra Modi took part in the Ganesh Puja celebrations held at the Delhi residence of Chief Justice of India, DY Chandrachud. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/army-officers-thrashed-robbed-woman-gang-raped-mhow-indore-army-war-college-2598295-2024-09-12",
      "headline": "Army officers thrashed, woman friend gang-raped in Madhya PradeshThe incident happened when the two Major rank officers, who were undergoing training at Army War College in Madhya Pradesh's Mhow, were out on a picnic with their two female friends on September 11."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/singer-jon-bon-jovi-talks-off-woman-from-jumping-off-a-bridge-2598287-2024-09-12",
      "headline": "Singer Jon Bon Jovi stops woman from jumping off a bridge Singer Jon Bon Jovi and a video assistant saved a woman on a Nashville bridge. During a music video shoot, they persuaded her to return to safety and comforted her."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/chandigarh/story/chandigarh-news-explosion-grenade-blast-police-probe-cctv-footage-video-khalistani-terrorist-2598229-2024-09-12",
      "headline": "Grenade blast at ex-cop's house in Chandigarh, 1 arrested, 2 suspects on the runChandigarh Police has announced a reward of Rs 2 lakhs for information leading to the arrest of two other suspects in connection to the case. One person has been arrested and a probe is currently underway."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-ncr-monsoon-rain-heavy-rain-alert-imd-forecasts-noida-ghaziabad-gurugram-2598337-2024-09-12",
      "headline": "Rain lashes parts of Delhi-NCR, more showers predicted over weekendResidents in Delhi and the National Capital Region (NCR) woke up to light to moderate rain on Thursday morning, with thick clouds and downpour reducing visibility in certain areas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/elon-musk-creepy-taylor-swift-comment-exposes-his-hypocrisy-opinion-2597954-2024-09-11",
      "headline": "Elon Musk's creepy Taylor Swift comment exposes his hypocrisyElon Musk, you are a tech mogul. Not some man lurking in the YouTube comments section."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/polaris-dawn-first-private-spacewalk-risks-spacex-jared-isaacman-elon-musk-2598363-2024-09-12",
      "headline": "World's first private spacewalk today: The risks are too highThe spacewalk, scheduled for the third day of the five-day mission, will involve Isaacman and mission specialist Sarah Gillis exiting the Crew Dragon capsule."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/international-shows/story/vir-das-first-indian-to-host-international-emmy-awards-2024-2598145-2024-09-11",
      "headline": "Vir Das becomes 1st Indian to host International Emmy Awards 2024Stand-up comedian and actor Vir Das, who won his first International Emmy last year, will be returning to the Emmys stage as the host of International Emmy Awards 2024. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/jd-vance-taylor-swift-kamala-harris-disconnected-billionaire-us-presidential-elections-2598275-2024-09-12",
      "headline": "JD Vance jabs Taylor Swift for backing Kamala Harris: Disconnected billionaireJD Vance's statement came a day after pop star Taylor Swift said she would be voting for Kamala Harris in the US presidential election in November. Swift called Harris a \"warrior\" shortly after the latter's debate with Donald Trump."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/enforcement-directorate-raid-properties-ex-rg-kar-principal-sandip-ghosh-financial-fraud-2598283-2024-09-12",
      "headline": "ED raids properties of ex-RG Kar principal in Kolkata in financial fraud caseThe ED is conducting searches at two flats belonging to Sandip Ghosh, an office of a medical supplier and the residence of a vendor in Kolkata. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/telangana/video/female-doctors-assault-caught-on-camera-at-gandhi-hospital-in-hyderabad-2598270-2024-09-12",
      "headline": "Video: Patient's relative attacks woman doctor, grabs her hand, pulls apronIn a violent attack on a female junior doctor at Gandhi Hospital in Hyderabad, a patient's relative grabbed the doctor's hand and pulled her apron."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/how-accurate-are-your-wearables-2597626-2024-09-12",
      "headline": "How accurate are your wearables? Today, wearables or smartwatches have become common and are no longer limited to athletes, but experts and studies suggest they are not always accurate."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/story/malaika-arora-father-anil-mehta-final-words-suicide-mumbai-police-probe-2598230-2024-09-12",
      "headline": "Anil Mehta's last words to daughter Malaika before his death: I'm sick and tiredAnil Mehta, 65, died on Wednesday morning by jumping from the sixth-floor balcony of his residence in Bandra. Mehta's wife, Joyce Polycarp, was in their flat at Ayesha Manor in Bandra when the incident took place."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bengal-government-rejects-protesting-doctors-demands-talks-mamata-banerjee-end-impasse-2598307-2024-09-12",
      "headline": "Bengal government rejects doctors' demands for talks with Mamata Banerjee In a statement on Wednesday night, the state's Health Minister Chandrima Bhattacharya said the government remained open to discussion with the doctors, but also suggested that \"political forces\" might be influencing the agitations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/kaun-banega-crorepati-16-amitabh-bachchan-contestant-tea-date-sakshi-panwar-2598300-2024-09-12",
      "headline": "KBC 16: Amitabh Bachchan asks contestant out on a tea dateIn the latest episode of Kaun Banega Crorepati 16, host Amitabh Bachchan expressed his wish to take the contestant on a tea date. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/kerala/story/kerala-woman-loses-fiance-in-car-accident-wayanad-landslide-2598240-2024-09-12",
      "headline": "Woman whose family was killed in Wayanad landslide loses fiance in car accidentA spokesperson from Dr Moopen Medical College, where Jensen had been admitted, confirmed that he died at 8:50 pm, following a critical struggle with multiple injuries sustained in the accident. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-road-accident-most-road-accidents-in-delhi-occur-at-night-50-victims-are-pedestrians-2598273-2024-09-12",
      "headline": "1,571 Delhi people killed in road crashes in 2022, most occurred at night: ReportAccording to a report by the Delhi government, Fifty per cent of the road crash victims in 2022 were pedestrians while 45 per cent of the victims were two or three-wheeler drivers and passengers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/first-presidential-debate-who-won-democrat-kamala-harris-republican-donald-trump-abc-news-philadelphia-pennsylvania-2597966-2024-09-11",
      "headline": "Kamala Harris vs Donald Trump: Who won presidential debate? What US media saidThe first presidential debate between Kamala Harris and Donald Trump was held on Tuesday, with Harris widely seen as the winner by US media outlets. Media analysis highlights Harris's strong performance, with many outlets noting that she effectively baited Trump and presented a clear and crisp message, while Trump appeared angry and defensive."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/arbaaz-khan-sshura-khan-to-arjun-kapoor-celebrities-attend-malaika-aroras-father-anil-mehtas-funeral-2598366-2024-09-12",
      "headline": "Arbaaz-Sshura to Arjun Kapoor, celebs at Malaika Arora's father's funeral Arbaaz Khan, Arjun Kapoor, Saif Ali Khan, and others were seen arriving at the crematorium on September 12 to attend Malaika Arora's father, Anil Mehta's funeral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/malaika-arora-father-funeral-mother-joyce-polycarp-son-arhaan-arjun-kapoor-2598351-2024-09-12",
      "headline": "Malaika Arora leaves for father's funeral with mother Joyce Polycarp, son ArhaanMalaika Arora along with mother Joyce Polycarp and son Arhaan left her parent's house for the funeral of her father, Anil Mehta. Arjun Kapoor also reached the crematorium for the funeral. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/story/malaika-arora-father-anil-mehta-death-postmortem-report-autopsy-cause-of-death-multiple-injuries-2598341-2024-09-12",
      "headline": "Autopsy reveals actor Malaika Arora's father died of multiple injuries: Police sourcesSpeaking to India Today TV, the police sources, citing the autopsy report, said that the father of actor-model Malaika Arora died due to multiple injuries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/2024-mtv-vmas-blackpinks-lisa-seventeen-shine-taylor-swift-takes-top-honours-2598333-2024-09-12",
      "headline": "2024 MTV VMAs: BLACKPINK's Lisa, SEVENTEEN shine, Taylor Swift takes top honoursThe 2024 MTV Video Music Awards showcased a night of remarkable musical talent with Taylor Swift, BLACKPINK's Lisa, and SEVENTEEN emerging as major winners. The event, held on September 11, celebrated the global influence of artists, particularly highlighting the dominance of K-pop."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kohlis-captaincy-played-big-role-in-indian-crickets-turnaround-ricky-ponting-2598367-2024-09-12",
      "headline": "Kohli's captaincy played big role in Indian cricket's turnaround: Ricky PontingRicky Ponting praised Virat Kohli for revolutionizing Indian Test cricket, emphasizing his crucial role in transforming the team's mindset and leadership. Kohli's tenure as captain from 2014 to 2022 led India to notable overseas victories, including a historic series win in Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/18-year-old-caity-becomes-youngest-womens-world-champ-beats-paris-olympic-winner-2598348-2024-09-12",
      "headline": "18-year-old Caity becomes youngest women's world champ in surfingCaity Simmers, just 18 years old, made history as the youngest women's world surfing champion after defeating Olympic gold medallist Caroline Marks at the 2024 World Surf League Finals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-unstoppable-carlos-alcaraz-rivalry-toni-nadal-comparisons-us-open-2598332-2024-09-12",
      "headline": "Unstoppable Sinner will make things difficult for Alcaraz: Toni NadalToni Nadal praised World No. 1 Jannik Sinner as \"practically unstoppable\" after his US Open win but warned that Carlos Alcaraz might struggle to match Sinner's rising dominance, particularly on the mental front."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-shubman-gill-training-hard-in-gym-ahead-of-ind-vs-ban-test-series-2598322-2024-09-12",
      "headline": "Watch: Shubman Gill training hard in gym ahead of IND vs BAN Test seriesShubman Gill was gearing up for the upcoming home Test season as he sweated it out in the gym. He will feature in India's squad for the 2-match Test series vs Bangladesh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-test-recalling-debut-dhaka-naimur-rahman-durjoy-sourav-ganguly-2598316-2024-09-12",
      "headline": "Bangladesh makes Test debut vs India: Dhaka witnesses historyIND vs BAN: Bangladesh made their Test debut back in 2000 under Naimur Rahman Durjoy and lost to India by nine wickets at the Bangabandhu Stadium in Dhaka."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/vinicius-jr-brazil-vs-paraguay-defeat-apology-fans-real-madrid-comparisons-2598311-2024-09-12",
      "headline": "Vinicus apologises for Brazil defeat, addresses Real Madrid comparisons Vinicius Junior apologized to fans after Brazil's defeat to Paraguay, acknowledging their poor form in the World Cup Qualifiers. He promised to improve, facing pressure to lead Brazil back to success in upcoming matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-begins-hunt-of-glenn-mcgrath-nathan-lyons-records-in-bangladesh-tests-2598306-2024-09-12",
      "headline": "R Ashwin begins hunt of Glenn McGrath, Nathan Lyon's records in Bangladesh TestsLegendary India spinner R Ashwin will resume his international season with the Test series against Bangladesh. Ashwin, who has 516 wickets to his name has been the standout bowler at home in recent years.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-david-ferrer-gold-on-tennis-court-watch-davis-cup-warm-up-session-2598304-2024-09-12",
      "headline": "Watch: Carlos Alcaraz tries his hand at golf on tennis court with David FerrerCarlos Alcaraz and David Ferrer brought laughter to the Davis Cup warm-up, turning a tennis court into a golf course. Despite recent setbacks, Alcaraz's playful moment hints at a hopeful return to form in 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/davis-cup-2024-final-carlos-alcaraz-helps-spain-secure-their-opening-match-win-2598301-2024-09-12",
      "headline": "Davis Cup 2024 final: Carlos Alcaraz helps Spain secure their opening match winAlcaraz's return to Davis Cup action ended unexpectedly, as his opponent Machac retired due to cramps. The Spaniard showed his class with a strong second-set comeback and a heart-warming display of sportsmanship, helping Spain secure a 3-0 win over the Czech Republic in their Group B clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ricky-ponting-jak-fraser-mcgurk-rough-diamond-australia-all-format-player-2598290-2024-09-12",
      "headline": "Ponting praises 'rough diamond' Fraser McGurk: Can be an all-format playerRicky Ponting has hailed young Jake Fraser-McGurk as a future all-format star for Australia but cautioned that the 22-year-old must refine his aggressive style to fulfill his potential as a key player for Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-late-season-slump-2024-sports-psychologist-us-open-2596293-2024-09-12",
      "headline": "Is Carlos Alcaraz's second-half slump in 2024 a cause for concern?Carlos Alcaraz won two Grand Slam titles in 2024, taking his tally to four. The 21-year-old, however, suffered shock exits in the US Open and Cincinnati Masters. Is the Spaniard's late-season slump a cause for concern?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-begins-hunt-of-glenn-mcgrath-nathan-lyons-records-in-bangladesh-tests-2598306-2024-09-12",
      "headline": "R Ashwin begins hunt of Glenn McGrath, Nathan Lyon's records in Bangladesh TestsLegendary India spinner R Ashwin will resume his international season with the Test series against Bangladesh. Ashwin, who has 516 wickets to his name has been the standout bowler at home in recent years.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-david-ferrer-gold-on-tennis-court-watch-davis-cup-warm-up-session-2598304-2024-09-12",
      "headline": "Watch: Carlos Alcaraz tries his hand at golf on tennis court with David FerrerCarlos Alcaraz and David Ferrer brought laughter to the Davis Cup warm-up, turning a tennis court into a golf course. Despite recent setbacks, Alcaraz's playful moment hints at a hopeful return to form in 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/davis-cup-2024-final-carlos-alcaraz-helps-spain-secure-their-opening-match-win-2598301-2024-09-12",
      "headline": "Davis Cup 2024 final: Carlos Alcaraz helps Spain secure their opening match winAlcaraz's return to Davis Cup action ended unexpectedly, as his opponent Machac retired due to cramps. The Spaniard showed his class with a strong second-set comeback and a heart-warming display of sportsmanship, helping Spain secure a 3-0 win over the Czech Republic in their Group B clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ricky-ponting-jak-fraser-mcgurk-rough-diamond-australia-all-format-player-2598290-2024-09-12",
      "headline": "Ponting praises 'rough diamond' Fraser McGurk: Can be an all-format playerRicky Ponting has hailed young Jake Fraser-McGurk as a future all-format star for Australia but cautioned that the 22-year-old must refine his aggressive style to fulfill his potential as a key player for Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-late-season-slump-2024-sports-psychologist-us-open-2596293-2024-09-12",
      "headline": "Is Carlos Alcaraz's second-half slump in 2024 a cause for concern?Carlos Alcaraz won two Grand Slam titles in 2024, taking his tally to four. The 21-year-old, however, suffered shock exits in the US Open and Cincinnati Masters. Is the Spaniard's late-season slump a cause for concern?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-australia-t20i-travis-head-batting-mantra-wack-it-everytime-half-century-2598278-2024-09-12",
      "headline": "Travis Head reveals batting mantra after brisk England knock: Wack it everytimeTravis Head's explosive 59 off 23 balls set the tone for Australia's win in the first T20I against England, showcasing his aggressive mindset and securing a crucial victory with strong support from the bowlers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-test-series-ricky-ponting-ipl-fearless-batters-revolution-2598272-2024-09-12",
      "headline": "IPL has made India batters fearless: Ponting ahead of BGTFormer Australia captain Ricky Ponting feels fearless batters are the main reason behind India doing well in away Test series. Ponting has credited IPL for this revolution."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-australia-1st-t20i-score-travis-head-matthew-short-bowlers-win-southampton-2598237-2024-09-12",
      "headline": "ENG v AUS, 1st T20I: Travis Head, bowlers fire Australia to big win, 1-0 lead England vs Australia, 1st T20I: Travis Head's blazing fifty and a disciplined bowling effort helped Australia win the series opener in Southampton by 28 runs. Liam Livingstone's all-round effort went in vain for the hosts on a chilly evening on Wednesday, September 11. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-australia-1st-t20i-travis-head-19-ball-fifty-2598214-2024-09-11",
      "headline": "Travis Head blasts 30 runs off Sam Curran, races to 19-ball fiftyEngland vs Australia, 1st T20I: Australian opener Travis Head smashed 30 runs off a single over from Sam Curran on his way to a 19-ball fifty against England in the series opener."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-australia-phil-salt-2598206-2024-09-11",
      "headline": "ENG vs AUS: Phil Salt honoured with England T20I captaincyENG vs AUS: England stand-in captain Phil Salt said that he was honoured to receive the leadership position for the T20I side. Salt is filling in for injured Jos Buttler."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-board-franchise-owners-yet-to-reach-consensus-on-scheduling-of-psl-2025-2598204-2024-09-11",
      "headline": "PCB, franchise owners yet to reach consensus on scheduling of PSL 2025The Pakistan Cricket Board (PCB) and franchise owners in the Pakistan Super League (PSL) are yet to decide the scheduling of next year's T20 tournament. The proposed April-May window for PSL 2025 will clash with the Indian Premier League (IPL)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/srihari-natraj-wins-tamil-nadu-quartet-breaks-mixed-4x100m-medley-record-2598185-2024-09-11",
      "headline": "Srihari Natraj wins, Tamil Nadu quartet breaks mixed 4x100m medley recordKarnataka's Srihari Natraj clinched the men's 100m freestyle, while Tamil Nadu's quartet set a new record in the mixed 4x100m medley. Other notable performances include Vritti Agarwal's lead in the women's 1500m freestyle and multiple close finishes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-australia-phil-salt-2598206-2024-09-11",
      "headline": "ENG vs AUS: Phil Salt honoured with England T20I captaincyENG vs AUS: England stand-in captain Phil Salt said that he was honoured to receive the leadership position for the T20I side. Salt is filling in for injured Jos Buttler."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-board-franchise-owners-yet-to-reach-consensus-on-scheduling-of-psl-2025-2598204-2024-09-11",
      "headline": "PCB, franchise owners yet to reach consensus on scheduling of PSL 2025The Pakistan Cricket Board (PCB) and franchise owners in the Pakistan Super League (PSL) are yet to decide the scheduling of next year's T20 tournament. The proposed April-May window for PSL 2025 will clash with the Indian Premier League (IPL)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/srihari-natraj-wins-tamil-nadu-quartet-breaks-mixed-4x100m-medley-record-2598185-2024-09-11",
      "headline": "Srihari Natraj wins, Tamil Nadu quartet breaks mixed 4x100m medley recordKarnataka's Srihari Natraj clinched the men's 100m freestyle, while Tamil Nadu's quartet set a new record in the mixed 4x100m medley. Other notable performances include Vritti Agarwal's lead in the women's 1500m freestyle and multiple close finishes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/former-dc-head-coach-ricky-ponting-teases-ipl-2025-return-2598162-2024-09-11",
      "headline": "Former DC head coach Ricky Ponting teases IPL 2025 returnFormer Australia cricketer Ricky Ponting has teased his return to the Indian Premier League. The former DC coach revealed that there might be some opportunities coming up for him in the next few weeks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/psg-welcome-lfp-mediation-with-mbappe-over-wage-dispute-2598147-2024-09-11",
      "headline": "PSG welcome LFP mediation with Mbappe over wage disputeParis St Germain has accepted a mediation offer from the French football league's governing body (LFP) regarding Kylian Mbappe's wage dispute. The dispute follows Mbappe's departure to Real Madrid after refusing a contract extension with PSG."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/anton-roux-steps-down-as-sri-lanka-fielding-coach-2598126-2024-09-11",
      "headline": "Anton Roux steps down as Sri Lanka fielding coachAnton Roux, currently serving as Sri Lanka's national fielding coach, announced his decision to step down from the role. Roux became Sri Lanka's national fielding coach in March 2022.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/narayan-jagadeesan-sets-ultimate-india-goal-after-ipl-snub-last-season-2598125-2024-09-11",
      "headline": "Ultimate aim is to be part of Team India: Narayan JagadeesanNarayan Jagadeesan said that he aims to play for India and find his way back into the IPL. Last season, the Tamil Nadu wicketkeeper went sold in the auction. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/how-i-made-it/story/wc-influential-ten-writers-community-honors-digital-social-change-makers-2527796-2024-04-16",
      "headline": "WC influential ten: Writers community honors digital social change makersWriters Community Freelancers Releases 'WC Influential Ten' List Recognizing Social Impact through Virtual Space and Social Media"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}