{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-new-rules-myths-and-facts-about-pf-withdrawals-2803660-2025-10-15",
      "headline": "EPFO new rules: Check myths and facts about PF withdrawalsAfter the announcement, social media was flooded with rumours that employees will no longer be able to withdraw their PF after leaving a job. This is not true. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/epfo-rules-change-oppn-claims-salaried-people-being-punished-for-govts-mishandling-of-economy-2803625-2025-10-15",
      "headline": "Opposition slams Centre's EPFO rules, says salaried employees being punishedThe opposition slammed the Modi government over new EPFO rules, accusing it of punishing salaried employees for \"economic mismanagement.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-500-points-higher-nifty-above-25300-bajaj-finance-up-4-percent-2803501-2025-10-15",
      "headline": "Sensex ends 575 points higher, Nifty above 25,300; Bajaj Finance up 4%The S&P BSE Sensex added 575.45 points to end at 82,605.43, while the NSE Nifty50 gained 178.05 points to close at 25,323.55. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ethanol-blending-sugar-industry-urges-government-demand-push-ifge-isma-request-2803476-2025-10-15",
      "headline": "Sugar sector urges government to push ethanol blending beyond 20%: ReportEthanol producers have collectively offered 17,760 million litres for the ethanol supply year 2025–26 (ESY), which far exceeds the oil marketing companies' (OMCs) annual requirement of around 10,500 million litres."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/expecting-your-entire-ctc-as-salary-heres-the-reality-check-2803474-2025-10-15",
      "headline": "Expecting your entire CTC as salary? Here's the reality checkMany first-time earners walk into their jobs assuming the number on their offer letter will land in their bank account. But when the first payslip arrives, reality hits hard. The gap between CTC and take-home pay is bigger than most realise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-nears-rs-13-lakh-is-it-wise-to-buy-before-dhanteras-gold-price-should-you-buy-or-sell-gold-2803427-2025-10-15",
      "headline": "Gold nears Rs 1.3 lakh. Is it wise to buy before Dhanteras?As gold inches close to Rs 1.3 lakh per 10 grams, festive shoppers are facing a dilemma. With Dhanteras around the corner, the big question is simple: buy now or hold off in hope of a dip?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-rally-sensex-jumps-500-points-dalal-street-optimism-explained-2803390-2025-10-15",
      "headline": "Sensex jumps 500 points: What's driving today's stock market rallyBy mid-morning, the S&P BSE Sensex had gained 474.63 points to 82,504.61, while the NSE Nifty50 rose 161.90 points to 25,309.65. Most other indices across sectors also saw healthy gains, reflecting broad-based buying."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/is-goldman-sachs-planning-job-cuts-to-make-way-for-its-ai-strategy-2803369-2025-10-15",
      "headline": "Is Goldman Sachs planning to cut jobs? Check hereGoldman Sachs is gearing up for another round of layoffs as it speeds up its shift towards artificial intelligence under its OneGS 3.0 strategy, mention reports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/diwali-picks-2025-portfolio-guide-stock-market-samvat-2082-nifty-outlook-2803344-2025-10-15",
      "headline": "Diwali Picks 2025: How can you build your portfolio this festive season As markets steady ahead of Diwali, analysts say the current calm could be the base for the next rally — a chance to quietly build wealth before the noise returns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/q2-earnings-lift-it-stocks-should-investors-join-invest-in-infosys-tcs-hlctech-persistent-2803343-2025-10-15",
      "headline": "Q2 earnings lift IT stocks, but should investors join the rally?Experts suggest that while the IT sector looks promising in the short term, investors should take a cautious approach and focus on selective stocks that show consistent growth potential."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-over-200-points-higher-nifty-above-25200-ntpc-up-1-percent-2803315-2025-10-15",
      "headline": "Sensex opens over 200 points higher, Nifty above 25,200; NTPC up 1%The S&P BSE Sensex added 322.86 points to 82,352.84, while the NSE Nifty50 gained 105.50 points to 25,250.55 as oif 9:35 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/lg-korean-md-speech-hong-ju-jeon-bumper-listing-50-percent-premium-market-debut-hold-or-sell-2803276-2025-10-15",
      "headline": "LG Electronics IPO rocks NSE, and so does LG's Korean MD with his speechLG Electronics India's Korean Managing Director, Hong Ju Jeon, won hearts across India when he addressed the audience entirely in Hindi at the company's listing ceremony."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-eases-withdrawal-rules-but-there-is-a-catch-details-here-100-percent-pf-withdrawal-2803041-2025-10-15",
      "headline": "EPFO eases withdrawal rules, but there is a catch. Details HereThe EPFO has made a big change by allowing members to withdraw their entire provident fund balance. Still, the revised rules include a major catch that not everyone may find favourable."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sunjay-kapur-will-dispute-gambling-allegations-validity-concerns-2803053-2025-10-14",
      "headline": "No proof Sunjay Kapur drafted will: Karisma Kapoor's kids call Priya acute gamblerIn the ongoing Sunjay Kapur property dispute, senior advocate Mahesh Jethmalani, representing actor Karisma Kapoor's children, slammed the late industralist's widow, Priya Kapur, calling her an \"acute gambler\" and saying there was no proof whether Sunjay Kapur had actually drafted the will."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/best-sectors-stock-market-investment-long-term-portfolio-ev-logistics-power-equipment-auto-2802991-2025-10-14",
      "headline": "Diwali 2025: Expert lists best sectors to light up your long-term portfolioOnce seen as a risky bet for the daring few, it's now finding a place right beside traditional investments. From young professionals buying their first mutual fund to families creating demat accounts, the shift is real and growing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-297-points-lower-nifty-below-25200-dr-reddys-falls-over-2-2802947-2025-10-14",
      "headline": "Sensex, Nifty end lower amid profit booking; LG Electronics listing lights up D-StreetThe S&P BSE Sensex slipped 297.07 points to close at 82,029.98, while the NSE Nifty50 dropped 81.85 points to settle at 25,145.50."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/imf-chief-kristalina-georgieva-india-praise-proving-doubters-wrong-economic-reforms-2802924-2025-10-14",
      "headline": "India proving doubters wrong with its economic reforms: IMF chiefSpeaking ahead of the IMF-World Bank annual meetings in Washington, Georgieva said India's strong economic policies and reforms have helped it stand out as one of the world's fastest-growing economies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/forget-stocks-why-you-should-track-gold-and-silver-rally-this-diwali-2802910-2025-10-14",
      "headline": "Forget stocks, why should you track gold and silver rally this DiwaliWith markets showing uncertainty, should investors consider precious metals over stocks this festive season? Experts explain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/lg-electronics-ipo-sees-bumper-listing-why-you-shouldnt-sell-entire-stake-today-2802905-2025-10-14",
      "headline": "LG Electronics IPO sees bumper listing. Why you shouldn't sell entire stake todayLG Electronics IPO surged over 50% on listing, but should investors sell everything today or hold for bigger gains?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/digital-finance-is-not-foolproof-cautions-zerodha-founder-ceo-nithin-kamath-2802838-2025-10-14",
      "headline": "Digital finance isn't foolproof, cautions Zerodha's Nithin KamathFrom Aadhaar e-Sign to mobile apps, digital finance has transformed access to financial services in India. However, Nithin Kamath points out that system failures and delays still pose challenges for users."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss19-episode-53-malti-chahar-comment-on-nehal-chudasama-clothes-trigger-arguments-2803717-2025-10-15",
      "headline": "Bigg Boss 19 episode 53: Malti's comment on Nehal's clothes trigger arguments Malti's remark about Nehal's clothes sparked a heated argument in the Bigg Boss house, with Baseer and Kunickaa stepping in to defend Nehal. The incident added to rising tensions as housemates clashed over tasks, rations, and personal conflicts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/why-homebound-was-not-the-right-pick-for-indias-oscar-entry-2803589-2025-10-15",
      "headline": "Why Homebound was not the right pick for India's Oscar entry Despite its strong themes of caste and unemployment, 'Homebound' falls short of the depth and intensity needed for India's Oscar entry. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-spring-2026-comeback-album-end-of-march-release-rm-details-2803683-2025-10-15",
      "headline": "BTS leader RM confirms spring 2026 comeback album for March release BTS leader RM reveals spring 2026 comeback album plans at fashion event. RM hints at \"end of March\" as the potential album release window. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kriti-sanon-becomes-first-indian-female-actor-to-address-world-health-summit-berlin-2803687-2025-10-15",
      "headline": "Kriti Sanon becomes first Indian female actor to address World Health Summit, Berlin Kriti Sanon became the first Indian female actor to speak at the World Health Summit 2025, calling for global investment in women's health. The UNFPA India ambassador described it as \"the cornerstone of humanity's progress.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepika-padukone-becomes-the-new-voice-of-meta-ai-announces-with-a-video-2803676-2025-10-15",
      "headline": "Deepika Padukone becomes the new voice of Meta AI, announces with a video Deepika Padukone is now the voice of Meta AI, available across six countries. The actor announced the news on Instagram, calling it \"pretty cool.\" \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/extraction-tigo-lisa-ma-dong-seok-korean-action-franchise-2803576-2025-10-15",
      "headline": "Blackpink's Lisa to star in Extraction: Tigo with Ma Dong Seok, Lee Jin Wook Lisa of BLACKPINK secures her second acting role in Extraction: Tigo, joining Ma Dong Seok and Lee Jin Wook. The film is a Korean spinoff of the Extraction franchise, extending the Netflix action series.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kannada-mispronunciation-gulshan-devaiah-inclusive-take-kantara-social-media-2803646-2025-10-15",
      "headline": "Gulshan Devaiah on Kannada pronunciation criticism: Unity means acceptance Gulshan Devaiah addresses recent remarks about how reporters pronounce 'Kannada' and 'Kantara', encourages acceptance of minor language differences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ahaan-panday-new-look-next-action-romantic-film-ali-abbas-zafar-sharvari-2803637-2025-10-15",
      "headline": "Ahaan Panday debuts fresh look for next action-romantic film Actor Ahaan Panday is taking social media by storm with his fresh look. His changed appearance is reportedly for his next action romantic film with filmmaker Ali Abbas Zafar. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ganesh-malvika-sharma-new-romantic-family-drama-mysuru-kerala-shoots-2803578-2025-10-15",
      "headline": "Malvika Sharma set for Kannada debut with Ganesh's upcoming film: Reports Malvika Sharma is reportedly set to make her Kannada debut opposite Ganesh in Srinivas Raju's upcoming romantic family drama, which is eyeing an early 2026 release.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rakhi-sawant-husband-fir-quashed-divorce-proceedings-2803555-2025-10-15",
      "headline": "Rakhi Sawant, husband quash FIRs against each other; divorce proceedings soon The Bombay High Court has quashed FIRs filed by Rakhi Sawant and her husband, Adil Durrani, amid their marital discord. The couple will now proceed with divorce, having agreed to settle their disputes amicably."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/diljit-dosanjh-launches-new-album-aura-1st-video-kufar-stars-manushi-chhillar-2803549-2025-10-15",
      "headline": "Diljit Dosanjh launches new album AURA, 1st video Kufar stars Manushi Chhillar Diljit Dosanjh released his new 10-track album AURA, with lyrics by Raj Randhodh and production by several artistes. The music video for 'Kufar' features Manushi Chhillar and includes distinct visual settings and themes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/sai-durgha-tej-sambarala-yeti-gattu-glimpse-epic-battle-rebellion-2803526-2025-10-15",
      "headline": "Sai Durgha Tej's SYG Asura Aagamana glimpse promises grandeur and an epic battle 'Sambarala Yeti Gattu', featuring Sai Durgha Tej and Aishwarya Lekshmi, teases a gripping period action spectacle with its new 'Asura Aagamana' glimpse. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/the-resurrection-of-the-christ-jaakko-ohtonen-to-play-jesus-in-mel-gibson-film-2803513-2025-10-15",
      "headline": "The Resurrection of the Christ: Jaakko Ohtonen to play Jesus in Mel Gibson's film Finnish actor Jaakko Ohtonen has replaced Jim Caviezel as Jesus in Mel Gibson's new film. 'The Resurrection of the Christ' will begin filming in Rome, promising a fresh take with a new cast and split release in 2027."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vishal-takes-over-as-director-of-magudam-to-steer-film-amid-creative-differences-2803447-2025-10-15",
      "headline": "Vishal takes over Magudam after creative differences with director Ravi Arasu Actor Vishal took over 'Magudam' as a director amid creative differences with Ravi Arasu. The film features Dushara Vijayan, Anjali, and Yogi Babu and is produced by Super Good Films. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/laurence-fishburne-wants-to-play-professor-x-in-marvel-new-x-men-instalment-2803462-2025-10-15",
      "headline": "Laurence Fishburne wants to play Professor X in Marvel's new X-Men instalment Actor Laurence Fishburne has expressed his interest in portraying Professor Charles Xavier in the next 'X-Men' film. His proposal comes amid speculations about the future of the Marvel Cinematic Universe superhero franchise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/bjp-leader-annamalai-praises-dhanush-idly-kadai-portrayal-youth-issues-village-life-2803467-2025-10-15",
      "headline": "Annamalai praises Dhanush's Idli Kadai: Like Rishab, you excel as director, actor BJP's Annamalai sent a letter appreciating actor Dhanush's directorial 'Idli Kadai'.  He highlighted the film's portrayal of youth issues and village culture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ali-fazal-celebrates-birthday-in-benares-shares-selfie-with-mirzapur-film-cast-2803452-2025-10-15",
      "headline": "Ali Fazal celebrates birthday in Benares, shares selfie with Mirzapur cast Actor Ali Fazal celebrated his birthday in Benaras with the rest of the cast of the 'Mirzapur' film. He gave fans a glimpse into his birthday celebrations on social media. However, it was a selfie with the entire cast that caught the attention of fans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/delusion-filming-cancelled-china-tempest-controversy-korean-drama-2803453-2025-10-15",
      "headline": "K-drama Delusion halts China shoot amid Jun Ji Hyun's Tempest backlash 'Delusion' cancels overseas shoot in China for upcoming drama starring Suzy and Kim Seon Ho. Sudden change follows backlash over Jun Ji Hyun's Tempest dialogue in China\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sunjay-kapur-wife-priya-sachdeva-kapur-shares-tribute-on-his-birth-anniversary-talks-legacy-2803435-2025-10-15",
      "headline": "Sunjay Kapur's wife Priya shares tribute on his birth anniversary, talks legacy Priya Sachdev Kapur penned a heartfelt tribute to her late husband, Sunjay Kapur, on his 54th birth anniversary, recalling his legacy as a devoted family man. Sharing a touching video and verses from the Bhagavad Gita, Priya remembered Sunjay's kindness, strength, and enduring love, saying, \"Some souls don't depart; they expand.\""
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-pm-modi-assured-him-india-will-not-buy-russian-oil-glbs-2803746-2025-10-16",
      "headline": "Trump claims PM Modi has assured him 'India won't buy oil from Russia'The US President said India's oil purchases had indirectly helped sustain Russia's invasion of Ukraine, saying the continued trade \"lets Russia carry on with this ridiculous war where they've lost a million and a half people.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-afghanistan-agree-to-temporary-48-hour-ceasefire-islamabad-2803626-2025-10-15",
      "headline": "48-hour ceasefire after Pak airstrikes inside Afghanistan kill civiliansPakistan and the Taliban administration in Afghanistan have agreed to a 48-hour ceasefire starting Wednesday evening after fresh border clashes."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/fir-against-late-officer-puran-kumars-wife-3-others-in-haryana-cop-sandeep-lathars-suicide-case-sources-2803655-2025-10-15",
      "headline": "FIR filed against Puran Kumar's wife, 3 others in ASI suicide caseAn FIR has been lodged at Rohtak Sadar police station in the suicide case of Haryana cop Sandeep Kumar, naming IPS officer Puran Kumar's gunman, Kumar's wife Avneet Kaur, Bathinda MLA Amit Ratna, and another person."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-authorizes-cia-covert-action-to-oust-venezuelas-maduro-from-power-glbs-2803745-2025-10-16",
      "headline": "Trump authorises CIA covert action to oust Venezuela's Maduro from powerThe Trump administration has secretly authorised the CIA to conduct covert operations in Venezuela, escalating efforts to oust President Nicolás Maduro amid growing US military buildup and rising tensions at the UN."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/besharm-el-sheikh-the-road-to-hell-paved-with-nobel-intentions-trump-middle-east-pakistan-shehbaz-sharif-2803535-2025-10-15",
      "headline": "Besharm El Sheikh: The Road to Hell Paved With Nobel IntentionsIt is outrageous, immoral and obscene to suggest that Gaza is a gone case, but Gaza is a gone case. Peace comes from justice, not Trump-style razzmatazz."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/commonwealth-games-2030-ahmedabad-host-city-proposal-2803644-2025-10-15",
      "headline": "India set to stage Commonwealth Games 2030, Ahmedabad recommended as host cityThe Executive Board of Commonwealth Sports said on Wednesday, October 15 that it will recommend India's Ahmedabad as the proposed host city for 2030 Commonwealth Games. India last hosted the Commonwealth Games in New Delhi in 2010."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/afghans-display-pants-of-pakistan-soldiers-vow-to-join-taliban-mujahideen-fighters-islamabad-2803638-2025-10-15",
      "headline": "Taliban display pants of Pak soldiers, Afghans vow to join MujahideenThough a fragile 48-hour ceasefire has taken hold, the tensions between Afghanistan and Pakistan are boiling after Pakistani airstrikes deep inside Afghan territory killed 15 civilians. Earlier, the Taliban overran Pakistani outposts and seized uniforms and weapons from the abandoned facilities. The trousers were displayed in public in Afghanistan."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/uk-news/story/uk-sanctions-nayara-energy-rosneft-lukoil-russian-oil-revenue-ukraine-war-glbs-2803730-2025-10-16",
      "headline": "UK sanctions 90 entities, including India's Nayara Energy, to cut Putin's oil tradeThe UK has imposed fresh sanctions on 90 entities, including Indian firm Nayara Energy, to cut off Russian oil revenues. These measures aim to weaken Putin's financial resources amid the ongoing Ukraine conflict."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/taliban-captured-pakistani-tank-post-latest-border-clash-claims-viral-video-2803591-2025-10-15",
      "headline": "Viral video shows Taliban fighter taking away Pak army tankThe video surfaced hours after a fresh round of clashes broke out between Pakistani security forces and Talibani fighters along the border in Khyber Pakhtunkhwa on Tuesday night."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/bjp-fields-satish-kumar-yadav-against-tejashwi-in-raghopur-as-it-releases-third-list-for-bihar-polls-2803716-2025-10-15",
      "headline": "BJP releases 3rd list for Bihar polls, Satish Kumar Yadav to take on Tejashwi Yadav Live UpdatesThe BJP has now announced its Assembly poll bets for all 101 seats it was allotted as per the NDA seat-sharing formula for Bihar elections."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/why-ashley-tellis-arrest-us-advisor-classified-documents-political-row-in-india-2803415-2025-10-15",
      "headline": "Why Ashley Tellis arrest by FBI has sparked political war in IndiaThe arrest of Indian-American geopolitical strategist Ashley Tellis has ignited a fierce political battle in India. He is charged with unlawfully retaining classified US defence documents and meeting with Chinese officials. The BJP alleged that he was part of the \"anti-India\" force and \"celebrated by the Opposition\"."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/suprme-court-pil-lethal-injection-vs-hanging-death-row-convicts-2803653-2025-10-15",
      "headline": "Government not ready to evolve: Top court on lethal injection vs death by hangingThe court made the remark while hearing a public interest litigation seeking to end the use of hanging for executions and allow less painful alternatives such as lethal injection."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepika-padukone-becomes-the-new-voice-of-meta-ai-announces-with-a-video-2803676-2025-10-15",
      "headline": "Deepika Padukone becomes the new voice of Meta AI, announces with a videoDeepika Padukone is now the voice of Meta AI, available across six countries. The actor announced the news on Instagram, calling it \"pretty cool.\" \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/haryana-police-twin-suicides-ips-y-puran-kumar-asi-sandeep-corruption-gangster-nexus-bribes-2803416-2025-10-15",
      "headline": "Sex abuse, gangsters, bribes: Twin cop suicides expose rot in Haryana PoliceHaryana Cop Suicide: The saga, which started with the suicide of senior IPS officer Y Puran Kumar, took a new twist this week after an assistant sub-inspector (ASI) allegedly shot himself and blamed the former of corruption."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/karnataka-bengaluru-anaesthetic-drug-propofol-murder-surgeon-dermatologist-2803509-2025-10-15",
      "headline": "Bengaluru doctor arrested for wife's murder using anaesthetic drug PropofolSix months after a dermatologist's suspicious death in Bengaluru, police arrested her husband, a surgeon, for allegedly killing her using the anaesthetic drug Propofol to make it appear natural."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/afghanistan-pakistan-border-violence-taliban-spin-boldak-ttp-qatar-saudi-arabia-mediation-2803516-2025-10-15",
      "headline": "Pakistan conducts airstrikes inside Afghanistan, kills over a dozen civiliansAfghanistan-Pakistan conflict: The Pakistani Air Force conducted strikes inside Afghanistan in a deadly escalation of the border conflict. An airstrike in Spin Boldak district of Kandahar killed at least 15 civilians and left hundreds injured. Taliban fighters hit back, seizing border posts and killing Pakistani soldiers, which made Islamabad dial Qatar and Saudi Arabia for mediation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/diwali-fashion-gen-z-ananya-panday-micro-blouse-suhana-khan-belted-saree-2802380-2025-10-15",
      "headline": "Diwali fashion, the Gen Z wayFashion designer Manish Malhotra's annual Diwali bash gave a glimpse into Gen Z's love for bold and edgy fashion game for the festive season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/six-pocket-syndrome-india-kbc-kid-confidence-parenting-entitlement-2802939-2025-10-14",
      "headline": "KBC's viral kid and the six-pocket syndrome: A mirror to modern parentingA KBC contestant's confident interruption has ignited a debate on modern parenting styles in India. Experts link this behaviour to 'Six-Pocket Syndrome,' highlighting the risks of overindulgence and entitlement among children."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/tamil-nadu-assembly-bill-hindi-movie-hoardings-ban-language-row-hindi-opposition-mk-stalin-dmk-2803404-2025-10-15",
      "headline": "After backlash, Tamil Nadu stalls anti-Hindi bill banning hoardings, songs, moviesTamil Nadu has decided to stall the anti-Hindi bill following backlash, said sources. The proposed bill sought to ban Hindi  hoardings, movies, abd songs. BJP called it absurd and a political diversion.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-bihar-polls-will-be-a-high-stakes-battle-2803539-2025-10-15",
      "headline": "Why Bihar polls will be a high-stakes battleA do-or-die verdict for Nitish Kumar, Tejashwi Yadav's best chance yet and a disruptive debut for Prashant Kishor—inside the pivotal clash with national implications"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-pakistan-womens-world-cup-rain-delay-fatim-sana-bowling-2803697-2025-10-15",
      "headline": "England survive almighty Pakistan scare after rain washes off Colombo clashWomen's World Cup, ENG vs PAK: England avoided a defeat after rain washed off their clash against Pakistan on Wednesday at the R Premadasa Stadium in Colombo. Pakistan needed 78 runs off 24.2 overs when play was called off."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/uk-news/story/uk-tightens-language-rules-for-work-visa-cuts-job-search-time-for-international-students-india-shabana-mahmood-2803461-2025-10-15",
      "headline": "UK tightens language rules for work visa, cuts foreign students' job search timeThe UK government will require migrants applying for work visas to demonstrate A-level (B2) English proficiency from January 2026. International students must secure graduate jobs within 18 months of finishing studies from January 2027, down from two years. The new rule is set to hit Indian students as the UK is a top higher study destination for them. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/are-your-lungs-ageing-faster-than-body-the-warning-signs-2803517-2025-10-15",
      "headline": "Are your lungs ageing faster than body? The warning signsA 40-year-old smoker may have lungs functioning more like those of a 65-year-old. How do doctors determine lung age?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/upendra-kushwaha-releases-candidate-list-for-bihar-polls-wife-snehlata-to-contest-from-sasaram-2803719-2025-10-15",
      "headline": "Upendra Kushwaha releases RLM Bihar poll candidates, wife Snehlata to contestRashtriya Lok Morcha (RLM) chief Upendra Kushwaha released his party's candidate list for the Bihar Assembly elections, announcing his wife Snehlata Kushwaha's candidature from Sasaram."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/why-homebound-was-not-the-right-pick-for-indias-oscar-entry-2803589-2025-10-15",
      "headline": "Why Homebound was not the right pick for India's Oscar entryDespite its strong themes of caste and unemployment, 'Homebound' falls short of the depth and intensity needed for India's Oscar entry. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kriti-sanon-becomes-first-indian-female-actor-to-address-world-health-summit-berlin-2803687-2025-10-15",
      "headline": "Kriti Sanon becomes first Indian female actor to address World Health Summit, BerlinKriti Sanon became the first Indian female actor to speak at the World Health Summit 2025, calling for global investment in women's health. The UNFPA India ambassador described it as \"the cornerstone of humanity's progress.\""
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/fatima-sana-rain-halts-pakistan-win-vs-england-womens-world-cup-2803728-2025-10-15",
      "headline": "Fatima Sana rues Pakistan missing golden chance of historic England win due to rain Women's World Cup, ENG vs PAK: Pakistan's match against England on Wednesday in Colombo was washed off due to rain. Pakistan got their first point, but stayed at the bottom of the table. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-batting-struggles-rain-halt-womens-world-cup-pakistan-colombo-2803715-2025-10-15",
      "headline": "Pakistan made it hard for us: Nat Sciver-Brunt admits England's shoddy batting Women's World Cup, ENG vs PAK: Nat Sciver-Brunt admitted that England's batting against Pakistan fell short as the clash at R Premadasa Stadium in Colombo was called off due to rain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/denmark-open-satwiksairaj-rankireddy-chirag-shetty-first-round-lakshya-sen-2803710-2025-10-15",
      "headline": "Denmark Open: Satwik-Chirag move into 2nd round after comeback win over Scotland duo Indian shuttlers Satwik and Chirag overcame a tough challenge to progress at the Denmark Open. Their victory boosts India's chances but mixed doubles pair crashed out early."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-sa-1st-test-shan-masood-happy-babar-azam-realistic-expectations-lahore-2803699-2025-10-15",
      "headline": "PAK vs SA: Shan Masood backs Babar Azam's Test return, urges realistic expectations Pakistan captain Shan Masood praised Babar Azam's confident return as Pakistan defeated South Africa by 93 runs in Lahore. The win ended South Africa's 10-match Test winning streak and gave Pakistan a crucial series lead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-pakistan-womens-world-cup-rain-delay-fatim-sana-bowling-2803697-2025-10-15",
      "headline": "England survive almighty Pakistan scare after rain washes off Colombo clash Women's World Cup, ENG vs PAK: England avoided a defeat after rain washed off their clash against Pakistan on Wednesday at the R Premadasa Stadium in Colombo. Pakistan needed 78 runs off 24.2 overs when play was called off."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/womens-world-cup-2025-aus-vs-ban-annabel-sutherland-pre-match-press-conference-2803684-2025-10-15",
      "headline": "We've had a look at Shorna  and come up with plans: Annabel Sutherland Australia all-rounder Annabel Sutherland has said that they have had a good look at Bangladesh's pinch-hitter Shorna Akter ahead of their Women's World Cup 2025 clash on Thursday, October 16, in Visakhapatnam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/annabel-sutherland-on-bangladesh-threat-australia-vs-bangladesh-womens-world-cup-2025-2803679-2025-10-15",
      "headline": "Bangladesh have done damage throughout, won't take them lightly: Sutherland Australia's Annabel Sutherland acknowledges Bangladesh's strong performance in the Women's World Cup 2025 ahead of the upcoming fixture between the two teams in Visakhapatnam on Thursday, October 16."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nepal-oman-qualify-2026-icc-mens-t20-world-cup-2803678-2025-10-15",
      "headline": "Nepal, Oman qualify for Men's T20 World Cup 2026 Nepal and Oman secured their places in the 2026 ICC Men's T20 World Cup after strong performances in the Asia and East Asia-Pacific Qualifiers in Al Amerat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ishan-kishan-century-jharkhand-ranji-trophy-shami-wickets-bengal-2803666-2025-10-15",
      "headline": "Ishan Kishan hits statement century in Ranji Trophy opener, Shami picks up the pace Ishan Kishan scored an unbeaten 125 in the Ranji Trophy opener helping Jharkhand recover from early setbacks. Mohammed Shami's late burst of wickets turned the match in Bengal's favour, creating a thrilling contest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-questions-nitish-kumar-reddy-role-axar-patel-ind-vs-wi-2803605-2025-10-15",
      "headline": "Ashwin slams India's use of Nitish, suggests Axar Patel as better all-rounder Ravichandran Ashwin openly criticised India's decision-making regarding Nitish Kumar Reddy's involvement in the second Test against the West Indies, proposing that Axar Patel would have offered greater impact if Reddy was not to contribute with the ball. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/womens-world-cup-sobhana-mostary-press-conference-bangladesh-vs-sri-lanka-2803665-2025-10-15",
      "headline": "Bangladesh have shown their capability, time to aim for victory: Sobhana Mostary Women's World Cup, AUS vs BAN: In the pre-match press conference, Bangladesh batter Sobhana Mostary said that the Tigresses have already shown their capability and will go into the Australia clash with a winning mindset. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/annabel-sutherland-on-bangladesh-threat-australia-vs-bangladesh-womens-world-cup-2025-2803679-2025-10-15",
      "headline": "Bangladesh have done damage throughout, won't take them lightly: Sutherland Australia's Annabel Sutherland acknowledges Bangladesh's strong performance in the Women's World Cup 2025 ahead of the upcoming fixture between the two teams in Visakhapatnam on Thursday, October 16."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nepal-oman-qualify-2026-icc-mens-t20-world-cup-2803678-2025-10-15",
      "headline": "Nepal, Oman qualify for Men's T20 World Cup 2026 Nepal and Oman secured their places in the 2026 ICC Men's T20 World Cup after strong performances in the Asia and East Asia-Pacific Qualifiers in Al Amerat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ishan-kishan-century-jharkhand-ranji-trophy-shami-wickets-bengal-2803666-2025-10-15",
      "headline": "Ishan Kishan hits statement century in Ranji Trophy opener, Shami picks up the pace Ishan Kishan scored an unbeaten 125 in the Ranji Trophy opener helping Jharkhand recover from early setbacks. Mohammed Shami's late burst of wickets turned the match in Bengal's favour, creating a thrilling contest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-questions-nitish-kumar-reddy-role-axar-patel-ind-vs-wi-2803605-2025-10-15",
      "headline": "Ashwin slams India's use of Nitish, suggests Axar Patel as better all-rounder Ravichandran Ashwin openly criticised India's decision-making regarding Nitish Kumar Reddy's involvement in the second Test against the West Indies, proposing that Axar Patel would have offered greater impact if Reddy was not to contribute with the ball. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/womens-world-cup-sobhana-mostary-press-conference-bangladesh-vs-sri-lanka-2803665-2025-10-15",
      "headline": "Bangladesh have shown their capability, time to aim for victory: Sobhana Mostary Women's World Cup, AUS vs BAN: In the pre-match press conference, Bangladesh batter Sobhana Mostary said that the Tigresses have already shown their capability and will go into the Australia clash with a winning mindset. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-womens-world-cup-fielding-errors-sobhana-mostary-australia-press-conference-2803656-2025-10-15",
      "headline": "Bangladesh looking to learn from fielding blunders vs Australia: Sobhana MostaryBangladesh aims to address fielding mistakes before facing Australia in the Women's World Cup. The team remains determined despite recent losses and emotional setbacks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/commonwealth-games-2030-ahmedabad-host-city-proposal-2803644-2025-10-15",
      "headline": "India set to stage Commonwealth Games 2030, Ahmedabad recommended as host cityThe Executive Board of Commonwealth Sports said on Wednesday, October 15 that it will recommend India's Ahmedabad as the proposed host city for 2030 Commonwealth Games. India last hosted the Commonwealth Games in New Delhi in 2010."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-announces-zimbabwe-tour-squads-rashid-khan-rested-test-t20is-2803612-2025-10-15",
      "headline": "Rashid Khan rested for One-off Test as Afghanistan name squads for Zimbabwe tourZIM vs AFG: Rashid Khan has been rested for the one-off Test series against Zimbabwe. Zia Ur Rahman Sharifi, Sharafuddin Ashraf and Khalil Gurbaz have been called up. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-valuation-drops-2025-media-rights-merger-gaming-ad-ban-2803600-2025-10-15",
      "headline": "Has the Indian Premier League peaked? IPL ecosystem valuation falls for a second yearIPL valuation has declined for the second year in a row, falling to INR 76,100 crore in 2025. The merger of media rights and ban on gaming ads have significantly impacted the league's revenue streams and growth prospects."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ab-de-villiers-advice-on-suryakumar-yadav-poor-form-2803581-2025-10-15",
      "headline": "Greedy Suryakumar needs mindset shift to come out of poor form: AB de VilliersAB de Villiers offers candid advice to India's Suryakumar Yadav, emphasising the need for a mental adjustment amid the batter's ongoing struggles in T20 internationals. Suryakumar Yadav's batting form has taken a major hit ever since he was appointed India's T20I captain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-salute-team-bus-video-viral-reaction-ind-vs-aus-2803592-2025-10-15",
      "headline": "Watch: Rohit Sharma greets Virat Kohli with salute, shares a hug in team busIndia tour of Australia: Rohit Sharma was seen greeting Virat Kohli with a salute as the former captain boarded the team bus in New Delhi ahead of their flight to Australia. Rohit and Kohli will return to competitive action for the first time since the IPL 2025 season during the ODI series, which begins on 19 October in Perth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/six-kings-slam-2025-riyadh-tennis-star-lineup-prize-money-novak-djokovic-2803584-2025-10-15",
      "headline": "Six Kings Slam 2025: Prize money, schedule and all you need to knowNovak Djokovic, Carlos Alcaraz, Jannik Sinner and other stars will be in action in the Six Kings Slam, starting Wednesday, October 15 in Riyadh, Saudi Arabia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kuldeep-yadav-career-best-icc-test-bowling-ranking-west-indies-series-2803538-2025-10-15",
      "headline": "Kuldeep attains career-best Test rankings after stellar show against West IndiesKuldeep Yadav achieved his career-best 14th spot in ICC Test bowling rankings after a dominant show against the West Indies. Yashasvi Jaiswal also climbed to fifth spot in the batting rankings after his magnificent century."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ab-de-villiers-advice-on-suryakumar-yadav-poor-form-2803581-2025-10-15",
      "headline": "Greedy Suryakumar needs mindset shift to come out of poor form: AB de VilliersAB de Villiers offers candid advice to India's Suryakumar Yadav, emphasising the need for a mental adjustment amid the batter's ongoing struggles in T20 internationals. Suryakumar Yadav's batting form has taken a major hit ever since he was appointed India's T20I captain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-salute-team-bus-video-viral-reaction-ind-vs-aus-2803592-2025-10-15",
      "headline": "Watch: Rohit Sharma greets Virat Kohli with salute, shares a hug in team busIndia tour of Australia: Rohit Sharma was seen greeting Virat Kohli with a salute as the former captain boarded the team bus in New Delhi ahead of their flight to Australia. Rohit and Kohli will return to competitive action for the first time since the IPL 2025 season during the ODI series, which begins on 19 October in Perth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/six-kings-slam-2025-riyadh-tennis-star-lineup-prize-money-novak-djokovic-2803584-2025-10-15",
      "headline": "Six Kings Slam 2025: Prize money, schedule and all you need to knowNovak Djokovic, Carlos Alcaraz, Jannik Sinner and other stars will be in action in the Six Kings Slam, starting Wednesday, October 15 in Riyadh, Saudi Arabia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kuldeep-yadav-career-best-icc-test-bowling-ranking-west-indies-series-2803538-2025-10-15",
      "headline": "Kuldeep attains career-best Test rankings after stellar show against West IndiesKuldeep Yadav achieved his career-best 14th spot in ICC Test bowling rankings after a dominant show against the West Indies. Yashasvi Jaiswal also climbed to fifth spot in the batting rankings after his magnificent century."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-meets-virat-kohli-rohit-sharma-depart-australia-white-ball-tour-2803522-2025-10-15",
      "headline": "Shubman Gill hugs it out with Rohit Sharma as India travel to Australia: WatchShubman Gill met Virat Kohli and Rohit Sharma as Team India departed for Australia for the upcoming white-ball tour starting later this month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/sahaja-yamalapalli-stuns-sloane-stephens-wta-tampico-upset-us-open-2803518-2025-10-15",
      "headline": "India's Sahaja Yamalapalli stuns ex-US Open champion in Abierto Tampico OpenSahaja Yamalapalli stunned former US Open champion Sloane Stephens 6-2, 6-2 in a commanding first-round win at the WTA 125K Abierto Tampico in Mexico. The 24-year-old took only an hour to win the match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-sa-1st-test-lahore-score-noman-ali-dewald-brevis-2803493-2025-10-15",
      "headline": "Lahore Test: Pakistan hammer world champions to begin new WTC cycle in stylePAK vs SA, 1st Test: Noman Ali's 10-wicket haul and a gritty batting effort in the first innings helped Pakistan beat South Africa in the series opener in Lahore. Dewald Brevis's counter-attacking fifty went in vain as the world Test champions fell well short of a 277-run target on Day 4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-fines-india-slow-over-rate-womens-world-cup-match-vs-australia-2803485-2025-10-15",
      "headline": "Women's World Cup: India fined for slow over-rate against AustraliaIndia have been fined five percent of their match fee for maintaining a slow over-rate during their ICC Women's World Cup group-stage match against Australia in Visakhapatnam on Sunday (October 12)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-siraj-impact-player-award-delhi-pitch-wickets-west-indies-series-2803475-2025-10-15",
      "headline": "Every wicket felt like a five-wicket haul on difficult Delhi pitch: SirajMohammed Siraj revealed that every wicket he took during the second Test against West Indies in Delhi felt like a five-wicket haul due to the challenges of the surface. Siraj was adjudged Impact Player of the Series after taking ten wickets across two matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rashid-khan-tops-icc-odi-bowling-rankings-bangladesh-whitewash-2803472-2025-10-15",
      "headline": "Rashid Khan tops ICC ODI bowling rankings after Bangladesh whitewashAfghanistan leg-spinner Rashid Khan has reclaimed the No. 1 spot in the ICC Men's ODI Bowling Rankings after playing a pivotal role in his team's 3-0 series sweep over Bangladesh in Abu Dhabi."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/pat-cummins-virat-kohli-india-vs-australia-2803469-2025-10-15",
      "headline": "No Virat Kohli in Pat Cummins combined India-Australia ODI XI. Here's whyAustralia captain Pat Cummins was asked to make an all-time combined India-Australia playing XI. Cummins kept Virat Kohli out of that list. Here's why."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}