{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-uk-free-trade-deal-how-the-deal-could-boost-bilateral-trade-2760706-2025-07-24",
      "headline": "India-UK free trade deal: How the deal could boost bilateral tradeThe deal is expected to provide greater market access for Indian products and services, while UK companies, particularly in sectors like automobiles and medical equipment, will also benefit from reduced tariffs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-some-purchases-are-priceless-startup-founder-shyam-achuthan-on-spending-and-living-well-2760739-2025-07-24",
      "headline": "Why some purchases are priceless: Startup founder on spending and living wellWe often treat money decisions like maths problems, but this startup founder says some buys, like a family car or your own home, bring wealth you can't count."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/pm-modi-in-uk-for-fta-cheaper-scotch-and-cars-on-cards-2760695-2025-07-24",
      "headline": "PM Modi in UK for FTA: Cheaper scotch and cars on cardsPrime Minister Narendra Modi is in the UK for a meeting with the UK Prime Minister and is also expected to meet King Charles III, with the India-UK Free Trade Agreement (FTA) being the main focus. This agreement is set to provide significant market access to Indian sectors like fisheries, textiles, gems, jewellery, and leather, with a potential market size of $5.2 billion in the UK for the fisheries sector alone. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/money-matters-but-joy-matters-more-edelweiss-mutual-fund-radhika-gupta-mantra-for-life-2760708-2025-07-24",
      "headline": "Money matters, but joy matters more: Edelweiss' Radhika Gupta's mantra for lifeMany young earners feel constant pressure to save every rupee for the future. It's common to hear advice about building a fat retirement fund or aiming for the highest returns. But Radhika Gupta wants people to know that money is only useful if it also makes your present better."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/textile-exports-leather-goods-engineering-software-indias-economy-benefit-uk-trade-deal-pm-modi-2760679-2025-07-24",
      "headline": "Exports to software: How India's economy will benefit from UK trade dealThe trade agreement was signed by India's Commerce Minister Piyush Goyal and the UK's Secretary of State for Business and Trade, Jonathan Reynolds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-ends-542-points-lower-nifty-below-25100-as-volatility-weighs-heavy-2760677-2025-07-24",
      "headline": "Sensex ends 542 points lower, Nifty below 25,100 as volatility weighs heavyThe S&P BSE Sensex ended 542.47 points lower at 82,184.17, while the NSE Nifty50 declined 157.80 points to close at 25,062.10. Selling pressure was visible across sectors, with FMCG, IT, and financial stocks dragging the indices down."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/small-shopkeepers-are-turning-away-from-upi-payments-2760642-2025-07-24",
      "headline": "Small shopkeepers are turning away from UPI paymentsAccording to the National Payments Corporation of India (NPCI), UPI saw over 14.04 billion transactions in June 2024. Yet, for many at the grassroots, the system seems too complex and risky to fully embrace. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/anil-ambani-ed-raid-today-reliance-power-infra-shares-down-5-percent-loan-fraud-2760636-2025-07-24",
      "headline": "ED raids hit Anil Ambani stocks: Reliance Power, Infra sink 5%Reliance Infrastructure has lost 9.37% in the past five trading sessions, Reliance Power has fallen by 7.41% during the same period. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filed-the-wrong-itr-form-heres-how-to-fix-it-to-avoid-penalty-2760613-2025-07-24",
      "headline": "Filed the wrong ITR form? Here's how to fix it to avoid penaltyMany taxpayers only spot mistakes after hitting 'Submit'. Filing the wrong form can snowball into bigger headaches later, from refund delays to unexpected penalties. But tax experts say you do have ways to set things right, provided you act quickly."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sensex-tumbles-over-500-points-why-stock-market-is-down-today-2760574-2025-07-24",
      "headline": "Sensex plunges 600 points. Why is the stock market down today?The S&P BSE Sensex dropped 592.85 points to 82,133.79 by 1:04 pm, while the NSE Nifty50 fell 169.25 points to 25,050.65. All broader market indices were in the red as market sentiment weakened. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-now-on-digilocker-see-how-it-helps-you-pension-account-pf-balance-2760554-2025-07-24",
      "headline": "EPFO now on DigiLocker: See how it helps youThe government has been making several digital changes for EPFO members in the last few months. This new feature on DigiLocker is another step to make your provident fund details more accessible. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/anil-ambani-ed-raid-today-why-reason-loan-bribery-rs-3000-crore-fraud-sbi-sebi-2760549-2025-07-24",
      "headline": "Loan, lies and bribery? Why Anil Ambani is facing ED heatMultiple agencies, including the National Housing Bank, the Securities and Exchange Board of India (Sebi), the National Financial Reporting Authority (NFRA), and Bank of Baroda shared findings and inputs that contributed to the investigation."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/singer-babla-mehta-known-as-voice-of-mukesh-dies-in-mumbai-2760726-2025-07-24",
      "headline": "Singer Babla Mehta, know as Voice of Mukesh, dies in MumbaiSinger Babla Mehta, known as the Voice of Mukesh, died on July 22 in Mumbai. He also sang alongside legendary singer Late Lata Mangeskar in the film 'Chandni'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shweta-tripathi-10-years-masaan-legacy-vicky-kaushal-neeraj-ghaywan-richa-chadha-2760714-2025-07-24",
      "headline": "As Masaan turns 10, Shweta Tripathi discusses why it's relevance will never fadeShweta Tripathi, in an exclusive interview with IndiaToday.in, spoke about her debut film 'Masaan' as it completed a decade today. The actor opened up about the timeless social relevance of the Neeraj Ghaywan-directorial, and how the movie continues to hold a special place in her heart."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-summer-i-turned-pretty-season-3-episode-3-belly-conrad-jeremiah-2760657-2025-07-24",
      "headline": "The Summer I Turned Pretty just got ringed and entered its villain eraThe latest episode of The Summer I Turned Pretty is here and everybody is talking about it. Jeremiah proposes to Belly and everything turns into chaos, here's why."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/fauda-season-5-trailer-doron-faces-trauma-terror-hamas-attack-2760734-2025-07-24",
      "headline": "Fauda 5 trailer: After Hamas attack, Doron faces new threats and inner demonsThe trailer for the Israeli show 'Fauda' Season 5 is finally out. The new season will showcase a storyline two years after the Hamas-led attack on Israel on October 7, 2023, and the outbreak of the Swords of Iron war."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/saiyaara-7-questions-for-mohit-suri-box-office-success-criticism-originality-ahaan-panday-aneet-padda-2760697-2025-07-24",
      "headline": "Saiyaara: 7 questions we want to ask Mohit Suri after watching Ahaan-Aneet's film'Saiyaara' has struck a chord with audiences, earning Rs 150 crore at the box office. However, the film faces criticism for its lack of originality and unrealistic portrayal of Alzheimer's disease."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/10-years-of-masaan-film-that-gave-a-brilliantly-restrained-actor-like-vicky-kaushal-2760626-2025-07-24",
      "headline": "10 years of Masaan, film that gave a brilliantly restrained actor like Vicky KaushalActor Vicky Kaushal's 'Masaan' marked ten years on July 24, 2025. The film has received immense praise for its performances and grounded storytelling. IndiaToday.in shares insights on how the film elevated Vicky Kaushal's brilliance as a restrained actor.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/vicky-kaushal-celebrates-10-years-of-masaan-so-much-to-learn-grow-2760710-2025-07-24",
      "headline": "Vicky Kaushal celebrates 10 years of Masaan: So much to learn, to growVicky Kaushal clocked 10 years of his iconic debut film 'Masaan' on Thursday. As the film turned a decade old, the actor reflected on his growth and learnings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mohit-suri-honours-sandeep-vanga-fire-and-fearlessness-as-saiyaara-stirs-hearts-2760693-2025-07-24",
      "headline": "Mohit Suri honours Sandeep Vanga's fire and fearlessness as Saiyaara stirs heartsAs 'Saiyaara' soars to success, director Mohit Suri dedicates a special note to fellow filmmaker Sandeep Reddy Vanga for supporting his film publicly even before its release. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nushrratt-bharuccha-on-sexism-in-bollywood-hero-vanity-van-nicer-than-mine-2760547-2025-07-24",
      "headline": "Nushrratt Bharuccha on sexism in Bollywood: Hero's vanity van nicer than mineActor Nushrratt Bharuccha recalled instances of sexism and inequality in Bollywood. She stated in a recent interview that there have been times when she sought permission to use the hero's vanity van because they are nicer than hers. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/bad-girl-teaser-varsha-bharath-vetri-maaran-removed-from-youtube-minor-portrayal-problem-2760682-2025-07-24",
      "headline": "Vetri Maaran's Bad Girl teaser removed from YouTube over minor portrayal problemThe Madras High Court has ordered the removal of the 'Bad Girl' film teaser from social media due to concerns of inappropriate portrayal of minors, classifying it as child pornography."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ahaan-panday-tara-sutaria-old-photo-resurfaces-sparks-buzz-around-love-life-2760689-2025-07-24",
      "headline": "Did Ahaan Panday-Tara Sutaria date each other? Their old pic sparks buzzAhaan Panday's debut in Mohit Suri's 'Saiyaara' has drawn attention, but a resurfaced teenage photo with Tara Sutaria has sparked fresh rumours of a past romance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/selena-gomez-only-murders-in-the-building-season-5-release-date-announced-2760539-2025-07-24",
      "headline": "Selena Gomez's Only Murders 5 release date announced: When and where to watchSinger-actor Selena Gomez's 'Only Murders In The Building' is all set for the release of its 5th season. Here's everything about the release. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/sacha-baron-cohen-flaunts-six-pack-for-marvel-role-thanks-ozempic-2760582-2025-07-24",
      "headline": "Sacha Baron Cohen flaunts six-pack for Marvel role, thanks OzempicActor Sacha Baron Cohen posted his Men's Fitness UK cover on Instagram on Wednesday. He revealed his sculpted physique in a series of shirtless photos."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/mareesan-review-fahadh-faasil-vaduvelu-road-trip-takes-wrong-turn-post-interval-2760648-2025-07-24",
      "headline": "Maareesan review: Fahadh-Vadivelu's road trip takes wrong turn post-intervalRelease Date:Fri Jul 25, 2025Maareesan movie review: Director Sudheesh Sankar's 'Maareesan', starring Vadivelu and Fahadh Faasil, is a comedy thriller. While the film wows you with a brilliant first half, it takes a formulaic turn in the second half."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/huma-qureshi-bayaan-premiere-toronto-international-film-festival-2025-2760569-2025-07-24",
      "headline": "Huma Qureshi's Bayaan to premiere at TIFF 2025 as only Indian filmActor Huma Qureshi's film 'Bayaan' will have its world premiere at TIFF 2025. The film directed by Bikas Ranjan Mishra has been selected for the prestigious global festival's Discovery section."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/dj-snake-returns-to-india-with-a-six-city-tour-hyderabad-delhi-2760620-2025-07-24",
      "headline": "DJ Snake returns to India with a six-city tour: I've missed your energyDJ Snake is set to return to India with a six-city tour in September. He will kick off his tour in Kolkata on September 26 and wrap it up in Delhi-NCR on October 5."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/no-retakes-no-scripts-the-traitors-india-director-on-filming-show-real-time-2760586-2025-07-24",
      "headline": "No retakes, no scripts: The Traitors India director on filming show real-time'The Traitors India' director Nishant Nayak shared insights on directing the reality TV show with no retakes and live filming. In an interview with India Today, he highlighted how authenticity and Indian sensibilities shaped the unique adaptation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swifts-eras-tour-looks-turned-into-13-wax-statues-at-madame-tussauds-2760577-2025-07-24",
      "headline": "Taylor Swift's Eras Tour looks turned into 13 wax statues at Madame TussaudsMadame Tussauds has unveiled 13 new wax figures of Taylor Swift, capturing her iconic looks from the record-breaking Eras Tour across 13 cities worldwide. This historic release celebrates Swift's immense influence in music and fashion, offering fans a unique experience of her legendary style."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aneet-padda-avoids-paparazzi-selfies-with-fans-amid-saiyaara-success-2760580-2025-07-24",
      "headline": "Aneet Padda avoids paparazzi, selfies with fans amid Saiyaara success. WatchActor Aneet Padda recently avoided paparazzi and selfies with fans. She preferred to stay low profile amid the success of her latest film, 'Saiyaara'. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/textile-exports-leather-goods-engineering-software-indias-economy-benefit-uk-trade-deal-pm-modi-2760679-2025-07-24",
      "headline": "Whisky, chocolates, cars: What gets cheaper for Indians after UK trade dealThe trade agreement was signed by India's Commerce Minister Piyush Goyal and the UK's Secretary of State for Business and Trade, Jonathan Reynolds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/has-high-court-applied-its-mind-judiciously-supreme-court-pulls-up-judge-for-bail-to-actor-darshan-2760596-2025-07-24",
      "headline": "Did High Court apply its mind? Supreme Court fumes over bail to actor DarshanThe Supreme Court reserved its order on the Karnataka government's plea challenging bail to actor Darshan in the Renukaswamy murder case. The bench called the High Court's bail order a perverse exercise of discretion. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/dont-bother-we-can-use-english-words-pm-tells-translator-struggling-with-hindi-2760732-2025-07-24",
      "headline": "Don't bother, we can use English words: PM to translator struggling with HindiPrime Minister Narendra Modi told the translator, who struggled with Hindi during British Prime Minister Keir Starmer's speech, to use English words in between."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-4th-test-day-2-live-updates-score-manchester-weather-gill-stokes-2760632-2025-07-24",
      "headline": "4th Test Day 2 Live: Bumrah starts under overcast conditionsIndia (IND) vs England (ENG), 4th Test, Day 2 Live Score: England have started their first innings as Jasprit Bumrah starts under overcast conditions. Earlier, India were all out for 358 in the first innings after Rishabh Pant scored a fighting 54 batting a foot injury."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/cambodia-thailand-war-hindu-temples-shiva-lingam-sanskrit-dangrek-mountain-prasat-ta-muen-thom-2760643-2025-07-24",
      "headline": "Ancient Hindu temple with Shivling and the Thailand-Cambodia warAncient Hindu temples are part of the area, the dispute over which has sparked a war between Thailand and Cambodia. The clashes began after Cambodian drones were reportedly spotted near the Ta Muen Temple Complex, a group of 11th-century Khmer Hindu temples dedicated to Lord Shiva. This is all about the 1,000-year-old Prasat Ta Muen Thom temple and how it turned into a Buddhist centre. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/human-rights-watch-gives-muslim-slant-to-india-fight-against-illegal-immigrants-2760669-2025-07-24",
      "headline": "Rights group gives Muslim slant to India's fight against illegal immigrantsHuman Rights Watch (HRW) has accused India of \"unlawfully expelling hundreds of Muslims\" to Bangladesh. The report also claims some of them are Indian nationals. The HRW report gives a communal slant to a sovereign nation's action against illegal immigrants settled in its territory, who are a drain on resources and also a security risk."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-rishabh-pant-injured-comes-to-bat-manchester-test-2760728-2025-07-24",
      "headline": "Watch: Manchester gives standing ovation as injured Pant walks out to batThe Old Trafford crowd were up on their feet as Rishabh Pant braved through the pain to come to bat on Day 2 of the Manchester Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/revamp-tensions-in-bjp-rss-why-the-sangh-stamp-is-all-over-2760614-2025-07-24",
      "headline": "Revamp tensions in BJP-RSS: Why the Sangh stamp is all overThe RSS is no longer content playing second fiddle. It is not just shaping state appointments in the BJP but also the central leadership transition"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shweta-tripathi-10-years-masaan-legacy-vicky-kaushal-neeraj-ghaywan-richa-chadha-2760714-2025-07-24",
      "headline": "As Masaan turns 10, Shweta Tripathi discusses why it's relevance will never fadeShweta Tripathi, in an exclusive interview with IndiaToday.in, spoke about her debut film 'Masaan' as it completed a decade today. The actor opened up about the timeless social relevance of the Neeraj Ghaywan-directorial, and how the movie continues to hold a special place in her heart."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-slams-poll-body-for-defending-bihar-voter-revision-complete-nonsense-2760600-2025-07-24",
      "headline": "Wait for verdict: Poll body calls Rahul Gandhi's cheating claims baselessRahul Gandhi's sharp attack came as the controversy over alleged large-scale voter deletions and additions in Bihar continued to fuel uproar in Parliament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/fauda-season-5-trailer-doron-faces-trauma-terror-hamas-attack-2760734-2025-07-24",
      "headline": "Fauda 5 trailer: After Hamas attack, Doron faces new threats and inner demonsThe trailer for the Israeli show 'Fauda' Season 5 is finally out. The new season will showcase a storyline two years after the Hamas-led attack on Israel on October 7, 2023, and the outbreak of the Swords of Iron war."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-india-vs-pakistan-uae-neutral-venue-details-2760683-2025-07-24",
      "headline": "BCCI agrees to host Asia Cup at neutral venue, India-Pak likely in same groupAsia Cup 2025: The Indian cricket board has agreed to host the T20 tournament at a neutral venue. Discussions about the tournament were held at Thursday's Asian Cricket Council meeting. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/saiyaara-7-questions-for-mohit-suri-box-office-success-criticism-originality-ahaan-panday-aneet-padda-2760697-2025-07-24",
      "headline": "Saiyaara: 7 questions we want to ask Mohit Suri after watching Ahaan-Aneet's film'Saiyaara' has struck a chord with audiences, earning Rs 150 crore at the box office. However, the film faces criticism for its lack of originality and unrealistic portrayal of Alzheimer's disease."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/air-india-ahmedabad-crash-pilots-called-in-sick-aviation-ministry-2760704-2025-07-24",
      "headline": "Days after Air India Ahmedabad crash, 112 pilots called in sickMinister of State for Civil Aviation Murlidhar Mohol said that out of the total pilots who asked for leave on June 16, 61 were senior pilots and the rest 51 were flight officers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/mumbai-woman-dances-on-bonnet-of-moving-mercedes-as-boyfriend-drives-viral-video-reel-2760672-2025-07-24",
      "headline": "Video: Mumbai woman's Aura Farming dance on moving car as boyfriend drives for reelThe Aura Farming dance, also known as the iconic \"boat dance\", was made popular by an 11-year-old Indonesian boy, Rayyan Arkan Dikha, who has now become an internet sensation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/china-india-border-talks-line-of-actual-control-ladakh-wmcc-peaceful-relations-2760700-2025-07-24",
      "headline": "China calls border talks with India candid, next round set for later this yearChina said it held \"candid\" discussions with India regarding the situation along the LAC, as both countries expressed satisfaction with the prevailing peace in border areas and prepared for future talks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/old-is-gold-indeed-why-jewellery-exchange-plans-are-a-hit-with-indians-2760675-2025-07-24",
      "headline": "Old is gold indeed: Why jewellery exchange plans are a hit with IndiansBuyers are increasingly banking on this option to insulate themselves from the all-time-high gold rates and acquire new jewellery"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/cbp-warns-green-card-holders-always-carry-documents-face-fines-indians-america-homeland-security-noem-vance-2760645-2025-07-24",
      "headline": "US cautions Green Card, visa holders, carry papers always or face fineThe US Customs and Border Protection (CBP) has warned all non-citizens, including green card holders, to carry their registration documents at all times or risk fines and misdemeanour charges. This requirement is based on federal law and applies to all non-citizens aged 18 and older. The advisory affects millions, including Indians, who form the second-largest immigrant group in the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-man-arrested-for-biting-womans-lip-on-road-in-govindapura-during-public-sexual-harassment-2760628-2025-07-24",
      "headline": "Man follows woman, forcibly bites her lips on Bengaluru street, arrestedA man in Bengaluru's Govindapura area allegedly bit a woman's lip in public after following and harassing her. The incident occurred while she was out to buy ration. Police have arrested the accused."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/anil-ambani-ed-raid-today-why-reason-loan-bribery-rs-3000-crore-fraud-sbi-sebi-2760549-2025-07-24",
      "headline": "Loan, lies and bribery? Why Anil Ambani is facing ED heatMultiple agencies, including the National Housing Bank, the Securities and Exchange Board of India (Sebi), the National Financial Reporting Authority (NFRA), and Bank of Baroda shared findings and inputs that contributed to the investigation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-summer-i-turned-pretty-season-3-episode-3-belly-conrad-jeremiah-2760657-2025-07-24",
      "headline": "The Summer I Turned Pretty just got ringed and entered its villain eraThe latest episode of The Summer I Turned Pretty is here and everybody is talking about it. Jeremiah proposes to Belly and everything turns into chaos, here's why."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/air-india-warned-by-regulator-over-systemic-lapses-in-fatigue-management-and-training-2760666-2025-07-24",
      "headline": "Aviation regulator warned Air India over crew fatigue, training lapses: ReportAviation regulator had warned Air India of possible enforcement action over repeated safety violations related to crew fatigue, inadequate training, and compliance failures. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/russian-air-traffic-controllers-lose-contact-with-plane-carrying-50-people-search-on-news-agency-reuters-2760537-2025-07-24",
      "headline": "Russian plane crashes killing all 49 aboard, pilot error during landing suspectedA Russian passenger plane operated by Angara airline crashed near Tynda in the Far East on Monday, killing all 49 on board -- including five children -- after losing contact with air traffic control during a second landing attempt in poor visibility, with pilot error or technical malfunction suspected."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/assam-pwd-engineer-dies-by-suicide-accuses-seniors-mental-harassment-2760638-2025-07-24",
      "headline": "Assam engineer dies by suicide, says forced to clear inflated bills in noteJoshita Das, 30, was posted with the PWD department in Bongaigaon for nearly a year. She was found hanging in her room, and a handwritten suicide note was found by the police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-summer-i-turned-pretty-season-3-episode-3-belly-conrad-jeremiah-2760657-2025-07-24",
      "headline": "The Summer I Turned Pretty just got ringed and entered its villain eraThe latest episode of The Summer I Turned Pretty is here and everybody is talking about it. Jeremiah proposes to Belly and everything turns into chaos, here's why."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shweta-tripathi-10-years-masaan-legacy-vicky-kaushal-neeraj-ghaywan-richa-chadha-2760714-2025-07-24",
      "headline": "As Masaan turns 10, Shweta Tripathi discusses why it's relevance will never fadeShweta Tripathi, in an exclusive interview with IndiaToday.in, spoke about her debut film 'Masaan' as it completed a decade today. The actor opened up about the timeless social relevance of the Neeraj Ghaywan-directorial, and how the movie continues to hold a special place in her heart."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/saiyaara-7-questions-for-mohit-suri-box-office-success-criticism-originality-ahaan-panday-aneet-padda-2760697-2025-07-24",
      "headline": "Saiyaara: 7 questions we want to ask Mohit Suri after watching Ahaan-Aneet's film'Saiyaara' has struck a chord with audiences, earning Rs 150 crore at the box office. However, the film faces criticism for its lack of originality and unrealistic portrayal of Alzheimer's disease."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/10-years-of-masaan-film-that-gave-a-brilliantly-restrained-actor-like-vicky-kaushal-2760626-2025-07-24",
      "headline": "10 years of Masaan, film that gave a brilliantly restrained actor like Vicky KaushalActor Vicky Kaushal's 'Masaan' marked ten years on July 24, 2025. The film has received immense praise for its performances and grounded storytelling. IndiaToday.in shares insights on how the film elevated Vicky Kaushal's brilliance as a restrained actor.\r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-rishabh-pant-character-sanjiv-goenka-manchester-test-2760766-2025-07-24",
      "headline": "This is character: Sanjiv Goenka salutes Pant's fight in Manchester TestENG vs IND: Rishabh Pant received massive praise from the Lucknow Super Giants owner, Sanjiv Goenka for his resolve and willpower to come out and bat despite the concerning injury on his foot.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-rishabh-pant-injured-comes-to-bat-manchester-test-2760728-2025-07-24",
      "headline": "Watch: Manchester gives standing ovation as injured Pant walks out to batThe Old Trafford crowd were up on their feet as Rishabh Pant braved through the pain to come to bat on Day 2 of the Manchester Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/stefanos-tsitsipas-parts-ways-goran-ivanisevic-coach-tennis-news-2760718-2025-07-24",
      "headline": "Tsitsipas parts ways with coach Goran Ivanisevic after disappointing runTsitsipas' split with Ivanisevic marks another chapter in his ongoing struggle to recapture past brilliance—one that now demands both a rethink and a reset."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-fit-to-bat-foot-injury-manchester-test-england-2760699-2025-07-24",
      "headline": "Injured Rishabh Pant available to bat if needed, won't keep wicketsIndia vs England: Rishabh Pant is available to bat if required, despite sustaining a foot injury on Day 1 of the ongoing Manchester Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yashasvi-jaiswal-rp-singh-england-vs-india-manchester-2760686-2025-07-24",
      "headline": "Should have been more proactive: RP Singh criticises Jaiswal's approachENG vs IND: RP Singh said that Yashasvi Jaiswal should have been more proactive in his knock at the Old Trafford where he scored 58 runs before Liam Dawson accounted for his wicket. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/unnati-hooda-beats-pv-sindhu-china-open-quarter-finals-2760685-2025-07-24",
      "headline": "17-year-old Unnati Hooda stuns PV Sindhu in round of 16Indian teenage badminton sensation Unnati Hooda stunned senior compatriot PV Sindhu with a commanding victory in their Round of 16 clash at the China Open 2025 on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-india-vs-pakistan-uae-neutral-venue-details-2760683-2025-07-24",
      "headline": "BCCI agrees to host Asia Cup at neutral venue, India-Pak likely in same groupAsia Cup 2025: The Indian cricket board has agreed to host the T20 tournament at a neutral venue. Discussions about the tournament were held at Thursday's Asian Cricket Council meeting. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-australia-lhuan-dre-pretorius-odi-call-up-2760670-2025-07-24",
      "headline": "South Africa name squads for Australia tour, Pretorius earns ODI call-upAiden Markram and Temba Bavuma made their comebacks while Lhuan-dre Pretorius earned a maiden ODI call-up as Australia named their squads for the tour of Australia. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-white-ball-series-england-2026-t20is-odis-schedule-ecb-2760663-2025-07-24",
      "headline": "India to tour England again in 2026 for white-ball series, schedule announcedIndia will tour England in July 2026 for an eight-match white-ball series including five T20Is and three ODIs. The summer also features England hosting Pakistan and Sri Lanka, plus the first-ever women's Test at Lord's, marking a historic cricket season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yashasvi-jaiswal-rp-singh-england-vs-india-manchester-2760686-2025-07-24",
      "headline": "Should have been more proactive: RP Singh criticises Jaiswal's approachENG vs IND: RP Singh said that Yashasvi Jaiswal should have been more proactive in his knock at the Old Trafford where he scored 58 runs before Liam Dawson accounted for his wicket. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/unnati-hooda-beats-pv-sindhu-china-open-quarter-finals-2760685-2025-07-24",
      "headline": "17-year-old Unnati Hooda stuns PV Sindhu in round of 16Indian teenage badminton sensation Unnati Hooda stunned senior compatriot PV Sindhu with a commanding victory in their Round of 16 clash at the China Open 2025 on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-india-vs-pakistan-uae-neutral-venue-details-2760683-2025-07-24",
      "headline": "BCCI agrees to host Asia Cup at neutral venue, India-Pak likely in same groupAsia Cup 2025: The Indian cricket board has agreed to host the T20 tournament at a neutral venue. Discussions about the tournament were held at Thursday's Asian Cricket Council meeting. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-australia-lhuan-dre-pretorius-odi-call-up-2760670-2025-07-24",
      "headline": "South Africa name squads for Australia tour, Pretorius earns ODI call-upAiden Markram and Temba Bavuma made their comebacks while Lhuan-dre Pretorius earned a maiden ODI call-up as Australia named their squads for the tour of Australia. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-white-ball-series-england-2026-t20is-odis-schedule-ecb-2760663-2025-07-24",
      "headline": "India to tour England again in 2026 for white-ball series, schedule announcedIndia will tour England in July 2026 for an eight-match white-ball series including five T20Is and three ODIs. The summer also features England hosting Pakistan and Sri Lanka, plus the first-ever women's Test at Lord's, marking a historic cricket season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-dravid-pujara-ashwin-sai-sudharsan-knock-manchester-2760647-2025-07-24",
      "headline": "Solidity of Dravid and Pujara: Ashwin praises Sai Sudharsan's knock in ManchesterRavichandran Ashwin lauded Sai Sudharsan's composed knock of 61 in the fourth Test against England, even drawing comparisons between the youngster's temperament and technique to those of India's most dependable No. 3s - Rahul Dravid and Cheteshwar Pujara."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-4th-test-day-2-live-updates-score-manchester-weather-gill-stokes-2760632-2025-07-24",
      "headline": "4th Test Day 2 Live: Bumrah starts under overcast conditionsIndia (IND) vs England (ENG), 4th Test, Day 2 Live Score and Updates: The play has resumed after the early lunch. The rain has stopped, but it remains cloudy in Manchester. An injured Rishabh Pant and Washington Sundar are out in the middle as India look to stretch their total. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-parthiv-patel-icc-rule-england-vs-india-2760612-2025-07-24",
      "headline": "Should Rishabh Pant be allowed a batting sub? Parthiv Patel weighsENG vs IND: Speaking to Rishabh Pant's toe injury, Parthiv Patel said that he's okay with the ICC's rule of like-for-like replacement of wicketkeepers where the incoming player won't be allowed to bat and will only be allowed to keep wickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/marcus-rashford-barcelona-manchester-united-loan-gary-lineker-comment-2760608-2025-07-24",
      "headline": "Not everything goes as you thought: Rashford on United amid Barcelona moveMarcus Rashford accepted that Manchester United were going through changes and it did not include him in his plans. Despite this he did not badmouth the club whilst being unveiled as a new FC Barcelona player. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-right-toe-fracture-likely-ruled-out-england-test-series-2760603-2025-07-24",
      "headline": "Rishabh Pant suffers right toe fracture, likely out of England seriesRishabh Pant is unlikely to take any further part in the Manchester Test and is expected to miss the remainder of the ongoing Test series against England after scans revealed a fracture in his right toe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-injury-comeback-cricket-career-challenges-sonchiriya-england-india-test-2760558-2025-07-24",
      "headline": "Rishabh Pant: Cricket's resilient Sonchiriya dancing to destiny's musicLike the dacoits in Sonchiriya, Rishabh Pant walks a path shadowed by omens. But each time, he lifts the dead snake and keeps moving, saying 'mai ka naam le ke aage badho'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-indian-batters-sanjay-manjrekar-proud-manchester-test-2760561-2025-07-24",
      "headline": "Manjrekar backs India's batters: Can do it in typical English conditionsSanjay Manjrekar was particularly proud of the Indian batters for coming through the overcast conditions in the Manchester Test with flying colours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-stuart-broad-england-vs-india-manchester-test-2760555-2025-07-24",
      "headline": "Stuart Broad backs Rishabh Pant to bat with 'bruised foot' in ManchesterENG vs IND, 4th Test: Rishabh Pant suffered a foot injury on Day 1 of the fourth Test at the Old Trafford in Manchester after being struck by a yorker from Chris Woakes.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-right-toe-fracture-likely-ruled-out-england-test-series-2760603-2025-07-24",
      "headline": "Rishabh Pant suffers right toe fracture, likely out of England seriesRishabh Pant is unlikely to take any further part in the Manchester Test and is expected to miss the remainder of the ongoing Test series against England after scans revealed a fracture in his right toe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-injury-comeback-cricket-career-challenges-sonchiriya-england-india-test-2760558-2025-07-24",
      "headline": "Rishabh Pant: Cricket's resilient Sonchiriya dancing to destiny's musicLike the dacoits in Sonchiriya, Rishabh Pant walks a path shadowed by omens. But each time, he lifts the dead snake and keeps moving, saying 'mai ka naam le ke aage badho'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-indian-batters-sanjay-manjrekar-proud-manchester-test-2760561-2025-07-24",
      "headline": "Manjrekar backs India's batters: Can do it in typical English conditionsSanjay Manjrekar was particularly proud of the Indian batters for coming through the overcast conditions in the Manchester Test with flying colours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-stuart-broad-england-vs-india-manchester-test-2760555-2025-07-24",
      "headline": "Stuart Broad backs Rishabh Pant to bat with 'bruised foot' in ManchesterENG vs IND, 4th Test: Rishabh Pant suffered a foot injury on Day 1 of the fourth Test at the Old Trafford in Manchester after being struck by a yorker from Chris Woakes.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/zahaan-hemrajani-top-10-finish-u17-open-skiff-world-championships-india-sailing-success-2760535-2025-07-24",
      "headline": "Zahaan Hemrajani secures historic top 10 finish at U17 sailing worldsMumbai's Zahaan Hemrajani secured a top 10 overall finish at the prestigious U17 O'pen Skiff World Championships, held from July 17 to 23 in Nishinomiya, Japan. His result marks one of the highest-ever finishes by an Indian sailor at this global youth event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/satwiksairaj-rankireddy-chirag-shetty-china-open-quarterfinal-win-indonesia-2760518-2025-07-24",
      "headline": "China Open: Satwik-Chirag reach quarterfinals, HS Prannoy crashes outSatwiksairaj Rankireddy and Chirag Shetty advanced to the quarterfinals of the China Open with a commanding win over Indonesia's top doubles pair. However, India's singles campaign came to an end as HS Prannoy bowed out after a hard-fought three-game loss."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravindra-jadeja-gary-sobers-england-vs-india-4th-test-record-2760505-2025-07-24",
      "headline": "Ravindra Jadeja aims for Gary Sobers' historic Test double in EnglandENG vs IND: Ravindra Jadeja is on the cusp of reaching the unique double of 1000 runs and 30 wickets in Tests on English soil. Gary Sobers is the only visiting cricketer to have achieved the feat. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-shardul-thakur-washington-sundar-4th-test-karthik-ponting-2760500-2025-07-24",
      "headline": "Dinesh Karthik questions India's call to send Shardul ahead of SundarFormer India batter Dinesh Karthik has questioned the Indian team management to promote Shardul Thakur ahead of Washington Sundar after Rishabh Pant retired hurt in the fourth Test against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sai-sudharsan-manchester-england-vs-india-4th-test-press-conference-2760472-2025-07-24",
      "headline": "Sai Sudharsan impresses: How shadow batting helped India's new No.3ENG vs IND, 4th Test: Sai Sudharsan said that shadow batting helped him get mentally prepared for the ongoing Manchester Test, where he notched his maiden Test fifty. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-injury-india-vs-england-4th-test-michael-atherton-2760466-2025-07-24",
      "headline": "Rishabh Pant's injury is quite serious, could be series-ending: Michael AthertonEngland vs India: Former England captain Michael Atherton has voiced grave concern over wicketkeeper Rishabh Pant's injury, warning it could rule him out of the remainder of the series-a potential body blow for India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-foot-injury-india-vs-england-ricky-ponting-series-concern-2760457-2025-07-24",
      "headline": "Ponting fears serious injury as Rishabh Pant's scans leave India camp on edgeEngland vs India: Ricky Ponting has voiced serious concern over Rishabh Pant's fitness after the India wicketkeeper-batter was forced to retire hurt on the opening day of the fourth Test against England at Old Trafford."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/liverpool-sign-hugo-ekitike-from-eintracht-frankfurt-2025-squad-2760445-2025-07-24",
      "headline": "Liverpool sign Hugo Ekitike from Frankfurt to strengthen squadLiverpool have signed French striker Hugo Ekitike from Eintracht Frankfurt, the Premier League club announced on Wednesday. Ekitike will wear the number 54 jersey as a temporary squad number during the club's pre-season tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-ben-stokes-outfoxes-shubman-gill-in-manchester-2760373-2025-07-24",
      "headline": "Ben Stokes outfoxes Shubman Gill in round 1 of captain's battle in ManchesterIndia captain Shubman Gill was outfoxed by Ben Stokes on Day 1 of the fourth Test against England at Old Trafford in Manchester. The England skipper has had the upper hand over Gill and is dominating the captain's battle since Lord's win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/liam-dawson-manchester-england-vs-india-4th-test-press-conference-2760433-2025-07-24",
      "headline": "Thought Test cricket was behind me at my age: Liam DawsonENG vs IND: Liam Dawson was decent on his comeback after he had figures of 15-1-45-1 on Day 1 of England's fourth Test against India at the Old Trafford in Manchester. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/venus-williams-andrea-preti-engagement-dc-open-2760415-2025-07-24",
      "headline": "Venus Williams confirms engagement with actor Andrea PretiWashington Open: The legendary Venus Williams thanked her fiance, Andrea Preti, for lending her support when she was trying to return to the tennis court during her break away from the game. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sai-sudharsan-manchester-4th-test-england-vs-india-feature-2760404-2025-07-24",
      "headline": "Sai Sudharsan shows promise, but needs to solve his leg-side Achilles heelSai Sudharsan showed a lot of promise in his comeback Test during the England series with a fine knock. But the brave batter seems to be struggling with an achilles heel, an issue that he needs to solve quickly. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}