{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-2-online-filing-live-are-you-eligible-and-what-has-changed-income-tax-2757598-2025-07-18",
      "headline": "ITR-2 online filing live: Are you eligible and what has changed?This year, the ITR-2 form has a few important changes that every taxpayer should know. You now have to report your long-term capital gains separately for periods before and after July 23, 2024, as new indexation and tax rules apply."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-ulips-financial-product-mis-sold-banks-insurance-companies-part-1-2757581-2025-07-18",
      "headline": "The ULIP trap: Inside India's most mis-sold financial productPart one of our story explores why ULIPs still leave many investors short-changed, with low returns, high costs, and a product that tries to do too much, and ends up doing neither well."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/who-is-andy-byron-astronomer-ceo-cheating-wife-megan-kerrigan-hr-kristin-cabot-2757559-2025-07-18",
      "headline": "Who is Astronomer CEO Andy Byron, caught on Coldplay's kiss camAndy Byron, the CEO of data-driven startup Astronomer was caught on the Coldplay concert's kiss cam with a colleague, and the clip has went viral online."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/travel-insurance-scam-entrepreneur-startup-founder-experience-flight-delay-linkedin-post-2757539-2025-07-18",
      "headline": "Startup founder calls flight travel insurance a scam, shares experienceWhat should have been a straightforward process turned into a weeks-long battle across multiple platforms and customer service calls."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-opens-100-points-lower-nifty-below-25100-wipro-jumps-3-2757536-2025-07-18",
      "headline": "Sensex opens 100 points lower, Nifty below 25,100; Wipro jumps 3%The S&P BSE Sensex lost 199 points to 82,060.24, while the NSE Nifty50 was down by 40.50 points to 25,070.95, as of 9:28 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-july-18-opening-sensex-nifty-today-wall-street-record-high-us-stock-market-bse-nse-trading-setup-2757520-2025-07-18",
      "headline": "Will Sensex, Nifty rally today after Wall Street closed at a record high?The US market closed at a record high as fresh data from the United States eased concerns about an economic slowdown in the world's largest economy."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/starbucks-ceo-brian-niccol-new-home-seattle-fly-1600-km-no-more-return-to-office-policy-2757513-2025-07-18",
      "headline": "Starbucks CEO ditches 1,600 km commute, buys house near workWhen Niccol was appointed as Starbucks CEO in August last year, the company agreed to a special travel plan. He was allowed to commute between California and Seattle using a corporate jet, as long as he worked from the Seattle office at least three days a week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/walmart-layoffs-hundreds-of-roles-to-streamline-operations-report-2757225-2025-07-17",
      "headline": "Walmart cuts hundreds of roles to streamline operations: ReportEarlier this year, Walmart announced about 1,500 job cuts, which hit teams in its global tech division, online order fulfilment in US stores and its advertising arm, Walmart Connect. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-375-points-lower-nifty-below-25200-infosys-tech-mahindra-down-2-percent-2757205-2025-07-17",
      "headline": "Sensex ends 375 points lower, Nifty below 25,200; Infosys down 2%The S&P BSE Sensex was down by 375.24 points to close at 82,259.24, while the NSE Nifty50 lost 100.60 points to end at 25,111.45. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/india-stock-market-rank-number-4-asia-pacific-region-bofa-survey-dalal-street-insights-2757200-2025-07-17",
      "headline": "Dalal Street not Asia's darling anymore, says BofA surveyThe latest survey by Bank of America (BofA), shows that investor interest in Indian stock market has dropped in recent months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-safe-are-indias-instant-loan-apps-2757170-2025-07-17",
      "headline": "How safe are India's instant loan appsFrom students low on fees to families with sudden hospital bills, many use instant loan apps for fast cash, some promise money in 10–30 minutes using just a phone and a few documents."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-looks-to-extend-tenure-of-derivatives-contracts-says-official-2757179-2025-07-17",
      "headline": "Sebi looks to extend tenure of derivatives contracts, says officialSebi is signalling a shift toward deeper, more stable markets by discouraging speculative short-term trades and pushing for longer-tenure contracts, amid growing retail losses and extreme derivatives dominance."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/chris-hemsworth-drums-live-with-ed-sheeran-in-bucharest-for-new-docuseries-limitless-2757609-2025-07-18",
      "headline": "Chris Hemsworth drums live with Ed Sheeran in Bucharest for new docuseries LimitlessChris Hemsworth took an unexpected leap from acting to drumming as he joined Ed Sheeran on stage before 70,000 fans in Bucharest. The clip resurfaced after the trailer for the docuseries 'Limitless: Live Better Now' released on Thursday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/anand-l-rai-opposes-ai-generated-raanjhanaa-re-release-unhappy-with-altered-climax-2757583-2025-07-18",
      "headline": "Aanand L Rai slams re-release of Raanjhanaa with AI-powered climaxDirector Aanand L Rai has strongly opposed the AI-generated happy ending in the re-release of 'Raanjhanaa'. He stated that he was not informed or consulted by Eros International."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ssmb-29-story-leaked-tanzania-shooting-mahesh-babu-priyanka-chopra-rajamouli-telugu-cinema-2757549-2025-07-18",
      "headline": "Mahesh Babu, Priyanka Chopra's SSMB 29 based on African classics: ReportsDirector SS Rajamouli is about to begin shooting for a new schedule of his upcoming film, tentatively titled - 'SSMB 29' in Tanzania's Serengeti. The action-adventure features Mahesh Babu and Priyanka Chopra in the lead roles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kareena-kapoor-gives-her-greece-vacation-lungi-dance-twist-2757556-2025-07-18",
      "headline": "Kareena Kapoor gives her Greece vacation a lungi dance twist. PicsKareena Kapoor Khan is enjoying a sunny vacation in Greece with her family. She shared a fun 'lungi dance' post, giving a playful nod to Shah Rukh Khan's popular song."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/chris-martin-teases-couple-after-coldplay-outs-ceo-affair-2757545-2025-07-18",
      "headline": "Are you legitimate: Chris Martin teases couple after Coldplay outs CEO's affairChris Martin jokingly asked another couple in the crowd if they were 'legitimate' after teasing a pair he suspected might be having an affair. The witty moment went viral, with fans loving his playful humour on stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra43-birthday-with-fun-beach-vacation-with-family-2757519-2025-07-18",
      "headline": "Priyanka Chopra steps into 43 with fun beach vacation with family. Watch videoPriyanka Chopra Jonas celebrated her 43rd birthday with a beach holiday along with Nick Jonas, daughter Malti and her family. She shared a sweet video on Instagram showing happy family moments from the trip."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/tanvi-the-great-review-anupam-kher-soulful-acting-shubhangi-dutt-debut-soulful-bad-execution-2757301-2025-07-18",
      "headline": "Tanvi The Great review: Soulful acting bogged down by uneven pacing, flat executionRelease Date:Fri Jul 18, 2025Tanvi The Great Review: 'Tanvi: The Great' marks the acting debut of Shubhangi Dutt. Despite its ambitious emotional arc, the Anupam Kher-directorial drifts from its promising premise. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/special-ops-2-review-ai-driven-cyber-warfare-espionage-himmat-singh-kay-kay-menon-2757428-2025-07-18",
      "headline": "Special Ops 2 review: Kay Kay Menon anchors ambitious but uneven spy thrillerRelease Date:Fri Jul 18, 2025Special Ops 2 series review: The second season of 'Special Ops' delves into AI-driven cyber warfare intertwined with classic spy drama. The season raises questions about technology's role in future conflicts and personal sacrifices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/velu-prabhakaran-tamil-director-cinematographer-dies-at-68-in-chennai-2757505-2025-07-18",
      "headline": "Veteran Tamil director-cinematographer Velu Prabhakaran dies at 68 in ChennaiPopular Tamil director and cinematographer Velu Prabhakaran died on Friday morning at a private hospital in Chennai. According to reports, he died due to prolonged illness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/munawar-faruqui-learnt-timeliness-from-kangana-ranaut-being-late-from-salman-khan-2757385-2025-07-17",
      "headline": "Munawar Faruqui learnt timeliness from Kangana Ranaut, being late from Salman KhanDuring a press conference on Thursday, actor-comedian Munawar Faruqui spoke about his upcoming reality show 'The Society'. He also shared what he learned from actors Kangana Ranaut and Salman Khan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thalaivan-thalaivii-trailer-romance-meets-chaos-in-vijay-sethupathi-nithya-menen-2757369-2025-07-17",
      "headline": "Thalaivan Thalaivii trailer: Romance meets chaos in Vijay Sethupathi, Nithya's filmThe trailer for 'Thalaivan Thalaivii' featuring Vijay Sethupathi and Nithya Menen has been released, showcasing a unique love story. Anticipation builds as the film is set to release on July 25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/chris-martin-exposes-office-romance-at-coldplay-us-concert-leaves-couple-mortified-2757356-2025-07-17",
      "headline": "Chris Martin exposes Astronomer CEO's 'affair' on kiss cam at Coldplay concertColdplay's frontman Chris Martin unintentionally exposed Astronomer CEO Andy Byron's affair during a concert in Boston, leading to a viral moment filled with humour and audience laughter. This incident happened amid the band's record-breaking Music of the Spheres World Tour, which continues to draw huge crowds across the US and beyond."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ramayana-namit-malhotra-hans-zimmer-beyond-time-ranbir-kapoor-sai-pallavi-diwali-2026-2757245-2025-07-17",
      "headline": "Namit Malhotra says Hans Zimmer called Ramayana beyond time and human imagination'Ramayana' producer Namit Malhotra recently opened up on his discussion with Oscar-winning composer Hans Zimmer. He praised Zimmer for his understanding of the ancient Indian epic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ajay-devgn-and-son-of-sardaar-2-cast-bring-sarcasm-to-the-great-indian-kapil-sharma-show-netflix-2757318-2025-07-17",
      "headline": "Ajay Devgn and Son of Sardaar 2 cast bring sarcasm to Kapil Sharma's showActors Ajay Devgn, Mrunal Thakur, and Ravi Kishan will feature in the upcoming episode of 'The Great Indian Kapil Sharma Show' season 3. The promo shows Devgn playfully roasting the host and Navjot Singh Sidhu. The episode will air on July 19 on Netflix."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sidharth-malhotra-kiara-advani-request-no-photos-only-blessings-for-baby-girl-gift-sweets-to-media-2757349-2025-07-17",
      "headline": "Sidharth-Kiara request no photos, only blessings for baby girl, gift sweets to mediaSidharth Malhotra and Kiara Advani requested the paparazzi to respect their privacy and avoid clicking their newborn daughter. The couple welcomed a baby girl earlier this week. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vijay-deverakonda-hospitalised-with-dengue-ahead-of-kingdom-release-on-july-31-2757338-2025-07-17",
      "headline": "Vijay Deverakonda hospitalised with dengue ahead of Kingdom release on July 31Actor Vijay Deverakonda has been hospitalised after being diagnosed with dengue. The actor, whose film 'Kingdom' is scheduled for release on July 31, is expected to be discharged in a couple of days. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/top-films-and-shows-to-watch-on-netflix-this-weekend-july-13-20-vir-das-sakamoto-days-entitled-2757345-2025-07-17",
      "headline": "Top films and shows to watch on Netflix this weekendNetflix's new weekend lineup caters to all tastes, featuring a mix of documentaries, anime, dramas, and comedy shows. From thought-provoking political documentaries to thrilling action and heartfelt stories, there is something engaging for every viewer in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/asia-review-a-breathtaking-love-letter-to-the-wild-heart-of-the-continent-2757334-2025-07-17",
      "headline": "ASIA review: A breathtaking love letter to the wild heart of the continentRelease Date:Thu Jul 17, 2025Filmed over four years across the continent's most extreme terrains, 'Asia' is a beautiful wildlife series. With narration by Sir David Attenborough and music by SEVENTEEN, the BBC series is both visually stunning and emotionally resonant, taking you from the Himalayan red panda to highway-raiding elephants in Sri Lanka."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ajay-devgn-guru-randhawa-the-po-po-song-son-of-sardaar-2-2757169-2025-07-17",
      "headline": "The Po Po Song: Ajay Devgn, Guru Randhawa bring back nostalgia in Son of Sardaar 2The makers of the much-awaited film 'Son of Sardaar 2' released 'The Po Po Song' on Thursday. For the song, actor Ajay Devgn collaborated with singer Guru Randhawa for the first time. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/patna-hospital-firing-gangster-chandan-mishras-killers-knew-paras-hospital-layout-faulty-lock-helped-2757540-2025-07-18",
      "headline": "Planned hit? Gangster's killers knew Patna hospital layout, faulty lock helpedA six-member gang that killed murder convict Chandan Mishra inside a Patna hospital had mapped entry points, exploited a faulty door lock, and evaded security checks before shooting him dead. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/s-jaishankar-welcomes-uss-terror-tag-for-pak-group-behind-pahalgam-attack-2757529-2025-07-18",
      "headline": "India welcomes US's terror tag for Pak group behind Pahalgam attackNew Delhi said that Washington's decision to designate the Pakistan-based group behind the April 22 Pahalgam attack as a foreign terrorist outfit was a strong affirmation of India-US counter-terrorism cooperation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-on-robert-vadra-ed-chargesheet-money-laundering-congress-priyanka-gandhi-2757586-2025-07-18",
      "headline": "Hounded for 10 years: Rahul Gandhi backs Robert Vadra amid ED crackdownThe Enforcement Directorate has filed its first chargesheet naming Robert Vadra in a money laundering case linked to a Gurugram land deal, drawing sharp accusations of a \"witch hunt\" from Congress. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-ulips-financial-product-mis-sold-banks-insurance-companies-part-1-2757581-2025-07-18",
      "headline": "The ULIP trap: Inside India's most mis-sold financial product5Part one of our story explores why ULIPs remain among the most mis-sold financial products in India. Sold as all-in-one solutions, they often fail to deliver on either insurance or investment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/special-ops-2-review-ai-driven-cyber-warfare-espionage-himmat-singh-kay-kay-menon-2757428-2025-07-18",
      "headline": "Special Ops 2 review: Kay Kay Menon anchors ambitious but uneven spy thrillerRelease Date:Fri Jul 18, 2025Special Ops 2 series review: The second season of 'Special Ops' delves into AI-driven cyber warfare intertwined with classic spy drama. The season raises questions about technology's role in future conflicts and personal sacrifices."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/south/story/40-private-schools-in-bengaluru-receive-bomb-threats-police-teams-on-spot-2757561-2025-07-18",
      "headline": "You all deserve to suffer: Bomb threat mail to 40 private schools in BengaluruAt least 40 private schools across Bengaluru received bomb threat emails on Friday morning, triggering massive police deployment, Bomb Disposal Squad inspections and city-wide efforts to trace the source."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/pm-modi-bihar-visit-tejashwi-yadav-mutton-party-sawan-rjd-lalu-nitish-kumar-elections-2757577-2025-07-18",
      "headline": "Tejashwi's 'mutton party' dig at PM ahead of his Bihar visit: He's coming againTejashwi Yadav posted a sarcastic itinerary for PM Modi's Bihar visit, accusing him of honouring leaders who host mutton feasts during Sawan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-air-india-can-give-its-revival-plan-wing-2757247-2025-07-17",
      "headline": "How Air India can give its revival plan wingThe Ahmedabad crash has cast a long shadow over the airline, exposing cracks in safety, staffing and systems and posing the challenge of rebuilding trust\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/astronomer-ceo-andy-byron-kristin-cabot-affair-memes-coldplay-chris-martin-video-viral-2757560-2025-07-18",
      "headline": "A pot of meme gold spills on X as Chris Martin outs Astronomer CEO's 'affair'Andy Byron and Kristin Cabot, caught on the Coldplay concert venue's kiss cam mid-snog, instantly drew attention not just for their affection, but for their stunned reaction as Chris Martin joked from the stage that they looked like they were \"having an affair.\" "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/ssvm-institutions-from-cradle-to-cosmos-2754432-2025-07-11",
      "headline": "SSVM Institutions: From Cradle to CosmosForging Futures with Foresight, Flair, and Faith"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/siddaramaiah-dead-facebook-translation-error-karnataka-chief-minister-meta-2757497-2025-07-18",
      "headline": "Siddaramaiah 'killed' by Meta, translation blunder gets Chief Minister's goatThe post, originally written in Kannada to mourn the death of veteran actor B Saroja Devi, was mistranslated into English, prompting sharp criticism from Siddaramaiah."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ola-uber-rapido-taxi-strike-fare-demand-maharashtra-mumbai-nagpur-azad-maidan-rally-pune-nagpur-2757575-2025-07-18",
      "headline": "Uber, Ola to remain off Mumbai streets as massive Azad Maidan rally planned todayDivers of app-based cab services are set to gather at Azad Maidan in south Mumbai on Friday, as drivers demand fare rationalisation to bring app-based rates in line with traditional black-and-yellow taxis, among other issues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/tanvi-the-great-review-anupam-kher-soulful-acting-shubhangi-dutt-debut-soulful-bad-execution-2757301-2025-07-18",
      "headline": "Tanvi The Great review: Soulful acting bogged down by uneven pacing, flat executionRelease Date:Fri Jul 18, 2025Tanvi The Great Review: 'Tanvi: The Great' marks the acting debut of Shubhangi Dutt. Despite its ambitious emotional arc, the Anupam Kher-directorial drifts from its promising premise. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-dismisses-lalu-yadavs-plea-seeking-pause-on-trial-court-proceedings-in-land-for-jobs-scam-2757594-2025-07-18",
      "headline": "Land-for-jobs case: No relief for Lalu Yadav, top court refuses to halt trialThe case pertains to appointments in Railways during Lalu Prasad's tenure as Railways minister. The top court, however, granted him relief from physical appearance."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/who-is-andy-byron-astronomer-ceo-cheating-wife-megan-kerrigan-hr-kristin-cabot-2757559-2025-07-18",
      "headline": "Who is Astronomer CEO Andy Byron, caught on Coldplay's kiss camAndy Byron, the CEO of data-driven startup Astronomer was caught on the Coldplay concert's kiss cam with a colleague, and the clip has went viral online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/rock-that-fell-on-earth-from-mars-sells-for-53-million-in-sothebys-auction-2757590-2025-07-18",
      "headline": "Rock that fell on Earth from Mars sells for $5.3 million in auctionA spirited 15-minute bidding war between online and phone participants ultimately landed the ultra-rare specimen with an anonymous buyer, far surpassing its initial estimate of $2-4 million.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-ryan-ten-doeschate-on-karun-nairs-form-2757524-2025-07-18",
      "headline": "Has Karun Nair exhausted all his chances in England? Assistant coach revealsIndia's assistant coach Ryan Ten Doeschate has shared his views on Karun Nair's form in the ongoing series against England. Nair has failed to convert his starts into big scores in the series so far, which has affected India badly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/openai-unveils-chatgpt-agent-sam-altman-says-you-can-feel-the-agi-now-2757553-2025-07-18",
      "headline": "OpenAI unveils ChatGPT Agent, Sam Altman says you can 'feel the AGI' nowOpenAI has launched ChatGPT Agent, a powerful tool that can autonomously perform tasks using a virtual computer, marking a major step toward more human-like, task-oriented artificial general intelligence."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kunal-kamras-satirical-dig-at-maharashtra-assembly-brawl-hum-honge-kamyaab-2757433-2025-07-17",
      "headline": "Hum honge kamyaab: Kunal Kamra's satirical dig at Maharashtra Assembly brawlIn a satirical video set to his offbeat rendition of Hum Honge Kamyaab, Kunal Kamra stitched together dramatic clips of the brawl between BJP and NCP (Sharad Pawar faction) supporters - then slipped in shots of Chief Minister Devendra Fadnavis and Deputy Chief Minister Eknath Shinde, making his dig at the Mahayuti alliance unmistakably clear."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/rahul-vs-himanta-i-will-send-you-to-jail-you-are-out-on-bail-2757164-2025-07-17",
      "headline": "Rahul vs Himanta: I will send you to jail; you are out on bailA decade-old rivalry has become one of Indian politics' most intense personal feuds. Why Rahul Gandhi and Himanta Biswa Sarma face off with open contempt and unrelenting ferocity\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/breakfast-can-help-you-reduce-bloating-better-gut-health-2757248-2025-07-18",
      "headline": "How your breakfast can help you reduce bloatingYour breakfast may be the reason you have been feeling bloated all day. To tackle that, all you need is a few lifestyle changes and of course, homemade food."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/justice-yashwant-varma-approaches-supreme-court-over-impeachment-move-in-cash-haul-case-2757510-2025-07-18",
      "headline": "Justice Yashwant Varma approaches top court over impeachment in cash haul caseJustice Yashwant Varma claimed that the proceedings violated his rights both as an individual and as a constitutional functionary and the enquiry committee concluded its proceedings without investigating key facts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-impact-feature/story/trumps-health-in-spotlight-chronic-venous-insufficiency-diagnosis-explained-glbs-2757464-2025-07-18",
      "headline": "Trump diagnosed with vein condition after photos of swollen ankles spark concernThe White House said Donald Trump was found to be suffering from chronic venous insufficiency after the President underwent a check-up on noticing 'mild swelling' in his ankles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/amazon-lays-off-hundreds-of-employees-in-cloud-unit-after-ai-warning-from-ceo-2757584-2025-07-18",
      "headline": "Amazon lays off hundreds of employees in cloud unit after AI warning from CEOAmazon has laid off hundreds of employees in its cloud division, AWS, weeks after Andy Jassy warned that generating AI tools could lead to a reduction in corporate roles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/chris-hemsworth-drums-live-with-ed-sheeran-in-bucharest-for-new-docuseries-limitless-2757609-2025-07-18",
      "headline": "Chris Hemsworth drums live with Ed Sheeran in Bucharest for new docuseries LimitlessChris Hemsworth took an unexpected leap from acting to drumming as he joined Ed Sheeran on stage before 70,000 fans in Bucharest. The clip resurfaced after the trailer for the docuseries 'Limitless: Live Better Now' released on Thursday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/anand-l-rai-opposes-ai-generated-raanjhanaa-re-release-unhappy-with-altered-climax-2757583-2025-07-18",
      "headline": "Aanand L Rai slams re-release of Raanjhanaa with AI-powered climaxDirector Aanand L Rai has strongly opposed the AI-generated happy ending in the re-release of 'Raanjhanaa'. He stated that he was not informed or consulted by Eros International."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ssmb-29-story-leaked-tanzania-shooting-mahesh-babu-priyanka-chopra-rajamouli-telugu-cinema-2757549-2025-07-18",
      "headline": "Mahesh Babu, Priyanka Chopra's SSMB 29 based on African classics: ReportsDirector SS Rajamouli is about to begin shooting for a new schedule of his upcoming film, tentatively titled - 'SSMB 29' in Tanzania's Serengeti. The action-adventure features Mahesh Babu and Priyanka Chopra in the lead roles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kareena-kapoor-gives-her-greece-vacation-lungi-dance-twist-2757556-2025-07-18",
      "headline": "Kareena Kapoor gives her Greece vacation a lungi dance twist. PicsKareena Kapoor Khan is enjoying a sunny vacation in Greece with her family. She shared a fun 'lungi dance' post, giving a playful nod to Shah Rukh Khan's popular song."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/indian-football-in-limbo-vision-2047-aiff-fsdl-2757613-2025-07-18",
      "headline": "India's Vision 2047 can wait as football's leaky boat needs fixing firstIndia's Vision 2047 wants to take football to the stars — but right now, the engine's sputtering. With ISL stalled and the national team coachless, Indian football needs repair, not just ambition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yashasvi-jaiswal-must-curb-aggressive-instinct-dilip-vengsarkar-2757617-2025-07-18",
      "headline": "Yashasvi Jaiswal must curb aggressive instinct after Lord's blunder: Dilip VengsarkarFormer India batter Dilip Vengsarkar has asked Yashasvi Jaiswal to curb his aggressive instinct after his twin failures in the Lord's Test which eventually led to India's 22-run loss."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravindra-jadeja-fight-praised-gautam-gambhir-lords-test-india-lose-2757585-2025-07-18",
      "headline": "Ravindra Jadeja's resilience in Lord's Test earns him MVP praise from Team IndiaIndia head coach Gautam Gambhir was full of praise for seasoned all-rounder Ravindra Jadeja, hailing his battling knock in the Lord's Test against England as a display of \"incredible fight\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/diogo-jota-inducted-into-wolves-hall-of-fame-after-death-2757579-2025-07-18",
      "headline": "Diogo Jota posthumously inducted into Wolves Hall of FameWolverhampton Wanderers have paid tribute to Portuguese forward Diogo Jota by posthumously inducting him into the club's Hall of Fame following his tragic death in a car accident earlier this month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yuvraj-singh-2011-world-cup-performance-india-selection-gary-kirsten-2757578-2025-07-18",
      "headline": "Ex-India coach reveals Yuvraj Singh's spot wasn't guaranteed in 2011 World CupFormer India head coach Gary Kirsten recently revealed that Yuvraj Singh's selection for the 2011 World Cup was a topic of debate, with some questioning his place in the squad. However, both Kirsten and then-captain MS Dhoni firmly backed the left-handed all-rounder—and that faith paid off in the biggest way possible."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-must-become-a-man-manager-like-ms-dhoni-gary-kirsten-2757570-2025-07-18",
      "headline": "Shubman Gill must become a man manager like Dhoni to be great captain: KirstenFormer India head coach Gary Kirsten has suggested Shubman Gill to become a man manager like MS Dhoni to achieve captaincy greatness. Gill has been in terrific form in Tests ever since being handed over the leadership."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-ajinkya-rahane-suggests-change-in-playing-xi-for-4th-test-2757550-2025-07-18",
      "headline": "ENG vs IND: Ajinkya Rahane suggests major change in playing XI after Lord's lossIndia batter Ajinkya Rahane has suggested a change in the Indian playing XI for the fourth Test against England, set to be played at Emirates Old Trafford, Manchester."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ricky-ponting-mitchell-starc-sachin-tendulkar-test-cricket-india-vs-australia-2757548-2025-07-18",
      "headline": "How Starc's spell to Sachin Tendulkar showed he was destined for greatnessFormer Australia captain Ricky Ponting believes Mitchell Starc's spell to Sachin Tendulkar was the first indication that the left-armer had the potential to become one of Australia's great fast bowlers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-ryan-ten-doeschate-on-karun-nairs-form-2757524-2025-07-18",
      "headline": "Has Karun Nair exhausted all his chances in England? Assistant coach revealsIndia's assistant coach Ryan Ten Doeschate has shared his views on Karun Nair's form in the ongoing series against England. Nair has failed to convert his starts into big scores in the series so far, which has affected India badly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/ons-jabeur-break-tennis-mental-physical-wellbeing-injury-2757521-2025-07-18",
      "headline": "Ons Jabeur announces break from tennis to rediscover joy of living, thanks fansOns Jabeur announces a break from professional tennis to prioritise her mental and physical health. Her decision highlights the importance of self-care amid challenging times in elite sport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-siraj-workload-management-ryan-ten-doeschate-india-vs-england-2757516-2025-07-18",
      "headline": "Mohammed Siraj is like a lion, important to manage his workload: Assistant coachIndia's assistant coach Ryan ten Doeschate on Thursday hailed fast bowler Mohammed Siraj's lion-hearted commitment to the team's cause, stressing the importance of managing his workload to preserve his fitness and impact in the long run."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-ajinkya-rahane-suggests-change-in-playing-xi-for-4th-test-2757550-2025-07-18",
      "headline": "ENG vs IND: Ajinkya Rahane suggests major change in playing XI after Lord's lossIndia batter Ajinkya Rahane has suggested a change in the Indian playing XI for the fourth Test against England, set to be played at Emirates Old Trafford, Manchester."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ricky-ponting-mitchell-starc-sachin-tendulkar-test-cricket-india-vs-australia-2757548-2025-07-18",
      "headline": "How Starc's spell to Sachin Tendulkar showed he was destined for greatnessFormer Australia captain Ricky Ponting believes Mitchell Starc's spell to Sachin Tendulkar was the first indication that the left-armer had the potential to become one of Australia's great fast bowlers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-ryan-ten-doeschate-on-karun-nairs-form-2757524-2025-07-18",
      "headline": "Has Karun Nair exhausted all his chances in England? Assistant coach revealsIndia's assistant coach Ryan Ten Doeschate has shared his views on Karun Nair's form in the ongoing series against England. Nair has failed to convert his starts into big scores in the series so far, which has affected India badly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/ons-jabeur-break-tennis-mental-physical-wellbeing-injury-2757521-2025-07-18",
      "headline": "Ons Jabeur announces break from tennis to rediscover joy of living, thanks fansOns Jabeur announces a break from professional tennis to prioritise her mental and physical health. Her decision highlights the importance of self-care amid challenging times in elite sport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-siraj-workload-management-ryan-ten-doeschate-india-vs-england-2757516-2025-07-18",
      "headline": "Mohammed Siraj is like a lion, important to manage his workload: Assistant coachIndia's assistant coach Ryan ten Doeschate on Thursday hailed fast bowler Mohammed Siraj's lion-hearted commitment to the team's cause, stressing the importance of managing his workload to preserve his fitness and impact in the long run."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}