{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reserve-bank-of-india-rbi-led-monetary-policy-committee-mpc-announced-7-important-decisions-2645848-2024-12-06",
      "headline": "RBI MPC announcement: 7 important decisions you should know aboutThe Reserve Bank of India's monetary policy update includes key decisions like CRR reduction, increase in farm loan limits and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-increases-upi-lite-transaction-limit-how-will-customers-benefit-upi-rule-changes-upi-lite-app-2645455-2024-12-06",
      "headline": "RBI increases UPI Lite transaction limit: How will you benefit?The RBI has increased transaction limits for UPI Lite, making digital payments more convenient, flexible, and accessible for customers, especially for low-value and offline transactions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-governor-shaktikanta-das-policy-repo-rate-action-crticisim-piyush-goyal-nirmala-sitharaman-2645843-2024-12-06",
      "headline": "'Our job is…': RBI Governor defends policy amid criticism over lending ratesShaktikanta Das explained that the decision to hold rates stems from a dual focus on managing inflation and supporting growth. He acknowledged the recent rise in inflation, primarily due to food prices, and the moderation in economic growth"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/what-is-cash-reserve-ratio-crr-understanding-rbi-liquidity-management-tool-how-will-crr-impact-economy-2645799-2024-12-06",
      "headline": "What is Cash Reserve Ratio? Understanding RBI's liquidity management toolThe RBI cut the Cash Reserve Ratio (CRR) to 4% on December 6, injecting Rs 1.16 lakh crore into the banking system to boost liquidity, credit flow, and economic growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-keeps-key-rates-unchanged-cuts-crr-to-4-what-it-means-for-stock-market-2645804-2024-12-06",
      "headline": "RBI keeps key rates unchanged, cuts CRR to 4%: What it means for stock marketAt 11:23 am, the Sensex was down 13.04 points at 81,752.82, while the Nifty50 declined 12.05 points to trade at 24,695.80."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-key-takeaways-lower-gdp-forecast-crr-boost-inflation-projection-new-podcast-ai-2645801-2024-12-06",
      "headline": "Lower GDP forecast to CRR boost: 6 key takeaways from RBI MPCThe MPC decided by a 4-2 majority to maintain the policy repo rate at 6.5%. Governor Shaktikanta Das explained that this decision was based on an assessment of the economy and financial conditions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-announcement-crr-cash-reserve-ration-reduced-to-4-percent-2645782-2024-12-06",
      "headline": "RBI reduces CRR to 4% for liquidity boost. 3 things to know The RBI MPC has kept the key lending rates unchanged to 6.5% as its focus remains on bringing inflation under control. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reserve-bank-of-india-key-lending-repo-rate-unchanged-tackling-inflation-focus-growth-2645778-2024-12-06",
      "headline": "RBI keeps key lending rate unchanged at 6.5%, focus remains on tackling inflationRBI MPC: Governor Shaktikanta Das said the Monetary Policy Committee has decided to keep the repo rate unchanged and continue with its neutral stance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nisus-finance-services-ipo-check-latest-gmp-price-lot-size-last-day-to-apply-key-details-2645775-2024-12-06",
      "headline": "Nisus Finance Services IPO: Latest GMP, price, lot size, last day to applyNisus Finance Services IPO: The Nisus Finance Services IPO has been subscribed 20.30 times overall by December 5, 2024, the second day of bidding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-marginally-lower-as-markets-await-rbi-mpc-verdict-2645763-2024-12-06",
      "headline": "Sensex, Nifty open marginally lower as markets await RBI MPC verdictThe S&P BSE Sensex lost 67.62 points to 81,698.24, while the NSE Nifty50 was down 23.35 points to 24,685.05. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/suraksha-diagnostic-ipo-listing-date-share-price-latest-gmp-suggest-strong-market-debut-2645753-2024-12-06",
      "headline": "Suraksha Diagnostic IPO listing: Does latest GMP suggest strong market debut?Suraksha Diagnostic IPO listing: The IPO received lukewarm interest, with an overall subscription of just 1.27 times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-announcement-expectations-rbi-governor-shaktikanta-das-cut-repo-rate-december-6-2645748-2024-12-06",
      "headline": "RBI MPC announcement: Will RBI Governor Shaktikanta Das cut key lending rates?RBI MPC meeting: In the RBI MPC meet in October, the repo rate was unchanged at 6.5%, shifting the stance to 'neutral,' and holding other key rates steady."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-rbi-mpc-banking-sector-shares-in-focus-ola-electric-nykaa-dr-reddy-titan-2645747-2024-12-06",
      "headline": "Stocks to watch today: Banking sector shares in focus, Ola Electric, NykaaInvestors will be keenly watching developments, particularly in the banking and financial sectors, amid expectations of a rate cut or other monetary measures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/world-economic-forum-chief-borge-brende-on-global-trade-ai-india-aspirations-2645670-2024-12-05",
      "headline": "World Economic Forum chief Borge Brende on global trade, AI, India's aspirationsWorld Economic Forum chief Borge Brende provided his in-depth analysis of critical global and economic and political dynamics and the impact of Donald Trump's return as US President will mean on trade policies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nykaa-fashion-ceo-nihir-parikh-steps-down-with-immediate-effect-2645625-2024-12-05",
      "headline": "Nykaa Fashion CEO Nihir Parikh steps down with immediate effectThe resignation is effective from the close of business hours on December 5, 2024, as per the company's regulatory filing with the BSE and NSE."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-sensex-nifty-rally-bull-run-dalal-street-technical-levels-explained-2645459-2024-12-05",
      "headline": "Sensex, Nifty rally for 5 straight sessions: Will bull run continue on D-Street?The rally comes amid anticipation of a dovish stance by the Reserve Bank of India (RBI), fuelling momentum in Banking and Financial Services stocks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/raymond-lifestyle-gautam-singhania-new-chairman-confirmed-agm-shareholders-approval-2645438-2024-12-05",
      "headline": "Gautam Singhania confirmed as Raymond Lifestyle executive chairman at AGMThe company debuted on the stock exchanges on September 5, 2024, and Gautam Singhania has played a leadership role in both Raymond Ltd and Raymond Lifestyle since then."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-copy-sensex-nifty-end-strong-it-stocks-rbi-rate-cut-hopes-drive-market-rally-2645416-2024-12-05",
      "headline": "Sensex, Nifty end strong; IT stocks, RBI rate cut hopes drive market rallyThe S&P BSE Sensex added 809.53 points to end at 81,765.86, while the NSE Nifty50 gained 240.95 points to close at 24,708.40. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vishal-mega-mart-ipo-rs-8000-crore-check-price-band-issue-size-opening-dates-key-details-2645406-2024-12-05",
      "headline": "Vishal Mega Mart to launch Rs 8,000 crore IPO: Check price band, other detailsVishal Mega Mart IPO: The IPO is entirely an Offer For Sale (OFS) by the promoter, Samayat Services LLP, which currently holds a 96.55% stake in the company."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/what-is-pm-vidyalakshmi-scheme-how-to-apply-for-student-loan-check-all-key-details-2645357-2024-12-05",
      "headline": "What is PM-Vidyalakshmi Scheme: Check all key details The PM-Vidyalakshmi scheme offers financial support to students pursuing higher education in India, ensuring that deserving students have access to the education they need without financial barriers."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/devendra-fadnavis-maharashtra-chief-minister-eknath-shidne-deputy-meeting-him-rejects-talk-of-sulk-exclusive-2645838-2024-12-06",
      "headline": "Who persuaded Eknath Shinde? What Chief Minister Devendra Fadnavis saidDevendra Fadnavis, who was sworn in as the Chief Minister for a third term, spoke on a range of topics, from how Eknath Shinde was won over and factors behind Mahayuti's massive mandate."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/currency-notes-found-congress-mp-abhishek-manu-singhvi-seat-routine-check-rajya-sabha-chairman-jagdeep-dhankhar-probe-2645800-2024-12-06",
      "headline": "Cash found from Parliament seat allotted to Abhishek Manu Singhvi, probe orderedThe claim by Jagdeep Dhankhar on the floor of the Rajya Sabha led to vociferous protests by Congress MPs. Abhishek Manu Singhvi has denied the charges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bangladesh-deploys-turkish-bayraktar-drones-india-bengal-border-terror-groups-2645741-2024-12-06",
      "headline": "Bangladesh deploys Turkish drones near border, India on high alert: SourcesSources said the Army was verifying reports on the deployment of Bayraktar TB2 unmanned aerial vehicles (UAVs) close to the border with India. These drones were recently acquired by Bangladesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-vs-australia-2nd-pink-ball-test-live-cricket-score-rohit-sharma-pat-cummins-adelaide-oval-2645746-2024-12-06",
      "headline": "2nd Test LIVE: Rishabh Pant, Nitish Reddy steady as India go past 100India vs Australia 2nd Test Live Cricket Score: Scott Boland has joined the party. He strikes after the Tea break to send India captain Rohit Sharma back to the pavilion. The move to No. 6 hasn't worked. India are five down before reaching 100. They are losing wickets in clusters. Nitish Kumar Reddy is the new man. He has joined Rishabh Pant. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aishwarya-rai-abhishek-bachchan-rare-appearance-together-at-party-in-mumbai-2645773-2024-12-06",
      "headline": "Abhishek Bachchan, Aishwarya Rai pose together in rare public appearanceAishwarya Rai and Abhishek Bachchan made a rare public appearance at a star-studded party on Thursday, dazzling fans with their charm and style."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reserve-bank-of-india-rbi-led-monetary-policy-committee-mpc-announced-7-important-decisions-2645848-2024-12-06",
      "headline": "RBI MPC announcement: 7 important decisions you should know aboutThe Reserve Bank of India's monetary policy update includes key decisions like CRR reduction, increase in farm loan limits and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/farmers-delhi-chalo-protest-march-demand-msp-law-justice-for-lakhimpur-victims-shambhu-border-delhi-parliament-traffic-jam-2645736-2024-12-06",
      "headline": "Farmers set for 'Delhi Chalo' march, Internet cut in Ambala till December 9 Live UpdatesFarmers will resume their 'Delhi Chalo' march from the Punjab-Haryana Shambhu border, over a host of demands, including a legal guarantee for MSP, at 1 pm today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/indians-abroad/story/indian-gurasis-singh-international-business-student-lambton-college-stabbed-death-canada-2645813-2024-12-06",
      "headline": "Indian student stabbed to death in Canada by roommate during fight in kitchenA 22-year-old Indian student, Gurasis Singh, studying at Lambton College in Sarnia, Canada, was stabbed to death during a fight with his roommate. The accused, 36-year-old Crossley Hunter, was arrested from the scene and charged with second-degree murder. Singh was from Punjab."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/indias-bedroom-revolution-sex-toys-are-now-just-a-blinkit-away-2645506-2024-12-05",
      "headline": "India's bedroom revolution: Sex toys are now just a Blinkit awayThe availability of sex toys on quick-commerce platforms like Swiggy, Blinkit, and Zepto marks a significant shift in India's sexual wellness landscape. It also highlights a broader change in societal attitudes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/university-of-bath-school-of-management-a-leader-in-global-business-education-2643394-2024-12-02",
      "headline": "University of Bath School of Management: A Leader in Global Business EducationCombining top-ranked MSc programmes with practical knowledge for future corporate leaders.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-keeps-key-rates-unchanged-cuts-crr-to-4-what-it-means-for-stock-market-2645804-2024-12-06",
      "headline": "RBI keeps key rates unchanged, cuts CRR to 4%: What it means for stock marketAt 11:23 am, the Sensex was down 13.04 points at 81,752.82, while the Nifty50 declined 12.05 points to trade at 24,695.80."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-abhishek-manu-singhvi-bizarre-must-have-inquiry-parliament-seat-allotted-reaction-2645828-2024-12-06",
      "headline": "Parliament seat should be under lock and key: Abhishek Singhvi's dig amid cash rowCongress MP Abhishek Manu Singhvi denied the allegations and called for a thorough investigation, while also poking fun at parliamentary security after the alleged discovery of cash at his Rajya Sabha bench."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/single-not-lonely-modern-indians-are-changing-the-way-people-look-at-singles-2645559-2024-12-06",
      "headline": "Single, not lonely! Modern Indians are changing the way people look at singlesUnlike how society views them – with pitiful eyes – modern Indian singles certainly don't need that 'saving' and 'help'."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/lingayat-seers-statue-vandalised-in-bengaluru-attacker-says-jesus-dream-inspired-him-2645811-2024-12-06",
      "headline": "Man vandalises seer's statue in Bengaluru, says Jesus Christ dream inspired himThe statue of Lingayat seer Shivakumar Swami at Bengaluru's Siddaganga Mutt was vandalised on November 30. The accused, Srikrishna, claimed a vision of Jesus Christ in his dream inspired the act. Police are investigating the case, including a medical evaluation of the accused's mental health."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/muhammad-most-popular-boys-baby-name-in-england-and-wales-in-2023-2645827-2024-12-06",
      "headline": "Muhammad most popular boys' baby name in England and Wales in 2023The annual list from the Office for National Statistics (ONS) revealed that Muhammad had consistently ranked among the top 10 names since 2016 and held second place in 2022. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/devendra-fadnavis-maratha-chanakya-maharashtra-cm-nana-fadnavis-maratha-state-william-dalrymple-2644919-2024-12-06",
      "headline": "The OG Fadnavis who came 250 years before Devendra FadnavisMaharashtra CM: Almost 250 years before Devendra Fadnavis came the first prominent Fadnavis, Nana Phadnavis or Phadnis. Nana Fadnavis united the Marathas and his strategy helped in pushing back the expansionist British East India Company. Nana Fadnavis is often referred to as the Maratha Machiavelli or Maratha Chanakya."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/sobhita-dhulipala-naga-chaitanya-ring-game-at-wedding-on-december-4-2645768-2024-12-06",
      "headline": "Watch: Sobhita Dhulipala, Naga Chaitanya fight to find a ring in new wedding videoNaga Chaitanya and Sobhita Dhulipala got married in a grand wedding on December 4. A video of them playing a fun game of finding the ring at their wedding has emerged on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/the-bjps-new-poll-playbook-2024-assembly-election-results-2645503-2024-12-05",
      "headline": "The BJP's new poll playbookA more pro-active RSS, greater play to local leaders and issues, and the politics of doles help the saffron party post back-to-back wins"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/unitedhealthcare-ceo-brian-thompson-killer-suspect-identified-photo-flirting-evidence-search-what-we-know-so-far-2645771-2024-12-06",
      "headline": "CEO killer unmasked: Suspect snapped while flirting; bottle, phone offer cluesA key breakthrough came from a surveillance photo captured at the hostel the suspect had checked into before the murder, which briefly shows the man's face after he lowered his mask while flirting with a receptionist."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-how-is-pink-ball-different-from-red-ball-border-gavaskar-trophy-2024-25-australia-vs-india-2645793-2024-12-06",
      "headline": "Pink Ball Vs Red Ball in Test Cricket: How pink ball is different? The second Test between Australia and India is being played with a pink ball being a day/night match. Here's what makes it different from the red ball."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/isro-pslv-x59-launch-video-temples-proba-3-mission-sriharikota-culture-2645802-2024-12-06",
      "headline": "This PSLV launch video unites India's culture with its space dreamsThe video footage captured from a distance of 100 kilometres away from Sriharikota shows a blend of India's cultural diversity and its ambitious space dreams coexisting. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/uttar-pradesh/story/uttar-pradesh-pregnant-woman-dead-meerut-capital-hospital-lift-crashes-2645777-2024-12-06",
      "headline": "Woman dies after giving birth as hospital lift crashes, family vandalises propertyThe incident at Meerut's Capital Hospital triggered chaos as the woman patient's relatives staged a protest and vandalised property."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pushpa-2-show-mumbai-gaiety-galaxy-halted-mysterious-spray-allu-arjun-2645791-2024-12-06",
      "headline": "Pushpa 2 show in Mumbai halted after mysterious spray causes cough, vomitingThe screening of Allu Arjun's Pushpa 2: The Rule at Mumbai's Gaiety Galaxy was halted over a mysterious spray. The police officials are probing into the issue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sukhbir-badal-assassination-bid-shot-at-golden-temple-security-measures-renowned-temples-2645787-2024-12-06",
      "headline": "As Sukhbir Badal escapes bid on life, how renowned temples are guardedAs Akali leader Sukhbir Singh Badal narrowly survived an assassination attempt at Amritsar's Golden Temple, here's a look at the security measures at some renowned temples."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/bigg-boss-18-karan-veer-mehra-sushant-singh-rajput-shaped-career-death-2645824-2024-12-06",
      "headline": "BB 18: Karan Veer says Sushant Singh Rajput's death was a 'major shocker'In the latest episode of Bigg Boss 18, Karan Veer Mehra got emotional while talking about his bond with late actor Sushant Singh Rajput. Karan recalled how Sushant helped him during his initial career days. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-response-x-user-asking-abhishek-to-speak-hindi-not-english-2645818-2024-12-06",
      "headline": "Amitabh Bachchan slams man asking Abhishek to speak in Hindi. See postAmitabh Bachchan responded to a social media user's request to have his son Abhishek speak in Hindi, highlighting the irony of the user writing in English alphabets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/netflix-docu-film-on-rise-fall-and-comeback-of-honey-singh-to-release-in-december-2645803-2024-12-06",
      "headline": "Netflix docu-film on rise, fall and comeback of Honey Singh to release in DecemberNetflix has announced the premiere date of Yo Yo Honey Singh: Famous, a docu-film which chronicles the life of Indian hip-hop star Honey Singh, revealing his rise, struggles, and resilience through an unfiltered lens."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pushpa-2-show-mumbai-gaiety-galaxy-halted-mysterious-spray-allu-arjun-2645791-2024-12-06",
      "headline": "Pushpa 2 show in Mumbai halted after mysterious spray causes cough, vomitingThe screening of Allu Arjun's Pushpa 2: The Rule at Mumbai's Gaiety Galaxy was halted over a mysterious spray. The police officials are probing into the issue."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-pink-ball-test-rohit-sharma-number-six-return-adelaide-2645851-2024-12-06",
      "headline": "Pink-ball Test: Rohit Sharma flops on return to No.6, falls for 3 off 23 ballsRohit Sharma's return to the No.6 spot during the pink-ball Test in Adelaide ended on a sour note as he was dismissed for just 3 runs off 23 balls on Friday, December 6. Rohit was dismissed by Scott Boland as Australia continued to dominate on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-pink-ball-test-virat-kohli-kl-rahul-mitchell-starc-adelaide-2645840-2024-12-06",
      "headline": "Virat Kohli flops, luck runs out for KL Rahul in chaotic 1st sessionAustralia vs India, 2nd Test: Virat Kohli failed to get going in the first innings of the pink-ball Test in Adelaide on Friday. Shubman Gill and KL Rahul were not able to convert their starts as India lost four wickets in the first session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-new-zealand-vs-england-2nd-test-nz-vs-eng-harry-brook-ollie-pope-brydon-carse-nathan-smith-2645835-2024-12-06",
      "headline": "NZ vs ENG 2nd Test: Harry Brook, bowlers put England on top on Day 1 in WellingtonEngland finished Day 1 of the second Test against New Zealand on top after NZ were left reeling at 86/5 in the first innings. Earlier, Harry Brook scored his second century of the series to guide England to 280 in first innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/virat-kohli-adamant-sanjay-manjrekar-highlights-flaw-after-pink-ball-test-dismissal-2645822-2024-12-06",
      "headline": "Virat Kohli adamant? Sanjay Manjrekar highlights flaw after pink-ball Test dismissalAUS vs IND, 2nd Test: Virat Kohli departed for 7 runs in the 2nd Test. Sanjay Manjrekar called out Virat Kohli's weakness against deliveries bowled outside the off-stump. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-how-is-pink-ball-different-from-red-ball-border-gavaskar-trophy-2024-25-australia-vs-india-2645793-2024-12-06",
      "headline": "Pink Ball Vs Red Ball in Test Cricket: How pink ball is different? The second Test between Australia and India is being played with a pink ball being a day/night match. Here's what makes it different from the red ball."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/world-chess-championships-d-gukesh-vs-ding-liren-danger-signs-contest-draws-2645720-2024-12-06",
      "headline": "Why D Gukesh is facing danger signs in an attritional battle vs Ding LirenChess World Championship 2024: D Gukesh and Ding Liren are tied on 4.5 points each after nine games in the match. Ding Liren will play three of the remaining five games in white and the defending champion will be hoping to capitalise on the advantage. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-pink-ball-test-mitchell-starc-yashasvi-jaiswal-duck-sledging-2645774-2024-12-06",
      "headline": "Too slow? Mitchell Starc responds to Jaiswal sledge in style in pink-ball TestBorder-Gavaskar Trophy 2024, IND vs AUS 2nd Test: After being on the receiving end of a sledging battle in Perth, Mitchell Starc returned the punch in Adelaide, dismissing Yashasvi Jaiswal for a golden duck. Jaiswal fell for 0 in the first ball of the pink-ball Test on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-aus-pink-ball-test-team-news-r-ashwin-shubman-gill-rohit-sharma-2645760-2024-12-06",
      "headline": "AUS vs IND: R Ashwin returns to pink-ball Test, fit-again Shubman Gill back Border-Gavaskar Trophy: Off-spinner R Ashwin returned to India's XI for the second Test in Adelaide. Fit-again Shubman Gill and Rohit Sharma also made it to the XI. Australia, as announced, made one change to the side that lost in Perth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/nz-vs-eng-harry-brook-completes-1000-test-runs-in-2024-en-route-to-his-8th-hundred-2645761-2024-12-06",
      "headline": "Harry Brook completes 1,000 Test runs in 2024 en route to his 8th hundredNZ vs ENG: Harry Brook became the 3rd batter to complete 1,000 Test runs in 2024. He notched up his 8th Test hundred in the 2nd match vs New Zealand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-vs-australia-2nd-pink-ball-test-live-cricket-score-rohit-sharma-pat-cummins-adelaide-oval-2645746-2024-12-06",
      "headline": "2nd Test LIVE: Rohit Sharma fails at No. 6, India 5 down for 87India vs Australia 2nd Test Live Cricket Score: Scott Boland has joined the party. He strikes after the Tea break to send India captain Rohit Sharma back to the pavilion. The move to No. 6 hasn't worked. India are five down before reaching 100. They are losing wickets in clusters. Nitish Kumar Reddy is the new man. He has joined Rishabh Pant. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-pink-ball-test-mitchell-starc-yashasvi-jaiswal-duck-sledging-2645774-2024-12-06",
      "headline": "Too slow? Mitchell Starc responds to Jaiswal sledge in style in pink-ball TestBorder-Gavaskar Trophy 2024, IND vs AUS 2nd Test: After being on the receiving end of a sledging battle in Perth, Mitchell Starc returned the punch in Adelaide, dismissing Yashasvi Jaiswal for a golden duck. Jaiswal fell for 0 in the first ball of the pink-ball Test on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-aus-pink-ball-test-team-news-r-ashwin-shubman-gill-rohit-sharma-2645760-2024-12-06",
      "headline": "AUS vs IND: R Ashwin returns to pink-ball Test, fit-again Shubman Gill back Border-Gavaskar Trophy: Off-spinner R Ashwin returned to India's XI for the second Test in Adelaide. Fit-again Shubman Gill and Rohit Sharma also made it to the XI. Australia, as announced, made one change to the side that lost in Perth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/nz-vs-eng-harry-brook-completes-1000-test-runs-in-2024-en-route-to-his-8th-hundred-2645761-2024-12-06",
      "headline": "Harry Brook completes 1,000 Test runs in 2024 en route to his 8th hundredNZ vs ENG: Harry Brook became the 3rd batter to complete 1,000 Test runs in 2024. He notched up his 8th Test hundred in the 2nd match vs New Zealand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-vs-australia-2nd-pink-ball-test-live-cricket-score-rohit-sharma-pat-cummins-adelaide-oval-2645746-2024-12-06",
      "headline": "2nd Test LIVE: Rohit Sharma fails at No. 6, India 5 down for 87India vs Australia 2nd Test Live Cricket Score: Scott Boland has joined the party. He strikes after the Tea break to send India captain Rohit Sharma back to the pavilion. The move to No. 6 hasn't worked. India are five down before reaching 100. They are losing wickets in clusters. Nitish Kumar Reddy is the new man. He has joined Rishabh Pant. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/aus-vs-ind-pink-ball-test-live-streaming-when-and-where-to-watch-india-timings-2645494-2024-12-06",
      "headline": "Pink-ball Test live streaming: When and where to watch, India timingsAUS vs IND, 2nd Test: India take on Australia in a pink-ball Test in Adelaide. With a 1-0 lead, the visitors will be looking to pile up pressure on Australia, who are a bit rattled after the humbling in Perth. Here's all you to know about the TV and live streaming guide. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-new-zealand-vs-england-wellington-test-joe-root-record-2645721-2024-12-05",
      "headline": "Joe Root eyes historic 31-year-old Test records against New Zealand  NZ vs ENG: Joe Root has a chance of breaking Javed Miandad's records when England and New Zealand lock horns in the second Test at the Basin Reserve in Wellington from Friday, December 6. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vinod-kambli-controversies-rise-fall-lingering-question-sachin-tendulkar-2645716-2024-12-05",
      "headline": "Vinod Kambli: The Rise, the Fall, and the Lingering QuestionVinod Kambli's story, from prodigious talent to unfulfilled potential, highlights the harsh realities of cricket's demands and the importance of discipline, focus, and resilience in navigating fame and success."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-nitish-kumar-reddy-kl-rahul-advises-good-vibes-perth-test-debut-2645690-2024-12-05",
      "headline": "KL Rahul's suggestions worked for me in Perth Test: Nitish Kumar ReddyNitish Kumar Reddy credits KL Rahul's invaluable guidance for his impactful Test debut in Perth, highlighting the senior's calming presence and vital advice as key factors in India's strong performance against Australia in the Border-Gavaskar Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-champions-trophy-hybrid-model-icc-events-2645667-2024-12-05",
      "headline": "Champions Trophy in hybrid model finalised, same plan for ICC events until 2027: ReportThe Champions Trophy next year will take place in a hybrid model as reported by PTI. Other ICC events until 2027 will also follow the same model. The decision was made in an informal meeting at the ICC headquarters in Dubai on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-sri-lanka-lahiru-kumara-late-turnaround-ryan-rickleton-century-gqeberha-2645664-2024-12-05",
      "headline": "Lahiru Kumara gives late turnaround to Sri Lanka after Rickelton 100Lahiru Kumara's fiery spell disrupted South Africa's momentum after Ryan Rickelton's maiden Test ton, leaving the Gqeberha Test finely poised heading into Day 2 with Sri Lanka eyeing a stronger comeback."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/zimbabwe-vs-pakistan-clean-sweep-3rd-t20i-bulawayo-2645663-2024-12-05",
      "headline": "Zimbabwe deny Pakistan clean-sweep with victory in last-over thriller ZIM vs PAK: Zimbabwe beat Pakistan by two wickets in the deciding match on Thursday at the Queens Sports Club in Bulawayo. Zimbabwe chased down 133 with one ball to spare. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-nitish-kumar-reddy-kl-rahul-advises-good-vibes-perth-test-debut-2645690-2024-12-05",
      "headline": "KL Rahul's suggestions worked for me in Perth Test: Nitish Kumar ReddyNitish Kumar Reddy credits KL Rahul's invaluable guidance for his impactful Test debut in Perth, highlighting the senior's calming presence and vital advice as key factors in India's strong performance against Australia in the Border-Gavaskar Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-champions-trophy-hybrid-model-icc-events-2645667-2024-12-05",
      "headline": "Champions Trophy in hybrid model finalised, same plan for ICC events until 2027: ReportThe Champions Trophy next year will take place in a hybrid model as reported by PTI. Other ICC events until 2027 will also follow the same model. The decision was made in an informal meeting at the ICC headquarters in Dubai on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-sri-lanka-lahiru-kumara-late-turnaround-ryan-rickleton-century-gqeberha-2645664-2024-12-05",
      "headline": "Lahiru Kumara gives late turnaround to Sri Lanka after Rickelton 100Lahiru Kumara's fiery spell disrupted South Africa's momentum after Ryan Rickelton's maiden Test ton, leaving the Gqeberha Test finely poised heading into Day 2 with Sri Lanka eyeing a stronger comeback."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/zimbabwe-vs-pakistan-clean-sweep-3rd-t20i-bulawayo-2645663-2024-12-05",
      "headline": "Zimbabwe deny Pakistan clean-sweep with victory in last-over thriller ZIM vs PAK: Zimbabwe beat Pakistan by two wickets in the deciding match on Thursday at the Queens Sports Club in Bulawayo. Zimbabwe chased down 133 with one ball to spare. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-nitish-kumar-reddy-virat-kohli-fandom-test-series-2645632-2024-12-05",
      "headline": "Used to calculate my age: Reddy recalls childhood fandom for Virat KohliAUS vs IND: Nitish Kumar Reddy talked about his fandom for Virat Kohli. Reddy was at the non-striker's end when Kohli scored a century in the series opener at the Optus Stadium in Perth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-adeliade-test-record-border-gavaskar-trophy-virat-kohli-36-all-out-2645561-2024-12-05",
      "headline": "India set to battle history in day-night Test against AustraliaIndia eyes brilliance in their upcoming day-night Test against Australia in Adelaide, aiming to overcome past scars and build on their momentum in Border-Gavaskar Trophy after their Perth Test win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-nitish-kumar-reddy-father-sacrifices-crying-test-debut-virat-kohli-2645626-2024-12-05",
      "headline": "Nitish Kumar Reddy recalls father's sacrifices for his career: Saw him cryingNitish Kumar Reddy's rise from humble beginnings to Indian cricket's spotlight highlights his resilience, fueled by family sacrifices. The 21-year-old all-rounder made an unforgettable debut in Perth, delivering with both bat and ball to impress the cricketing world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-jasprit-bumrah-australia-border-gavaskar-trophy-test-series-2645584-2024-12-05",
      "headline": "Adulation for Jasprit Bumrah in Australia feels Un-AustralianAUS vs IND: Jasprit Bumrah breathed fire in the Perth Test and garnered praise from the Australian cricket fraternity. The Indian speedster won the Player of the Match award after India won by 295 runs to take a 1-0 series lead. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}