{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-2025-itr-forms-1-to-5-out-which-one-should-you-use-itr-sahaj-itr-sugam-2719911-2025-05-05",
      "headline": "ITR filing 2025: Forms 1 to 5 notified, which one should you use?ITR-1, or Sahaj, is for resident individuals whose total income is not more than Rs 50 lakh. If your income is from a salary or pension, one house property, bank deposit interest, or agricultural income not more than Rs 5,000, then this form is suitable for you."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/samsung-challenges-520-million-dollars-tax-notice-in-india-report-2719884-2025-05-05",
      "headline": "Samsung challenges $520 million tax notice in India: ReportThe case revolves around how the company imported telecom equipment between 2018 and 2021. According to tax officials, Samsung mislabelled these imports to pay lower customs duties of 10–20%, which has now triggered a hefty penalty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mba-making-broke-adults-redditor-exposes-real-life-after-elite-placements-2719797-2025-05-05",
      "headline": "'Making broke adults': Redditor's viral post shreds MBA salary dreamsA viral Reddit post lists some real offers seen on LinkedIn and compares the shiny package (CTC or cost-to-company) with the actual in-hand salary after taxes and deductions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/job-change-and-no-epf-transfer-you-might-be-losing-825-interest-earnings-2719834-2025-05-05",
      "headline": "Job change and no EPF transfer? You might be losing 8.25% interest earningsWhen you switch jobs, your Universal Account Number (UAN) stays the same, but your EPF account with your old employer doesn't automatically move to the new one. You have to transfer it yourself through the EPFO Member Sewa portal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/escalation-in-tensions-with-india-would-likely-weigh-on-pakistans-growth-moodys-2719827-2025-05-05",
      "headline": "Escalation in tensions with India would weigh on Pakistan's growth: Moody'sGlobal rating agency Moody's said on Monday that a sustained escalation in tensions with India would likely weigh on Pakistan's growth."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-294-points-higher-nifty-above-24460-adani-enterprises-rises-over-7-2719815-2025-05-05",
      "headline": "Sensex ends 294 points higher, Nifty above 24,460; Adani Enterprises jumps 7%The BSE Sensex climbed 294.85 points, or 0.37%, to close at 80,796.84, while the NSE Nifty50 advanced 114.45 points, or 0.47%, to settle at 24,461.15."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nirmala-sitharaman-meets-asian-development-bank-president-demands-fund-cut-to-pakistan-pahalgam-terror-attack-2719808-2025-05-05",
      "headline": "India aims at financial strikes, pushes ADB to curb funding to Pak: SourcesIndia is seeking a reduction in international funding to Pakistan following the Pahalgam terror attack, accusing Islamabad of supporting terror financing and fostering cross-border terrorism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-2025-key-tax-benefits-under-section-80c-80d-24b-and-more-that-every-taxpayer-must-know-2719733-2025-05-05",
      "headline": "ITR filing 2025: Key tax benefits under Section 80C, 80D, and 24BIn case you are opting for the old tax regime, under Section 80C you can claim up to Rs 1.5 lakh of deductions every year. This section covers several popular options, like Public Provident Fund (PPF), Employees' Provident Fund (EPF), ELSS mutual fund, 5-year fixed deposits and premiums for life insurance, etc."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/swiggy-share-price-jumps-six-percent-today-bolt-expansion-10-minuite-delivery-2719694-2025-05-05",
      "headline": "Explained: Why Swiggy share price jumped 6% todaySwiggy's stock may have surged nearly 6% today, but it's still down 40% year-to-date."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/to-save-crores-in-taxes-investment-banker-on-why-rich-are-buying-farmhouses-2719681-2025-05-05",
      "headline": "'To save crores in taxes': Investment banker on why rich are buying farmhousesIn India, any income from farming is completely tax-free. That means if someone says they earned money by selling vegetables, fruits, or milk from their farmland, they don't have to pay income tax on it. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/ather-energy-ipo-to-list-tomorrow-check-allotment-status-latest-gmp-2719668-2025-05-05",
      "headline": "Ather Energy IPO to list tomorrow. Check allotment status, latest GMPAther Energy's IPO, which ran from April 28 to April 30, involved a mix of fresh equity worth Rs 2,626 crore and an offer for sale (OFS) of 1.1 crore shares."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/adani-ports-2719650-2025-05-05",
      "headline": "Adani Ports shares jump 7% after Q4 results. Check target price, other detailsAdani Ports stock climbed to Rs 1,355 from its previous close of Rs 1,267.05, up 6.90% on the Bombay Stock Exchange (BSE). The upmove came after the company reported robust March quarter earnings and posted healthy operational growth in April, prompting several brokerages to raise their target prices."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/hit-3-box-office-nanis-third-film-to-cross-rs-100-crore-mark-2719906-2025-05-05",
      "headline": "HIT 3 box office: Nani's third film to cross Rs 100-crore markWith 'HIT 3', Nani continues his winning streak at the box office, delivering yet another blockbuster. The film has not only grossed over Rs 100 crore worldwide in just four days but also marked his third consecutive $2 million success in North America."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/met-gala-2025-date-time-theme-guest-list-and-where-to-watch-2719929-2025-05-05",
      "headline": "Met Gala 2025: Date, time, theme, guest list, and where to watchThe Met Gala is almost here. The event, which will be taking place on May 5 in New York City, can be watched by Indians via live stream. Wondering when, where and how to watch it? Read on to know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ayushmann-khurrana-rashmika-mandanna-shoot-final-leg-of-thama-in-ooty-2719811-2025-05-05",
      "headline": "Ayushmann Khurrana, Rashmika Mandanna shoot final leg of Thama in Ooty: ReportThe shoot of the highly-anticipated Ayushmann Khurrana and Rashmika Mandanna starrer 'Thama' has reached its final phase. Portions of the climax are reportedly being shot in Ooty currently."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/suits-la-episode-11-review-legal-drama-turns-legal-mess-case-of-identity-crisis-2719866-2025-05-05",
      "headline": "Suits LA Episode 11 review: Legal drama turns legal mess - case of identity crisisReleased-Mon May 05, 2025Who even asked for so many individual stories and flashbacks to begin with? Where is this show heading now? 'Suits LA' just premiered its worst episode so far, and we are sure it's losing the plot fast. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-rugged-powerful-action-heavy-atlee-film-exclusive-2719859-2025-05-05",
      "headline": "Allu Arjun to be seen in rugged, powerful role in Atlee film | ExclusiveAllu Arjun is collaborating with Atlee for a sci-fi action film, announced on his birthday. The film, produced by Sun Pictures, promises a unique look for Allu Arjun and is set for a grand release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/diljit-dosanjh-met-gala-red-carpet-soiree-exclusive-2719849-2025-05-05",
      "headline": "Diljit Dosanjh's Met Gala moment goes beyond just a red carpet appearanceDiljit Dosanjh is set to make history as the only Indian actor to have a seat at this year's Met Gala 2025 soiree, representing India in a regal ensemble by Prabal Gurung alongside international stars."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/suriya-reacts-comparisons-brother-karthi-cant-do-meiyazhagan-2719788-2025-05-05",
      "headline": "Suriya on comparisons with brother Karthi: I can't be him, can't do MeiyazhaganSuriya shared his take on comparisons drawn by fans between him and his brother Karthi, during a conversation to promote his latest film, 'Retro'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/lady-gaga-brazil-concert-sees-25-million-people-highest-attended-surpasses-madonna-2719830-2025-05-05",
      "headline": "Lady Gaga's Brazil concert sees 2.5 million attendees, highest by a female artistLady Gaga made history with her performance at Copacabana Beach, attracting a record-breaking crowd and marking her return to Brazil after 12 years. The concert was not only a musical spectacle but also a cultural celebration, highlighting her connection with fans and the LGBTQ+ community."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/sonu-nigam-clarification-after-fir-kannada-songs-at-bengaluru-concert-2719820-2025-05-05",
      "headline": "Tell me who's at fault: Sonu Nigam responds to case over Bengaluru concert remarksPlayback singer Sonu Nigam issued a clarification after a case was registered against him for his 'provocative' remarks in Bengaluru. The singer claimed that he was threatened by a group of boys to sing in Kannada."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/indian-idol-12-winner-pawandeep-rajan-seriously-injured-big-car-accident-2719806-2025-05-05",
      "headline": "Indian Idol 12 winner Pawandeep Rajan seriously injured in car accident. DetailsIndian Idol 12 winner Pawandeep Rajan was injured in a serious car accident and is currently undergoing treatment in Noida. The accident involved his car hitting a parked vehicle, and the police are currently investigating the incident. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sonu-nigam-faces-fir-for-controversial-remarks-during-bengaluru-concert-2719800-2025-05-05",
      "headline": "Case against Sonu Nigam over controversial remarks during Bengaluru concertSinger Sonu Nigam schooled a fan during his concert in Bengaluru after he demanded a Kannada song from him. An FIR has been filed against the singer, calling his remarks controversial. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-rejects-jaane-tu-ya-jaane-na-sequel-idea-director-abbas-tyrewala-reveals-why-2719779-2025-05-05",
      "headline": "Aamir Khan rejects sequel idea for Jaane Tu Ya Jaane Na, director reveals whyA sequel to 'Jaane Tu Ya Jaane Na' was rejected by Aamir Khan, reveals director Abbas Tyrewala. Despite fan demand, the makers feel the original's magic can't be recreated again."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vettaiyan-actor-ritika-singh-shares-weight-loss-journey-2719734-2025-05-05",
      "headline": "Vettaiyan actor Ritika Singh shares weight-loss journeyActor Ritika Singh recently shared an Instagram video showing her journey to fitness despite a knee injury. She shared how she decided that 'it's time to lock in and look the best you've ever looked'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/21-years-on-zayed-khan-recalls-main-hoon-na-magic-bond-with-srk-film-legacy-2719780-2025-05-05",
      "headline": "21 years on, Zayed Khan recalls Main Hoon Na magic, bond with SRK, film's legacyZayed Khan was the perfect mischievous, spoilt, stylish younger brother to Shah Rukh Khan's Ram in 'Main Hoon Na'. As the Farah Khan-directorial completed 21 years, we spoke to Zayed about the film achieving cult status over the years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/game-of-thrones-actor-iain-glen-in-anupam-kher-directorial-tanvi-the-great-2719762-2025-05-05",
      "headline": "Game of Thrones actor Iain Glen joins Anupam Kher directorial Tanvi The GreatGame of Thrones actor Iain Glen joined Anupam Kher's directorial, Tanvi The Great. This film marks Anupam Kher's return as director after over two decades."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/shekhar-kapur-vivek-agnihotri-slam-donald-trump-100-percent-film-tariff-as-disastrous-2719766-2025-05-05",
      "headline": "Shekhar Kapur, Vivek Agnihotri slam Trump's 100% film tariff as 'disastrous'US President Donald Trump's decision to impose a 100% tariff on foreign films has sparked criticism from filmmakers Shekhar Kapur and Vivek Agnihotri. They have warned of potential negative impacts on the global film industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/devendra-fadnavis-praises-ranbir-kapoor-sai-pallavi-film-ramayana-2719744-2025-05-05",
      "headline": "Devendra Fadnavis praises Ranbir Kapoor, Sai Pallavi film RamayanaMaharashtra Chief Minister Devendra Fadnavis praised the upcoming film Ramayana, calling its production world-class after visiting the set. Directed by Nitesh Tiwari, the film stars Ranbir Kapoor, Sai Pallavi, and Yash in the lead roles."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/adnan-sami-says-pakistanis-told-him-we-hate-our-army-shuts-down-trolls-2719726-2025-05-05",
      "headline": "Adnan Sami says Pakistanis told him 'We hate our army', shuts down trollsSinger Adnan Sami, known for his strong anti-Pakistan stands, schooled X users trying to troll him for his Indian citizenship in the wake of the Pahalgam terror attack. He also narrated an incident involving Pakistanis criticising their army for 'destroying' the country. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-teams-up-with-ranveer-jr-ntr-trainer-lloyd-stevens-for-atlee-film-2719709-2025-05-05",
      "headline": "Allu Arjun teams up with Ranveer, Jr NTR's trainer Lloyd Stevens for Atlee's filmAllu Arjun has joined hands with celebrity fitness trainer Lloyd Stevens as he begins preparing for his next, a high-budget actioner with director Atlee. The film was announced on April "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/safety-mock-drills-civil-defence-preparedness-pahalgam-pakistan-jammu-kashmir-2719945-2025-05-05",
      "headline": "Security drill advisory to states for May 7 in event of hostile attack: SourcesAmid escalating tensions between India and Pakistan over last month's Pahalgam terror attack, the Ministry of Home Affairs (MHA) has asked several states to conduct drills for effective civil defence on May 7 (Wednesday), government sources said."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-role-of-sleeper-cells-kashmir-helped-lashkar-terrorists-2719746-2025-05-05",
      "headline": "Locals aided Pahalgam terrorists? Ex-sleeper cell member's big claim on attackIn an interview with India Today, the former sleeper cell operative said locals were likely consulted a month ago and everything was planned in advance before the attack in Pahalgam."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-prime-minister-modi-office-appointment-cbi-director-2719937-2025-05-05",
      "headline": "Rahul Gandhi at PM's Office for meeting to appoint next CBI DirectorAn appointment committee, headed by the Prime Minister, comprises of the leader of the opposition in Lok Sabha and the Chief Justice of India will select the next CBI Director."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/terrorists-killed-her-husband-captain-vinay-narwal-himanshi-pahalgam-terror-attack-toxic-trolls-attempt-character-2719807-2025-05-05",
      "headline": "Terrorists killed her husband, toxic trolls attempt character assassinationAfter losing her husband in the Pahalgam terror attack, Himanshi Narwal became the face of the tragedy. However, her appeal for peace soon made her the target of vicious online trolls. She is facing a tirade of sexist, hateful attacks, revealing how deep-rooted misogyny is unleashed when women speak up."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/caste-census-time-to-accept-reality-and-tone-down-the-hysteria-2719772-2025-05-05",
      "headline": "Caste census: Time to accept reality and tone down the hysteriaOn April 30, the Narendra Modi regime announced that a caste tally will be a part of the much-delayed 2021 Census. It is high time India conducted a scientific, statistically robust and credible nationwide census of castes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pahalgam-terror-attack-pak-army-chief-asim-munir-warning-india-diplomatic-military-strikes-2719853-2025-05-05",
      "headline": "Pak Army chief's swift response warning to India's 'military misadventure'As tensions flare over the Pahalgam terror attack, Pakistan Army chief General Asim Munir has warned that his country will give a \"swift and notched-up response\" to India's \"military misadventure\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pak-cyber-attack-hack-defence-websites-personnel-info-compromised-indian-army-pahalgam-2719856-2025-05-05",
      "headline": "Pak cyber groups' hack attempt at defence sites, personnel info compromisedPakistani-based cyber attackers attempted to target Indian defence websites, with personal information and login credentials of defence personnel possibly being compromised, the Indian Army said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mohammed-shami-death-threat-indian-cricket-team-2719915-2025-05-05",
      "headline": "IPL 2025: India pacer Mohammed Shami receives death threat on emailMohammed Shami has received a death threat via email, his brother revealed to India Today on Monday, May 5. Shami received the message on Sunday and probe into the matter has already begun. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/magnesium-supplements-doctor-wellness-industry-insomnia-sleep-bones-health-benefits-2717924-2025-05-05",
      "headline": "Magnesium is the new star of supplements. Do you really need it?Magnesium supplements have suddenly exploded into the market, with dozens of influencer-backed companies promising everything from 'glowy skin' to 'increased productivity' to 'a better night's sleep.'\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/amazon-indias-great-summer-sale-2025-is-here-transform-your-garden-with-upto-60-off-on-lawn-garden-essentials-2718704-2025-05-02",
      "headline": "Amazon India's Great Summer Sale 2025 is here: Transform your garden with upto 60% off on lawn & garden essentialsMake your Garden and Lawn summer ready with Amazon India's Great Summer Sale 2025 that is live now. Enjoy Up to 60% off on Lawn & Garden Essentials such as Plants, Solar Lights and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-live-pm-meets-defence-secretary-as-india-prepares-action-plan-against-pak-2719725-2025-05-05",
      "headline": "Live: Back-to-back meetings planned at PMO to gauge action against Pak: SourcesPahalgam Attack Live Updates: Prime Minister Narendra Modi on Monday met Defence Secretary Rajesh Kumar Singh as India prepares an action plan against Pakistan following the Pahalgaam terror attack in which 26 people died. He earlier met Air Chief Marshal AP Singh amid escalating tensions between India and Pakistan. His interaction with AP Singh came less than 24 hours after a separate meeting between the Prime Minister and Admiral Dinesh K Tripathi, the Chief of the Naval Staff. The Prime Minister had also met Army Chief General Upendra Dwivedi last week. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/putin-accepts-invitation-to-visit-india-russia-ties-external-influence-2719822-2025-05-05",
      "headline": "Putin to visit India, tells PM 'Pahalgam attackers must be brought to justice'Russian President Vladimir Putin has accepted PM Modi's invitation to visit India, Kremlin said on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/caste-census-nationwide-decadal-pm-modi-vp-singh-janata-party-mandal-commission-backfire-self-immolation-bjp-2719524-2025-05-05",
      "headline": "Tumble after Mandal: How VP Singh's caste gambit cost him PM's chairThe PM Narendra Modi-led Centre has decided to enumerate castes in the upcoming population Census. It was VP Singh, as the Prime Minister, who took the biggest bet on caste on the national stage, implementing the Mandal Commission report in 1990, hoping to gain from it. However, it triggered a series of deadly protests across India, and led to a downslide in his political fortunes."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pakistan-man-caught-rajasthan-border-bsf-gurdaspur-punjab-india-pak-border-2719864-2025-05-05",
      "headline": "Pak national trying to enter India through Punjab border arrestedA Pakistani national was arrested by the BSF in Punjab's Gurdaspur for allegedly attempting to infiltrate the border, amid rising India-Pakistan tensions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nirmala-sitharaman-meets-asian-development-bank-president-demands-fund-cut-to-pakistan-pahalgam-terror-attack-2719808-2025-05-05",
      "headline": "India aims at financial strikes, pushes ADB to curb funding to Pak: SourcesIndia is seeking a reduction in international funding to Pakistan following the Pahalgam terror attack, accusing Islamabad of supporting terror financing and fostering cross-border terrorism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/sonu-nigam-clarification-after-fir-kannada-songs-at-bengaluru-concert-2719820-2025-05-05",
      "headline": "Tell me who's at fault: Sonu Nigam responds to case over Bengaluru concert remarksPlayback singer Sonu Nigam issued a clarification after a case was registered against him for his 'provocative' remarks in Bengaluru. The singer claimed that he was threatened by a group of boys to sing in Kannada."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/environment/story/how-dust-from-africas-sahara-desert-is-wreaking-havoc-in-europe-2719888-2025-05-05",
      "headline": "How dust from Africa's Sahara Desert is wreaking havoc in EuropeOnce aloft, these particles scatter and absorb sunlight, diminish surface irradiance, and even encourage cloud formation-all of which degrade the performance of solar panels."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-vice-captain-india-vs-england-2719819-2025-05-05",
      "headline": "No Jasprit Bumrah? 3 vice-captaincy options for India on England tourJasprit Bumrah may not be picked as vice-captain for India's five-match Test series against England later this year. But India can look up to other options to take charge.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/escalation-in-tensions-with-india-would-likely-weigh-on-pakistans-growth-moodys-2719827-2025-05-05",
      "headline": "Escalation in tensions with India would weigh on Pakistan's growth: Moody'sGlobal rating agency Moody's said on Monday that a sustained escalation in tensions with India would likely weigh on Pakistan's growth."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bahadur-shah-zafar-heir-sultana-begum-red-fort-possession-supreme-court-2719914-2025-05-05",
      "headline": "Never asked for Red Fort, only his rightful home: Mughal emperor's heir on pleaThe Supreme Court has dismissed Sultana Begum's plea seeking possession of the Red Fort on account of allegedly being the legal heir of Bahadur Shah Zafar, the last ruler of the Mughal dynasty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/world-tallest-and-smallest-dogs-meet-up-for-a-cute-playdate-in-idaho-falls-2719900-2025-05-05",
      "headline": "World's tallest and smallest dogs meet up for a cute playdate in Idaho FallsReginald, a 7-year-old Great Dane from Idaho, and Pearl, a chihuahua from Florida, are both certified winners in their respective height titles by Guinness World Records."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pahalgam-terror-attack-pakistan-online-disinformation-campaign-sikh-soldiers-khalistanis-join-in-2719891-2025-05-05",
      "headline": "Pak launches disinformation campaign targeting Sikh soldiers, Khalistanis join inSince India announced a series of diplomatic measures against Pakistan over the Pahalgam terror attack, hundreds of Pakistani social media accounts have been circulating concocted stories about developments within the Indian Army."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-begins-work-on-2-hydropower-projects-in-kashmir-blindsides-pak-report-2719680-2025-05-05",
      "headline": "India snubs Pak, begins work on 2 hydropower projects in Kashmir: ReportIndia did not inform Pakistan about the work at the Salal and Baglihar projects, which is being done for the first time since they were built, as the Indus Waters Treaty had blocked such work, sources said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/indians-leave-their-children-us-borders-heres-why-illegal-immigration-canada-mexico-cross-ice-donald-trump-2718611-2025-05-05",
      "headline": "Why Indians abandoning their children at US border is on Trump's radarThousands of parents, including those from India, leave their children on the US-Mexico or US-Canada border in the hope that they will be taken in and granted American citizenship. This risky act might no longer remain a ticket to citizenship as Trump's Immigration and Customs Enforcement (ICE) is cracking down on this route."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mohamed-shami-injury-recovery-poor-form-2719942-2025-05-05",
      "headline": "Mohammed Shami on injury recovery, quiet IPL 2025: Focused on giving my bestMohammed Shami said he has moved past his injury struggles and is fully focused on delivering for Sunrisers Hyderabad, as they chase a crucial playoff spot in the final stretch of IPL 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-dc-live-score-hyderabad-playoffs-qualification-2719941-2025-05-05",
      "headline": "SRH vs DC Live: Delhi Capitals and SunRisers look to remain in playoffs raceIPL 2025, SunRisers Hyderabad (SRH) vs Delhi Capitals (DC) live cricket score and updates: Delhi Capitals are looking shaky after having begun the season on a high. Can they revive their playoffs hopes in Hyderabad? SunRisers, meanwhile, need nothing less than a win to keep their hopes alive. There's plenty to play for today at the Uppal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mohammed-shami-death-threat-indian-cricket-team-2719915-2025-05-05",
      "headline": "IPL 2025: India pacer Mohammed Shami receives death threat on emailMohammed Shami has received a death threat via email, his brother revealed to India Today on Monday, May 5. Shami received the message on Sunday and probe into the matter has already begun. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-not-enjoying-cricket-under-price-and-captaincy-pressure-adam-gilchrist-2719903-2025-05-05",
      "headline": "Pant not enjoying cricket, under price and captaincy pressure: Adam GilchristLegendary Australia wicketkepeer batter Adam Gilchrist feels Rishabh Pant isn't being seen at his jovial best in the ongoing Indian Premier League 2025 (IPL 2025), and is missing the spark."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gujarat-titans-kagiso-rabada-ban-over-south-africa-2719889-2025-05-05",
      "headline": "IPL 2025: GT pacer Kagiso Rabada's ban over, can resume playing immediatelyKagiso Rabada's ban for a failed drug test is over and he can immediately resume playing. Rabada is expected to make his return for GT in the coming days in IPL. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/lsg-showed-desperation-to-get-mayank-yadav-back-hes-not-ready-yet-ambati-rayudu-2719886-2025-05-05",
      "headline": "LSG showed desperation to get Mayank Yadav back, he's not ready yet: Ambati RayuduFormer India cricketer turned commentator Ambati Rayudu feels Lucknow Super Giants (LSG) rushed Mayank Yadav back into action in the ongoing Indian Premier League 2025 (IPL 2025)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-sign-urvil-patel-injury-replacement-vansh-bedi-2719885-2025-05-05",
      "headline": "CSK sign Urvil Patel, India's fastest T20 centurion, as injury replacementIPL 2025: Chennai Super Kings signed 26-year-old Gujarat wicketkeeper-batter Urvil Patel as injury replacement for Vansh Bedi on Monday. Urvil had hit a 28-ball hundred in a Syed Mushtaq Ali Trophy match last year. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gujarat-titans-kagiso-rabada-failed-drug-test-tim-paine-2719876-2025-05-05",
      "headline": "Kagiso Rabada drug test fail: Tim Paine slams lack of transparency around issueTim Paine has slammed the secrecy around Kagiso Rabada's drug test failure and how the pacer was silently allowed to head home to South Africa to serve out his ban. Rabada revealed that he had consumed a recreational drug and was serving a provisional suspension. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-garteth-southgate-love-for-cricket-rr-vs-dc-kapil-dev-2719867-2025-05-05",
      "headline": "Gareth Southgate relives love for cricket in IPL 2025: Used to watch Kapil DevFormer England manager Gareth Southgate, draped in Royals' pink, embraced Jaipur's IPL buzz, reminisced about Kapil and Gavaskar, and praised Rahul Dravid's coaching model—likening it to elite football setups he once helmed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/prabhsimran-singhs-father-battling-with-kidney-failure-only-smiles-when-son-plays-2719846-2025-05-05",
      "headline": "Prabhsimran Singh's father battling with kidney failure, only smiles when son batsPunjab Kings' (PBKS) batter Prabhsimran Singh's rich form in the ongoing Indian Premier League 2025 is serving as the only ray of happiness for his  ailing father suffering from kidney failure. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/liverpool-confirm-trent-alexander-arnold-exit-free-agent-real-madrid-transfer-2719826-2025-05-05",
      "headline": "Liverpool confirm Trent Alexander-Arnold exit amidst Real Madrid interestTrent Alexander-Arnold thanked Liverpool fans as his move away from Anfield was confirmed, with Real Madrid links intensifying ahead of what promises to be a new chapter for the England star in Spain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-sign-urvil-patel-injury-replacement-vansh-bedi-2719885-2025-05-05",
      "headline": "CSK sign Urvil Patel, India's fastest T20 centurion, as injury replacementIPL 2025: Chennai Super Kings signed 26-year-old Gujarat wicketkeeper-batter Urvil Patel as injury replacement for Vansh Bedi on Monday. Urvil had hit a 28-ball hundred in a Syed Mushtaq Ali Trophy match last year. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gujarat-titans-kagiso-rabada-failed-drug-test-tim-paine-2719876-2025-05-05",
      "headline": "Kagiso Rabada drug test fail: Tim Paine slams lack of transparency around issueTim Paine has slammed the secrecy around Kagiso Rabada's drug test failure and how the pacer was silently allowed to head home to South Africa to serve out his ban. Rabada revealed that he had consumed a recreational drug and was serving a provisional suspension. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-garteth-southgate-love-for-cricket-rr-vs-dc-kapil-dev-2719867-2025-05-05",
      "headline": "Gareth Southgate relives love for cricket in IPL 2025: Used to watch Kapil DevFormer England manager Gareth Southgate, draped in Royals' pink, embraced Jaipur's IPL buzz, reminisced about Kapil and Gavaskar, and praised Rahul Dravid's coaching model—likening it to elite football setups he once helmed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/prabhsimran-singhs-father-battling-with-kidney-failure-only-smiles-when-son-plays-2719846-2025-05-05",
      "headline": "Prabhsimran Singh's father battling with kidney failure, only smiles when son batsPunjab Kings' (PBKS) batter Prabhsimran Singh's rich form in the ongoing Indian Premier League 2025 is serving as the only ray of happiness for his  ailing father suffering from kidney failure. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/liverpool-confirm-trent-alexander-arnold-exit-free-agent-real-madrid-transfer-2719826-2025-05-05",
      "headline": "Liverpool confirm Trent Alexander-Arnold exit amidst Real Madrid interestTrent Alexander-Arnold thanked Liverpool fans as his move away from Anfield was confirmed, with Real Madrid links intensifying ahead of what promises to be a new chapter for the England star in Spain."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}