{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-bounce-back-from-days-low-to-close-flat-it-stocks-lead-recovery-2681781-2025-02-18",
      "headline": "Sensex, Nifty bounce back from day's low to close flat; IT stocks lead recoveryThe S&P BSE Sensex lost 29.47 points to close at 75,967.39, while the NSE Nifty50 was down by 14.20 points to end at 22,945.30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/want-to-save-taxes-try-these-5-last-minute-investment-options-to-maximise-benefits-2681746-2025-02-18",
      "headline": "Want to save taxes? Try these 5 last-minute investment options to maximise benefitsThe Equity-Linked Savings Scheme (ELSS) is a popular tax-saving tool available under Section 80C, offering a lock-in period of three years. Under this, investments up to Rs 1.5 lakh are eligible for deductions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/sugar-gets-costlier-prices-rise-65-percent-in-a-month-as-output-dips-sugar-mill-shutdown-2681770-2025-02-18",
      "headline": "Sugar gets costlier: Prices rise 6.5% in a month as output dipsSugar price hike: A drop in sugar output, caused by adverse weather and the reopening of sugar exports after two years, has led to a supply shortage, pushing up prices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-will-taxpayers-with-late-itr-filings-lose-refunds-2681693-2025-02-18",
      "headline": "New Income Tax Bill: Will taxpayers with late ITR filings lose refunds?Late ITR filing refund concern: The Income Tax Act, 1961, does not prevent taxpayers from claiming a refund just because the return was filed after the deadline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/licious-ipo-usd-2-billion-backed-by-temasek-public-listing-2026-profitability-report-2681690-2025-02-18",
      "headline": "Licious, backed by Temasek, preps for massive $2 billion IPO: Report Delightful Gourmet Pvt, the parent company of Licious, is expanding its physical store network and improving delivery times to compete with quick-commerce rivals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-correction-smallcap-space-bloodbath-what-should-investors-do-2681686-2025-02-18",
      "headline": "Smallcap stocks are bleeding. What should investors do?Smallcap stocks have been battered by the persistent selling by foreign institutional investors (FIIs). A dismal Q3 earnings season has only worsened the situation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indian-overseas-bank-iob-rolls-out-aadhaar-based-account-opening-check-details-2681655-2025-02-18",
      "headline": "Indian Overseas Bank rolls out Aadhaar-based account opening. Check detailsThis new initiative allows customers to open savings bank accounts online with minimal documentation, as per Reserve Bank of India's eKYC guidelines. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-weakness-continues-sensex-nifty-down-again-3-things-to-know-2681648-2025-02-18",
      "headline": "Sensex, Nifty tumble again as volatility grips Dalal Street. 3 things to knowStock Market Today, 18 Feb 2025: Dalal Street remains under pressure with no immediate relief in sight. Here are some key points investors should know. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-eyes-india-entry-for-third-time-why-ev-giants-last-two-attempts-failed-2681614-2025-02-18",
      "headline": "Tesla eyes India entry for third time. Why EV giant's last two attempts failedTesla in India: Tesla has made two previous attempts to enter the Indian market, both of which ended in failure.  Here's a look at the reasons behind its past setbacks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-begins-hiring-in-india-here-is-the-list-of-job-openings-and-locations-elon-musk-pm-modi-meeting-2681601-2025-02-18",
      "headline": "Tesla begins hiring in India: Here's the list of job openings and locationsTesla India hiring: Tesla has posted 13 job openings on its LinkedIn page, covering both customer-facing and back-end roles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-lower-despite-it-stock-gains-metal-banking-drag-2681589-2025-02-18",
      "headline": "Sensex, Nifty open lower despite IT stock gains; metal, banking dragShare Market: The S&P BSE Sensex lost 105.42 points to 75,891.44, while the NSE Nifty50 was down by 57.15 points to 22,902.35 as of 9:30 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-begins-hiring-in-india-planning-entry-ev-carmaker-after-pm-modi-recent-us-trip-elon-musk-2681581-2025-02-18",
      "headline": "Tesla hints at India entry with jobs post days after PM Modi meets Elon MuskTesla has begun hiring in India and has posted several job openings. This comes shortly after Tesla CEO Elon Musk met with Prime Minister Narendra Modi during his recent visit to the US."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/k-drama-2025-when-life-gives-you-tangerine-to-wife-of-a-21st-century-prince-full-list-from-kakao-entertainment-2681749-2025-02-18",
      "headline": "K-slate 2025: When Life Gives You Tangerine to Wife of a 21st Century PrinceKakao Entertainment is set to make 2025 a landmark year for K-dramas and films, with a rich array of releases across various genres. From gripping thrillers to heartwarming romances, the lineup promises stellar performances and captivating stories."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dabba-cartel-trailer-netflix-shabana-azmi-jyotika-gajraj-rao-2681735-2025-02-18",
      "headline": "Dabba Cartel trailer: Shabana Azmi, Jyotika promise an addictive showThe trailer for Netflix's Dabba Cartel unveils a gripping crime drama about five women whose dabba business unexpectedly plunges them into the dangerous world of a drug cartel."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kim-sae-rons-father-blames-youtuber-for-death-co-star-won-bin-breaks-down-at-funeral-2681684-2025-02-18",
      "headline": "Kim Sae-ron's father blames YouTuber for death, co-star Won Bin breaks downSouth Korean actor Kim Sae-ron's father spoke out at her funeral, held a day after her death, highlighting the emotional distress she suffered due to a YouTuber's videos. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/karan-singh-grover-back-on-tv-5-years-after-kasautii-zindagii-kay-report-2681666-2025-02-18",
      "headline": "Karan Singh Grover back on TV 5 years after Kasautii Zindagii Kay: ReportActor Karan Singh Grover might just be a part of a romantic show very soon. He is reported to be seen alongside Helly Shah in this new TV show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/linkin-park-singer-chester-benningtons-child-comes-out-as-transgender-2681663-2025-02-18",
      "headline": "Late Linkin Park singer Chester Bennington's child comes out as transgenderLinkin Park singer Chester Bennington's child, Draven, has come out as transgender. The artiste shared the news on her social media handle, while stating her preferred pronouns in a small note. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/amit-trivedi-global-artists-ed-sheeran-dua-lipa-coldplay-india-purely-business-exclusive-2680888-2025-02-18",
      "headline": "Amit Trivedi: Global artists performing in India is nothing but pure businessIndia has become a hotspot for global artists to perform, drawing big names like Coldplay, Ed Sheeran, and Dua Lipa. Music composer Amit Trivedi believes their choice is driven by business interests, as they seek lucrative opportunities in the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bridgerton-4-first-look-benedict-sophies-love-story-takes-centre-stage-2681436-2025-02-17",
      "headline": "Bridgerton 4 first look: Benedict-Sophie's love story takes centre stageThe fourth season of Bridgerton is set to spotlight Benedict Bridgerton's romance with Sophie Baek. New characters like Katie Leung's Lady Araminta Gun will add intrigue to the season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/legends-of-shiva-amish-tripathi-get-real-about-lord-shiva-in-discovery-show-2681343-2025-02-17",
      "headline": "Legends of Shiva: Amish Tripathi gets real about Lord Shiva in his latest showAuthor and producer Amish Tripathi returns as host of Legends of Shiva with Amish, a new show on Discovery Channel, exploring Lord Shiva beyond myths. Unveiled at the New Delhi Book Fair, it promises a deep dive into mythology coinciding with Maha Kumbh 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/amortage-review-jisoos-album-shakes-things-up-like-an-earthquake-2681277-2025-02-17",
      "headline": "Amortage review: Jisoo's album shakes things up like an 'earthquake'Jisoo's new EP, Amortage, released on February 14, 2025, marks her evolution as a solo artist. The EP blends pop and R&B to explore love's many facets, featuring English tracks and her own songwriting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bhabiji-writer-manoj-santoshi-battles-cancer-shilpa-shinde-takes-care-of-him-2681295-2025-02-17",
      "headline": "Bhabiji writer Manoj Santoshi battles cancer, Shilpa Shinde takes care of himActor Kavita Kaushik made an emotional post on social media, highlighting screenwriter Manoj Santoshi's struggle with liver cancer. She also mentioned actor Shilpa Shinde and thanked her for taking care of him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-witch-review-park-jinyoung-roh-jeong-eui-shine-in-slow-burning-psychological-mystery-2681258-2025-02-17",
      "headline": "The Witch review: Jinyoung, Jeong-eui shine in slow-burning psychological mysteryReleased-Sat Feb 15, 2025The Witch review: The Witch, a new K-drama starring Jinyoung and Jeong-eui, captivates with its psychological mystery and slow-burning narrative. The series, based on a popular webtoon, blends mystery, romance, and suspense, leaving viewers intrigued by the enigmatic characters and their complex interactions, says our review. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rashami-desai-on-love-hate-bond-with-sidharth-shukla-we-would-communicate-through-eyes-2681270-2025-02-17",
      "headline": "Rashami Desai on love-hate bond with Sidharth Shukla: We'd communicate through eyesActor Rashami Desai, who had worked with the late Sidharth Shukla on 'Dil Se Dil Tak' and 'Bigg Boss 13', was reminded of her relationship with him on comedian Bharti Singh's podcast. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maha-kumbh-has-become-mrityu-kumbh-mamata-banerjees-big-attack-on-yogi-government-2681772-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Maha Kumbh has turned 'mrityu kumbh': Mamata Banerjee attacks Yogi governmentMamata Banerjee slammed UP Chief Minister Yogi Adityanath over the conduct of Mahakumbh in Prayagraj, calling it 'Mrityu Kumbh' over recent stampede deaths."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/russia-ukraine-war-vladimir-putin-ready-to-talk-zelenskyy-kremlin-trump-2681771-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Putin ready to talk to Zelenskyy 'if necessary', says KremlinKremlin spokesperson Dmitry Peskov stated that on the issue of the war in Ukraine, Putin was ready to negotiate with Zelenskyy, if necessary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-ranveer-allahbadia-relief-arrest-fir-obscene-jokes-case-indias-got-latent-passport-strong-remarks-2681645-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Supreme Court shields Ranveer Allahbadia from arrest, says no shows for nowThe Supreme Court granted relief to YouTuber Ranveer Allahbadia from being arrested over his obscene joke on 'India's Got Latent' show, but rapped him over his remarks, saying his \"perverted mind made the entire society feel ashamed\"."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-dissent-note-midnight-decision-modi-amit-shah-appoint-chief-election-commissioner-2681715-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Disrespectful: Rahul Gandhi's dissent on 'midnight' move to pick poll body chiefRahul Gandhi, who was part of the panel to pick the chief election commissioner, said the government's hasty move was disrespectful and discourteous."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/ranveer-allahbadias-lawyer-abhinav-chandrachud-indias-got-latent-show-supreme-court-2681764-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "I am disgusted, says Ranveer Allahbadia's lawyer Abhinav Chandrachud. Who is he?Ranveer Allahbadia's lawyer Abhinav Chandrachud, while representing him in the Supreme Court, said he was \"personally disgusted\" by the obscene joke on 'India's Got Latent' show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-notice-centre-view-regulating-obscene-content-youtube-misuse-ranveer-allahbadia-2681689-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Need to do something: Top court notice to Centre over obscene content on YouTubeNoting that YouTubers were misusing the lack of regulation of obscene content on YouTube, the Supreme Court issued notice to Centre and called for regulation of vulgar content amid Ranveer Allahbadia's 'India's Got Latent' row."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/javelin-india-vs-pakistan-neeraj-chopra-interview-2681806-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "IND vs PAK is a great thing for javelin: Neeraj on rivalry with Arshad NadeemNeeraj Chopra is glad that India vs Pakistan rivalry in javelin is taking the sport to different heights alltogther. Neeraj and Arshad shared two spots in the Paris Olympics podium in 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/what-ranveer-allahbadia-did-after-making-crass-joke-audience-member-reveals-2681751-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "What did Ranveer Allahbadia do after making crass joke? 'Audience member' revealsIn a now-viral video, a Mumbai-based man, who claimed to be a member of the audience present during the shoot of the particular episode of the show, revealed what Ranveer Allahbadia did after he made the crass joke. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/not-just-railways-others-might-be-to-blame-for-new-delhi-railway-station-stampede-rpf-grp-delhi-police-special-train-2681708-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Not just Railways, others too might be at fault for New Delhi stampedeThe Railways did miss red flags in the recent New Delhi Railway Station stampede in which 18 people were killed. But is it the only agency that is to be blamed for failing to prevent the tragedy or is there a bigger question of intelligence failure and local police inaction? How far is the Railways enabled, technically and manpower-wise, to prevent such tragedies?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/odisha-kiit-nepali-student-suicide-viral-video-suspends-hostel-officials-comments-protest-row-2681673-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Nepal student suicide row: Odisha university suspends 3 staffers for commentsPrakriti Lamsal, a BTech student, was found dead in her hostel room at KIIT on Sunday, triggering protests by the over 500 Nepali students on the campus. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/up-school-reinstates-war-hero-abdul-hamids-name-at-entrance-after-backlash-2681798-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "UP school reinstates 1965 war hero Abdul Hamid's name at entrance after backlashAuthorities in Ghazipur reinstated war hero Abdul Hamid's name at a school entrance after protests by his family. The name was removed during repainting, sparking criticism. Akhilesh Yadav condemned the BJP government over the issue.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/h-1b-visa-backlash-look-at-other-us-work-visa-options-l-1-h-2a-h-2b-h-3-immigration-trump-regulations-2681265-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Amid H-1B visa backlash, a look at other US work visa optionsThe H-1B visa remains the most popular choice among American work visas for Indians. However, the H-1B visa system is facing scrutiny after Donald Trump's return as the US President. Here are the lesser-known work visa categories, like H-2A, H-2B, H-3, L, O, P, Q, and R visas, that offer opportunities to work in the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bihar-men-maha-kumbh-boat-ride-video-viral-beat-traffic-spend-rs-20000-journey-cost-2681722-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Watch: Bihar men take boat ride to Maha Kumbh to beat traffic. They spent...The group set out for their pilgrimage from Bihar's Buxar after witnessing the overwhelming traffic on roads and overcrowding on trains from February 8-9. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/telangana/story/telangana-government-eases-work-hours-for-muslim-employees-during-ramzan-bjp-calls-it-appeasement-2681730-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Telangana eases work hours for Muslims during Ramzan, BJP slams 'appeasement'The Telangana government's move to allow Muslim employees leave early during Ramzan has sparked controversy, with BJP leaders accusing the government of appeasement politics and calling for equal treatment for all religious groups."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-ukraine-rare-earth-minerals-zelenskyy-ukraine-war-vladimir-putin-russia-peace-negotiations-2681622-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump's $500 billion Ukraine payback exceeds German war reparations: ReportThe US has offered a USD 500 billion deal for war-hit Ukraine, allowing it to have exclusive access to the European country's rare earth minerals, oil and gas production, and its ports and other-related infrastructure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/seven-coimbatore-college-students-arrested-for-sexually-assaulting-minor-opposition-slam-dmk-2681736-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "7 Tamil Nadu students arrested for minor's sexual assault, Opposition slams DMKSeven college students in Tamil Nadu's Coimbatore were arrested under Pocso Act for sexually assaulting a 17-year-old girl. Opposition, including AIADMK and BJP, slammed the ruling DMK for the deteriorating law and order in the state."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/deepseek-to-meet-tiktoks-fate-why-countries-are-banning-the-chatgpt-challenger-2681634-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "DeepSeek to meet TikTok's fate? Why countries are banning the ChatGPT challengerThe data privacy and security concerns raised over DeepSeek use and the ban that followed in South Korea and other countries echoes the fate that TikTok, another Chinese app, met in several countries. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/salman-khan-sikandar-new-poster-out-2681748-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Salman Khan's eyes do the talking in new Sikandar posterSalman Khan's Sikandar releases on Eid 2025. The film's shoot is completed, and a new poster has fans excited. Directed by AR Murugadoss, it also stars Rashmika Mandanna and Kajal Aggarwal."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-india-family-travel-dubai-matches-2681723-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "BCCI allows families to attend one match in Dubai, prior permission neededThe Indian cricket board has allowed families and partners of cricketers to watch one match of the Champions Trophy 2025. However, the players will need to inform the BCCI and seek permission from them prior to the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indias-got-latent-row-supreme-court-to-hear-ranveer-allahbadias-plea-today-2681583-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Vomited dirt in his mind: Supreme Court roasts Ranveer Allahbadia over jokeThe Supreme Court pulled up Ranveer Allahbadia while hearing his plea over FIRs filed against him in connection with the row over an obscene joke on India Got Latent show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/the-growing-craze-for-mahurat-deliveries-in-india-2681549-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Born at the 'right' time: The growing craze for Mahurat Deliveries in IndiaMahurat delivery craze in India: More and more people are opting for Mahurat Deliveries, believing that in an uncertain world, they can influence their baby's fate and ensure an 'auspicious', 'blessed' future."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/hyderabad/story/police-arrest-two-telangana-students-for-high-speed-stunts-on-hyderabad-outer-ring-road-2681657-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Two students use Fortuner, BMW to do 'donuts' on Hyderabad road, arrestedThe police arrested two students for performing reckless stunts in a BMW SUV and a Toyota Fortuner on Hyderabad's Outer Ring Road. The two were taken into custody after CCTV footage helped the police track them down. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-begins-hiring-in-india-planning-entry-ev-carmaker-after-pm-modi-recent-us-trip-elon-musk-2681581-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Tesla hints at India entry with jobs post days after PM Modi meets Elon MuskTesla has begun hiring in India and has posted several job openings. This comes shortly after Tesla CEO Elon Musk met with Prime Minister Narendra Modi during his recent visit to the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/bhool-chuk-maaf-rajkummar-rao-returns-to-entertain-on-loop-with-his-desi-swag-2681716-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bhool Chuk Maaf: Rajkummar Rao returns to entertain on loop with his Desi swagActors Rajkummar Rao and Wamiqa Gabbi appear in a romantic comedy, titled 'Bhool Chuk Maaf', exploring a 'time loop' theme. The makers released the teaser of the film on Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/salman-khan-wraps-sikandar-shoot-film-gears-up-for-eid-release-2681786-2025-02-18",
      "headline": "Salman Khan wraps Sikandar shoot, film gears up for Eid releaseBollywood superstar Salman Khan has completed the shoot of his highly-anticipated movie, Sikandar, which also features Rashmika Mandanna and Kajal Aggarwal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/taapsee-pannu-in-subhash-ghai-aitraaz-2-here-is-what-we-know-exclusive-2681773-2025-02-18",
      "headline": "Exclusive: Taapsee Pannu in Subhash Ghai's Aitraaz 2? Here's what we knowActor Taapsee Pannu might have just agreed to lead 'Aitraaz 2', which is being produced by Subhash Ghai and directed by Amit Rai of 'OMG 2' fame. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/actor-amrita-singh-buys-rs-18-crore-luxury-apartment-in-juhu-2681775-2025-02-18",
      "headline": "Actor Amrita Singh buys luxury apartment worth Rs 18 crore in JuhuBollywood icon Amrita Singh has purchased a premium residential property in Mumbai's elite Juhu area, worth Rs 18 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/salman-khan-sikandar-new-poster-out-2681748-2025-02-18",
      "headline": "Salman Khan's eyes do the talking in new Sikandar posterSalman Khan's Sikandar releases on Eid 2025. The film's shoot is completed, and a new poster has fans excited. Directed by AR Murugadoss, it also stars Rashmika Mandanna and Kajal Aggarwal."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/javelin-india-vs-pakistan-neeraj-chopra-interview-2681806-2025-02-18",
      "headline": "IND vs PAK is a great thing for javelin: Neeraj on rivalry with Arshad NadeemNeeraj Chopra is glad that India vs Pakistan rivalry in javelin is taking the sport to different heights alltogther. Neeraj and Arshad shared two spots in the Paris Olympics podium in 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-babar-azam-mohammad-rizwan-pakistan-opening-2681793-2025-02-18",
      "headline": "Babar Azam is the right man to open in Champions Trophy: Rizwan Champions Trophy 2025: Mohammad Rizwan said that Babar Azam would open the batting in the mega event. Babar has only 88 runs to his name as an ODI opener at an average of 17.60. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-bcci-tax-exemption-case-bombay-hight-court-2681754-2025-02-18",
      "headline": "Bombay High Court rules in favour of BCCI in Tax Exemption CaseThe Bombay High Court has quashed an Income Tax Department advisory questioning BCCI's tax-exempt status, ruling that any decision regarding its exemption must follow due statutory process rather than relying on non-statutory communication from tax authorities."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-india-family-travel-dubai-matches-2681723-2025-02-18",
      "headline": "BCCI allows families to attend one match in Dubai, prior permission neededThe Indian cricket board has allowed families and partners of cricketers to watch one match of the Champions Trophy 2025. However, the players will need to inform the BCCI and seek permission from them prior to the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-laliga-barcelona-vs-rayo-controversy-penalty-var-2681703-2025-02-18",
      "headline": "Flick defends VAR after Barcelona return to top of LaLiga with controversial winFC Barcelona regained the lead in LaLiga with a controversial 1-0 win over Rayo Vallecano. Barcelona coach reacted to a contensious decision by VAR which helped Barcelona sneak a win and wipe out their point-difference against bitter rivals Real Madrid."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-history-all-editions-mini-world-cup-journey-champions-list-2681700-2025-02-18",
      "headline": "Champions Trophy history: 8 editions, 7 champions in Mini World Cup's wild journeyChampions Trophy 2025: No other tournament in cricket history has faced as many threats of being scrapped, but the Champions Trophy has survived multiple deliberations to return to the ICC calendar after an eight-year gap -- the longest between two editions of the ODI tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/neeraj-chopra-javelin-groin-injury-jan-zelezney-2681679-2025-02-18",
      "headline": "Mission 90m is on: Neeraj Chopra on how legend Zelezny is moulding his techniqueDouble Olympic medallist Neeraj Chopra is working with his new coach Jan Zelezny. The legendary former javelin star has been working on correcting Neeraj's technique post the Paris Olympics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-new-zealand-lockie-ferguson-ruled-out-kyle-jamieson-replacement-2681674-2025-02-18",
      "headline": "Champions Trophy: New Zealand name Jamieson as Lockie Ferguson's replacementChampions Trophy 2025: New Zealand suffered another setback as Lockie Ferguson was ruled out of the Champions Trophy due to injury, with Kyle Jamieson named as his replacement. The Black Caps now await further updates on Rachin Ravindra's fitness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-rohit-sharma-icc-tournaments-photoshoot-ravindra-jadeja-shubman-gill-2681658-2025-02-18",
      "headline": "Watch: Rohit featured in his 17th ICC photoshoot, wows Jadeja and GillIndia captain Rohit Sharma stunned teammates Ravindra Jadeja and Shubman Gill as he recalled his 17 ICC tournament appearances ahead of the Champions Trophy, highlighting his immense experience and impressive record in global events."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-morne-morkel-father-death-2681626-2025-02-18",
      "headline": "India bowling coach Morne Morkel returns home due to family emergencyChampions Trophy: India bowling coach Morne Morkel has rushed out of Dubai due to a family emergency. Morkel left for South Africa after his father Albert passed away. Morkel was expected to play a crucial part in guiding India's bowling attack in the absence of Jasprit Bumrah."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-bid-olympics-2036-commonwealth-games-2681615-2025-02-18",
      "headline": "Hosting CWG would be a stepping stone for India's Olympic Dream: CGF CEO SadlierCommonwealth Games Federation CEO Katie Sadleir has said that hosting the CWG 2030 would be the right step in India's hope of hosting the Olympics. India have formally submitted the bid for the 2036 Games and hope to host the event across multiple cities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/neeraj-chopra-javelin-groin-injury-jan-zelezney-2681679-2025-02-18",
      "headline": "Mission 90m is on: Neeraj Chopra on how legend Zelezny is moulding his techniqueDouble Olympic medallist Neeraj Chopra is working with his new coach Jan Zelezny. The legendary former javelin star has been working on correcting Neeraj's technique post the Paris Olympics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-new-zealand-lockie-ferguson-ruled-out-kyle-jamieson-replacement-2681674-2025-02-18",
      "headline": "Champions Trophy: New Zealand name Jamieson as Lockie Ferguson's replacementChampions Trophy 2025: New Zealand suffered another setback as Lockie Ferguson was ruled out of the Champions Trophy due to injury, with Kyle Jamieson named as his replacement. The Black Caps now await further updates on Rachin Ravindra's fitness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-rohit-sharma-icc-tournaments-photoshoot-ravindra-jadeja-shubman-gill-2681658-2025-02-18",
      "headline": "Watch: Rohit featured in his 17th ICC photoshoot, wows Jadeja and GillIndia captain Rohit Sharma stunned teammates Ravindra Jadeja and Shubman Gill as he recalled his 17 ICC tournament appearances ahead of the Champions Trophy, highlighting his immense experience and impressive record in global events."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-morne-morkel-father-death-2681626-2025-02-18",
      "headline": "India bowling coach Morne Morkel returns home due to family emergencyChampions Trophy: India bowling coach Morne Morkel has rushed out of Dubai due to a family emergency. Morkel left for South Africa after his father Albert passed away. Morkel was expected to play a crucial part in guiding India's bowling attack in the absence of Jasprit Bumrah."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-bid-olympics-2036-commonwealth-games-2681615-2025-02-18",
      "headline": "Hosting CWG would be a stepping stone for India's Olympic Dream: CGF CEO SadlierCommonwealth Games Federation CEO Katie Sadleir has said that hosting the CWG 2030 would be the right step in India's hope of hosting the Olympics. India have formally submitted the bid for the 2036 Games and hope to host the event across multiple cities."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}