{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indian-economy-growth-us-tariffs-downside-risk-cea-v-anantha-nageswaran-2779002-2025-08-29",
      "headline": "Economy to grow 6.3-6.8% in FY26, US tariffs pose downside risk: GovernmentChief Economic Advisor V Anantha Nageswaran said that high tariffs are expected to be \"short-lived\" as both countries are in talks for the removal of the 25 per cent penal tariff and a subsequent bilateral trade deal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jo-hai-thama-sa-chal-niklega-vijay-shekhar-sharma-at-paytm-agm-2778822-2025-08-29",
      "headline": "Jo Hai Thama Sa, Chal Niklega: Vijay Shekhar Sharma at Paytm AGMPaytm's AGM today began not with data or charts, but with Vijay Shekhar Sharma reciting a Hindi poem by Anand Ji from Varanasi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-rs-10000-expansion-lucknow-airport-cargo-capacity-modernising-terminal-3-2778816-2025-08-29",
      "headline": "Adani Airports to invest Rs 10,000 crore in Lucknow expansionThe investment will be made in phases and will focus on increasing capacity, modernising facilities, adopting new technology, and improving cargo infrastructure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-gdp-growth-accelerates-to-78-in-q1fy26-beats-estimates-2778774-2025-08-29",
      "headline": "India's GDP growth accelerates to 7.8% in Q1 FY26, beats estimatesThe latest GDP data shows that India's economy started the financial year 2025-26 on a strong note, with overall GDP growth ahead of expectations amid global headwinds. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/reliance-agm-why-shares-dropped-over-2-despite-jio-ipo-buzz-and-ai-push-2778755-2025-08-29",
      "headline": "Reliance AGM: Why shares dropped over 2% despite Jio IPO buzz and AI pushAddressing shareholders, Mukesh Ambani promised that Jio has the potential to deliver value comparable to global leaders and called the IPO an \"attractive opportunity\" for investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-teams-up-with-meta-to-bring-enterprise-ai-solutions-to-india-2778751-2025-08-29",
      "headline": "Reliance teams up with Meta to bring enterprise AI solutions to IndiaThe joint venture will create AI platforms and tools based on Meta's open-source Llama models. These will be designed to help businesses improve efficiency across areas like customer service, sales, IT operations, finance, and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-271-points-lower-nifty-below-24500-ril-shares-down-2-percent-2778743-2025-08-29",
      "headline": "Sensex closes 271 points lower, Nifty below 24,500; RIL down 2%The S&P BSE Sensex was down 270.92 points to close at 79,809.65, while the NSE Nifty lost 74.05 points to end at 24,426.85. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jio-ipo-likely-to-make-dalal-street-debut-by-1st-half-of-2026-2778717-2025-08-29",
      "headline": "Jio IPO likely to make Dalal Street debut by 1st half of 2026Jio IPO: The announcement was made by Reliance Chairman Mukesh Ambani in his address to investors at the conglomerate's 48th Annual General Meeting (AGM)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rupee-falls-to-all-time-low-of-8797-amid-us-tariff-concerns-2778695-2025-08-29",
      "headline": "Rupee falls to all-time low of 87.97 amid US tariff concernsA weaker rupee against the yuan could offer a partial cushion for exporters hit by US tariffs, making Indian products relatively cheaper compared to Chinese rivals. It could also help narrow India's trade deficit with China."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/reliance-agm-jio-ipo-retail-public-listing-mukesh-ambani-time-ril-shares-brokerage-view-2778670-2025-08-29",
      "headline": "Reliance AGM 2025: Will Mukesh Ambani announce Jio IPO?The main talking point at the Reliance AGM will be information about the much-awaited initial public offerings (IPOs) of Jio Platforms and Reliance Retail finally get a timeline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sanjeev-sanyal-hints-at-major-overhaul-in-epfo-with-30-rollout-2778669-2025-08-29",
      "headline": "Sanjeev Sanyal hints at major overhaul in EPFO with 3.0 rolloutEconomist Sanjeev Sanyal has signalled that the Employees' Provident Fund Organisation (EPFO) is gearing up for a major transformation, with the much-awaited EPFO 3.0 promising faster, simpler, and more digital-first services."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/trumps-50-percent-tariffs-could-cost-india-usd-55-60-billion-warns-jefferies-global-head-of-equity-strategy-chris-wood-2778657-2025-08-29",
      "headline": "Trump's draconian tariffs may cost India $55-60 billion, warns Jefferies' Chris WoodChris Wood argues that the US tariffs are as much political as economic. He links the steep duties to Donald Trump's \"personal pique\" at being denied a role in resolving India-Pakistan tensions after their four-day conflict in May."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/metro-in-dino-ott-release-when-and-where-to-watch-anurag-basu-love-story-2778881-2025-08-29",
      "headline": "Metro In Dino OTT release: When and where to watch Anurag Basu's love storyDirector Anurag Basu's 'Metro…In Dino' (2025) is now streaming on Netflix India from August 29. The film is a spiritual sequel to his 2007 romantic-dramedy 'Life...In A Metro'."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bhojpuri-superstar-pawan-singh-backlash-touching-co-star-anjali-raghav-waist-2778826-2025-08-29",
      "headline": "Bhojpuri star Pawan Singh inappropriately touches co-star at event, faces backlashBhojpuri star Pawan Singh is trending for all the wrong reasons after a video shows him touching co-star Anjali Raghav without consent during a promotional event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/chiranjeevi-fan-cycles-300-km-to-meet-him-actor-promises-support-for-her-children-2778848-2025-08-29",
      "headline": "Chiranjeevi fan cycles 300 km to meet him, actor promises support for her childrenA woman named Rajeshwari pedalled all the way from Andhra Pradesh to Hyderabad to meet her idol, Chiranjeevi. The fan travelled 312 kilometres from Adoni to meet the star. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/ryan-reynolds-instagram-misses-blake-lively-posts-split-rumours-swirl-2778725-2025-08-29",
      "headline": "Ryan Reynolds' Instagram misses Blake Lively posts, split rumours swirlFans are speculating that Ryan Reynolds may have archived photos of Blake Lively on Instagram after failing to post for her birthday, further fuelling rumours about the state of their marriage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/shodha-review-a-mediocre-thriller-with-an-engaging-case-let-down-by-a-flat-resolution-2778850-2025-08-29",
      "headline": "Shodha review: Intriguing case overshadowed by lacklustre resolutionRelease Date:Fri Aug 29, 2025Shodha Kannada series review: Starring Pawan Kumar, Siri Ravikumar and Arun Sagar in the lead, 'Shodha' presents a case set in Madikeri, Karnataka where a family deals with trust issues and mistaken identities. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/odum-kuthira-chadum-kuthira-review-fahadh-faasil-film-is-an-absurd-comedy-that-is-painfully-unfunny-2778831-2025-08-29",
      "headline": "Odum Kuthira Chadum Kuthira review: Fahadh Faasil in painfully unfunny comedyRelease Date:Fri Aug 29, 2025Odum Kuthira Chadum Kuthira movie review: Director Althaf Salim's romantic comedy, starring Fahadh Faasil and Kalyani Priyadardhan, is an absurd romantic comedy that struggles to find its footing. Surprisingly, even Fahadh Faasil isn't able to elevate it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/amaal-mallik-recalls-ex-partner-calling-him-on-her-wedding-day-on-bigg-boss-19-2778811-2025-08-29",
      "headline": "Amaal Mallik recalls ex-partner calling him on her wedding day on Bigg Boss 19Amaal Mallik shared on 'Bigg Boss 19' how his ex-girlfriend called him on her wedding day, but he refused to go out of respect for his parents."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/jimin-song-da-eun-saga-exposes-toxic-fan-culture-why-idols-in-love-are-punished-2778750-2025-08-29",
      "headline": "Jimin-Song Da-eun saga exposes toxic fan culture: Why idols in love are punishedBTS Jimin and Song Da-eun dating rumours sparked backlash among fans. In this week's K-fix, we will dive deep inside K-pop's toxic fan culture - no dating rules, and why idols keep apologising for falling in love."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/tu-pehli-tu-aakhri-shah-rukh-khan-new-the-bads-of-bollywood-track-as-his-favourite-2778806-2025-08-29",
      "headline": "Tu Pehli Tu Aakhri: SRK calls new The Ba***ds of Bollywood track his favouriteShah Rukh Khan expressed his fondness for the new track 'Tu Pehli Tu Aakhri' from 'The Ba***ds of Bollywood'. The series will premiere on September 18 on Netflix. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/george-clooney-venice-film-festival-jay-kelly-premiere-standing-ovation-adam-sandler-2778704-2025-08-29",
      "headline": "George Clooney, Adam Sandler's Jay Kelly gets standing ovation at Venice premiereActor George Clooney braved a sinus infection and rain for the premiere of Jay Kelly at Venice International Film Festival. His co-star Adam Sandler was also present at the screening as the movie received a standing ovation from the audience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/do-you-wanna-partner-trailer-tammanaah-diana-run-beer-start-up-in-quirky-dramedy-2778745-2025-08-29",
      "headline": "Do You Wanna Partner trailer: Tamannaah, Diana run beer start-up in quirky dramedyThe trailer for the comedy-drama 'Do You Wanna Partner', featuring actors Tamannaah Bhatia and Diana Penty, was released on August 29. The series highlights female friendship and entrepreneurship in a male-dominated society."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/param-sundari-movie-review-sidharth-malhotra-janhvi-kapoor-can-sell-kerala-trips-not-love-2778728-2025-08-29",
      "headline": "Param Sundari review: Sidharth-Janhvi can sell Kerala trips, not loveRelease Date:Fri Aug 29, 2025'Param Sundari' review: Tushar Jalota's romantic comedy starring Sidharth Malhotra and Janhvi Kapoor delivers stunning Kerala visuals and good music, but lacks chemistry and a compelling story. Yet another predictable and forgettable Bollywood love story. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/zeenat-aman-meets-sabyasachi-mukherjee-at-taj-hotel-mumbai-2778710-2025-08-29",
      "headline": "Zeenat Aman admits she once failed to recognise SabyasachiVeteran actor Zeenat Aman shares a nostalgic encounter with designer Sabyasachi Mukherjee at Mumbai's Taj hotel. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kaun-banega-crorepati-17-amitabh-bachchan-welcomes-isro-scientist-haripriya-saketpuram-who-quit-game-at-rs-25-lakh-can-you-answer-2778697-2025-08-29",
      "headline": "KBC 17: Isro scientist fails to answer Rs 25 lakh question. Can you?In the latest episode of 'Kaun Banega Crorepati', Amitabh Bachchan welcomed Isro scientist to the hot seat, who quit the game at Rs 25 lakh. Can you answer the answer? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/rocky-anthony-ippolito-to-play-young-sylvester-stallone-in-biopic-amazon-mgm-2778647-2025-08-29",
      "headline": "Anthony Ippolito to portray young Sylvester Stallone in biopic I Play RockyActor Anthony Ippolito is set to take on the role of young Sylvester Stallone in 'I Play Rocky'. The film reveals the true underdog story behind the making of the iconic 'Rocky' movie and Stallone's relentless pursuit of his dream."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/param-sundari-x-reviews-sidharth-malhotra-janhvi-kapoor-shine-weak-second-half-2778680-2025-08-29",
      "headline": "Param Sundari X reviews: Sidharth-Janhvi shine in a film with weak second halfActors Sidharth Malhotra and Janhvi Kapoor's 'Param Sundari' opens to mixed reactions. Audiences praise the chemistry, but criticise the predictable second half.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-amaal-mallik-accuses-awez-darbar-nagma-mirajkar-gauahar-khan-reacts-2778651-2025-08-29",
      "headline": "Bigg Boss 19: Gauahar reacts after Amaal says Awez-Nagma get work because of himBigg Boss 19 heats up as Amaal Mallik accuses Awez Darbar and Nagma Mirajkar of taking no stand inside the house. Gauahar Khan defends the couple."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/parag-tyagi-marks-ganesh-chaturthi-shefali-jariwala-memory-fulfills-her-wish-2778659-2025-08-29",
      "headline": "Parag Tyagi marks Ganesh Chaturthi in Shefali Jariwala's memory, fulfills her wishParag Tyagi celebrated Ganesh Chaturthi in memory of Shefali Jariwala. He shared a video along with a heartfelt note while remembering his wife. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bosco-martis-credit-for-janhvi-kapoor-chuttamale-choreographer-needs-to-be-celebrated-as-much-as-a-star-2778627-2025-08-29",
      "headline": "Bosco Martis demands equal credit for choreographers after Chuttamalle's successChoreographer Bosco Martis has voiced his concerns about inadequate recognition for his work on the hit song 'Chuttamalle' from the Telugu film Devara Part 1.  He called for equal respect and visibility for choreographers alongside stars and music directors in the Indian film industry."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/all-tariffs-are-still-in-effect-trump-blasts-court-verdict-defends-trade-policy-glbs-2779031-2025-08-30",
      "headline": "US court junks Trump tariffs as illegal, but he won't relent just yetPresident Trump slammed a US appeals court ruling against his tariffs, calling it \"incorrect.\" He said tariffs remain in place, warning their removal would \"destroy America,\" and vowed to fight at the Supreme Court."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jammu-kashmir-flash-floods-dead-killed-ramban-rain-rescue-ops-houses-washed-2779055-2025-08-30",
      "headline": "3 dead, 4 missing after cloudburst in J&K's Ramban; house washed awayA week of pounding rain has battered Jammu and Kashmir, leaving highways cut off, villages marooned, and hundreds stranded, with fresh flash floods in Ramban district. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-narendra-modi-shigeru-ishiba-japan-visit-updates-bullet-train-ride-2779060-2025-08-30",
      "headline": "PM Modi meets Governors in Tokyo, rides bullet train with Japanese PM Ishiba  Live UpdatesPrime Minister Narendra Modi and his Japanese counterpart, Shigeru Ishiba, travelled from Tokyo to Sendai by bullet train on Saturday, marking the final leg of his two-day visit to Japan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/jolly-llb-3-case-the-irony-of-a-courtroom-comedy-standing-trial-in-a-real-court-2778854-2025-08-30",
      "headline": "Jolly LLB 3 case: The irony of a courtroom comedy standing trial in a real courtJolly LLB 3, starring superstar Akshay Kumar and Arshad Warsi, is facing legal challenges even before its much-awaited September 19 release. Several lawyers and bar associations have filed Public Interest Litigations (PILs), alleging that the film mocks the judiciary and disrespects the legal profession."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/hockey-india-dilip-tirkey-rajgir-northeast-fih-events-2779022-2025-08-30",
      "headline": "From Rajgir to North East: Hockey India's mission to take the game all overHockey India's mission is to take the game all over the country, with Rajgir being one of the early steps. Over the past few years, the federation has taken steps to bring hockey to revive interest in areas where the sport still finds a lot of love. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indian-economy-growth-us-tariffs-downside-risk-cea-v-anantha-nageswaran-2779002-2025-08-29",
      "headline": "Economy to grow 6.3-6.8% in FY26, US tariffs pose downside risk: GovernmentChief Economic Advisor V Anantha Nageswaran said that high tariffs are expected to be \"short-lived\" as both countries are in talks for the removal of the 25 per cent penal tariff and a subsequent bilateral trade deal."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/kerala/story/kerala-canara-bank-manager-bars-beef-in-its-canteens-employees-hold-beef-protest-against-ban-in-kochi-2779001-2025-08-29",
      "headline": "Bank manager in Kochi bans beef in canteen, staff did this nextBank employees protested outside Canara Bank's Kochi office by serving beef to oppose an alleged beef ban imposed by the regional manager. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/american-brand-in-the-toilet-jake-sullivan-slams-trumps-tariffs-on-india-glbs-2779012-2025-08-30",
      "headline": "American brand is in the toilet: Ex-US security advisor on tariffs on IndiaFormer US NSA Jake Sullivan criticised Trump's heavy tariffs on India, saying they damage US-India ties, undermine America's global standing, and push New Delhi closer to China. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/photo-essay/hindu-deities-and-sanskrit-traditions-live-on-in-japans-cultural-fabric-304-29-08-2025",
      "headline": "Sanskrit and Hindu Deities in JapanAncient ties between India and Japan remain deeply rooted, with Hindu deities, Sanskrit traditions, and cultural practices continuing to thrive in Japanese life, faith, and daily expressions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shraddha-tiwari-resurfaces-claims-marriage-police-sceptical-indore-investigation-2779040-2025-08-30",
      "headline": "Indore student runs away from home to marry boyfriend, returns wedded to anotherDuring police questioning, Shraddha revealed that she had originally planned to elope with her boyfriend Sarthak. However, when Sarthak didn't turn up at the railway station, she boarded a train to Ratlam, where she said she got in touch with another lover, Karandeep, an electrician at a college in Indore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/mood-of-the-nation/story/bihar-voter-roll-revision-opinion-mood-of-the-nation-survey-2778955-2025-08-29",
      "headline": "Yes SIR, say 58% on Bihar voter roll revision: Mood of the Nation surveyIndia Today-CVoter Mood of the Nation (MOTN) poll found that 58% of respondents feel that the voter roll revision exercise in Bihar is meant to ensure only citizens vote."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/asaduddin-owaisi-slams-mohan-bhagwats-3-children-remark-2778897-2025-08-29",
      "headline": "Why burden women? Asaduddin Owaisi slams Mohan Bhagwat's '3 children' remarkRSS chief Mohan Bhagwat on Thursday earlier argued that Indian families should have three children to keep the population \"sufficient and under control.\" AIMIM's Asaduddin Owaisi slammed the remark, calling it \"classic doublespeak of the RSS\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/taylor-swift-engagement-ring-impact-diamond-industry-lab-grown-diamonds-2778825-2025-08-30",
      "headline": "Natural vs lab-grown: Can Taylor Swift's ring shift the diamond debate?Taylor Swift's 'rare' old mine brilliant-cut engagement ring comes at a time when lab-grown diamonds are posing a strong challenge to the natural diamond industry. Could her choice swing the trend in quintessential 'Taylor Swift Effect' style?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bhuvneshwari-sreesanth-condemns-lalit-modi-michael-clarke-for-reviving-2008-slap-gate-scandal-2779008-2025-08-30",
      "headline": "Lalit Modi, shame on you: Sreesanth's wife fumes over releasing Harbhajan slap videoBhuvneshwari Sreesanth has criticised Lalit Modi and Michael Clarke for reopening the 2008 slap-gate scandal. The resurfacing of unseen footage has sparked fresh debate and controversy in cricket circles."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/badrinath-national-highway-closed-uttarakhand-boulder-crashes-down-rain-fury-chamoli-2779061-2025-08-30",
      "headline": "Video: Highway closed in Uttarakhand after boulder crashes down amid rain furyAs the rain fury continues in Uttarakhand, Chamoli district witnessed heavy overnight rainfall that blocked the Badrinath National Highway at five locations on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mood-of-the-nation-survey-operation-sindoor-pakistan-donald-trump-ceasefire-2778903-2025-08-29",
      "headline": "Majority rate Op Sindoor as 'strong' response to Pahalgam: MOTN pollAs per the Mood of the Nation (MOTN) survey, 15% of the respondents felt the response to the Pahalgam attack was not adequate and more could have been done to punish Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/bwf-world-championships-satwiksairaj-chirag-shetty-world-championships-aaron-chia-sooh-yik-2779024-2025-08-30",
      "headline": "India's medal streak lives on after Satwik-Chirag's Paris revengeBWF World Championships 2025: Satwiksairaj Rankireddy and Chirag Shetty outclassed familiar rivals Aaron Chia and Soh Wooi Yik with a devastating display of attacking badminton. The Indian duo progressed to the semifinals of men's doubles, assuring India of a medal in the world meet in Paris. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/trending/weekly-quiz-518-29-08-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-wont-be-dictated-vikas-swarup-slams-trump-aide-peter-navarro-on-tariffs-glbs-2779032-2025-08-30",
      "headline": "India won't be dictated to: Vikas Swarup slams Trump aide Peter Navarro on tariffsEx-diplomat Vikas Swarup said India follows strategic autonomy and will not be \"dictated to\" by anyone amid Trump's 50 per cent tariffs and Peter Navarro's accusations of aiding Russia's war in Ukraine. He urged dialogue but warned that US rhetoric was damaging ties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/donald-trump-tariff-india-aide-peter-navarro-post-social-media-sanctions-personal-attack-swami-vivekananda-kanyakumari-2778787-2025-08-29",
      "headline": "Battle against India is personal for Trump, his aide Navarro lets it slipPeter Navarro, President Trump's senior counsellor on trade, has given it away that the record-high tariffs against India are not just over Russian oil or trade. With his language and images in particular, Navarro has revealed that Trump and his cronies are making it personal against PM Modi. The attack is directed at India's civilisational roots."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/how-iits-and-iims-are-pushing-ai-digital-learning-far-beyond-tier-1-cities-2778782-2025-08-29",
      "headline": "How IITs and IIMs are pushing AI, digital learning far beyond Tier-1 citiesIITs and IIMs have taken up the task of narrowing the digital divide in the country. Today, anyone with a smartphone -- even in Tier 2 and 3 cities can access AI learning and tools, thanks to these premier institutes, and other skilling institutions and companies."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/russian-president-vladimir-putin-to-visit-india-in-december-amid-trumps-tariff-war-reports-news-agency-afp-2778964-2025-08-29",
      "headline": "Russian President Vladmir Putin to visit India in December: ReportRussian President Vladimir Putin will visit India in December at the invitation of Prime Minister Narendra Modi, even as New Delhi faces tariff threats from Donald Trump over its ties with Moscow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/parliamentary-affairs-minister-kiren-rijiju-bill-remove-arrested-leaders-most-reformative-law-against-graft-2779003-2025-08-30",
      "headline": "Most reformative law against graft: Kiren Rijiju on bill to remove arrested leadersLast week, the government introduced three bills in the Lok Sabha under which the Prime Minister, chief ministers and other leaders could be removed if they have been arrested for 30 consecutive days under serious charges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/mood-of-the-nation/story/most-popular-chief-minister-yogi-adityanath-mood-of-the-nation-survey-2778970-2025-08-29",
      "headline": "Yogi Adityanath retains top spot as most popular Chief Minister: MOTN surveyIndia Today-CVoter Mood of the Nation opinion poll found that Yogi Adityanath's nationwide appeal continues unabated, with the BJP leader being picked as the most popular Chief Minister."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhav-suryavanshi-kabaddi-pkl-season-12-opener-visakhapatnam-2779056-2025-08-30",
      "headline": "IPL sensation Vaibhav Suryavanshi embraces kabaddi at PKL 12Teen cricket prodigy Vaibhav Suryavanshi swapped cricket whites for the kabaddi mat as he attended the grand opening of Pro Kabaddi League Season 12 in Visakhapatnam. The 14-year-old IPL sensation joined icons like Pullela Gopichand, Dhanraj Pillay, and Pardeep Narwal to kickstart a night of nostalgia, drama, and new milestones in India's premier kabaddi league.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2025-carlos-alcaraz-opens-up-on-possible-knee-injury-2779054-2025-08-30",
      "headline": "Carlos Alcaraz opens up on possible knee injury after US Open 3rd round clashCarlos Alcaraz cruised past Luciano Darderi at the US Open despite needing a knee massage mid-match. The Spaniard called it a precaution and says he isn't worried, as he moved into the fourth round with a dominant straight-sets win.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2025-novak-djokovic-aryna-sabalenka-4th-round-krejcikova-stuns-navarro-2779053-2025-08-30",
      "headline": "US Open: Djokovic, Sabalenka march into 4th round, Krejcikova stuns NavarroNovak Djokovic battled through back pain to advance to the fourth round of the US Open, demonstrating his resilience and experience. In the women's draw, world No. 1 Aryna Sabalenka exacted revenge on Leylah Fernandez with a straight-sets victory, underlining her strong form at Flushing Meadows. Meanwhile, Barbora Krejčíková recovered from a first-set deficit to defeat Emma Navarro 4-6, 6-4, 6-4."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/ben-shelton-injury-retires-frances-tiafoe-exits-taylor-fritz-us-open-2779043-2025-08-30",
      "headline": "Ben Shelton retires from US Open after shoulder injuryBen Shelton retired from the US Open due to a shoulder injury, ending his run in the third round. Frances Tiafoe also exited early, leaving Taylor Fritz as the last American hope, intensifying the pressure on him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/hockey-india-dilip-tirkey-rajgir-northeast-fih-events-2779022-2025-08-30",
      "headline": "From Rajgir to North East: Hockey India's mission to take the game all overHockey India's mission is to take the game all over the country, with Rajgir being one of the early steps. Over the past few years, the federation has taken steps to bring hockey to revive interest in areas where the sport still finds a lot of love. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/bwf-world-championships-satwiksairaj-chirag-shetty-world-championships-aaron-chia-sooh-yik-2779024-2025-08-30",
      "headline": "India's medal streak lives on after Satwik-Chirag's Paris revengeBWF World Championships 2025: Satwiksairaj Rankireddy and Chirag Shetty outclassed familiar rivals Aaron Chia and Soh Wooi Yik with a devastating display of attacking badminton. The Indian duo progressed to the semifinals of men's doubles, assuring India of a medal in the world meet in Paris. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/marketa-vondrousova-beats-jasmine-paolini-pegula-wins-victoria-azarenka-us-open-2025-2779019-2025-08-30",
      "headline": "Jasmine Paolini stunned in Round 3, Jessica Pegula fights past AzarenkaMarketa Vondrousova defeated Jasmine Paolini to reach the US Open 2025 last 16. Jessica Pegula also secured a straight sets win over Victoria Azarenka, setting up exciting fourth-round clashes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vijay-shankar-tamil-nadu-exit-frustrations-tnca-tripura-2779015-2025-08-30",
      "headline": "Can't sit out and give water: Frustrated Vijay Shankar opens up on Tamil Nadu exitFormer Tamil Nadu skipper Vijay Shankar parted ways with the state association, citing a lack of clarity and frustration of not being part of the team as reasons behind his decision. The batting all-rounder will now play for Tripura in the upcoming domestic season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bhuvneshwari-sreesanth-condemns-lalit-modi-michael-clarke-for-reviving-2008-slap-gate-scandal-2779008-2025-08-30",
      "headline": "Lalit Modi, shame on you: Sreesanth's wife fumes over releasing Harbhajan slap videoBhuvneshwari Sreesanth has criticised Lalit Modi and Michael Clarke for reopening the 2008 slap-gate scandal. The resurfacing of unseen footage has sparked fresh debate and controversy in cricket circles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-asia-cup-preparations-win-afghanistan-39-runs-uae-t20i-tri-series-2779009-2025-08-30",
      "headline": "Pakistan gear up for Asia Cup after easing past Afghanistan in UAE tri-series openerPakistan began their Asia Cup preparations with a confident 39-run victory over Afghanistan in Sharjah. Salman Agha laid the platform with a 53-run knock, after which Haris Rauf picked up four wickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/rummenigge-salary-caps-and-fixture-reductions-save-football-2778992-2025-08-29",
      "headline": "Karl-Heinz Rummenigge defends increased football matches amid rising salariesKarl-Heinz Rummenigge has warned that football risks financial and physical collapse due to soaring player salaries and an overloaded match calendar. He urges football authorities to implement salary caps and reduce fixtures to ensure the sport's sustainability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/marketa-vondrousova-beats-jasmine-paolini-pegula-wins-victoria-azarenka-us-open-2025-2779019-2025-08-30",
      "headline": "Jasmine Paolini stunned in Round 3, Jessica Pegula fights past AzarenkaMarketa Vondrousova defeated Jasmine Paolini to reach the US Open 2025 last 16. Jessica Pegula also secured a straight sets win over Victoria Azarenka, setting up exciting fourth-round clashes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vijay-shankar-tamil-nadu-exit-frustrations-tnca-tripura-2779015-2025-08-30",
      "headline": "Can't sit out and give water: Frustrated Vijay Shankar opens up on Tamil Nadu exitFormer Tamil Nadu skipper Vijay Shankar parted ways with the state association, citing a lack of clarity and frustration of not being part of the team as reasons behind his decision. The batting all-rounder will now play for Tripura in the upcoming domestic season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bhuvneshwari-sreesanth-condemns-lalit-modi-michael-clarke-for-reviving-2008-slap-gate-scandal-2779008-2025-08-30",
      "headline": "Lalit Modi, shame on you: Sreesanth's wife fumes over releasing Harbhajan slap videoBhuvneshwari Sreesanth has criticised Lalit Modi and Michael Clarke for reopening the 2008 slap-gate scandal. The resurfacing of unseen footage has sparked fresh debate and controversy in cricket circles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-asia-cup-preparations-win-afghanistan-39-runs-uae-t20i-tri-series-2779009-2025-08-30",
      "headline": "Pakistan gear up for Asia Cup after easing past Afghanistan in UAE tri-series openerPakistan began their Asia Cup preparations with a confident 39-run victory over Afghanistan in Sharjah. Salman Agha laid the platform with a 53-run knock, after which Haris Rauf picked up four wickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/rummenigge-salary-caps-and-fixture-reductions-save-football-2778992-2025-08-29",
      "headline": "Karl-Heinz Rummenigge defends increased football matches amid rising salariesKarl-Heinz Rummenigge has warned that football risks financial and physical collapse due to soaring player salaries and an overloaded match calendar. He urges football authorities to implement salary caps and reduce fixtures to ensure the sport's sustainability."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}