{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-has-the-income-tax-department-set-up-a-24x7-control-room-in-maharashtra-2840076-2025-12-22",
      "headline": "Why has the Income Tax Department set up a 24x7 control room in Maharashtra?Citizens have been encouraged to share information related to the use of black money, cash distribution, valuables or other forms of inducement used for election campaigning."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gaming-wallet-loads-travel-spends-what-changes-for-icici-credit-card-users-in-2026-2839946-2025-12-22",
      "headline": "Gaming to travel spends: What changes for ICICI credit card users in 2026ICICI Bank credit cards are changing in 2026, reshaping how users spend on gaming, travel and lifestyle purchases as new fees and capped rewards come into play."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-high-rally-it-auto-metal-stocks-future-fed-rate-cut-2839875-2025-12-22",
      "headline": "Sensex ends 638 points higher, Nifty above 26,100; Trent up 4%The S&P BSE Sensex was up 638.12 points to close at 85,567.48, while the NSE Nifty50 added 206 points to end at 26,172.40. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/bank-locker-shortage-in-india-why-getting-a-locker-is-becoming-difficult-2839846-2025-12-22",
      "headline": "Trying to get a bank locker? Here's why you may be turned awayIndia currently has around 60 lakh bank lockers, while demand is projected to rise to nearly 6 crore by 2030, according to industry estimates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/cochin-shipyard-share-price-jumps-over-6-percent-why-is-it-rising-today-2839817-2025-12-22",
      "headline": "Cochin Shipyard share price jumps over 6%. Why is it rising today?The stock was trading around Rs 1,645, up over 6% on the Bombay Stock Exchange at around 2:04 pm, and touched intraday highs above Rs 1,653.50 during the session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/want-safe-returns-this-post-office-scheme-can-earn-you-up-to-rs-2-lakh-in-interest-2839805-2025-12-22",
      "headline": "Want safe returns? This post office scheme can earn you up to Rs 2 lakh in interestSafe investments often mean modest returns, but that is not always the case. With the right amount and tenure, some secure schemes can generate meaningful interest over time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/8th-pay-commission-salary-expectations-pay-hike-expectations-timeline-2839803-2025-12-22",
      "headline": "8th Pay Commission: What next pay hike may look like for government employeesThe 8th Pay Commission signals higher pay, but history suggests patience may be required before revised salaries and arrears actually reach employees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-new-zealand-fta-women-led-trade-deal-zero-duty-exports-services-student-visas-investment-piyush-goyal-explained-2839797-2025-12-22",
      "headline": "First women-led FTA: 3 specialities of India's free trade deal with New ZealandNegotiations for the India–New Zealand Free Trade Agreement were formally launched on March 16, 2025, during discussions between Commerce and Industry Minister Piyush Goyal and New Zealand's Trade and Investment Minister Todd McClay. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/waiting-for-your-income-tax-refund-why-you-may-not-get-interest-despite-the-delay-2839763-2025-12-22",
      "headline": "Waiting for your income tax refund? Why you may not get interest despite the delayWaiting for an income tax refund can be frustrating, especially when the money is stuck for weeks. While the law promises interest on delayed refunds, not every taxpayer is entitled to it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-new-zealand-sign-landmark-free-trade-deal-to-focus-on-innovation-investment-and-shared-opportunities-2839733-2025-12-22",
      "headline": "India, New Zealand sign free trade deal to focus on innovation, investmentThe agreement, described by both sides as ambitious and mutually beneficial, is expected to enhance market access, promote investment flows, strengthen strategic cooperation, and create new opportunities for businesses, farmers, MSMEs, innovators, students and youth across sectors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-price-record-high-key-levels-good-time-to-buy-or-not-2839717-2025-12-22",
      "headline": "Gold hits record high again. Should you buy at these levels?In the domestic market, MCX gold futures are consolidating near lifetime highs around Rs 1,35,400 per 10 grams. Prices continue to hold a rising channel, suggesting strong underlying demand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/explained-why-groww-share-price-gained-today-jefferies-buy-rating-target-price-rs-180-2839709-2025-12-22",
      "headline": "Explained: Why Groww share price gained 6% todayGroww share price: The rally in the stock comes after a strong move last week as well. Groww shares had already risen about 13% on Friday, and Monday marked the third straight session of gains for the stock."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/shriram-finance-share-price-jumps-4-percent-today-why-is-stock-rising-explained-2839700-2025-12-22",
      "headline": "Shriram Finance share price jumps 4% today. Here's why it's gainingThe stock moved higher after global brokerage MUFG raised its target price on Shriram Finance, citing the strong strategic impact of its recent deal and the potential for a re-rating."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/infosys-share-price-why-is-it-rising-today-adrs-explained-2839678-2025-12-22",
      "headline": "Infosys shares rise 3% today. Why is the IT giant's stock price rising?Shares in the Bengaluru-based software services firm were up 2.18% on the Bombay Stock Exchange (BSE) at 10:10 am to trade at Rs 1,674.50, reflecting stronger sentiment after the company addressed market speculation linked to sharp ADR moves last week. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/foxconn-women-led-iphone-plant-hires-30000-staff-in-record-india-hiring-2839669-2025-12-22",
      "headline": "Foxconn's new women-led iPhone plant in India hires 30,000 staff: ReportThe workers receive free accommodation, subsidised meals, and earn an average salary of around Rs 18,000 per month, among the highest for women in blue-collar manufacturing roles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-rising-today-sensex-jumps-500-points-key-reasons-explained-2839656-2025-12-22",
      "headline": "Sensex jumps over 500 points: Why is stock market rising today?The Sensex was trading at 85,434.75, up 505.39 points at 9:31 am, while the NSE Nifty50 rose 166.50 points to 26,132.90."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-372-points-higher-nifty-above-26000-infosys-jumps-3-percent-2839653-2025-12-22",
      "headline": "Sensex opens 372 points higher, Nifty above 26,000; Infosys jumps 3%The S&P BSE Sensex was up 491.74 points to 85,421.10, while the NSE Nifty50 added 157.75 points to 26,124.15 as of 9:29 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-price-today-india-hits-record-high-why-gold-rates-are-rising-us-fed-rate-cuts-safe-haven-demand-2839652-2025-12-22",
      "headline": "Gold surges to record high: Why is it rising again?Gold, which is seen as a safe store of value during uncertain times, has risen 67% so far this year. While gold touched new highs, silver prices moved in the opposite direction in the domestic market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-sensex-nifty-trading-setup-view-today-nse-bse-shares-to-buy-2839637-2025-12-22",
      "headline": "Sensex, Nifty today: Will stock market continue to fall or open higher?Gift Nifty futures were trading at around 26,190 points at 7:52 am IST, pointing to a positive start for the Nifty, compared with Friday's close of 25,966.4. This suggests markets may try to recover after a weak spell."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/reserve-bank-of-india-governor-sanjay-malhotra-india-goldilocks-phase-high-growth-low-inflation-2839522-2025-12-21",
      "headline": "India in goldilocks phase with 8% growth, low inflation: RBI GovernorIn an exclusive interview with India Today, Reserve Bank of India (RBI) Governor Sanjay Malhotra described the Indian economy as being in a 'Goldilocks period' characterised by high GDP growth of 8 per cent and low inflation."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-rowdy-janardhana-1980s-action-drama-december-2026-release-2840106-2025-12-22",
      "headline": "Rowdy Janardhana glimpse: Vijay Deverakonda goes raw and ruthless in his next The first look and title announcement for Vijay Deverakonda's next film has been unveiled. Titled Rowdy Janardhana, the film is set for a December 2026 release across multiple languages."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/the-odyssey-trailer-matt-damon-leads-christopher-nolan-epic-tom-holland-anne-hathaway-homer-2840090-2025-12-22",
      "headline": "The Odyssey trailer: A myth reborn in Christopher Nolan's cinematic universe Universal has revealed the first trailer for Christopher Nolan's adaptation of Homer's classic tale, featuring Matt Damon as Odysseus. The Odyssey promises sweeping visuals, a celebrated ensemble, and a fresh take from the acclaimed director, with the film set for release on July 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/shararat-choreographer-vijay-ganguly-tamannaah-bhatia-was-never-considered-for-dhurandhar-song-2840075-2025-12-22",
      "headline": "Choreographer Vijay Ganguly: Tamannaah was never considered for Dhurandhar song Choreographer Vijay Ganguly has addressed recent reports about Tamannaah Bhatia's supposed rejection from the Shararat song in Dhurandhar, stating she was never considered due to her significant star power and explaining the creative rationale behind the casting decisions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/farrhana-bhatt-recalls-being-targeted-after-shredding-neelam-giri-letter-2840084-2025-12-22",
      "headline": "Farrhana Bhatt recalls being targeted after shredding Neelam Giri's letter Bigg Boss 19 first runner-up Farrhana Bhatt addressed the controversial letter-shredding task on Farah Khan's vlog, saying she stayed calm because she believed her decision was right."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/sivakarthikeyans-parasakthi-release-date-out-to-clash-with-vijays-jana-nayagan-2840063-2025-12-22",
      "headline": "Sivakarthikeyan's Parasakthi release date out, to clash with Vijay's Jana Nayagan Sivakarthikeyan's Parasakthi has finally locked a new release date. The film is set to arrive in theatres this January, setting up a festive box-office clash with Vijay's Jana Nayagan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kiara-advani-on-playing-nadia-in-toxic-my-toughest-one-yet-2840051-2025-12-22",
      "headline": "Kiara Advani on playing Nadia in Toxic: My toughest one yet After her first look in Toxic – A Fairytale for Grown-Ups went viral, Kiara Advani said the role has been the most transformative experience of her career so far."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-shares-gym-pics-before-his-60th-birthday-2840053-2025-12-22",
      "headline": "Salman Khan shares gym pics before his 60th birthday: Wish I could look like this Salman Khan reminded fans of his upcoming 60th birthday by sharing gym photos that showcased his fit physique, leaving admirers convinced he looks decades younger."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahesh-babu-trains-in-kalaripayattu-for-rajamoulis-varanasi-trainer-shares-pic-2840013-2025-12-22",
      "headline": "Mahesh Babu trains in Kalaripayattu for Rajamouli's Varanasi, trainer shares pic As SS Rajamouli gears up for Varanasi, his most ambitious film yet, lead actor Mahesh Babu has begun intense physical preparation, training in the ancient martial art of Kalaripayattu."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hajmola-experience-priyanka-chopra-shares-nick-jonas-funny-first-reaction-great-indian-kapil-show-2839980-2025-12-22",
      "headline": "Priyanka Chopra shares Nick Jonas's hilarious reaction after trying Hajmola Priyanka Chopra recounted her husband Nick Jonas's amusing experience trying Hajmola for the first time, sharing his candid reaction during an appearance on The Great Indian Kapil Show Season 4."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ranveer-singh-dhurandhar-is-2025s-biggest-overseas-hit-beats-rajinikanths-coolie-2839958-2025-12-22",
      "headline": "Ranveer's Dhurandhar is 2025's biggest overseas hit, beats Rajinikanth's Coolie Ranveer Singh's spy action thriller Dhurandhar overtook Rajinikanth's Coolie at the overseas box office, setting new records in 2025 and closing in on all-time global milestones for Indian cinema. The film is close to earning Rs 1000 crore globally. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/nickelodeon-actor-tylor-chase-seen-homeless-on-california-streets-2839982-2025-12-22",
      "headline": "Former Nickelodeon actor Tylor Chase seen homeless on California streets. Video A viral video showing former Ned's Declassified School Survival Guide actor Tylor Chase living on the streets of California has sparked concern among fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/are-harry-styles-zoe-kravitz-engaged-couples-rome-outing-sparks-buzz-2839902-2025-12-22",
      "headline": "Are Harry Styles-Zoe Kravitz engaged? Couple's Rome outing sparks buzz Speculation grows around Harry Styles and Zoe Kravitz's relationship after the actor was seen wearing a gold ring in Rome. The pair continue to spend time together across Europe, with sources suggesting their bond is getting stronger."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shilpa-shetty-joins-akshaye-khanna-fa9la-trend-calls-dhurandhar-a-visionary-film-2839941-2025-12-22",
      "headline": "Shilpa Shetty joins Akshaye Khanna's FA9LA trend, calls Dhurandhar a visionary film Shilpa Shetty praised Dhurandhar and its performances, recreating Akshaye Khanna's viral dance steps while calling it one of the most patriotic films she has seen in years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/babul-supriyos-children-fail-to-get-into-ms-dhonis-ranchi-home-troll-their-father-2839889-2025-12-22",
      "headline": "Babul Supriyo's children fail to get into MS Dhoni's Ranchi home, troll their father Babul Supriyo recounted his daughter Naina and nephew Golu's visit to former Indian cricket captain MS Dhoni's Ranchi farmhouse. He described their creative but unsuccessful efforts to meet the cricketer, and the affection fans have for Dhoni."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/shiva-rajkumar-confirms-bigger-role-in-rajinikanths-jailer-2-with-shoot-starting-soon-2839880-2025-12-22",
      "headline": "Shiva Rajkumar confirms bigger role in Jailer 2, to join shoot this week Kannada actor Shiva Rajkumar shared details about his participation in the highly anticipated Jailer 2, including an extended cameo and his shooting timeline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/chitrangada-singh-on-missed-film-opportunity-with-shah-rukh-khan-2839891-2025-12-22",
      "headline": "Chitrangada Singh on missed film opportunity with SRK: Listened to too many people Chitrangada Singh has spoken about the career-defining films she turned down, including Gangs of Wasseypur, Tanu Weds Manu and a missed opportunity to star opposite Shah Rukh Khan."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-mobbed-hyderabad-event-chinmayi-reacts-calls-better-crowd-control-2839862-2025-12-22",
      "headline": "Chinmayi reacts to Samantha being mobbed at event: Team member likely has bruises Singer Chinmayi Sripada reacted strongly after Samantha Ruth Prabhu was mobbed at a Hyderabad event. The incident highlighted the urgent need for improved crowd management and celebrity safety measures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/real-uzair-baloch-denies-killing-anyone-as-viral-video-surfaces-amid-dhurandhar-buzz-2839815-2025-12-22",
      "headline": "Real Uzair Baloch denies killing anyone as viral video surfaces amid Dhurandhar buzz An old interview featuring Lyari gangster Uzair Baloch resurfaces amid the buzz around Aditya Dhar's Dhurandhar, where he claims he never killed anyone and explains why locals call him a 'don'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/sreenivasan-tribute-by-director-sathyan-anthikad-highlights-malayalam-cinema-legacy-2839802-2025-12-22",
      "headline": "Director Sathyan Anthikad leaves pen, moving note at Sreenivasan's last rites Director Sathyan Anthikad paid tribute to Sreenivasan during his final rites with a special note and a cherished pen, reflecting the deep creative partnership between the two. The final ceremony was held with full state honours."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-temporarily-suspends-visa-services-for-indians-in-a-tit-for-tat-move-amid-tense-bilateral-ties-2840088-2025-12-22",
      "headline": "Bangladesh suspends visa services for Indians in tit-for-tat move amid tense tiesA day after India suspended visa services at the Indian Visa Application Centre (IVAC) in Chattogram, the Bangladesh High Commission said that consular and visa services in New Delhi had been temporarily suspended until further notice due to unavoidable circumstances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/misinformation-being-spread-on-aravalli-mining-govt-taking-ecology-economy-together-says-minister-amid-row-2839903-2025-12-22",
      "headline": "Centre clears stand on Aravalli mining: Taking ecology, economy togetherUnion Minister Bhupender Yadav on Monday said misinformation was being spread about the Supreme Court's decision on the Aravalli range, asserting that the government has consistently promoted the protection of the country's oldest mountain range."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/bangladesh-hindu-man-dipu-chandra-das-lynching-shocking-details-colleagues-handed-him-over-to-islamists-2839729-2025-12-22",
      "headline": "Dipu Chandra Das's colleagues betrayed him, joined Bangladesh Islamist lynch mobJust a timely call could have saved the life of 27-year-old Hindu man Dipu Chandra Das, who was lynched by Islamists in Bangladesh. Investigators and reports have revealed that Das was forced to resign by his factory colleagues and handed over to the mob that broke into the factory to drag him out. He was brutally beaten to death and his body was set on fire."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/kerala/story/are-you-bangladeshi-mob-asks-before-kerala-lynching-dalit-family-seeks-sc-st-act-chhattisgarh-2839704-2025-12-22",
      "headline": "Are you Bangladeshi? Mob in Kerala asked migrant worker before lynching himA video shows a group of men interrogating a migrant labourer about his identity before beating him to death in Kerala's Palakkad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/winter-desert-saudi-arabia-turns-white-nation-snowfall-climate-change-global-warming-global-weather-uae-2839703-2025-12-22",
      "headline": "Why is Saudi Arabia witnessing rare snowfall? Science explainedThe unusual episode once again underlined how climate change is harbouring unusual weather in regions that are far from prepared to handle it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-women-domestic-cricketers-pay-rise-hike-christmas-2840118-2025-12-22",
      "headline": "BCCI announces 2.5x pay hike for domestic women's cricketersThe Indian Cricket Board has given a major pay hike to women's cricketers in the domestic structure. According to the new proposal, women's players will get an appraisal of 2.5 times their current match fees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ranveer-singh-dhurandhar-is-2025s-biggest-overseas-hit-beats-rajinikanths-coolie-2839958-2025-12-22",
      "headline": "Ranveer's Dhurandhar is 2025's biggest overseas hit, beats Rajinikanth's CoolieRanveer Singh's spy action thriller Dhurandhar overtook Rajinikanth's Coolie at the overseas box office, setting new records in 2025 and closing in on all-time global milestones for Indian cinema. The film is close to earning Rs 1000 crore globally. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-news-h-1b-updates-india-visa-interview-delays-leave-indian-professionals-in-the-lurch-immigration-attorneys-2839965-2025-12-22",
      "headline": "Biggest mess, say US attorneys, as H-1B delay grounds hundreds of Indian techiesScores of H-1B visa-holding Indian professionals are finding themselves stranded away from their job sites and families after visiting India for visa renewals. Thousands are stranded because of the abrupt cancellation of visa interviews. American immigration attorneys have called it the \"biggest mess\" they have ever seen. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/aravalli-hills-controversy-explained-supreme-court-definition-political-reactions-activists-ecology-mining-2839750-2025-12-22",
      "headline": "Decoded: The Aravalli Hills controversy and what's at stakeThe Supreme Court introduced a new height-based definition for the Aravalli Hills, triggering widespread concern about ecological risks. Environmentalists and opposition leaders warn this may lead to increased mining and irreversible damage to the region's fragile ecosystem."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-expands-online-vetting-h-1b-h-4-visa-applicants-social-media-scrutiny-processing-delays-likely-us-embassy-india-2839987-2025-12-22",
      "headline": "US reiterates online vetting rule for H-1B, H-4 visa applicants, warns of delaysThe US Embassy in India said the move aims to address abuse of the H-1B programme while allowing companies to hire skilled foreign workers temporarily."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/yogi-adityanath-mocks-akhilesh-rahul-cough-syrup-racket-up-2839837-2025-12-22",
      "headline": "Yogi Adityanath's 'do namune' jab, Akhilesh Yadav turns the taunt aroundAkhilesh Yadav countered Yogi Adityanath's jibe about \"'do namune' sitting in Delhi and Lucknow\" by terming it an own goal that exposed the rift within the BJP."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/indians-in-new-zealand-protest-against-sikh-procession-nagar-kirtan-nanaksar-gurudwara-manurewa-auckland-haka-dance-2839751-2025-12-22",
      "headline": "This isn't India: New Zealand far-right group performs Haka against SikhsA Sikh religious procession in Auckland had to pause when a far-right group blocked it with a Haka display. The Sikhs, including Nihangs, did not react to the protests. Community leaders have expressed concern, noting this was the third big anti-immigrant incident in New Zealand this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hajmola-experience-priyanka-chopra-shares-nick-jonas-funny-first-reaction-great-indian-kapil-show-2839980-2025-12-22",
      "headline": "Priyanka Chopra shares Nick Jonas's hilarious reaction after trying HajmolaPriyanka Chopra recounted her husband Nick Jonas's amusing experience trying Hajmola for the first time, sharing his candid reaction during an appearance on The Great Indian Kapil Show Season 4."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/secret-behind-huge-airport-crowd-for-pakistan-under-19-team-kaaba-imam-masjid-al-haram-deception-madrassa-students-2839936-2025-12-22",
      "headline": "Secret behind huge airport crowd for Pak's U-19 team: Kaaba cleric deception?To bring a crowd to the Islamabad Airport to greet the U-19 Asia Cup winning team, Pakistani authorities apparently lied to them. Madrassa students were told that they would be meeting the Imam of Mecca's Masjid al-Haram but were taken aback when they had to welcome Pakistan's U-19 cricket team instead. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/new-zealand-foreign-minister-winston-peters-oppose-india-trade-pact-issue-on-dairy-immigration-2839975-2025-12-22",
      "headline": "Rushed, low quality deal: New Zealand coalition ally slams FTA with IndiaNew Zealand Foreign Minister Winston Peters said his party was \"regrettably opposed\" to the trade agreement with India, arguing that it makes \"serious concessions\" on immigration and investment while failing to secure meaningful gains for New Zealand's key export sectors, especially dairy."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/nitish-kumar-hijab-controversy-row-samajwadi-party-leader-sumaiya-rana-refuses-pak-tv-interview-over-hijab-row-2839881-2025-12-22",
      "headline": "Niqab row: Politician who filed FIR against Nitish Kumar rejects Pak TV interviewFollowing a row over Bihar Chief Minister Nitish Kumar allegedly pulling down a Muslim woman's niqab, Samajwadi Party leader Sumaiya Rana declined an interview with a Pakistani news channel. She said Indians live in peace and can resolve issues internally, without foreign interference."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/no-workout-no-crash-diets-how-discipline-helped-me-lose-21-kilos-in-10-months-2839725-2025-12-22",
      "headline": "No workout, no crash diets: How discipline helped me lose 21 kilos in 10 monthsI didn't wait for a Monday or a New Year's resolution. I started anyway and lost 21 kilos in 10 months. Here's what worked for me and might help you too."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/indians-in-america-visa-updates-news-why-american-tech-companies-h1b-visa-holders-not-to-leave-us-trump-executive-order-2839772-2025-12-22",
      "headline": "H-1B staffers shouldn't leave US: What's behind Apple, Google, Microsoft email?An increase in the H-1B visa application fee and stricter social media vetting prompted several US tech companies to ask employees to remain in the country or return to the US immediately. The move was triggered by lack of clarity on new provisions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/bangladesh-student-leader-motaleb-shikder-shot-in-head-during-violent-protests-over-osman-hadis-killing-2839782-2025-12-22",
      "headline": "Bangladesh student leader shot in head during violent protests over Hadi's killingThe shooting of NCP labour leader Md Motaleb Sikder follows the killing of student leader Sharif Osman Hadi, whose death sparked protests and heightened concerns over Bangladesh's law and order."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/swiggy-says-bengaluru-user-tipped-rs-68600-hyderabad-buyer-spent-rs-43-lakh-on-iphone-17-in-2025-2839932-2025-12-22",
      "headline": "Swiggy says Bengaluru user tipped Rs 68,600, Hyderabad buyer spent Rs 4.3 lakh on iPhone 17 in 2025From Rs 68,600 tip to delivery boy to Rs 4.3 lakh iPhone carts, Instamart's 2025 data shows India shopping without limits. Here is everything that Swiggy revealed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/gen-z-freelancing-portfolio-careers-gap-years-india-2839745-2025-12-22",
      "headline": "'I don't want a 9-to-5': How Gen Z is rewriting career timelinesGen Z students in India are shifting away from traditional 9-to-5 jobs towards freelancing and portfolio careers. This change highlights a growing emphasis on freedom, mental health, and flexible work models amid institutional challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/the-beckham-feud-david-victoria-brooklyn-and-a-family-soap-in-the-making-2839808-2025-12-22",
      "headline": "Palace fight is passe. Beckham family feud is all the talkThe reported Beckham family feud has unfolded over time and come into the open only recently. Here's a timeline, from wedding tensions and missed birthdays to family dos, which pointed to a growing rift all along."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/culprits-death-term-will-give-us-peace-brother-of-hindu-man-lynched-in-bangladesh-2839842-2025-12-22",
      "headline": "What brother of Hindu man killed in Bangladesh said on blasphemy allegationsIn an Exclusive Interview with India Today, Apu Das, the brother of the Hindu man Dipu Das, who was brutally killed in Bangladesh, has demanded the death penalty for those involved in the killing of his brother. Read this India Today's Exclusive interview ..."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/shararat-choreographer-vijay-ganguly-tamannaah-bhatia-was-never-considered-for-dhurandhar-song-2840075-2025-12-22",
      "headline": "Choreographer Vijay Ganguly: Tamannaah was never considered for Dhurandhar songChoreographer Vijay Ganguly has addressed recent reports about Tamannaah Bhatia's supposed rejection from the Shararat song in Dhurandhar, stating she was never considered due to her significant star power and explaining the creative rationale behind the casting decisions."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/robin-uthappa-shubman-gill-jitesh-sharma-axed-t20-world-cup-2026-2840140-2025-12-22",
      "headline": "Indian cricket is a strange place: Gill's T20 World Cup snub stuns Uthappa Robin Uthappa expressed his disbelief in seeing Shubman Gill being axed from the Indian squad for the T20 World Cup 2026. Gill and Jitesh Sharma were snubbed with Ishan Kishan and Rinku Singh coming into the mix. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/glenn-mcgrath-england-ashes-mentality-australia-0-3-deficit-2840121-2025-12-22",
      "headline": "Is England's winless Ashes run in Australia down to mentality? McGrath reacts Glenn McGrath feels that England's winless run in Australia during Ashes is down to mentality. The Aussies have already blanked England in the first three Tests to regain the Ashes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-women-domestic-cricketers-pay-rise-hike-christmas-2840118-2025-12-22",
      "headline": "BCCI announces 2.5x pay hike for domestic women's cricketers The Indian Cricket Board has given a major pay hike to women's cricketers in the domestic structure. According to the new proposal, women's players will get an appraisal of 2.5 times their current match fees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/kazuyoshi-miura-extends-football-career-fukushima-united-58-defying-retirement-norms-2840083-2025-12-22",
      "headline": "King Kazu lives on: 58-year-old Miura set for 41st season as pro footballer Veteran Japanese striker Kazuyoshi Miura, known as \"King Kazu,\" is reportedly preparing to sign for Fukushima United on loan, marking his 41st year in professional football. Miura's career began in 1986. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/yashasvi-jaiswal-omitted-india-2026-t20-world-cup-squad-2840062-2025-12-22",
      "headline": "Jaiswal should have made it to T20 World Cup squad: Ex-India batter Former cricketer Aakash Chopra feels that Yashasvi Jaiswal should have been picked in the T20 World Cup 2026 squad. Jaiswal continues to be excluded from the format despite showing good form for India. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/video/odisha-athletes-forced-to-travel-near-train-toilets-state-negligence-exposed-ytvd-2840059-2025-12-22",
      "headline": "Odisha Athletes Forced to Travel Near Train Toilets: State Negligence Exposed In a shocking incident of administrative negligence, 18 young athletes from Odisha were forced to travel in inhumane conditions to participate in the National School Wrestling Championship in Uttar Pradesh. The contingent, comprising 10 boys and 8 girls, had to travel in a general coach near the train washrooms in biting cold due to the lack of confirmed tickets. The report highlights the apathy of the State Department, which allegedly failed to make adequate travel arrangements for the budding sportspersons. As per the transcript, the athletes were 'forced to travel, in the biting cold, next to the washroom in the train'. The incident has sparked outrage over the treatment of future sporting heroes."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/video/train-horror-young-athletes-forced-to-travel-near-toilets-miss-match-due-to-unconfirmed-tickets-ytvd-2840056-2025-12-22",
      "headline": "Train Horror: Young Athletes Forced to Travel Near Toilets, Miss Match Due to Unconfirmed Tickets In a shocking account of administrative apathy, an unidentified speaker details the harrowing journey of a group of children traveling for a sports event. The speaker reveals that the young athletes were forced to board trains without confirmed tickets for both legs of their journey. Due to the lack of reserved seating, the children were reportedly crammed with up to five people per seat or forced to sit near the train toilets, referred to as the 'Latin side'. The mismanagement resulted in the team reaching their destination after the match had already concluded. The speaker claims to have video evidence of the ordeal, highlighting the severe negligence regarding the safety and dignity of the young players."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/brendon-mccullum-england-coach-committed-despite-ashes-defeat-2840038-2025-12-22",
      "headline": "Despite Ashes humbling, Brendon McCullum desperate to carry on as England coach Brendon McCullum insists he remains the right man to take England forward despite presiding over another grim chapter in their Ashes history in Australia, but concedes he does not know whether he will still be in charge of the Test side when next summer begins."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/delhi-capitals-jemimah-rodrigues-new-wpl-captain-video-2840022-2025-12-22",
      "headline": "Jemimah Rodrigues as captain? DC keep fans on their toes with suspenseful video Delhi Capitals sparked speculation about naming Jemimah Rodrigues as their new WPL captain after releasing a cryptic teaser video ahead of a December 23 announcement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-ashes-struggles-andrew-strauss-calls-systemic-cricket-reforms-2839993-2025-12-22",
      "headline": "Sacking Stokes, McCullum not the answer: Strauss warns England after Ashes loss Andrew Strauss calls for deeper reforms within England cricket rather than the dismissal of Brendon McCullum and Ben Stokes, as  their struggles in Australia continue. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/michael-vaughan-final-hours-with-father-cancer-battle-tribute-2839990-2025-12-22",
      "headline": "Michael Vaughan's father dies after England great rushes home from Ashes Former England captain Michael Vaughan shared the news of his father's death, revealing how he managed to return home from Australia to spend precious final hours with him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/krishnappa-gowtham-retires-karnataka-all-rounder-14-year-domestic-cricket-career-2839968-2025-12-22",
      "headline": "IPL star and domestic stalwart Krishnappa Gowtham retires from cricketKrishnappa Gowtham has announced his retirement from all forms of cricket, drawing the curtain on a notable career across India's domestic circuit and the IPL."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ishan-kishan-jharkhand-vijay-hazare-trophy-2025-2839978-2025-12-22",
      "headline": "After T20 World Cup selection, Ishan Kishan named Jharkhand's VHT captainAfter the selection for India's T20 World Cup squad, Ishan Kishan will continue leading Jharkhand, this time in the Vijayu Hazare Trophy. Kishan played a vital role in Jharkhand's Syed Mushtaq Ali Trophy win. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indian-women-cricket-team-visits-simhachalam-temple-after-win-sri-lanka-2839929-2025-12-22",
      "headline": "Prayer time: India Women visit Vizag's Lakshmi Narasimha Swamy temple after 1st T20IAfter a dominant eight-wicket win over Sri Lanka in the first Women's T20I, the Indian women's team visited Vizag's Simhachalam temple to seek blessings as they began the series with authority and momentum."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mitchell-starc-icc-uniform-drs-ashes-2025-controversy-2839915-2025-12-22",
      "headline": "After Ashes snicko controversy, Mitchell Starc tells ICC to pay for uniform DRS systemMitchell Starc has called for the ICC to fund for a uniform DRS system in international cricket after controversy erupted during the Ashes 2025 series during the Adelaide Test. The match saw multiple instances where the snicko failed to give the correct decision. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-jemimah-rodrigues-praises-trolls-india-sri-lanka-2839872-2025-12-22",
      "headline": "Crazy biceps: Jemimah Rodrigues subtly hits back at Smriti Mandhana's trollsIND vs SL, 1st Women's T20I: Jemimah Rodrigues congratulated Smriti Mandhana on reaching 4000 T20I runs while subtly responding to trolls commenting on the left-handed batter's appearance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/reporters-diary-of-lionel-messis-india-tour-delhi-leg-2839850-2025-12-22",
      "headline": "Spanish chants, VIP boos and Ronaldo fan jibes: Reporter's diary from Lionel Messi tourThe Delhi leg of Lionel Messi's India tour had it all, from passionate fans to celebrity sightings. Here's a reporter's firsthand account of the third and final instalment of Messi's historic tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-trolls-england-ashes-series-defeat-in-australia-2839834-2025-12-22",
      "headline": "Rohit Sharma joins the Aussies, trolls England after Ashes humiliationRohit Sharma trolled England following their Ashes series loss in Australia. England lost the third Test in Adelaide by 82 runs, which resulted in fourth successive Ashes series loss in Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/paula-badosa-praises-shrivalli-bhamidipaty-india-tennis-rising-star-2839833-2025-12-22",
      "headline": "Paula Badosa identifies India's future tennis star, praises her serve and aggressionSpanish star Paula Badosa praised India's rising tennis talent Shrivalli Bhamidipaty for her powerful serve and aggressive game. Badosa and Bhamidipaty are teammates for AOS Eagles in the World Tennis League. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-under-19-cricket-team-asia-cup-victory-india-celebrated-islamabad-2839826-2025-12-22",
      "headline": "Party in Islamabad as fans celebrate U19 Asia Cup win like World Cup triumphU19 Asia Cup IND vs PAK: Fans in Islamabad braved the winter chill to turn up at the airport early on Monday morning and cheer on the Under-19 Asia Cup-winning team. Pakistan had defeated India in the final in Dubai on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/punjab-kings-cooper-connolly-ipl-2026-debut-maxwell-comparisons-2839828-2025-12-22",
      "headline": "Punjab Kings' Cooper Connolly embraces Glenn Maxwell comparisons with cautionPunjab Kings' recruit Cooper Connolly has welcomed comparisons with Australian all-rounder Glenn Maxwell, calling them a compliment while acknowledging the gap between himself and the world-class star."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/punjab-vijay-hazare-trophy-squad-shubman-gill-abhishek-sharma-arshdeep-singh-2839816-2025-12-22",
      "headline": "Shubman Gill, Abhishek and Arshdeep named in Punjab's Vijay Hazare Trophy squadPunjab announces 18-member squad for the upcoming Vijay Hazare Trophy, featuring big guns Shubman Gill, Abhishek Sharma, and Arshdeep Singh, gearing up for their season opener against Maharashtra on December 24."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yuzvendra-chahal-luxury-car-purchase-absence-parents-2839813-2025-12-22",
      "headline": "Milestone with luxury: Yuzvendra Chahal welcomes brand-new BMW with proud parentsYuzvendra Chahal marked a personal milestone by buying a new luxury BMW car and sharing the moment with his parents, even as illness keeps him sidelined from cricket while he gears up for IPL 2025 with Punjab Kings."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-ashes-defeat-australia-nasser-hussain-bazball-impact-2839795-2025-12-22",
      "headline": "Bazball for nothing? Nasser Hussain questions England branding after Ashes defeatNasser Hussain reckons that despite the Bazball rebranding, England's showing against Australia in the Ashes has ultimately proved \"no different\" from past drubbings away from home."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nz-vs-wi-jacob-duffy-breaks-richard-hadlee-record-new-zealand-west-indies-2839774-2025-12-22",
      "headline": "Jacob Duffy shatters Richard Hadlee's 40-year record after series win vs West IndiesJacob Duffy broke Sir Richard Hadlee's 40-year-old record after New Zealand's win over West Indies in the third Test. Duffy took his third five-wicket haul to guide New Zealand to a 323-run victory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shakib-al-hasan-mi-emirates-ilt20-winning-streak-desert-vipers-2839777-2025-12-22",
      "headline": "Not Finished: MI Emirates' Shakib Al Hasan sinks Desert Vipers in ILT20Shakib Al Hasan starred with bat and ball to power MI Emirates to a four-wicket ILT20 win over Desert Vipers, even as the 38-year-old fuels speculation about a final international return for Bangladesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-autograph-net-bowler-iphone-alibaug-vijay-hazare-trophy-2839759-2025-12-22",
      "headline": "Autograph on iPhone: Virat Kohli makes net bowler's day in Alibaug training sessionA young fast bowler from Jharkhand, who bowled to Virat Kohli during a three-day training session in Alibaug, shared photographs he clicked with the legendary batter. The youngster also posted a picture of his autographed iPhone."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/stuart-broad-backs-worst-australian-side-since-2010-remark-england-ashes-loss-2839754-2025-12-22",
      "headline": "Defiant Broad sticks to 'worst Australian side since 2010' swipe despite Ashes lossStuart Broad has refused to backtrack on his pre-Ashes assessment, insisting he has \"no regrets\" about branding this Australia side the worst since 2010 despite England losing all three completed Tests of the five-match series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aaqib-javed-on-pakistan-learning-from-india-to-revive-their-cricket-2839749-2025-12-22",
      "headline": "Pakistan learning from India? Ex-coach hints at analysing India's success modelPakistan is closely monitoring India's limited-overs cricket success to revive its fortunes. The focus is on grassroots talent and infrastructure ahead of the T20 World Cup 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/bruno-fernandes-injury-blow-hits-manchester-united-premier-league-festive-fixtures-2839735-2025-12-22",
      "headline": "Manchester United dealt major blow as Bruno Fernandes faces extended injury absenceManchester United captain Bruno Fernandes is expected to miss upcoming Premier League fixtures after sustaining a hamstring injury during the defeat to Aston Villa, further compounding the club's injury problems."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-finalises-t20-world-cup-squad-ishan-kishan-return-shubman-gill-omitted-2839718-2025-12-22",
      "headline": "I was shocked: Former captain says he didn't expect India to drop Shubman GillFormer India captain Kris Srikkanth said he didn't expect the selectors to drop Shubman Gill from the T20 World Cup squad. The ex-chairman of selectors gave Ajit Agarkar and his selection team credit for valuing domestic performances.  "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}