{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ms-dhoni-files-for-trademark-of-iconic-nickname-captain-cool-2748422-2025-06-30",
      "headline": "MS Dhoni files for trademark of iconic nickname 'Captain Cool'Over the years, 'Captain Cool' has meant much more than just a catchy title. It sums up Dhoni's calm mind under pressure, from winning India's first T20 World Cup in 2007 to lifting the ODI World Cup in 2011 and the Champions Trophy in 2013. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-450-points-lower-nifty-below-25600-trent-gains-3-2748406-2025-06-30",
      "headline": "Sensex ends 450 points lower, Nifty below 25,600; Trent gains 3%The S&P BSE Sensex fell 452.44 points to close at 83,606.46, while the NSE Nifty50 dropped 120.75 points, ending below the 25,600 mark."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/look-rich-or-be-rich-startup-founder-on-middle-class-dilemma-2748370-2025-06-30",
      "headline": "Look rich or be rich: Startup founder on middle class dilemmaToday, many people in the middle class are busy trying to look rich, rather than actually becoming rich. Costly gadgets, fancy brunches and trendy holidays are often paid for with loans and EMIs, says founder and CEO, Shyam Achuthan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/8-years-of-gst-top-5-achievements-you-should-know-2748325-2025-06-30",
      "headline": "8 years of GST: Top 5 achievements you should knowSince its launch, GST has strengthened India's revenue and expanded the taxpayer base, with collections reaching a record Rs 22.08 lakh crore in 2024–25, as per PIB. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indusind-bank-submits-ceo-shortlist-to-rbi-after-leadership-exits-report-2748281-2025-06-30",
      "headline": "IndusInd Bank submits CEO shortlist to RBI after leadership exits: ReportThe candidates include Rajiv Anand, Rahul Shukla, and Anup Saha — all experienced financial sector leaders. The move comes after the abrupt exits of CEO Sumant Kathpalia and deputy Arun Khurana in April, following a $230 million hit from years of misaccounting in internal derivative trades."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rural-india-holds-steady-as-urban-consumption-slows-finds-equirus-securities-2748257-2025-06-30",
      "headline": "Rural India holds steady as urban consumption slows, finds Equirus SecuritiesThe mood remains subdued overall, but analysts note an undercurrent of recovery in rural pockets, led by fast-moving consumer goods (FMCG), electric mobility and segments of real estate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filing-itr-without-a-ca-5-common-mistakes-that-you-must-avoid-2748218-2025-06-30",
      "headline": "Filing ITR without a CA? 5 common mistakes that you must avoidMany people mix up the financial year and assessment year. For income earned in 2024-25, the assessment year will be 2025-26. Pick this carefully or your return will not be valid."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/trade-deal-between-india-and-us-likely-to-be-announced-before-july-8-pm-modi-donald-trump-2748136-2025-06-30",
      "headline": "Terms agreed and locked, India-US trade deal likely before July 8The much-awaited deal comes just in the nick of time, as Trump's deadline for imposing reciprocal tariffs on countries worldwide ends on July 9. Last week, Trump said his administration was looking to remove all trade barriers, which he called 'unthinkable'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/governments-favourite-baby-investment-banker-on-indias-real-estate-boom-2748193-2025-06-30",
      "headline": "Government's favourite baby: Investment banker on India's real estate boomInvestment banker Sarthak Ahuja says India's real estate sector isn't in a bubble—it's backed by policy, jobs, and demographics, making it a long-term priority for the government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/jb-chemicals-shares-plunged-over-6-percent-today-torrent-pharma-explained-2748183-2025-06-30",
      "headline": "Explained: Why JB Chemicals shares plunged over 6% todayThe market reaction came swiftly after Torrent Pharmaceuticals announced it will acquire a controlling 46.39% stake in JB Pharma from global investment firm KKR, with plans to subsequently merge the two companies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-enterprises-to-raise-rs-1000-crore-via-retail-bonds-2748176-2025-06-30",
      "headline": "Adani Enterprises to raise Rs 1,000 crore via retail bondsThe proposed bonds have been rated AA- by both ICRA and Care Ratings, signalling a relatively stable credit outlook."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/finfluencer-startup-found-akshat-shrivastava-corrupt-real-estate-housing-crisis-middle-class-2748173-2025-06-30",
      "headline": "Most corrupt I've seen: Finfluencer on Indian metro real estate marketFinfluencer Akshat Shrivastava is calling metro real estate a \"financial ruin,\" warning middle-class buyers to stop chasing low-yield properties bankrolled by black money and billionaire hoarders."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shefali-jariwala-death-timeline-fasting-medication-autopsy-forensic-analysis-accidental-2748547-2025-06-30",
      "headline": "Shefali Jariwala's last 24 hours: What went wrong and led to her death?Actor Shefali Jariwala, of 'Kaanta Laga' fame, reportedly died of a heart attack on June 27. Here's a detailed report about the sequence of events, as confirmed by our police sources."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/saanvika-refused-kissing-scene-in-panchayat-season-4-says-script-was-changed-2748562-2025-06-30",
      "headline": "Actor Saanvika refused kissing scene in Panchayat 4, says script was changedActor Saanvika, who plays Rinki in 'Panchayat', shared that she declined a kissing scene in Season 4 due to discomfort and the show's family-friendly appeal. The makers respected her decision and replaced the scene, maintaining the essence of her character without compromising her comfort."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/ram-kapoor-denies-losing-weight-to-get-more-work-says-my-name-is-not-khan-2748564-2025-06-30",
      "headline": "Ram Kapoor denies losing weight to get more work, says my name is not KhanActor Ram Kapoor recently shared that he did not lose weight to get more work offers. He was in a conversation with filmmaker Farah Khan for her YouTube channel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kareena-kapoor-parents-randhir-kapoor-babita-reunion-years-apart-2748508-2025-06-30",
      "headline": "Kareena Kapoor shares her parents' decision to reunite after years apartKareena Kapoor expressed happiness at the decision of her parents, Randhir Kapoor and Babita, to spend their later years together. She said this reunion marks a full-circle moment for her and her sister Karisma. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/project-hail-mary-trailer-ryan-gosling-on-a-space-mission-to-save-the-world-2748565-2025-06-30",
      "headline": "Project Hail Mary trailer: Ryan Gosling is on a space mission to save the worldThe trailer of 'Project Hail Mary' starring Ryan Gosling is out. The film will release in India on March 20, 2026. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sara-ali-khan-aditya-roy-kapur-click-selfies-as-they-enjoy-metro-ride-with-fans-metro-in-dino-2748535-2025-06-30",
      "headline": "Sara Ali Khan, Aditya click selfies as they enjoy metro ride with fans. WatchSara Ali Khan and Aditya Roy Kapur enjoyed a metro ride with fans as they promote their upcoming film 'Metro In Dino.' The film will release in theatres on July 4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/avika-gor-gets-adorable-birthday-wish-from-fiance-milind-herione-of-my-story-2748459-2025-06-30",
      "headline": "Avika Gor's fiance calls her heroine of his story in sweet birthday postOn Avika Gor's 28th birthday, her fiance Milind Chandwani, shared a heartfelt message along with an unseen engagement photo, calling her the \"heroine\" of his story."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/neha-dhupia-takes-vande-bharat-surat-calls-it-a-beautifully-nostalgic-ride-2748503-2025-06-30",
      "headline": "Neha Dhupia takes Vande Bharat to Surat, calls it a beautifully nostalgic rideNeha Dhupia recently took a nostalgic trip on the Vande Bharat Express from Mumbai to Surat. In a vlog, she shared the experience, fondly recalling childhood train journeys with her parents."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/umrao-jaan-revisit-at-44-rekha-artistic-opulence-soulful-cinematic-legacy-2748415-2025-06-30",
      "headline": "Revisiting Umrao Jaan: Why Rekha's musical still resonates with audiences todayDirector Muzaffar Ali's epic-drama 'Umrao Jaan' (1981), re-released in theatres on June 27. What makes the film still resonate with audiences after 44 years? A revisit of the film's enduring cinematic legacy, Rekha's soulful charm and musical nostalgia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/devi-sri-prasad-says-oo-antava-copied-by-turkish-singer-atiye-2748509-2025-06-30",
      "headline": "Devi Sri Prasad alleges Oo Antava was copied, fans point to Turkish singer AtiyeThe song 'Oo Antava', composed by Devi Sri Prasad, is from Allu Arjun's 'Pushpa: The Rise' and featured Samantha Ruth Prabhu in a special appearance. Reportedly, the viral track has been copied by a Turkish artiste."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/poonam-dhillon-defends-sridevi-she-was-brilliant-not-dumb-as-media-claimed-2748493-2025-06-30",
      "headline": "Poonam Dhillon defends Sridevi: She was brilliant, not dumb as media claimedVeteran actor Poonam Dhillon spoke about late actor Sridevi's image in the media in a recent interview. She defended Sridevi and said she was not as dumb as the media claimed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/sardaar-ji-3-row-abhijeet-bhattacharya-slams-diljit-dosanjh-old-concert-video-2748496-2025-06-30",
      "headline": "Abhijeet Bhattacharya slams Diljit over old concert clip amid Sardaar Ji 3 rowSinger Abhijeet Bhattacharya slammed Diljit Dosanjh by sharing an old concert clip where he is seen reciting Rahat Indori's line, \"Kisi ke baap ka Hindustan thodi hai.\" The post comes amid ongoing backlash against the 'Chamkila' star for working with Pakistani actor Hania Aamir in 'Sardaar Ji 3'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-sethupathi-nitya-menen-thalaivan-thalaivii-release-date-2748460-2025-06-30",
      "headline": "Vijay Sethupathi, Nithya Menen's Thalaivan Thalaivii to release in JulyVijay Sethupathi and Nithya Menen reunite for the Tamil film 'Thalaivan Thalaivii', set to release on July 25. Directed by Pandiraaj, the movie promises a lively mix of comedy, action, and character-driven storytelling centred around a quirky tiffin centre."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mandala-murders-vaani-kapoor-plays-detective-crime-thriller-on-secret-societies-2748237-2025-06-30",
      "headline": "Mandala Murders: Vaani Kapoor plays detective in crime-thriller on secret societiesThe new poster of Vaani Kapoor's 'Mandala Murders' was released on June 30. The mythological-crime thriller is scheduled to release on Netflix on July 25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/subhash-ghai-introduces-riteish-deshmukh-as-heroine-of-his-next-film-2748450-2025-06-30",
      "headline": "Subhash Ghai introduces Riteish Deshmukh as heroine of his next filmFilmmaker Subhash Ghai announced the end of his sabbatical on Monday with the announcement of his new film. He announced Bollywood actor Riteish Deshmukh as the heroine of his next film on Instagram. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-shares-stolen-moment-of-happiness-after-paresh-rawal-hera-pheri-3-return-2748444-2025-06-30",
      "headline": "Akshay Kumar shares stolen moment of happiness after Paresh's Hera Pheri 3 returnAkshay Kumar made his first post after the announcement of Paresh Rawal's return to 'Hera Pheri 3'. He talked about his 'stolen moment of happiness' and shared an old photo. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/maheep-singh-cancels-dehradun-show-after-threats-over-content-2748449-2025-06-30",
      "headline": "Comic Maheep Singh cancels Dehradun show after threats over contentComedian Maheep Singh cancelled his show in Dehradun after a protest over his content. He shared a video on social media and shared details about the show. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/shine-tom-chacko-says-mammotty-backed-him-amid-de-addiction-fathers-death-2748461-2025-06-30",
      "headline": "Shine Tom Chacko says Mammootty supported him during de-addiction, father's deathActor Shine Tom Chacko opened up about his de-addiction journey, a car accident, and the loss of his father. He also reflected on the unwavering support he received from actor Mammootty during these difficult times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/diljit-dosanjh-sardaar-ji-3-breaks-salman-khan-sultan-box-office-record-in-pakistan-2748369-2025-06-30",
      "headline": "Diljit Dosanjh's Sardaar Ji 3 breaks Sultan's box office record in Pakistan'Sardaar Ji 3' is emerging as a blockbuster film in Pakistan. The Diljit Dosanjh and Hania Aamir-starrer surpassed the opening collection of Salman Khan's 'Sultan' on the first day. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/china-says-sino-india-border-dispute-complicated-ready-to-discuss-delimitation-2748574-2025-06-30",
      "headline": "China says border dispute with India complicated, ready to discuss delimitationChinese Foreign Minister Mao Ning said that the border dispute is complicated and takes time to resolve. She said that Beijing is ready to hold discussions on delimitation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/after-us-iran-strikes-india-accelerates-bunker-buster-missile-project-2748410-2025-06-30",
      "headline": "India's Agni-5 'bunker buster' missile to carry largest conventional warheadThe Defence Research and Development Organisation (DRDO) is developing a modified version of the Agni-5 intercontinental ballistic missile. The new variant will be a conventional weapon capable of carrying a massive 7500-kilogram bunker-buster warhead. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/odisha-bureaucrat-ratnakar-sahoo-assaulted-by-unknown-assailants-naveen-patnaik-demands-action-2748625-2025-06-30",
      "headline": "Video: Odisha bureaucrat dragged out of office, thrashed; Naveen Patnaik jabs BJPA video shows Ratnakar Sahoo being manhandled by a bunch of young men, who can be heard abusing him while assaulting him inside the BMC office premises. The officer was also grabbed by the collar of his shirt and dragged outside the building by unknown men. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/nursing-student-murder-in-narsinghpur-hospital-in-madhya-pradesh-video-emerges-2748589-2025-06-30",
      "headline": "Boyfriend slits nursing student's throat in hospital, flees; video captures horrorThe nurse was murdered by her lover inside a hospital in Madhya Pradesh in broad daylight while hundreds of people watched but didn't intervene. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shefali-jariwala-death-timeline-fasting-medication-autopsy-forensic-analysis-accidental-2748547-2025-06-30",
      "headline": "Shefali Jariwala's last 24 hours: What went wrong and led to her death?Actor Shefali Jariwala, of 'Kaanta Laga' fame, reportedly died of a heart attack on June 27. Here's a detailed report about the sequence of events, as confirmed by our police sources."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tej-pratap-yadav-meets-partner-anushka-yadav-expulsion-from-rjd-nobody-can-stop-me-2748583-2025-06-30",
      "headline": "Nobody can stop me: Defiant Tej Pratap seen meeting 'partner' after RJD ousterOn May 24, 2025, Tej Pratap declared that he has been in love with Anushka Yadav for over 12 years and that they are in a relationship."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/telangana/story/telangana-bjp-mla-t-raja-singh-known-for-controversial-remarks-resigns-from-party-amid-leadership-tussle-2748435-2025-06-30",
      "headline": "MLA T Raja Singh quits BJP over reported choice for Telangana party unit chiefBJP MLA from Goshamahal, T Raja Singh, resigned from the party amid a leadership tussle in Telangana. He said he remains committed to Hindutva and serving the people of Goshamahal. He appealed to PM Modi and senior BJP leaders to reconsider the state leadership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-round-1-results-sabalenka-tsitsipas-medvedev-2748596-2025-06-30",
      "headline": "Sabalenka crushes Carson Branstine, Medvedev, Tsitsipas crash out in Round 1Wimbledon 2025: Top seed Aryna Sabalenka defeated Canadian qualifier Carson Branstine in straight sets at Wimbledon. Meanwhile, Stefanos Tsitsipas retired due to a back injury, and Daniil Medvedev faced an early exit, raising concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/story/mumbai-techie-locks-himself-for-three-year-in-flat-depressed-over-parents-death-2748504-2025-06-30",
      "headline": "Family died, no friends: Techie locks self in Mumbai flat, rescued after 3 yearsAnup Kumar Nair, a techie by profession, had locked himself up inside a flat in Navi Mumbai for over three years. He never stepped out of his flat and survived on food ordered online. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pakistani-hindu-girl-and-boy-found-dead-near-international-border-in-jaisalmer-cause-of-death-unclear-2748506-2025-06-30",
      "headline": "Hindu girl, boy from Pak found dead in Jaisalmer; may have died of thirstSources told India Today that the duo might have starved to death around four to five days ago under the extremely harsh and arid conditions of Jaisalmer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-field-marshal-asim-munir-terrorism-in-kashmir-as-a-legitimate-struggle-warns-india-befitting-response-2748497-2025-06-30",
      "headline": "Asim Munir dog-whistles again, calls terrorism in Kashmir a legitimate struggleField Marshal Asim Munir has labelled terrorism in Kashmir as a legitimate struggle and has warned India of a befitting response in case of any future attack.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/manipur-four-shot-dead-by-unidentified-gunmen-while-travelling-in-car-churachandpur-2748491-2025-06-30",
      "headline": "Kuki leader, 3 others shot dead in Manipur; rival faction claims responsibilityFour people, including an elderly woman, were shot dead by unidentified gunmen while they were travelling in a car. Among those killed was a senior militant leader of the Kuki National Organisation/Kuki National Army."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/lifestyle/food/story/is-mumbais-iconic-parsi-cafe-jimmy-boy-permanently-closed-2748392-2025-06-30",
      "headline": "Is Mumbai's iconic Parsi cafe Jimmy Boy permanently closed?Jimmy Boy, the iconic joint, shut its doors just months before it was set to celebrate 100 years of serving Parsi culinary heritage.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ms-dhoni-files-for-trademark-of-iconic-nickname-captain-cool-2748422-2025-06-30",
      "headline": "MS Dhoni files for trademark of iconic nickname 'Captain Cool'Over the years, 'Captain Cool' has meant much more than just a catchy title. It sums up Dhoni's calm mind under pressure, from winning India's first T20 World Cup in 2007 to lifting the ODI World Cup in 2011 and the Champions Trophy in 2013. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tejasvi-surya-takes-dig-at-mallikarjun-kharges-high-command-comment-calling-it-unseen-unheard-ghost-2748364-2025-06-30",
      "headline": "Who's the high command, if not Congress chief? BJP trolls Mallikarjun KhargeCongress president Mallikarjun Kharge told the media that the question of changing Karnataka Chief Minister can only be answered by the party high command. BJP MP Tejasvi Surya asks who exactly is this 'high command'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/indias-shubhanshu-shukla-to-make-historic-radio-contact-with-india-from-space-2748543-2025-06-30",
      "headline": "Shux to make historic radio contact with India from space. Details hereThis ham radio session will allow students and engineers on the ground to interact directly with astronaut Shubhanshu Shukla. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kareena-kapoor-parents-randhir-kapoor-babita-reunion-years-apart-2748508-2025-06-30",
      "headline": "Kareena Kapoor shares her parents' decision to reunite after years apartKareena Kapoor expressed happiness at the decision of her parents, Randhir Kapoor and Babita, to spend their later years together. She said this reunion marks a full-circle moment for her and her sister Karisma. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/uttarakhand/video/video-woman-crushed-to-death-by-suv-in-roorkee-2748478-2025-06-30",
      "headline": "Video: Woman walking to work crushed to death by car on Roorkee roadIn a tragic road accident, a woman, who was on her way to work, was crushed to death by an SUV on Monday morning in Uttarakhand's Roorkee. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjp-fact-finding-team-not-allowed-to-meet-survivor-question-admission-of-accused-in-college-2748581-2025-06-30",
      "headline": "Kolkata rape survivor pressured, not allowed to meet us: BJP fact-finding teamThe members of the team expressed their anguish about not being able to meet the survivor and the members of her family. They alleged that the family was being pressurised by the authorities. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/landslide-warnings-in-18-himachal-areas-including-kangra-mandi-and-shimla-259-roads-shut-amid-heavy-rain-2748510-2025-06-30",
      "headline": "Heavy rain triggers landslide warnings in 18 Himachal areas, 259 roads shutFollowing the heavy rain throughout the state, the weather department has issued a landslide warning for 18 out of 22 areas in the state, including Kangra, Mandi and Shimla. Over 250 roads across the state have also been shut due to the incessant rains. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-nitish-reddy-jaiswal-india-predicted-xi-2nd-test-training-session-vs-england-2748571-2025-06-30",
      "headline": "No Bumrah, two spinners? India's training session hints at playing XI for 2nd TestIndia's training session at Edgbaston on Monday afternoon offered the clearest indication yet of a reshuffled playing XI for the second Test against England, starting 2 July. The visitors are expected to make at least two changes, with pace spearhead Jasprit Bumrah almost certain to sit out as the management prioritises his workload."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/study-abroad/story/what-is-the-eb-1-einstein-visa-for-us-that-agents-are-guaranteeing-2748499-2025-06-30",
      "headline": "EB-1 visa decoded: What is the 'Einstein visa' for US and how can you get one?Agents on social media are offering 'guaranteed' EB-1 visas to Indian applicants. Here's what the Einstein visa really is, who qualifies, and how it differs from the H-1B route."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/project-hail-mary-trailer-ryan-gosling-on-a-space-mission-to-save-the-world-2748565-2025-06-30",
      "headline": "Project Hail Mary trailer: Ryan Gosling is on a space mission to save the worldThe trailer of 'Project Hail Mary' starring Ryan Gosling is out. The film will release in India on March 20, 2026. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/what-is-china-j36-stealth-warplane-that-is-being-compared-to-us-b2-spirit-bomber-2748495-2025-06-30",
      "headline": "What is China's J-36 stealth warplane being compared to US' B-2 bomberA blurry image of a warplane, and some social media videos from China sent shockwaves through defence circles late last year. A mysterious, tailless aircraft, similar to the American B-2 bombers, was seen hovering over China's Chengdu city. Analysts are trying to dissect the 'stealth fighter'. What exactly is China building?"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/brett-lee-response-neeraj-chopra-javelin-shoutout-neeraj-chopra-classics-2748622-2025-06-30",
      "headline": "Brett Lee's humble response to Neeraj Chopra's Javelin call: Nowhere closeBrett Lee humbly responded to Neeraj Chopra's javelin thrower comment, saying he tried it in school but is nowhere near Neeraj's level, and wishes the Olympic champion all the best."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-carlos-alcaraz-holger-rune-madison-keys-emma-raducanu-tiafoe-2748614-2025-06-30",
      "headline": "Alcaraz survives Fognini scare, Rune stunned, Raducanu marches aheadWimbledon 2025: Defending champion Carlos Alcaraz battled past Italian Fabio Fognini to claim a 7-5, 6-7(5), 7-5, 2-6, 6-1 win. American sixth seed Madison Keys overcame Romania's Elena-Gabriela Ruse, rallying from a set down to earn a hard-fought 6-7(4), 7-5, 7-5 victory. Chile's Nicolás Jarry stunned Danish eighth seed Holger Rune 4-6, 4-6, 7-5, 6-3, 6-4 in a match lasting over three and a half hours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-moeen-ali-surprise-visit-brimingham-nets-session-spin-2748610-2025-06-30",
      "headline": "Moeen Ali makes surprise visit England nets ahead of Edgbaston TestMoeen Ali made a surprise visit to England's training session at Edgbaston, offering his invaluable pitch insights ahead of the second Test against India, signaling the team's focus on spin-friendly conditions for the upcoming match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zimbabwe-vs-south-africa-1st-test-day-3-report-mulder-hundred-2748602-2025-06-30",
      "headline": "South Africa set Zimbabwe 537 to win after Mulder's career-best 100South Africa set Zimbabwe a daunting 537-run target in the first Test after Wiaan Mulder's career-best 147 on Monday. Corbin Bosch struck late in the day, removing opener Takudzwanashe Kaitano in the final over to leave the hosts 32 for 1 in 18.2 overs at stumps."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-round-1-results-sabalenka-tsitsipas-medvedev-2748596-2025-06-30",
      "headline": "Sabalenka crushes Carson Branstine, Medvedev, Tsitsipas crash out in Round 1Wimbledon 2025: Top seed Aryna Sabalenka defeated Canadian qualifier Carson Branstine in straight sets at Wimbledon. Meanwhile, Stefanos Tsitsipas retired due to a back injury, and Daniil Medvedev faced an early exit, raising concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-daniil-medvedev-record-grand-slams-bonzi-2748587-2025-06-30",
      "headline": "Wimbledon: Daniil Medvedev not concerned despite worrying Grand Slam formDaniil Medvedev suffered a surprising first-round loss at Wimbledon 2025 to Benjamin Bonzi. Despite this setback, Medvedev remains confident about his level at the Grand Slams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/neeraj-chopra-sachin-tendulkar-superpower-javelin-brett-lee-jasprit-bumrah-2748582-2025-06-30",
      "headline": "Neeraj Chopra readies for Classic 2025, shares cricket inspirationsNeeraj Chopra named Brett Lee as a cricketer he believes could have been a good javelin thrower and expressed his desire to try the sport alongside India's pace spearhead Jasprit Bumrah."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-nitish-reddy-jaiswal-india-predicted-xi-2nd-test-training-session-vs-england-2748571-2025-06-30",
      "headline": "No Bumrah, two spinners? India's training session hints at playing XI for 2nd TestIndia's training session at Edgbaston on Monday afternoon offered the clearest indication yet of a reshuffled playing XI for the second Test against England, starting 2 July. The visitors are expected to make at least two changes, with pace spearhead Jasprit Bumrah almost certain to sit out as the management prioritises his workload."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/ultimate-table-trennis-kolkata-thunderblades-rajat-kumar-ankur-bhattacharjee-2748553-2025-06-30",
      "headline": "The Thunderblades story: How a former player is reviving Kolkata's TT sceneIn their debut season, the Kolkata Thunderblades brought dhols, dreams, and determination to Ultimate Table Tennis — but behind the cheers is the story of Rajat Kumar, a former paddler betting on reviving Kolkata's TT roots."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-assistant-coach-kuldeep-yadav-two-spinners-2nd-test-edgbaston-2748546-2025-06-30",
      "headline": "ENG vs IND: Assistant coach hints at Kuldeep Yadav's inclusion for 2nd TestIndia assistant coach Ryan ten Doeschate has given the strongest hint yet that Kuldeep Yadav may return to the playing XI for the second Test against England, with the team leaning towards playing two spinners at Edgbaston."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/england-vs-india-fielding-practice-session-birmingham-edgbaston-test-watch-video-2748529-2025-06-30",
      "headline": "ENG vs IND: India focus on special fielding drills ahead of Edgbaston Test\fWith sharp fielding lapses proving costly in the Leeds Test, India turned their Edgbaston training session into a high-intensity fielding clinic — sharpening slip catching, close-in reflexes, and high-ball drills ahead of the must-win clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/neeraj-chopra-sachin-tendulkar-superpower-javelin-brett-lee-jasprit-bumrah-2748582-2025-06-30",
      "headline": "Neeraj Chopra readies for Classic 2025, shares cricket inspirationsNeeraj Chopra named Brett Lee as a cricketer he believes could have been a good javelin thrower and expressed his desire to try the sport alongside India's pace spearhead Jasprit Bumrah."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-nitish-reddy-jaiswal-india-predicted-xi-2nd-test-training-session-vs-england-2748571-2025-06-30",
      "headline": "No Bumrah, two spinners? India's training session hints at playing XI for 2nd TestIndia's training session at Edgbaston on Monday afternoon offered the clearest indication yet of a reshuffled playing XI for the second Test against England, starting 2 July. The visitors are expected to make at least two changes, with pace spearhead Jasprit Bumrah almost certain to sit out as the management prioritises his workload."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/ultimate-table-trennis-kolkata-thunderblades-rajat-kumar-ankur-bhattacharjee-2748553-2025-06-30",
      "headline": "The Thunderblades story: How a former player is reviving Kolkata's TT sceneIn their debut season, the Kolkata Thunderblades brought dhols, dreams, and determination to Ultimate Table Tennis — but behind the cheers is the story of Rajat Kumar, a former paddler betting on reviving Kolkata's TT roots."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-assistant-coach-kuldeep-yadav-two-spinners-2nd-test-edgbaston-2748546-2025-06-30",
      "headline": "ENG vs IND: Assistant coach hints at Kuldeep Yadav's inclusion for 2nd TestIndia assistant coach Ryan ten Doeschate has given the strongest hint yet that Kuldeep Yadav may return to the playing XI for the second Test against England, with the team leaning towards playing two spinners at Edgbaston."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/england-vs-india-fielding-practice-session-birmingham-edgbaston-test-watch-video-2748529-2025-06-30",
      "headline": "ENG vs IND: India focus on special fielding drills ahead of Edgbaston Test\fWith sharp fielding lapses proving costly in the Leeds Test, India turned their Edgbaston training session into a high-intensity fielding clinic — sharpening slip catching, close-in reflexes, and high-ball drills ahead of the must-win clash."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/eng-vs-ind-2nd-test-india-assistant-coach-ryan-ten-doeschate-press-conference-2748528-2025-06-30",
      "headline": "Nitish Reddy has a very good chance of playing Edgbaston Test: DoeschateIndia assistant coach Ryan ten Doeschate has all but confirmed Nitish Reddy's chances of playing the 2nd Test match at Edgbaston. Doeschate said that Nitish did not play the previous game because the team thought that they needed stronger bowling options."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-unchanged-playing-xi-edgabston-test-vs-india-no-jofra-archer-2748521-2025-06-30",
      "headline": "No Jofra Archer as England announce unchanged XI for Edgbaston TestEngland have confirmed an unchanged playing XI for the Edgbaston Test against India, ruling out Jofra Archer's return. Ben Stokes' side look to build on their Headingley win, while India eye a much-needed comeback."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-second-test-rishabh-pant-chris-woakes-2748520-2025-06-30",
      "headline": "England set to make specific plans against exciting Rishabh Pant: WoakesEngland seamer Chris Woakes revealed that the hosts are quite worried about Rishabh Pant's impact on the game. England are set to have specific plans against Pant who hit 2 hundreds in Leeds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-jasprit-bumrah-availability-2nd-test-india-assistant-coach-2748515-2025-06-30",
      "headline": "Jasprit Bumrah available for 2nd Test, confirms assistant coachEngland vs India, 2nd Test: India assistant coach Ryan ten Doeschate confirmed on Monday that Jasprit Bumrah is available for selection for the second Test in Birmingham.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-ravindra-jadeja-not-a-front-line-spinner-in-english-conditions-greg-chappell-2748511-2025-06-30",
      "headline": "Ravindra Jadeja is not a front-line spinner in English conditions: Greg ChappellFormer India coach Greg Chappell has questioned Ravindra Jadeja's selection as a frontline spinner for the ongoing five-match Test series on the England tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-yashasvi-jaiswal-removed-slip-cordon-training-birmingham-test-2748475-2025-06-30",
      "headline": "Yashasvi Jaiswal axed from slip cordon training after Leeds nightmareAfter a string of dropped catches in Leeds, Yashasvi Jaiswal was left out of India's main slip cordon during training ahead of the Edgbaston Test, as the team intensifies focus on sharper fielding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pataudi-trophy-row-engineer-criticises-ecb-calls-medal-a-mere-afterthought-2748445-2025-06-30",
      "headline": "Pataudi Trophy row: Engineer criticises ECB, calls medal a mere afterthoughtFormer India wicketkeeper Farokh Engineer has slammed the ECB's decision to drop the Pataudi Trophy name and rechristen the India-England Test series as the Anderson-Tendulkar Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/faf-du-plessis-mlc-texas-super-kings-vs-mi-new-york-world-record-2748383-2025-06-30",
      "headline": "Faf du Plessis scripts world record with second hundred after turning 40Faf du Plessis became the first T20 batter to score more then one hundred after turning 40. His stellar form helped Texas Super Kings defeat MI New York in a crunch Major League Cricket match in Dallas on Sunday, June 29. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-ravindra-jadeja-not-a-front-line-spinner-in-english-conditions-greg-chappell-2748511-2025-06-30",
      "headline": "Ravindra Jadeja is not a front-line spinner in English conditions: Greg ChappellFormer India coach Greg Chappell has questioned Ravindra Jadeja's selection as a frontline spinner for the ongoing five-match Test series on the England tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-yashasvi-jaiswal-removed-slip-cordon-training-birmingham-test-2748475-2025-06-30",
      "headline": "Yashasvi Jaiswal axed from slip cordon training after Leeds nightmareAfter a string of dropped catches in Leeds, Yashasvi Jaiswal was left out of India's main slip cordon during training ahead of the Edgbaston Test, as the team intensifies focus on sharper fielding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pataudi-trophy-row-engineer-criticises-ecb-calls-medal-a-mere-afterthought-2748445-2025-06-30",
      "headline": "Pataudi Trophy row: Engineer criticises ECB, calls medal a mere afterthoughtFormer India wicketkeeper Farokh Engineer has slammed the ECB's decision to drop the Pataudi Trophy name and rechristen the India-England Test series as the Anderson-Tendulkar Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/faf-du-plessis-mlc-texas-super-kings-vs-mi-new-york-world-record-2748383-2025-06-30",
      "headline": "Faf du Plessis scripts world record with second hundred after turning 40Faf du Plessis became the first T20 batter to score more then one hundred after turning 40. His stellar form helped Texas Super Kings defeat MI New York in a crunch Major League Cricket match in Dallas on Sunday, June 29. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/f1-australia-vs-west-indies-steve-smith-injury-update-2748376-2025-06-30",
      "headline": "Batting cage and tennis balls: Steve Smith fast tracks recovery before 2nd TestSteve Smith revealed that he trained in a New York baseball cage while recovering from his finger injury. Smith is in the running for a return in the 2nd Test match against West Indies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-live-updates-aryna-sabalenka-carlos-alcaraz-daniil-medvedev-2748366-2025-06-30",
      "headline": "Day 1 Highlights: Alcaraz wins 5-set battle vs Fognini, Paolini in troubleWimbledon 2025 Day 1 Highlights: Carlos Alcaraz survives a five-set thriller against Fognini, winning 7-5, 6-7, 7-5, 2-6, 6-1, while Jasmine Paolini faces early struggles in her first-round clash against Anastasija Sevastova, losing the first set.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-luke-williams-southern-brave-hundred-women-coach-2748326-2025-06-30",
      "headline": "RCB head coach joins Southern Brave for Hundred Women's 2025Southern Brave have roped in Luke Williams as their head coach and Marcus Trescothick as their batting coach for the 2025 edition of the Women's Premier League. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/ayush-shetty-wins-us-open-super-300-title-2025-2748274-2025-06-30",
      "headline": "Who is Ayush Shetty? India's 6ft 4in-tall badminton hope wins US OpenAyush Shetty clinched his first senior title at the US Open Super 300 tournament. His win signals a new era for Indian badminton with rising young talent making waves."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-azhar-mahmood-red-ball-head-coach-2748265-2025-06-30",
      "headline": "Pakistan appoint former all-rounder as 'acting coach' for Test teamPakistan have appointed former all-rounder Azhar Mahmood as their acting red-ball head coach. Pakistan finished at the bottom in the 2023-25 edition of the World Test Championship. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kuldeep-yadav-prepares-england-test-pietersen-guidance-dual-spin-2748221-2025-06-30",
      "headline": "Armed with English wisdom, Kuldeep makes bold promise ahead of Test comebackEngland vs India: Spinner Kuldeep Yadav recalled his experience of learning from Kevin Pietersen about the nuances of bowling in England. The wrist-spinner might make his way into the XI for the second Test, starting July 02 in Birmingham. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-india-birmingham-record-2748226-2025-06-30",
      "headline": "Can India make a comeback in Birmingham?  Here's what history suggestsENG vs IND: Shubman Gill's India are looking to make a comeback in the five-match Test series after losing the opening Test at Headingley in Leeds by five wickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-yashasvi-jaiswal-rahul-dravid-record-2748194-2025-06-30",
      "headline": "Yashasvi Jaiswal eyes Rahul Dravid's historic 26-year-old recordENG vs IND: Yashasvi Jaiswal can become the fastest Indian to 2000 Test runs in the second Test starting July 2 at the Edgbaston in Birmingham. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ab-de-villiers-bumrah-workload-management-england-test-series-2748187-2025-06-30",
      "headline": "A Bumrah surprise? AB de Villiers offers optimistic take on ENG vs IND Test seriesEngland vs India: Former South Africa captain AB de Villiers said India should have managed Jasprit Bumrah's workload better and had him ready to play all five Tests in the Anderson-Tendulkar Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-dark-horses-bublik-medvedev-draper-to-watch-out-for-2747667-2025-06-30",
      "headline": "From Bublik to Medvedev: 5 men who can spring a surpriseAs 2025 has shown to be the year for first-timers, let us have a look at some of the dark horses that could put up a surprising challenge against the Big 3 for Wimbledon's men's singles title. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-2nd-test-can-kuldeep-yadav-dismantle-england-in-birmingham-2748033-2025-06-30",
      "headline": "Can Kuldeep dismantle England? India's spin gamble against Bazball in BirminghamHaving lost the first Test despite dominating the majority of the match has left India questioning their team combination and on-field tactics. Could Kuldeep Yadav emerge as the knight in the shining armour to take down England's Bazball during the second Test at Edgbaston, Birmingham."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}