{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/standard-not-met-what-astronomer-said-on-ceo-andy-byron-kristine-cabot-coldplay-kiss-cam-scandal-2758498-2025-07-20",
      "headline": "Standard not met: What Astronomer said on CEO Andy Byron's Coldplay kiss cam rowAstronomer responded to the viral video by placing CEO Andy Byron on leave, later confirming his resignation after stating that leadership standards had not been met. The company emphasised its commitment to accountability and the core values it was founded on."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-rich-are-swapping-gold-for-bitcoin-here-is-why-gold-vs-bitcoin-2758472-2025-07-20",
      "headline": "India's rich are swapping gold for bitcoin. Here's WhyNow-a-days more of India's rich are putting a slice of their gold-backed wealth into shiny new digital coins like Bitcoin."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/astronomer-ceo-andy-byron-quits-after-coldplay-kiss-cam-scandal-2758451-2025-07-20",
      "headline": "Astronomer CEO Andy Byron quits after Coldplay kiss cam scandalDataOps firm Astronomer's CEO, Andy Byron, has resigned following a scandal at a Coldplay concert which also involved the firm's HR head, Kristen Cabot. In a statement, the company announced the board of directors had accepted the resignation, stating that \"the company's standard wasn't met.\" The New York-based unicorn company, founded in 2018, confirmed that a search for a new CEO is underway. The resignation followed a board-initiated investigation after an incident at a Coldplay event involving the CEO went viral. The board said that leaders are expected to set the standard in conduct and accountability. There has been no official update regarding any action taken against the HR head, Kristen Cabot, who is the Chief People's Officer at the company."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/andy-byron-astronomer-ceo-caught-in-coldplay-kiss-cam-scandal-resigns-glbs-2758389-2025-07-20",
      "headline": "Andy Byron, Astronomer CEO caught in Coldplay kiss cam scandal, resignsAndy Byron resigns as CEO of AI firm Astronomer after a viral 'kiss cam' video with HR chief Kristin Cabot sparked online speculation and prompted an internal review by the company."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/shloka-ambani-interview-she-shares-what-keeps-her-going-career-kids-and-cause-2758378-2025-07-19",
      "headline": "Career, kids and a cause: Shloka Ambani shares what keeps her goingIn a heart-to-heart on Masoom Minawala's podcast, Shloka opened up about her journey—balancing kids, career, and a cause she truly believes in."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/astronomer-ceo-andy-byron-cpo-kristin-cabot-leave-coldplay-concert-video-investigation-statement-2758075-2025-07-19",
      "headline": "Astronomer CEO, HR head sent on leave after Coldplay kiss cam outs 'affair'The company issued an official statement two days after the incident, announcing that its board had initiated an internal investigation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-sons-forms-ai-171-memorial-trust-ex-gratia-ahmedabad-plane-crash-victims-families-2757926-2025-07-18",
      "headline": "Tata Sons forms AI 171 memorial trust, pledges Rs 1 crore to victims' familiesTata Sons has set up the AI 171 Memorial and Welfare Trust, pledging Rs 1 crore ex gratia per victim and Rs 500 crore in total, to support crash victims, families, and responders. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/sold-property-and-want-to-save-tax-this-tax-expert-suggests-a-smarter-way-2757911-2025-07-18",
      "headline": "Sold property and want to save tax? This tax expert suggests a smarter waySelling a property can bring in a tidy profit, but it also comes with a hefty tax bill. Many turn to 54EC bonds to save tax — but tax expert Sujit Bangar says there's a smarter way."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-over-500-points-lower-nifty-below-25000-axis-bank-falls-5-2757793-2025-07-18",
      "headline": "Sensex ends over 500 points lower, Nifty below 25,000; Axis Bank falls 5%The S&P BSE Sensex was down 501.51 points to 81,757.73 at the closing bell, while the NSE Nifty50 settled 143.05 points lower at 24,968.40. Most of the broader market indices also reflected the weak sentiments on Dalal Street."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/2025-tech-layoffs-amazon-microsoft-google-fuel-job-fears-amid-ai-push-2757700-2025-07-18",
      "headline": "2025 tech layoffs: Amazon, Microsoft, Google fuel job fears amid AI pushThe year 2025 was supposed to be a new chapter. A time when artificial intelligence promised smarter work, faster growth, and a better future. But for tens of thousands of workers across the world, it has meant sleepless nights, and uncertain futures. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/axis-bank-share-price-down-7-percent-why-sell-hold-stock-q1-results-banking-2757697-2025-07-18",
      "headline": "Axis Bank shares tank 7% today. Should you sell or hold the stock?Axis Bank shares: The stock has been on a downward trend in recent times. It has fallen 5.77% in the last five days, 9.14% in the past one month, and 15.27% over the last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-retail-acquires-kelvinator-to-expand-appliance-business-2757690-2025-07-18",
      "headline": "Reliance Retail acquires Kelvinator to expand appliance businessReliance believes this move will help it grow faster in the consumer durables sector, connect more closely with customers, and open up bigger long-term opportunities in India's changing market."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/mohit-suri-copy-saiyaara-from-a-moment-to-remember-internet-thinks-2758633-2025-07-20",
      "headline": "Is Mohit Suri's Saiyaara copy of a Korean film? Internet thinks soMohit Suri's 'Saiyaara', featuring Ahaan Panday and Aneet Padda, hit cinemas on Friday. Soon after its release, viewers began drawing attention to noticeable similarities with a Korean film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-loses-patience-with-paparazzi-outside-jalsa-2758592-2025-07-20",
      "headline": "Band karo: Amitabh Bachchan loses patience with paps for filming outside JalsaAmitabh Bachchan was seen scolding paparazzi outside his home, Jalsa for filming his house. Take a look at the viral video."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-mourns-don-director-chandra-barots-death-2758579-2025-07-20",
      "headline": "Amitabh Bachchan mourns dear friend and Don director Chandra Barot's deathAmitabh Bachchan paid heartfelt tribute to his director-friend, Chandra Barot. They worked together in the cult classic 'Don'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/parineeti-chopra-raghav-chadha-leave-great-indian-kapil-sharma-show-shoot-midway-after-politicians-mother-falls-ill-2758569-2025-07-20",
      "headline": "Parineeti-Raghav leave Kapil's shoot midway after politician's mother falls illParineeti Chopra and Raghav Chadha's debut appearance on Kapil Sharma's show was unexpectedly halted due to a medical emergency involving Raghav's mother. The couple reportedly had to leave the show mid-shoot to visit the hospital. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/anirudh-ravichander-chennai-concert-postponed-overwhelming-ticket-demand-2758566-2025-07-20",
      "headline": "Anirudh Ravichander's Chennai concert postponed over overwhelming ticket demandSinger-composer Anirudh Ravichander postponed his Chennai concert due to overwhelming ticket demand. He was scheduled to perform on July 26 at Thiruvidanthai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/between-kapil-sharma-and-gong-yoo-vir-das-fool-volume-debuts-strong-on-netflix-2758539-2025-07-20",
      "headline": "Between Kapil Sharma and Gong Yoo: Vir Das's Fool Volume debuts strong on NetflixVir Das humourously celebrated his Netflix special 'Fool Volume', debuting at Number 3 in India, sandwiched between popular shows 'The Great Indian Kapil Show' and 'Squid Game: Season 3'. He shared a fun AI image caught between Kapil Sharma and Gong Yoo. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajamouli-wife-rama-watch-brad-pitt-f1-hyderabad-prasads-theatre-2758519-2025-07-20",
      "headline": "Rajamouli, wife Rama enjoy Brad Pitt's F1 at Hyderabad's Prasads theatre. WatchFilmmaker SS Rajamouli was captured watching actor Brad Pitt's 'F1 The Movie'. Videos of him leaving the theatres went viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mamata-banerjee-wishes-speedy-recovery-to-shah-rukh-khan-after-injury-2758513-2025-07-20",
      "headline": "Mamata Banerjee wishes speedy recovery to brother Shah Rukh Khan after injuryWest Bengal Chief Minister Mamata Banerjee expressed concern for Shah Rukh Khan's injury during 'King' shoot. He is currently in the UK recovering. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nick-jonas-celebrates-priyanka-chopra-43-birthday-new-post-2758500-2025-07-20",
      "headline": "Nothing brings Nick Jonas more joy than celebrating Priyanka, his new post has it allPop star Nick Jonas penned a heartfelt birthday tribute for his wife, Priyanka Chopra, accompanied by a romantic photo. The couple, who have been married since 2018, continue to serve major relationship goals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/don-director-chandra-barot-dies-of-pulmonary-disease-at-86-2758494-2025-07-20",
      "headline": "Don director Chandra Barot dies at 86, Farhan Akhtar pays tributeVeteran filmmaker Chandra Barot died at the age of 86. He was best known for his work in Amitabh Bachchan's 'Don'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/charli-xcx-marries-the-1975-george-daniel-london-town-hall-ceremony-2758485-2025-07-20",
      "headline": "Charli XCX marries The 1975's George Daniel in London town hall ceremonyPop sensation Charli XCX married George Daniel of The 1975 in an intimate ceremony held in London. The bride turned heads in a stylish white mini dress paired with her trademark sunglasses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahesh-babu-namrata-shirodkar-wish-daughter-sitara-ghattamaneni-on-birthday-just-like-that-shes-a-teenager-2758483-2025-07-20",
      "headline": "Just like that she's a teen: Mahesh Babu, Namrata wish daughter Sitara on birthdaySitara Ghattamaneni, daughter of Telugu superstar Mahesh Babu and Namrata Shirodkar, celebrated her 13th birthday surrounded by heartfelt wishes from family and fans. The teenager, already popular on social media, continues to charm the Telugu film fraternity with her growing presence and talent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vicky-kaushal-father-sham-suicidal-after-cancer-diagnosis-ready-to-jump-third-floor-2758473-2025-07-20",
      "headline": "Sham Kaushal was suicidal after cancer diagnosis: Wanted to jump from third floorActor Vicky Kaushal's father, Sham Kaushal, recalled that after undergoing surgery, his doctor had warned him he might not survive. He believes it was his prayers and faith that helped him pull through."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/parag-tyagis-emotional-post-remembers-wife-shefali-jariwala-as-beloved-maasi-2758469-2025-07-20",
      "headline": "Parag Tyagi calls Shefali Jariwala a beloved maasi in emotional postParag Tyagi continues to honour his late wife Shefali Jariwala with touching posts celebrating her loving nature and their cherished memories together. On Sunday, he shared a post remembering the best aunt that she was to her nephew and niece."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/paul-wesley-engaged-to-model-natalie-kuckenburg-after-romantic-italy-trip-2758452-2025-07-20",
      "headline": "Vampire Diaries's Paul Wesley engaged to model-girlfriend Natalie KuckenburgPaul Wesley, known for his role in 'The Vampire Diaries', is engaged to model Natalie Kuckenburg. The couple shared the news privately on Instagram during a trip to Italy, where they have reportedly been visiting since 2022."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-box-office-day-2-ahaan-panday-aneet-padda-film-shines-brighter-nears-rs-50-crore-2758434-2025-07-20",
      "headline": "Saiyaara box office Day 2: Ahaan-Aneet's film shines brighter, nears Rs 50 croreMohit Suri's 'Saiyaara' has taken the Indian box office by storm, becoming the biggest surprise hit of the year with a Rs 48.25 crore collection in just two days. The film's success without star power or heavy promotion signals a strong comeback for romantic dramas, especially among the Gen Z audience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mohit-suri-ahaaan-panday-saiyaara-character-casting-story-2758424-2025-07-20",
      "headline": "Exclusive: How a bar night helped Ahaan Panday land Saiyaara, reveals Mohit SuriIn an exclusive conversation with India Today, filmmaker Mohit Suri shared the story behind casting Ahaan Panday in 'Saiyaara'. He said that an unusual test revealed the actor's true character and energy, shaping the film's lead role."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/alia-bhatt-gushes-over-saiyaara-stars-ahaan-panday-aneet-padda-calls-film-full-of-soul-2758419-2025-07-20",
      "headline": "Alia Bhatt, Mahesh Babu are all love for Ahaan-Aneet's Saiyaara: Take a bowActors Alia Bhatt and Mahesh Babu showered heartfelt praise on the film 'Saiyaara', describing its lead actors as \"magical stars\" and commending the emotional depth of the story. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-fans-turn-theatres-into-concert-watch-viral-video-2758336-2025-07-19",
      "headline": "Saiyaara fans turn theatres into concert halls. Videos go viralPlanning to watch Mohit Suri's 'Saiyaara' this weekend? Here's how audiences are reacting to Ahaan Panday and Aneet Padda's big-screen debut."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shashi-tharoor-no-longer-one-of-us-congress-leader-k-muraleedharan-barb-blows-rift-wide-open-2758659-2025-07-20",
      "headline": "Shashi Tharoor no longer one of us: Congress leader's jab blows rift wide openSenior Congress leader K Muraleedharan said that his party colleague Shashi Tharoor was no longer considered 'one of us.' He added that the party's national leadership would decide what action was required against the Congress MP."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tamil-nadu-girl-was-bitten-raped-by-suspect-fought-him-off-saved-another-child-2758637-2025-07-20",
      "headline": "Tamil Nadu girl was bitten, raped by suspect, fought him off; saved another childA 10-year-old girl, who was kidnapped and allegedly raped in Tamil Nadu on July 12, was assaulted several times by the suspect before fighting him off and saving another minor, who approached the crime spot."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pit-bull-bites-child-in-mankhurd-mumbai-man-unleashes-dog-on-boy-inside-auto-laughs-as-dog-attacks-2758648-2025-07-20",
      "headline": "Video: Mumbai man unleashes pit bull on boy inside auto, laughs as dog attacksThe dog's owner entered the auto with the pit bull, prompting all the children to flee in fear. However, the victim was unable to escape in time. What followed was extremely disturbing. Sohail first scared the boy, Hamza, with the dog and then unleashed it on him."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-injury-crisis-nitish-reddy-ligament-tear-knee-2758664-2025-07-20",
      "headline": "Injured Nitish, Arshdeep ruled out of 4th Test against EnglandIndia vs England: India's injury woes have continued ahead of the 4th Test match in Manchester. Nitish Kumar Reddy has suffered a knee injury just days ahead of the 4th Test match and has been ruled out of the game. Additionally, seamer Akash Deep is also doubtful for the game as well."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/african-british-man-eats-chicken-inside-iskcon-govinda-restaurant-london-viral-video-2758541-2025-07-20",
      "headline": "Viral video: Man eats chicken inside ISKCON restaurant in London, sparks outrageA video of a man eating fried chicken inside ISKCON's Govinda restaurant in London has gone viral on social media. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/maharashtra-sambhajinagar-aurangabad-godman-forces-urine-drinking-shoe-beatings-in-exorcism-flees-after-police-case-2758625-2025-07-20",
      "headline": "Maharashtra 'godman' beat followers with shoes, fed them urine; now on the runThe self-styled godman carried out inhumane acts — beating people with sticks, forcing them to hold shoes in their mouths, and even making them drink urine — all in the name of exorcism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/civil-aviation-minister-ram-mohan-naidu-backs-aaib-rejects-us-media-reports-on-air-india-crash-2758585-2025-07-20",
      "headline": "Vested interest: Minister rejects US media's 'pilot error' spin on Air India crashTargeting Western media reports suggesting pilot error, Union Civil Aviation Minister Ram Mohan Naidu said that the central air accident investigation agency has appealed to Western media outlets 'that may have a vested interest in the kind of articles they are trying to publish.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/flight-ai171-loss-aches-yet-data-shows-air-travel-the-safest-in-india-2757923-2025-07-18",
      "headline": "Flight AI171 loss aches, yet data shows air travel the safest in IndiaThe Aircraft Accidents Investigation Bureau has underscored the safety of the Indian aviation industry and called out the international media for projecting 'unfounded facts'\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sunday-special/story/hit-and-run-fauja-singh-road-accident-death-india-capital-ncrb-police-investigation-corruption-delhi-safety-2758365-2025-07-20",
      "headline": "The dead cry for justice in the land of hit-and-runLegendary marathoner Fauja Singh, 114, was recently killed in a hit-and-run accident. Over 30,400 people were killed in such accidents in India in 2022. But why do people flee accident spots, leaving behind the victim? Fear of being lynched, a sense of impunity and little value for lives play a role. Police also categorise accidents as hit-and-run to avoid probing them. Can India, where corruption rules, bring down hit-and-run cases?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/ssvm-institutions-from-cradle-to-cosmos-2754432-2025-07-11",
      "headline": "SSVM Institutions: From Cradle to CosmosForging Futures with Foresight, Flair, and Faith"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/maharashtra-minister-manikrao-kokate-caught-playing-rummy-in-house-sharad-pawars-ncp-shares-video-2758545-2025-07-20",
      "headline": "Caught on camera playing rummy in House, Maharashtra minister's 'YouTube' defenceThe video, widely circulated on social media, was shared by Nationalist Congress Party (Sharadchandra Pawar) leader Rohit Pawar, who launched a sharp attack on the minister and the government over the incident."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wtc-final-venues-announced-till-2031-ecb-vs-bcci-2758602-2025-07-20",
      "headline": "No WTC Final in India till 2031, confirms ICCThe ICC has confirmed England will host the World Test Championship Finals until 2031. This decision follows ECB's successful management of the previous three editions, reinforcing England's status as the tournament's home."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/two-brothers-marry-one-bride-himachal-hatti-jodidara-marriage-legal-2758493-2025-07-20",
      "headline": "Why two brothers married one bride in Himachal and is it legal?In a rare instance of polyandry, two brothers from Himachal Pradesh's Hatti tribe married the same woman in a traditional ceremony known as Jodidara. The practice, rooted in preserving ancestral land and family unity, is still legally recognised in parts of the state despite its gradual decline."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/madhya-pradesh-man-drowns-river-retrieve-slipper-dies-seoni-parewa-khoh-2758580-2025-07-20",
      "headline": "Man tries to retrieve slipper from river, slips, swept away as friends watchA 20-year-old youth drowned in Seoni, MP while trying to retrieve his slipper from a river during a picnic. The tragic incident was caught on camera and his body was recovered the next day.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/admitted-after-spat-tamil-nadu-woman-stabbed-to-death-by-husband-in-hospital-bed-2758572-2025-07-20",
      "headline": "Admitted after fight, Tamil Nadu woman stabbed to death by husband in hospital bedOn Sunday morning, Vishruth entered the hospital, stabbed Shruthi -- who was in an unconscious state at that time -- three times and escaped, killing her. She was admitted to a government hospital after reportedly sustaining injuries following an argument with Vishruth on Saturday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indian-cricket-team-manchester-united-adidas-photoshoot-shubman-gill-ruben-amorim-2758624-2025-07-20",
      "headline": "Team India x Manchester United: Stars unite for viral Adidas photoshootIndia and Manchester United stars unite for a viral Adidas photoshoot in Manchester ahead of the fourth Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/mohit-suri-copy-saiyaara-from-a-moment-to-remember-internet-thinks-2758633-2025-07-20",
      "headline": "Is Mohit Suri's Saiyaara copy of a Korean film? Internet thinks soMohit Suri's 'Saiyaara', featuring Ahaan Panday and Aneet Padda, hit cinemas on Friday. Soon after its release, viewers began drawing attention to noticeable similarities with a Korean film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-506-18-07-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/indonesia-ferry-catches-fire-passengers-leap-into-sea-dead-rescued-missing-operations-2758611-2025-07-20",
      "headline": "3 dead as Indonesian ferry with 280 onboard catches fire, passengers leap into seaThe ship, KM Barcelona 5, caught fire while sailing in the waters off Manado in Indonesia's North Sulwaesi province. Videos surfaced on social media, showing passengers jumping from the burning ferry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/mumbai/story/mumbai-local-train-seat-dispute-marathi-hindi-language-clash-viral-video-2758538-2025-07-20",
      "headline": "Speak Marathi or get out: Woman abused in Mumbai local as seat dispute escalatesThe incident took place on Friday evening in a crowded ladies' coach of the train running on the Central line."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-rich-are-swapping-gold-for-bitcoin-here-is-why-gold-vs-bitcoin-2758472-2025-07-20",
      "headline": "India's rich are swapping gold for bitcoin. Here's WhyNow-a-days more of India's rich are putting a slice of their gold-backed wealth into shiny new digital coins like Bitcoin."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/madras-high-court-ed-investigative-powers-money-laundering-case-company-cbi-2758600-2025-07-20",
      "headline": "ED not a super cop or drone to probe everything at will: High CourtThe ED is neither a \"super cop\" nor a \"loitering munition\" as it can't act at will, the Madras High Court said while hearing a plea from a company challenging the agency's freezing of its fixed deposits worth Rs 901 crore in a money laundering case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/delhi-judge-recites-own-poetry-while-granting-bail-to-accused-in-property-case-2758577-2025-07-20",
      "headline": "Milkiyat ki jang mein...: Judge turns poet while granting bail in property caseA judge of a Delhi court turned a poet for a while and recited his own poetry while granting bail to a man accused of illegally possessing his mother's property."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/south/story/beneath-the-hill-a-lost-world-4000-year-old-settlement-found-in-karnatakas-maski-2758479-2025-07-20",
      "headline": "Beneath the hill, a lost world: 4,000-year-old settlement found in Karnataka's MaskiArchaeologists have discovered 4,000-year-old artefacts during an excavation near Mallikarjuna Hill and the Anjaneya Swamy Temple in Maski in Karnataka's Raichur district. The findings suggest the presence of an ancient human settlement, highlighting Maski's historical significance once again."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/mohit-suri-copy-saiyaara-from-a-moment-to-remember-internet-thinks-2758633-2025-07-20",
      "headline": "Is Mohit Suri's Saiyaara copy of a Korean film? Internet thinks soMohit Suri's 'Saiyaara', featuring Ahaan Panday and Aneet Padda, hit cinemas on Friday. Soon after its release, viewers began drawing attention to noticeable similarities with a Korean film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-loses-patience-with-paparazzi-outside-jalsa-2758592-2025-07-20",
      "headline": "Band karo: Amitabh Bachchan loses patience with paps for filming outside JalsaAmitabh Bachchan was seen scolding paparazzi outside his home, Jalsa for filming his house. Take a look at the viral video."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-mourns-don-director-chandra-barots-death-2758579-2025-07-20",
      "headline": "Amitabh Bachchan mourns dear friend and Don director Chandra Barot's deathAmitabh Bachchan paid heartfelt tribute to his director-friend, Chandra Barot. They worked together in the cult classic 'Don'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/parineeti-chopra-raghav-chadha-leave-great-indian-kapil-sharma-show-shoot-midway-after-politicians-mother-falls-ill-2758569-2025-07-20",
      "headline": "Parineeti-Raghav leave Kapil's shoot midway after politician's mother falls illParineeti Chopra and Raghav Chadha's debut appearance on Kapil Sharma's show was unexpectedly halted due to a medical emergency involving Raghav's mother. The couple reportedly had to leave the show mid-shoot to visit the hospital. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/srihari-nataraj-breaks-best-indian-time-100m-freestyle-world-university-games-2758683-2025-07-20",
      "headline": "Swimmer Srihari Nataraj breaks national record in World University GamesSrihari Nataraj broke the Best Indian Time in the men's 100m freestyle at the World University Games. His record-breaking swim highlights India's rising talent in competitive swimming."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-bangladesh-1st-t20i-match-report-2758677-2025-07-20",
      "headline": "Pakistan fizzle out in opener, Bangladesh claim mega victory in DhakaBangladesh secured a commanding seven-wicket victory over Pakistan in the opening T20I at Dhaka. Bangladesh chased down Pakistan's 111-run target inside 16 overs."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-injury-crisis-nitish-reddy-ligament-tear-knee-2758664-2025-07-20",
      "headline": "Injured Nitish, Arshdeep ruled out of 4th Test against EnglandIndia vs England: India's injury woes have continued ahead of the 4th Test match in Manchester. Nitish Kumar Reddy has suffered a knee injury just days ahead of the 4th Test match and has been ruled out of the game. Additionally, seamer Akash Deep is also doubtful for the game as well."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-bangladesh-match-t20i-fakhar-zaman-run-out-khushdil-shah-2758634-2025-07-20",
      "headline": "New Pakistan, same old run-outs: Team bowled out for 110 vs BangladeshPakistan's T20I team continues to be a comedy of errors. The latest incident happened in the 1st T20I against Bangladesh, where Fakhar Zaman was run out by Khushdil Shah."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indian-cricket-team-manchester-united-adidas-photoshoot-shubman-gill-ruben-amorim-2758624-2025-07-20",
      "headline": "Team India x Manchester United: Stars unite for viral Adidas photoshootIndia and Manchester United stars unite for a viral Adidas photoshoot in Manchester ahead of the fourth Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wtc-final-venues-announced-till-2031-ecb-vs-bcci-2758602-2025-07-20",
      "headline": "No WTC Final in India till 2031, confirms ICCThe ICC has confirmed England will host the World Test Championship Finals until 2031. This decision follows ECB's successful management of the previous three editions, reinforcing England's status as the tournament's home."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-vs-cristiano-ronaldo-all-time-goal-stats-2758596-2025-07-20",
      "headline": "Messi vs Ronaldo: Late surge helps Argentine overtake CR7 in major featLionel Messi has overtaken Cristiano Ronaldo in an elite feat, despite playing 167 fewer games. Messi, now 38, has more non-penalty goals than the legendary Portuguese."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-midfield-pace-issues-after-goalless-leeds-draw-preseason-2758591-2025-07-20",
      "headline": "Man United lack pace: Amorim unimpressed with pre-season show vs LeedsManchester United started their pre-season with a goalless draw against Leeds United. Manager Ruben Amorim acknowledged the need for more midfield speed and overall improvements to succeed this season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-must-save-risky-shots-for-ipl-test-cricket-needs-discipline-farokh-engineer-2758562-2025-07-20",
      "headline": "Pant must save risky shots for IPL, Test cricket needs discipline: EngineerFormer India wicketkeeper Farokh Engineer has advised Rishabh Pant to save his risky shots for the IPL and bat in a bit more disciplined manner in Tests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-vs-cristiano-ronaldo-all-time-goal-stats-2758596-2025-07-20",
      "headline": "Messi vs Ronaldo: Late surge helps Argentine overtake CR7 in major featLionel Messi has overtaken Cristiano Ronaldo in an elite feat, despite playing 167 fewer games. Messi, now 38, has more non-penalty goals than the legendary Portuguese."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-midfield-pace-issues-after-goalless-leeds-draw-preseason-2758591-2025-07-20",
      "headline": "Man United lack pace: Amorim unimpressed with pre-season show vs LeedsManchester United started their pre-season with a goalless draw against Leeds United. Manager Ruben Amorim acknowledged the need for more midfield speed and overall improvements to succeed this season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-must-save-risky-shots-for-ipl-test-cricket-needs-discipline-farokh-engineer-2758562-2025-07-20",
      "headline": "Pant must save risky shots for IPL, Test cricket needs discipline: EngineerFormer India wicketkeeper Farokh Engineer has advised Rishabh Pant to save his risky shots for the IPL and bat in a bit more disciplined manner in Tests."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}