{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-opening-sensex-opens-200-points-higher-nifty-above-25500-it-stocks-rise-tech-m-infosys-tcs-2874556-2026-02-26",
      "headline": "Sensex opens 200 points higher, Nifty above 25,500; IT stocks riseThe S&P BSE Sensex was up 53.27 points to 82,329.34, while the NSE Nifty50 gained 33.90 points to 25,516.40 as of 9:35 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-opening-february-26-will-stock-market-rise-or-fall-today-gift-nifty-fii-dii-data-2874552-2026-02-26",
      "headline": "Sensex, Nifty opening: Will stock market rise or fall today?Gift Nifty futures were trading at 25,676 at 8:00 am, suggesting that the Nifty 50 may open above Wednesday's closing level of 25,482.5. The early signal points to a mild positive start for the day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/8th-pay-commission-website-whats-inside-and-how-employees-can-share-views-2874333-2026-02-25",
      "headline": "8th Pay Commission website: What's inside and how employees can share viewsWith the launch of the 8th Pay Commission portal, central government employees can now track updates, explore past pay recommendations, and share their suggestions. Have you checked the website yet?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/indian-entrepreneur-sells-startup-exits-sweden-xenophobic-system-2874313-2026-02-25",
      "headline": "Destroyed my life: Indian CEO sells firm, quits Sweden, blames xenophobiaWhat was meant to be a startup success story in Sweden has ended in an anguished exit for Indian entrepreneur Abhijith Nag Balasubramanyam. Ten months after founding a company, he has been forced to sell his business and return to India. What's behind the move? What challenges did he face? Read on to find out."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-down-erase-early-gains-ril-sbi-down-2874206-2026-02-25",
      "headline": "Sensex, Nifty erase early gains to end marginally higher; RIL down 2%The S&P BSE Sensex added 50.15 points to close at 82,276.07, while the NSE Nifty50 gained 57.85 points to end at 25,482.50. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-your-rs-12-lakh-salary-still-feels-tight-even-with-just-rs-55000-emis-2874098-2026-02-25",
      "headline": "Why your Rs 1.2 lakh salary still feels tight even with just Rs 55,000 EMIsWith a Rs 1.2 lakh monthly income and Rs 55,000 in EMIs, you would expect to have enough left for savings and comfort. But many people still feel financially stretched. Are hidden fixed expenses quietly consuming your income?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/ai-impact-on-it-stocks-should-you-buy-it-stocks-or-it-mutual-funds-now-2874124-2026-02-25",
      "headline": "With AI hurting IT sector, what's the smarter bet: Stocks or IT mutual funds?While AI fears have driven the sharp fall in IT stocks, the correction has also reset valuations, prompting some long-term investors to see a potential entry opportunity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/no-more-hidden-charges-rbi-orders-banks-to-remove-misleading-app-tricks-2874107-2026-02-25",
      "headline": "No more hidden charges? RBI orders banks to remove misleading app tricksThe RBI's move aims to ensure customers are not misled into buying products or paying charges without proper awareness. Banks will also be barred from bundling financial products together without clear approval from the customer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-crosses-rs-161-lakh-silver-nears-rs-27-lakh-in-fresh-rally-should-you-buy-2874077-2026-02-25",
      "headline": "Gold crosses Rs 1.61 lakh, silver nears Rs 2.7 lakh in fresh rally: Should you buy?Precious metals are back in focus as gold climbs above Rs 1.61 lakh and silver approaches Rs 2.7 lakh. The steady rise has sparked fresh interest among investors, raising the key question, i.e., is this the right time to buy?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-global-economy-heading-towards-2008-like-crisis-due-to-ai-jpmorgan-ceo-jamie-dimon-warning-2874076-2026-02-25",
      "headline": "Global economy heading towards 2008-like crisis due to AI? Jamie Dimon answersJamie Dimon, JPMorgan CEO, said that some lenders and financial players are doing \"dumb things\" to make money in the current market environment, which he described as risky and uncertain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/infosys-hcltech-tcs-other-it-stocks-rebound-after-crash-key-reasons-explained-2873961-2026-02-25",
      "headline": "Infosys, HCLTech, TCS rise up to 4%: Why are IT stocks rising today?IT stocks may still be under pressure, but today's rebound shows confidence returning. The clash between AI anxiety and long-term opportunity is reshaping the narrative, pulling investors back into one of India's most-watched sectors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/waaree-energies-shares-fall-15-percent-after-us-raises-solar-import-tariffs-solar-stock-down-2873955-2026-02-25",
      "headline": "Waaree Energies shares fall 15%: What triggered the sharp fall today?Waaree Energy share price: Over the past six months, the stock has declined by Rs 464.50, or 14.74%. However, on a one-year basis, it is still up by Rs 417.85, or 18.42%, according to the latest data."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-gains-500-points-why-stock-market-rising-today-after-it-crash-hcl-infosys-tcs-hul-up-2873940-2026-02-25",
      "headline": "Sensex gains 500 points: Why is stock market rising today?The S&P BSE Sensex rose 564.63 points to 82,790.45. The NSE Nifty50 gained 167.00 points to 25,591.65 as of 9:28 am. Both indices were up by over 0.5% in early trade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-jumps-400-points-nifty-above-25500-hcltech-gains-it-stocks-up-2873925-2026-02-25",
      "headline": "Sensex, Nifty rally in early trade led by IT stocksThe S&P BSE Sensex was up 515.54 points to 82,741.46, while the NSE Nifty50 gained 181.95 points to 25,606.60 as of 11:19 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-trading-setup-will-stock-market-fall-again-today-ai-it-selloff-2873918-2026-02-25",
      "headline": "Sensex, Nifty trading setup: Will stock market fall again today?Gift Nifty futures were trading at 25,671.5 at 8:00 am. This suggests that the benchmark Nifty 50 may open above Tuesday's closing level of 25,424.65."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-israel-free-trade-agreement-fta-talks-piyush-goyal-pm-modi-visit-economic-partnership-2873872-2026-02-25",
      "headline": "India-Israel free trade talks kick off in Delhi ahead of PM Modi's visit to IsraelAhead of PM Modi's visit to Israel on Wednesday, India and Israel began the first round of negotiations for a proposed Free Trade Agreement in New Delhi. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/venezuelas-oil-comeback-massive-super-tankers-headed-to-indian-refineries-2873859-2026-02-25",
      "headline": "Venezuela sends mega 2-million-barrel oil cargoes to India as exports surgeVenezuela has chartered its first supertankers since easing US sanctions, boosting crude exports to India as refiners seek discounted heavy oil and diversify away from Russian supplies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-sons-board-decision-n-chandrasekaran-reappointment-third-term-noel-tata-conditions-2873769-2026-02-24",
      "headline": "Tata Sons defers N Chandrasekaran's 3rd term decision after Noel Tata's conditionsN Chandrasekaran's term ends in February 2027, and the board of Tata Sons was discussing extending the same when a set of conditions was put forth by Noel Tata."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/kalyani-group-firms-settle-sebi-proceedings-over-fund-misuse-allegations-with-rs-412-crore-payment-2873766-2026-02-24",
      "headline": "Kalyani Group firms settle Sebi case for Rs 4.12 crore after NSE reportKalyani Group's two listed companies have settled Sebi proceedings over alleged fund diversion, paying over Rs 4.12 crore without admitting guilt. The regulator's probe revealed suspicious investments and multi-layered transactions involving related parties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/want-to-save-tax-legally-here-are-5-ways-to-earn-income-tax-free-ppf-ssy-epf-2873710-2026-02-24",
      "headline": "Want to save tax legally? Here are 5 ways to earn income tax-freeYou don't always need complicated tricks to save on taxes. Certain incomes and investments in India are fully exempt, letting you save while staying within the law."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rashmika-vijay-walk-hand-in-hand-in-1st-photo-from-their-pre-wedding-festivities-2874563-2026-02-26",
      "headline": "Rashmika-Vijay walk hand-in-hand in 1st photo from their pre-wedding festivities A photo of actors Vijay Deverakonda and Rashmika Mandanna from their sangeet ceremony has drawn attention online. The photo offers fans a look into the close-knit celebration as the two get married in Udaipur today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/davinder-gill-constable-aujla-kohrra-season-2-authentic-punjabi-crime-drama-2874176-2026-02-26",
      "headline": "Davinder Gill on Kohrra 2, bonded labour in Punjab and breaking stereotypes Actor Davinder Gill impressed as constable Aujla in Kohrra Season 2. In an exclusive chat, he spoke about the show breaking stereotypes, working with Barun Sobti and his journey on the show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/anthony-bridgerton-kate-sharma-return-newborn-son-edmund-bridgerton-season-4-part-2-2874530-2026-02-26",
      "headline": "Bridgerton Season 4: Anthony and Kate re-enter the Ton with their newborn An exclusive first look at Bridgerton Season 4 Part 2 revealed Anthony and Kate's long-awaited return with a surprising new addition.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rashmika-mandannas-pushpa-dance-at-sangeet-leaves-vijay-deverakonda-spellbound-report-2874551-2026-02-26",
      "headline": "Rashmika Mandanna's Pushpa dance at Sangeet leaves Vijay spellbound Vijay Deverakonda and Rashmika Mandanna are celebrating their wedding with an intimate three-day event at ITC Mementos in Udaipur. Amid the festivities, a special gesture from the bride left guests swooning over the couple's chemistry."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/benny-blancos-barefoot-podcast-antics-spark-social-media-backlash-selena-gomez-support-2874488-2026-02-26",
      "headline": "Selena Gomez reacts after Benny Blanco's viral dirty feet moment Selena Gomez appeared to addressed the backlash after Benny Blanco's viral podcast moment sparked heated debate online. Here's what happened and why fans are divided."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/geetha-govindam-dear-comrade-virosh-romance-through-screen-stories-together-2874158-2026-02-26",
      "headline": "Geetha Govindam, Dear Comrade: ViRosh romance through screen stories together Vijay Deverakonda and Rashmika Mandanna's love story in real life grew with their professional collaborations.\r\nGeetha Govindam is where it started, Dear Comrade was the film where it grew, and the couple will be seen in Ranabaali after wedding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kangana-ranaut-plea-to-quash-2021-fir-in-didda-film-case-can-be-withdrawn-2874441-2026-02-25",
      "headline": "Kangana's plea to quash 2021 FIR in Didda film case can be withdrawn: High Court Bombay High Court on Wednesday permitted Kangana Ranaut to withdraw a plea seeking to quash an FIR registered in 2021 against her."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/delhi-to-host-first-international-film-festival-from-march-25-2874436-2026-02-25",
      "headline": "Delhi to host first International Film Festival from March 25 The capital will host the first International Film Festival Delhi (IFFD) from March 25 to 31, featuring over 125 Indian and international films."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/daisy-shah-calls-palash-muchhal-very-good-person-amid-smriti-mandhana-wedding-row-2874381-2026-02-25",
      "headline": "Palaash Muchhal gets support from Daisy Shah amid wedding row: He's a very good person Palaash Muchhal has received support from Daisy Shah amid the controversy surrounding his cancelled wedding with Smriti Mandhana. Daisy described him as a \"very good\" person and praised his grounded family background."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/r-madhavan-says-uae-fans-will-fly-to-india-to-watch-ranveer-singhs-dhurandhar-2-2874323-2026-02-25",
      "headline": "R Madhavan says UAE fans will fly to India to watch Ranveer Singh's Dhurandhar 2 R Madhavan said that the Dubai audience is likely to fly to India to watch Dhurandhar: The Revenge. He also claimed that the upcoming spy-thriller will put an end to films based on India–Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/gajraj-rao-band-baaja-bitiya-ad-leaves-internet-emotional-tears-guaranteed-2874365-2026-02-25",
      "headline": "Gajraj Rao's Band Baaja Bitiya ad leaves internet emotional: Tears guaranteed Gajraj Rao's new advertisement Band Baaja Bitiya for Goel TMT has moved viewers to tears with its powerful message on supporting daughters facing domestic abuse. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rashmika-mandanna-vijay-deverakonda-haldi-glimpses-are-pure-sunshine-2874303-2026-02-25",
      "headline": "Rashmika Mandanna-Vijay Deverakonda's haldi glimpses are pure sunshine Rashmika Mandanna and Vijay Deverakonda share glimpses of their carefully-decorated Haldi celebration, blending traditional and personal elements as wedding festivities progress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/konkona-sen-sharma-on-low-count-of-female-filmmakers-only-3-per-cent-is-abysmal-2874327-2026-02-25",
      "headline": "Abysmal: Konkona on only 3 per cent films being directed by female filmmakers Noting that only 3 per cent of the 2,500 films produced in India last year were directed by women, Konkona Sen Sharma has called the situation \"abysmal\". She said anything less than 50 per cent is unacceptable."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/hoppers-first-reactions-animation-sci-fi-film-praised-for-imaginative-storytelling-2874180-2026-02-25",
      "headline": "Hoppers first reactions: Animation sci-fi film praised for imaginative storytelling Daniel Chong's animated science-fiction film, Hoppers, has been praised for emotional depth and imaginative storytelling ahead of its India release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/robert-carradine-remembered-jamie-lee-curtis-first-crush-laurel-canyon-family-2874182-2026-02-25",
      "headline": "Jamie Lee Curtis mourns 'first crush' Robert Carradine in moving tribute. See post Jamie Lee Curtis has paid tribute to Robert Carradine, recalling their relationship and shared memories in the 1970s, following Carradine's death at the age of 71. The actor died at 71 after a prolonged struggle with bipolar disorder."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/jiohotstar-sonyliv-zee5-this-week-one-battle-after-another-bugonia-and-more-2874252-2026-02-25",
      "headline": "JioHotstar, SonyLiv, ZEE5 this week: One Battle After Another, Bugonia and more From Leonardo DiCaprio's intense thriller One Battle After Another to horror sequel Black Phone 2 and regional dramas like Thadayam, this week's OTT lineup is packed with variety. Here's a look at what's releasing on JioHotstar and ZEE5."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/kerala-story-2-hearing-release-date-no-relief-high-court-petitioner-malayali-community-2874234-2026-02-25",
      "headline": "High Court halts The Kerala Story 2: Don't release rights until court decides The Kerala High Court has directed the makers of The Kerala Story 2 to halt the release of the film's rights until it decides on petitions challenging its censor board certification. The court observed that the concerns raised by petitioners are \"probably genuine.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salim-khan-is-out-of-danger-i-am-in-touch-with-salman-daisy-shah-2874212-2026-02-25",
      "headline": "Salim Khan is out of danger, I am in touch with Salman: Daisy Shah Daisy Shah shared an update on Salim Khan's health after he underwent a medical procedure at Mumbai's Lilavati Hospital. She confirmed that he was stable and out of danger."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nithya-menen-launches-keyuri-banner-for-honest-film-production-2874170-2026-02-25",
      "headline": "Nithya Menen on Keyuri, her Vision and setting the record straight on her name Actor Nithya Menen has launched Keyuri, her new film production banner emphasising honesty and creative integrity. In an interview, she explained the reason behind this move and the confusion surrounding her name."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/abbas-araghchi-chabahar-being-dropped-india-budget-disappointing-tehran-delhi-iran-foreign-minister-2874555-2026-02-26",
      "headline": "Disappointing that Chabahar dropped from India's Budget: Iran Foreign MinisterIran's Foreign Minister Abbas Araghchi called the Chabahar Port a 'golden gateway' connecting the Indian Ocean region to Central Asia and beyond. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ai-summit-shirtless-protest-showdown-shimla-police-detains-delhi-cops-who-arrested-3-accused-2874445-2026-02-25",
      "headline": "Cops vs cops over 'unauthorised' arrest of shirtless protest accused in HimachalShimla Police registered a kidnapping case against Delhi Police officials who had gone there to arrest three Youth Congress members over their shirtless protest at the Delhi AI Impact Summit."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/ahead-of-india-visit-mark-carney-government-says-no-india-link-to-crimes-in-canada-2874542-2026-02-26",
      "headline": "India no longer tied to crimes in Canada, says Ottawa ahead of PM Carney's visitIn a reversal of former Canadian PM Justin Trudeau's stance, the Mark Carney government has said that India has no role in violent crimes on Canadian soil. Ahead of Carney's visit to India, senior Canadian officials said Ottawa is no longer concerned about interference or repression by Indian agents."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/can-pakistan-qualify-for-t20-world-cup-semi-final-net-run-rate-2874440-2026-02-25",
      "headline": "Sri Lanka knocked out. What do Pakistan need to qualify for semi-final?Sri Lanka were knocked out of the T20 World Cup by New Zealand on Wednesday, February 25. This loss means that Pakistan's chances to qualify for the semi-final are very slim. But what is the exact equation?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/features/story/murderbot-powered-by-claude-reasons-why-us-military-is-fighting-anthropic-over-how-to-use-ai-2874504-2026-02-26",
      "headline": "Why US Military is fighting Anthropic over how to use AI?Everyone wants a piece of Anthropic Claude AI nowadays. This includes the US Military, which wants to use Claude AI for national security. Unfortunately, the US Military and Defense Secretary Pete Hegseth have run into some resistance from Anthropic, which doesn't want its AI to kill humans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-knesset-address-israel-india-ties-terror-stand-by-with-conviction-startegic-partnership-2874401-2026-02-25",
      "headline": "India stands with Israel with full conviction, in this moment and beyond: PMPrime Minister Narendra Modi became the first Indian head of government to address Knesset, the Israeli House of Representatives. He was also the first Indian Prime Minister to visit Israel in 2017."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ncert-apologises-judicial-corruption-chapter-class-8-social-sciences-textbook-pulls-out-book-supreme-court-criticism-2874490-2026-02-26",
      "headline": "Purely unintentional: NCERT sorry over judicial corruption chapter, pulls out bookIn Chapter 4, the Class 8 Social Sciences textbook outlines structural challenges facing courts, including judge shortages, procedural complexity and infrastructure gaps, and links these issues to concerns about public confidence in the justice system."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/israeli-lobby-behind-trumps-anti-tehran-stance-iran-foreign-minister-abbas-araghchi-1979-islamic-revolution-2874355-2026-02-25",
      "headline": "Israeli lobby behind Trump's anti-Tehran stance? What Iran Foreign Minister saidSpeaking with India Today TV in an exclusive interview, Iran's Foreign Minister said Iran believes American policy, including under President Donald Trump, has been formed by misunderstanding and external influence rather than direct engagement with Iranian society."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/watch-two-skiers-rescue-man-buried-in-snow-at-resort-in-california-2874565-2026-02-26",
      "headline": "Skiers save man suffocating under snow in California, rescue video goes viralTwo skiers at a ski resort in California rescued a man buried under deep snow in a dramatic video that has been circulating on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rashmika-mandanna-vijay-deverakonda-wedding-live-update-udaipur-2874485-2026-02-26",
      "headline": "Rashmika-Vijay wedding live: Bride's stunning Pushpa dance floors groomRashmika-Vijay Udaipur Wedding Live Updates: The wedding celebrations of Rashmika Mandanna and Vijay Deverakonda are underway in Udaipur, with early Instagram glimpses pointing to a celebration that marries charm with refined elegance."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/us-air-force-pilot-gerald-eddie-brown-f-35-lightning-pilot-arrested-tactical-training-chinese-military-2874543-2026-02-26",
      "headline": "Ex-US Air Force pilot arrested for providing tactical training to Chinese MilitaryA former F-35 Lightning II instructor pilot of the US Air Force has been arrested and charged with illegally providing defence services and advanced tactical training to the Chinese military. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-zimbabwe-prediction-t20-world-cup-super-8-preiew-2874492-2026-02-26",
      "headline": "IND vs ZIM preview: At generous Chepauk, wounded India look to revive power gameIndia vs Zimbabwe, T20 World Cup Super 8 preview: A batting-friendly Chepauk offers wounded India the ideal stage to revive their power game and make a statement. Zimbabwe, meanwhile, look to regroup after a morale-crushing 107-run defeat to West Indies in their Super 8 opener."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/benny-blancos-barefoot-podcast-antics-spark-social-media-backlash-selena-gomez-support-2874488-2026-02-26",
      "headline": "Selena Gomez reacts after Benny Blanco's viral dirty feet momentSelena Gomez appeared to addressed the backlash after Benny Blanco's viral podcast moment sparked heated debate online. Here's what happened and why fans are divided."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/features/story/samsung-galaxy-s26-ultra-quick-review-now-you-see-me-now-you-dont-2874442-2026-02-25",
      "headline": "Samsung Galaxy S26 Ultra quick review: Now you see me, now you don'tWhile the industry has spent years obsessing over folding glass, the Galaxy S26 Ultra shifts the focus to what you can't see. Here are our first impressions. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/venezuelas-oil-comeback-massive-super-tankers-headed-to-indian-refineries-2873859-2026-02-25",
      "headline": "Venezuela sends mega 2-million-barrel oil cargoes to India as exports surgeVenezuela has chartered its first supertankers since easing US sanctions, boosting crude exports to India as refiners seek discounted heavy oil and diversify away from Russian supplies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-zimbabwe-t20-world-cup-abhishek-sharma-run-slum-how-can-he-fix-it-2874560-2026-02-26",
      "headline": "The Abhishek Sharma slump: What's gone wrong and how he can fix itT20 World Cup: Abhishek Sharma was in the form of his life going into the T20 World Cup. What's gone wrong? India Today delves into the left-hander's problems and how to fix those ahead of the team's do-or-die clash against Zimbabwe."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/bali-rain-giant-python-swims-through-flooded-road-historic-rain-submerges-indonesia-island-2874549-2026-02-26",
      "headline": "Watch: Giant python swims through flooded road in Bali amid historic rainThe shocking footage emerged after more than 72 hours of near-continuous rain lashed parts of the Indonesian resort island, swelling rivers, flooding homes and villas, and turning roads into waterways."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/meghalaya-assembly-sangma-vs-sangma-exchange-in-assembly-meghalaya-cm-conrad-faces-wifes-questions-2874435-2026-02-25",
      "headline": "Sangma vs Sangma: Meghalaya Chief Minister faces wife's questions in AssemblyA rare political face-off between husband and wife MLAs unfolded in Meghalaya Assembly, spotlighting delays in crucial livestock education projects. The debate highlighted urgent needs and government efforts to bolster the state's livestock sector."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-jamaat-ameer-shafiqur-rahman-criticism-president-shahbuddin-muhammad-yunus-islamist-nexus-2874262-2026-02-26",
      "headline": "Jamaat chief blasts Bangladesh President, reveals Yunus-Islamists nexusDays after Bangladesh President Mohammed Shahabuddin revealed the unconstitutional actions of the Muhammad Yunus-led interim regime and how he was treated by it, Bangladesh Jamaat-e-Islami Ameer Shafiqur Rahman criticised the former. This is how Rahman's criticism of the President reveals the tacit relationship between the Yunus regime and Bangladesh's Islamist groups."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/features/story/started-5-years-ago-anthropic-now-more-valuable-than-infosys-wipro-tcs-hcl-combined-2873654-2026-02-25",
      "headline": "Started 5 years ago, Anthropic now worth more than Infosys, TCS, Wipro, HCLAnthropic is an AI giant and a boogeyman as far as Indian IT industry is concerned. Yet, the surprising fact is that this is a 5-year-old company. In these five years it has gone from being a safety-focused AI startup to a $380 billion behemoth, now worth more than Indian tech giants TCS, Infosys, Wipro and HCLTech combined."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/mini-satellite-sivagangai-government-school-students-class-xi-mini-satellite-vikko-sat-launch-2874482-2026-02-26",
      "headline": "Watch: Indian high school students design, launch mini satelliteClass XI students from a Sivagangai government school built and launched the Vikko Sat 1 mini satellite. The device reached 22 km to detect atmospheric fungal spores.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/can-10-minute-house-help-apps-replace-the-traditional-bai-2873765-2026-02-25",
      "headline": "India's 10-minute house help craze is growing, but the math is not math-ingUrban India has a new craze. No surprises here, this one too caters to its never-ending appetite for convenience. This time, it involves using apps to call a house help to your doorstep within 10 minutes. At the moment, workers enrolling on these apps are benefiting significantly. Customers are too, thanks to heavily discounted pricing. But for how long?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-west-indies-india-t20-world-cup-super-8-clash-ahmedabad-2874446-2026-02-26",
      "headline": "India keep close watch as South Africa, West Indies aim for semis spotsSouth Africa and West Indies face off in a crucial Super 8 match at the Narendra Modi Stadium in Ahmedabad. The winner will take a big step towards the T20 World Cup 2026 semi-finals, with net run rate playing a key role."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/indian-entrepreneur-sells-startup-exits-sweden-xenophobic-system-2874313-2026-02-25",
      "headline": "Destroyed my life: Indian CEO sells firm, quits Sweden, blames xenophobiaWhat was meant to be a startup success story in Sweden has ended in an anguished exit for Indian entrepreneur Abhijith Nag Balasubramanyam. Ten months after founding a company, he has been forced to sell his business and return to India. What's behind the move? What challenges did he face? Read on to find out."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/t20-world-cup-sri-lanka-vs-new-zealand-dasun-shanaka-press-conference-2874570-2026-02-26",
      "headline": "Dasun Shanaka apologises to fans as Sri Lanka crash out of T20 World Cup T20 World Cup: After crashing out of the T20 World Cup 2026, Sri Lanka captain Dasun Shanaka issued an apology to fans, saying that they failed to provide a win to make them happy during the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-zimbabwe-t20-world-cup-abhishek-sharma-run-slum-how-can-he-fix-it-2874560-2026-02-26",
      "headline": "The Abhishek Sharma slump: What's gone wrong and how he can fix it T20 World Cup: Abhishek Sharma was in the form of his life going into the T20 World Cup. What's gone wrong? India Today delves into the left-hander's problems and how to fix those ahead of the team's do-or-die clash against Zimbabwe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/t20-world-cup-sri-lanka-vs-new-zealand-rachin-ravindra-press-confernece-colombo-2874541-2026-02-26",
      "headline": "Beating Sri Lanka at home is a big achievement for New Zealand: Rachin Ravindra T20 World Cup: New Zealand all-rounder Rachin Ravindra said their win over Sri Lanka was a big achievement, especially on Sri Lankan soil. With the victory over the co-hosts, New Zealand are now in a strong position to secure a semi-final spot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-india-vs-zimbabwe-chennai-metro-free-rides-match-ticket-holders-chepauk-2874517-2026-02-26",
      "headline": "Chennai metro steps up for IND vs ZIM: Free tickets for fans to Chepauk Chennai Metro Rail Limited will provide complimentary metro rides on Thursday, February 26, for those attending the India vs Zimbabwe Super 8 match, with match tickets doubling as metro passes. The initiative includes extended services to midnight and special operational measures near the Chepauk stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-nz-vs-sl-rachin-ravindra-cannot-underestimate-england-semifinal-hopes-super-8-2874528-2026-02-26",
      "headline": "Sri Lanka job done, but New Zealand cannot underestimate England: Rachin Ravindra T20 World Cup: Rachin Ravindra said New Zealand cannot afford to take England lightly despite beating Sri Lanka. With a semi-final spot at stake, their final Super 8 clash will decide how far this campaign goes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-nz-vs-sl-dasun-shanaka-negativity-governement-help-knocked-out-fan-support-2874521-2026-02-26",
      "headline": "Shanaka blames negativity, seeks government help after Sri Lanka's World Cup exit T20 World Cup: Dasun Shanaka blamed growing negativity and tough conditions after Sri Lanka's T20 World Cup exit, urging government support to protect future players as the 2014 champions crashed out following a heavy defeat at Khettarama."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-zimbabwe-prediction-t20-world-cup-super-8-preiew-2874492-2026-02-26",
      "headline": "IND vs ZIM preview: At generous Chepauk, wounded India look to revive power game India vs Zimbabwe, T20 World Cup Super 8 preview: A batting-friendly Chepauk offers wounded India the ideal stage to revive their power game and make a statement. Zimbabwe, meanwhile, look to regroup after a morale-crushing 107-run defeat to West Indies in their Super 8 opener."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-west-indies-india-t20-world-cup-super-8-clash-ahmedabad-2874446-2026-02-26",
      "headline": "India keep close watch as South Africa, West Indies aim for semis spots South Africa and West Indies face off in a crucial Super 8 match at the Narendra Modi Stadium in Ahmedabad. The winner will take a big step towards the T20 World Cup 2026 semi-finals, with net run rate playing a key role."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/south-africa-vs-west-indies-t20-world-cup-keshav-maharaj-press-conference-super-8-2874470-2026-02-26",
      "headline": "South Africa wary of explosive West Indies threat in Super 8: Keshav Maharaj T20 World Cup 2026, SA vs WI: Keshav Maharaj, speaking to the reporters before the Super 8 clash on Thursday in Ahmedabad, said that South Africa are wary of the threat West Indies pose. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/west-indies-vs-south-africa-t20-world-cup-floyd-reifer-press-conference-2874468-2026-02-26",
      "headline": "West Indies have flown under the radar, but have nothing to prove: Floyd Reifer T20 World Cup, SA vs WI: Speaking to the reporters before their Super 8 clash against South Africa in Ahmedabad, West Indies batting coach Floyd Reifer said that the team hasn't got enough attention of late, but they don't have any point to prove."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indian-women-cricketers-womens-bangladesh-premier-league-smriti-mandhana-2874461-2026-02-26",
      "headline": "Smriti Mandhana, Jemimah Rodrigues in Women's Bangladesh Premier League? BCB opens upThe BCB has stated that Indian cricketers are welcome to participate in the inaugural edition of the Women's Bangladesh Premier League. At present, the Indian players are in Australia, competing in a multi-format series against the hosts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/t20-world-cup-india-vs-zimbabwe-ryan-burl-press-conference-super-8-2874453-2026-02-25",
      "headline": "India have got home advantage, but pressure does funny things to teams: Ryan BurlT20 World Cup 2026, IND vs ZIM: Speaking to the reporters, all-rounder Ryan Burl said that both India and Zimbabwe will be under pressure going into their Super 8 clash on Thursday at the MA Chidambaram Stadium in Chennai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/can-pakistan-qualify-for-t20-world-cup-semi-final-net-run-rate-2874440-2026-02-25",
      "headline": "Sri Lanka knocked out. What do Pakistan need to qualify for semi-final?Sri Lanka were knocked out of the T20 World Cup by New Zealand on Wednesday, February 25. This loss means that Pakistan's chances to qualify for the semi-final are very slim. But what is the exact equation?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-beat-sri-lanka-t20-world-cup-2026-semi-final-chances-pakistan-2874437-2026-02-25",
      "headline": "New Zealand knock Sri Lanka out of T20 World Cup, Pakistan in huge trouble as wellT20 World Cup, NZ vs SL: Mitchell Santner's New Zealand knocked Sri Lanka out of the competition with a dominating 61-run win on Wednesday at the R Premadasa Stadium in Colombo. Rachin Ravindra was the star for the Black Caps with four wickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-zimbabwe-predicted-playing-xi-sanju-samson-axar-patel-2874397-2026-02-25",
      "headline": "Samson in, Tilak out? In do-or-die clash, India consider big changesIndia vs Zimbabwe: The Indian team are likely to make important changes in their playing XI in their do-or-die clash against Zimbabwe. Sanju Samson is likely to get a look-in."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/amelia-kerr-century-new-zealand-t20i-win-zimbabwe-hamilton-captaincy-2874379-2026-02-25",
      "headline": "Amelia Kerr makes dream start to New Zealand captaincy era with special all-round showNZW vs ZIMW, 1st T20I: Amelia Kerr delivered a stunning all-round performance on Wednesday, smashing a 51-ball century and returning figures of 4-0-14-2 as New Zealand defeated Zimbabwe by 92 runs at Seddon Park in Hamilton."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zimbabwe-sikandar-raza-100-per-cent-fit-for-must-win-india-clash-2874377-2026-02-25",
      "headline": "T20 World Cup: Zimbabwe's Sikandar Raza 100 per cent fit for must-win India clashZimbabwe leg-spinner Ryan Burl brushed aside any fitness concerns around captain Sikandar Raza, confirming that the talismanic all-rounder is \"100 per cent\" fit for their must-win Super 8 clash against India in the T20 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/t20-world-cup-ind-vs-zim-india-batting-coach-sitanshu-kotak-pre-match-press-conference-2874315-2026-02-25",
      "headline": "India have to be positive, handle pressure to win T20 World Cup: Batting coachHere is the full transcript of India batting coach Sitanshu Kotak's press conference ahead of their second Super 8 clash against India in ICC Men's T20 World Cup in Chennai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sidra-amin-icc-sanction-equipment-abuse-pakistan-south-africa-odi-2874326-2026-02-25",
      "headline": "Pakistan Women's batter reprimanded by ICC after outburst against South AfricaSAW vs PAKW, 1st ODI: Pakistan Women's batter Sidra Amin was reprimanded for her outburst following her dismissal in the first ODI against South Africa at the Mangaung Oval in Bloemfontein."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-keshav-maharaj-west-indies-t20-world-cup-super-8-ahmedabad-venue-adaptation-2874314-2026-02-25",
      "headline": "Adaptation is key: South Africa's Maharaj plays down Ahmedabad's familiarity advantageSA vs WI, T20 World Cup 2026 Super 8s: South Africa spinner Keshav Maharaj says adaptation, not venue familiarity, will be key when the Proteas face West Indies in a crucial T20 World Cup Super 8 clash in Ahmedabad on Thursday.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-vs-sri-lanka-live-score-super-8s-t20-world-cup-colombo-2874290-2026-02-25",
      "headline": "NZ vs SL Super 8 Live: New Zealand knock Sri Lanka out of World CupNew Zealand (NZ) vs Sri Lanka (SL), T20 World Cup Super 8 Highlights: SL (107/8 in 20 ovs) lose to NZ by 61 runs. Sri Lanka have been knocked out of the T20 World Cup. With the huge win, New Zealand take a big step towards semi-finals. Pakistan are all but out of the tournament as well."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-final-jammu-and-kashmir-vs-karnataka-day-2-report-2874280-2026-02-25",
      "headline": "Ranji Trophy final: J&K tighten grip on bad light-hit Day 2 against KarnatakaJammu and Kashmir deepened Karnataka's troubles by piling up 527 for six, taking firm control of the Ranji Trophy final before bad light brought an early end to Day 2 on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-zim-sanju-samson-rinku-singh-abhishek-sharma-t20-world-cup-2874202-2026-02-25",
      "headline": "Will Samson play vs Zimbabwe? Batting coach hints at change in batting orderT20 World Cup: Will India change their batting line-up in their do-or-die clash? After India's disaster against South Africa. India batting coach Sitanshu Kotak hinted that there might be changes in the batting order."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-t20i-rankings-abhishek-sharma-retains-no1-spot-ishan-kishan-top-five-2874196-2026-02-25",
      "headline": "Abhishek Sharma retains top rank despite poor form, Ishan Kishan breaks into top 5Star opener Abhishek Sharma retained his No. 1 spot despite his horrible run in the ongoing T20 World Cup. At the same time, wicketkeeper-batter Ishan Kishan stormed into the top five of the latest International Cricket Council (ICC) Men's T20I Player Rankings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/cheating-allegations-chess-world-champion-d-gukesh-denies-claims-addresses-ethics-2874131-2026-02-25",
      "headline": "Gukesh slams Kramnik over cheating allegations in chess: Not supportive of itWorld chess champion D Gukesh distances himself from Vladimir Kramnik's allegations of widespread cheating in chess, emphasising his opposition to unethical play but urging the chess community to avoid overreacting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-india-vs-zimbabwe-rinku-singh-return-father-health-emergency-2874142-2026-02-25",
      "headline": "Rinku Singh to rejoin India squad ahead of ZIM clash after family emergencyT20 World Cup: Rinku Singh is set to rejoin the India squad ahead of their crucial Super 8 clash against Zimbabwe on Thursday, February 26 after tending to a family emergency. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-salman-agha-family-online-abuse-pakistan-loss-vs-england-2874104-2026-02-25",
      "headline": "Pakistani fans target Salman Agha's family after heartbreaking loss to EnglandPakistan captain Salman Ali Agha's wife, Sabba Manzer, has alleged that she and her son were subjected to online abuse by Pakistani cricket fans following the team's defeat to England in the ICC T20 World Cup 2026 on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/t20-world-cup-england-vs-pakistan-harry-brook-press-conference-ashes-2874100-2026-02-25",
      "headline": "Brook happy to reap rewards of hard work as England captain after tough winterT20 World Cup: Harry Brook said he is happy to put behind him a tough winter and reap the rewards of the hard work he has put in after guiding England to the semi-final of the T20 World Cup. Brook scored a fantastic hundred to help England reach the semi-final of the T20 World Cup. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-t20-world-cup-loss-ravi-shastri-tactical-change-2874095-2026-02-25",
      "headline": "T20 World Cup: Ravi Shastri calls South Africa loss a timely shake-up for IndiaFormer India head coach Ravi Shastri feels India's 76-run hammering by South Africa in the Super Eights of the ICC Men's T20 World Cup could prove to be a timely wake-up call rather than a decisive setback to their semi-final chances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-undroppable-politics-insurance-policy-mike-hesson-t20-world-cup-2874062-2026-02-25",
      "headline": "Babar Azam 'undroppable' due to politics; Hesson using him as 'insurance': VaughanFormer England captain Michael Vaughan said Babar Azam remains undroppable in Pakistan's T20 World Cup 2026 campaign due to internal dynamics, but praised coach Mike Hesson for using him smartly as an \"insurance policy.\""
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}