{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/advance-tax-alert-first-instalment-due-by-june-15-find-out-if-you-are-liable-2740396-2025-06-13",
      "headline": "Advance tax alert: First instalment due by June 15, find out if you are liableAdvance tax simply means paying your income tax in parts throughout the year, instead of waiting till the end. If your total tax due for the year is more than Rs 10,000, then you must pay it in advance in four instalments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/iran-israel-tensions-rise-why-india-should-worry-strait-of-hormuz-plays-a-vital-role-in-global-energy-supply-2740371-2025-06-13",
      "headline": "Iran-Israel tensions rise. Why India should worryThe escalating Iran-Israel conflict poses significant challenges for India, particularly concerning oil imports and economic stability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-settles-573-points-lower-nifty-below-24800-adani-ports-falls-3-percent-iran-israel-war-2740342-2025-06-13",
      "headline": "Sensex settles 573 points lower, Nifty below 24,800; Adani Ports falls 3%The S&P BSE Sensex was down by 573.38 points to end at 81,118.60, while the NSE Nifty50 lost 169.60 points to close at 24,718.60. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/gold-prices-surge-india-israel-iran-conflict-geopolitical-tensions-2740330-2025-06-13",
      "headline": "Gold prices rise sharply amid Israel-Iran tensions in IndiaThe rise in gold prices is being linked to worries over a possible wider conflict in the Middle East, which has made investors turn to gold as a safe place to park money. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/oswal-pumps-ipo-subscription-june-13-to-17-rs-1387-crore-issue-strong-brokerage-ratings-2740309-2025-06-13",
      "headline": "Oswal Pumps opens Rs 1,387 crore IPO with strong brokerage backingOswal Pumps targets Rs 1,387.34 crore from IPO. Experts recommend subscribing due to strong fundamentals. IPO open until June 17, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/air-india-crash-rattles-hotel-and-ticketing-stocks-as-investor-confidence-wavers-impact-on-indian-stock-market-2740247-2025-06-13",
      "headline": "Air India crash rattles hotel and ticketing stocks, as investor confidence waversOnline travel companies were among the most affected. Shares of Thomas Cook India fell by 2.39%, trading at Rs 160.03 as of June 13, 1PM. TBO Tek dropped 1.10% to Rs 1,287.40, while Mahindra Holidays slipped 1.47% to Rs 342.35."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/air-india-crash-in-ahmedabad-how-airline-insurance-works-and-why-premiums-may-rise-2740170-2025-06-13",
      "headline": "Air India crash: How airline insurance works and why premiums may riseIncidents like the recent Air India crash can result in a total loss, meaning the aircraft is beyond repair with no salvageable parts. In such cases, the losses can reach around $130 million, roughly $80 million for the plane and $30-50 million in liabilities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/air-india-insurance-cover-new-india-assurance-tata-aig-global-reinsurers-2740162-2025-06-13",
      "headline": "Who are the likely insurers for Air India plane crash?The plane involved in the crash was a Boeing 787-8 Dreamliner, one of the most modern aircraft used in commercial aviation. It was carrying 242 people, including 12 crew members. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/boeing-comeback-on-trial-after-air-india-dreamliner-crash-kills-241-2740174-2025-06-13",
      "headline": "Boeing's revival on trial after deadly Air India Dreamliner crash in AhmedabadThe fatal crash of Air India flight AI-171, a Boeing 787-8 Dreamliner, minutes after takeoff from Ahmedabad, has killed 241 people on board, reigniting serious doubts over Boeing's aircraft safety and corporate oversight."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/oil-stocks-fall-israel-iran-war-brent-crude-oil-price-rise-bpcl-ongc-ioc-asian-paints-2740141-2025-06-13",
      "headline": "Oil shock hits Dalal Street: BPCL, ONGC, IOC, other crude-sensitive stocks fallBrent crude oil futures jumped more than 9% to touch around $75.61 per barrel, reaching a multi-month high. The gain came after Israel said it had launched what it called \"preemptive strikes\" against Iran."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/rbi-steps-in-to-contain-fallout-of-oil-price-jump-on-rupee-2740112-2025-06-13",
      "headline": "RBI steps in to contain fallout of oil price jump on rupee: ReportThe Indian rupee dropped to 86.20 against the US dollar in early trade but later recovered to 86.04, helped by the central bank's likely intervention."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/aviation-stocks-fall-market-crash-spicejet-indigo-adani-enterprises-tata-group-shares-air-india-plane-crash-2740108-2025-06-13",
      "headline": "Aviation stocks tumble after Air India plane crash in AhmedabadSpiceJet's share price dropped 3.42% at the start of the trading session. InterGlobe Aviation Ltd, the company that runs IndiGo, also fell 4.83%, slipping to Rs 5,212 in early trade."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/air-india-crash-ahmedabad-boeing-back-in-the-dock-heres-a-list-of-docus-on-the-aviation-giant-2740471-2025-06-13",
      "headline": "Air India crash reignites Boeing concerns: Here's what global documentaries revealThe recent Air India crash in Ahmedabad has once again cast a spotlight on Boeing. As questions mount about potential technical failures, several documentaries have resurfaced, shedding light on Boeing's troubled history. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-expresses-grief-over-air-india-crash-sends-prayers-2740459-2025-06-13",
      "headline": "Amitabh Bachchan expresses grief over Air India crash, sends prayersMegastar Amitabh Bachchan sent prayers for the victims and families of those affected by the Air India flight crash in Ahmedabad. Several celebrities from the Indian film industry have shared their condolences on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/sabrina-carpenter-defends-racy-artwork-and-lyrics-of-her-songs-you-are-sharing-them-2740424-2025-06-13",
      "headline": "You're sharing them: Sabrina Carpenter defends racy artwork and lyrics of her songsIn a recent interview, singer-songwriter Sabrina Carpenter clapped back at the critics, addressing the backlash she received for her recent cover artwork for her upcoming album 'Man's Best Friend'. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/unni-mukundan-recalls-growing-up-near-air-india-crash-site-ahmedabad-spent-24-years-2740422-2025-06-13",
      "headline": "Actor Unni Mukundan recalls growing up near Air India crash site: Spent 24 yearsMalayalam actor Unni Mukundan spent his childhood and adolescence in Ahmedabad and stayed in proximity to the Air India flight crash site until he turned 24. He expressed deep shock over the tragic crash that claimed 265 lives. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-basil-joseph-to-collaborate-on-a-superhero-film-report-2740394-2025-06-13",
      "headline": "Allu Arjun, Basil Joseph to collaborate on a superhero film: ReportAfter locking 'AA22' with Atlee, superstar Allu Arjun is now eyeing a fresh collaboration with Malayalam director Basil Joseph for what's rumoured to be a superhero film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-reunion-what-it-means-for-the-fandom-and-indian-army-2740219-2025-06-13",
      "headline": "BTS reunion: What it means for the fandom and Indian ARMYBTS's six members have completed their military service, promising a long-awaited reunion with fans globally, especially the passionate Indian ARMY. Their comeback marks not just a musical event but a cultural and economic milestone poised to energise India's live music scene."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-leaves-fans-swooning-with-recent-public-appearance-in-chennai-2740404-2025-06-13",
      "headline": "Ajith Kumar, 54, leaves fans swooning with recent public appearance in ChennaiActor Ajith Kumar was clicked leaving the passport office in Chennai earlier today. As soon as the clip surfaced online, fans couldn't help but gush over the look in a formal outfit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/harshvardhan-rane-sonam-bajwa-fire-incident-2740358-2025-06-13",
      "headline": "Harshvardhan Rane-Sonam Bajwa's Deewaniyat set catches fire amid celebrationA freak incident occurred on the sets of Harshvardhan Rane and Sonam Bajwa's 'Ek Deewane Ki Deewaniyat' on Thursday when helium balloons caught fire. However, no injuries were reported."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/sana-makbul-diagnosed-with-liver-cirrhosis-hopes-to-avoid-transplant-2740372-2025-06-13",
      "headline": "Actor Sana Makbul diagnosed with liver cirrhosis, hopes to avoid transplantActor Sana Makbul's health has taken a serious turn as she's been diagnosed with liver cirrhosis. She shared that she has begun immunotherapy and is now focused on her recovery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sonam-bajwa-joins-diljit-dosanjh-in-border-2-to-start-shooting-this-month-report-2740346-2025-06-13",
      "headline": "Sonam Bajwa joins Diljit Dosanjh in Border 2, to start shooting this month: ReportActor Sonam Bajwa reportedly joined the cast of Sunny Deol starrer 'Border 2'. She is expected to start shooting for the film by the end of June and has been paired opposite Diljit Dosanjh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nagarjuna-calls-rajnikanths-coolie-whistle-worthy-film-praises-lokesh-kanagaraj-2740345-2025-06-13",
      "headline": "Nagarjuna calls Rajnikanth's Coolie whistle-worthy film, praises Lokesh KanagarajAhead of his big release 'Coolie', actor Nagarjuna Akkineni spoke about working with director Lokesh Kanagaraj, calling him a 'whistle factor' and recalled the massive fan response he witnessed on the streets of Chennai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/roshan-mathews-wwe-inspired-malayalam-wrestling-film-chatha-pacha-starts-shooting-2740321-2025-06-13",
      "headline": "Chatha Pacha: Roshan Mathew's WWE-inspired Malayalam wrestling film beginsDirected by debutant Adhvaith Nayar, the wrestling film titled 'Chatha Pacha' stars Roshan Mathew, Arjun Ashokan, Vishak Nair and Ishan Shaukath in lead roles. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/materalists-review-this-romance-glitters-but-fades-like-perfume-in-wind-2740339-2025-06-13",
      "headline": "Materialists review: This romance glitters, but fades like perfume in windReleased-Fri Jun 13, 2025'Materialists' works well when it shows a flawed, ambitious, beautiful woman just trying to live her best life. But, what she preaches, and the choices she makes, especially when it comes to men, doesn't really seem right. Also, how does a romantic film work in the absence of good intimate scenes, especially when you have such pretty faces leading the story? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/alia-bhatts-childhood-pic-with-paresh-rawal-goes-viral-fans-link-it-to-tamanna-sets-2740253-2025-06-13",
      "headline": "Munawar Faruqui hangs out with newlyweds Hina Khan and Rocky Jaiswal on show setsActors Hina Khan and Rocky Jaiswal met comedian Munawar Faruqui on the sets of their upcoming show, 'Pati Patni Aur Panga.' They were seen spending quality time on the sets of the show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/alia-bhatt-sharvari-to-feature-in-special-dance-track-for-action-film-alpha-2740240-2025-06-13",
      "headline": "Alia Bhatt, Sharvari to feature in special dance track for action film Alpha: ReportActors Alia Bhatt and Sharvari are working hard on a special dance song for their new action film 'Alpha'. The movie will release in theatres during Christmas 2025 and also stars Anil Kapoor and Bobby Deol."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sussanne-khan-on-co-parenting-with-hrithik-roshan-2740237-2025-06-13",
      "headline": "Sussanne Khan grateful and blessed to have Hrithik Roshan as co-parentSussanne Khan reflected on co-parenting with actor Hrithik Roshan, shedding light on their commitment to providing a nurturing environment for their sons. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prabhass-the-raja-saab-teaser-leaked-makers-warn-of-strict-action-2740255-2025-06-13",
      "headline": "Prabhas's The Raja Saab teaser leaked, makers warn of strict actionWith just three days to go for the official teaser release of Prabhas' 'The Raja Saab', a few visuals and a short clip from the film were leaked online, prompting the makers to issue a firm warning against the circulation of leaked content."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/rana-naidu-2-review-acting-brilliance-saves-the-day-despite-cinematic-stereotypes-2740245-2025-06-13",
      "headline": "Rana Naidu 2 review: Strong family drama, but familiar stereotypes in average showReleased-Fri Jun 13, 2025Rana Naidu 2 review: 'Rana Naidu 2', starring Rana Daggubati in the titular role, is streaming on Netflix. Does the crime-thriller live up to expectations? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vir-das-backs-air-india-after-crash-calls-them-best-crew-in-the-sky-2740236-2025-06-13",
      "headline": "Vir Das backs Air India after crash, calls them best crew in the skyOn Thursday, Vir Das lent his support to Air India, stating that he stands with them. This came following the crash of its London-bound flight AI171 in Ahmedabad. \r\n\r\n\r\n\r\n\r\n\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/aviation-body-orders-fuel-engine-system-checks-for-every-air-india-boeing-dreamliner-flight-from-june-15-2740428-2025-06-13",
      "headline": "Big order for all Air India Boeing Dreamliners after deadly Ahmedabad crashThe Directorate General of Civil Aviation (DGCA) has ordered enhanced safety checks for Boeing Dreamliner planes operated by Air India, in view of the deadly Ahmedabad crash that claimed at least 265 lives."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/black-box-of-air-india-flight-recovered-from-rooftop-of-building-it-hit-in-ahmedabad-sources-2740391-2025-06-13",
      "headline": "Black box of Air India flight recovered from rooftop of building it hitA day after the Air India Ahmedabad-London flight crash in Ahmedabad, investigators have located the black box, an important device that will help investigate what led to the accident."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/tata-chairman-writes-to-colleagues-on-air-india-crash-ahmedabad-darkest-days-2740469-2025-06-13",
      "headline": "One of the darkest days: Tata chairman writes to colleagues on Air India crashTata Group and Air India Chairman N Chandrasekharan called Air India flight crash day one of the darkest days in the group's history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-was-aware-of-israels-strikes-on-iran-in-advance-says-no-surprises-report-2740109-2025-06-13",
      "headline": "Iran hardliners dead now, and it'll get worse: Trump urges Tehran to make a dealDonald Trump claimed that he and his administration had prior information that Israel was going to strike Iran and he hopes that Iran will return to the negotiating table following the strikes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-india-flight-171-crash-pilots-shaken-fear-airport-ahmedabad-london-aviation-safety-plane-heres-how-2740435-2025-06-13",
      "headline": "I don't want to be next: How Air India crash must have shaken pilots at AhmedabadThe Air India Flight 171 crash shook many, especially pilots who took off just hours later from Ahmedabad. Some recalled flying after a crash with \"tears in my eyes\" and a pounding heart. Despite rigorous training, pilots admit that fear lingers, but they rely on muscle memory and a problem-solving mindset to carry on. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ahmedabad-plane-crash-live-updates-air-india-flight-boeing-london-passengers-death-casualties-rescue-2739697-2025-06-12",
      "headline": "Live: Black box found from plane crash site within 28 hours: Union MinisterAir India Ahmedabad-London Flight Crash Live: At least 265 people died in Ahmedabad after a London-bound Air India plane crashed into a government-run medical hostel moments after taking off from the city airport on Wednesday. The airline confirmed that the flight carried 242 passengers and there was only one survivor, who was seated on 11A. It also said that a digital video recorder was found, but a search was on to find the black box after earlier reports suggested that it had been discovered. Prime Minister Narendra Modi visited Ahmedabad earlier today and took stock of the situation. Stay with Indiatoday.in for live updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-india-plane-crash-victim-arjun-patolia-travelled-london-to-india-scatter-wife-ashes-gujarat-2740254-2025-06-13",
      "headline": "He came to fulfil his wife's dying wish. Then he boarded doomed Air India flightLondon resident Arjun Patolia, a father of two, had travelled to India to scatter his late wife's ashes in River Narmada in Gujarat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-launches-airstrike-in-iran-explosions-heard-in-tehran-report-glbs-2740035-2025-06-13",
      "headline": "Israel hits Iran's nuke sites, Army chief killed; Tehran retaliates with 100 drones Live UpdatesIsrael on Friday launched preemptive strikes on Iran, which the nation called Operation Rising Lion, and said was necessary to wade off the nuclear threat from Tehran's side. Meanwhile, Iran has vowed retaliation and after the strikes killed several, including Iran's Revolutionary Guards Commander Hossein Salami."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/history-of-it/story/ahmedabad-air-crash-vijay-rupani-air-india-1965-india-pakistan-war-sabre-gujarat-cm-balwantrai-mehta-2740230-2025-06-13",
      "headline": "When a Pak fighter jet shot down Gujarat CM's plane 60 years agoSixty years before former Gujarat CM Vijay Rupani lost his life in the Air India crash on Thursday, a sitting Gujarat CM was lost mid-air, not to malfunction, but to a Pakistani strike. During the India-Pakistan War of 1965, a Pakistani fighter shot down Balwantrai Mehta's Beechcraft aircraft, perceiving it as to be a surveillance aircraft."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/air-india-flight-missed-by-bhoomi-chouhan-as-she-was-stuck-in-traffic-calls-it-her-re-birth-2740341-2025-06-13",
      "headline": "Was stuck in traffic, it's my rebirth: Woman who missed London flight by 10 minutesThe check-in gates were closed at 1.10 pm. However, she reached the airport at around 1.20 pm, which ultimately resulted in her missing the flight."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-india-plane-crash-pilot-sumeet-sabharwal-clive-kunder-ahmedabad-crew-profile-2740235-2025-06-13",
      "headline": "One was to quit, another just started: Tale of two pilots of Air India crashWhile Captain Sumeet Sabharwal was days away from quitting flying, First Officer Clive Kunder was just starting his career in the skies. Both the pilots commanding the Air India Dreamliner died when their aircraft crashed in Ahmedabad, killing all, but one, on board."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/air-india-crash-videos-suggest-errors-in-cockpit-take-off-drills-2740286-2025-06-13",
      "headline": "Air India crash videos suggest errors in cockpit take-off drillsThe analysis explores probable causes of the catastrophic crash, focusing on the Air India plane's low altitude, low speed, and landing gear configuration, based on crash videos."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/can-a-perfume-put-you-to-good-nights-sleep-2739597-2025-06-13",
      "headline": "Can a perfume put you to good night's sleep?Not just a pre-date ritual, perfumes are now part of bedtime routines—and they're helping people sleep like babies. There's science to back it up, too."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/plane-broke-my-seat-came-off-lone-air-india-crash-survivor-reveals-how-he-escaped-deadly-accident-2740133-2025-06-13",
      "headline": "How I survived: Viswashkumar, on seat 11A, recounts miracle escape from crashViswashkumar Ramesh was in seat 11A of the doomed Air India flight. After the plane crashed and exploded, he was the only person pulled out alive from the wreckage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-traitors-review-karan-johar-show-feels-like-a-luxe-twisted-roadies-ride-2739994-2025-06-13",
      "headline": "The Traitors review: Bigg Boss meets Roadies in Karan Johar's luxe reality showReleased-Thu Jun 12, 2025Karan Johar-hosted show 'The Traitors' is now streaming on Prime Video. The reality show, with an impressive lineup of 20 celebrities, is a power play of vicious betrayals, cold-hearted deception, and constant manipulations. Read our review. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-gautam-gambhir-returns-to-india-due-to-family-emergency-2740259-2025-06-13",
      "headline": "England tour: Coach Gautam Gambhir returns to India due to family emergencyIndian cricket team head coach Gautam Gambhir has returned to India from England due to a family emergency. India and England are set to lock horns in a five-match Test series beginning from June 20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/belantamab-mafodotin-in-world-first-new-trojan-horse-drug-rolled-out-in-uk-for-blood-cancer-patients-2740450-2025-06-13",
      "headline": "Trojan horse drug to help treat blood cancer patients: What is it?UK's health authorities will offer a new targeted treatment for patients suffering from an aggressive blood cancer. This therapy is also known as \"Trojan Horse\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-india-plane-crash-boeing-787-dreamliner-ahmedabad-financial-cost-who-will-bear-2740362-2025-06-13",
      "headline": "Air India crash: Who will bear cost of one of the deadliest aviation disasters?The Boeing 787-8 Dreamliner crash could possibly become the costliest aviation insurance claim in the country's history. But who will bear the financial burden of the insurance and compensation payments? India Today attempts to break it down."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/science/story/air-india-ahmedabad-crash-was-1000degc-inferno-how-can-the-black-box-and-dvr-survive-it-2740334-2025-06-13",
      "headline": "Air India plane's black box recovered: How did it survive 1000°C inferno?Despite such extreme conditions, investigators retrieved the black box, pointing to the advanced material engineering that allows these devices to survive catastrophic events."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/air-india-plane-crash-latest-news-ahmedabad-airport-death-injured-survivor-pm-modi-amit-shah-boeing-cause-investigation-2740044-2025-06-13",
      "headline": "PM visits Air India crash site; bodies of 5 victims handed over to familiesAir India Flight AI171 bound for London crashed moments after taking off from Ahmedabad airport, killing at least 265 people in what authorities described as the world's worst aviation disaster in a decade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/materalists-review-this-romance-glitters-but-fades-like-perfume-in-wind-2740339-2025-06-13",
      "headline": "Materialists review: This romance glitters, but fades like perfume in windReleased-Fri Jun 13, 2025'Materialists' works well when it shows a flawed, ambitious, beautiful woman just trying to live her best life. But, what she preaches, and the choices she makes, especially when it comes to men, doesn't really seem right. Also, how does a romantic film work in the absence of good intimate scenes, especially when you have such pretty faces leading the story? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/iran-israel-tensions-rise-why-india-should-worry-strait-of-hormuz-plays-a-vital-role-in-global-energy-supply-2740371-2025-06-13",
      "headline": "Iran-Israel tensions rise. Why India should worryThe escalating Iran-Israel conflict poses significant challenges for India, particularly concerning oil imports and economic stability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/roger-federer-rafael-nadal-novak-djokovic-big-three-grand-slam-2740122-2025-06-13",
      "headline": "Was never loved like Roger Federer and Rafael Nadal: Novak DjokovicNovak Djokovic has claimed that he was never loved like Roger Federer and Rafael Nadal during their playing days and felt like the third guy in tennis. Djokovic shared legendary rivalries with both Federer and Nadal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-india-flight-crash-ahmedabad-sumeet-sabharwal-father-promise-quit-flying-sumit-2740326-2025-06-13",
      "headline": "Will quit flying to care for you, father: Air India pilot's promise days before crashCaptain Sumeet Sabharwal, the seasoned Air India pilot who was killed in the tragic crash in Ahmedabad, had promised his ailing father he would quit flying to care for him. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/wtc-final-mitchell-starc-josh-hazlewood-record-10th-wicket-partnership-lords-2740414-2025-06-13",
      "headline": "WTC Final: Starc-Hazlewood set new record with frustrating 10th-wicket standMitchell Starc and Josh Hazlewood have set a new record for the highest tenth-wicket stand with their 59-run partnership at Lord's for the WTC final. Their 10th wicket stand helped the Aussies set up a 282-run target for South Africa. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/liverpool-signing-florian-wirtz-bayer-leverkusen-british-record-2740458-2025-06-13",
      "headline": "Liverpool complete record deal to sign Florian Wirtz from Leverkusen: ReportsLiverpool have reportedly broken the bank as well as the British record by agreeing a £116.5 million deal for Florian Wirtz, making the German midfielder the most expensive signing in both the club's and the country's football history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/sa-vs-aus-wtc-final-aakash-chopra-lords-pitch-criticism-western-media-2740296-2025-06-13",
      "headline": "Chopra slams lack of criticism on WTC final pitch as 28 wickets fall in 2 daysAakash Chopra was left unhappy with the lack of criticism from the Western media on the pitch used for the WTC final at Lord's, where 28 wickets fell in just the first two days of the match.   "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-big-bash-league-sydney-sixers-pakistan-t20i-team-2740350-2025-06-13",
      "headline": "After Pakistan T20I snub, Babar Azam signs Big Bash League deal with Sydney SixersAfter being reportedly sidelined from Pakistan's T20I plans, Babar Azam has signed a Big Bash League deal with the Sydney Sixers on Friday, June 13. Babar is all set to join Steve Smith in the lineup for the Sixers. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/air-india-crash-team-india-tribute-wtc-final-south-africa-vs-australia-lords-2740333-2025-06-13",
      "headline": "Team India pay tribute to Air India crash victims, Lord's observes minute of silenceTeam India paid their tributes to the victims of the Air India crash ahead of their intra-squad game in Beckenham on Friday, June 13. The World Test Championship Final Day 3 action also got underway after a minute of silence for the victims. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wtc-2025-final-day-3-australia-vs-south-afria-live-updates-world-test-championship-aus-sa-match-lord-cricket-ground-in-london-2740295-2025-06-13",
      "headline": "AUS vs SA Day 3 Live Score: Markram, Mulder on the attack in 282 chaseAustralia vs South Africa Live Score, World Test Championship Final 2025 Updates: South Africa have been dealt an early blow with Australia's Mitchell Starc getting rid of the opener Ryan Rickleton. 282 to chase, things have not started well for the Proetas batting unit. However, Aiden Markram and Wian Mullder have shifted to attacking gears at the moment to rebuild for their side in this ever-important run chase for their side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-gautam-gambhir-returns-to-india-due-to-family-emergency-2740259-2025-06-13",
      "headline": "England tour: Coach Gautam Gambhir returns to India due to family emergencyIndian cricket team head coach Gautam Gambhir has returned to India from England due to a family emergency. India and England are set to lock horns in a five-match Test series beginning from June 20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/australia-captain-pat-cummins-hungry-for-more-after-300-test-wickets-2740212-2025-06-13",
      "headline": "Cummins hungry for more after 300 Test wickets: Got lots of miles in my legsAfter breaking into the 300 Test wicket club, Australia's Test skipper Pat Cummins remains hungry for more honours in his career. Cummins picked up six wickets for 28 on Day 2 of the WTC Final on Thursday, June 12. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/viktor-gyokeres-transfer-update-sporting-lisbon-manchester-united-arsenal-2740218-2025-06-13",
      "headline": "Manchester United target Viktor Gyokeres breaks silence amidst Sporting standoffViktor Gyokeres has addressed rumours about his future amidst a reported stand-off with Sporting Lisbon. Gyokeres has been heavily linked with a move to Manchester United and Arsenal during the summer. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-will-bat-with-more-responsibility-as-captain-monty-panesar-2740206-2025-06-13",
      "headline": "Shubman Gill will bat with more responsibility as captain, claims former spinnerIndia's newly appointed Test captain Shubman Gill has been backed to bat a lot more responsibly with the added burden of leadership on his shoulders by former England spinner Monty Panesar. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wtc-2025-final-day-3-australia-vs-south-afria-live-updates-world-test-championship-aus-sa-match-lord-cricket-ground-in-london-2740295-2025-06-13",
      "headline": "AUS vs SA Day 3 Live Score: Markram, Mulder on the attack in 282 chaseAustralia vs South Africa Live Score, World Test Championship Final 2025 Updates: South Africa have been dealt an early blow with Australia's Mitchell Starc getting rid of the opener Ryan Rickleton. 282 to chase, things have not started well for the Proetas batting unit. However, Aiden Markram and Wian Mullder have shifted to attacking gears at the moment to rebuild for their side in this ever-important run chase for their side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-gautam-gambhir-returns-to-india-due-to-family-emergency-2740259-2025-06-13",
      "headline": "England tour: Coach Gautam Gambhir returns to India due to family emergencyIndian cricket team head coach Gautam Gambhir has returned to India from England due to a family emergency. India and England are set to lock horns in a five-match Test series beginning from June 20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/australia-captain-pat-cummins-hungry-for-more-after-300-test-wickets-2740212-2025-06-13",
      "headline": "Cummins hungry for more after 300 Test wickets: Got lots of miles in my legsAfter breaking into the 300 Test wicket club, Australia's Test skipper Pat Cummins remains hungry for more honours in his career. Cummins picked up six wickets for 28 on Day 2 of the WTC Final on Thursday, June 12. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/viktor-gyokeres-transfer-update-sporting-lisbon-manchester-united-arsenal-2740218-2025-06-13",
      "headline": "Manchester United target Viktor Gyokeres breaks silence amidst Sporting standoffViktor Gyokeres has addressed rumours about his future amidst a reported stand-off with Sporting Lisbon. Gyokeres has been heavily linked with a move to Manchester United and Arsenal during the summer. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-will-bat-with-more-responsibility-as-captain-monty-panesar-2740206-2025-06-13",
      "headline": "Shubman Gill will bat with more responsibility as captain, claims former spinnerIndia's newly appointed Test captain Shubman Gill has been backed to bat a lot more responsibly with the added burden of leadership on his shoulders by former England spinner Monty Panesar. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}