{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-update-sensex-nifty-gain-wipro-hdfc-dmart-shares-in-focus-inflation-data-q2-results-2616404-2024-10-14",
      "headline": "Sensex jumps 500 points, Nifty above 25,000; Wipro, HDFC Bank gain The S&P BSE Sensex was up 409.75 points to 81,791.11 at 10:20 am, while the NSE Nifty50 rose 126.45 points to trade at 25,090.70. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/succession-wars-how-hinduja-brothers-went-from-all-for-one-to-each-for-himself-ashok-prakash-srichand-gopichand-2616025-2024-10-13",
      "headline": "Succession Wars: The Hinduja family's bitter battle for controlAt the heart of the Hinduja family's success was their ethos of shared ownership, but this same principle ultimately sparked their multi-billion dollar feud, endangering an empire built on unity. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/boeing-17000-job-cuts-factory-strike-finances-delay-first-777x-delivery-2615682-2024-10-12",
      "headline": "Boeing to cut 17,000 jobs as losses deepen amid factory strikeThe planemaker will also delay the delivery of its first 777X jet by a year. Boeing CEO Kelly Ortberg said that the comapny must shrink its workforce \"to align with financial reality\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-richest-mukesh-ambani-gautam-adani-jindal-cross-usd-1-trillion-mark-amid-market-rally-pm-modi-win-2615476-2024-10-11",
      "headline": "Fortunes soar: India's richest cross $1 trillion mark amid market rallyForbes' analysis shows that India's 100 richest individuals now have a total net worth of $1.1 trillion, more than doubling their wealth since 2019."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-trent-to-titan-noel-tatas-journey-to-the-top-of-tata-trust-2615449-2024-10-11",
      "headline": "From Trent to Titan: Noel Tata's journey to the top of Tata TrustNoel Tata, born to Naval Tata and Simone Tata, has been a key figure in the Tata Group for many years. He holds several senior positions within the conglomerate. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nariman-point-revival-office-rents-expected-to-nearly-double-by-2030-report-2615402-2024-10-11",
      "headline": "Nariman Point's revival: Office rents expected to nearly double by 2030The report, titled 'South Mumbai – A Renaissance', attributes this expected surge to ongoing infrastructure improvements and rising demand for premium office space in the area."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/noel-tata-named-tata-trusts-chairman-carry-forward-ratan-tata-legacy-2615368-2024-10-11",
      "headline": "Noel Tata on being named Tata Trusts Chairman: Will carry on legacy of Ratan TataNoel Tata was named Tata Trusts Chairman after a board meeting held in Mumbai on October 11, where the decision was unanimously agreed upon by the trustees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/financial-crisis-likely-in-delhi-additional-expenditures-to-put-national-capital-in-revenue-deficit-this-fiscal-year-2615347-2024-10-11",
      "headline": "Financial crisis looms in Delhi as extra spending tips city into revenue deficitSeveral departments have underscored additional resource needs, which strain the budget further. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-end-lower-as-foreign-investment-fizzles-tata-group-shares-gain-2615327-2024-10-11",
      "headline": "Sensex, Nifty end lower as foreign investment fizzles; Tata Group shares gainThe S&P BSE Sensex was down by 230.05 points to close at 81,381.36, while the Nifty50 declined by 34.20 points to end at 24,964.25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trent-tata-chemicals-tata-investment-corporation-surge-3-percent-as-noel-tata-takes-charge-at-tata-trusts-2615300-2024-10-11",
      "headline": "Tata group stocks surge 3% as Noel Tata takes charge at Tata TrustsNoel Tata's appointment came after the death of Ratan Tata, former chairman of Tata Sons, on October 9 at the age of 86. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/noel-tata-appointed-chairman-of-tata-trusts-succeed-ratan-tata-2615252-2024-10-11",
      "headline": "Appointed Chairman of Tata Trusts, Noel Tata to succeed Ratan Tata Noel Tata has been appointed as the new Chairman of Tata Trusts, effective October 11, following the death of his half-brother Ratan Tata on October 9 at the age of 86. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-group-trust-chairman-noel-tata-succeeds-ratan-tata-2615235-2024-10-11",
      "headline": "Who is Noel Tata, new Tata Trusts Chairman and half-brother of Ratan TataNoel Tata has made significant contributions to the Tata Group's growth and success. His strategic vision, coupled with his deep understanding of the group's businesses, has enabled him to play a key role in driving innovation and expanding the group's global reach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/noel-tata-appointed-chairman-of-tata-trusts-ratan-tata-death-successor-2615226-2024-10-11",
      "headline": "Noel Tata to succeed Ratan Tata, unanimously appointed Chairman of Tata TrustsNoel Tata has been a part of the Tata Group for over 40 years. The appointment was made during a meeting held in Mumbai and was unanimously agreed upon by the board of Tata Trusts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mehli-mistry-noel-tata-lead-race-to-become-tata-trusts-chairman-report-2615175-2024-10-11",
      "headline": "Mehli Mistry, Noel Tata lead race to become Tata Trusts chairman: ReportNoel Tata is already a trustee in the Sir Dorabji Tata Trust and the Sir Ratan Tata Trust, which together hold a 66% stake in Tata Sons, the holding company of the Tata Group. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/rupee-drops-to-all-time-low-against-dollar-amid-oil-price-surge-middle-east-tension-2615146-2024-10-11",
      "headline": "Rupee falls to all-time low against dollar amid oil price surgeThe rupee weakened to 83.99 per dollar, slightly surpassing its previous all-time low of 83.9850 recorded on September 12, and down from the 83.9675 level seen in the prior trading session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/garuda-construction-and-engineering-ipo-allotment-step-by-step-guide-to-check-status-latest-gmp-2615132-2024-10-11",
      "headline": "Garuda Construction and Engineering IPO allotment: Online guide to check statusGaruda Construction and Engineering IPO allotment: Investors who have bid for the IPO can check their allotment status online. They can log in to either the BSE website or the website of Link Intime India Private Ltd. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-lower-as-financial-stocks-drag-markets-tata-steel-up-2-percent-2615096-2024-10-11",
      "headline": "Sensex, Nifty open lower as financial stocks drag markets; Tata Steel up 2%The S&P BSE Sensex declined 65.89 points to 81,545.52, while the NSE Nifty50 was down 1.35 points to 24,997.10"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-price-today-october-11-2024-precious-metals-record-hike-on-mcx-2615082-2024-10-11",
      "headline": "Gold, silver price today, October 11, 2024: Precious metals record hike on MCXGold Price Today October 11, 2024: Both gold and silver are trading on the higher side of the Multi Commodity Exchange (MCX) on Friday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/who-will-inherit-ratan-tatas-legacy-in-the-tata-group-2614817-2024-10-10",
      "headline": "Who will inherit Ratan Tata's legacy in the Tata Group?Ratan Tata, a towering icon of industry and philanthropy who died on Wednesday, leaves behind a significant legacy and an empty chair. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-q2-results-dividend-set-at-rs-10-per-share-payout-november-5-record-date-october-18-2614783-2024-10-10",
      "headline": "TCS Q2 results: Dividend set at Rs 10 per share. Check key datesTCS Q2 results: The company reported a 5% year-on-year (YoY) rise in net profit, amounting to Rs 11,909 crore, compared to Rs 11,342 crore in the corresponding quarter of the previous year."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/lawrence-bishnoi-gangster-baba-siddique-murder-mumbai-police-salman-khan-house-firing-2616406-2024-10-14",
      "headline": "Why Mumbai Police is unable to get Lawrence Bishnoi's custodyAn order by the Union Ministry of Home Affairs prohibits the transfer of Lawrence Bishnoi from Sabarmati Central Jail in Ahmedabad. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/indigo-flights-mumbai-jeddah-muscat-bomb-threats-aircraft-inspection-2616408-2024-10-14",
      "headline": "2 IndiGo flights to Jeddah and Muscat from Mumbai get bomb threats2 IndiGo flights to Jeddah and Muscat from Mumbai get bomb threats, aircraft being inspected"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-maharashtra-assembly-polls-review-meeting-haryana-election-results-loss-india-bloc-2616360-2024-10-14",
      "headline": "Rahul Gandhi to review Congress's preparedness in Maharashtra after Haryana lossCongress MP Rahul Gandhi will meet Congress leaders and review the party's poll preparedness in Maharashtra ahead of the upcoming Assembly polls slated to be held later this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/communal-clashes-in-bharaich-uttar-pradesh-durga-immersion-processon-dead-injured-yogi-aditynath-takes-note-2616372-2024-10-14",
      "headline": "1 killed in violent clashes during Durga idol immersion in UP, 30 detainedUttar Pradesh Chief Minister Yogi Aditynath took note of the communal clashes in the state's Bahraich district and said that the guilty will not be spared. He also directed the local officials to ensure that the immersion of Durga idols is conducted peacefully."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ratan-tata-assam-tata-tea-1997-allegation-helping-ulfa-militants-cm-prafulla-kumar-mahanta-2615334-2024-10-14",
      "headline": "When Ratan Tata was caught between a CM and militantsIn the late 90s, when militancy was at its peak in Assam, there was a storm in the Tata Tea cup. Then Assam CM Prafulla Kumar Mahanta alleged Tata Group's links with militant outfit Ulfa. Then came the leaked Tata Tapes. This is the time when Ratan Tata led the group through a crisis and emerged unscathed."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/baba-siddique-murder-accused-dharmaraj-kashyap-minor-bone-ossification-test-ncp-leader-mumbai-2616334-2024-10-14",
      "headline": "Baba Siddique's murder accused not a minor, bone test revealsA bone ossification test ordered by a Mumbai court revealed that Dharmaraj Kashyap, an accused in the murder of NCP leader Baba Siddique who claimed to be a minor, is an adult. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-india-mumbai-new-york-diverted-delhi-bomb-threat-passengers-safe-2616350-2024-10-14",
      "headline": "Mumbai-New York Air India flight diverted to Delhi after bomb threatThe flight received a bomb threat after taking off from Mumbai airport and was subsequently diverted to Delhi, where an inspection was underway. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-generals-plan-starve-hamas-northern-gaza-military-zone-benjamin-netanyahu-2616345-2024-10-14",
      "headline": "Netanyahu considers 'surrender or starve' plan for northern Gaza: ReportThe General's Plan, proposed to Netanyahu and the Israeli parliament, aims to starve out Hamas militants and force them to surrender by cutting off essential supplies to the population in northern Gaza."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/elon-musk-spacex-relaunch-super-heavy-rocket-booster-return-starship-2616356-2024-10-14",
      "headline": "SpaceX can re-launch Super Heavy rocket within an hour of its returnThe Super Heavy booster was caught by the launch pad's mechanical arms, affectionately referred to as \"chopsticks\", just seven minutes after lift-off from Boca Chica, Texas, on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/government-formation-jammu-and-kashmir-presidents-rule-revoked-union-territory-2616312-2024-10-13",
      "headline": "President's rule revoked in J&K, paves way for Omar Abdullah's governmentThis comes after National Conference leader Omar Abdullah met with Lieutenant Governor Manoj Sinha on Friday to stake claim to form a new government following the recently concluded Assembly polls in J&K. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-iran-conflict-us-anti-missile-system-to-israel-iran-missile-attack-pentagon-2616321-2024-10-14",
      "headline": "US to send THAAD anti-missile system to Israel to boost defences amid attacksPentagon spokesperson Pat Ryder said the deployment of the Terminal High-Altitude Area Defence (THAAD) battery would augment Israel's integrated air defence system."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-steve-smith-will-not-open-in-border-gavaskar-trophy-confirms-george-bailey-2616398-2024-10-14",
      "headline": "Steve Smith will not open in Test series vs India: George BaileyAustralia batter Steve Smith will not open the innings vs India, confirmed Australia chief selector George Bailey. The announcement comes nearly a month ahead of the first Test match of the Border Gavaskar Trophy.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bengaluru-man-slams-swiggy-instamart-for-sending-sneaky-free-tomatoes-see-his-x-post-2616401-2024-10-14",
      "headline": "Bengaluru man slams Swiggy Instamart for sending 'sneaky' free tomatoes. See postA Bengaluru man's post sparked a debate online about consumer choice and \"dark patterns\" after he lashed out at Swiggy Instamart for not providing a removal option for freebies that come with an order. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/new-ai-scam-targets-gmail-users-with-fake-account-recovery-requests-2616395-2024-10-14",
      "headline": "New AI scam targets Gmail users with fake account recovery requestsA sophisticated AI scam targeting Gmail users has emerged, tricking individuals into approving fake account recovery requests to steal personal data. IT consultant Sam Mitrovic shares his encounter with this scam, detailing the deceptive tactics used to gain access to users' information."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bengal-bjp-mp-pushes-beats-up-seer-ashram-cooch-behar-town-locals-tyres-burnt-hartal-2616391-2024-10-14",
      "headline": "Bengal BJP MP accused of pushing, beating seer at ashram; tension grips townBJP Rajya Sabha MP Anant Maharaj allegedly pushed and beat up a seer during an argument with him at an ashram in West Bengal's Cooch Behar district. The MP has refuted any incident of assault."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/europa-clipper-mission-to-begin-29-billion-km-long-journey-to-jupiters-moon-today-2616268-2024-10-14",
      "headline": "Europa Clipper mission to begin 2.9-billion-km-long journey todayThe $5 billion mission will investigate Europa's potential to harbour conditions suitable for life beneath its icy crust. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/celebrity/story/hina-khan-nearing-last-cycle-of-chemotherapy-posts-pic-of-last-standing-eyelash-2616364-2024-10-14",
      "headline": "Hina Khan nearing last cycle of chemotherapy, posts pic of 'last standing eyelash'Actor Hina Khan shared her experience of losing eyelashes due to chemotherapy. She remains positive, using her \"last standing eyelash\" as motivation and wearing 'falsies' for shoots. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/baba-siddique-murder-accused-shiv-kumar-gautam-mumbai-police-maharashtra-2616259-2024-10-13",
      "headline": "Patiala to Mumbai: How Baba Siddique's murder was plottedMohammad Zeeshan Akhtar, who came out of jail on June 7 this year, met Gurmail Singh, one of the accused in the Baba Siddique murder case. While in jail, Akhtar was allegedly given a contract to kill Siddique by members of the Lawrence Bishnoi gang, sources said. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/4-israeli-soldiers-killed-over-50-injured-by-hezbollahs-drone-strike-2616330-2024-10-14",
      "headline": "4 Israeli soldiers killed, over 60 injured in Hezbollah drone strikeThe attack, which took place late Sunday, is one of the deadliest incidents since the war began in October last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/bill-clinton-mcdonalds-worker-fails-to-recognise-video-kamala-harris-georgia-campaign-2616383-2024-10-14",
      "headline": "Video: McDonald's worker fails to recognise Bill Clinton. What happened nextWhile campaigning for Democratic presidential candidate Kamala Harris in Georgia, former President Bill Clinton stepped into a McDonald's, only to find the employee at the counter failing to recognise him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/can-you-follow-zero-waste-living-in-india-2616167-2024-10-14",
      "headline": "Can you follow zero-waste living in India?Zero waste living is simply a lifestyle that aims to minimise waste production. It involves making conscious choices to reduce, reuse, and recycle items, and to avoid single-use products. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/first-wave-of-covid-19-increased-risk-of-heart-attack-stroke-up-to-three-years-later-nih-study-2616370-2024-10-14",
      "headline": "Covid-19: First wave increased heart attack, stroke risk up to three yearsA study backed by the US government has found that unvaccinated people infected with Covid-19 face increased risks of heart attacks, strokes, and death for up to three years, especially during the pandemic's early phase."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/baba-siddique-murder-accused-dharmaraj-gurmail-shiv-kumar-mohammad-jasin-akhtar-2616256-2024-10-13",
      "headline": "Scrap workers, criminal background: All about Baba Siddique murder accusedThe police have arrested Dharmaraj Rajesh Kashyap, Pravin Lonkar and Gurmail Baljit Singh, in connection with the murder of NCP leader Baba Siddique. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/lawrence-bishnoi-gang-baba-siddique-murder-dawood-ibrahim-nia-chargesheet-2616282-2024-10-13",
      "headline": "700 shooters, 11 states: How Lawrence Bishnoi is following Dawood's pathThe NIA has filed a chargesheet under the stringent UAPA law against Lawrence Bishnoi and Goldy Brar. In its chargesheet, the NIA compared Lawrence Bishnoi's gang to Dawood Ibrahim's D-Company."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/television/reality-tv/story/bigg-boss-tamil-8-weekend-highlights-ravindar-chandrasekaran-evicted-2616389-2024-10-14",
      "headline": "Bigg Boss Tamil 8 Weekend highlights: Ravindar Chandrasekaran evictedProducer Ravindar Chandrasekaran is the first contestant to be eliminated from Bigg Boss Tamil Season 8. Host Vijay Sethupathi's strict line of questioning forced the contestants to open up and not be diplomatic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-shares-why-jee-le-zaraa-with-priyanka-chopra-katrina-kaif-is-delayed-2616386-2024-10-14",
      "headline": "Alia Bhatt shares why Jee Le Zaraa with Priyanka Chopra, Katrina Kaif is delayedJee Le Zaraa, directed by Farhan Akhtar and starring Priyanka Chopra, Katrina Kaif, and Alia Bhatt, faces delays due to scheduling issues. Alia remains optimistic about the film's production."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranbir-kapoor-turns-groom-for-designer-tarun-tahiliani-2616379-2024-10-14",
      "headline": "Ranbir Kapoor turns groom for designer Tarun Tahiliani, fans reactRanbir Kapoor made a striking appearance as a groom at a recent fashion show in Delhi. His stunning attire quickly went viral, earning him widespread admiration from fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/bigg-boss-18-donkey-removed-from-show-peta-salman-khan-2616365-2024-10-14",
      "headline": "Bigg Boss 18: Donkey removed from show after PETA urges makers, Salman Khan Following PETA's plea to remove Donkey, also known as Gadhraj, from Bigg Boss 18, the show's producers complied by eliminating the animal in the most recent episode. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/moto-g85-selling-at-rs-15999-4-reasons-why-this-is-a-great-deal-2616403-2024-10-14",
      "headline": "Moto G85 selling at Rs 15,999: 4 reasons why this is a great deal Moto G85, launched in July, has been praised for its premium design, smooth performance and long battery life. And all of these specs come bundled at a starting price of Rs 15,999, during the Flipkart Big Shopping Mahotsav sale. But is it worth it? Yes, let's find out. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/new-ai-scam-targets-gmail-users-with-fake-account-recovery-requests-2616395-2024-10-14",
      "headline": "New AI scam targets Gmail users with fake account recovery requestsA sophisticated AI scam targeting Gmail users has emerged, tricking individuals into approving fake account recovery requests to steal personal data. IT consultant Sam Mitrovic shares his encounter with this scam, detailing the deceptive tactics used to gain access to users' information."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/apple-might-introduce-meta-like-smart-glasses-and-airpods-with-camera-in-2027-2616357-2024-10-14",
      "headline": "Apple might introduce Meta-like smart glasses and AirPods with camera in 2027After AirPods 4, Apple is eyeing to release AirPods with cameras into the market. According to Bloomberg's Mark German, the company plans to launch them in 2027. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/apple-iphone-15-is-now-available-for-with-rs-27000-discount-but-only-for-limited-time-2615422-2024-10-11",
      "headline": "Apple iPhone 15 is now available for with Rs 27,000 discount, but only for limited time Apple is offering significant discounts on iPhone 15 and iPhone 15 Plus. With offers extending up to Rs 27,000 off. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-steve-smith-will-not-open-in-border-gavaskar-trophy-confirms-george-bailey-2616398-2024-10-14",
      "headline": "Steve Smith will not open in Test series vs India: George BaileyAustralia batter Steve Smith will not open the innings vs India, confirmed Australia chief selector George Bailey. The announcement comes nearly a month ahead of the first Test match of the Border Gavaskar Trophy.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-test-series-babar-azam-shaheen-afridi-naseem-shah-dropped-hasan-ali-2616394-2024-10-14",
      "headline": "Hasan Ali backs 'brothers' Babar, Shaheen and Naseem after Pakistan axeHasan Ali has backed 'brothers' and 'champions' Babar Azam, Shaheen Shah Afridi and Naseem Shah to bounce back after the trio was dropped from the Pakistan squad for the remainder of the England Test series on Sunday, October 13. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-vs-virat-kohli-comparisons-are-baseless-brad-hogg-2616387-2024-10-14",
      "headline": "Babar Azam vs Virat Kohli comparisons are baseless: Brad HoggFormer Australia spinner Brad Hogg shunned comparisons between Babar Azam and Virat Kohli after the former was dropped from the Pakistan Test side. Hogg said that dropping Babar was the right call from Pakistan.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-nations-league-finland-vs-england-report-jack-grealish-lee-carsley-2616376-2024-10-14",
      "headline": "UEFA Nations League: England return to winning ways with 3-1 Finland winEngland bounced back from their loss against Greece with a convincing 3-1 win over Finland in the UEFA Nations League on October 13, Sunday. The Three Lions won the match 3-1 to get their campaign back on track. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pat-cummins-returns-as-captain-as-australia-announce-odi-squad-vs-pakistan-2616366-2024-10-14",
      "headline": "Pat Cummins returns as captain as Australia announce ODI squad vs PakistanAustralia Test and ODI captain Pat Cummins return after his break as the world champions named their ODI squad against Pakistan. Australia will take on Pakistan in a 3-match ODI series.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-2024-india-vs-australia-amol-muzumdar-press-conference-pakistan-2616358-2024-10-14",
      "headline": "Wish Pakistan all the best against New Zealand: India coach Amol MuzumdarIndia coach Amol Muzumdar sent his best wishes to Pakistan ahead of their clash against New Zealand on Monday, October 14. The Indian team will need a favour from Pakistan if they have to qualify for the semifinals of the Women's T20 World Cup 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-semi-final-scenario-harmanpreet-kaur-2616322-2024-10-14",
      "headline": "India can still qualify for semis after Australia loss. Here's howWomen's T20 World Cup 2024: India lost to Australia by nine runs in Sharjah on Sunday, but Harmanpreet Kaur's women are still in with a chance of making their way through to the semi-final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/border-gavaskar-trophy-india-vs-australia-cameron-green-ruled-out-surgery-steve-smith-2616338-2024-10-14",
      "headline": "IND vs AUS: Cameron Green out of Border Gavaskar Trophy, sidelined for 6 monthsAustralia suffered a big blow ahead of the Border Gavaskar Trophy as Cameron Green has been ruled out of the 5-match Test series against India. Cricket Australia confirmed the news on October 14, Monday with Green set to undergo surgery and be on the shelf for 6 months. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/hockey-india-league-auction-day-1-big-bids-harmanpreet-singh-hardik-singh-2616320-2024-10-13",
      "headline": "Harmanpreet Singh, Hardik Singh attract big bids on HIL auction Day 1 The Hockey India League 2024/25 Auction saw Indian stars and international talents attract record-breaking bids, with franchises spending Rs 16.88 crore on 54 players, highlighting the demand for top drag-flickers and goalkeepers on Day 1."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-cricket-board-fakhar-zaman-babar-azam-pak-vs-eng-tests-2616317-2024-10-13",
      "headline": "Pakistan Board disgruntled with Fakhar Zaman for questioning Babar Azam's removalPakistan Cricket Board (PCB) is unhappy with Fakhar Zaman's post on his X account questioning the removal of star batter Babar Azam from the squad of the ongoing Test series against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-india-vs-australia-harmanpreet-kaur-dependency-collective-effort-2616313-2024-10-13",
      "headline": "Australia don't depend on one or two people: Harmanpreet after India's lossIndia captain Harmanpreet Kaur criticised her team's lack of collective effort following their 9-run defeat to Australia, highlighting this as the key difference between the sides in a crucial Women's T20 World Cup clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-semi-final-scenario-harmanpreet-kaur-2616322-2024-10-14",
      "headline": "India can still qualify for semis after Australia loss. Here's howWomen's T20 World Cup 2024: India lost to Australia by nine runs in Sharjah on Sunday, but Harmanpreet Kaur's women are still in with a chance of making their way through to the semi-final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/border-gavaskar-trophy-india-vs-australia-cameron-green-ruled-out-surgery-steve-smith-2616338-2024-10-14",
      "headline": "IND vs AUS: Cameron Green out of Border Gavaskar Trophy, sidelined for 6 monthsAustralia suffered a big blow ahead of the Border Gavaskar Trophy as Cameron Green has been ruled out of the 5-match Test series against India. Cricket Australia confirmed the news on October 14, Monday with Green set to undergo surgery and be on the shelf for 6 months. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/hockey-india-league-auction-day-1-big-bids-harmanpreet-singh-hardik-singh-2616320-2024-10-13",
      "headline": "Harmanpreet Singh, Hardik Singh attract big bids on HIL auction Day 1 The Hockey India League 2024/25 Auction saw Indian stars and international talents attract record-breaking bids, with franchises spending Rs 16.88 crore on 54 players, highlighting the demand for top drag-flickers and goalkeepers on Day 1."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-cricket-board-fakhar-zaman-babar-azam-pak-vs-eng-tests-2616317-2024-10-13",
      "headline": "Pakistan Board disgruntled with Fakhar Zaman for questioning Babar Azam's removalPakistan Cricket Board (PCB) is unhappy with Fakhar Zaman's post on his X account questioning the removal of star batter Babar Azam from the squad of the ongoing Test series against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-india-vs-australia-harmanpreet-kaur-dependency-collective-effort-2616313-2024-10-13",
      "headline": "Australia don't depend on one or two people: Harmanpreet after India's lossIndia captain Harmanpreet Kaur criticised her team's lack of collective effort following their 9-run defeat to Australia, highlighting this as the key difference between the sides in a crucial Women's T20 World Cup clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sl-vs-wi-1st-t20i-brandon-king-evin-lewis-charith-asalanka-kamindu-mendis-2616307-2024-10-13",
      "headline": "SL vs WI: King, Lewis help West Indies go 1-0 up with 5-wicket win in DambullaWest Indies beat Sri Lanka by five wickets in the first T20I of the three-match series to go 1-0 up in the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-semi-final-harmanpreet-kaur-tahlia-mcgrath-report-2616304-2024-10-13",
      "headline": "India in danger of early exit after losing thriller to AustraliaWomen's T20 World Cup 2024: Harmanpreet Kaur's India lost to Tahlia McGrath's Australia by nine runs in the group match in Sharjah. India's fate now depends on the clash between Pakistan and New Zealand on Monday. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/michael-vaughan-pakistan-cricket-team-pak-vs-eng-shan-masood-babar-azam-2616297-2024-10-13",
      "headline": "Michael Vaughan calls current Pakistan team the worst to emerge from the countryFormer England captain Michael Vaughan has called the current Pakistan team teh worst ever to play for the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-parvez-hossain-emon-towhid-hridoy-squad-emerging-asia-cup-2616295-2024-10-13",
      "headline": "Bangladesh name Emon, Hridoy in squad for Emerging Asia CupAkbar Ali will lead Bangladesh in the Emerging Asia Cup. Towhid Hridoy and Parvez Hossain will also represent the A team in the upcoming tournament in Oman. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/lamine-yamal-fc-barcelona-spain-camp-return-hamstring-injury-nations-league-2616294-2024-10-13",
      "headline": "Yamal leaves Spain camp for Barcelona despite being cleared of injuryLamine Yamal has been released from Spain's national team camp as a precaution after suffering minor discomfort during the Nations League match against Denmark, although medical tests confirmed no significant injury."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/phoebe-litchfield-india-vs-australia-lbw-laws-sharjah-2616287-2024-10-13",
      "headline": "Why was Phoebe Litchfield not given out LBW vs India? Explained   Women's T20 World Cup 2024: Phoebe Litchfield wasn't given LBW by the third umpire despite her trying to play a switch hit and changing her stance in the match against India. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-test-javeria-khan-babar-azam-pcb-mockery-shaheen-afridi-naseem-shah-2616285-2024-10-13",
      "headline": "Former Pakistan captain slams board for 'mockery' in Babar Azam exclusionJaveria Khan openly criticized PCB's decision to drop Babar Azam, calling it disrespectful to Pakistan cricket. The surprise exclusion of star players like Babar, Shaheen Afridi, and Naseem Shah shocked the cricketing world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mark-taylor-names-cameron-greens-possible-replacement-for-border-gavaskar-trophy-2616278-2024-10-13",
      "headline": "Mark Taylor names Cameron Green's possible replacement for Border Gavaskar Trophy Former Australia captain Mark Taylor possible replacement for all rounder Cameron Green in the Border Gavaskar Trophy 2024-25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/lamine-yamal-fc-barcelona-spain-camp-return-hamstring-injury-nations-league-2616294-2024-10-13",
      "headline": "Yamal leaves Spain camp for Barcelona despite being cleared of injuryLamine Yamal has been released from Spain's national team camp as a precaution after suffering minor discomfort during the Nations League match against Denmark, although medical tests confirmed no significant injury."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/phoebe-litchfield-india-vs-australia-lbw-laws-sharjah-2616287-2024-10-13",
      "headline": "Why was Phoebe Litchfield not given out LBW vs India? Explained   Women's T20 World Cup 2024: Phoebe Litchfield wasn't given LBW by the third umpire despite her trying to play a switch hit and changing her stance in the match against India. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-test-javeria-khan-babar-azam-pcb-mockery-shaheen-afridi-naseem-shah-2616285-2024-10-13",
      "headline": "Former Pakistan captain slams board for 'mockery' in Babar Azam exclusionJaveria Khan openly criticized PCB's decision to drop Babar Azam, calling it disrespectful to Pakistan cricket. The surprise exclusion of star players like Babar, Shaheen Afridi, and Naseem Shah shocked the cricketing world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mark-taylor-names-cameron-greens-possible-replacement-for-border-gavaskar-trophy-2616278-2024-10-13",
      "headline": "Mark Taylor names Cameron Green's possible replacement for Border Gavaskar Trophy Former Australia captain Mark Taylor possible replacement for all rounder Cameron Green in the Border Gavaskar Trophy 2024-25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-asha-sobhana-radha-yadav-sharjah-2616276-2024-10-13",
      "headline": "Asha Sobhana sustains last-minute injury, misses Australia clashIND vs AUS: Asha Sobhana missed the clash against Australia after she sustained a foot injury after the toss took place at the Sharjah Cricket Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-test-rahul-dravid-rohit-sharma-virat-kohli-reunites-chinnaswammy-nets-2616272-2024-10-13",
      "headline": "Watch: Rahul Dravid reunites with Rohit, Virat at Chinnaswammy Former India coach Rahul Dravid reunited with Rohit Sharma, Virat Kohli, and Rishabh Pant during India's practice session in Bengaluru, sparking excitement among fans ahead of the Test series against New Zealand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-alyssa-healy-pooja-vastrakar-tahlia-mcgrath-2616264-2024-10-13",
      "headline": "On crutches, Alyssa Healy misses out, Pooja Vastrakar returns for IndiaWomen's T20 World Cup 2024: Tahlia McGrath will lead Australia against India in the absence of Alyssa Healy, who missed out due to a foot injury. Darcie Brown has replaced Tayla Vlaeminck. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}