{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/openai-valuation-usd-500-billion-share-sale-softbank-sam-altman-2796731-2025-10-02",
      "headline": "OpenAI hits $500 billion mark as SoftBank, others buy shares: ReportThe latest valuation marks a sharp rise from the company's previous valuation of $300 billion and highlights how quickly OpenAI's value has grown as demand for artificial intelligence tools continues to rise. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/wintrack-vs-chennai-customs-import-firm-tamil-nadu-shuts-operations-bribery-corruption-allegations-controversy-2796711-2025-10-02",
      "headline": "Bribes and social media war: Import firm vs Chennai Customs over 'corruption'The controversy began on the social media platform X where Wintrack Inc, a Chennai-based import company, accused Chennai Customs of systemic corruption, saying that constant demands for bribes had forced it to shut down its operations."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/google-layoff-100-job-cuts-design-related-ai-shift-seo-sunder-pichai-artificial-intelligence-2796598-2025-10-02",
      "headline": "Google layoffs: Over 100 design jobs cut in AI shiftGoogle has also been cutting back on management layers. According to reports, the company has reduced the number of middle managers by more than a third, particularly those overseeing small teams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/gandhi-jayanti-2025-stock-market-holiday-nse-bse-open-or-close-dussehra-october-2-sensex-nifty-2796520-2025-10-02",
      "headline": "Market holiday: Are NSE, BSE open on Gandhi Jayanti, Dussehra on October 2?Sensex and Nifty gained nearly 1% in the last session after the Reserve Bank of India (RBI) kept the repo rate unchanged at 5.5% and maintained its neutral stance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/microsoft-ceo-satya-nadella-shifts-focus-to-ai-elevates-judson-althoff-to-lead-commercial-unit-2796469-2025-10-01",
      "headline": "Satya Nadella bets big on AI, names Judson Althoff to lead Microsoft commercial unitMicrosoft has elevated Chief Commercial Officer Judson Althoff as CEO of its commercial business, allowing Satya Nadella to focus on AI, datacenter buildout, and product innovation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-the-price-of-gold-keeps-breaking-records-business-news-2796426-2025-10-01",
      "headline": "Why the price of gold keeps breaking recordsBullion has soared more than 45% this year, putting it on track for the biggest annual gain since 1979.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adar-poonawalla-in-talks-to-buy-royal-challengers-bangalore-rcb-stake-united-spirits-shares-update-2796326-2025-10-01",
      "headline": "Adar Poonawalla in talks to buy RCB stake? United Spirits shares updateThe CEO of Serum Institute, Adar Poonawalla, is in talks with Diageo to purchase a stake in RCB, one of the Indian Premier League's top teams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/are-festive-cheer-and-auto-stocks-driving-the-market-rally-heres-what-expert-says-2796279-2025-10-01",
      "headline": "Are festive cheer and auto stocks driving the market rally?The stock market showed renewed strength, as festive season cheer and gains in auto stocks lifted investor sentiment across sectors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/da-hike-58-percent-government-employee-salary-rise-how-to-calculate-diwali-gift-arrears-2796256-2025-10-01",
      "headline": "DA hiked to 58%: What it means for government employees' salary and pensionThe Union Cabinet approved the proposal to increase the DA for central government employees and Dearness Relief (DR) for pensioners by 3%. With this revision, the DA rate now stands at 58%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-716-points-higher-nifty-above-24800-tata-motors-up-5-percent-2796231-2025-10-01",
      "headline": "Sensex ends 716 points higher, Nifty above 24,800; Tata Motors up 5%The S&P BSE Sensex jumped 715.64 points to end at 80,983.31, while the NSE Nifty50 added 225.20 points to close at 24,836.30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/this-indian-gold-lender-holds-3-times-the-gold-of-pakistan-muthoot-finance-2796225-2025-10-01",
      "headline": "This Indian gold lender holds 3 times the gold of PakistanThe country's largest gold loan provider, currently holds 209 tonnes of gold in its safe deposit boxes. This is three times the gold reserves of Pakistan and higher than the reserves of Brazil, Australia, and South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mukesh-ambani-tops-hurun-rich-list-2025-shah-rukh-khan-joins-billionaire-club-2796169-2025-10-01",
      "headline": "Shah Rukh Khan joins billionaire club, Mukesh Ambani tops Hurun India Rich ListMukesh Ambani has reclaimed the top spot on the Hurun India Rich List 2025, while Bollywood superstar Shah Rukh Khan joins the billionaire club for the first time."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ashutosh-rana-on-the-three-historical-characters-he-wants-to-invite-for-lunch-2796867-2025-10-02",
      "headline": "Ashutosh Rana wants to invite this Ramayana character to lunch for this reason Actor Ashutosh Rana, in an exclusive interview with India Today, expressed his views on spirituality, Lord Ram, Raavan and the power of manifestation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/farah-khan-shares-pics-bollywood-villains-reveals-fun-fact-about-gafoor-song-the-bads-of-bollywood-aryan-khan-2796849-2025-10-02",
      "headline": "Farah Khan shares pics with Bollywood villains, reveals fun fact about Gafoor song Director Farah Khan recently shared pictures with Bollywood villains and revealed an interesting fact about the popular song 'Gafoor' from Aryan Khan's directorial 'The Ba***ds of Bollywood.' "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-reason-marrying-ranbir-kapoor-meeting-father-mahesh-bhatt-too-much-with-kajol-twinkle-2796793-2025-10-02",
      "headline": "Alia shares reason for marrying Ranbir, remembers his meeting with her father On 'Two Much With Kajol and Twinkle', actor Alia Bhatt opened up about why she chose Ranbir Kapoor as her husband. She also recalled how Ranbir's first meeting with her father, Mahesh Bhatt, was an important step and brought her family's blessing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mrunal-thakur-gets-teary-eyed-as-she-hugs-priyanka-chopra-at-mumbai-event-watch-2796817-2025-10-02",
      "headline": "Mrunal Thakur gets teary eyed as she hugs Priyanka Chopra at Mumbai event. Watch Actor Mrunal Thakur was emotionally overwhelmed at a Mumbai event after she hugged Priyanka Chopra. The interaction between the two actors received an emotional reaction from fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-struggling-between-work-passion-will-have-to-find-a-balance-2796813-2025-10-02",
      "headline": "Ajith Kumar on how he finds balance between films and passion for racing Actor Ajith Kumar recently got candid about struggling between work and his passion. He even reflected on highlighting Indian cinema on a global platform. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mookuthi-amman-2-nayanthara-first-look-as-goddess-unveiled-on-dussehra-2796780-2025-10-02",
      "headline": "Mookuthi Amman 2: Nayanthara's first look as goddess unveiled on Dussehra The first look of 'Mookuthi Amman 2' was unveiled on Vijayadasami featuring actor Nayanthara as the goddess. The sequel promises a grand visual spectacle with a significant pan-India release and a Rs 100 crore budget."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/awez-darbar-vows-to-never-work-with-amaal-mallik-bigg-boss-19-salman-khan-2796741-2025-10-02",
      "headline": "Exclusive: Awez Darbar vows to never work with Amaal Mallik again After his eviction, influencer Awez Darbar reacted to co-contestant Amaal Mallik's claim of giving him work. In an exclusive interview, he also responded to a question on whether he thinks host Salman Khan is biased towards the singer. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-neelam-giri-married-life-old-husband-photos-2796761-2025-10-02",
      "headline": "Bigg Boss 19: Is Neelam Giri married? Viral photos spark speculation Viral photos of Bhojpuri actor Neelam Giri, who is currently in 'Bigg Boss 19,' have sparked marriage rumours. Is she married? Who is her husband? Find out all the answers here. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-game-you-never-play-alone-review-promising-thriller-falters-in-execution-netflix-shraddha-srinath-2796752-2025-10-02",
      "headline": "The Game You Never Play Alone review: Promising thriller falters in executionRelease Date:Thu Oct 02, 2025 The Game: You never Play Alone series review: Director Rajesh M Selva's 'The Game: You Never Play Alone' is a thriller set in the world of gaming and cybersecurity. The Netflix show has promising ideas, but fails to explore them fully.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/exclusive-lovely-runner-pd-talks-byeon-woo-seoks-casting-indian-remake-and-more-2796745-2025-10-02",
      "headline": "Exclusive: Lovely Runner PD talks Byeon Woo-seok's casting, Indian remake and more Lovely Runner has taken the world by storm, becoming one of the defining K-dramas of 2024 with its unique blend of romance and fantasy. The series' success in India highlights the growing cultural exchange and promising collaboration prospects between Korean and Indian entertainment industries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/everybody-loves-raymond-cast-to-reunite-for-30th-anniversary-reunion-special-2796734-2025-10-02",
      "headline": "Everybody Loves Raymond cast to reunite for 30th anniversary reunion special The 'Everybody Loves Raymond' cast will return for a 90-minute special this November. The tribute honours iconic late actors and celebrates the sitcom's enduring legacy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/twinkle-khanna-rishi-kapoor-birthday-tweet-misunderstanding-alia-bhatt-2796700-2025-10-02",
      "headline": "Twinkle Khanna recalls when she was called Rishi Kapoor's illegitimate daughter Twinkle Khanna shared a lighthearted story about being mistaken for Rishi Kapoor's illegitimate daughter. The incident stemmed from a birthday message on social media from the late actor. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/simi-garewal-raavan-post-controversy-dussehra-social-media-backlash-2796724-2025-10-02",
      "headline": "Simi Garewal says Raavan wasn't evil but naughty, faces backlash Actor Simi Garewal is being criticised for her post on X regarding Raavan. The post has triggered a wave of responses, raising concerns about the portrayal of mythological characters and ethical messaging."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-contestant-tanya-mittal-turns-the-reality-show-into-her-personal-stage-2796704-2025-10-02",
      "headline": "Bigg Boss 19 contestant Tanya Mittal turns the reality show into her personal stage Tanya Mittal has made 'Bigg Boss 19' all about her, with her dramatic dialogues and over-the-top antics keeping everyone entertained. From claiming 150 bodyguards to saying she travels to Dubai just for Baklava, Tanya made sure the show is more about drama than reality."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/akahnda-2-nandamuri-balakrishna-film-release-date-unveiled-on-dussehra-2796655-2025-10-02",
      "headline": "Akhanda 2: Nandamuri Balakrishna's film release date unveiled on Dussehra The release date of actor Nandamuri Balakrishna's 'Akhanda 2 - Thaandavam', was confirmed for December 5, 2025 on Dussehra. The film is a sequel to 'Akhanda' (2021).\r\n\r\nNandamuri Balakrishna's Akhanda 2: Thaandavam release date is confirmed for December 5. The film faced delays due to VFX work, raising fans' anticipation further."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/maga-influencer-joins-elon-musk-to-demand-netflix-cancel-over-charlie-kirk-mockery-2796698-2025-10-02",
      "headline": "MAGA influencer joins Elon Musk to demand Netflix cancel over Charlie Kirk 'mockery' After Tesla CEO Elon Musk called for cancelling Netflix subscriptions following controversial remarks on Charlie Kirk's killing, MAGA influencer Gunther Eagleman followed suit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/varun-tej-lavanya-tripathi-name-son-vaayuv-naming-ceremony-2796699-2025-10-02",
      "headline": "Varun Tej and Lavanya Tripathi name son Vaayuv at ceremony. Pics out Telugu actors Varun Tej and Lavanya Tripathi introduced their son Vaayuv during a naming ceremony in Hyderabad. The couple shared heartfelt moments and received wishes from prominent Telugu celebrities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/additi-gupta-kabir-chopra-welcome-twin-girls-2796694-2025-10-02",
      "headline": "Qubool Hai actor Additi Gupta, husband Kabir Chopra welcome twin girls Television actor Additi Gupta and her husband Kabir Chopra have welcomed twin girls, sharing the news on social media. The announcement drew congratulations from friends and industry colleagues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sunny-sanskari-ki-tulsi-kumari-x-review-varun-dhawan-comedy-janhvi-kapoor-sass-make-it-a-stressbuster-2796692-2025-10-02",
      "headline": "Sunny Sanskari X review: Fans praise Varun, Janhvi's comic timing as a stressbuster 'Sunny Sanskari Ki Tulsi Kumari' released in theatres today. Fans praised lead actors Varun Dhawan and Janhvi Kapoor's comic timing and called it a perfect watch. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/centre-orders-fair-transparent-inquiry-into-cargo-firm-vs-chennai-customs-row-ease-of-doing-business-2796871-2025-10-02",
      "headline": "Centre orders 'fair, transparent' probe into cargo firm vs Chennai Customs rowThe finance ministry said a senior officer from the DoR has been deputed to conduct a detailed factual probe, which will include hearing all parties concerned, examining officials, and reviewing relevant documentary evidence."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-china-agree-to-resume-direct-flights-from-late-october-as-ties-normalise-2796815-2025-10-02",
      "headline": "India, China direct flights to resume from October 26 after 5-year freezeThis agreement between the civil aviation authorities will further facilitate people-to-people contact between India and China, contributing to the gradual normalisation of bilateral exchanges."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/4-injured-in-stabbing-ramming-attack-near-uk-synagogue-suspect-shot-by-police-2796733-2025-10-02",
      "headline": "Manchester synagogue attack that killed 2 declared terrorist incident: UK policeA vehicle-ramming and stabbing attack outside the Heaton Park Hebrew Congregation synagogue in north Manchester on Yom Kippur left two people dead. Police shot the suspected attacker, who is also believed to have died."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-attacks-bjp-government-colombia-interaction-warns-of-wholesale-attack-on-democracy-in-india-2796744-2025-10-02",
      "headline": "From Colombia, Rahul Gandhi warns of 'wholesale attack on democracy' in IndiaSpeaking at an interaction at EIA University in Colombia, Rahul Gandhi said the attack on democracy is single biggest threat to India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/kantara-chapter-1-review-rishab-shetty-folklore-saga-is-a-spellbinding-spectacle-rukmini-vasanth-jayaram-2796510-2025-10-02",
      "headline": "Kantara Chapter 1 review: Rishab Shetty's folklore saga is a spellbinding spectacleRelease Date:Thu Oct 02, 2025Kantara Chapter 1 movie review: Director, writer, and actor Rishab Shetty's film, also starring Rukmini Vasanth and Jayaram, explores the man vs nature conflict and land rights, blending them with divinity, folklore, myth, and faith. The film is a brilliant cinematic showcase."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/wintrack-vs-chennai-customs-import-firm-tamil-nadu-shuts-operations-bribery-corruption-allegations-controversy-2796711-2025-10-02",
      "headline": "Bribes and social media war: Import firm vs Chennai Customs over 'corruption'The controversy began on the social media platform X where Wintrack Inc, a Chennai-based import company, accused Chennai Customs of systemic corruption, saying that constant demands for bribes had forced it to shut down its operations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/i-love-muhammad-row-bareilly-congress-mps-danish-ali-imran-masood-claim-house-arrest-situation-tense-police-deployment-2796538-2025-10-02",
      "headline": "Internet suspended in Bareilly, security beefed up amid 'I Love Muhammad' rowSince the September 26 violence in Bareilly, 81 people have been arrested, while additional police reinforcements have been deployed across the city until October 4."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/afghan-minister-amir-khan-muttaqi-to-visit-india-next-week-first-high-level-meet-since-2021-taliban-takeover-2796832-2025-10-02",
      "headline": "Taliban minister to visit India, first high-level meet since 2021 Afghan takeoverTaliban Foreign Minister Amir Khan Muttaqi's visit will mark a significant diplomatic development between India and Afghanistan. The visit is notable given that Muttaqi has been under UN Security Council sanctions, including a travel ban."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/sunny-sanskari-ki-tulsi-kumari-review-varun-dhawan-janhvi-kapoor-rom-com-2796536-2025-10-02",
      "headline": "Sunny Sanskari Ki review: Varun leads a shaky front in this lukewarm rom-comRelease Date:Thu Oct 02, 2025Sunny Sanskari Ki Tulsi Kumari movie review: Varun Dhawan and Shashank Khaitan reunite for 'Sunny Sanskari Ki Tulsi Kumari', a rom-com mixing classic Bollywood style with modern humour. The film entertains with witty dialogues but stumbles with a rushed climax and awkward scenes, says our review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/learn-how-adobe-express-is-making-graphic-design-fun-in-classrooms-2792611-2025-09-24",
      "headline": "Learn How Adobe Express Is Making Graphic Design Fun In ClassroomsThe Adobe Express app is available on any smart device or desktop computer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pok-pakistan-occupied-kashmir-protests-violence-civilians-killed-2796555-2025-10-02",
      "headline": "Kashmir is ours: POK turns battlefield as protesters clash with army, 12 deadPOK violence: The unrest in Pakistan-Occupied Kashmir, which entered its third day, saw Pakistani security forces opening fire and using tear gas to disperse the protesters."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rain-dampens-dussehra-celebrations-pm-modi-sonia-gandhis-events-cancelled-2796827-2025-10-02",
      "headline": "Rain dampens Dussehra celebrations; PM Modi, Sonia Gandhi's events cancelledHeavy rain disrupted Dussehra celebrations in Delhi on Thursday, leading to the cancellation of major Raavan Dahan events that were to be attended by PM Modi and Sonia Gandhi. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/uk-news/story/manchester-synagogue-attack-yom-kippur-vehicle-ramming-stabbing-gmp-shoots-suspect-2796819-2025-10-02",
      "headline": "Get back, he has bomb: Video shows UK police shooting Manchester synagogue attackerTwo people were killed and several injured in a vehicle ramming and stabbing attack outside a Manchester synagogue on Yom Kippur, before police fatally shot the suspect. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sir-creek-dispute-between-india-pakistan-explained-rajnath-singh-warning-2796786-2025-10-02",
      "headline": "What's brewing at Sir Creek? All about decades-long dispute between India, PakSir Creek, a 96-km tidal estuary on the India-Pakistan border, is back in focus after Rajnath Singh's big warning to Pakistan over the military build-ups in the area that has long been disputed over maritime boundaries, economic resources, and strategic control."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/assam-police-slaps-murder-charge-on-singer-zubeen-gargs-manager-festival-organiser-news-agency-pti-2796796-2025-10-02",
      "headline": "Zubeen Garg's manager, festival organiser charged with murder over singer's deathZubeen Garg's manager Siddharth Sharma and North East India Festival organiser Shyamkanu Mahanta, who were arrested for culpable homicide not amounting to murder, conspiracy and causing death by negligence, are now facing murder charges."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/10-dead-after-tractor-trolley-carrying-durga-idol-for-immersion-plunged-into-pond-in-madhya-pradeshs-khandwa-2796863-2025-10-02",
      "headline": "10 dead as tractor-trolley with Durga idol plunges into pond in Madhya PradeshAt least 10 people, including children, died after a tractor-trolley carrying devotees for Durga idol immersion overturned into a pond in Madhya Pradesh's Khandwa. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/punjab-woman-thrashed-by-alcoholic-daughter-in-law-grandson-films-assault-gurdaspur-viral-video-2796715-2025-10-02",
      "headline": "Punjab woman thrashed by 'alcoholic' daughter-in-law; grandson films assaultA video from Kothe village in Gurdaspur has gone viral, showing a daughter-in-law beating her mother-in-law, leading to demands for strict action. The Punjab Women's Commission has taken notice and requested a police report."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/journalist-rajiv-pratap-threatened-delete-video-before-death-claims-family-uttarakhand-2796802-2025-10-02",
      "headline": "Journalist Rajiv Pratap was threatened to delete video before death, claims familyJournalist Rajiv Pratap's body was recovered from Joshiada Barrage in Uttarkashi, with his family alleging he was threatened to delete videos before his death. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-2025-bangladesh-vs-pakistan-report-india-clash-colombo-2796870-2025-10-02",
      "headline": "PAKW vs BANW: Pakistan handed crushing loss by Bangladesh before India clashPakistan were given a dose of reality ahead of their clash against India as Bangladesh handed them a crushing loss on Thursday, October 2. Rubya Haider Jhelik and Shorna Akter were the stars of the show for Bangladesh, who started the campaign on a high. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-muhammad-yunus-awami-ban-suspension-league-sheikh-hasina-activities-resume-bnp-ncp-students-election-2796355-2025-10-02",
      "headline": "Yunus reveals forked tongue, says Awami League suspended, not bannedMuhammad Yunus, the head of the caretaker government in Bangladesh, said the Awami League (AL) remained valid as a party, and only its activities had been suspended for the time being. This looks like a bouncer, given AL's archrival, the BNP, looks all set to win the next election, and the student-led NCP is yet to strike a chord with the electorate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mookuthi-amman-2-nayanthara-first-look-as-goddess-unveiled-on-dussehra-2796780-2025-10-02",
      "headline": "Mookuthi Amman 2: Nayanthara's first look as goddess unveiled on DussehraThe first look of 'Mookuthi Amman 2' was unveiled on Vijayadasami featuring actor Nayanthara as the goddess. The sequel promises a grand visual spectacle with a significant pan-India release and a Rs 100 crore budget."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/misadventure-in-sir-creek-will-alter-history-geography-rajnath-singh-warns-pakistan-2796778-2025-10-02",
      "headline": "Misadventure in Sir Creek will alter history, geography: Rajnath Singh warns PakDefence Minister Rajnath Singh, while celebrating Vijayadashmi and performing Shastra Puja at Bhuj Military Station, issued a strong warning to Pakistan against any misadventure in the Sir Creek sector."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/travel/story/the-curious-case-of-ladakhs-pregnancy-tourism-aryan-race-2796175-2025-10-01",
      "headline": "The curious case of Ladakh's 'pregnancy tourism'The concept of pregnancy tourism takes a complete U-turn when you head deep into Ladakh's Aryan Valley, where the narrative around the phenomenon has little to do with a better life or social benefits. Here, the story is tangled up in myth, folklore, and a lingering obsession with \"racial purity.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maharashtra-allows-shops-to-stay-open-247-bars-liquor-outlets-excluded-2796436-2025-10-01",
      "headline": "Maharashtra allows all-night shops, but bars remain barredMaharashtra government has allowed shops and establishments to operate 24/7, excluding liquor outlets. The move aims to boost business activity and ensure flexibility across the state."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-2025-bangladesh-vs-pakistan-report-india-clash-colombo-2796870-2025-10-02",
      "headline": "PAKW vs BANW: Pakistan handed crushing loss by Bangladesh before India clash Pakistan were given a dose of reality ahead of their clash against India as Bangladesh handed them a crushing loss on Thursday, October 2. Rubya Haider Jhelik and Shorna Akter were the stars of the show for Bangladesh, who started the campaign on a high. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-wi-parthiv-patel-on-sai-sudharsan-low-score-1st-test-2796857-2025-10-02",
      "headline": "Sudharsan under pressure to secure no 3 spot, needs to stay calm: Parthiv Patel Former India cricketer Parthiv Patel feels Sai Sudharsan is under pressure to secure the number three spot in the Indian Test team, which is resulting in his poor outings. Sudharsan was dismissed for 7 (19) on Day 1 of the first Test against West Indies in Ahmedabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sana-mir-controversy-natalia-parvez-azad-kashmir-bcci-no-handshake-policy-womens-world-cup-2796853-2025-10-02",
      "headline": "Ex-Pakistan captain courts controversy with Azad Kashmir remark on Natalia Pervaiz Women's World Cup: Former Pakistan captain Sana Mir stirred controversy during the match against Bangladesh by referring to Natalia Pervaiz as a player from Azad Kashmir."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-west-indies-first-test-day-1-jomel-warrican-press-conference-2796856-2025-10-02",
      "headline": "Why did West Indies decide to bat first in Ahmedabad? Jomel Warrican explains call West Indies vice-captain Jomel Warrican explained why the visitors decided to bat first in Ahmedabad as they suffered a major collapse in the first innings. The visitors scored just 162 runs in Ahmedabad as India got off to a strong start in their first innings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nashra-sandhu-hit-wicket-dismissal-first-pakistani-woman-womens-world-cup-2796822-2025-10-02",
      "headline": "Nashra Sandhu joins Misbah-ul-Haq in rare club with historic dismissal Nashra Sandhu became the first Pakistani woman and only the second player overall to be dismissed hit-wicket in Women's World Cup history during Pakistan's match against Bangladesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravindra-jadeja-surprised-by-india-test-vice-captain-west-indies-series-2796810-2025-10-02",
      "headline": "Wasn't told about leadership role, just saw VC next to my name: Ravindra Jadeja Ravindra Jadeja revealed that he was left surprised after being appointed the vice captain of the Indian Test team for the West Indies series. Jadeja has been rewarded for his stellar show in England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhimanyu-easwaran-fifty-rest-of-india-vs-vidarbha-irani-cup-2025-2796816-2025-10-02",
      "headline": "Irani Cup: Easwaran hits fifty after India snub, but other star batters fail for ROI Abhimanyu Easwaran starred for Rest Of India with a fifty, but the likes of Ruturaj Gaikwad and Ishan Kishan failed to make an impact as Vidarbha clawaed their way back into Day 2 of the Irani Cup 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/namibia-qualifies-2026-icc-mens-t20-world-cup-africa-region-final-2796808-2025-10-02",
      "headline": "Namibia qualify for T20 World Cup 2026, fourth in succession for African nation Namibia have qualified for the 2026 ICC Men's T20 World Cup, marking their fourth consecutive appearance and the first African team to do so via the Africa Region Final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sai-sudharsan-struggles-test-cricket-india-vs-west-indies-ahmedabad-2796787-2025-10-02",
      "headline": "Karun Nair would score triple century: Sai Sudharsan slammed for failure in 1st Test IND vs WI, 1st Test: Sai Sudharsan's woes in the purest format continued after Roston Chase dismissed him for seven on Day 1 at the Narendra Modi Stadium in Ahmedabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-1st-test-day-1-report-ahmedabad-siraj-bumrah-rahul-2796775-2025-10-02",
      "headline": "1st Test: Siraj, Rahul dominate substandard West Indies on rain-hit day 1 India vs West Indies: Mohammed Siraj produced a sensational four-wicket haul as India bowled out a struggling West Indies for just 162 on the opening day of the first Test on Thursday. In response, KL Rahul struck a brisk fifty to help India finish Day 1 at 121 for 2, trailing the visitors by 41 runs in Ahmedabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravindra-jadeja-surprised-by-india-test-vice-captain-west-indies-series-2796810-2025-10-02",
      "headline": "Wasn't told about leadership role, just saw VC next to my name: Ravindra Jadeja Ravindra Jadeja revealed that he was left surprised after being appointed the vice captain of the Indian Test team for the West Indies series. Jadeja has been rewarded for his stellar show in England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhimanyu-easwaran-fifty-rest-of-india-vs-vidarbha-irani-cup-2025-2796816-2025-10-02",
      "headline": "Irani Cup: Easwaran hits fifty after India snub, but other star batters fail for ROI Abhimanyu Easwaran starred for Rest Of India with a fifty, but the likes of Ruturaj Gaikwad and Ishan Kishan failed to make an impact as Vidarbha clawaed their way back into Day 2 of the Irani Cup 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/namibia-qualifies-2026-icc-mens-t20-world-cup-africa-region-final-2796808-2025-10-02",
      "headline": "Namibia qualify for T20 World Cup 2026, fourth in succession for African nation Namibia have qualified for the 2026 ICC Men's T20 World Cup, marking their fourth consecutive appearance and the first African team to do so via the Africa Region Final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sai-sudharsan-struggles-test-cricket-india-vs-west-indies-ahmedabad-2796787-2025-10-02",
      "headline": "Karun Nair would score triple century: Sai Sudharsan slammed for failure in 1st Test IND vs WI, 1st Test: Sai Sudharsan's woes in the purest format continued after Roston Chase dismissed him for seven on Day 1 at the Narendra Modi Stadium in Ahmedabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-1st-test-day-1-report-ahmedabad-siraj-bumrah-rahul-2796775-2025-10-02",
      "headline": "1st Test: Siraj, Rahul dominate substandard West Indies on rain-hit day 1 India vs West Indies: Mohammed Siraj produced a sensational four-wicket haul as India bowled out a struggling West Indies for just 162 on the opening day of the first Test on Thursday. In response, KL Rahul struck a brisk fifty to help India finish Day 1 at 121 for 2, trailing the visitors by 41 runs in Ahmedabad."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}