{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-back-in-green-airtel-hul-it-stocks-tcs-lead-market-rebound-nifty-market-update-2649289-2024-12-13",
      "headline": "Sensex back in green: Airtel, HUL, and IT stocks lead market rebound As of 12:52 PM, Sensex was up by 111.46 points to 81,401.42, while Nifty50 gained 12.75 points to 24,561.45."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vishal-mega-mart-ipo-last-day-to-apply-check-latest-gmp-subscription-status-shoud-you-subscribe-2649260-2024-12-13",
      "headline": "Vishal Mega Mart IPO last day: Check gmp, subscription. Shoud you subscribe?Vishal Mega Mart IPO has set a price range of Rs 74 to Rs 78 per share. Retail investors need to purchase a minimum of 190 shares in a single lot, requiring an initial investment of Rs 14,820."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/akasa-air-minority-stake-azim-premji-ranjan-pai-in-talks-business-deal-aviation-report-2649237-2024-12-13",
      "headline": "Azim Premji, Ranjan Pai to buy a minority stake in Akasa Air: ReportAzim Premji and Ranjan Pai family offices acquired a minority stake in Akasa Air as part of a $130-140 million fundraising round."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/explained-why-a-credit-score-over-800-matters-personal-finance-cheaper-insurance-premium-lower-loan-interest-rate-better-credit-card-offers-2649226-2024-12-13",
      "headline": "Explained: Why a credit score over 800 mattersHigh credit scores boost financial health by offering cheaper loans, and better insurance discounts, amongst others. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-price-today-december-13-2024-precious-metals-witness-dip-on-mcx-latest-rates-2649221-2024-12-13",
      "headline": "Gold, silver price today, December 13, 2024: Precious metals witness dip on MCXGold Price Today December 13, 2024: Both gold and silver are trading on the lower side of the Multi Commodity Exchange (MCX) on Friday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/sensex-falls-500-points-reason-key-factors-behind-stock-market-weakness-crash-fii-selling-weak-rupee-2649209-2024-12-13",
      "headline": "Sensex falls 1,000 points: Key factors behind stock market weaknessStock market crash: As of 10:37 AM, the Sensex was down 1,064.37 points to 80,225.59, while Nifty was also struggling below 24,300 losing 332.10 points to 24,216.60."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-sensex-nifty-tank-crash-in-early-trade-inflation-relief-fails-to-lift-market-mood-steel-baking-stocks-2649199-2024-12-13",
      "headline": "Sensex, Nifty tank in early trade; inflation relief fails to lift market moodThe S&P BSE Sensex was down 540.09 points to 80,749.87, while the NSE Nifty50 lost 160.35 points to 24,388.35. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mahila-samman-yojana-all-you-need-to-know-about-delhi-rs-1000-scheme-2648850-2024-12-12",
      "headline": "Mahila Samman Yojana: Key details about Rs 1000 schemeThe AAP government announced Mahila Samman Yojana, offering Rs 1000 monthly to women in Delhi, with a rise to Rs 2100 if it wins in the upcoming elections."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/retail-inflation-cools-to-548-in-november-from-621-in-october-2648835-2024-12-12",
      "headline": "Retail inflation cools to 5.48% in November from 6.21% in OctoberHouseholds across the world's most populous country are likely to welcome the inflation relief, given that food expenses dominate many family budgets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-dip-ahead-of-inflation-data-bearish-trend-persists-fmcg-banking-stocks-decline-2648821-2024-12-12",
      "headline": "Sensex, Nifty end lower ahead of inflation data; bearish trend persistsThe S&P BSE Sensex lost 236.18 points to close at 81,289.96, while the Nifty50 was down 93.10 points to end at 24,548.70. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/advance-tax-deadline-on-december-15-sunday-what-happens-if-you-miss-third-instalment-2648773-2024-12-12",
      "headline": "December 15 advance tax deadline: What you need to knowTaxpayers with liabilities exceeding Rs 10,000 are required to make quarterly advance tax payments to avoid penalties and interest charges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/corporate-private-sector-companies-4x-profit-salaries-wages-stagnant-inflation-high-cea-nageswaran-2648775-2024-12-12",
      "headline": "Corporates see 4x profit but keep salaries stagnant: ReportPrivate companies in India have seen their profits hit a 15-year high but failed to give wages that could even beat inflation, shows a report. Despite making 4X profits in four years, the lower spending on wages is not just adding pressure on households, but hitting India's economic growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/retail-inflation-cpi-data-today-december-12-3-things-you-should-know-rbi-2648776-2024-12-12",
      "headline": "Retail inflation data today. 3 things you should knowIn October, inflation rose to 6.2%, surpassing the Reserve Bank of India's (RBI) upper tolerance threshold of 6%, the first time in 14 months, since August 2023. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/swiggy-ril-ntpc-green-mutual-fund-top-stock-picks-in-november-2648760-2024-12-12",
      "headline": "Swiggy, RIL, NTPC Green: Top stocks that mutual funds bought in NovemberSwiggy, which listed on November 13, attracted Rs 5,400 crore from mutual funds, while Zomato Ltd saw the highest MF investment at Rs 5,600 crore, driven by its qualified institutional placement (QIP). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/waaree-energies-share-price-jumped-5-today-explained-2648756-2024-12-12",
      "headline": "Explained: Why Waaree Energies share price jumped 5% todayShares of Waaree Energies jumped over 5% during the trading session after it secured a project to develop a 170 MW solar power plant in Madhya Pradesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-prices-go-past-usd-100000-mark-will-rally-continue-cryptocurrency-2648737-2024-12-12",
      "headline": " Yes, Bitcoin has breached the $100,000 mark but will it be able to sustain?Bitcoin's growing popularity has solidified its position as one of the most valuable assets in the world, with its market capitalisation ($1.95 Trillion) almost equalling the GDP of major economies like Canada and Brazil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-crosses-100k-again-us-fed-rate-cut-hopes-drive-crypto-rally-2648689-2024-12-12",
      "headline": "Bitcoin crosses $100K again: What sparked the rally?On December 12, Bitcoin surpassed $100,000, bolstered by US inflation data and rate cut speculation, leading to a surge in altcoins and the overall crypto market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vedanta-share-price-up-2-percent-early-trade-interim-dividend-meeting-december-16-2648691-2024-12-12",
      "headline": "Explained: Why Vedanta share price gained 2% in early trade todayVedanta share price: Shares of the company gained as much as 2% in early trade, continuing its positive run for the past few sessions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/shakti-pumps-share-price-5-percent-upper-circuit-today-2648670-2024-12-12",
      "headline": "Why Shakti Pumps share price hit 5% upper circuit today?Shakti Pumps share price: The stock was trading 5% higher at Rs 844.50 apiece on the Bombay Stock Exchange (BSE)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/explained-why-delta-corp-shares-fell-after-rising-sharply-in-previous-session-cea-remarks-2648331-2024-12-12",
      "headline": "Why Delta Corp shares fell after rising sharply in previous sessionDelta Corp shares opened lower today after witnessing a sudden climb of 8% yesterday driven by the Chief Economic Advisor's advocacy for balanced innovation in crypto and gaming."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/story/allu-arjun-arrested-hyderabad-pushpa-2-screening-stampede-woman-died-injured-2649287-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Actor Allu Arjun arrested over Pushpa 2 screening stampede that killed woman Live UpdatesAllu Arjun Case: Actor Allu Arjun was arrested by the Telengana Police today over the stampede at Sandhya theatre on December 4. The actor has been taken to the Chikkadapally police station."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/priyanka-gandhi-vadra-adani-dig-government-bjp-nda-parliament-debut-speech-2649321-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "1 favoured, 142 crore Indians ignored: Priyanka Gandhi's 'Adani' jab in Parliament1 favoured, 142 crore Indians ignored: Priyanka Gandhi's 'Adani' jab at government in debut Parliament speech"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/parliament-winter-session-live-priyanka-gandhi-likely-to-make-debut-speech-during-constitution-debate-today-lok-sabha-2649179-2024-12-13?utm_source=LiveBlog_hp&utm_medium=LiveBlog&utm_campaign=home_LiveBlog",
      "headline": "Attempts being made to make Muslims second-class citizens, says Akhilesh Yadav Parliament Session Live Updates: The Rajya Sabha on Friday witnessed a massive uproar over the no-trust vote against Vice President and Rajya Sabha chairman Jagdeep Dhankar. In a heated exchange, Congress MP and Leader of Opposition in Rajya Sabha, Mallikarjun Kharge, said that if Dhakar was a \"farmer's son\" then he was also a \"labourer's son.\" Meanwhile, Lok Sabha is set to convene a two-day debate marking 75 years since the adoption of the Indian Constitution. Congress MP Priyanka Gandhi is likely to make her debut speech inside the Parliament even as Defence Minister Rajnath Singh is expected to begin the proceedings in the Lower House."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/agenda-aaj-tak-kalli-puri-welcome-address-aaj-tak-peoples-lives-platform-2649235-2024-12-13?utm_source=Videos_hp&utm_medium=Videos&utm_campaign=home_Videos",
      "headline": "Aaj Tak is part of people's lives, platform for all: Kalli Purie\"Being a leader means always doing something new, envisioning new dreams, and taking new leaps. We strive not just to present the news but also to bring forth stories that can make our country and society better,\" Kalli Purie said during. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/us-immigration-customs-enforcement-ice-deportation-list-donald-trump-indians-list-around-18000-undocumented-immigrants-2649243-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "18,000 Indians on first deportation list as Trump vows tough actionThe US Immigration and Customs Enforcement (ICE) has compiled a list of approximately 1.5 million individuals marked for deportation, including nearly 18,000 undocumented Indian nationals, as part of US President-elect Donald Trump's plan to carry out the largest deportation in American history."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-arrest-live-updates-pushpa-2-actor-arrested-hyderabad-stampede-case-2649297-2024-12-13?utm_source=LiveBlog_hp&utm_medium=LiveBlog&utm_campaign=home_LiveBlog",
      "headline": "Actor Allu Arjun arrested over theatre stampede, taken to hospital for check-upAllu Arjun arrested live update: The Pushpa 2 actor was arrested in connection with the stampede incident at Hyderabad's Sandhya Theatre, which resulted in the death of a woman. He was allegedly taken to the Chikkadapally police station for further questioning."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/south/story/tamil-or-telugu-gukesh-dommaraju-claimed-as-own-by-tn-chief-minister-mk-stalin-andhra-pradesh-cm-chandrababu-naidu-2649257-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Tamil or Telugu heritage question dominates chess champion Gukesh's historic winGukesh Dommaraju's historic World Chess Championship win ignited a fierce debate over his Tamil-Telugu origins, with Andhra Pradesh and Tamil Nadu chief ministers vying to claim the 18-year-old prodigy as their own."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nitin-gadkari-election-freebies-immediate-benefit-vs-long-term-highways-delay-public-transport-2649282-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "People must weigh immediate benefit vs long-term gain: Nitin Gadkari on freebiesSpeaking at the Agenda AajTak event, Union Minister Nitin Gadkari reiterated his opposition to poll freebies, and stated that elections can be won on the plank of sustainable development."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bengaluru-techie-suicide-divorce-laws-unfair-men-family-courts-laws-men-section-498-a-hindu-marriage-act-2648826-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "For divorces in India, the process is the punishmentA techie from Bengaluru died by suicide, alleging harassment and coercion by his wife and in-laws. The Supreme Court also spoke about the rampant misuse of Section 498A, which penalises cruelty by husbands. Here's why the process of divorce in India in itself becomes a punishment, especially for men."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-punjab-farmer-leader-jagjit-singh-dallewal-fast-unto-death-force-break-medical-aid-hospital-protest-resolve-2649281-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Punjab farmer leader shouldn't be forced to break fast: Top court to governmentThe Supreme Court asked the Punjab and Central governments to immediately provide medical help to the farmer leader Jagjit Singh Dallewal and persuade him to break his fast-unto-death."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actor-allu-arjun-seen-in-flower-nahin-fire-hai-hoodie-at-time-of-arrest-2649315-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Actor Allu Arjun seen in 'Flower nahin, fire hai' hoodie at time of arrestActor Allu Arjun was arrested by Telangana Police today in connection with the stampede at Sandhya Theatre earlier this month. At the time of his arrest, he was wearing a hoodie with the tagline 'Flower nahin, fire hai'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-paddy-upton-mental-coach-d-gukesh-india-world-cup-2011-hockey-olympics-2649227-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Cricket to Chess: Mental coach Paddy Upton a constant in India's sporting highsChess World Championship: D Gukesh gave a special mention to Paddy Upton, emphasising the significant role played by the mental conditioning coach in his road to glory. The former South African cricketer was also part of India's 2011 World Cup-winning team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reviews/story/bandish-bandits-2-review-ritwik-bhowmik-shreya-chaudhry-anand-tiwari-2649192-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bandish Bandits 2 review: A perfect symphony of drama and musicReleased-Fri Dec 13, 2024Anand Tiwari's series, Bandish Bandits 2, featuring Ritwik Bhowmik and Shreya Chaudhry is now streaming on Prime Video. With a compelling narrative and enriched character arcs, it offers fans a gratifying sequel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rajya-sabha-impeachment-motion-allahabad-high-court-judge-majority-wish-remark-opposition-mps-2649233-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Opposition MPs move to impeach High Court judge over 'majority's say' remarkA group of opposition lawmakers initiated a move to impeach Allahabad High Court judge Shekhar Kumar Yadav over his controversial remarks on the Uniform Civil Code and majority rule."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/400-flyers-stranded-in-istanbul-fover-over-24-hours-as-indigo-flights-to-delhi-mumbai-delayed-2649222-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "400 IndiGo flyers stranded in Turkey for over 24 hours without food, lodgingThe passengers shared their ordeal on X, claiming that they were promised food and accommodation by the airlines, but the lounges were too small to accommodate nearly 500 stranded people. The flyers also claimed that they received no help or support from the airline's staff despite an over 24-hour delay. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/elon-musk-spacex-starbase-site-new-city-in-texas-election-to-determine-request-authorities-letter-2649336-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Elon Musk plans to turn SpaceX's Starbase into new Texas city, a poll to decideElon Musk's SpaceX on Thursday sent a letter to local officials requesting an election to turn Starbase into an incorporated city in Texas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/beauty/story/skinfluencers-are-making-collagen-supplement-at-home-for-glowing-skin-but-experts-have-a-warning-2649005-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "DIY 'collagen supplement' is viral for glowing skin, but experts have a warningIn the quest for youthful, glowing skin, the spotlight has turned to humble kitchen staples - Amla, beetroot, carrot, and apple - with skinfluencers touting a drink made from them as a collagen supplement."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-sp-leaders-discordant-note-on-uddhav-sena-is-fresh-sign-of-fissures-in-mva-2648673-2024-12-12?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why SP leader's discordant note on Uddhav Sena is fresh sign of fissures in MVAAbu Asim Azmi, the Samajwadi Party's Maharashtra president, doubts his party's continuance in the MVA should the Sena (UBT) return to hardline Hindutva after electoral reverses\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rajya-sabha-jagdeep-dhankhar-no-confidence-motion-mallikarjun-kharge-2649249-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Farmer's son' vs 'labourer's son': Mallikarjun Kharge, Jagdeep Dhankhar face-offParliament session: Uproar over the no-confidence motion against Rajya Sabha chairman Jagdeep Dhankhar continued to mar proceedings on Friday. The House was later adjourned."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/governor-of-reserve-bank-of-india-sanjay-malhotra-gets-threat-mail-russian-language-mumbai-police-probe-case-registered-2649200-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Reserve Bank of India gets bomb threat, email in Russian says 'will blow you up'The Reserve Bank of India received an email, threatening to blow up the bank's headquarters in Mumbai with explosives. After the threat email, Mumbai Police registered a case and launched a probe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/elon-musk-xai-chatgpt-what-is-galileo-test-artificial-intelligence-2649236-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "The Galileo Test that Elon Musk wants AI to passAs artificial intelligence (AI) continues to evolve, scientists and ethicists are pondering the question: how do we measure an AI system's true intelligence? "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/brian-thompson-murder-suspect-luigi-mangione-social-media-posts-back-pain-asia-trip-no-health-insurance-criticism-2649187-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Curious case of CEO killer's social media posts: Back pain, Asia trip, then silenceLuigi Mangione's social media posts are strangely devoid of any criticism about the US health insurance industry. Instead, he talks about his travels, hobbies and struggles with chronic back pain. Police have said he had no connection with UnitedHealthcare before the shooting."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/imd-heavy-rain-warning-southern-tamil-nadu-districts-schools-shut-in-six-districts-2649193-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rain continues to lash Tamil Nadu, schools shut today in eight districtsTamil Nadu will continue to receive heavy rain in isolated places as a low-pressure area in Bay of Bengal changes direction, bringing intense rainfall activity to districts in southern part, as well as Western Ghats region."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-rohit-sharma-where-should-he-bat-brisbane-test-2649155-2024-12-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Where should Rohit Sharma bat in Brisbane Test?AUS vs IND: After the experiment to send Rohit Sharma at No.6 did not work out, India are faced with a conundrum before the third Test against Australia, starting December 14 at The Gabba in Brisbane."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-arrested-over-pushpa-2-the-rule-premiere-stampede-what-we-know-so-far-2649327-2024-12-13",
      "headline": "Allu Arjun arrested over Pushpa 2 premiere stampede: What we know so farTelugu star Allu Arjun was arrested after a stampede at Pushpa 2's premiere in Hyderabad. The incident raised questions about crowd management as fans gathered in large numbers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/video/video-allu-arjun-arrested-from-hyderabad-home-over-pushpa-2-screening-stampede-2649308-2024-12-13",
      "headline": "Video: Allu Arjun arrested from Hyderabad home over Pushpa 2 screening stampedeActor Allu Arjun has been arrested from his Hyderabad home over a stampede at Pushpa 2 screening at Sandhya Theatre. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actor-allu-arjun-seen-in-flower-nahin-fire-hai-hoodie-at-time-of-arrest-2649315-2024-12-13",
      "headline": "Actor Allu Arjun seen in 'Flower nahin, fire hai' hoodie at time of arrestActor Allu Arjun was arrested by Telangana Police today in connection with the stampede at Sandhya Theatre earlier this month. At the time of his arrest, he was wearing a hoodie with the tagline 'Flower nahin, fire hai'. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-arrest-live-updates-pushpa-2-actor-arrested-hyderabad-stampede-case-2649297-2024-12-13",
      "headline": "Actor Allu Arjun arrested over theatre stampede, taken to hospital for check-upAllu Arjun arrested live update: The Pushpa 2 actor was arrested in connection with the stampede incident at Hyderabad's Sandhya Theatre, which resulted in the death of a woman. He was allegedly taken to the Chikkadapally police station for further questioning."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-aus-3rd-test-brisbane-shubman-gill-nostalgic-gabba-2649279-2024-12-13",
      "headline": "India treating Australia tour as 3-match series from Brisbane Test: Shubman GillBorder-Gavaskar Trophy: Shubman Gill said India is hurt by the loss in Adelaide, but the team is not carrying any baggage into the third Test, starting December 14 at the Gabba, Brisbane."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-shubman-gill-on-pat-cummins-bouncer-tactic-brisbane-test-2649276-2024-12-13",
      "headline": "Shubman Gill shrugs off Cummins's 'bouncer barrage' ploy ahead of 3rd TestBorder-Gavaskar Trophy: Shubman Gill confidently shrugged off Pat Cummins's 'bouncer barrage' strategy ahead of the third Test, taking a subtle dig at the Australian captain's reliance on short balls against Indian batters.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/australia-vs-india-shubman-gill-no-fear-brisbane-test-gabba-bouncers-press-conference-2649278-2024-12-13",
      "headline": "AUS vs IND: Shubman Gill talks up fearless India ahead of Brisbane TestIndia star batter Shubman Gill emphasised the team's fearless approach ahead of the Brisbane Test against Australia, fuelled by their confidence from winning the last four Border-Gavaskar Trophies. Gill highlighted the team's determination to go all out and deliver a strong performance in Brisbane."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/shubman-gill-indian-cricket-team-d-gukesh-congratulations-youngest-world-chess-champion-2649256-2024-12-13",
      "headline": "Shubman Gill, team India congratulate world chess champion D Gukesh Shubman Gill heaped praise on D Gukesh for becoming the youngest-ever World Chess Champion, celebrating his historic victory over Ding Liren. Shubman and team India gear up for their third Test against Australia in Brisbane."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-pat-cummins-steve-smith-series-struggle-2649245-2024-12-13",
      "headline": "Pat Cummins backs Steve Smith to find form after early strugglesAustralia captain Pat Cummins has backed his deputy Steve Smith to return to his best when Australia take on India in the third Test, starting Saturday, December 14 at The Gabba in Brisbane. The 35-year-old Smith has failed to impress with the bat in the first two Tests in Perth and Adelaide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/australia-vs-india-gautam-gambhir-shubman-gill-brisbane-pitch-inspection-training-session-2649240-2024-12-13",
      "headline": "Watch: Gambhir, Shubman Gill inspect Brisbane pitch during training sessionIndia head coach Gautam Gambhir and star batter Shubman Gill were seen taking a quick look at the condition of the pitch conditions at the Gabba which will be in use for their clash against Australia for the Brisbane Test on December 14."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-paddy-upton-mental-coach-d-gukesh-india-world-cup-2011-hockey-olympics-2649227-2024-12-13",
      "headline": "Cricket to Chess: Mental coach Paddy Upton a constant in India's sporting highsChess World Championship: D Gukesh gave a special mention to Paddy Upton, emphasising the significant role played by the mental conditioning coach in his road to glory. The former South African cricketer was also part of India's 2011 World Cup-winning team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-third-test-weather-prediction-brisbane-gabba-rohit-sharma-pat-cummins-2649216-2024-12-13",
      "headline": "AUS vs IND, 3rd Test Weather: Will rain play spoilsport at the Gabba?India gear up for a crucial third Test at Brisbane's Gabba, with rain threats looming over the Border-Gavaskar Trophy clash, as both teams aim for momentum and a lead in the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/gukesh-realises-his-destiny-after-ding-lirens-epic-blunder-in-world-chess-championship-2649119-2024-12-13",
      "headline": "Chennai to Singapore: Gukesh's triumph heralds a new golden age for Indian chessWorld Chess Championship: D Gukesh's success at the highest level and the rise of a young crop of Indian Grandmasters make for exciting times for Indian Chess. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-aus-3rd-test-pat-cummins-press-conference-bouncer-brisbane-gabba-pitch-2649198-2024-12-13",
      "headline": "Cummins warns India of another bouncer barrage, reveals Gabba pitch predictionAustralia vs India, 3rd Test: Captain Pat Cummins said Australia might target India with a barrage of short-pitched deliveries in Brisbane. The skipper also shed light on the nature of the pitch at the Gabba. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/viswanathan-anand-d-gukesh-old-photo-world-chess-championship-boy-who-would-be-kind-2649191-2024-12-13",
      "headline": "Viswanathan Anand shares throwback photo of Gukesh: The boy who would be KingViswanathan Anand shared an old photo of meeting D. Gukesh as a child, celebrating his historic achievement of becoming the youngest World Chess Champion at 18. Gukesh outsmarted China's Ding Liren to win the crown on Thursday, December 12. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-paddy-upton-mental-coach-d-gukesh-india-world-cup-2011-hockey-olympics-2649227-2024-12-13",
      "headline": "Cricket to Chess: Mental coach Paddy Upton a constant in India's sporting highsChess World Championship: D Gukesh gave a special mention to Paddy Upton, emphasising the significant role played by the mental conditioning coach in his road to glory. The former South African cricketer was also part of India's 2011 World Cup-winning team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-third-test-weather-prediction-brisbane-gabba-rohit-sharma-pat-cummins-2649216-2024-12-13",
      "headline": "AUS vs IND, 3rd Test Weather: Will rain play spoilsport at the Gabba?India gear up for a crucial third Test at Brisbane's Gabba, with rain threats looming over the Border-Gavaskar Trophy clash, as both teams aim for momentum and a lead in the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/gukesh-realises-his-destiny-after-ding-lirens-epic-blunder-in-world-chess-championship-2649119-2024-12-13",
      "headline": "Chennai to Singapore: Gukesh's triumph heralds a new golden age for Indian chessWorld Chess Championship: D Gukesh's success at the highest level and the rise of a young crop of Indian Grandmasters make for exciting times for Indian Chess. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-aus-3rd-test-pat-cummins-press-conference-bouncer-brisbane-gabba-pitch-2649198-2024-12-13",
      "headline": "Cummins warns India of another bouncer barrage, reveals Gabba pitch predictionAustralia vs India, 3rd Test: Captain Pat Cummins said Australia might target India with a barrage of short-pitched deliveries in Brisbane. The skipper also shed light on the nature of the pitch at the Gabba. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/viswanathan-anand-d-gukesh-old-photo-world-chess-championship-boy-who-would-be-kind-2649191-2024-12-13",
      "headline": "Viswanathan Anand shares throwback photo of Gukesh: The boy who would be KingViswanathan Anand shared an old photo of meeting D. Gukesh as a child, celebrating his historic achievement of becoming the youngest World Chess Champion at 18. Gukesh outsmarted China's Ding Liren to win the crown on Thursday, December 12. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-europa-league-manchester-united-vs-viktoria-plzen-tottenham-hotspurs-vs-rangers-2649184-2024-12-13",
      "headline": "Hojlund gets United over Viktoria Plzen, Tottenham draw stalemateAn electrifying Europa League evening saw Manchester United clinch a narrow win over Viktoria Plzen, while the likes of  Tottenham and Galatasaray played out draws in an overall thrilling contest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-bangladesh-amir-jangoo-keacy-carty-odi-series-win-st-kitts-2649177-2024-12-13",
      "headline": "West Indies thump Bangladesh to clinch a memorable 3-0 ODI series winWest Indies clinched a commanding 3-0 ODI series victory over Bangladesh, thanks to Amir Jangoo's historic debut century and Keacy Carty's near ton. Their remarkable chase of 322 at St. Kitts showcased a dominant all-around performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-gukesh-dommaraju-profile-world-champion-humility-greatness-anand-carlsen-2649166-2024-12-13",
      "headline": "King in the making: Wise beyond his years, Gukesh begins journey to greatnessChess World Championship 2024: At just 18, Gukesh Dommaraju's skill and relentless spirit earned him the coveted crown on Thursday. His humility and grace position him as a potential ambassador of the sport and a role model to many."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-josh-hazlewood-returns-injury-scott-bolland-replacement-brisbane-test-2649169-2024-12-13",
      "headline": "Adelaide hero left out as Hazlewood returns to Australia XI for 3rd TestAustralia's Pat Cummins confirmed Josh Hazlewood's return for the Brisbane Test against India, replacing Scott Boland despite his solid Adelaide performance. Hazlewood missed out on the Adelaide Test due to a side strain injury."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jason-gillespie-pakistan-red-ball-coach-resigns-pcb-statement-gary-kirsten-aqib-javed-2649164-2024-12-13",
      "headline": "After Gary Kirsten, Jason Gillespie resigns as Pakistan cricket coachJason Gillespie stepped down as Pakistan's Test coach, citing irreconcilable differences with the PCB, just days before the South Africa series. This marks another blow to Pakistan cricket following Gary Kirsten's resignation as white-ball coach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-rohit-sharma-where-should-he-bat-brisbane-test-2649155-2024-12-13",
      "headline": "Where should Rohit Sharma bat in Brisbane Test?AUS vs IND: After the experiment to send Rohit Sharma at No.6 did not work out, India are faced with a conundrum before the third Test against Australia, starting December 14 at The Gabba in Brisbane."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/world-chess-championship-d-gukesh-viswanathan-anand-ding-liren-2649126-2024-12-13",
      "headline": "D Gukesh crowned world champion: How chess legends reacted to historic featChess greats, including Viswanathan Anand, Garry Kasparov and the Polgar sisters, were amongst the many who congratulated D Gukesh for his World Championship triumph. Gukesh defeated China's Ding Liren in the title match in Singapore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-garry-kasparov-d-gukesh-world-champion-vishy-children-india-2649128-2024-12-13",
      "headline": "His record broken, legend Garry Kasparov wants Vishy's children to soar higherChess World Championship 2024: Legendary Garry Kasparov hailed 18-year-old D Gukesh's historic triumph as world champion on Thursday. The Russian great called it a pivotal moment for Indian chess and urged the nation to build on its remarkable success in the sport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jason-gillespie-pakistan-red-ball-coach-resigns-pcb-statement-gary-kirsten-aqib-javed-2649164-2024-12-13",
      "headline": "After Gary Kirsten, Jason Gillespie resigns as Pakistan cricket coachJason Gillespie stepped down as Pakistan's Test coach, citing irreconcilable differences with the PCB, just days before the South Africa series. This marks another blow to Pakistan cricket following Gary Kirsten's resignation as white-ball coach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-rohit-sharma-where-should-he-bat-brisbane-test-2649155-2024-12-13",
      "headline": "Where should Rohit Sharma bat in Brisbane Test?AUS vs IND: After the experiment to send Rohit Sharma at No.6 did not work out, India are faced with a conundrum before the third Test against Australia, starting December 14 at The Gabba in Brisbane."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/world-chess-championship-d-gukesh-viswanathan-anand-ding-liren-2649126-2024-12-13",
      "headline": "D Gukesh crowned world champion: How chess legends reacted to historic featChess greats, including Viswanathan Anand, Garry Kasparov and the Polgar sisters, were amongst the many who congratulated D Gukesh for his World Championship triumph. Gukesh defeated China's Ding Liren in the title match in Singapore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-garry-kasparov-d-gukesh-world-champion-vishy-children-india-2649128-2024-12-13",
      "headline": "His record broken, legend Garry Kasparov wants Vishy's children to soar higherChess World Championship 2024: Legendary Garry Kasparov hailed 18-year-old D Gukesh's historic triumph as world champion on Thursday. The Russian great called it a pivotal moment for Indian chess and urged the nation to build on its remarkable success in the sport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/13-year-old-vaibhav-suryavanshi-excited-to-train-under-rahul-dravid-at-rr-ipl-2025-2649098-2024-12-12",
      "headline": "13-year old Vaibhav Suryavanshi excited to train under Rahul Dravid at RRVaibhav Suryavanshi expressed his excitement about training under the legendary Rahul Dravid in IPL 2025 for Rajasthan Royals. Bought for Rs 1.10 crore, Suryavanshi became the youngest player to be sold in auction. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-babar-azam-sexual-harrasment-lahore-hc-2649091-2024-12-12",
      "headline": "Babar Azam's alleged sexual harassment case postponed by Lahore HCThe Lahore High Court postponed the hearing of the alleged rape case involving former Pakistan captain Babar Azam until December 16. Babar is currently taking part in the T20I series against South Africa. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/world-chess-championship-d-gukesh-viswanathan-anand-2649010-2024-12-12",
      "headline": "Heartbroken fan to world champion: How Gukesh was fuelled by Anand's lossD Gukesh recalled the times when he was present in the stands during the chess championship title clash between the legendary Viswanathan Anand and Magnus Carlsen in Chennai back in 2013. On Thursday, Gukesh won the championship after beating Ding Liren. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/cricket-australia-vs-india-kapil-dev-brisbane-test-2649055-2024-12-12",
      "headline": "Express yourself, give 100 percent: Kapil Dev's advice to India before Brisbane TestAUS vs IND: In an interview with India Today, Kapil Dev said that India need to express themselves and give their 100 percent to make a comeback in the five-match series after losing by 10 wickets at the Adelaide Oval. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}