{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-593-points-lower-nifty-below-25900-ril-down-1-percent-2810783-2025-10-30",
      "headline": "Sensex closes 593 points lower, Nifty below 25,900; RIL down 1%The S&P BSE Sensex lost 592.67 points to close at 84,404.46, while the NSE Nifty50 was down by 176.05 points to end at 25,877.85. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/tata-sons-a-legacy-forged-in-destiny-by-adoption-2810767-2025-10-30",
      "headline": "The sons in Tata Sons: A legacy forged in destiny by adoptionFor two centuries, the Tata name has symbolised Indian industry and philanthropy. But who exactly are Tata Sons? Who are the heirs to the empire founded by Jamsetji Tata? This is where the saga began."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musks-starlink-kicks-off-demo-runs-in-mumbai-ahead-of-india-launch-2810745-2025-10-30",
      "headline": "Elon Musk's Starlink kicks off demo runs in Mumbai ahead of India launchDuring the trial, Starlink is expected to demonstrate how its technology can deliver fast and reliable internet, even in remote areas where traditional broadband services are often unavailable."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/groww-ipo-billionbrains-garage-ventures-ltd-price-band-gmp-minimum-investment-dates-open-close-review-2810736-2025-10-30",
      "headline": "Groww IPO details out. Check price band, GMP, and important datesGroww IPO consists of a fresh issue of 10.60 crore shares worth Rs 1,060 crore and an offer for sale (OFS) of 55.72 crore shares amounting to Rs 5,572.30 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/lenskart-solutions-ipo-opens-on-october-31-should-you-subscribe-or-wait-2810721-2025-10-30",
      "headline": "Lenskart solutions IPO opens on October 31: Should you subscribe or wait?The much-awaited initial public offering (IPO) of Lenskart Solutions will open for subscription on October 31. As India's leading eyewear brand hits the primary market, investors are weighing if now is the right time to take a position."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/amazon-14000-layoffs-ai-workforce-expert-on-future-of-work-big-workforce-2810700-2025-10-30",
      "headline": "End of big workforces? What Amazon's mass layoff really signalsAmazon's mass layoffs aren't about cutting costs; they signal a shift in how work is organised. AI is taking over tasks, but the real battle is about how companies value people."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/why-india-ipo-boom-is-not-always-a-sign-of-growth-explains-expert-2810690-2025-10-30",
      "headline": "Why India's IPO boom isn't always a sign of growth. Explains expertIndia's IPO market may be buzzing with record fundraising and investor enthusiasm, yet experts say much of the money raised isn't going into new projects or job creation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ups-layoff-48000-job-cuts-this-year-amid-major-turnaround-push-amazon-report-2810674-2025-10-30",
      "headline": "UPS to cut 48,000 jobs this year amid major turnaround pushShares of the Atlanta-based delivery giant rose more than 7% in afternoon trading on Tuesday after it reported better-than-expected earnings and revenue. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-deadline-for-audit-cases-extended-till-december-10-who-benefits-and-what-next-2810645-2025-10-30",
      "headline": "ITR deadline for audit cases extended till December 10. Who benefits and what nextTaxpayers requiring audit reports have got more time this year — the CBDT has extended the ITR filing due date to December 10, 2025."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/companies/story/indian-refiners-russian-oil-imports-us-sanctions-fuel-prices-operations-2810588-2025-10-30",
      "headline": "Russian oil taps turned off. What it means for Indian refinersIndia's cheap Russian oil phase is fading as sanctions tighten. Refiners are shifting to costlier US and Middle Eastern grades, raising import costs and likely putting eventual pressure on fuel prices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-over-250-points-nifty-below-26000-lt-jumps-15-2810553-2025-10-30",
      "headline": "Sensex, Nifty fall despite US Fed rate cut; all eyes on Trump-Xi meetingThe S&P BSE Sensex declined 251.52 points to 84,745.61 at 9:23 am, while the NSE Nifty50 fell 81.55 points to 25,972.35. Broader market indices also edged lower in early trade, tracking a mix of caution and profit booking."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sebi-proposed-changes-investor-mutual-fund-portfolio-what-changes-remove-extra-changes-brokerage-rules-2810547-2025-10-30",
      "headline": "This Sebi proposal may benefit your mutual fund investmentIn its consultation paper released on Tuesday, Sebi said the goal is to ensure that investors benefit more directly from the growing size of India's mutual fund industry. Sebi has invited public comments on the proposal until November 17."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-silver-price-today-us-fed-rate-cut-precious-metals-rate-yellow-metal-paladium-2810539-2025-10-30",
      "headline": "Gold, silver rate today: Has US Fed rate cut impacted precious metal prices?Spot gold was up 0.4% at $3,942.97 per ounce. However, US gold futures for December delivery slipped 1.1% to $3,955 per ounce, indicating some profit booking after the recent gains. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-today-us-fed-rate-cut-stock-market-opening-today-jerome-powell-comments-trump-xi-jinping-2810526-2025-10-30",
      "headline": "US Fed rate cut by 25 bps: How will it impact Sensex, Nifty today?According to early trends, Gift Nifty futures were trading at 26,188 points as of 7:45 am, suggesting that the Nifty 50 may open above Wednesday's closing level of 26,053.9."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-and-silver-prices-recover-from-recent-lows-is-it-time-to-buy-2810296-2025-10-30",
      "headline": "Gold and silver prices recover from recent lows. Is it time to buy?After slipping to three-week lows earlier this week, gold and silver have regained some shine ahead of the US Fed's policy decision. As markets anticipate a possible rate cut, traders are now weighing whether this rebound marks a good buying opportunity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nvidia-makes-history-becomes-1st-company-to-reach-5-trillion-market-value-2810341-2025-10-29",
      "headline": "Nvidia makes history, becomes first company to reach USD 5 trillion market valueThe milestone, reached just three months after Nvidia crossed USD 4 trillion, now surpasses the entire cryptocurrency market's value and equals nearly half of Europe's benchmark Stoxx 600 index."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/significant-progress-made-in-india-eu-trade-talks-union-commerce-minister-piyush-goyal-after-key-meets-2810306-2025-10-29",
      "headline": "Significant progress made in India-EU trade talks: Piyush Goyal after key meetsThe minister said that both sides are working towards a fair and reputable trade agreement, which will benefit businesses and consumers in India and the EU alike."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/boats-parent-imagine-marketing-refiles-for-rs-15-billion-ipo-after-2022-delay-2810248-2025-10-29",
      "headline": "boAt's parent Imagine Marketing refiles for Rs 15-billion IPO after 2022 delayTwo years after postponing its IPO plans, boAt's parent company Imagine Marketing is back in the game, filing fresh documents for a Rs 15-billion public issue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/can-indias-banks-keep-up-with-the-economys-growth-momentum-2810223-2025-10-29",
      "headline": "Can India's banks keep up with the economy's growth momentum?With growth and policy support aligned, India's economy is gaining momentum. The real question — can banks modernise fast enough to keep it going?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-414-points-higher-nifty-above-26000-nptc-up-nearly-3-2810208-2025-10-29",
      "headline": "Sensex, Nifty end higher amid optimism over US Fed decisionThe S&P BSE Sensex rose 368.97 points to close at 84,997.13, while the NSE Nifty50 gained 117.70 points to settle at 26,053.90. Broader market indices also closed higher, with oil & gas and metal stocks leading the uptrend."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sadhguru-asks-why-handsome-yash-is-playing-ravana-in-ranbir-kapoor-ramayana-2810758-2025-10-30",
      "headline": "Sadhguru asks why handsome Yash is playing Ravana in Ranbir Kapoor's Ramayana Spiritual leader Sadhguru Jaggi Vasudev expressed surprise over actor Yash being cast as Ravana in 'Ramayana'. The discussion highlighted casting challenges and differing views on the villain portrayal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bharti-singh-wants-baby-girl-dreams-of-dressing-her-up-like-deepika-padukone-ranveer-singh-dua-2810775-2025-10-30",
      "headline": "Bharti Singh wants baby girl, dreams of dressing her up like Deepika-Ranveer's Dua Bharti Singh, who is expecting her second child, said she wishes for a baby girl and hopes to dress her up like Deepika Padukone and Ranveer Singh's daughter Dua. The comedian shared her excitement after seeing her baby's colour sonography, calling the little one \"so, so gorgeous.\""
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/halloween-high-7-indian-horror-icons-scarier-than-your-monday-meetings-2810701-2025-10-30",
      "headline": "Halloween high: 7 Indian horror icons scarier than your Monday meetings From Manjulika to Stree, here are seven Indian horror characters guaranteed to make your Halloween scream-worthy and nights sleepless. Happy Halloween on October 31!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-leader-rm-historic-cultural-economy-speech-apec-ceo-summit-2025-2810713-2025-10-30",
      "headline": "RM at APEC: Why BTS leader's speech signals a new era of Asian Cultural Power BTS leader RM made history by speaking at the APEC CEO Summit in 2025. His address highlighted culture as a key economic and diplomatic force shaping Asia-Pacific's future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/baramulla-trailer-manav-kaul-faces-haunting-case-of-missing-children-in-kashmir-2810723-2025-10-30",
      "headline": "Baramulla trailer: Manav Kaul faces haunting case of missing children in Kashmir The trailer for Manav Kaul and Bhasha Sumbli's supernatural-thriller, 'Baramulla', was recently released. The film is based on the mystery about missing children in the Kashmir valley.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/pankaj-dheer-daughter-in-law-kratika-sengar-recalls-bond-in-touching-post-2810733-2025-10-30",
      "headline": "Late Pankaj Dheer's daughter-in-law Kratika Sengar recalls bond in touching post Remembering late actor Pankaj Dheer fondly, his daughter-in-law Kratika Sengar shared a heartfelt tribute on Instagram on Thursday. The veteran actor died on October 15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/toxic-movie-release-date-confirmed-march-19-2026-yash-geetu-mohandas-2810712-2025-10-30",
      "headline": "Yash's Toxic team dismisses delay rumours, re-confirms March 2026 release The makers of 'Toxic: A Fairy Tale for Grown-Ups' have confirmed that the highly anticipated film starring Yash remains on schedule for its global theatrical release on March 19, 2026, addressing and dismissing recent speculation about a possible postponement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sonakshi-sinha-says-she-is-accidental-actor-credits-salman-khan-and-arbaaz-khan-for-her-debut-2810711-2025-10-30",
      "headline": "Sonakshi Sinha says she's accidental actor, credits Salman and Arbaaz for her debut Sonakshi Sinha shared that she never planned to become an actor and called herself an accidental actor. She credited Salman and Arbaaz Khan for recognising her potential and giving her the opportunity to begin her journey in Bollywood with 'Dabangg'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-telugu-9-day-52-bharani-injured-thanuja-madhuri-clash-heats-up-2810663-2025-10-30",
      "headline": "Bigg Boss Telugu 9 Day 52: Bharani injured, Thanuja–Madhuri clash heats up Day 52 of 'Bigg Boss Telugu Season 9' brought a perfect mix of emotion, strategy, and chaos. From Bharani's injury during a tough task to the fiery kitchen fight between Thanuja and Madhuri, the episode proved to be one of the season's most dramatic yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/jonita-gandhi-on-working-with-ed-sheeran-power-of-indian-folk-and-viral-reel-era-2810637-2025-10-30",
      "headline": "Jonita Gandhi on working with Ed Sheeran, power of Indian folk, and viral reel era Bollywood singer Jonita Gandhi has teamed up with global icon Ed Sheeran for his latest album 'Play' and their single 'Heaven'. In an interview with us, she highlighted the rising global love for Indian music and the unmatched thrill of live performances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/rasika-dugal-sums-up-shooting-for-mirzapur-film-hopes-to-find-her-beena-again-2810693-2025-10-30",
      "headline": "Rasika Dugal sums up shooting for Mirzapur film, hopes to find her Beena again Rasika Dugal opened up about stepping back into the world of 'Mirzapur' as Beena Tripathi. She admitted to feeling both nervous and excited, and reflected on staying true to her instincts amid fan expectations and changing dynamics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/jay-bhanushali-mahhi-vij-deny-divorce-rumours-legal-action-2810672-2025-10-30",
      "headline": "Mahhi Vij slams divorce reports with Jay Bhanushali, warns of legal action Mahhi Vij has responded firmly to ongoing social media rumours suggesting she and Jay Bhanushali are headed for divorce, calling the reports baseless and threatening legal action against those spreading misinformation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sadhguru-on-unrealistic-expectations-from-ranbir-in-ramayana-calls-it-unfair-2810666-2025-10-30",
      "headline": "Sadhguru on unrealistic expectations from Ranbir in Ramayana, calls it unfair Spiritual leader Sadhguru Jaggi Vasudev discussed the pressures on Ranbir Kapoor playing Lord Rama in 'Ramayana'. He highlighted the balance between reverence and acting as a profession amid high audience expectations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dalip-tahil-at-73-the-man-who-gave-the-rich-arrogant-father-a-suave-edge-2810662-2025-10-30",
      "headline": "Dalip Tahil at 73: The man who gave the rich, arrogant father a suave edge Dalip Tahil, who celebrates his 73rd birthday today, became known for playing strong yet imperfect father figures in Hindi films. His sophisticated presence and natural acting have made him one of the most unforgettable on-screen fathers in Bollywood."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/diljit-dosanjh-kaun-banega-crorepati-17-amitabh-bachchan-flood-relief-nostalgia-2810652-2025-10-30",
      "headline": "KBC 17: Diljit Dosanjh recalls fan who only knew Amitabh Bachchan's films Singer Diljit Dosanjh appears as a special guest on 'Kaun Banega Crorepati 17', sharing a story about a fan in Abu Dhabi and performing a song from Khuda Gawah, while the episode features moments of nostalgia and charity discussion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/riddhima-kapoor-responds-to-troll-doubting-her-for-helping-actor-sudhir-dalvi-2810647-2025-10-30",
      "headline": "Riddhima Kapoor responds to troll doubting her for helping actor Sudhir Dalvi Veteran actor Sudhir Dalvi, best known for portraying Sai Baba in the 1977 film 'Shirdi Ke Sai Baba', has been hospitalised since early October due to severe sepsis. Riddhima Kapoor Sahni extended support for his treatment and later called out a social media user who trolled her for it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/baahubali-epic-premiere-gautam-ghattamaneni-praises-telugu-films-global-success-2810634-2025-10-30",
      "headline": "Mahesh Babu's son Gautam ecstatic watching Baahubali: Got goosebumps, it was epic Mahesh Babu's son Gautam Ghattamaneni reflects on attending the US premiere of 'Baahubali: The Epic', highlighting his reactions and the significance of the film's international recognition for Telugu cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-2026-comeback-world-tour-possible-india-stop-2810633-2025-10-30",
      "headline": "Will BTS finally perform in India during 2026 world tour? BIGHIT MUSIC responds BTS is preparing for their biggest comeback in 2026 after completing military service. Fans in India are hopeful as Mumbai could be included in the global tour, marking a major milestone for the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-white-lotus-season-4-to-film-in-paris-and-the-french-riviera-2810627-2025-10-30",
      "headline": "The White Lotus season 4 to film in Paris and the French Riviera: Report According to a report, 'The White Lotus' Season 4 will be filmed in Paris and the French Riviera, with luxury hotels such as Le Lutetia and the Ritz Paris under consideration."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/exclusive-2020-delhi-riots-was-a-regime-change-operation-says-police-in-affidavit-to-supreme-court-2810681-2025-10-30",
      "headline": "Regime-change operation: Delhi Police's explosive charge in 2020 riots caseIndia Today has accessed details of the exhaustive affidavit submitted by the Delhi Police before the Supreme Court in the 2020 Delhi riots case. The police said they have collected evidence linking the accused to a \"deep-rooted conspiracy engineered on communal lines.\"\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-granted-6-month-exemption-from-us-sanctions-for-chabahar-port-operations-in-iran-government-2810786-2025-10-30",
      "headline": "India gets 6-month exemption from US sanctions for Chabahar Port in IranThe US, last month, announced that it would revoke the sanction waiver granted in 2018 under the Iran Freedom and Counter-Proliferation Act. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-afghanistan-war-us-drones-not-india-real-reason-why-pakistan-afghanistan-peace-talks-crashed-ceasefire-2810480-2025-10-30",
      "headline": "US drones, not India, real reason why Pak-Afghan peace talks crashedPakistan Defence Minister Khwaja Asif blamed India after the peace talks with Taliban-ruled Afghanistan failed. Though Islamabad might use that as the ruse, the real reason behind the crashing of the talks, which were initiated after a recent war got hundreds killed, is Pakistan's helplessness at preventing US drones from attacks inside Afghanistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-womens-world-cup-semi-final-live-score-updates-navi-mumbai-2810680-2025-10-30",
      "headline": "INDW vs AUSW Live: Phoebe attacks after Healy's wicket India (IND) vs Australia (AUS) Live Score, Women's World Cup 2nd semi-final: India have got the prized scalp of Alyssa Healy as Kranti Gaud shatters her stumps just before the rain break. A huge wicket for India just before the rain break after Australia won the toss and opted to bat first."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/tata-sons-a-legacy-forged-in-destiny-by-adoption-2810767-2025-10-30",
      "headline": "The sons in Tata Sons: A legacy forged in destiny by adoptionFor two centuries, the Tata name has symbolised Indian industry and philanthropy. But who exactly are Tata Sons? Who are the heirs to the empire founded by Jamsetji Tata? This is where the saga began."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/delhi-cloud-seeding-artificial-rain-expensive-cost-winter-months-pollution-2810726-2025-10-30",
      "headline": "3 trials, over Rs 1 crore bill, zero rain. The cost of cloud seedingDelhi rain: The Delhi government, in collaboration with IIT Kanpur, has conducted three cloud seeding trials to date, with none producing any significant rain in the capital. Is spending crores for just a drizzle worth it?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/delhi-air-pollution-is-killing-more-people-than-covid-19-says-dr-randeep-guleria-2810741-2025-10-30",
      "headline": "Air pollution is killing more people than Covid-19, says Dr Randeep GuleriaFormer AIIMS director Dr. Randeep Guleria warns that toxic air is damaging not just lungs, but hearts, brains, and even children's growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/story/congress-weak-link-mahagathbandhan-2025-bihar-assembly-elections-2810754-2025-10-30",
      "headline": "Mahagathbandhan readies for Bihar polls, but Congress seen as weak linkThe Mahagathbandhan alliance, including RJD, Congress, VIP, and left parties, faces internal challenges ahead of the Bihar assembly polls, with Congress viewed as the fragile point in the coalition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/adulting-is-hard-but-its-harder-when-your-parents-are-fighting-2810205-2025-10-30",
      "headline": "Adulting is hard, but it's harder when your parents are fightingWatching your parents fight as an adult can feel deeply unsettling. You feel helpless, full of thoughts and emotions, yet unable to say or do much. And even if you don't show it, the emotional weight of those moments can be heavy."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/video-bengaluru-couple-chases-delivery-agent-for-brushing-against-car-kills-him-2810563-2025-10-30",
      "headline": "Video: Bengaluru couple chases delivery agent for brushing against car, kills himInitially registered as an accident, the case turned into a murder probe when CCTV footage showed the car deliberately following and hitting the victims. The couple has been taken into custody."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/indian-origin-woman-student-confronts-jd-vance-trump-immigration-policies-viral-video-2810768-2025-10-30",
      "headline": "You sold a dream; how can you stop us? Indian-origin woman confronts JD VanceThe US Vice President was also asked by the woman about his Hindu wife and their 'inter-cultural' household in the face of the Trump administration's strict immigration policies."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/blood-of-sudan-massacre-visible-from-space-el-fasher-darfur-satellite-image-bodies-janjaweed-civil-war-darfur-2810359-2025-10-30",
      "headline": "Blood, pile of corpses from Sudan massacre visible from spaceA humanitarian crisis has been unfolding in Sudan that the world has shut its eyes to. Such is the scale of the killings in El Fasher city in North Darfur captured from by militia Rapid Support Forces that the blood and the pile of bodies are visible from space."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/environment/story/spain-lynx-anomaly-jaen-mountains-leucistic-iberian-lynx-jaen-mountains-photographed-video-nature-2810594-2025-10-30",
      "headline": "'Something truly unique': World's first-ever white Iberian Lynx spotted in SpainThe Lynx is considered a mythical creature by the locals. The mythical status stems from the fact that most Lynx are either brown or beige-white."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-changes-employment-authorisation-documents-ead-wives-of-h-1b-holders-f-1-visa-students-to-be-hit-trump-jobs-2810735-2025-10-30",
      "headline": "US changes work-permit rules overnight; students, spouses of H-1B holders to be hitThe Trump Administration has ended automatic extensions of certain Employment Authorisation Documents (EADs) from October 30, affecting H-4 visa holders, F-1 students on OPT, and asylum seekers. Applicants must now undergo fresh vetting to get their work permit renewed. The overnight change disproportionately impacts Indian workers."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/taliban-releases-video-of-pakistan-isis-fighter-detailing-lashkar-linked-training-2810764-2025-10-30",
      "headline": "Taliban releases video of Pak ISIS fighter detailing Lashkar-linked trainingThe Afghan Taliban have unveiled a confession video of a captured Pakistani ISIS fighter, shedding light on cross-border terror recruitment and training linked to Lashkar-e-Taiba. This revelation exposes the intricate networks facilitating infiltration and radicalisation across the Afghanistan-Pakistan border."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/discuss-only-if-you-have-degree-china-social-media-law-to-weed-out-fakefluencers-influencers-serious-topics-instagram-reels-2810748-2025-10-30",
      "headline": "China brings law to regulate influencers: Only experts can give expert adviceChina has made it a must for social media influencers creating content on \"serious topics\", such as medicine, law, finance, and education, to have degrees or expertise in those areas. The move is aimed at curbing misinformation on the internet. Violators would face a fine of up to $14,000."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/uda-devi-dalit-woman-sniper-1857-lucknow-rebellion-2810568-2025-10-30",
      "headline": "The brave Dalit woman who fought in the 1857 revoltShe wasn't a queen or a soldier by rank, just a woman who refused to surrender. Uda Devi's courage from the branches of a tamarind tree still echoes through time."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/story/pm-narendra-modi-yuvrajs-of-corruption-attack-rahul-gandhi-tejashwi-yadav-bjp-congress-rjb-bihar-elections-2810685-2025-10-30",
      "headline": "2 Yuvraj, 2 most corrupt families: PM hits back at Rahul Gandhi, Tejashwi YadavWhile addressing a mega election rally in Bihar's Muzaffarpur, Prime Minister Narenda Modi accused Rahul Gandhi and Tejashwi Yadav of representing \"the most corrupt families\" in India and Bihar, adding that both were out on bail in multi-crore scams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bengaluru-based-retired-executive-alleges-bribes-after-daughters-death-shares-ordeal-in-now-deleted-post-2810546-2025-10-30",
      "headline": "Grieving Bengaluru father shares bribery ordeal after daughter's deathSivakumar K, former Chief Financial Officer of Bharat Petroleum Corporation Limited (BPCL), detailed his ordeal in a now-deleted LinkedIn post, sparking widespread outrage over corruption in the city."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/amazon-14000-layoffs-ai-workforce-expert-on-future-of-work-big-workforce-2810700-2025-10-30",
      "headline": "End of big workforces? What Amazon's mass layoff really signalsAmazon's mass layoffs aren't about cutting costs; they signal a shift in how work is organised. AI is taking over tasks, but the real battle is about how companies value people."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/baramulla-trailer-manav-kaul-faces-haunting-case-of-missing-children-in-kashmir-2810723-2025-10-30",
      "headline": "Baramulla trailer: Manav Kaul faces haunting case of missing children in KashmirThe trailer for Manav Kaul and Bhasha Sumbli's supernatural-thriller, 'Baramulla', was recently released. The film is based on the mystery about missing children in the Kashmir valley.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/companies/story/indian-refiners-russian-oil-imports-us-sanctions-fuel-prices-operations-2810588-2025-10-30",
      "headline": "Russian oil taps turned off. What it means for Indian refinersIndia's cheap Russian oil phase is fading as sanctions tighten. Refiners are shifting to costlier US and Middle Eastern grades, raising import costs and likely putting eventual pressure on fuel prices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-says-will-lower-china-tariffs-by-10-after-amazing-meeting-with-xi-jinping-2810586-2025-10-30",
      "headline": "Trump seals rare earths deal in 'amazing' meet with Xi, to cut China tariffs 10%US President Donald Trump and Chinese President Xi Jinping held a landmark meeting in Busan, marking a promising new chapter in US-China relations. Key agreements on tariffs, soybean purchases, and rare earth exports signal a hopeful thaw in diplomatic ties."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/canada-news/story/indian-origin-businessman-arvi-singh-sagoo-killed-after-objected-man-urinating-on-his-car-canada-edmonton-racism-2810636-2025-10-30",
      "headline": "Stopped man from urinating on his car, Indian-origin businessman killed in CanadaA 55-year-old Indian-origin businessman was attacked by a man after he tried to prevent him from urinating on his car in Edmonton, Canada. Police found Arvi Singh Sagoo unconscious and took him to a hospital. Sagoo succumbed to his injuries five days after the attack. The accused has been arrested."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-batting-position-best-number-3-india-vs-australia-robin-uthappa-2810787-2025-10-30",
      "headline": "Suryakumar Yadav is India's best option at number 3 vs Australia: Robin Uthappa Robin Uthappa believes Suryakumar Yadav should bat at No. 3 in India's T20I lineup to regain form and stability. The former India batter feels consistency in position will unlock his true potential."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-australia-black-armbands-ben-austin-death-womens-world-cup-2025-2810785-2025-10-30",
      "headline": "Australia, India players wear black armbands to mourn 17-year-old cricketer's death The Indian and Australian players were seen wearing black armbands to mourn the death of 17-year-old Ben Austin. The young talent died after being hit on the neck area in the nets on Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-south-africa-test-match-guwahati-reverses-lunch-tea-breaks-maximise-daylight-2810746-2025-10-30",
      "headline": "Why Guwahati Test will have tea before lunch break in historic first South Africa tour of India: The order of lunch and tea breaks will be reversed when Guwhati hosts a men's Test for the first time in history. India will host South Africa at Barsapara Stadium from November 22. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-india-vs-australia-2nd-semi-final-team-changes-toss-navi-mumbai-2810755-2025-10-30",
      "headline": "India make three changes, Alyssa Healy returns for Australia Women's World Cup: Australia captain Alyssa Healy returned for the all-important semi-final, while India made three changes, bringing back Richa Ghosh, Shafali Verma and Kranti Goud for the knockout clash in Navi Mumbai."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/chelsea-liam-delap-red-card-vs-wolves-enzo-maresca-slams-stupid-carabao-cup-2810729-2025-10-30",
      "headline": "Chelsea boss Enzo Maresca slams Liam Delap for rash red-card vs Wolves: Embarrasing Liam Delap's rash red-card on his injury return soured Chelsea's 4-3 Carabao Cup win over Wolves, as Enzo Maresca blasted the striker for being \"selfish\" and \"embarrassing.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/marizanne-kapp-eager-to-face-india-icc-womens-world-cup-2025-final-2810716-2025-10-30",
      "headline": "Marizanne Kapp eager to face India in ICC Women's World Cup 2025 final South Africa thrashed England by 125 runs in the 2nd semi-final to reach the ICC Women's World Cup 2025 final. Marizanne Kapp said she would love to face India in the final, mentioning the excitement of playing in front of packed Indian crowds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/canadian-open-squash-anahat-singhs-dream-run-ends-in-semifinals-2810714-2025-10-30",
      "headline": "Canadian Open Squash: Anahat Singh's dream run ends in semifinals India's Anahat Singh's impressive run at the Canadian Women's Open ended in the semifinals with a straight-games defeat to England's Georgina Kennedy, following upset wins over two higher-ranked opponents."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-womens-world-cup-semi-final-live-score-updates-navi-mumbai-2810680-2025-10-30",
      "headline": "INDW vs AUSW Live: Gaud removes Healy cheaply  India (IND) vs Australia (AUS) Live Score, Women's World Cup 2nd semi-final: India have got the prized scalp of Alyssa Healy as Kranti Gaud shatters her stumps just before the rain break. A huge wicket for India just before the rain break after Australia won the toss and opted to bat first."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-ind-vs-aus-semi-final-harmanpreet-kaur-171-2017-2810331-2025-10-30",
      "headline": "Can Harmanpreet Kaur awaken sleeping beast against old foes Australia? As India prepare to take on Australia in the second semi-final of the ICC Women's Cricket World Cup 2025, all eyes will be on captain Harmanpreet Kaur, who will be expected to awaken the sleeping beast inside of her and take her team closer to the World Cup glory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-unluckiest-player-kris-srikkanth-t20i-role-australia-vs-india-2810667-2025-10-30",
      "headline": "Sanju Samson is India's unluckiest player in India: Srikkanth on his T20I role Kris Srikkanth has called Sanju Samson the unluckiest player in Indian cricket, criticising the team's constant changes to his batting order. The former selector believes such instability has dented Samson's confidence despite his proven potential."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/marizanne-kapp-eager-to-face-india-icc-womens-world-cup-2025-final-2810716-2025-10-30",
      "headline": "Marizanne Kapp eager to face India in ICC Women's World Cup 2025 final South Africa thrashed England by 125 runs in the 2nd semi-final to reach the ICC Women's World Cup 2025 final. Marizanne Kapp said she would love to face India in the final, mentioning the excitement of playing in front of packed Indian crowds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/canadian-open-squash-anahat-singhs-dream-run-ends-in-semifinals-2810714-2025-10-30",
      "headline": "Canadian Open Squash: Anahat Singh's dream run ends in semifinals India's Anahat Singh's impressive run at the Canadian Women's Open ended in the semifinals with a straight-games defeat to England's Georgina Kennedy, following upset wins over two higher-ranked opponents."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-womens-world-cup-semi-final-live-score-updates-navi-mumbai-2810680-2025-10-30",
      "headline": "INDW vs AUSW Live: Gaud removes Healy cheaply  India (IND) vs Australia (AUS) Live Score, Women's World Cup 2nd semi-final: India have got the prized scalp of Alyssa Healy as Kranti Gaud shatters her stumps just before the rain break. A huge wicket for India just before the rain break after Australia won the toss and opted to bat first."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-ind-vs-aus-semi-final-harmanpreet-kaur-171-2017-2810331-2025-10-30",
      "headline": "Can Harmanpreet Kaur awaken sleeping beast against old foes Australia? As India prepare to take on Australia in the second semi-final of the ICC Women's Cricket World Cup 2025, all eyes will be on captain Harmanpreet Kaur, who will be expected to awaken the sleeping beast inside of her and take her team closer to the World Cup glory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-unluckiest-player-kris-srikkanth-t20i-role-australia-vs-india-2810667-2025-10-30",
      "headline": "Sanju Samson is India's unluckiest player in India: Srikkanth on his T20I role Kris Srikkanth has called Sanju Samson the unluckiest player in Indian cricket, criticising the team's constant changes to his batting order. The former selector believes such instability has dented Samson's confidence despite his proven potential."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-returns-action-wear-virat-kohli-no-18-jersey-india-south-africa-2810640-2025-10-30",
      "headline": "Rishabh Pant wears Virat Kohli's No. 18 jersey on return to competitive actionRishabh Pant marked his return from a three-month injury layoff by wearing Virat Kohli's iconic No. 18 jersey for India A. The choice of jersey sparked debate on social media, with fans discussing Kohli's legacy and whether his number should have been retired."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ben-austins-tragic-death-melbourne-cricket-nets-mourned-australian-cricket-community-2810612-2025-10-30",
      "headline": "Teenage Australian cricketer dies after being struck in the neck by a ballAustralian cricket was left in shock on Thursday following the death of a teenage player who was struck by a ball during training at his Melbourne club. Ben Austin, 17, was hit high on the neck by a delivery from a teammate while batting in the nets at Ferntree Gully Cricket Club on Tuesday, Cricket Victoria (CV) said in a statement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sai-sudharsan-gautam-gambhir-backing-confidence-you-will-play-test-form-run-drought-2810581-2025-10-30",
      "headline": "Sai Sudharsan shares Gautam Gambhir's advice that ended his run-drought: You will playSai Sudharsan has opened up about Gautam Gambhir's reassuring message that helped him overcome a lean patch. The young India batter says the chat changed his mindset and restored his confidence at the crease."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyer-first-reaction-health-update-rib-injury-recovery-australia-2810567-2025-10-30",
      "headline": "Getting better: Shreyas Iyer's first message after spleen injury horrorIndia's ODI vice-captain Shreyas Iyer has shared a positive update on his recovery after suffering a rib injury during the third ODI against Australia in Sydney. The 29-year-old batter, who was admitted to intensive care following the incident, took to social media to thank fans for their messages and assured that he is making steady progress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/carabao-cup-arsenal-crystal-palace-cardiff-chelsea-manchester-brentford-newcastle-fulham-quarterfinals-2810548-2025-10-30",
      "headline": "Arsenal face Crystal Palace, Cardiff take on Chelsea in League Cup quarter-finalsPremier League leaders Arsenal will host Crystal Palace in the League Cup quarter-finals, while third-tier Cardiff City, the only non-Premier League team to make the last eight, will host Chelsea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-australia-posts-usd-7-million-loss-despite-bumper-ro-ko-comeback-series-2810538-2025-10-30",
      "headline": "Cricket Australia posts USD 7 million loss despite bumper Ro-Ko comeback seriesCricket Australia (CA) on Thursday revealed a net loss of A$11.3 million ($7.34 million) for the 2024–25 financial year, with rising operational costs outweighing the surge in revenue generated from hosting the high-profile Border-Gavaskar series against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-womens-world-cup-semi-final-alyssa-healy-how-to-stop-2810535-2025-10-30",
      "headline": "Storm Alert: How India can clip Alyssa Healy's wings in the semisWomen's World Cup, IND vs AUS: Alyssa Healy has been a force in ICC knockout matches, scoring centuries in both the 2022 semifinal and final. Can India find a way to stop her from going big again on Thursday in Navi Mumbai?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-womens-world-cup-semi-final-weather-forecast-rain-washout-navi-mumbai-2810528-2025-10-30",
      "headline": "IND vs AUS, Women's World Cup semi-final weather: Will rain spoil Navi Mumbai clash?India's Women face defending champions Australia in a high-stakes World Cup semi-final at Navi Mumbai. But with rain threats looming, fans are left hoping the weather doesn't decide the outcome."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/carabao-cup-arsenal-crystal-palace-cardiff-chelsea-manchester-brentford-newcastle-fulham-quarterfinals-2810548-2025-10-30",
      "headline": "Arsenal face Crystal Palace, Cardiff take on Chelsea in League Cup quarter-finalsPremier League leaders Arsenal will host Crystal Palace in the League Cup quarter-finals, while third-tier Cardiff City, the only non-Premier League team to make the last eight, will host Chelsea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-australia-posts-usd-7-million-loss-despite-bumper-ro-ko-comeback-series-2810538-2025-10-30",
      "headline": "Cricket Australia posts USD 7 million loss despite bumper Ro-Ko comeback seriesCricket Australia (CA) on Thursday revealed a net loss of A$11.3 million ($7.34 million) for the 2024–25 financial year, with rising operational costs outweighing the surge in revenue generated from hosting the high-profile Border-Gavaskar series against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-womens-world-cup-semi-final-alyssa-healy-how-to-stop-2810535-2025-10-30",
      "headline": "Storm Alert: How India can clip Alyssa Healy's wings in the semisWomen's World Cup, IND vs AUS: Alyssa Healy has been a force in ICC knockout matches, scoring centuries in both the 2022 semifinal and final. Can India find a way to stop her from going big again on Thursday in Navi Mumbai?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-womens-world-cup-semi-final-weather-forecast-rain-washout-navi-mumbai-2810528-2025-10-30",
      "headline": "IND vs AUS, Women's World Cup semi-final weather: Will rain spoil Navi Mumbai clash?India's Women face defending champions Australia in a high-stakes World Cup semi-final at Navi Mumbai. But with rain threats looming, fans are left hoping the weather doesn't decide the outcome."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-england-vs-south-africa-change-fortune-marizanne-kapp-2810519-2025-10-30",
      "headline": "From 97-all-out to 319/7: How South Africa changed their fortune in semi-finalSouth Africa went from 97-all-out against in their last group-stage game against Australia to hitting 319 runs in the semi-final against England. What changed? Marizanne Kapp reveals."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-womens-world-cup-semi-final-predicted-xi-shafali-verma-radha-yadav-smriti-mandhana-2810510-2025-10-30",
      "headline": "IND vs AUS, predicted XI: Toss up between Harleen, Radha in semi-finalIndia are set to play Australia in the semi-final of the ODI World Cup. Will India make multiple changes in their line-up for knockout game?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-women-cricket-semi-final-australia-world-cup-preview-harmanpreet-kaur-2810347-2025-10-30",
      "headline": "Mountain to climb: Can India script an epic to stop the Australia juggernaut?Women's World Cup 2025, IND vs AUS Preview: Australia head into the semi-final as clear favourites, but Harmanpreet Kaur's India will back themselves to challenge the seven-time champions at the Dr DY Patil Stadium in Navi Mumbai."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-womens-world-cup-mumbai-weather-report-2810456-2025-10-29",
      "headline": "IND vs AUS, Women's World Cup: What happens if semis gets washed out by rain?Women's World Cup: It is expected to rain in Navi Mumbai on Thursday, during India's semi-final against Australia. What happens if the match gets washed out?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kl-rahul-ipl-trade-auction-2810384-2025-10-29",
      "headline": "KL Rahul triggers IPL 2026 trade buzz with cheeky remark in new podcastKL Rahul's recent remarks have set off speculation over his IPL future as reports link him with a potential move from Delhi Capitals to Kolkata Knight Riders. The star batter's journey from IPL debutant to one of the league's most consistent performers adds intrigue to the ongoing trade discussions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-marizanne-kapp-south-africa-vs-england-2810430-2025-10-29",
      "headline": "Tears of joy: Marizanne Kapp buries ghosts of 2017 with 5-wicket spell in semisSouth Africa qualified for their first-ever ICC Women's World Cup final after defeating England by 125 runs. Marizanne Kapp's five-wicket haul and Laura Wolvaardt's 169 runs powered the historic victory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-womens-world-cup-final-laura-wolvaardt-century-marizanne-kapp-2810410-2025-10-29",
      "headline": "Wolvaardt and Kapp fire South Africa into maiden final, send England homeWomen's World Cup: South Africa stormed into their maiden Women's World Cup final with a commanding 100-run win over England at the Barsapara Stadium in Guwahati on Wednesday. Laura Wolvaardt's sublime century and Marizanne Kapp's all-round brilliance powered the Proteas to a historic victory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/womens-world-cup-india-vs-australia-press-conference-2810393-2025-10-29",
      "headline": "No favourites in the semi-final of World Cup: Australia head coachWomen's World Cup: Australia head coach believes that there are no favourites in the semi-final. Shelley Nitschke, speaking in the press conference said that Australia were wary of India's batting depth."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}