{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/missed-emi-loan-harassment-digital-lending-expert-panel-india-2822580-2025-11-19",
      "headline": "When missed EMIs become a nightmare: Inside India's loan harassment trapBehind India's digital lending rise is a quieter story of calls, pressure and fear. Data suggests that loan recovery harassment is growing at a pace the system can no longer keep up with."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/stock-market-closing-bell-sensex-ends-500-points-higher-nifty-above-26000-it-shares-rise-hcltech-gains-4-percent-2822531-2025-11-19",
      "headline": "Sensex ends 500 points higher, Nifty above 26,000; HCLTech gains 4%The S&P BSE Sensex jumped 513.45 points to close at 85,186.47, while the NSE Nifty50 gained 142.60 points to end at 26,052.65. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/indian-wedding-insurance-how-to-get-when-premium-middle-class-luxury-shadi-destination-2822529-2025-11-19",
      "headline": "Big fat Indian weddings can now be insured. Should you get one?India is gearing up for one of its busiest wedding seasons ever. In 2025 alone, nearly 46 lakh weddings are expected, generating close to Rs 6.5 lakh crore in spending. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/he-lost-rs-40000-expert-explains-how-online-gaming-apps-trap-users-2822483-2025-11-19",
      "headline": "He lost Rs 40,000: Expert explains how online gaming apps trap usersExpert says insiders from gaming firms have revealed how these apps operate. They label heavy spenders as \"whales\" and have teams calling them daily to push more deposits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/excelsoft-technologies-ipo-open-bidding-subscribe-skip-expert-review-what-gmp-signals-2822438-2025-11-19",
      "headline": "Excelsoft Technologies IPO open for bidding: Should you subscribe? Check GMPExcelsoft Technologies aims to raise Rs 500 crore through the IPO, which includes a fresh issue of 1.50 crore shares worth Rs 180 crore and an offer for sale (OFS) of 2.67 crore shares worth Rs 320 crore. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/wrong-member-id-linked-to-your-uan-here-how-epfo-lets-you-fix-it-2822407-2025-11-19",
      "headline": "Wrong member ID linked to your UAN? Here's how EPFO lets you fix itMany employees discover that their UAN has been linked to a wrong member ID, often due to job changes or data errors. EPFO has introduced an easy online method to fix this, without visiting any office."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-every-day-micro-payments-eat-into-your-savings-2822376-2025-11-19",
      "headline": "How every day micro-payments eat into your savingsWelcome to India's new spending reality, the age of micro-payments that silently seep into your accounts and cause invisible leaks. By the end of the month, many people find their digital wallets, likePaytm, PhonePe, Google Pay, have quietly leaked hundreds and thousands of rupees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/delhi-ncr-office-space-rent-rise-why-reason-whats-driving-commercial-real-estate-prices-up-noida-2822369-2025-11-19",
      "headline": "NCR office rents are rising: What's driving commercial real estate prices up?Expressway expansions, metro lines, and upcoming airports are easing mobility while opening new economic opportunities in the NCR."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/groww-shares-crash-10-to-hit-lower-circuit-why-are-investors-booking-profits-2822366-2025-11-19",
      "headline": "Groww shares crash 10% to hit lower circuit. Why are investors booking profits?The share price of Groww fell 10% in early trade and slipped straight to the lower circuit, a sharp contrast to the over 90% rally investors had witnessed over the past few days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/government-to-release-new-itr-forms-by-january-2026-how-will-they-impact-taxpayers-2822353-2025-11-19",
      "headline": "Government to release new ITR forms by January 2026. How will they impact taxpayers?What will the new ITR forms, expected by January 2026, mean for ordinary taxpayers as India shifts to the updated Income Tax Act, 2025? Have a look here."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/tenneco-clean-air-share-price-opening-27-percent-premium-bse-nse-listing-stock-market-2822304-2025-11-19",
      "headline": "Tenneco Clean Air Share Price: Stock makes strong debut at 27% premiumTenneco Clean Air shares listed at Rs 505 on the NSE and Rs 498 on the BSE, compared with its issue price of Rs 397."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/groww-shares-slump-6-after-massive-post-listing-rally-whats-next-2822296-2025-11-19",
      "headline": "Groww shares slump 10% after massive post-listing rally. Why is it falling today?After four straight sessions of runaway gains, the stock finally cooled off on Wednesday, down sharply in early trade. At around 9:50 am, shares of the company were down 10% to Rs 169.89 on the NSE. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/waaree-energies-it-department-raid-share-impact-2822283-2025-11-19",
      "headline": "Waaree Energies share price falls over 5%. Why is it down today?The stock slipped 4.26% to Rs 3,143.20 on the BSE in the opening minutes and later extended losses to trade 5.6% lower at Rs 3,089."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-trade-flat-analysts-urge-investors-to-stay-defensive-2822271-2025-11-19",
      "headline": "Sensex, Nifty trade flat; analysts urge investors to stay defensiveThe S&P BSE Sensex slipped 81.17 points to 84,591.85 at 9:22 am, while the NSE Nifty50 fell 32.40 points to 25,877.65."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/gold-silver-prices-today-india-why-falling-reason-us-fed-rate-what-investors-should-know-2822258-2025-11-19",
      "headline": "Gold, silver prices drop: Will the fall continue? What investors should knowGold, silver price: The focus now is on the minutes from the Fed's latest policy meeting and key US jobs data, both of which may influence gold and silver prices in the coming days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/tenneco-clean-air-ipo-listing-share-price-opening-expectation-latest-gmp-suggest-strong-weak-start-2822246-2025-11-19",
      "headline": "Tenneco Clean Air IPO listing: Strong debut or slow start? What GMP suggestsTenneco Clean Air offered 6,34,76,070 shares, but investors placed bids for 3,92,21,37,714 shares, amounting to Rs 1,55,708.87 crore, showing strong interest in the company."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/credit-card-emis-smart-tool-or-hidden-cost-2821981-2025-11-18",
      "headline": "Credit card EMIs: Smart tool or hidden cost?Credit card EMIs have become a common way to manage big purchases, but are they truly a smart budgeting tool or just another expense disguised as convenience?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-deal-good-news-soon-fair-and-equitable-piyush-goyal-2821920-2025-11-18",
      "headline": "Good news on India–US trade deal once it's fair and equitable, says Piyush GoyalSpeaking at the Indo-US Economic Summit organised by the Indo-American Chamber of Commerce in New Delhi, Piyush Goyal said negotiations are moving ahead, but a final announcement will come only when the terms are acceptable and mutually beneficial."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/what-is-9-9-6-work-culture-narayana-murthy-india-inc-working-hours-72-in-a-week-china-2821853-2025-11-18",
      "headline": "What is the 9-9-6 work culture Narayana Murthy wants Indians to learn from?In his latest remarks, Murthy referred to China's well-known 9-9-6 working culture, a system followed by many Chinese tech companies during their rapid growth phase."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/health-insurance-claim-settlement-ratios-misleading-explained-2821852-2025-11-18",
      "headline": "What your health insurer's high claim settlement ratio isn't telling youHealth insurance claim settlement ratios often look impressive but hide critical details about payouts, delays, and deductions. In this special report, we unpack what the number really means for policyholders."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/armaan-malik-emotional-reunion-with-brother-amaal-mallik-bigg-boss-19-house-2822688-2025-11-19",
      "headline": "Watch Armaan Malik's emotional reunion with brother Amaal in Bigg Boss 19 house Singer Armaan Malik's appearance on 'Bigg Boss 19' during family week led to an emotional moment with his brother Amaal. The siblings also discussed personal matters, family reactions, and relationships in the house."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/austin-butler-dismisses-relationship-rumours-with-emily-ratajkowski-clarifies-friends-2822621-2025-11-19",
      "headline": "Is Austin Butler dating Emily Ratajkowski after Kaia Gerber split? Actor Austin Butler clarifies speculation regarding his relationship with Emily Ratajkowski after several public appearances together, emphasising their friendship and addressing the attention surrounding their interactions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-raj-nidimoru-make-appearance-at-hyderabad-airport-2822671-2025-11-19",
      "headline": "Samantha-Raj Nidimoru make appearance at Hyderabad airport After dropping a cosy picture with filmmaker Raj Nidimoru recently, Samantha stepped out of Hyderabad with him on Wednesday evening. The duo were papped at the city's airport before boarding their flight."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/zee5-regai-tamil-crime-thriller-trailer-dark-psychological-mystery-2822615-2025-11-19",
      "headline": "Regai trailer: Tamil crime series that teases motive-less murders ZEE5 released the trailer for 'Regai', a Tamil crime thriller premiering on November 28. The series delves into unsettling mysteries and moral ambiguity, challenging viewers to confront hidden truths."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/suga-launches-music-programme-autistic-children-severance-hospital-2822656-2025-11-19",
      "headline": "BTS' SUGA's MIND program hosts first concert for autistic kids with his tour band SUGA's significant donation enables a music initiative at Severance Hospital, culminating in a special concert for autistic children featuring his tour band, with profits supporting ongoing therapy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/kang-seungyoon-bts-jin-friendship-military-service-k-pop-bonds-2822601-2025-11-19",
      "headline": "Seung-yoon thanks BTS' Jin for support during service: He contacted me first WINNER's Kang Seung-yoon has shared insights into his close friendship with BTS member Jin, formed during their mandatory military service in South Korea. Seung-yoon spoke candidly about their interactions and the support he received from Jin, highlighting the importance of camaraderie among K-pop idols during their enlistment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aishwarya-rai-back-in-mumbai-after-attending-event-with-pm-modi-glows-in-anarkali-2822614-2025-11-19",
      "headline": "Aishwarya Rai back in Mumbai after attending event with PM Modi, glows in anarkali Aishwarya Rai Bachchan wore an embellished anarkali for her appearance at the Sathya Sai Baba event on Tuesday. She looked radiant in her ethnic wear."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/madhuri-dixit-serial-killer-mrs-deshpande-teaser-psychological-thriller-2822596-2025-11-19",
      "headline": "Mrs Deshpande: Madhuri Dixit looks sinister in first look from psychological thriller Madhuri Dixit reportedly debuts as a serial killer in the psychological thriller 'Mrs Deshpande'. The teaser reveals a dark transformation, hinting at a gripping new role on OTT."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/anime-genius-makoto-shinkai-films-are-here-check-out-on-which-indian-ott-2822591-2025-11-19",
      "headline": "Anime genius Makoto Shinkai's films are here! Check out on which Indian OTT Makoto Shinkai's full film collection is finally streaming in India, with eight titles, including 'Your Name', 'Weathering With You' and 'Suzume' arriving this December."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/veer-pahariya-calls-tara-sutaria-his-whole-heart-in-romantic-birthday-post-2822579-2025-11-19",
      "headline": "My whole heart: On Tara Sutaria's birthday, Veer Pahariya shares a romantic post Tara Sutaria and Veer Pahariya's growing romance takes centre stage as the couple shares affectionate moments online and at public events. Now, the latter shared a hearty birthday wish for her on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/anurag-kashyap-reviews-manjummel-boys-hindi-cinema-really-is-far-left-behind-2511656-2024-03-07",
      "headline": "Anurag Kashyap reviews 'Manjummel Boys': 'Hindi cinema really is far left behind' Filmmaker Anurag Kashyap reviewed the Malayalam film 'Manjummel Boys'. He called the survival thriller 'simply an extraordinary piece of confident mainstream filmmaking'."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dhruv-rathee-ranvir-shorey-clash-dhurandhar-trailer-violence-gangs-of-wasseypur-2822549-2025-11-19",
      "headline": "Dhurandhar row: Ranvir Shorey slams Dhruv Rathee after U-turn on Wasseypur praise Dhruv Rathee criticised the violent content of the 'Dhurandhar' trailer, sparking a heated online debate. A heated debate erupted on social media between him and actor Ranvir Shorey over the violent content in the trailer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dining-with-the-kapoors-director-smriti-mundhra-on-making-dining-with-the-kapoors-2822563-2025-11-19",
      "headline": "Exclusive: Inside Dining With the Kapoors with Armaan Jain, where legacy meets food In an exclusive interview with India Today, 'Dining With The Kapoors' creators Armaan Jain and Smriti Mundhra spoke about celebrating the Kapoor legacy and Raj Kapoor. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nabha-natesh-adventurous-bungee-jump-upcoming-multi-language-film-nagabandham-2822517-2025-11-19",
      "headline": "Nabha Natesh goes bungee jumping, Swayambhu co-star Nikhil Siddhartha reacts Actor Nabha Natesh showed her adventurous side by bungee jumping in New Zealand, as co-actor Nikhil Siddharth reacted with surprise"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/haq-director-backs-dhurandhar-says-foreign-films-with-same-violence-are-praised-2822550-2025-11-19",
      "headline": "Haq director backs Dhurandhar, says foreign films with same violence are praised Director Suparn S Varma came out in support of Aditya Dhar after the 'Dhurandhar' trailer drew backlash for its violent scenes. He criticised the double standards in how Indian films are judged compared to international cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/zayn-malik-jisoo-eyes-closed-collaboration-billboard-hot-100-2822521-2025-11-19",
      "headline": "Zayn says Jisoo collab happened naturally: My daughter's gonna think I'm cool British singer Zayn Malik reflects on his collaborative single with BLACKPINK's Jisoo, detailing how the partnership emerged and the impact his daughter's admiration for the K-pop star had on his decision to participate."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pushpalatha-alleges-rs-65-lakh-fraud-film-promoter-harish-arasu-kothalavadi-promotion-2822537-2025-11-19",
      "headline": "Actor Yash's mother alleges Rs 65 lakh fraud by film promoter, files complaint Pushpalatha, mother of actor Yash, has filed a complaint with Bengaluru police accusing film promoter Harish Arasu of cheating her out of Rs 64,87,700 during the promotion of her debut film 'Kothalavadi'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/priyanka-chopra-jonas-returns-indian-cinema-ss-rajamouli-varanasi-telugu-dubbing-2822413-2025-11-19",
      "headline": "Priyanka Chopra confirms Telugu dubbing for Rajamouli's Varanasi Priyanka Chopra Jonas is set to make her return to Indian cinema after almost six years, taking on a lead role in SS Rajamouli's new film 'Varanasi'. She will voice her own character in the sci-fi project, confirming her involvement in both acting and Telugu dubbing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/anna-kournikova-enrique-iglesias-expecting-fourth-child-growing-family-miami-beach-2822460-2025-11-19",
      "headline": "Enrique Iglesias shares he's expecting baby No. 4: So excited Tennis star Anna Kournikova and singer Enrique Iglesias are expecting their fourth child, with the couple reportedly \"so excited\" as they prepare to become a family of six."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nitish-kumar-resign-bihar-cm-jdu-nda-leader-oath-ceremony-2822272-2025-11-19",
      "headline": "Nitish Kumar resigns, set for record 10th oath as Chief Minister tomorrow Live UpdatesEarlier in the day, the Bharatiya Janata Party (BJP) opted for continuity by electing Samrat Chaudhary as the leader of its legislative party and Vijay Kumar Sinha as his deputy, with both continuing as Deputy Chief Ministers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pak-leader-chaudhry-anwarul-haq-red-fort-blast-terror-groups-attacked-india-2822484-2025-11-19",
      "headline": "We hit India from Red Fort to Kashmir's forests: Pak leader's big admissionIn a stunning admission of Pakistan's role in fuelling cross-border terrorism, Pakistani leader Chaudhry Anwarul Haq openly acknowledged that terror outfits struck India \"from the Red Fort to the forests of Kashmir\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bihar-election-nitish-kumar-oath-gandhi-maidan-jan-suraaj-prashant-kishor-fast-gandhi-ashram-fastingjdu-2822459-2025-11-19",
      "headline": "Tejashwi, Rahul missing, PK emerges as tallest Bihar Opposition leaderWith Rahul Gandhi and Tejashwi Yadav missing after the poll debacle in Bihar, Jan Suraaj founder Prashant Kishor has stepped into the spotlight, vowing to hold the NDA accountable on its poll promises. PK is starting his role of an opposition leader with a fast at Champaran's Gandhi Ashram, coinciding with Nitish Kumar's oath ceremony at Patna's Gandhi Maidan on November 20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nithari-serial-killings-children-moninder-pandher-surindra-koli-secrets-rape-necrophilia-2822404-2025-11-19",
      "headline": "Nobody killed Nithari children? Moninder Pandher bares all on 19-year mysteryNithari killings: Both the accused in the sensational Nithari serial killings, Surender Koli and Moninder Singh Pandher, have now been acquitted. It leaves a simple, unanswered question: Who killed the children? Pandher divulges all in a tell-all interview."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aishwarya-rai-touches-pm-modis-feet-at-event-speaks-on-love-and-religion-video-2822446-2025-11-19",
      "headline": "Aishwarya Rai touches PM Modi's feet at event, speaks on love and religion. VideoAishwarya Rai Bachchan attended the birth centenary celebrations of Sri Sathya Sai Baba in Puttaparthi, where she touched Prime Minister Narendra Modi's feet before delivering a speech on caste, religion and love."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/gangster-anmol-bishnoi-deportation-lawrence-bishnoi-live-updates-news-us-nia-2822314-2025-11-19",
      "headline": "Live: NIA gets 11-day custody of Lawrence Bishnoi's brother AnmolAnmol Bishnoi Deportation Live: Gangster Anmol Bishnoi, wanted in multiple high-profile cases including the murder of NCP leader Baba Siddiqui, has been brought to India and handed over to NIA. He landed at Delhi airport under heavy security and is being taken directly to Patiala House Court. His return marks a major breakthrough for central agencies, with several state police forces now set to seek his custody."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/varanasi-title-dispute-rajamouli-rama-bramha-hanuma-creations-2822228-2025-11-19",
      "headline": "Varanasi: Title dispute erupts over Rajamouli-Mahesh Babu-Priyanka Chopra filmA dispute over the title rights of the upcoming film 'Varanasi' has emerged after it was learnt that it lies with CH Subba Reddy of Rama Bramha Hanuma Creations. The Rajamouli-directorial features Mahesh Babu, Priyanka Chopra and Prithviraj Sukumaran."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/sundar-pichai-warns-ai-bubble-burst-could-shake-every-tech-firm-including-google-2822256-2025-11-19",
      "headline": "Sundar Pichai warns AI bubble burst could shake all tech firms, including GoogleAs AI fever grips global markets, Google CEO Sundar Pichai warns that when the hype cools, even the biggest tech players may feel the chill."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ram-charan-wife-upasana-kamineni-konidela-advise-to-women-freeze-eggs-have-kids-later-controversy-ram-charan-2822522-2025-11-19",
      "headline": "Freeze eggs, focus on career: Upasana Konidela faces backlash after advice at IITUpasana Konidela, a top executive of Apollo Hospitals, faced massive backlash after suggesting students at IIT Hyderabad to prioritise careers by freezing eggs. Doctors called out Konidela's claim that egg freezing was an \"insurance\". Upasana Konidela married actor Ram Charan when she was 23 and had a child at 34."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/what-does-flying-do-to-your-body-top-cardiologists-explain-how-to-protect-your-heart-on-a-flight-2821892-2025-11-19",
      "headline": "Flying and your heart: Top cardiologists explain how to stay safe in the airAir travel may feel routine, but the changes inside an aircraft cabin can quietly stress your heart. Experts explain what happens to your body when you fly and how to stay safe in the air."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/tiger-returns-to-gujarat-after-32-years-ratan-mahal-wildlife-sanctuary-forest-big-cat-2822332-2025-11-19",
      "headline": "Tiger zinda hai: Big cat returns to Gujarat forest after 32 yearsForest officials have confirmed that a male tiger has been living in the Ratan Mahal Wildlife Sanctuary in Dahod district for the past nine months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-shubman-gill-guwahati-test-neck-injury-2822632-2025-11-19",
      "headline": "Shubman Gill eager to play Guwahati Test despite neck injury concerns: ReportIndia vs South Africa, 2nd Test: Despite widespread speculation that Shubman Gill would be ruled out of the second Test starting Saturday in Guwahati, the captain is reportedly keen to prove his fitness and make himself available for selection. Gill suffered a neck injury during India's 30-run defeat in the first Test in Kolkata."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/missed-emi-loan-harassment-digital-lending-expert-panel-india-2822580-2025-11-19",
      "headline": "When missed EMIs become a nightmare: Inside India's loan harassment trapBehind India's digital lending rise is a quieter story of calls, pressure and fear. Data suggests that loan recovery harassment is growing at a pace the system can no longer keep up with."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/cgc-university-mohali-where-vision-becomes-legacy-and-education-becomes-evolution-2821185-2025-11-17",
      "headline": "CGC University, Mohali: Where vision becomes legacy and education becomes evolutionStories of students who dare to dream, of educators who ignite curiosity, and of a community that chooses progress with purpose."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/selective-outrage-judges-bureaucrats-slam-rahul-gandhis-vote-chori-charge-2822393-2025-11-19",
      "headline": "Selective outrage: Judges, bureaucrats slam Rahul Gandhi's vote chori chargeAn open letter, written by 272 eminent personalities, called out the Congress's criticism towards the Election Commission and urged an end to conspiracy-laced rhetoric against institutions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjp-congress-shashi-tharoor-pm-modi-speech-praise-issued-fatwa-shehzad-poonawala-supriya-shrinate-controversy-2822687-2025-11-19",
      "headline": "Issued fatwa: BJP attacks Congress after Tharoor's Modi praise, talks of LK episodeBJP spokesperson Shehzad Poonawala has slammed the Congress after it criticised MP Shashi Tharoor for praising PM Narendra Modi's speech. Poonawala accused the Congress of intolerance, recalling that it had issued a \"fatwa\" against Tharoor when he praised BJP veteran LK Advani and wrote about the pitfalls of dynastic politics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/why-outrage-over-ram-charans-wife-upasana-egg-freezing-advice-is-hypocrisy-2822564-2025-11-19",
      "headline": "Wah society wah! Why outrage over Upasana's egg-freezing advice is hypocrisyUpasana Konidela's comments have upset many, but in this outrage, are we once again policing a woman's right to choose?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bangladesh-nsa-meets-ajit-doval-invites-him-to-dhaka-amid-strained-ties-sheikh-hasina-2822704-2025-11-19",
      "headline": "Bangladesh NSA meets Ajit Doval, invites him to Dhaka amid strained tiesTies between India and Bangladesh began to shake after former Prime Minister Hasina fled to New Delhi after her ouster during violent students' protest in her own country. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/noida-pg-operator-slaps-girl-after-she-asks-for-security-deposit-video-goes-viral-2822691-2025-11-19",
      "headline": "Noida PG operator slaps girl after she asks for security deposit. Video goes viralNoida Update, which first posted the now-viral video, alleged that the girl was assaulted during a dispute over vacating the PG and collecting her security deposit. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/plane-carrying-deported-gangster-anmol-bishnoi-wanted-in-baba-siddique-murder-lands-in-india-2822486-2025-11-19",
      "headline": "Anmol Bishnoi, wanted in NCP leader and Moose Wala murders, sent to NIA custody Live UpdatesAnmol Bishnoi, brother of jailed gangster Lawrence Bishnoi and an accused in the Baba Siddique murder and Salman Khan firing cases, was deported from the US and produced before a Delhi court, which sent him to an 11-day custody."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/video-bengaluru-woman-dragged-kicked-beaten-in-daylight-by-neighbour-cctv-captures-assault-2822681-2025-11-19",
      "headline": "Caught on CCTV: Bengaluru woman dragged, kicked by neighbour over petty disputeA woman in Bengaluru's Kodigehalli was brutally assaulted by her neighbour and his family after she objected to construction workers drilling into her compound wall. CCTV footage shows the main accused dragging her by the hair and kicking her to the ground."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/india-afghanistan-relation-trade-commerce-industry-minister-alhaj-nooruddin-azizi-amid-trade-blockade-pakistan-2822578-2025-11-19",
      "headline": "After Muttaqi, Afghan trade minister lands in India amid Pak trade freezeAfter Afghanistan's Foreign Minister Amir Khan Muttaqi wrapped up a successful visit to India, the Taliban regime's Industry and Commerce Minister, Alhaj Nooruddin Azizi, has landed in New Delhi for a five-day trip. Azizi's trip comes at a time when Pakistan has kept its key border crossings with Afghanistan closed, and the Taliban regime is urgently seeking new trade partners and routes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/egg-freezing-is-not-an-insurance-policy-guarantee-upasana-konidela-sparks-debate-2822589-2025-11-19",
      "headline": "Egg freezing and IVF: Not the guarantee women are soldUpasana Konidela's remark on egg freezing reignites fertility discussions in India. Is it truly an insurance policy for women?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/who-was-saalumarada-thimakka-the-karnataka-tree-mother-who-planted-8000-trees-2822597-2025-11-19",
      "headline": "Saalumarada Thimakka, the 114-year-old who planted a forest with her bare handsIndia has lost Padma Shri Saalumarada Thimakka, the 114-year-old environmental icon whose life reads like a lesson in hope. From planting 385 banyan saplings with her husband to nurturing over 8,000 trees, she turned a personal struggle into a legacy of green activism."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/austin-butler-dismisses-relationship-rumours-with-emily-ratajkowski-clarifies-friends-2822621-2025-11-19",
      "headline": "Is Austin Butler dating Emily Ratajkowski after Kaia Gerber split?Actor Austin Butler clarifies speculation regarding his relationship with Emily Ratajkowski after several public appearances together, emphasising their friendship and addressing the attention surrounding their interactions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-raj-nidimoru-make-appearance-at-hyderabad-airport-2822671-2025-11-19",
      "headline": "Samantha-Raj Nidimoru make appearance at Hyderabad airportAfter dropping a cosy picture with filmmaker Raj Nidimoru recently, Samantha stepped out of Hyderabad with him on Wednesday evening. The duo were papped at the city's airport before boarding their flight."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/lizelle-lee-wicketkeeping-error-wbbl-hobart-hurricanes-adelaide-strikers-trolls-2822695-2025-11-19",
      "headline": "Lizelle Lee trolled with distasteful comments after wicketkeeping blooper in WBBL Lizelle Lee faced a wave of distasteful online trolling after a rare wicketkeeping blunder in the Hurricanes–Strikers WBBL clash despite her distinguished record as one of the league's most prolific performers.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-hardik-pandya-jasprit-bumrah-likely-skip-odi-series-t20-world-cup-importance-2822682-2025-11-19",
      "headline": "Pandya, Bumrah likely to skip SA ODIs, with T20 World Cup approaching: Report Both Hardik Pandya and Jasprit Bumrah are reportedly set to skip the ODI series against South Africa, keeping themselves fully focused for the T20 World Cup that is set to take place in 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-2025-26-pat-cummins-injury-perth-test-mitchell-starc-2822679-2025-11-19",
      "headline": "Pat Cummins ready for Perth Test? Starc jokes about skipper's availability Australia captain Pat Cummins is ruled out of the first Ashes Test due to injury but shows positive signs of recovery. Australia to take on England in the first Test of Ashes 2025-26 on November 21."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-coach-pressure-home-test-india-vs-south-africa-2822659-2025-11-19",
      "headline": "Has Gautam Gambhir overengineered India into a Test crisis? India's home aura is fading fast, and the questions are no longer whispers. With four home defeats in six Tests and the team drifting without clarity, Gautam Gambhir's bold ideas face a harsher truth: is he really the man to lead India's red-ball rebuild?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harmanpreet-kaur-brand-endorsements-triple-after-india-womens-cricket-world-cup-victory-2822650-2025-11-19",
      "headline": "Harmanpreet Kaur on fire, expected to triple brand deals after World Cup glory Harmanpreet Kaur's Women's World Cup win has sparked a surge in brand interest, with her endorsements set to triple as companies increasingly embrace women's cricket and its empowering narrative.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/venkatesh-iyer-kkr-release-ipl-2026-return-leadership-2822624-2025-11-19",
      "headline": "Venkatesh Iyer hopes for KKR return despite release: Still want to play for them IPL 2026: Venkatesh Iyer expressed his desire to continue with KKR despite being released, saying he remains open to any IPL team while highlighting his readiness to contribute with batting, bowling and leadership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-u19-mens-cricket-world-cup-2026-schedule-no-india-vs-pakistan-2822607-2025-11-19",
      "headline": "ICC U19 World Cup 2026 to begin on January 15, India, Pakistan not in same group The ICC has released the schedule for the Men's Under-19 Cricket World Cup 2026, which will take place in Zimbabwe and Namibia. Sixteen teams will compete in 41 matches, with Tanzania making their debut. However, there won't be any India vs Pakistan fixture in the group stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-shubman-gill-guwahati-test-neck-injury-2822632-2025-11-19",
      "headline": "Shubman Gill eager to play Guwahati Test despite neck injury concerns: Report India vs South Africa, 2nd Test: Despite widespread speculation that Shubman Gill would be ruled out of the second Test starting Saturday in Guwahati, the captain is reportedly keen to prove his fitness and make himself available for selection. Gill suffered a neck injury during India's 30-run defeat in the first Test in Kolkata."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-odi-series-win-conway-ravindra-century-stand-west-indies-2822598-2025-11-19",
      "headline": "Shai Hope gives honest review after New Zealand series defeat: 109 still not enough West Indies captain Shai Hope delivered an honest assessment after his superb 109 still wasn't enough to secure victory in New Zealand, saying he should have pushed on to \"120 or 130\" and admitting the team lost its way during the middle overs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kevin-pietersen-defends-pro-india-stance-hits-back-at-trolls-2822594-2025-11-19",
      "headline": "Kevin Pietersen snaps back at trolls, reveals reason behind favouring India Former England cricketer Kevin Pietersen defends his pro-India stance amid criticism, mentioning the respect and lifelong friendships he has gained in the country for over two decades."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/roger-federer-inducted-international-tennis-hall-of-fame-record-grand-slams-2822592-2025-11-19",
      "headline": "Legendary Roger Federer inducted into International Tennis Hall of Fame Roger Federer was elected to the International Tennis Hall of Fame's Class of 2026 in his first year of eligibility, capping a legendary career that included 20 Grand Slam titles and a lasting impact on the sport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-u19-mens-cricket-world-cup-2026-schedule-no-india-vs-pakistan-2822607-2025-11-19",
      "headline": "ICC U19 World Cup 2026 to begin on January 15, India, Pakistan not in same group The ICC has released the schedule for the Men's Under-19 Cricket World Cup 2026, which will take place in Zimbabwe and Namibia. Sixteen teams will compete in 41 matches, with Tanzania making their debut. However, there won't be any India vs Pakistan fixture in the group stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-shubman-gill-guwahati-test-neck-injury-2822632-2025-11-19",
      "headline": "Shubman Gill eager to play Guwahati Test despite neck injury concerns: Report India vs South Africa, 2nd Test: Despite widespread speculation that Shubman Gill would be ruled out of the second Test starting Saturday in Guwahati, the captain is reportedly keen to prove his fitness and make himself available for selection. Gill suffered a neck injury during India's 30-run defeat in the first Test in Kolkata."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-odi-series-win-conway-ravindra-century-stand-west-indies-2822598-2025-11-19",
      "headline": "Shai Hope gives honest review after New Zealand series defeat: 109 still not enough West Indies captain Shai Hope delivered an honest assessment after his superb 109 still wasn't enough to secure victory in New Zealand, saying he should have pushed on to \"120 or 130\" and admitting the team lost its way during the middle overs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kevin-pietersen-defends-pro-india-stance-hits-back-at-trolls-2822594-2025-11-19",
      "headline": "Kevin Pietersen snaps back at trolls, reveals reason behind favouring India Former England cricketer Kevin Pietersen defends his pro-India stance amid criticism, mentioning the respect and lifelong friendships he has gained in the country for over two decades."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/roger-federer-inducted-international-tennis-hall-of-fame-record-grand-slams-2822592-2025-11-19",
      "headline": "Legendary Roger Federer inducted into International Tennis Hall of Fame Roger Federer was elected to the International Tennis Hall of Fame's Class of 2026 in his first year of eligibility, capping a legendary career that included 20 Grand Slam titles and a lasting impact on the sport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mushfiqur-rahim-unbeaten-99-100th-test-bangladesh-mirpur-ireland-2822561-2025-11-19",
      "headline": "Sleepless night for Mushfiqur Rahim in 100th Test as batter stuck on 99 vs IrelandBAN vs IRE: Mushfiqur Rahim capped his 100th Test with a gritty unbeaten 99, steering Bangladesh to 292 for four and setting up a highly anticipated push for a landmark century on Day 2 in Mirpur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-series-win-over-west-indies-shai-hope-victory-napier-2822539-2025-11-19",
      "headline": "Shai Hope's 109 in vain as New Zealand win Napier thriller to claim ODI seriesNew Zealand sealed a 2-0 series lead with a five-wicket win in the rain-shortened second ODI, chasing 248 with three balls to spare. Shai Hope's brilliant unbeaten 109, which equalled Brian Lara's West Indies record of 19 ODI hundreds, went in vain. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rinku-singh-ranji-trophy-performance-demands-test-selection-india-2822494-2025-11-19",
      "headline": "Pigeonholed as a T20I finisher? In-form Rinku Singh deserves a Test look-inRinku Singh's dominant 175 against Tamil Nadu has reignited the debate around his long-format potential. With a stellar First-Class average of 57.39 and consistent domestic performances, the Uttar Pradesh batter is making a persuasive case for a long-overdue Test call-up."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-ashes-12-man-squad-spinner-option-mark-wood-fit-perth-test-2822490-2025-11-19",
      "headline": "England keep playing XI suspense alive, name 12-man squad for Perth series openerEngland have named a 12-man squad for the first Ashes Test against Australia in Perth. The visiting team has kept the spinner selection flexible while Mark Wood is fit after injury concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-daryl-mitchell-icc-odi-rankings-no1-batter-bumrah-test-bowler-2822461-2025-11-19",
      "headline": "Rohit Sharma loses No. 1 spot in ODI batting ranking weeks after Sydney centuryFormer India captain Rohit Sharma has lost the No.1 spot in the latest ICC ODI batting rankings, with Daryl Mitchell becoming the first New Zealander since 1979 to rise to the top of the list."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-south-africa-shubman-gill-kolkata-airport-neck-brace-guwahati-2822439-2025-11-19",
      "headline": "Shubman Gill spotted with neck brace at Kolkata airport, travels to GuwahatiIndia Test captain Shubman Gill was spotted at Kolkata airport wearing a neck brace as he travelled with the rest of the Indian team to Guwahati for the second Test against South Africa, starting on November 22."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shai-hope-brian-lara-19th-odi-hundred-6000-runs-west-indies-vs-new-zealand-2822410-2025-11-19",
      "headline": "Shai Hope equals Brian Lara with 19th ODI hundred in rescue act vs New ZealandWest Indies captain Shai Hope struck his 19th ODI hundred, an unbeaten 109, to pull his team out of early trouble and lift them to 247 in the second ODI against New Zealand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/lebron-james-skipping-la-2028-olympics-steph-curry-doubtful-2822416-2025-11-19",
      "headline": "LeBron James hints at skipping 2028 Olympics in Los Angeles, Curry's return doubtfulLeBron James and Stephen Curry opened up on a podcast, revealing doubts about their Olympic futures as Team USA approaches a generational shift ahead of the 2028 Los Angeles Games, raising questions about a new era without its biggest icons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-daryl-mitchell-icc-odi-rankings-no1-batter-bumrah-test-bowler-2822461-2025-11-19",
      "headline": "Rohit Sharma loses No. 1 spot in ODI batting ranking weeks after Sydney centuryFormer India captain Rohit Sharma has lost the No.1 spot in the latest ICC ODI batting rankings, with Daryl Mitchell becoming the first New Zealander since 1979 to rise to the top of the list."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-south-africa-shubman-gill-kolkata-airport-neck-brace-guwahati-2822439-2025-11-19",
      "headline": "Shubman Gill spotted with neck brace at Kolkata airport, travels to GuwahatiIndia Test captain Shubman Gill was spotted at Kolkata airport wearing a neck brace as he travelled with the rest of the Indian team to Guwahati for the second Test against South Africa, starting on November 22."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shai-hope-brian-lara-19th-odi-hundred-6000-runs-west-indies-vs-new-zealand-2822410-2025-11-19",
      "headline": "Shai Hope equals Brian Lara with 19th ODI hundred in rescue act vs New ZealandWest Indies captain Shai Hope struck his 19th ODI hundred, an unbeaten 109, to pull his team out of early trouble and lift them to 247 in the second ODI against New Zealand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/lebron-james-skipping-la-2028-olympics-steph-curry-doubtful-2822416-2025-11-19",
      "headline": "LeBron James hints at skipping 2028 Olympics in Los Angeles, Curry's return doubtfulLeBron James and Stephen Curry opened up on a podcast, revealing doubts about their Olympic futures as Team USA approaches a generational shift ahead of the 2028 Los Angeles Games, raising questions about a new era without its biggest icons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-injury-update-india-vs-south-africa-2nd-test-guwahati-2822415-2025-11-19",
      "headline": "Shubman Gill to travel to Guwahati, not ruled out of 2nd Test vs South AfricaIndia vs South Africa: The BCCI on Wednesday confirmed that Shubman Gill would travel with the rest of the team to Guwahati. The board added that the captain has responded well to treatment after being hospitalised for a neck injury sustained in Kolkata."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/glenn-mcgrath-exits-abc-ashes-coverage-betting-company-ties-2822395-2025-11-19",
      "headline": "McGrath dropped! Australia great out of commentary duty over betting dealAustralian cricket legend Glenn McGrath has withdrawn from ABC's Ashes coverage following the broadcaster's policy on betting affiliations, prompting a reshuffle in the commentary lineup ahead of the first Test in Perth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-zimbabwe-tri-series-sikandar-raza-journalist-viral-reply-2822372-2025-11-19",
      "headline": "I don't care: Zimbabwe captain stuns Pak journalist with blunt reply before tri-seriesZimbabwe captain Sikandar Raza declined to rank Asian T20I teams when answering a question from a reporter in Rawalpindi. The all-rounder handled an unrelated question with unrelated question with both grace and firmness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-1st-test-sourav-ganguly-eden-gardens-bcci-kolkata-2822361-2025-11-19",
      "headline": "BCCI curators took over: Sourav Ganguly distances himself from Eden pitch sagaThere has been plenty of talk surrounding the Eden Gardens pitch, and Cricket Association of Bengal (CAB) president Sourav Ganguly has now clarified that BCCI-appointed curators were in charge of the surface for the upcoming Test match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-2025-shane-warne-tribute-england-fans-boxing-day-test-mcg-2822365-2025-11-19",
      "headline": "Shane Warne's magic lives on: England fans to make emotional tribute on Boxing DayEngland's Barmy Army is preparing a fitting tribute to honour the late Shane Warne during the Boxing Day Test at the MCG, marking the first Ashes clash at the venue since his passing and uniting fans beyond traditional rivalry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/lightning-disrupts-australias-ashes-training-session-perth-stadium-2822311-2025-11-19",
      "headline": "Lightning halts Australia's training session ahead of 1st Test in PerthAustralia's training session ahead of the Ashes at Perth Stadium was abruptly halted after lightning was detected in the vicinity, despite clear skies. Players and staff were immediately instructed to leave the field in accordance with safety regulations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ricky-ponting-claims-bazball-designed-to-win-ashes-in-australia-2822288-2025-11-19",
      "headline": "Bazball was designed only for Ashes in Australia: Ponting's stunning claimFormer Australia captain Ricky Ponting has claimed that England's Bazball approach was crafted with a single objective: to win the Ashes in Australia. He also accused the team of being dishonest in the way they publicly speak about their aggressive style and the results it has produced."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}