{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-offered-zero-tariff-trade-deal-donald-trump-2725297-2025-05-15",
      "headline": "India offered zero-tariff trade deal: Donald TrumpUS President Donald Trump claimed that India has offered the United States a trade deal with \"literally zero tariffs\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/yes-bank-shares-jump-21-percent-in-5-days-what-investors-need-to-know-2725245-2025-05-15",
      "headline": "YES Bank shares jump 21% in 5 days. What investors need to knowSMBC, a part of the Sumitomo Mitsui Financial Group (SMFG), plans to buy the 20% stake from State Bank of India (SBI) and seven private banks, HDFC Bank, ICICI Bank, Kotak Mahindra Bank, Axis Bank, IDFC First Bank, Federal Bank, and Bandhan Bank. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-ends-1200-points-higher-nifty-above-25000-tata-motors-surges-4-percent-2725220-2025-05-15",
      "headline": "Sensex ends 1,200 points higher, Nifty above 25,000; Tata Motors surges 4%The S&P BSE Sensex surged 1,200.18 points to end at 82,530.74, while the NSE Nifty50 gained 395.60 points to close at 25,062.10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-claims-india-offered-zero-tariff-deal-in-trade-talks-2725187-2025-05-15",
      "headline": "Donald Trump claims India has offered zero-tariff deal in trade talksSpeaking at a business forum in Qatar, Trump said, \"India has offered us a deal where basically they are willing to literally charge us no tariff.\" He didn't provide further details, and there was no immediate response from the Indian government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/planning-a-personal-loan-7-hidden-charges-you-must-know-about-processing-fee-late-payment-fee-emi-bounce-charges-2725178-2025-05-15",
      "headline": "Planning a personal loan? 7 hidden charges you must know aboutMany people only look at the interest rate when taking a personal loan. But there are several other costs that can add up. Knowing these charges helps you plan better, avoid surprises, and even negotiate some of them with the bank."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-rally-sensex-jumps-1300-points-over-reports-of-india-offering-no-tariff-deal-to-us-nifty-gain-2725179-2025-05-15",
      "headline": "Sensex jumps 1,300 points: Why is stock market rising today?As of 2:38 p.m., the S&P BSE Sensex had gained 1,217.88 points to reach 82,548.44, and the NSE Nifty50 had climbed 410.57 points to 25,077.50."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/fds-vs-ppf-which-investment-option-should-you-choose-and-why-2725126-2025-05-15",
      "headline": "FDs vs PPF: Which investment option should you choose and why?By investing in PPF, you can claim a tax exemption of up to Rs 1.5 lakh under Section 80C in a financial year, under the old tax regime. Moreover, the interest you earn from a PPF account is also tax-free. FDs, however, do not offer any tax deduction unless it's a 5-year tax-saving FD."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/i-dont-want-you-to-build-in-india-they-can-take-care-of-themselves-trump-told-apple-ceo-tim-cook-report-2725124-2025-05-15",
      "headline": "Don't want you building in India, Trump tells Apple CEO Tim CookTrump's remarks came just days after India threatened to impose retaliatory tariffs on the US. This was in response to the US raising duties on Indian steel and aluminium exports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/mutual-funds-load-up-on-it-cut-fmcg-and-telecom-stakes-in-april-report-2725083-2025-05-15",
      "headline": "Mutual funds load up on IT, cut FMCG and telecom stakes in April: ReportKotak Mahindra Bank attracted the highest MF investment in the financial sector, with Rs 1,586 crore. IDFC First Bank and HDFC Bank followed, drawing Rs 1,150 crore and Rs 1,026 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/tata-motors-share-price-rise-3-percent-why-reason-curvv-tiago-rashtrapati-bhavan-clsa-rating-2725044-2025-05-15",
      "headline": "Tata Motors shares rise 4% today. Here's whyThe rise in Tata Motors' share price comes even after the company reported a 51% fall in its consolidated net profit to Rs 8,470 crore for the quarter ending March 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/travel-sites-see-spike-in-turkey-azerbaijan-cancellations-over-pakistan-support-makemytrip-ixigo-report-major-cancellations-2725041-2025-05-15",
      "headline": "Travel sites see spike in Turkey, Azerbaijan cancellations over Pakistan supportBoycott calls grow as Turkey and Azerbaijan back Pakistan. Travel sites like MakeMyTrip and ixigo report major cancellations and suspended bookings to these destinations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/raymond-share-price-jumps-5-percent-as-technical-realty-demerger-confusion-fades-2724985-2025-05-15",
      "headline": "Raymond shares jump 5%. Why stock hit upper circuit today?At the Bombay Stock Exchange, Raymond shares were locked at Rs 578.70 in early trade, up 4.99%. The buying comes a day after the stock appeared to lose more than 60% of its value, a fall that was not driven by weak fundamentals or selling pressure but by a mechanical price adjustment."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/lollapalooza-2025-full-lineup-and-set-times-released-what-to-know-glbs-2725546-2025-05-16",
      "headline": "Lollapalooza 2025 full lineup and set times released: What to knowLollapalooza 2025 returns to Chicago's Grant Park July 31–August 3 with a diverse lineup, including Olivia Rodrigo, Twice, and A$AP Rocky. Full daily schedule and tickets now available online.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/chris-brown-arrested-in-uk-for-alleged-attack-at-london-club-glbs-2725544-2025-05-16",
      "headline": "Chris Brown arrested in UK for alleged attack at London clubSinger Chris Brown was arrested in Manchester over a 2023 London nightclub assault. He allegedly attacked music producer Abe Diaw. No formal charges yet; the case may affect his UK tour.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/human-remains-found-near-taylor-swifts-rhode-island-mansion-glbs-2725539-2025-05-16",
      "headline": "Human remains found near Taylor Swift's Rhode Island MansionA human leg bone was found near Taylor Swift's Rhode Island mansion, alarming locals and fueling serial killer fears amid similar cases across the Northeast. Police say no foul play is suspected.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/scarlett-johansson-reacts-to-oscars-snubbing-avengers-endgame-2725431-2025-05-15",
      "headline": "Scarlett Johansson reacts to Oscars snubbing 'impossible movie' Avengers EndgameActress Scarlett Johansson has reacted to MCU's Avengers: Endgame getting snubbed at Oscars 2020. She called the sci-fi action-thriller an 'impossible movie.' "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/chris-brown-arrested-over-2023-bottle-attack-in-london-nightclub-2725414-2025-05-15",
      "headline": "Chris Brown arrested over 2023 bottle attack in London nightclubSinger Chris Brown was arrested in Manchester on suspicion of assaulting music producer Abe Diaw with a tequila bottle at a London nightclub in 2023. The incident has sparked a police investigation and a $16 million civil lawsuit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/huma-qureshi-opens-up-on-ageism-gatekeeping-in-bollywood-2725415-2025-05-15",
      "headline": "Huma Qureshi opens up on ageism, gatekeeping in BollywoodActor Huma Qureshi was one of the other guest speakers at India Today's Indo-UAE Conclave, where she spoke about the changing landscape in cinema and how script-writing has evolved over the years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kalki-koechlin-says-bollywood-is-in-recession-phase-2725386-2025-05-15",
      "headline": "Everything is stalled: Kalki Koechlin says Bollywood is in recession phaseActor Kalki Koechlin has called out a recession in Bollywood, highlighting stalled projects, job losses, and a creative crisis. She stressed the need for the industry to adapt to changing audience habits and explore new formats like VR.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dd-next-level-makers-remove-song-lines-after-legal-controversy-2725385-2025-05-15",
      "headline": "DD Next Level makers remove song lines after legal controversyThe controversial lyrics from 'Kissa 47' in Santhanam's 'DD Next Level' have been removed following legal trouble.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/how-the-og-dhak-dhak-girl-madhuri-dixit-is-the-last-of-superstar-2725308-2025-05-15",
      "headline": "'Ek Do Teen' to being evergreen: Madhuri Dixit's legacy as legit Bollywood superstarMadhuri Dixit is one name that resonates with the hearts of many even today. With an ever-evolving Bollywood where fame is often fleeting and stardom gets redefined with every Friday release, Madhuri Dixit stands as a rare constant. On her 58th birthday today, read to find out how she is the last of superstar left. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/radhika-apte-sister-midnight-set-for-india-release-on-may-23-2725347-2025-05-15",
      "headline": "Radhika Apte's award-winning film Sister Midnight set for India releaseRadhika Apte's internationally acclaimed film, 'Sister Midnight, is set to release in India on May 23. Directed by Karan Kandhari, the film has been honoured at Cannes Film Festival, BAFTA and Fantastic Fest.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/robert-de-niro-answers-if-he-fears-death-at-81-at-cannes-2025-interview-says-dont-have-a-choice-2725332-2025-05-15",
      "headline": "Don't have a choice: Robert De Niro answers if he fears death at 81Actor Robert De Niro opened up on mortality at the ongoing Cannes International Film Festival 2025. When asked whether he is afraid of death, De Niro answered poetically, referring to the 'choices' and 'embracing life'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/mission-impossible-final-reckoning-x-review-king-tom-cruise-delivers-the-best-of-the-franchise-say-fans-2725310-2025-05-15",
      "headline": "Mission Impossible 8 X review: 'King' Tom Cruise owns franchise's bestTom Cruise aces the action sequences, and delivers probably the best of the 'Mission: Impossible' franchise as early reviews for 'Mission: Impossible-The Final Reckoning' kick in on social media. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kusha-kapila-schools-memer-for-mocking-her-cannes-appearance-2725289-2025-05-15",
      "headline": "Don't call me random: Kusha Kapila schools memer for mocking her Cannes appearanceKusha Kapila strongly responded to a viral meme that mocked her Cannes appearance, defending her presence and identity as a creator. She clarified misconceptions about influencer roles at the festival and asked for basic respect instead of online dismissal.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/shalini-passi-cannes-debut-indian-art-fashion-red-carpet-2725233-2025-05-15",
      "headline": "Cannes represents cinematic royalty: Shalini Passi on her red carpet debutArtist and philanthropist Shalini Passi is set to make her first appearance at the Cannes Film Festival. Her participation highlights the fusion of contemporary creativity and cultural expression on a prestigious international stage.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/bhool-chuk-maaf-to-screen-in-theatres-skipping-direct-ott-release-report-2725207-2025-05-15",
      "headline": "Bhool Chuk Maaf to screen in theatres, skipping direct OTT release: ReportRajkummar Rao and Wamiqa Gabbi's 'Bhool Chuk Maaf' will now release in theatres on May 23, 2025, after resolving a legal dispute with PVRInox over its initially planned direct OTT debut. The film will stream on Prime Video two weeks later, on June 6, as per a court directive.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rashmika-mandanna-gives-a-clap-for-vijay-deverakonda-brother-anand-deverakonda-new-film-2725222-2025-05-15",
      "headline": "Rashmika Mandanna gives a clap for Vijay Deverakonda's brother, Anand's new filmThe upcoming Anand Deverakonda–Vaishnavi Chaitanya-starrer was officially launched with a puja ceremony on May 15. Marking the reunion of the 'Baby' pair, the event was made special with Rashmika Mandanna giving the ceremonial first clap. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/special-ops-2-teaser-kay-kay-menon-fights-global-terrorism-in-new-spy-thriller-2725228-2025-05-15",
      "headline": "Special Ops 2 teaser: Kay Kay Menon fights global terrorism in new spy-thrillerThe makers of 'Special Ops 2' released a teaser of the show which is going to stream on JioHotstar. The series features Kay Kay Menon, Karan Tacker, Tahir Raj Bhasin and Prakash Raj, among others. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/karnataka-hc-stops-coercive-action-against-sonu-nigam-in-case-over-pahalgam-remark-during-bengaluru-concert-2725225-2025-05-15",
      "headline": "Court's relief to Sonu Nigam over controversial remarks at Bengaluru concertThe Karnataka High Court granted interim relief to singer Sonu Nigam in the case filed against him over his alleged remarks about Kannadigas during a concert in Bengaluru. The court ordered that no coercive action be taken against him, but told him to fully cooperate with the inquiry. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actor-ravi-mohan-admits-kenishaa-is-companion-in-4-page-note-against-wife-aarti-2725188-2025-05-15",
      "headline": "Actor Ravi Mohan admits Kenishaa is 'companion' in 4-page note against wife AartiTamil actor Ravi Mohan shared a long statement on social media after his estranged wife accused him of being an absentee father. He also referred to his rumoured partner, singer Kenishaa, as his 'beautiful companion' in the same post. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indian-government-official-on-trump-remarks-tim-cook-apple-production-shift-us-2725514-2025-05-15",
      "headline": "'Apple would be more concerned about...': Official on Trump's remarks to Tim CookTrump said he told Apple CEO Tim Cook that he was unhappy with Apple building iPhones in India. Following the remark made by Trump, a government official said that Apple would be more concerned about where they would find manufacturing competitiveness."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-pak-extend-ceasefire-understanding-as-two-nations-agree-to-continue-confidence-building-measures-2725432-2025-05-15",
      "headline": "India, Pak agree to continue reducing alert levels days after fighting pauseIndia and Pakistan have decided to extend the ceasefire understanding and reduce the alertness level."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/fugitive-nirav-modi-bail-plea-rejected-cbi-strong-opposition-uk-high-court-2725517-2025-05-15",
      "headline": "Nirav Modi's bail plea rejected again after CBI's strong opposition in UK courtThis is the tenth bail petition since his detention in the UK, which was successfully defended by the CBI through Crown Prosecution Service, London."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/two-nations-one-future-aroon-purie-at-india-todays-india-uae-conclave-2725028-2025-05-15",
      "headline": "Two nations, one future: Aroon Purie at India Today's Indo-UAE ConclaveIndia Today Group's Chairman and Editor-in-Chief Aroon Purie highlighted how India-UAE ties go beyond economics. While speaking at India Today's Indo-UAE conclave, he said the partnership between the two countries is time-tested, multi-dimensional, and future-ready."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-comical-ali-lt-gen-ahmed-sharif-chaudhry-dg-ispr-sent-drones-to-delhi-in-his-dreams-baghdad-bob-2725362-2025-05-15",
      "headline": "Pakistan's only gain from war with India — a Comical AliIf Baghdad had Comical Ali, Islamabad now has his spiritual successor — complete with Photoshop skills and phantom drones. Say hello to Pakistan's newest discovery: disinformation, delivered with a straight face by Lt Gen Ahmed Sharif Chaudhry."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ram-gopal-yadav-vyomika-singh-sofia-qureshi-samajwadi-party-operation-sindoor-bjp-2725518-2025-05-16",
      "headline": "Samajwadi leader's 'casteist' remark on Vyomika Singh sparks row. What he saidCiting a BJP Minister's remark against Colonel Sofiya Qureshi, Ramgopal Yadav said she was targeted for being a Muslim, and that the BJP spared Wing Commander Vyomika Singh assuming she was a Rajput."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/turkey-linked-firm-celebi-airport-services-security-clearance-revoked-by-india-after-countrys-support-to-pak-2725357-2025-05-15",
      "headline": "India revokes clearance of Turkey-linked aviation firm over national securityCelebi Aviation is responsible for critical high-security operations at nine major Indian airports, including Delhi, Mumbai, and Chennai. Its security clearance has now been revoked."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-pm-shehbaz-sharif-ready-to-talk-peace-with-india-operation-sindoor-army-2725519-2025-05-15",
      "headline": "Shehbaz Sharif 'ready to talk about peace' days after India, Pak pause fightDays after India and Pakistan agreed to put a pause to their cross-border military actions, Pakistan's PM Shehbaz Sharif said he is ready for peace talks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/nitanshi-goels-cannes-debut-is-a-love-letter-to-indian-cinema-rekha-sridevi-madhubala-2725334-2025-05-15",
      "headline": "Nitanshi Goel's Cannes debut is a love letter to Indian CinemaFor her red carpet appearance at Cannes, Nitanshi Goel paid tribute to legends in Indian cinema. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/an-architectural-trail-in-gujarat-2723608-2025-05-15",
      "headline": "An Architectural Trail in GujaratPress Release | Vadnagar has substantial remains of its ancient Buddhist heritage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/celebi-aviation-clearance-revoked-statement-turkey-india-pakistan-conflict-2725457-2025-05-15",
      "headline": "Erdogan's daughter not owner, we are not Turkish: Aviation firm on losing clearanceCelebi Aviation's security clearance was revoked by Indian authorities following tensions with Turkey after Operation Sindoor. The company has denied any political affiliations or Turkish ownership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/chained-even-missed-my-shadow-indian-researcher-shares-horror-in-us-immigration-detention-gaza-bada-khan-suri-2725417-2025-05-15",
      "headline": "My whole body was chained: Indian researcher on US immigration detention horrorBadar Khan Suri, an Indian academic and Georgetown visiting scholar, shared his horror about US immigration detention, saying his entire body was \"chained\" and he \"even missed his shadow\". Suri, a former Jamia Milia Islamia student, was released from ICE detention following a federal judge's order."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/mission-impossible-final-reckoning-x-review-king-tom-cruise-delivers-the-best-of-the-franchise-say-fans-2725310-2025-05-15",
      "headline": "Mission Impossible 8 X review: 'King' Tom Cruise owns franchise's bestTom Cruise aces the action sequences, and delivers probably the best of the 'Mission: Impossible' franchise as early reviews for 'Mission: Impossible-The Final Reckoning' kick in on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/fir-filed-for-gutter-remark-on-col-sofia-qureshi-why-vijay-shah-is-bjps-litmus-test-2725237-2025-05-15",
      "headline": "Why diatribe against Col. Sofia Qureshi makes Vijay Shah a litmus test for BJPHigh court not satisfied with the contents of police case against the Madhya Pradesh minister; Supreme Court rebukes him, denies urgent hearing of petition\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-test-retirement-ravi-shastri-conversation-surprise-england-tour-2725498-2025-05-15",
      "headline": "Ravi Shastri confirms Virat Kohli spoke to him before Test retirementFormer India head coach Ravi Shastri said he asked Virat Kohli a couple of questions when the former captain called to discuss his retirement from Test cricket. Kohli's responses, he said, made it clear that the 36-year-old was done with the longest format of the game."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-abcd-pakistan-needs-to-learn-asim-munir-terrorism-china-2725267-2025-05-15",
      "headline": "The ABCD of Operation Sindoor Pakistan needs to learn, and reciteIn the geopolitical lexicon, 'Operation Sindoor' will be emblazoned with the hues of India's pride, but it will also have a different meaning for Pakistan."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jammu-kashmir-tral-encounter-drone-footage-jaish-terrorists-hiding-army-2725155-2025-05-15",
      "headline": "Drone footage shows Jaish terrorists taking cover before being killed in J&KThe videos show the terrorists, cornered by the security forces, hiding in the basement of what seems like an under-construction building in Tral."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ballia-wife-kills-husband-ex-soldier-murder-up-police-body-chopped-lover-arrested-2725425-2025-05-15",
      "headline": "Ex-Army man killed, body chopped into 6 pieces by wife, lover in UP; 4 arrestedThe Uttar Pradesh police found the man's body parts at different locations, while his head is still missing. Four people, including his wife and her lover, have been arrested. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/telangana/story/video-telangana-women-washing-miss-world-contestants-feet-bjp-brs-against-cong-govt-2725393-2025-05-15",
      "headline": "Political storm in Telangana over women washing Miss World contestants' feetA video of Telangana women washing Miss World contestants' feet at temples has sparked political outrage. Opposition parties slammed the Congress-led state government, calling it humiliating and disrespectful to women's dignity and self-respect."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kangana-ranaut-tweet-trump-apple-manufacturing-deletes-post-jp-nadda-modi-2725409-2025-05-15",
      "headline": "Kangana Ranaut deletes Trump-bashing post, says JP Nadda asked her to do soKangana Ranaut, in a now-deleted post, speculated why Donald Trump may be uncomfortable with Apple's manufacturing plans in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-ai-is-personalising-skincare-like-never-before-2725254-2025-05-15",
      "headline": "How AI is personalising skincare like never beforeFrom individualised product recommendations to AI-driven skin analysis, the beauty and cosmetics industry is undergoing a huge transformation\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-rejects-donald-trump-zero-tariff-offer-s-jaishankar-us-trade-deal-2725263-2025-05-15",
      "headline": "Nothing decided: S Jaishankar after Trump's 'India's zero tariffs offer' claimCalling India's trade talks with the US complicated, S Jaishankar said that the deal has to be mutually beneficial and work for both countries. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/boycott-turkey-calls-india-turkiye-president-recep-tayyip-erdogan-unmoved-support-true-brother-pakistan-2725186-2025-05-15",
      "headline": "Erdogan unmoved by boycott-Turkey calls, backs true brother PakistanEven as Indians and businesses expressed outrage over Turkey's military support to Pakistan during its armed confrontation with India, Turkish President Erdogan doubled down on backing Islamabad. He assured Pakistani PM Sharif that Turkey would stand by Pakistan in good times and bad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mayank-yadav-injury-lsg-ruled-out-will-orourke-replacement-2725428-2025-05-15",
      "headline": "Mayank Yadav injured again, LSG sign replacement player from New ZealandIPL 2025: 22-year-old express fast bowler Mayank Yadav suffered another injury setback. The Lucknow Super Giants pacer has been ruled out of the remainder of the season, which will resume on Saturday, May 17. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/lollapalooza-2025-full-lineup-and-set-times-released-what-to-know-glbs-2725546-2025-05-16",
      "headline": "Lollapalooza 2025 full lineup and set times released: What to knowLollapalooza 2025 returns to Chicago's Grant Park July 31–August 3 with a diverse lineup, including Olivia Rodrigo, Twice, and A$AP Rocky. Full daily schedule and tickets now available online.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/chris-brown-arrested-in-uk-for-alleged-attack-at-london-club-glbs-2725544-2025-05-16",
      "headline": "Chris Brown arrested in UK for alleged attack at London clubSinger Chris Brown was arrested in Manchester over a 2023 London nightclub assault. He allegedly attacked music producer Abe Diaw. No formal charges yet; the case may affect his UK tour.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/human-remains-found-near-taylor-swifts-rhode-island-mansion-glbs-2725539-2025-05-16",
      "headline": "Human remains found near Taylor Swift's Rhode Island MansionA human leg bone was found near Taylor Swift's Rhode Island mansion, alarming locals and fueling serial killer fears amid similar cases across the Northeast. Police say no foul play is suspected.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/scarlett-johansson-reacts-to-oscars-snubbing-avengers-endgame-2725431-2025-05-15",
      "headline": "Scarlett Johansson reacts to Oscars snubbing 'impossible movie' Avengers EndgameActress Scarlett Johansson has reacted to MCU's Avengers: Endgame getting snubbed at Oscars 2020. She called the sci-fi action-thriller an 'impossible movie.' "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-argentina-probable-squad-2026-fifa-world-cup-qualifiers-2725509-2025-05-15",
      "headline": "Messi named in Argentina probable squad for 2026 FIFA World Cup qualifiersArgentina have named captain Lionel Messi in their probable squad for the 2026 FIFA World Cup qualifiers against Chile and Colombia, the national team announced on Thursday.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-test-retirement-ravi-shastri-conversation-surprise-england-tour-2725498-2025-05-15",
      "headline": "Ravi Shastri confirms Virat Kohli spoke to him before Test retirementFormer India head coach Ravi Shastri said he asked Virat Kohli a couple of questions when the former captain called to discuss his retirement from Test cricket. Kohli's responses, he said, made it clear that the 36-year-old was done with the longest format of the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-wants-to-adopt-olympic-sports-government-mulling-approval-to-oci-athletes-2725494-2025-05-15",
      "headline": "BCCI wants to adopt Olympic sports; Government mulling approval for OCI athletesThe Board of Control for Cricket in India (BCCI) is considering adopting two to three Olympic sports in a boost to the Sports Ministry's plan to establish specialised Olympic training centres."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/doha-diamond-league-2025-where-to-watch-neeraj-chopra-javelin-final-timings-2725460-2025-05-15",
      "headline": "Neeraj Chopra at Doha Diamond League: When and where to watch javelin eventDoha Diamond League 2025: Neeraj Chopra will look to continue his good run in a star-studded men's javelin field in Doha. India's Kishore Jena will also be in action on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/nick-kyrgios-to-return-to-french-open-after-eight-years-in-mens-doubles-2725458-2025-05-15",
      "headline": "Nick Kyrgios to return to French Open after eight years in men's doublesAustralian tennis star Nick Kyrgios will make his French Open comeback after eight years when he will partner his compatriot Jordan Thompson to participate in the men's doubles tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virat-kohli-joins-rcb-squad-for-remainder-of-season-in-bengaluru-2725433-2025-05-15",
      "headline": "Virat Kohli joins RCB squad for remainder of season in BengaluruStar Indian batter Virat Kohli has joined the Royal Challengers Bengaluru (RCB) camp for the remainder of the IPL 2025. This marks Kohli's return to competitive action for the first time since his Test retirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gujarat-titans-sign-kusal-mendis-to-replace-jos-buttler-for-playoffs-2725427-2025-05-15",
      "headline": "Gujarat Titans sign Kusal Mendis to replace Jos Buttler for playoffsEngland T20 stalwart Jos Buttler will leave for national duty after completing Gujarat Titans' final three league-stage matches, with Sri Lankan batter Kusal Mendis set to replace him for the playoff stage.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mayank-yadav-injury-lsg-ruled-out-will-orourke-replacement-2725428-2025-05-15",
      "headline": "Mayank Yadav injured again, LSG sign replacement player from New ZealandIPL 2025: 22-year-old express fast bowler Mayank Yadav suffered another injury setback. The Lucknow Super Giants pacer has been ruled out of the remainder of the season, which will resume on Saturday, May 17. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-south-africa-players-playoffs-wtc-final-west-indies-2725394-2025-05-15",
      "headline": "No WTC final-bound South Africans in playoffs, W'Indies boost for teams: ReportIPL 2025: The BCCI has informed franchises to release South African players selected for the World Test Championship final by 26 May. Gujarat Titans, Delhi Capitals, and Mumbai Indians are set to be heavily impacted by their absence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-women-squad-odi-t20i-series-vs-england-harmanpreet-shafali-mandhana-2725388-2025-05-15",
      "headline": "Shafali, Sneh make T20I comeback as India women name squad for England tourHarmanpreet Kaur will lead India's women's full-strength squads for the five T20Is and three ODI series in England, starting on June 28. Sneh Rana made her T20I comeback after two years, having last played during the T20 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-captain-ben-stokes-injury-comeback-all-rounder-tests-vs-india-2725380-2025-05-15",
      "headline": "Ben Stokes determined to excel as all-rounder in home Tests vs IndiaEngland's Test captain Ben Stokes is determined to excel as an all-rounder in his latest comeback from injury. England are set to host Zimbabwe in a one-off Test, followed by a five-match home series against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gujarat-titans-sign-kusal-mendis-to-replace-jos-buttler-for-playoffs-2725427-2025-05-15",
      "headline": "Gujarat Titans sign Kusal Mendis to replace Jos Buttler for playoffsEngland T20 stalwart Jos Buttler will leave for national duty after completing Gujarat Titans' final three league-stage matches, with Sri Lankan batter Kusal Mendis set to replace him for the playoff stage.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mayank-yadav-injury-lsg-ruled-out-will-orourke-replacement-2725428-2025-05-15",
      "headline": "Mayank Yadav injured again, LSG sign replacement player from New ZealandIPL 2025: 22-year-old express fast bowler Mayank Yadav suffered another injury setback. The Lucknow Super Giants pacer has been ruled out of the remainder of the season, which will resume on Saturday, May 17. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-south-africa-players-playoffs-wtc-final-west-indies-2725394-2025-05-15",
      "headline": "No WTC final-bound South Africans in playoffs, W'Indies boost for teams: ReportIPL 2025: The BCCI has informed franchises to release South African players selected for the World Test Championship final by 26 May. Gujarat Titans, Delhi Capitals, and Mumbai Indians are set to be heavily impacted by their absence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-women-squad-odi-t20i-series-vs-england-harmanpreet-shafali-mandhana-2725388-2025-05-15",
      "headline": "Shafali, Sneh make T20I comeback as India women name squad for England tourHarmanpreet Kaur will lead India's women's full-strength squads for the five T20Is and three ODI series in England, starting on June 28. Sneh Rana made her T20I comeback after two years, having last played during the T20 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-captain-ben-stokes-injury-comeback-all-rounder-tests-vs-india-2725380-2025-05-15",
      "headline": "Ben Stokes determined to excel as all-rounder in home Tests vs IndiaEngland's Test captain Ben Stokes is determined to excel as an all-rounder in his latest comeback from injury. England are set to host Zimbabwe in a one-off Test, followed by a five-match home series against India."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}