{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-deal-advances-with-focus-on-finalising-legal-agreement-2869135-2026-02-16",
      "headline": "India–US trade deal advances with focus on finalising legal agreementSpeaking on the development, Commerce Secretary Rajesh Agrawal said a joint statement outlining the contours of the agreement has already been signed. He said that these contours now need to be converted into a formal legal agreement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/record-msp-procurement-how-many-farmers-are-actually-benefiting-2869087-2026-02-16",
      "headline": "Record MSP procurement: How many farmers are actually benefiting?India's MSP system is clearly expanding, with higher spending, larger procurement and more beneficiaries than before. Yet the debate has shifted from scale to security."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/why-is-stock-market-rising-today-sensex-jump-500-points-nifty-rally-banking-financial-shares-up-2869003-2026-02-16",
      "headline": "Sensex rallies over 600 points: Why stock market rose today?The S&P BSE Sensex rallied 650.39 points to close at 83,277.15, while the NSE Nifty50 added 211.65 points to end at 25,682.75. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mutual-fund-cash-levels-equity-returns-market-volatility-kotak-flexicap-2868990-2026-02-16",
      "headline": "How cash levels in mutual funds impact returns during volatile marketsIn the current market, volatility caused by global and external factors has led some mutual funds to increase their cash positions. The idea is to lower risk and protect portfolios from sudden corrections. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/can-nps-help-you-save-tax-in-the-new-regime-what-salaried-employees-must-know-2868956-2026-02-16",
      "headline": "Can NPS help you save tax in the new regime? What salaried employees must knowFor salaried workers who have moved to the new tax regime, tax saving can feel limited. This has led many to question if there are still practical ways to ease their tax burden. Let's have a look."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/can-your-employer-refuse-gratuity-if-you-get-pension-heres-what-employees-must-know-2868916-2026-02-16",
      "headline": "Can your employer refuse gratuity if you get pension? Here's what employees must knowMany employees assume that receiving a pension from their employer means they may have to give up gratuity. But the law draws a clear distinction between the two. A recent court ruling has clarified what workers should know about their rights."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/mumbai-luxury-housing-market-2025-ultra-luxury-home-sales-rs-100-crore-record-2868915-2026-02-16",
      "headline": "Why Mumbai remains India's top luxury housing hubThe global recognition Mumbai is receiving today is best understood as validation rather than arrival. International research now ranks the city among the world's fastest-growing luxury housing markets, reflecting sustained price appreciation at the very top end."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/using-old-tax-regime-heres-how-draft-income-tax-rules-2026-could-help-you-save-more-2868888-2026-02-16",
      "headline": "Using old tax regime? Here's how draft income tax rules 2026 could help you save moreIf you are still using the old income tax regime, the government's draft rules for 2026 may bring some welcome relief. Proposed changes to key exemptions and allowances could slightly lower your tax bill and make the traditional regime more rewarding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/rbi-lending-norms-hit-bse-groww-angel-one-stocks-fall-derivatives-proprietary-trading-2868879-2026-02-16",
      "headline": "RBI move hits Dalal Street stocks: BSE, Groww fall up to 10%. Here's whyThe selling pressure came after the RBI issued a revised circular on February 13 under its amended RBI (Commercial Banks – Credit Facilities) Directions. The new rules change how banks can lend to entities involved in the capital markets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-open-lower-as-market-sentiment-remain-cautious-over-it-selloff-2868813-2026-02-16",
      "headline": "Sensex, Nifty open lower as market sentiment remain cautious over IT selloffThe S&P BSE Sensex was down by 47.79 points to 82,578.97, while the NSE Nifty50 lost 7.45 points to 25,464.75 as of 9:48 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/health-insurance-claim-denied-star-health-rs-50000-premium-agent-remark-you-didnt-ask-us-viral-post-2868799-2026-02-16",
      "headline": "Man paid Rs 50,000 a year premium, insurance claim denied when mother fell illThe man said he had been paying around Rs 50,000 every year for his mother's policy and when she needed treatment, he went to the Lucknow office of Star Health and Allied Insurance, where he alleged he was made to wait for hours. His claim was denied. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/prime-minister-narendra-modi-interview-budget-2026-populism-capital-outlays-power-growth-jobs-2868679-2026-02-15",
      "headline": "Budget without populism and with capital outlays powers growth, jobs: PMDescribing the Budget for the fiscal year starting April 1 as reflective of his governance approach, PM Modi said the document is a good reflection of our governance style and priorities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/have-rs-5000-here-why-an-emergency-fund-should-come-before-your-sip-2867953-2026-02-15",
      "headline": "Have Rs 5,000? Here's why an emergency fund should come before your SIPYou've heard the advice, i.e., \"Start a SIP immediately.\" But is that the smartest first move with Rs 5,000? The choice might surprise you."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/artificial-intelligence-ai-stocks-mutual-fund-investments-investor-portfolio-impact-2868166-2026-02-14",
      "headline": "Will AI change how you invest your money in stocks and mutual funds?The next market shift may not come from earnings or interest rates. It may come from AI. In this article, we explore how it could reshape your stock and mutual fund investments."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/eroded-public-trust-dgca-fines-air-india-rs-1-crore-for-flying-airbus-8-times-without-airworthiness-permit-2867894-2026-02-13",
      "headline": "Air India fined Rs 1 crore for flying Airbus 8 times without airworthiness permitThe DGCA has imposed a fine of about Rs 1 crore on Air India for flying an Airbus aircraft eight times without a valid airworthiness permit. The aviation watchdog also said the lapse further eroded public trust in the airline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-personalised-loans-are-becoming-the-go-to-option-in-2026-2867857-2026-02-13",
      "headline": "Why personalised loans are becoming the go-to option in 2026The journey of hyper-personalisation in personal loans is going to get more exciting for customers with the increasing adoption of technology refining customer offerings, based on minute details of the customers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-plans-to-update-kisan-credit-card-rules-5-key-changes-to-track-2867809-2026-02-13",
      "headline": "RBI plans to update Kisan Credit Card rules : 5 key changes to trackThe Reserve Bank of India is preparing to overhaul the Kisan Credit Card scheme, and the proposed changes could reshape how farmers borrow and repay loans. With the new draft rules on the table, what exactly is set to change for farm credit?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-1048-points-lower-nifty-below-2550-it-metal-stocks-sink-2867763-2026-02-13",
      "headline": "Sensex crashes over 1,000 points: What's behind today's market bloodbath?The market opened on a weak note and remained under pressure throughout the session, with losses deepening in the second half. The decline appeared to be driven by profit booking at elevated levels and a cautious mood among investors amid global uncertainties."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/reliance-us-licence-venezuela-oil-trump-trade-deal-india-russia-2867738-2026-02-13",
      "headline": "Reliance wins US licence for Venezuelan oil as India wavers on Russia supplyReliance applied for the licence in early January as India looks to diversify its energy purchases. Direct purchase of Venezuelan oil will help Reliance replace Russian oil in a cost-effective way."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/cheque-bounced-how-one-mistake-can-spiral-into-legal-and-financial-trouble-2867714-2026-02-13",
      "headline": "Cheque bounced? How one mistake can spiral into legal and financial troubleA bounced cheque may seem like a minor slip, but it can quickly trigger penalties, credit damage and even legal complications. What starts as a simple payment error can snowball into a serious financial setback. Are you aware of the risks?"
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-meera-jasmine-reunite-l-366-cop-drama-tharun-moorthy-2869148-2026-02-16",
      "headline": "Meera Jasmine joins Mohanlal in L 366, character poster unveiled Mohanlal and Meera Jasmine reunite on screen in the upcoming film L 366. The movie marks Mohanlal's return as a cop and strengthens his collaboration with director Tharun Moorthy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rajkummar-rao-physical-transformation-nikam-biopic-authentic-storytelling-2869154-2026-02-16",
      "headline": "Rajkummar Rao reacts to fan's plea to avoid propaganda films Rajkummar Rao recently reacted to a fan's polite request who asked him to avoid making propaganda films. The actor's reply has won many hearts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jailer-2-release-date-rajinikanth-august-shooting-complete-2869107-2026-02-16",
      "headline": "Jailer 2 release date likely postponed to August after Rajinikanth wraps shooting Rajinikanth has completed his portions for Jailer 2, with the film's release now expected in August. The potential date shift could place the film in a competitive release window against other major titles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/raveena-tandon-akshay-kumar-reunite-welcome-to-the-jungle-1990s-relationship-rumours-2869133-2026-02-16",
      "headline": "Today, Akshay and I are friends, Shilpa and I are friends: Raveena Tandon Actor Raveena Tandon opened up about her past with Akshay Kumar and Shilpa Shetty, revealing how time has reshaped old headlines into mature friendships.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/soodhu-kavvum-vijay-sethupathi-re-release-tamil-film-february-20-2869134-2026-02-16",
      "headline": "Vijay Sethupathi's Soodhu Kavvum to re-release in theatres February 20 Vijay Sethupathi's cult Tamil film Soodhu Kavvum is set to re-release on February 20. The move revives interest in the black comedy as fans await its return at an affordable ticket price."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/pankaj-tripathi-theatre-comeback-la-ilaaj-musical-daughter-aashi-tripathi-nsd-delhi-2869128-2026-02-16",
      "headline": "Pankaj Tripathi shares stage with daughter in La Ilaaj at NSD's Bharat Rang Mahotsav After 12 years, Pankaj Tripathi returns to theatre with the musical La Ilaaj sharing stage with his daughter Aashi. The play's live music and themes of love highlight his deep connection to theatre and hopes to inspire new audiences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/yash-toxic-dhurandhar-2-clash-eid-2026-box-office-release-date-2869072-2026-02-16",
      "headline": "Yash upset over Toxic-Dhurandhar 2 clash, stands firm on March 19 release date Yash is firm on releasing Toxic on March 19 despite a clash with Dhurandhar 2. Yash is reportedly upset over the lack of courtesy from the Dhurandhar team regarding the release date conflict.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/rahul-bhat-anurag-kashyap-collaborate-kennedy-2869050-2026-02-16",
      "headline": "Rahul Bhat on working with Anurag Kashyap in Kennedy: Never been his first choice Actor Rahul Bhat opened up about reuniting with Anurag Kashyap for Kennedy, revealing why this collaboration felt inevitable from the start."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/kanye-west-first-concert-india-jawaharlal-nehru-stadium-new-delhi-2869053-2026-02-16",
      "headline": "Kanye West announces first India concert, to perform in Delhi. Check ticket details Kanye West, also known as Ye, has announced his debut performance in India. The rapper's India concert is set to take place in New Delhi on March 29."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-rashmika-mandanna-wedding-udaipur-ceremony-hyderabad-reception-and-all-we-know-2869045-2026-02-16",
      "headline": "Vijay-Rashmika wedding: Udaipur ceremony, Hyderabad reception and all we know Actors Vijay and Rashmika are all set to get married in an intimate Udaipur ceremony followed by a grand reception in Hyderabad. The wedding blends Telugu and Coorgi customs and has attracted wide attention from fans and film industry insiders alike."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/shanaya-kapoor-adarsh-gourav-tu-yaa-main-camaraderie-newcomer-experience-2869030-2026-02-16",
      "headline": "Shanaya Kapoor on working with Adarsh Gourav: He didn't treat me like a newcomer Shanaya Kapoor opened up about her experience working with Adarsh Gourav on Tu Yaa Main. Their organic camaraderie helped her feel comfortable despite being a newcomer in the film industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/suriyas-karuppu-set-for-release-after-tamil-nadu-elections-confirms-director-2868949-2026-02-16",
      "headline": "Suriya's Karuppu set for release after Tamil Nadu elections, confirms director Suriya's much-awaited film Karuppu is set to release after the state assembly elections. The makers aim to give a family-friendly entertainer without creating undue hype."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kangana-ranaut-roots-for-sara-arjun-after-her-breakout-dhurandhar-role-2869021-2026-02-16",
      "headline": "Do well kid: Kangana Ranaut roots for Sara Arjun after her breakout Dhurandhar role Actor Kangana Ranaut recently praised Sara Arjun for her performance in Aditya Dhar's Dhurandhar, calling her authentic and rooted. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/mahatma-gandhi-biopic-manoj-bajpayee-sudhir-mishra-kolkata-production-2869022-2026-02-16",
      "headline": "Manoj Bajpayee to play Gandhi in Sudhir Mishra film, shoot in September Filmmaker Sudhir Mishra confirmed Manoj Bajpayee will play Mahatma Gandhi in his upcoming film. Here's what we know so far about the project, its timeline, and what to expect.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/salman-khan-praises-rakkasapuradhol-trailer-awaits-hindi-version-2868960-2026-02-16",
      "headline": "Salman Khan reacts to Raj B Shetty's Rakkasapuradhol trailer, praises team Bollywood actor Salman Khan praised the recent Kannada film Rakkasapuradhol after watching its trailer. The film starring Raj B Shetty released in theatres across Karnataka on February 6 to positive reviews. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ganesh-announces-new-family-drama-film-with-director-ramenahalli-jagannatha-20th-kannada-film-anniversary-2868895-2026-02-16",
      "headline": "Ganesh announces Tamma Sukhagamana Bayasuva, marks 20 years in Kannada cinema Kannada actor Ganesh and director Ramenahalli Jagannatha officially announced their first collaboration on a new film, unveiled during Maha Shivaratri, celebrating the actor's two decades in Kannada cinema.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rashmika-mandanna-vijay-deverakonda-to-get-married-on-february-26-2869002-2026-02-16",
      "headline": "Rashmika Mandanna, Vijay Deverakonda to marry on Feb 26, reception invite surfaces Rashmika Mandanna and Vijay Deverakona's wedding reception invite has been circulated in the media. The couple is getting married in February, with a reception planned in March."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/deposit-rs-15-crore-by-3-pm-will-grant-interim-bail-delhi-high-court-to-actor-rajpal-yadav-2868978-2026-02-16",
      "headline": "Rajpal Yadav gets interim bail after depositing Rs 1.5 crore in cheque bounce case The Delhi High Court on Monday granted Bollywood actor Rajpal Yadav interim bail after he deposited Rs 1.5 crore in the ongoing cheque bounce case. The bail will allow him to attend his niece's wedding on February 19."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kk-senthil-kumar-on-dos-and-donts-with-south-stars-and-swayambhu-release-2868936-2026-02-16",
      "headline": "Are there dos and don'ts to meet South stars? Cinematographer Senthil Kumar answers Cinematographer KK Senthil Kumar dispels rumours about rules before meeting the South stars. He emphasises respect for technicians and promotes his upcoming film Swayambhu."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/maybe-we-are-old-fashioned-supreme-court-questions-sex-before-marriage-2869152-2026-02-16",
      "headline": "How can they have physical relations before marriage? Supreme Court's cautionThe Supreme Court emphasised caution in pre-marital physical relationships while hearing a bail plea in a case involving alleged rape on false promise of marriage. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/south/story/statement-made-by-mistake-tamil-nadu-bjp-chief-nainar-nagendran-expresses-regret-for-crass-remark-on-trisha-2869020-2026-02-16",
      "headline": "Statement made by mistake: Tamil Nadu BJP chief apologises for remark on TrishaThe apology comes a day after Tamil Nadu BJP chief Nainar Nagendran triggered a political row by suggesting that Vijay should \"come out of Trisha's house\" to gain experience and succeed in politics. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bill-gates-andhra-pradesh-meeting-n-chandrababu-naidu-amaravati-nara-lokesh-microsoft-ai-technology-2869090-2026-02-16",
      "headline": "Backlash over Bill Gates's Andhra Pradesh reception amid Epstein Files furyMicrosoft co-founder Bill Gates reached Andhra Pradesh as part of his India trip and was welcomed by state minister Nara Lokesh. The reception came in for criticism online because of messages linking Gates to convicted paedophile Jeffrey Epstein. Gates denied all links."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/if-ai-writes-100-per-cent-code-at-anthropic-what-will-engineers-do-claude-code-chief-responds-2868901-2026-02-16",
      "headline": "If Claude writes all code, what will engineers do? Anthropic respondsAnthropic says nearly 100 per cent of its code is now generated by AI, so what are software engineers doing? According to Boris Cherny, head of Claude Code, while AI is handling most of the coding, humans have taken on new responsibilities, including guiding the systems, reviewing outputs and deciding what should be built next."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-marco-rubio-munich-speech-global-south-competition-trade-colonialism-threat-europe-2868876-2026-02-16",
      "headline": "A new East India Company rising? Rubio's speech signals US colonial aspirationAt the Munich Security Conference, US Secretary of State Marco Rubio called on the West to compete for \"market share in the economies of the Global South\" as part of building a \"new Western century\". Critics point to the coloniser tone in Rubio's speech and ask countries like India to criticise it."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/death-penalty-for-three-in-2025-rape-murder-of-foreign-tourists-in-hampi-2869129-2026-02-16",
      "headline": "3 get death penalty for gang-raping Israeli tourist, killing male tourist in HampiAn Israeli tourist and a Hampi homestay owner were raped, and another tourist from Odisha was killed by three men in Hampi last year. All three accused have been given the death penalty in the case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/health-insurance-claim-denied-star-health-rs-50000-premium-agent-remark-you-didnt-ask-us-viral-post-2868799-2026-02-16",
      "headline": "Man paid Rs 50,000 a year premium, insurance claim denied when mother fell illThe man said he had been paying around Rs 50,000 every year for his mother's policy and when she needed treatment, he went to the Lucknow office of Star Health and Allied Insurance, where he alleged he was made to wait for hours. His claim was denied. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/im-not-a-rahulian-mani-shankar-aiyar-stirs-congress-pot-amid-row-2869035-2026-02-16",
      "headline": "I'm not a Rahulian: Mani Shankar Aiyar stirs Congress pot amid rowSenior Congress leader Mani Shankar Aiyar stirs controversy by distancing himself from Rahul Gandhi while predicting a third term for Kerala CM Pinarayi Vijayan.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rashmika-mandanna-vijay-deverakonda-to-get-married-on-february-26-2869002-2026-02-16",
      "headline": "Rashmika Mandanna, Vijay Deverakonda to marry on Feb 26, reception invite surfacesRashmika Mandanna and Vijay Deverakona's wedding reception invite has been circulated in the media. The couple is getting married in February, with a reception planned in March."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/china-expanding-nuclear-weapons-footprint-warhead-facility-sichuan-new-york-times-nyt-report-beijing-washington-relations-2869032-2026-02-16",
      "headline": "China secretly expanding nuclear arsenal just 800 km from ArunachalChina is expanding its nuclear arsenal in Zitong and Pingtong facilities, with the country's stockpile projected to exceed 1,000 warheads by 2030, reports The New York Times. The secretive upgrades are at mountain facilities in Sichuan province, which is barely 800 km from Arunachal Pradesh."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/australia-news-bondi-beach-shooter-naveed-akram-court-appearance-says-yeah-yep-2868867-2026-02-16",
      "headline": "Bondi Beach shooter Naveed Akram appears in court, says just two wordsNaveed Akram, the surviving Bondi Beach terrorist, appeared before a court for the first time. Naveed and his father Sajid Akram, who had decades ago migrated from Hyderabad, shot dead 15 people on December 14, which was one of Australia's deadliest terror attacks. In court, Naveed said just two words."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/salary-disparity-india-companies-pay-new-hires-more-than-loyal-employees-2868834-2026-02-16",
      "headline": "Why staying too long in one company may be costing employeesCompanies across India are paying new hires significantly higher salaries than existing employees. This growing pay gap challenges traditional loyalty and pushes professionals to reconsider their career strategies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-asked-teammates-not-to-sledge-pakistan-batters-india-vs-pakistan-2868941-2026-02-16",
      "headline": "Suryakumar Yadav asked teammates not to sledge Pakistan, BCCI releases BTS videoIndia captain Suryakumar Yadav instructed his team to avoid sledging during their T20 World Cup clash with Pakistan. The disciplined approach helped India secure a commanding 61-run victory and qualify for the Super 8 stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/jee-main-result-2026-declared-at-jeemainntanicin-check-direct-link-toppers-here-2867220-2026-02-16",
      "headline": "JEE Main Result 2026 declared. Check direct linkJEE Main Result 2026 of session 1 has been declared today by the NTA. Out of 13,50,969 registered candidates, 13,00,368 appeared across 10 shifts. Check direct link, scorecard steps, percentile, cut-off, toppers and next steps."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-pak-t20-world-cup-shoaib-akhtar-rants-live-tv-mohsin-naqvi-pcb-india-defeat-colombo-2868757-2026-02-16",
      "headline": "Incompetent, ignorant: Akhtar tears into PCB chief after India hammers PakIND vs PAK, T20 World Cup: Shoaib Akhtar launched a scathing attack on PCB chairman Mohsin Naqvi and senior players after Pakistan's 61-run loss to India, calling incompetent leadership \"the biggest crime in the world.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/uk-man-caught-on-camera-smashing-kiosks-with-metal-rod-at-hong-kong-airport-2869100-2026-02-16",
      "headline": "UK man caught on camera smashing kiosks with metal rod at Hong Kong airportA UK man was taken into custody on Monday after damaging self-service check-in kiosks and other equipment at Hong Kong International Airport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/abandoned-by-mom-punch-monkeys-love-for-his-plush-toy-reveals-psychology-of-attachment-2868971-2026-02-16",
      "headline": "Abandoned by mum: Monkey winning hearts online hides wounds of traumaAbandoned by his mother at birth, and after being cared for by people during early development, Punch was moved to a zoo to live with other macaques. But the transition was not easy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/kerala/story/kerala-youngest-organ-donor-aalin-sherin-abraham-honoured-funeral-2868779-2026-02-16",
      "headline": "Mohanlal, Kamal Haasan salute parents of Aalin, Kerala's youngest organ donorAalin's parents decided to donate her organs -- including her liver, kidneys, heart valve and corneas -- which were successfully transplanted, helping save the lives of five children across multiple hospitals."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/deadly-bhubaneswar-rooftop-blast-caught-on-camera-2-die-during-treatment-2868804-2026-02-16",
      "headline": "Deadly Bhubaneswar rooftop blast caught on camera, 2 die during treatmentInvestigators believe the explosion occurred while explosive materials were being handled on the rooftop. Gunpowder was recovered from the site, strengthening suspicions that crude bombs were being assembled there."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/deposit-rs-15-crore-by-3-pm-will-grant-interim-bail-delhi-high-court-to-actor-rajpal-yadav-2868978-2026-02-16",
      "headline": "Rajpal Yadav gets interim bail after depositing Rs 1.5 crore in cheque bounce caseThe Delhi High Court on Monday granted Bollywood actor Rajpal Yadav interim bail after he deposited Rs 1.5 crore in the ongoing cheque bounce case. The bail will allow him to attend his niece's wedding on February 19."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/in-2026-india-is-mysore-silk-saree-the-birkin-people-queue-up-for-at-4-am-2868794-2026-02-16",
      "headline": "In 2026 India, is Mysore silk saree the Birkin people queue up for at 4 am?Handcrafted ByOur Editors If you're someone who keeps track of viral videos, you would, by no means, have missed the clip of women queuing outside a store in Bengaluru at 4 am for a Mysore silk saree. But what's causing the demand? Has it gained a Birkin-like status among Indians?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ai-impact-summit-kicks-off-in-delhi-today-with-pm-modi-address-future-skills-in-focus-2868774-2026-02-16",
      "headline": "PM to open India's AI jamboree today, tech titans to attend - Your cheat sheetDay 1 will include a leadership session on leveraging AI for the future of learning and work, examining its impact on global employment and skills. Another session will explore how artificial intelligence can transform India's judicial system by improving efficiency, transparency, and accessibility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/missed-one-cbse-board-exam-heres-what-happens-next-2869088-2026-02-16",
      "headline": "CBSE clarifies: First board exam mandatory; miss 3 papers and it's 'essential repeat'CBSE said that Class 10 students must appear in the first board exam clarifying the two-exam rule starting 2026. It also said that those missing three or more subjects will be placed in an 'essential repeat' category. But what happens to those who only miss one exam? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/big-jolt-to-congress-in-poll-bound-assam-former-state-chief-bhupen-borah-resigns-2868902-2026-02-16",
      "headline": "Ex-Assam Congress chief Bhupen Borah withdraws resignation hours after quitting partyEarlier in the day, Bhupen Kumar Borah had sent his resignation letter to Congress president Mallikarjun Kharge, reportedly citing that he was being \"ignored\" by the party leadership and not given his due within the state unit."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-pak-t20-world-cup-babar-azam-shaheen-afridi-dropped-pakistan-mike-hesson-mohsin-naqvi-2869145-2026-02-16",
      "headline": "Babar Azam, Shaheen Afridi faces axe after humiliating defeat against India: Report IND vs PAK, T20 World Cup: It seems like the Pakistan management has had enough of Babar Azam and Shaheen Afridi following their poor displays against India with the management reportedly set to drop the star duo in their upcoming game against Namibia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rashid-khan-completes-700-t20-wickets-milestone-afghanistan-icc-t20-world-cup-2869034-2026-02-16",
      "headline": "Rashid Khan scripts history, becomes first bowler to take 700 T20 wickets Afghanistan captain Rashid Khan became the first cricketer to claim 700 wickets in T20 cricket. His record-breaking feat helped Afghanistan secure a five-wicket win over UAE in the ICC T20 World Cup 2026 group stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-t20-world-cup-abhishek-sharma-will-bounce-back-harbhajan-singh-duck-colombo-2869011-2026-02-16",
      "headline": "Abhishek Sharma will bounce back: Harbhajan backs batter after duck vs PAK T20 World Cup: Harbhajan Singh backed Abhishek Sharma to bounce back after two ducks in the T20 World Cup, including a four-ball duck vs Pakistan. The former spinner said Abhishek will deliver when India need him most."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afg-vs-uae-t20-world-cup-2026-azmatullah-omarzai-afghanistan-super-8-hopes-2869007-2026-02-16",
      "headline": "All-round Azmat helps Afghanistan beat UAE, remain in Super 8s race T20 World Cup: Azmatullah Omarzai's all-round brilliance has powered Afghanistan to a five-wicket win over UAE in New Delhi to remain in the race to reach the Super 8 stage of the T20 World Cup 2026. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/amelia-kerr-appointed-new-zealand-womens-cricket-captain-zimbabwe-series-2868965-2026-02-16",
      "headline": "New Zealand women start new era as Amelia Kerr appointed as all-format captain The New Zealand women's team will usher in a new era as Amelia Kerr has been appointed as the new all-format captain of the side on Monday, February 16. Kerr takes over from Sophie Devine as the new skipper of the White Ferns. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-asked-teammates-not-to-sledge-pakistan-batters-india-vs-pakistan-2868941-2026-02-16",
      "headline": "Suryakumar Yadav asked teammates not to sledge Pakistan, BCCI releases BTS video India captain Suryakumar Yadav instructed his team to avoid sledging during their T20 World Cup clash with Pakistan. The disciplined approach helped India secure a commanding 61-run victory and qualify for the Super 8 stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-rivalry-icc-tournaments-oversaturation-t20-world-cup-2026-2868946-2026-02-16",
      "headline": "Death of a rivalry: Has India vs Pakistan lost its magic due to overexposure? T20 World Cup: Cricket's greatest rivalry has become its most overplayed fixture. The guaranteed group-stage meetings are killing the magic, stifling emerging teams, and turning spectacle into monotony."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/devdutt-padikkal-double-century-maiden-ranji-trophy-karnataka-vs-uttarakhand-semi-final-lucknow-2868926-2026-02-16",
      "headline": "Devdutt Padikkal puts selectors on alert with maiden double ton vs Uttarakhand Devdutt Padikkal put India selectors on alert with his maiden first-class double century in the Ranji Trophy semi-final against Uttarakhand. The Karnataka captain's 232-run knock strengthened his case for a Test recall."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/steve-smith-replaces-josh-hazlewood-australia-t20-world-cup-2026-2868914-2026-02-16",
      "headline": "Steve Smith replaces Josh Hazlewood in Australia squad ahead of Sri Lanka clash Steve Smith has been named as a replacement for injured Josh Hazlewood in the Australia squad for the T20 World Cup 2026. His inclusion will strengthen Australia's batting as they prepare to face Sri Lanka in a crucial fixture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indias-record-61-run-win-pakistan-t20-world-cup-mohsin-naqvi-early-exit-2868852-2026-02-16",
      "headline": "Unable to digest defeat, Mohsin Naqvi leaves stadium midway through chaseAs Pakistan's middle-order collapsed against India in Colombo, Mohsin Naqvi decided to leave the stadium mid-way through the chase. India dominated Pakistan to secure a thumping 61-run win on Sunday, February 15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-t20-world-cup-danish-kaneria-boycott-better-live-screening-colombo-defeat-2868853-2026-02-16",
      "headline": "Ex-Pakistan spinner mocks IND vs PAK Colombo rout: Boycott was betterT20 World Cup: Ex-Pakistan spinner Danish Kaneria mocked Pakistan's humiliating 61-run loss to India in Colombo. Kaneria suggested a boycott would have been less embarrassing as Pakistan's Super 8 hopes now hang by a thread."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-vs-uae-t20-world-cup-live-score-today-match-updates-new-delhi-2868831-2026-02-16",
      "headline": "AFG vs UAE Highlights: Afghanistan beat UAE by 5 wickets to stay in Super 8s raceAfghanistan (AFG) vs UAE (UAE), T20 World Cup Highlights: Afghanistan have kept their Super 8s dreams alive by beating UAE by 5 wickets in what turned out to be a thriller in New Delhi. Azmatullah Omarzai's all-round brilliance has given Afghanistan a glimmer of hope."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-t20-world-cup-ishan-kishan-colombo-like-virat-kohli-mcg-knock-2868818-2026-02-16",
      "headline": "Like Kohli in Melbourne, Ishan Kishan finds cricket's loneliest place in ColomboT20 World Cup 2026: In Colombo against Pakistan, Ishan Kishan found cricket's loneliest place, the same space Virat Kohli once inhabited in Melbourne, but reached it through dominance rather than endurance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-t20-world-cup-kris-srikkanth-colombo-2868814-2026-02-16",
      "headline": "India's C team will thrash Pakistan: Srikkanth calls for end of greatest rivalry hypeT20 World Cup: After Pakistan's surrender to India during the T20 World Cup 2026, Kris Srikkanth said that the Indian C team is enough to beat the arch-rivals. Srikkanth heavily criticised the Pakistan batting after the heavy defeat in Colombo. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-t20-world-cup-lost-early-as-toss-colombo-shaheen-afridi-2868798-2026-02-16",
      "headline": "A new low: When Pakistan lost to India as early as toss. Over and out.T20 World Cup, IND vs PAK: Pakistan had little go their way after choosing to bowl first in Colombo, where teams batting second have struggled throughout the tournament. Their decision backfired as Pakistan slumped to a 61-run defeat on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-babar-azam-virat-kohli-irfan-pathan-t20-world-cup-2026-2868791-2026-02-16",
      "headline": "Has Babar Azam ever played a Kohli-esque knock? Irfan Pathan slams PAK batterT20 World Cup: Former India all-rounder Irfan Pathan has slammed Babar Azam after another flopshow against India, asking if he has ever played a knock like Virat Kohli in a pressure game. Babar was dismissed for five runs in Colombo. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-shahid-afridi-rant-drop-babar-azam-shaheen-afridi-t20-world-cup-colombo-2868781-2026-02-16",
      "headline": "Drop Babar, Shaheen, Shadab: Afridi goes on all-out rant after IND vs PAK lossT20 World Cup: Shahid Afridi has urged Pakistan to bench Babar Azam, Shaheen Afridi and Shadab Khan after another heavy loss to India in Colombo. He wants youngsters trusted for the remaining T20 World Cup matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-abhishek-sharma-poor-form-ravi-shastri-t20-world-cup-2026-2868778-2026-02-16",
      "headline": "Abhishek Sharma gets key advice from Shastri on form revival after PAK failureT20 World Cup: Abhishek Sharma was given key advice on how to turn his form around as his recent slump in form continued during the India vs Pakistan game on Sunday, February 15. Abhishek was dismissed for a duck during the match in Colombo. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-rohit-sharma-wasim-akram-hug-t20-world-cup-watch-video-colombo-2868773-2026-02-16",
      "headline": "Watch: Rohit Sharma hugs Pakistan legend Wasim Akram in ColomboT20 World Cup: Former India captain Rohit Sharma shared a warm hug with Pakistan legend Wasim Akram during the pre-match ceremony in Colombo. The moment went viral ahead of India's dominant 61-run win over Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-pak-t20-world-cup-shoaib-akhtar-rants-live-tv-mohsin-naqvi-pcb-india-defeat-colombo-2868757-2026-02-16",
      "headline": "Incompetent, ignorant: Akhtar tears into PCB chief after India hammers PakIND vs PAK, T20 World Cup: Shoaib Akhtar launched a scathing attack on PCB chairman Mohsin Naqvi and senior players after Pakistan's 61-run loss to India, calling incompetent leadership \"the biggest crime in the world.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/axar-patel-on-india-vs-pakistan-rivalry-t20-world-cup-colombo-win-2868755-2026-02-16",
      "headline": "Do Pakistan deserve arch-rivals tag? Axar rubs salt into wounds after Colombo winT20 World Cup, India vs Pakistan: Star Indian all-rounder Axar Patel added to Pakistan's misery after the comprehensive 61-run win over the Salman Ali Agha-led side, playing down the hype around the rivalry between the two teams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-afghanistan-uae-england-italy-australia-sri-lanka-super-8-battle-preview-2868597-2026-02-16",
      "headline": "Matchday Preview: Struggling Australia look to breathe life into their campaignT20 World Cup: Day 10 of the tournament features crucial clashes in Delhi, Kolkata and Pallekele as Afghanistan face UAE, England meet Italy and Australia take on Sri Lanka in matches that could shape the Super 8 race."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ind-vs-pak-t20-world-cup-axar-patel-team-man-press-conference-colombo-2868756-2026-02-16",
      "headline": "IND vs PAK: Axar Patel focused on being a team man, not stressed about changing rolesHere is the full transcript of India all-rounder Axar Patel's press conference after their 61-run loss to India in the Group A clash in the ICC Men's T20 World Cup in Colombo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/t20-world-cup-india-vs-pakistan-sunil-gavaskar-reaction-colombo-2868754-2026-02-16",
      "headline": "Pakistan no match for India in skill and temperament: Sunil GavaskarT20 World Cup 2026: Speaking to India Today after India's 61-run victory in Colombo, legendary Sunil Gavaskar highlighted the gulf in skill and temperament between the two sides. He also heaped praise on Ishan Kishan for his superb 77 off 40 balls, noting that the innings effectively took the game away from Pakistan on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-pakistan-t20-world-cup-pak-coach-mike-hesson-post-match-press-conference-2868752-2026-02-16",
      "headline": "Fearless Ishan Kishan took the game away from Pakistan: Pak coach Mike HessonIndia vs Pakistan, ICC T20 World Cup: Pakistan head coach Mike Hesson said it was Ishan Kishan's counter-attacking knock, rather than the top-order collapse, that proved to be the difference between the two sides in Pakistan's 61-run defeat to India in Colombo.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-fan-breaks-tv-t20-world-cup-loss-reactions-2868747-2026-02-15",
      "headline": "Heartbroken Pakistan fan smashes TV after humbling loss to India in ColomboT20 World Cup, IND vs PAK: A heartbroken Pakistan supporter was filmed smashing his television set following the team's crushing 61-run defeat to India in Colombo. He was just one of millions left reeling after Sunday's humbling at the hands of their arch-rivals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-shaheen-shadab-yousaf-slams-trio-pakistan-loss-vs-india-t20-world-cup-2868742-2026-02-15",
      "headline": "Time's up for Babar, Shaheen: Ex-captain slams Pakistan stars after India lossFormer Pakistan captain Mohammad Yousuf has launched a scathing attack on the team's senior core after Pakistan's crushing 61-run defeat to India in the ICC T20 World Cup 2026 in Colombo, declaring that it is \"time's up\" for Babar Azam, Shaheen Shah Afridi and Shadab Khan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-pak-t20-world-cup-2026-suryakumar-yadav-dedicates-win-india-pakistan-thumping-colombo-2868745-2026-02-15",
      "headline": "This is for India: Surya after crushing Pakistan in T20 World Cup 2026IND vs PAK, T20 World Cup: Suryakumar Yadav dedicated their 61-run win over Pakistan to his nation, India. Ishan Kishan's 77 and Jasprit Bumrah's brilliance powered India to the Super Eight stage in Colombo on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mike-hesson-press-conference-india-vs-pakistan-usman-tariq-2868743-2026-02-15",
      "headline": "Why was Usman Tariq held back against India? Coach clarifies surprise moveT20 World Cup, IND vs PAK: Pakistan coach Mike Hesson explained why Usman Tariq was held back during the match against India. On Sunday, Pakistan suffered a 61-run defeat, with Tariq returning figures of 4-0-24-1."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}