{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filed-the-wrong-itr-form-penalties-missed-refunds-and-what-to-do-next-2746644-2025-06-26",
      "headline": "Filed the wrong ITR form? Penalties, missed refunds and what to do nextWhether you're a salaried professional, freelancer, or a business owner, choosing the right ITR (Income Tax Return) form is important. Getting it wrong might mean missed refunds, penalties, or worse, your return being treated as invalid."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-2025-high-sensex-ends-1000-points-higher-nifty-above-25500-tata-steel-gains-3-percent-2746581-2025-06-26",
      "headline": "Sensex ends 1,000 points higher, Nifty above 25,500; Tata Steel gains 3%The S&P BSE Sensex jumped 1,000.36 points to end at 83,755.87, while the NSE Nifty50 gained 304.25 points to close at 25,549.00. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/from-phones-to-partners-8-money-lessons-to-learn-before-30-2746518-2025-06-26",
      "headline": "From phones to partners: 8 money lessons to learn before 30Managing money isn't just about making budgets, it's about making better choices, every single day. CA Nitin Kaushik shares eight crucial money lessons that everyone should grasp by the age of 30."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/saving-money-ppf-nsc-rate-cut-government-review-june-30-investors-tip-2746530-2025-06-26",
      "headline": "Are your savings at risk? Government may slash PPF, NSC rates next weekSo far this year, interest rates for schemes such as Sukanya Samriddhi Yojana (SSY), Senior Citizens Savings Scheme (SCSS), and Post Office term deposits have remained unchanged. However, this may not continue in the next quarter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/housing-sales-india-quarter-2025-trends-high-prices-buyers-wait-2746520-2025-06-26",
      "headline": "Housing sales drop 20% across top 7 cities in Q2 2025 as prices stay highA sluggish Q2 masked early signs of recovery in India's housing market, with rising prices, cautious buyers, and skewed supply dampening sales—but softening rates and easing tensions may turn the tide.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/hiding-income-or-making-wrong-claims-your-itr-could-attract-a-200-percent-penalty-2746447-2025-06-26",
      "headline": "Hiding income or making wrong claims? Your ITR could attract a 200% penaltyThe recent changes in Income Tax Return (ITR) regulations highlight stricter penalties for incorrect filings, including a potential 200% penalty on false claims."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/affordable-housing-crisis-india-sharp-decline-rising-property-costs-2746134-2025-06-26",
      "headline": "Roti, kapda, but no makaan? The disappearing dream of affordable housingAffordable housing is vanishing from India's cities, and the crisis runs deeper than shrinking supply. In this deep dive, we explore how rising costs, fading supply, and policy gaps are shutting the door on millions chasing the ownership dream."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-expensive-a-house-should-you-buy-investment-banker-shares-these-6-rules-2746421-2025-06-26",
      "headline": "How expensive a house should you buy? Investment banker shares these 6 rulesAn investment banker lays down six clear, conservative rules for home buying to help first-time buyers avoid the trap of overleveraged homeownership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/received-form-16-do-not-file-your-itr-without-checking-these-points-2746414-2025-06-26",
      "headline": "Received Form 16? Don't file your ITR without checking these pointsForm 16 is a certificate your employer gives you every year. It shows how much salary you earned in the financial year and how much tax was deducted from it. This tax is called TDS (Tax Deducted at Source)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/world-most-valuable-company-nvidia-market-cap-ai-chip-maker-share-price-microsoft-apple-tesla-us-aramco-2746366-2025-06-26",
      "headline": "Nvidia overtakes Microsoft as world's most valuable company after 4% surgeNvidia's shares touched a new record high of $154.10, after climbing 4.33% during the trading session. This rally followed a positive report from Loop Capital, which raised its price target for Nvidia from $175 to $250. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-rally-dalal-street-optimism-israel-iran-ceasefire-domestic-factors-stock-market-rising-today-2746359-2025-06-26",
      "headline": "Sensex rises over 500 points, crosses 83,000: Why is stock market rising today?By 9:59 am, the Sensex had gained 549 points to touch 83,305.06, while the Nifty rose by 172.75 points to 25,417.50. The mood across the broader market was upbeat, and volatility remained surprisingly muted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-bitcoin-reserve-signals-a-shift-an-opening-for-india-2746346-2025-06-26",
      "headline": "US Bitcoin Reserve signals a shift: An opening for IndiaIndia stands at a pivotal juncture. A measured Bitcoin strategy—perhaps a reserve pilot—could strengthen economic resilience and project modernity. As the US advances and nations like Bhutan adapt, India has a unique opportunity to lead."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kareena-kapoor-ate-parathas-during-tashan-jokes-about-katrina-kaifs-only-salmon-diet-2746753-2025-06-26",
      "headline": "Kareena Kapoor ate parathas during Tashan, jokes about Katrina Kaif's only salmon dietActor Kareena Kapoor Khan spoke about having parathas for breakfast during the filming of her film 'Tashan' in a conversation with actor Vicky Kaushal. She also joked about actor Katrina Kaif's 'Dhoom phase' when she was on 'only salmon' diet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rana-daggubati-joins-ram-pothineni-next-film-as-producer-2746700-2025-06-26",
      "headline": "Rana Daggubati joins Ram Pothineni's next as producerRana Daggubati has teamed up with the makers of 'Baahubali' to support Ram Pothineni's forthcoming film. The announcement of the film is yet to be made. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/video/mika-singh-says-diljit-dosanjh-isnt-matured-enough-wants-him-to-apologise-2746742-2025-06-26",
      "headline": "Mika Singh says Diljit Dosanjh isn't matured enough, wants him to apologiseMika Singh exclusively spoke to India Today, expressing his disappointment in singer-actor Diljit Dosanjh, amid 'Sardaar Ji 3' row. He urged Dosanjh to apologise and take down posts promoting the upcoming film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karisma-kapoor-thanks-fans-for-support-in-first-post-after-ex-husband-sanjay-kapur-death-2746716-2025-06-26",
      "headline": "Karisma Kapoor thanks fans for support in first post after ex Sunjay Kapur's deathActor Karisma Kapoor, who turned 51 on June 25, thanked everyone for their birthday wishes.  This was her first post after the death of her ex-husband, Sunjay Kapur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/sabrina-carpenter-shares-alternate-cover-mans-best-friend-2746705-2025-06-26",
      "headline": "Approved by God: Sabrina Carpenter shares alternate cover for Man's Best FriendSinger Sabrina Carpenter shared an alternate album cover for her album 'Man's Best Friend'. The album is expected to be released on August 26. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anshula-kapoor-wishes-brother-arjun-kapoor-on-birthday-appreciates-quiet-love-2746682-2025-06-26",
      "headline": "Anshula wishes hope for brother Arjun Kapoor on birthday, appreciates his quiet loveSocial media influencer Anshula Kapoor wished Bollywood actor Arjun Kapoor on the occasion of his birthday on June 26. She appreciated his quiet love in a post on Instagram. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/exclusive-kajol-calls-alia-bhatt-the-most-promising-star-of-new-generation-2746687-2025-06-26",
      "headline": "Exclusive: Kajol calls Alia Bhatt the most promising star of new generation'Maa' actor Kajol commented on the way Gen-Z actors work in the film industry. In an exclusive interview with us, she also appreciated Alia Bhatt for proving her mettle in Bollywood. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sonakshi-sinha-nikita-roy-release-postponed-to-now-hit-theatres-in-july-2746679-2025-06-26",
      "headline": "Sonakshi Sinha's Nikita Roy release postponed to avoid screen battle'Nikita Roy', an upcoming Bollywood film starring Sonakshi Sinha, was scheduled to release on June 27. The release has now been postponed, due to \"battle of screens\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rupali-ganguly-on-fire-incident-at-anupamaa-sets-2746636-2025-06-26",
      "headline": "From ashes, we'll rebuild: Rupali Ganguly on Anupamaa set fireTV actor Rupali Ganguly issued a statement about the fire incident on the sets of her show 'Anupamaa.' In her statement, she thanked everyone for their prayers and extended solidarity to show producer Rajan Shahi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ashok-pathak-panchayat-season-4-binod-rise-from-background-to-breakout-2746517-2025-06-26",
      "headline": "Dekh rahe ho Binod: Panchayat's Ashok Pathak on becoming a breakout actorActor Ashok Pathak's role as Binod in the popular series 'Panchayat Season 4' has been nothing short of impressive. From his innocent expressions to the powerful climax scene, the actor gives us every reason to rate him among the standout performers of the season.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/aishwarya-sharma-on-separation-rumours-with-neil-bhatt-my-life-is-not-your-content-2746606-2025-06-26",
      "headline": "My life is not your content: Aishwarya Sharma on separation rumours with Neil BhattActor Aishwarya Sharma has strongly reacted to separation reports with Neil Bhatt. Aishwarya slammed the social media gossip around her personal life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kapil-sharma-show-turns-into-a-musical-as-metro-in-dino-cast-joins-the-fun-2746602-2025-06-26",
      "headline": "Kapil Sharma's show turns into a musical as Metro In Dino cast joins the funThe cast of 'Metro...In Dino' joined the fun on 'The Great Indian Kapil Show'. The episode will premiere on Netflix on June 28. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/manoj-manchu-kannappa-team-note-omits-brother-vishnu-family-feud-2746596-2025-06-26",
      "headline": "Actor Manoj Manchu wishes Kannappa team, omits Vishnu's name amid family feudActor Manoj Manchu wished his father, Mohan Babu, and the team of 'Kannappa', ahead of the film's release. However, he did not mention his brother Vishnu's name in the note, which came amid their family feud."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/why-american-films-and-shows-often-cast-indians-as-villains-eastern-antagonism-2745967-2025-06-26",
      "headline": "Eastern antagonism: Why American films and shows often cast Indians as villainsPriyanka Chopra, Ali Fazal and Naseeruddhn Shah are among the Indian actors who have acted in Hollywood. However, American cinema and shows are yet to break away with the colonial biases and exotic stereotypes around Indian characters. Here's a glimpse at the archetypes around South Asians, particularly Indians, in Western storytelling."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/guru-randhawa-slams-diljit-dosanjh-amid-sardaar-ji-3-row-be-proud-of-where-you-were-born-2746576-2025-06-26",
      "headline": "Guru Randhawa slams Diljit Dosanjh amid row: Be proud of where you were bornSinger Guru Randhawa called out Diljit Dosanjh amid the ongoing controversy surrounding his upcoming film Sardaar Ji 3. As calls to ban the film grow, Randhawa shared a post, seen as a dig at Dosanjh, urging him to be proud of the country he was born in.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actor-sreeleela-exits-akhil-akkineni-lenin-citing-date-conflicts-reports-2746436-2025-06-26",
      "headline": "Actor Sreeleela exits Akhil Akkineni's Lenin citing date conflicts: ReportsActor Sreeleela has quit 'Lenin' due to date conflicts after shooting some scenes. The unexpected exit could potentially delay the film's progress till a suitable replacement for the actor is finalised.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/tamil-actor-krishna-peddler-kevin-arrested-in-drug-case-2746559-2025-06-26",
      "headline": "Tamil actor Krishna among two arrested in drug caseTamil actor Krishna has been arrested following questioning in the ongoing drug abuse investigation in Tamil Nadu. Earlier, actor Srikanth was also taken into custody by the Chennai police under the Narcotic Drugs and Psychotropic Substances (NDPS) Act."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/rakhi-sawant-congratulates-hania-aamir-appreciates-diljit-dosanjh-for-sardaar-ji-3-2746510-2025-06-26",
      "headline": "Rakhi Sawant congratulates 'Hania Ameer', appreciates Diljit Dosanjh for Sardaar Ji 3Reality TV star Rakhi Sawant extended support to Pakistani actor Hania Aamir amid a raging controversy over her film 'Sardaar Ji 3.' Rakhi, not only congratulated Hania, who she referred to as 'Hania Ameer', on her Bollywood debut but also urged everyone to watch the film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/malaika-arora-wishes-ex-arjun-kapoor-with-a-white-heart-on-his-birthday-watch-2746548-2025-06-26",
      "headline": "Malaika Arora wishes ex Arjun Kapoor with white heart on his birthday. WatchMalaika Arora wished Arjun Kapoor, her ex-partner, on his 40th birthday. She shared an old Boomerang of the actor on her Instagram stories. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/shubhanshu-shukla-scripts-history-as-his-axiom-4-docks-at-international-space-station-2746590-2025-06-26",
      "headline": "Shubhanshu Shukla is first Indian on International Space StationThe milestone marks a triumphant return for India to human spaceflight, coming 41 years after Rakesh Sharma's pioneering mission in 1984."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rss-leader-pitches-for-removal-of-words-socialist-secular-from-preamble-2746773-2025-06-26",
      "headline": "RSS leader pitches for removal of words 'socialist', 'secular' from PreambleRSS General Secretary Dattatreya Hosabale strongly pitched whether the words 'secular' and 'socialist' - added by the Congress government to the Preamble of Constitution during Emergency - should remain."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/owe-eternal-debt-pakistan-field-marshal-asim-munir-at-funeral-of-major-moiz-abbas-shah-who-captured-abhinandan-varthaman-balakot-india-pakistan-2746619-2025-06-26",
      "headline": "Owe eternal debt: Munir at funeral of Pak officer who captured Abhinandan VarthamanPakistan Army Chief Field Marshal Asim Munir attended the funeral of a Pakistani Major who was involved in the capture of Indian Air Force officer Abhinandan Varthaman in 2019. The 37-year-old was killed in a clash with Pakistani Taliban terrorists in Khyber Pakhtunkhwa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-needed-to-do-showmanship-khamenei-says-us-struck-irans-n-sites-but-couldnt-achieve-much-2746601-2025-06-26",
      "headline": "Iran won, heavy slap to US: Khamenei on attack on key American base in QatarOn June 21, the US got directly involved in the 12-day Israel-Iran conflict and bombed the Islamic Republic's key nuclear sites in Fordow, Natanz and Isfahan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/shubhanshu-shukla-gets-space-station-pin-number-634-says-next-14-days-will-be-great-2746723-2025-06-26",
      "headline": "It looks easy, but my head is a little heavy: Shux on reaching Space StationShubhanshu Shukla, who became the first Indian astronaut to reach the International Space Station, said his head felt a little heavy but looked forward to conducting scientific research in the next two weeks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/ioc-pauses-olympic-host-city-selection-process-india-2036-bid-2746795-2025-06-26",
      "headline": "India's 2036 Olympics hopes on hold: New IOC president pauses bidding processNew IOC President Kirsty Coventry announces a pause and review of the Olympic host city selection process. The decision comes at a time when India has emerged as one of the leading contenders to host the 2036 Summer Games. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/dutch-man-henricks-travelled-to-india-meet-social-media-friend-west-bengals-nadia-left-disappointed-2746841-2025-06-26",
      "headline": "Dutch man flies to Bengal to meet online friend, lands in police trouble insteadDutch national Henricks met a girl, not knowing she was a minor, through social media and their friendship grew so much so that Henrick decided to meet her and left Amsterdam for India last Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-law-against-dissent-calls-online-acts-espionage-activists-crackdown-internal-khamenei-israel-2746593-2025-06-26",
      "headline": "Iran executes 'spies', widens espionage definition to include social mediaIran has widened the definition of espionage to include social media activity. This comes against the backdrop of the recent Israeli and US attacks, which were aided by Mossad agents in Iran. Tehran has now launched a sweeping crackdown, making mass arrests and executing suspected spies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/white-house-donald-trump-daddys-home-music-video-nato-summit-2746622-2025-06-26",
      "headline": "Daddy's home: White House plays on Trump's new nickname in Nato videoDonald Trump was jokingly called 'daddy' by Nato chief Mark Rutte while the US President was speaking to the media on the Israel-Iran ceasefire."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/meril-launches-myclip-indias-first-transcatheter-edge-to-edge-repair-teer-system-for-treatment-of-severe-mitral-regurgitation-2745354-2025-06-24",
      "headline": "Meril Launches MyClip, India's First Transcatheter-Edge-to-Edge Repair (TEER) SystemThe launch of MyClip TEER System marks a transformative moment for structural heart therapy in India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/embraced-islam-willingly-pakistani-media-3-hindu-sisters-kidnapped-converted-sindh-province-pakistan-2746735-2025-06-26",
      "headline": "Embraced Islam willingly: Pak media on 3 Hindu sisters kidnapped by teachersThree Hindu sisters and their male cousin were allegedly abducted and forcefully converted to Islam by their teachers in Pakistan's Sindh province. However, the Pakistani media reported that they chose Islam willingly, even as their parents and community members alleged coercion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/zohran-mamdani-new-york-democrat-mayor-candidate-votes-whites-asians-blacks-2746578-2025-06-26",
      "headline": "Not only Asians, Whites also backed Zohran Mamdani despite racist attacksZohran Mamdani made history as the first Muslim nominee of the Democrats after former Governor Andrew Cuomo conceded the race on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/from-shah-to-supreme-leader-iran-islamic-revolution-unfolds-part-3-2746750-2025-06-26",
      "headline": "From Shah to Supreme Leader: Iran's Islamic revolution unfolds | Part 3In the concluding part of our series on US-Iran relations, we examine the Shah's push for modernisation, the emergence of Ayatollah Ruhollah Khomeini, and the 1979 Islamic Revolution that transformed Iran and its relationship with the United States."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/hindu-temple-razed-in-bangladesh-india-says-extremists-clamoured-for-demolition-2746839-2025-06-26",
      "headline": "Hindu temple razed in Bangladesh, India says extremists clamoured for demolitionA makeshift Durga temple in Dhaka was razed as part of a demolition drive, a move criticised by India, saying Bangladesh's interim government projected the incident as \"illegal land use\" and \"extremists\" clamouring for the demolition of the structure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-iran-war-ceasefire-is-it-truce-middle-east-us-trump-war-goals-bombing-nuclear-sites-intelligence-reports-2746537-2025-06-26",
      "headline": "Is it really truce in Middle East with Israel's unfulfilled war goals?Early intelligence reports indicate that Iran may still be capable of resuming its nuclear programme. Meanwhile, the Iranian Parliament has passed a bill to sever ties with the IAEA, removing international oversight of its nuclear ambitions, which could further provoke the West. This threatens the fragile Middle East truce, risking potential escalation in the near future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shashi-tharoor-congress-cryptic-post-message-rift-party-leadership-bird-message-2746575-2025-06-26",
      "headline": "Even free bird must watch skies: Congress jabs Shashi Tharoor after cryptic postThe rift between Shashi Tharoor and the Congress widened when party leader Manickam Tagore shared a 'birds' post in a veiled swipe at the Thiruvananthapuram MP, a day after he shared a cryptic post, saying, \"Don't ask permission to fly.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ashok-pathak-panchayat-season-4-binod-rise-from-background-to-breakout-2746517-2025-06-26",
      "headline": "Dekh rahe ho Binod: Panchayat's Ashok Pathak on becoming a breakout actorActor Ashok Pathak's role as Binod in the popular series 'Panchayat Season 4' has been nothing short of impressive. From his innocent expressions to the powerful climax scene, the actor gives us every reason to rate him among the standout performers of the season.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/travel/story/rise-in-sports-tourism-wimbledon-2025-formula-1-uk-visa-india-2746586-2025-06-26",
      "headline": "Travellers are not just booking match tickets, they are getting passports tooThe world of travel has become more about elaborating on experiences. Now, there is a surge in fan-fuelled flight bookings as sports tourism is slowly driving a surge no one saw coming. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/zohram-mamdani-nyc-new-york-city-mayor-candidate-2020-old-viral-post-arya-rajendra-kerala-youngest-mayor-2746555-2025-06-26",
      "headline": "Who's Kerala's Arya Rajendran, cited by NYC's Mamdani in now-viral postZohran Mamdani, the son of Indian-American filmmaker Mira Nair, has emerged victorious in run for the New York City Mayor's post. In 2020, Mamdani shared a CPM Puducherry post on Arya Rajendran to talk about what the NYC Mayor should be like. Who's Rajendran, and what does the 5-year-old post signify?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mamata-banerjee-nrc-approach-west-bengal-bihar-assembly-polls-electoral-roll-division-2746751-2025-06-26",
      "headline": "Bengal main target: Mamata Banerjee says 'NRC-like approach' in voter roll revisionWest Bengal Chief Minister Mamata Banerjee accused the Election Commission of isolating voters born between July 1987 and December 2004 and seeking documentary evidence of their citizenship in the name of \"special intensive revision of electoral rolls\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/america-sharma-ji-ka-beta-zohran-mamdani-wins-new-york-mayoral-primary-best-memes-2746714-2025-06-26",
      "headline": "'America's Sharma ji ka beta' memes explode after Zohran Mamdani's NYC primary winZohran Mamdani made history as the first Muslim nominee of the Democrats after former Governor Andrew Cuomo conceded the race on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-wanted-terrorism-reflected-in-shanghai-summit-statement-one-particular-country-objected-government-2746624-2025-06-26",
      "headline": "One country objected to terror mention in Shanghai summit statement: GovernmentExternal Affairs spokesperson Randhir Jaiswal confirmed that no joint statement was issued during the Shanghai Cooperation Organisation summit in China as India wanted to reflect on terrorism but 'one particular country' objected."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/four-jaish-terrorists-trapped-in-jammu-and-kashmirs-udhampur-encounter-underway-2746494-2025-06-26",
      "headline": "Jaish terrorist being tracked for a year killed in gunfight in J&K's UdhampurThe gunfight broke out in Jammu and Kashmir's Udhampur district when security forces launched a search operation based on specific intelligence in the Basantgarh area this morning."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/affordable-housing-crisis-india-sharp-decline-rising-property-costs-2746134-2025-06-26",
      "headline": "Roti, kapda, but no makaan? The disappearing dream of affordable housingAffordable housing is vanishing from India's cities, and the crisis runs deeper than shrinking supply. In this deep dive, we explore how rising costs, fading supply, and policy gaps are shutting the door on millions chasing the ownership dream."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-mohammed-shami-criticises-indias-bowling-in-leeds-test-2746829-2025-06-26",
      "headline": "Shami criticises India's bowling in Leeds, asks for more support for BumrahIndia fast bowler Mohammed Shami has criticised team's bowling during the first Test against England at Headingley in Leeds and asked for more support for the pace spearhead Jasprit Bumrah."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/ioc-pauses-olympic-host-city-selection-process-india-2036-bid-2746795-2025-06-26",
      "headline": "India's 2036 Olympics hopes on hold: New IOC president pauses bidding processNew IOC President Kirsty Coventry announces a pause and review of the Olympic host city selection process. The decision comes at a time when India has emerged as one of the leading contenders to host the 2036 Summer Games. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-not-want-to-watch-carlos-alcaraz-vs-jannik-sinner-french-open-final-2746807-2025-06-26",
      "headline": "Didn't want to watch Alcaraz vs Sinner French Open final: Novak DjokovicNovak Djokovic revealed he didn't intend to watch the French Open final between Carlos Alcaraz and Jannik Sinner, but eventually gave in—and was left stunned by the level of tennis on display."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/pv-sindhu-working-on-keeping-pace-with-changing-womens-game-2746791-2025-06-26",
      "headline": "Determined as ever, PV Sindhu working on keeping pace with changing women's gameP V Sindhu is reinventing her game to keep pace with the evolving tempo while navigating a challenging lean phase. In the ongoing year, Sindhu has endured four first-round exits and three second-round losses, with a lone quarterfinal appearance at the India Open."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravi-shastri-demands-bigger-share-of-icc-earnings-for-india-2746782-2025-06-26",
      "headline": "Ravi Shastri demands bigger cut of ICC earnings for IndiaFormer India cricketer and head coach Ravi Shastri feels India should get an even bigger share of the ICC's (International Cricket Council) revenue, given their massive contribution to the board's coffers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-cricket-rules-update-stop-clock-saliva-ban-injury-replacements-2024-2746746-2025-06-26",
      "headline": "New cricket rules explained: Stop clock, catch of no-ball, replacement playerThe ICC has introduced several rule changes including a stop clock in Test cricket and tweaks to the saliva ban. The global body of cricket will also allow first-class teams across the world to allow injury replacements. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/stuart-broad-highlights-indias-major-blunder-in-leeds-test-2746749-2025-06-26",
      "headline": "Stuart Broad highlights India's major blunder in Leeds TestEngland fast bowler Stuart Broad has highlighted India's major blunder in the first Test at Headingley, Leeds saying that the Shubman Gill-led side got their team selection wrong."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-australia-usman-khawaja-sen-sports-snub-peter-lalor-2746738-2025-06-26",
      "headline": "Khawaja snubs broadcasters after firing of pro-Palestine reporter: ReportsUsman Khawaja made a silent but powerful statement in Barbados, refusing a post-play interview with SEN Radio in protest against the network's sacking of Peter Lalor over his pro-Palestinian posts earlier this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-jofra-archer-inclusion-stats-birmingham-2746675-2025-06-26",
      "headline": "Jofra Archer returns: What are his numbers against India and at home in Tests?With Jofra Archer included in England's squad for the second Test, does it make sense for the pacer to be handed a start against India in Birmingham? Archer hasn't played a Test since 2021, and Ben Stokes could face a tough decision regarding his inclusion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-second-test-jofra-archer-selection-nasser-hussain-2746728-2025-06-26",
      "headline": "Jofra Archer's selection for second Test a gamble, says Nasser HussainNasser Hussain feels that England are taking a gamble by adding Jofra Archer to the squad for the Edgbaston Test. Archer has made a return to the Test squad for the first time since 2021. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/stuart-broad-highlights-indias-major-blunder-in-leeds-test-2746749-2025-06-26",
      "headline": "Stuart Broad highlights India's major blunder in Leeds TestEngland fast bowler Stuart Broad has highlighted India's major blunder in the first Test at Headingley, Leeds saying that the Shubman Gill-led side got their team selection wrong."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-australia-usman-khawaja-sen-sports-snub-peter-lalor-2746738-2025-06-26",
      "headline": "Khawaja snubs broadcasters after firing of pro-Palestine reporter: ReportsUsman Khawaja made a silent but powerful statement in Barbados, refusing a post-play interview with SEN Radio in protest against the network's sacking of Peter Lalor over his pro-Palestinian posts earlier this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-jofra-archer-inclusion-stats-birmingham-2746675-2025-06-26",
      "headline": "Jofra Archer returns: What are his numbers against India and at home in Tests?With Jofra Archer included in England's squad for the second Test, does it make sense for the pacer to be handed a start against India in Birmingham? Archer hasn't played a Test since 2021, and Ben Stokes could face a tough decision regarding his inclusion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-second-test-jofra-archer-selection-nasser-hussain-2746728-2025-06-26",
      "headline": "Jofra Archer's selection for second Test a gamble, says Nasser HussainNasser Hussain feels that England are taking a gamble by adding Jofra Archer to the squad for the Edgbaston Test. Archer has made a return to the Test squad for the first time since 2021. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}