{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bangladesh-economy-adani-power-supply-cut-explainer-power-development-board-2626922-2024-11-02",
      "headline": "Explained: How Adani Power's supply cut impacts crisis-hit Bangladesh economyAdani Power's supply cut to Bangladesh intensifies existing economic challenges, raising concerns about energy security and financial stability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-power-plant-bangladesh-electricity-supply-cut-unpaid-bills-gautam-adani-2626866-2024-11-02",
      "headline": "Adani Power cuts half of Bangladesh electricity supply over unpaid duesThe power reduction comes at a challenging time for Bangladesh, which reported a shortfall of over 1,600 megawatts (MW) overnight. The 1,496 MW Adani plant is currently generating just 700 MW from one of its two units."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/muhurat-trading-2024-samvat-2081-stock-market-sensex-nifty-key-stocks-strategies-2626541-2024-11-01",
      "headline": "Muhurat Trading 2024: Markets end on strong note; all sectoral indices in greenMuhurat Trading 2024 has concluded, marking the arrival of Samvat 2081. The session, which took place from 6:00 PM to 7:00 PM, ended on a strong note, with the Sensex surging 335 points and the Nifty closing at 24,300. Investors actively participated, reflecting the festive spirit of the Hindu New Year through token investments aimed at attracting prosperity. All the sectoral indices ended the session in green, with M&M, ONGC, Adani Ports and BEL emerging as the top gainers. On the other hand, the top losers were Dr Reddy's, HCLTech, Britannia, Tech Mahindra and Adani Enterprises. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/muhurat-trading-timings-strategies-tips-stock-picks-and-key-details-2626384-2024-11-01",
      "headline": "Muhurat Trading 2024: Check timings, stock recommendations, all key detailsMuhurat Trading today: The pre-opening session will begin at 5:45 PM, and all intraday positions will be automatically squared off 15 minutes before the session's close, necessitating careful planning for same-day trades."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/muhurat-trading-top-stock-picks-trading-strategies-expert-insights-key-levels-timing-2626371-2024-11-01",
      "headline": "Muhurat trading 2024: Check stock picks, trading strategy and expert insightsMuhurat trading is not just a unique market session; it's a cherished tradition where investors make token investments to invoke the blessings of Goddess Lakshmi, the goddess of wealth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bibek-debroy-dies-aged-69-visionary-economist-policy-reformer-author-2626283-2024-11-01",
      "headline": "Bibek Debroy dies at 69: A visionary economist and policy reformer Bibek Debroy's life was marked by significant contributions to economic policy and classical literature, shaping India's intellectual landscape and leaving a lasting impact on future generations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/19-kg-lpg-commercial-gas-cylinder-price-hike-delhi-mumbai-chennai-kolkata-new-rate-2626197-2024-11-01",
      "headline": "19 kg LPG commercial cylinders to get costlier from today. Check pricesThe prices of 19-kg commercial LPG cylinders have been revised across the country, including in metro cities like Delhi, Mumbai, Kolkata, and Chennai, effective November 1."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-over-550-points-lower-nifty-dips-as-it-stocks-slide-2626082-2024-10-31",
      "headline": "Sensex ends over 550 points lower, Nifty dips as IT stocks slideThe S&P BSE Sensex dropped by 553.12 points to close at 79,389.06, while the NSE Nifty50 fell 135.50 points, settling at 24,205.35. Broader market indices also declined as volatility weighed on investor sentiment across Dalal Street."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cipla-share-price-gain-10-percent-today-usfda-approval-goa-facility-stock-benefit-explained-2625958-2024-10-31",
      "headline": "Explained: Why Cipla share price surged up to 10% todayCipla share price: The stock rose by 9.88% to reach a day high of Rs 1,557.45 on the Bombay Stock Exchange (BSE).  At 10:41 am, shares of Cipla were up 8.24% at Rs 1,534.25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdb-financial-nbfc-hdfc-bank-arm-files-for-rs-12500-crore-ipo-check-details-2625953-2024-10-31",
      "headline": "HDFC Bank's HDB Financial files Rs 12,500 crore IPO. Check detailsHDFC Bank, holding a 94.6% stake in HDB Financial, will sell shares worth up to Rs 10,000 crore, while HDB Financial plans to issue fresh shares totalling Rs 2,500 crore, as outlined in the filing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-openig-dalal-street-sensex-nifty-fall-fii-outflow-weak-q2-results-overvaluation-2625947-2024-10-31",
      "headline": "Diwali fireworks missing from Dalal Street as Sensex, Nifty fall The S&P BSE Sensex was down 199.13 points to 79,743.05 at 10:07 am, while the NSE Nifty50 fell 126 points to 24,340.85."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-diwali-celebration-drone-show-noida-headquarters-ceo-vijay-shekhar-sharma-2625873-2024-10-31",
      "headline": "Paytm lights up Noida skies with dazzling Diwali drone showPaytm celebrated Diwali with a dazzling drone show at its Noida headquarters, featuring messages like \"Happy Diwali\" and \"Paytm karo\" in the night sky."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-sensex-nifty-snap-two-day-rally-dull-q2-earnings-disrupy-momentum-2625669-2024-10-30",
      "headline": "Sensex, Nifty snap 2-day rally as dull Q2 earnings disrupt momentum The BSE Sensex fell 0.5% to close at 79,966, while the NSE Nifty 50 index declined by the same margin to 24,350, as market sentiment weakened due to ongoing foreign selling and lacklustre corporate earnings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/diwali-2024-stocks-to-buy-recmmendations-stoxbox-strong-fundamentals-share-price-trends-2625626-2024-10-30",
      "headline": "StoxBox's Diwali picks: 5 stocks to light up your portfolioGet ready to brighten your portfolio this Diwali with these five promising stocks that are expected to deliver strong future performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/samsung-market-value-down-122-billion-dollars-since-july-32-percent-tumble-decoded-2625551-2024-10-30",
      "headline": "Falling behind in AI race has cost Samsung $122 billion: Report Samsung has lost $122 billion in market value since July, a tumble of 32% that makes it the largest decline among global chipmakers this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elcid-share-price-692535-percent-rise-india-most-expensive-stock-surpassing-mrf-2625536-2024-10-30",
      "headline": " Elcid's 66,92,535% surge makes it India's most expensive stock, surpassing MRFElcid Investments, based in Mumbai, is a non-banking financial company (NBFC) with a strong connection to Asian Paints."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-enterprises-ports-share-price-top-gainers-nifty50-q2-results-2625465-2024-10-30",
      "headline": "Adani Enterprises, Adani Ports: Why Adani stocks are gaining todayAdani Enterprises shares rose 4.42% to Rs 2,974.50 on the National Stock Exchange (NSE) at 11:41 am, while APSEZ saw a 2.62% lift to Rs 1,408.65. All other Adani Group companies also traded in the green, supported by these positive cues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-brings-102-tonnes-of-gold-from-bank-of-england-home-on-dhanteras-2625444-2024-10-30",
      "headline": "RBI's 102-tonne gold haul this Dhanteras: What's behind the move?The RBI recently relocated 102 tonnes of gold from the Bank of England's vaults to secure facilities within India as it now hold a total of 855 tonnes in reserves. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/maruti-suzuki-share-price-today-gains-despite-disappointing-q2-results-2625446-2024-10-30",
      "headline": "Explained: Why Maruti Suzuki share price gained over 2% despite weak Q2 resultsMaruti Suzuki's quarterly report revealed a 17% year-on-year decline in net profit to Rs 3,103 crore, falling short of market expectations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-sensex-nifty-q2-earnings-diwali-adani-stocks-bel-2625435-2024-10-30",
      "headline": "Sensex, Nifty in red as Q2 earnings dampen Diwali spirit; Adani stocks gainThe NSE Nifty 50 dropped 0.24% to 24,411.9 points, while the BSE Sensex declined 0.28% to 80,142.11 by 9:57 am. Seven out of the 13 major sectors showed losses, while small-cap and mid-cap indices performed better, rising 1% and 0.5%, respectively. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-3-0-whitewash-series-rohit-sharma-mumbai-test-2627308-2024-11-03",
      "headline": "India 0-3 New Zealand: Rohit Sharma's men slump to historic low in home TestsIndia vs New Zealand: Rohit Sharma became the first Indian captain to lose a three-match Test series at home 3-0. New Zealand outplayed India, winning a thriller in Mumbai to script history  on Sunday, November 3. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/mumbai-police-yogi-adityanath-threat-call-baba-siddique-uttar-pradesh-chief-minister-resignation-2627241-2024-11-03",
      "headline": "24-year-old woman detained over death threat to Yogi AdityanathA woman, identified as Fatima Khan from Ulhasnagar area in Maharashtra's Thane, was detained for sending death threat to Uttar Pradesh Chief Minister Yogi Adityanath. She is mentally unstable, police said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/cops-arrest-nagpur-man-for-sending-hoax-bomb-threats-to-airlines-indigo-air-india-vistara-2627277-2024-11-03",
      "headline": "Maharashtra man, who wrote about terrorism, arrested for hoax threats to airlinesPolice have arrested Jagdish Uikey, a 35-year-old writer from Maharashtra's Nagpur, for allegedly spreading panic nationwide by sending hoax bomb threats to airlines.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-pollution-news-air-quality-index-very-poor-stubble-burning-2627228-2024-11-03",
      "headline": "Delhi air quality plunges to 'dangerous' category just days after DiwaliThe air quality in Delhi has reached concerning levels, with Anand Vihar recording an AQI of 437, the highest in the capital, followed by Lajpat Nagar with an AQI of 432. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/pakistani-serials-hook-indians-gen-z-popular-vcr-to-netflix-era-mahira-fawad-khan-humsafar-drama-streaming-youtube-2626454-2024-11-03",
      "headline": "Why Pakistani serials continue to hook Indians, from VCR to Netflix eraFor Indians, most things to do with Pakistan have been a love-hate affair. However, Pakistani serials have received enduring love from Indians over the decades and across generations. This is why even the Gen Z in India binge on Pakistani serials along with their Netflix dope."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-third-test-rishabh-pant-dismissal-controversy-mumbai-2627309-2024-11-03",
      "headline": "Out or not out? Rishabh Pant's dismissal in Mumbai leaves fans dividedRishabh Pant's controversial dismissal in the Mumbai Test left the fans divided with some feeling that the Indian batter was robbed by the third umpire. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-rani-bagh-shooting-incident-businessman-lawrence-bishnoi-gang-rivals-bambiha-gang-video-2627294-2024-11-03",
      "headline": "Bishnoi gang rivals firing at Delhi businessman's home caught on cameraThe video revealed that two men on a motorcycle were approaching the businessman's residence. One of them is seen throwing a note inside, marked with \"Bambiha Gang\" and an international phone number."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/2024-jharkhand-assembly-elections-amit-shah-release-bjp-manifesto-address-rallies-2627243-2024-11-03",
      "headline": "Amit Shah unveils BJP manifesto for Jharkhand polls, attacks Hemant SorenIn the BJP's \"sankalp patra\" for the Jharkhand elections, the party outlined 25 resolutions to mark 25 years of the state's formation. Among these, the \"Gogo Didi\" scheme promises Rs 2,100 per month to women."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/delhi-primary-teacher-classroom-activity-impresses-internet-viral-video-2627287-2024-11-03",
      "headline": "Delhi primary school teacher's classroom activity impresses Internet. Viral videoA video shared by a Delhi-based primary school teacher in which she demonstrated the arm span-to-height ratio went viral on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/sathyabamas-rise-building-a-stronger-future-2625146-2024-10-29",
      "headline": "Sathyabama's RISE - Building a Stronger FutureSathyabama Institute of Science and Technology stands out as a beacon of educational excellence and social responsibility. Under the visionary leadership of Chancellor Dr. Mariazeena Johnson, this institution is redefining what it means to be a premier university in India, transforming lives through both world-class education and impactful community initiatives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/tamil-actor-trisha-krishnan-makes-it-to-the-new-york-times-crossword-puzzle-shares-pic-2627307-2024-11-03",
      "headline": "Tamil actor Trisha Krishnan makes it to The New York Times crossword puzzle, shares picSouth Indian superstar Trisha Krishnan recently found her name in a New York Times crossword clue, a significant milestone for the actor. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/chennai-amanjikarai-metha-nagar-couple-minor-domestic-help-torture-death-police-2627284-2024-11-03",
      "headline": "Minor domestic help found dead in Chennai home, couple arrested for torturePolice said that the couple allegedly found the girl dead inside the bathroom of their house on October 31, following which they locked the bathroom, and left for their relative's house. They had tortured the girl along with their friend, Lokesh, the same day."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-guards-his-look-for-king-says-he-chopped-off-long-hair-2627311-2024-11-03",
      "headline": "Shah Rukh Khan guards his look for King: Chopped off long hairOn his birthday, November 2, Shah Rukh Khan announced that he has chopped of his signature long hair for King. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/jharkhand-assembly-elections-himanta-biswa-sarma-assam-chief-minister-india-bloc-infiltrators-2627201-2024-11-03",
      "headline": "Complaint against Himanta Sarma for 'inflammatory' remarks, his responseThe INDIA bloc complaint accused Himanta Sarma of making inflammatory and divisive speeches targeting Muslim minorities and promoting communal tension ahead of upcoming assembly elections in Jharkhand.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/us-presidential-elections-2024-kamala-harris-democrat-saturday-night-live-2627207-2024-11-03",
      "headline": "Keep Calm-ala: Kamala Harris urges US voters on 'Saturday Night Live' Kamala Harris made a recent appearance on the US comedy show Saturday Night Live, joining actor and comedian Maya Rudolph, known for her impressions of the vice president. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/kerala/story/kerala-police-fir-union-minister-suresh-gopi-ambulance-bjp-thrissur-pooram-2627310-2024-11-03",
      "headline": "Case against Union Minister Suresh Gopi for travelling in ambulance to eventThe opposition has claimed that the Pooram was disrupted to help Gopi, who was then the BJP's candidate for Lok Sabha elections from the Thrissur constituency. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-radhakrishnan-committee-aims-to-fix-neet-mess-2627125-2024-11-02",
      "headline": "How Radhakrishnan Committee aims to fix NEET messThe panel favours transformative changes to secure NEET, streamline CUET and revamp the National Testing Agency to restore public trust in India's national entrances system\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-sports-business-politics-entertainment-429-02-11-2024",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/taapsee-pannu-on-doing-big-films-heroes-decide-who-the-heroine-is-going-to-be-2627286-2024-11-03",
      "headline": "Taapsee Pannu on doing big films: Heroes decide who the heroine is going to beBollywood actor Taapsee Pannu recently opened up about the casting dynamics in the film industry. She highlighted the significant role male actors play in choosing their female co-stars for major projects."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-mumbai-test-rohit-sharma-rash-shot-ian-smith-2627256-2024-11-03",
      "headline": "Rohit Sharma slammed for 'rash and needless' shot after another Test failureIndia vs New Zealand, 3rd Test: Captain Rohit Sharma threw it away on Day 3 of the Mumbai Test. Rohit was severely criticised for that 'rash' shot that led to his dismissal when India were chasing 147."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/rohit-bal-fashion-designer-man-india-will-celebrate-forever-2627010-2024-11-02",
      "headline": "Rohit Bal, the mortal with immortal sensibilitiesRohit Bal, affectionately known as Gudda, was a legendary fashion designer whose passing will be mourned by many, as he touched lives with his artistry and generous spirit. His legacy of vibrant, sophisticated fashion has forever enriched India's cultural landscape and inspired countless designers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/canada-news/story/canada-pm-justin-trudeau-diwali-india-relation-hindu-diplomatic-row-2627240-2024-11-03",
      "headline": "Trudeau celebrates Diwali, visits Hindu temples amid escalating India-Canada rowCanadian Prime Minister Justin Trudeau shared a video of him celebrating Diwali with the Indian community in Canada amid the diplomatic row."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-canada-diplomatic-standoff-surveillance-harassment-intimidation-indian-officials-in-canada-2627137-2024-11-02",
      "headline": "Harassment, intimidation: India alleges surveillance of officials in CanadaRandhir Jaiswal, spokesperson of the Ministry of External Affairs, said that Canada had put Indian officials under audio and video surveillance and was 'harassing and intimidating' them by resorting to such measures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/peanut-the-squirrel-death-euthanised-elon-musk-donald-trump-republican-2627214-2024-11-03",
      "headline": "Social media star squirrel Peanut euthanised, Elon Musk says 'Trump will save...'Elon Musk, in a series of posts on X, slammed the government for what he called \"overreach\" in a case of Peanut the Squirrel. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-birthday-fan-meet-children-fight-property-batwada-2627315-2024-11-03",
      "headline": "SRK says his children don't fight: They shouldn't, else property division...Shah Rukh Khan celebrated his birthday with fans, sharing insights into his family life and humourously addressing fan questions. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-guards-his-look-for-king-says-he-chopped-off-long-hair-2627311-2024-11-03",
      "headline": "Shah Rukh Khan guards his look for King: Chopped off long hairOn his birthday, November 2, Shah Rukh Khan announced that he has chopped of his signature long hair for King. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/tamil-actor-trisha-krishnan-makes-it-to-the-new-york-times-crossword-puzzle-shares-pic-2627307-2024-11-03",
      "headline": "Tamil actor Trisha Krishnan makes it to The New York Times crossword puzzle, shares picSouth Indian superstar Trisha Krishnan recently found her name in a New York Times crossword clue, a significant milestone for the actor. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/bigg-boss-18-november-2-update-shehzada-dhami-evicted-2627300-2024-11-03",
      "headline": "Bigg Boss 18 Day 26: Shehzada Dhami evicted from Salman Khan-hosted showBigg Boss 18's latest episode saw Shehzada Dhami's eviction and the introduction of new wildcard contestants, while Ravi Kishan announced a new segment."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-world-test-championship-mumbai-test-2627313-2024-11-03",
      "headline": "India lose top spot in WTC table after 3-0 defeat to New Zealand IND vs NZ: India dropped to second in the table in the 2023-25 World Test Championship (WTC) after losing 3-0 to Tom Latham's New Zealand. India lost the Wankhede Test by 25 runs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-third-test-rishabh-pant-dismissal-controversy-mumbai-2627309-2024-11-03",
      "headline": "Out or not out? Rishabh Pant's dismissal in Mumbai leaves fans dividedRishabh Pant's controversial dismissal in the Mumbai Test left the fans divided with some feeling that the Indian batter was robbed by the third umpire. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-3-0-whitewash-series-rohit-sharma-mumbai-test-2627308-2024-11-03",
      "headline": "India 0-3 New Zealand: Rohit Sharma's men slump to historic low in home TestsIndia vs New Zealand: Rohit Sharma became the first Indian captain to lose a three-match Test series at home 3-0. New Zealand outplayed India, winning a thriller in Mumbai to script history  on Sunday, November 3. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-rishabh-pant-ajaz-patel-dismissal-2627306-2024-11-03",
      "headline": "Disappointed Rishabh Pant argues with umpires after dicey dismissal IND vs NZ: Rishabh Pant scored 64 runs off 57 balls in the second innings of the Mumbai Test after which Ajaz Patel dismissed him caught by Tom Blundell. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-third-test-day-three-rishabh-pant-fifty-run-chase-mumbai-2627285-2024-11-03",
      "headline": "IND vs NZ: Rishabh Pant scores fighting fifty at Wankhede to keep India in huntRishabh Pant continued his fine form with the bat for India against New Zealand as he scored a fighting fifty in the second innings of the Mumbai Test. Pant got to his fifty in 48 balls. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/inida-vs-new-zealand-mumbai-test-ravindra-jadeja-10-wicket-haul-record-2627278-2024-11-03",
      "headline": "Mumbai Test: Jadeja edges closer to Harbhajan with 10-wicket match haulIndia (IND) vs New Zealand (NZ), 3rd Test: Ravindra Jadeja went past Kapil Dev on the list of Indian bowlers with most 10-wicket match hauls in home Tests. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/premier-league-manchester-city-couldnt-handle-bournemouth-intensity-in-2-1-loss-pep-guardiola-2627275-2024-11-03",
      "headline": "Manchester City couldn't handle Bournemouth intensity in 2-1 loss: Pep GuardiolaManchester City manager Pep Guardiola acknowledged his team's inability to match Bournemouth's intensity in a surprising 2-1 defeat, ending their 32-game unbeaten run. The loss drops City to second place in the Premier League standings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-third-test-virat-kohli-failure-ajaz-patel-mumbai-2627264-2024-11-03",
      "headline": "Virat Kohli fails again in Mumbai Test, ends horror series with less than 100 runsVirat Kohli failed once again in the Mumbai Test to bring his New Zealand series to an end in lacklustre fashion. Kohli was dismissed for just 1 run in the 2nd innings. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-mumbai-test-rohit-sharma-rash-shot-ian-smith-2627256-2024-11-03",
      "headline": "Rohit Sharma slammed for 'rash and needless' shot after another Test failureIndia vs New Zealand, 3rd Test: Captain Rohit Sharma threw it away on Day 3 of the Mumbai Test. Rohit was severely criticised for that 'rash' shot that led to his dismissal when India were chasing 147."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-a-tour-game-australia-ball-tampering-allegation-clarification-ishan-kishan-2627244-2024-11-03",
      "headline": "Ball-tampering in India's tour game? Cricket Australia offers clarificationIndia A tour of Australia: Contrary to a media report, Cricket Australia confirmed that there was no case of ball-tampering on Day 4 of the first unofficial Test between India A and Australia A in Mackay. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-third-test-day-three-virat-kohli-rohit-sharma-form-slump-simon-doull-mumbai-2627247-2024-11-03",
      "headline": "Do Virat Kohli, Rohit Sharma have mental fortitude to end form slump? asks DoullSimon Doull has asked if Virat Kohli and Rohit Sharma have the mental fortitude to overcome their barren runs in Tests. Kohli and Rohit have endured a torrid time during the New Zealand series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/premier-league-manchester-city-couldnt-handle-bournemouth-intensity-in-2-1-loss-pep-guardiola-2627275-2024-11-03",
      "headline": "Manchester City couldn't handle Bournemouth intensity in 2-1 loss: Pep GuardiolaManchester City manager Pep Guardiola acknowledged his team's inability to match Bournemouth's intensity in a surprising 2-1 defeat, ending their 32-game unbeaten run. The loss drops City to second place in the Premier League standings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-third-test-virat-kohli-failure-ajaz-patel-mumbai-2627264-2024-11-03",
      "headline": "Virat Kohli fails again in Mumbai Test, ends horror series with less than 100 runsVirat Kohli failed once again in the Mumbai Test to bring his New Zealand series to an end in lacklustre fashion. Kohli was dismissed for just 1 run in the 2nd innings. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-mumbai-test-rohit-sharma-rash-shot-ian-smith-2627256-2024-11-03",
      "headline": "Rohit Sharma slammed for 'rash and needless' shot after another Test failureIndia vs New Zealand, 3rd Test: Captain Rohit Sharma threw it away on Day 3 of the Mumbai Test. Rohit was severely criticised for that 'rash' shot that led to his dismissal when India were chasing 147."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-a-tour-game-australia-ball-tampering-allegation-clarification-ishan-kishan-2627244-2024-11-03",
      "headline": "Ball-tampering in India's tour game? Cricket Australia offers clarificationIndia A tour of Australia: Contrary to a media report, Cricket Australia confirmed that there was no case of ball-tampering on Day 4 of the first unofficial Test between India A and Australia A in Mackay. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-third-test-day-three-virat-kohli-rohit-sharma-form-slump-simon-doull-mumbai-2627247-2024-11-03",
      "headline": "Do Virat Kohli, Rohit Sharma have mental fortitude to end form slump? asks DoullSimon Doull has asked if Virat Kohli and Rohit Sharma have the mental fortitude to overcome their barren runs in Tests. Kohli and Rohit have endured a torrid time during the New Zealand series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-liverpool-top-manchester-city-shock-loss-arsenal-newcastle-2627227-2024-11-03",
      "headline": "Liverpool go top after shock defeat for Manchester City, sloppy Arsenal losePremier League: Liverpool went clear at the top of the league table after their come-from-behind win over Brighton and Hove Albion. Manchester City were shocked by Bournemouth while Arsenal lost 0-1 at Newcastle United on Saturday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-england-score-2nd-odi-liam-livingstone-hundred-record-chase-2627215-2024-11-03",
      "headline": "2nd ODi: Captain Liam Livingstone scripts England's record chase in West Indies West Indies (WI) vs England (ENG), 2nd ODI: Liam Livingstone hit his maiden ODI hundred to help England script a record chase in Antigua and level the three-match series. Shai Hope's hundred for the West Indies went in vain. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-a-tour-of-australia-ishan-kishan-umpire-ball-tampering-mackay-unofficial-test-2627212-2024-11-03",
      "headline": "Ishan Kishan warned for arguing with umpire amid ball-tampering allegationsIndia A tour of Australia: The start of play on the final day of the first unofficial Test between India A and Australia A in Mackay was delayed after the umpires accused Indian players of scratching the ball. Ishan Kishan irked an on-field umpire with his remarks that were caught on the stump mic. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-reveals-his-fiery-mantra-while-facing-australia-need-to-elevate-2627176-2024-11-02",
      "headline": "Virat Kohli reveals his 'fiery' mantra while facing Australia: Need to elevate Virat Kohli revealed his 'fiery' mantra for always being so up-beat and charged up while facing a team like Australia. In 25 Test matches against Australia, Kohli has scored 2,042 runs at an average of 47.48, with eight hundreds."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-new-zealand-3rd-test-day-2-ajaz-patel-press-conference-2627173-2024-11-02",
      "headline": "Mumbai pitch turning from both ends: Ajaz Patel warns IndiaNew Zealand spinner Ajaz Patel feels that batting will be quite tough on the Day 3 Mumbai pitch. Patel argued that the pitch will turn into a rank turner giving the NZ spinners confidence to defend their target.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ajaz-patel-warns-india-about-mumbai-pitch-batting-will-be-hard-on-day-3-2627171-2024-11-02",
      "headline": "Ajaz Patel warns India about Mumbai pitch: Batting will be hard on Day 3New Zealand spinner Ajaz Patel feels that batting will be quite tough on the Day 3 Mumbai pitch. Patel argued that the pitch will turn into a rank turner giving the NZ spinners confidence to defend their target.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shai-hope-brings-up-17th-odi-hundred-joins-an-elite-list-of-west-indies-stars-2627159-2024-11-02",
      "headline": "Shai Hope brings up 17th ODI hundred, joins an elite list of West Indies starsShai Hope scored his 17th ODI hundred as he became the joint third-highest centurion for West Indies in the format. He led West Indies from the front as they racked up 328 runs vs England in the 1st ODI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-reveals-his-fiery-mantra-while-facing-australia-need-to-elevate-2627176-2024-11-02",
      "headline": "Virat Kohli reveals his 'fiery' mantra while facing Australia: Need to elevate Virat Kohli revealed his 'fiery' mantra for always being so up-beat and charged up while facing a team like Australia. In 25 Test matches against Australia, Kohli has scored 2,042 runs at an average of 47.48, with eight hundreds."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-new-zealand-3rd-test-day-2-ajaz-patel-press-conference-2627173-2024-11-02",
      "headline": "Mumbai pitch turning from both ends: Ajaz Patel warns IndiaNew Zealand spinner Ajaz Patel feels that batting will be quite tough on the Day 3 Mumbai pitch. Patel argued that the pitch will turn into a rank turner giving the NZ spinners confidence to defend their target.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ajaz-patel-warns-india-about-mumbai-pitch-batting-will-be-hard-on-day-3-2627171-2024-11-02",
      "headline": "Ajaz Patel warns India about Mumbai pitch: Batting will be hard on Day 3New Zealand spinner Ajaz Patel feels that batting will be quite tough on the Day 3 Mumbai pitch. Patel argued that the pitch will turn into a rank turner giving the NZ spinners confidence to defend their target.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shai-hope-brings-up-17th-odi-hundred-joins-an-elite-list-of-west-indies-stars-2627159-2024-11-02",
      "headline": "Shai Hope brings up 17th ODI hundred, joins an elite list of West Indies starsShai Hope scored his 17th ODI hundred as he became the joint third-highest centurion for West Indies in the format. He led West Indies from the front as they racked up 328 runs vs England in the 1st ODI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-really-cares-about-test-cricket-manjrekar-lauds-batters-grit-2627151-2024-11-02",
      "headline": "Shubman Gill really cares about Test cricket: Manjrekar lauds batter's gritFormer India cricketer Sanjay Manjrekar lauded Shubman Gill for caring about Test cricket. Manjrekar said that Gill, despite being a new-age star showed incredible grit to stay on on the tricky Mumbai pitch on Day 2 of the Mumbai Test.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-mukesh-kumar-repairs-pitch-during-australia-a-vs-india-a-at-mackay-2627148-2024-11-02",
      "headline": "Watch: Mukesh Kumar repairs pitch during Australia-A vs India-A at MackayMukesh Kumar's heartfelt gesture towards the grounds staff highlighted cricket's spirit of camaraderie in the India A vs. Australia A Test. His six-wicket haul and India's resilience set a strong tone, making the match a true battle of grit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/would-have-loved-to-stay-but-kkr-had-great-retention-venkatesh-iyer-2627136-2024-11-02",
      "headline": "Would have loved to stay but KKR had great retention: Venkatesh IyerKolkata Knight Riders batter Venkatesh Iyer said that he would have loved to stay with the franchise in 2025. KKR opted to retain Rinku Singh, Sunil Narine, Andre Russell, Varun Chakravarthy, Harshit Rana and Ramandeep Singh.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-manager-ruud-van-nistelrooy-set-for-premier-league-debut-vs-chelsea-2627123-2024-11-02",
      "headline": "Ruud van Nistelrooy set for Premier League debut vs ChelseaLegendary Manchester United striker Ruud van Nistelrooy will make his Premier League managerial debut on Sunday when the Red Devils host Chelsea at Old Trafford. The former player will coach 3 games before Rueben Amorim takes over the team."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}