{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/6-indian-firms-sanctioned-by-us-all-you-need-to-know-2764015-2025-07-31",
      "headline": "Who are the 6 Indian firms sanctioned by the US and what's at stake?Six Indian firms have been sanctioned by the US for allegedly importing Iranian petrochemicals. Here's all you need to know about them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-u-now-open-update-your-past-itr-mistakes-for-ay-2021-22-and-2022-23-2764013-2025-07-31",
      "headline": "ITR-U now open: Update your past ITR mistakes for AY 2021-22 and 2022-23The Income Tax Department has now made it possible to file updated returns (ITR-U) for Assessment Years (AY) 2021-22 and 2022-23 using the ITR-1 and ITR-2 forms. This move aims to help people fix any errors or income details they may have missed earlier."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-india-trade-deal-25-percent-tariff-which-sectors-most-impacted-gems-jewellery-2764005-2025-07-31",
      "headline": "Trump's 25% tariffs: Which sectors should brace for impact?US President Donald Trump announced a 25% tariff on Indian exports starting August 1.  An additional penalty was also announced for India's continued oil purchases from Russia, which has added more uncertainty for businesses."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/donald-trump-us-tariff-dual-hit-for-india-economy-stock-market-exporters-investors-2763992-2025-07-31",
      "headline": "Explained: Why Trump's 25% tariff is a double whammy for IndiaThe move comes at a time when Indian exports are already under pressure and global demand remains uneven. It also marks a sharp deterioration in bilateral negotiations that had, until recently, appeared to be progressing toward a limited trade understanding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-down-today-stock-market-fall-why-reasons-us-tariff-it-shares-ril-adani-port-decline-2763979-2025-07-31",
      "headline": "Sensex falls 500 points: Why is stock market down todayHeavyweight stocks fell in early trade. The S&P BSE Sensex fell over 575 points in early trade to 80,907.34, while the NSE Nifty50 dropped 185 points to 24,670.15 by 10 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-india-tariff-king-hypocrisy-donald-trump-american-duties-up-to-350-percent-2763962-2025-07-31",
      "headline": "US calls India the 'tariff king'. But its own duties go as high as 350%Donald Trump has called India tariff king, but the U.S. quietly charges 350% on milk, tobacco, and fruit.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-590-points-lower-nifty-below-24700-ril-shares-fall-2-percent-2763938-2025-07-31",
      "headline": "Sensex opens 590 points lower, Nifty below 24,700; RIL shares fall 2%The S&P BSE Sensex lost 536.92 points to 80,944.94, while the NSE Nifty50 lost 156.35 points to 24,698.70 as of 9:26 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-25-percent-tariff-india-us-trade-deal-not-confirmed-why-reason-dairy-agriculture-sector-import-duty-2763923-2025-07-31",
      "headline": "Trump announces 25% tariff: Why India and US still don't have a trade dealDespite several rounds of talks, the two nations have not managed to bridge key differences. Speaking at a press conference at the White House, Trump said that India remains one of the highest tariff-imposing countries in the world, but discussions are underway."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bse-nse-trading-setup-us-tariff-fed-rate-cut-sensex-nifty-today-2763912-2025-07-31",
      "headline": "US imposes 25% tariff on India. Will Sensex, Nifty crash today?The GIFT Nifty futures, which reflect early cues for the market, were trading 179 points lower at 24,675, down 0.73%, signalling a weak start for Dalal Street."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-imposes-25-percent-trump-tariff-on-india-what-it-means-for-exports-and-key-sectors-2763759-2025-07-30",
      "headline": "US imposes 25% tariff on India: What it means for exports and key sectorsThe newly announced duties target several of India's top-performing export sectors, like auto components, steel, aluminum, smartphones, gems and jewellery. Pharmaceuticals, semiconductors, and critical minerals, however, have been excluded."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-the-subscription-lifestyle-is-fuelling-a-new-wave-of-debt-emi-bpnl-schemes-2763577-2025-07-30",
      "headline": "How the subscription lifestyle is fuelling a new wave of debtFrom entertainment and food to wellness and shopping, subscription models are everywhere. While they promise convenience, they're also leading many into silent debt traps, especially the younger, digital-savvy crowd."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-ends-highe-lt-shares-rise-4-percent-india-us-trade-deal-2763608-2025-07-30",
      "headline": "Sensex closes 144 points higher, Nifty above 24,800; L&T up 4%The S&P BSE Sensex gained 143.91 points to close at 81,481.86, while the NSE Nifty50 added 33.95 points to end at 24,855.05. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-box-office-collection-day-13-detailed-report-rs-300-crore-a-cakewalk-for-ahaan-panday-film-now-2764009-2025-07-31",
      "headline": "Saiyaara box office Day 13: Rs 300 crore a cakewalk for Ahaan Panday's film nowYRF's 'Saiyaara' is moving towards the Rs 300 crore club. The Mohit Suri-directorial is in its third weekend, and it will now face 'Son of Sardaar 2' and 'Dhadak 2' at the box office. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/india-live-concert-economy-jobs-growth-tier-2-cities-travis-scott-coldplay-economic-impact-2763976-2025-07-31",
      "headline": "Coldplay to Travis Scott: Indian concerts may create 12 million jobs; are we ready?India's live concert economy is rapidly expanding, projected to create 12 million jobs by 2032. This growth highlights opportunities in tier 2 and 3 cities but also underscores skill shortages needing urgent attention."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karisma-kapoor-arrives-in-delhi-with-children-amid-ex-husbands-property-feud-2763984-2025-07-31",
      "headline": "Karisma in Delhi with children amid Sanjay Kapur's Rs 30,000 crore estate battleActor Karisma Kapoor arrived in Delhi with her children, Kiaan and Samaira, amid her late ex-husband Sunjay Kapur's property feud. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kerala-rapper-vedan-faces-sexual-assault-case-false-promise-of-marriage-doctor-woman-hirandas-murali-2763965-2025-07-31",
      "headline": "Kerala Rapper Vedan faces sexual assault case over false promise of marriageA sexual harassment case has been registered against Kerala rapper Vedan involving allegations of a false promise of marriage. He was previously arrested in a drug-related case.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/head-over-heels-k-drama-young-love-mythology-prime-video-2025-2763946-2025-07-31",
      "headline": "Head Over Heels review: Choo Young Woo, Cho Yi-hyun shine in wholesome K-drama'Head Over Heels' is a fresh K-drama blending young love with Korean mythology. The series delivers a heartfelt story with strong performances, available on Prime Video India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-sethupathi-slams-sexual-harassment-claims-takes-legal-action-2763944-2025-07-31",
      "headline": "Vijay Sethupathi slams filthy sexual harassment claims, takes legal actionActor Vijay Sethupathi has finally spoken out regarding serious casting couch allegations made against him by a woman on social media.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nick-jonas-priyanka-chopra-july-photo-dump-malti-video-games-broadway-2763918-2025-07-31",
      "headline": "In Nick- Priyanka's July, beach, broadway, and Malti stealing spotlightOn July 31, Nick Jonas shared heartfelt moments from July with Priyanka Chopra and Malti on social media.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-ruth-prabhu-raj-nidimoru-relationship-rumours-mumbai-viral-2763909-2025-07-31",
      "headline": "Raj Nidimoru miffed at paps after casual dinner date with Samantha in Mumbai. PicsActor Samantha Ruth Prabhu and director Raj Nidimoru stepped out on a dinner date in Mumbai amid relationship rumours. Neither has confirmed their relationship status despite public interest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kingdom-x-review-vijay-deverakonda-career-best-act-in-emotional-2763907-2025-07-31",
      "headline": "Kingdom X review: Vijay Deverakonda delivers career-best act in emotional filmVijay Deverakonda's 'Kingdom' released on July 31 amid massive anticipation. Internet users on X, who caught the early shows, called it one of his best performances in his career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/zootopia-2-trailer-nick-judy-attend-couple-counselling-giant-snake-chase-walt-disney-animation-2763844-2025-07-30",
      "headline": "Zootopia 2 trailer: Nick, Judy attend couple counselling amid giant snake chaseZootopia 2 trailer: Rookie cops Nick and Judy seek couple counselling while solving a mysterious case of a giant snake on the leash. The upcoming animation film is scheduled for a theatrical release on November 28."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jamie-lee-curtis-slams-ai-filters-plastic-surgery-genocide-of-natural-beauty-2763786-2025-07-30",
      "headline": "Jamie Lee Curtis says plastic surgery has led to genocide of women, slams AI filtersActor Jamie Lee Curtis called plastic surgery a 'genocide' of natural beauty. She also warned against AI filters as they worsen unrealistic beauty standards for women."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ozzy-osbourne-funeral-birmingham-wife-sharon-moved-to-tears-thousands-pay-tribute-black-sabbath-legend-2763753-2025-07-30",
      "headline": "Sharon Orbourne moved to tears at Ozzy Osbourne's funeral procession in BirminghamOzzy Osbourne was laid to rest in his hometown of Birmingham today. The funeral saw thousands of fans and family paying emotional tribute to the Black Sabbath frontman."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/indira-krishnan-opens-up-on-casting-couch-says-she-lost-big-projects-for-saying-no-2763768-2025-07-30",
      "headline": "Ramayana actor Indira Krishnan on casting couch: Lost big projects for saying noActor Indira Krishnan opened up about facing casting couch experiences, especially in the South film industry, revealing she lost major roles for refusing inappropriate demands. She said these incidents led her to shift focus to television, where she found more respect and better opportunities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/anasuya-bharadwaj-shuts-down-trolls-questioning-fashion-choices-with-grace-and-grit-2763748-2025-07-30",
      "headline": "Pushpa actor Anasuya Bharadwaj shuts down trolls questioning her fashion choicesAnasuya Bharadwaj addressed social media criticism about her fashion choices as a mother, promoting acceptance and respect for individuality. She shared a lengthy note on social media, discussing choices and values. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/tanishk-bagchi-was-taking-depresssion-medication-while-composing-saiyaara-title-track-2763743-2025-07-30",
      "headline": "Tanishk Bagchi reveals he battled depression while composing Saiyaara songMusic composer Tanishk Bagchi was depressed while creating the title track of 'Saiyaara'. In an interview, he opened up about his struggle with mental health and being on medication during its composition. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/s-line-kdrama-review-bold-premise-weak-execution-2763757-2025-07-30",
      "headline": "S Line review: Bold and riveting K-drama premise that trips over its own threadsRelease Date:Fri Jul 11, 2025S Line K-drama review: The series offers a bold and provocative premise with a unique visible red line concept. However, inconsistent storytelling and pacing undermine its potential impact."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mohit-suri-shares-story-of-ahaan-panday-shelved-debut-film-before-saiyaara-2763690-2025-07-30",
      "headline": "Mohit Suri shares story of Ahaan Panday's shelved debut film before SaiyaaraDirector Mohit Suri shared that Ahaan Panday was originally set to debut in a different film, which got shelved after the pandemic, leaving him heartbroken. Despite the setback, Ahaan remained hopeful and made a successful debut with YRF's 'Saiyaara'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mrunal-thakur-gets-a-pre-birthday-surprise-on-dacoit-sets-adivi-sesh-shares-video-2763713-2025-07-30",
      "headline": "Mrunal Thakur gets a pre-birthday surprise on Dacoit sets, Adivi Sesh shares videoActor Mrunal Thakur, who turns 33 on July 31, was surprised with an early birthday celebration by the cast and crew of her upcoming film 'Dacoit'. Co-star Adivi Sesh shared a glimpse of the celebration on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/farah-khan-takes-her-cook-dilip-to-maldives-begins-new-travel-vlog-series-2763723-2025-07-30",
      "headline": "Farah Khan takes her cook Dilip to Maldives, begins new travel vlog seriesFarah Khan has started a fun travel vlog with her cook Dilip. She took Dilip on his first international trip to the Maldives. In her latest vlog, they were seen enjoying local food. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/no-proof-col-purohit-made-bomb-pragya-thakur-owned-bike-used-in-malegaon-blast-judge-while-reading-verdict-2764008-2025-07-31",
      "headline": "All acquitted in Malegaon blast case, court says no proof Pragya Thakur owned bikeMalegaon blasts verdict: The blasts in Malegaon killed six people and injured over 100. Seventeen years later, all the seven accused have been acquitted."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/2008-malegaon-blast-case-verdict-court-says-acted-on-mere-suspicion-acquits-all-accused-pragya-thakur-2764018-2025-07-31",
      "headline": "Acted on mere suspicion: Court takes apart prosecution's Malegaon blasts caseDelivering the much-awaited verdict, Special Judge AK Lahoti said the prosecution had failed to prove the charges beyond reasonable doubt. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/can-take-their-dead-economies-down-together-trump-hits-out-at-india-russia-2763955-2025-07-31",
      "headline": "Can take their dead economies down together: Trump hits out at India, RussiaIn a fiery post on Truth Social, Trump doubled down on his long-standing gripe over India's trade practices, accusing the country of levying \"among the highest tariffs in the world\" and blaming New Delhi for what he claimed was \"very little business\" between the two nations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-5th-test-prediction-team-news-lords-pitch-playing-xi-2763845-2025-07-31",
      "headline": "ENG vs IND 5th Test: Can riled-up India land final punch to square series?Having secured a draw in Manchester, India have a great chance to level the series at the Oval against a depleted England side. Shubman Gill and his men have batted and bowled out of their skins time and again in the series so far, and now have a chance to punch above their weight in the finale."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-india-returned-haji-pir-pass-pakistan-after-capturing-1965-pm-modi-congress-explained-2763676-2025-07-31",
      "headline": "Why India returned Haji Pir Pass to Pakistan after capturing it in 1965India captured the Haji Pir Pass in 1965 in a big military achievement, but returned it to Pakistan just months later under the Tashkent Agreement. Critics argue that the move compromised long-term security in Kashmir. But why did India give control of Haji Pir Pass to Pakistan despite wresting the strategic site from it?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-india-tariff-king-hypocrisy-donald-trump-american-duties-up-to-350-percent-2763962-2025-07-31",
      "headline": "US calls India the 'tariff king'. But its own duties go as high as 350%Donald Trump has called India tariff king, but the U.S. quietly charges 350% on milk, tobacco, and fruit.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/f-35-fighter-jet-crashes-in-naval-airbase-in-california-visuals-show-plume-of-smoke-report-2763959-2025-07-31",
      "headline": "F-35 fighter jet crashes at California naval base, pilot ejects safelyAn F-35C fighter jet crashed near Naval Air Station Lemoore in California; the pilot ejected safely and no injuries were reported. The incident occurred during a training flight and is under investigation.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/jat-conundrum-jagdeep-dhankars-exit-bares-bjps-struggle-with-community-2763641-2025-07-30",
      "headline": "Jat conundrum: Jagdeep Dhankar's exit bares BJP's struggle with communityEngineering a Jat breakthrough for long, the BJP has instead built a fragile edifice of borrowed faces and paper alliances, just one defection or protest away from collapse"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/private-school-fees-rise-169-percent-impact-middle-class-families-india-2764003-2025-07-31",
      "headline": "From dual incomes to debt: The silent struggle of parents paying private school feesMiddle-class Indian families struggle with sharply rising private school fees and related lifestyle changes. Despite existing fee regulations, poor enforcement leaves parents bearing heavy financial and emotional costs."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/donald-trump-us-tariff-dual-hit-for-india-economy-stock-market-exporters-investors-2763992-2025-07-31",
      "headline": "Explained: Why Trump's 25% tariff is a double whammy for IndiaThe move comes at a time when Indian exports are already under pressure and global demand remains uneven. It also marks a sharp deterioration in bilateral negotiations that had, until recently, appeared to be progressing toward a limited trade understanding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/samajwadi-party-mp-jaya-bachchans-dig-at-writer-behind-pahalgam-op-name-says-sindoor-toh-ujad-gaya-2763939-2025-07-31",
      "headline": "Jaya Bachchan's dig at writer behind Pahalgam op name: Sindoor toh ujad gayaParticipating in a debate on the Pahalgam attack and the subsequent military operation in the upper house, Jaya Bachchan began her remarks by expressing condolences to the families of the 26 people killed in the Baisaran Valley in Jammu and Kashmir on April 22."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/the-lowdown/story/donald-trump-us-tariffs-what-it-means-for-india-exports-trade-deal-2763913-2025-07-31",
      "headline": "Trump's 25% tariff on India, and what it means nextIn a shock move that rattled both diplomacy and markets, the US announced a sweeping 25% tariff on all Indian exports starting August 1, 2025. How did this happen? What's behind such a drastic step? And where do things go from here? We answer all your questions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/travel/story/beyond-raves-and-speakeasy-bars-how-delhis-past-is-redefining-night-tourism-2762561-2025-07-31",
      "headline": "Beyond raves and speakeasies, Delhi's past is redefining nightlifeDelhi after dark is not just coffee raves or pubs. Its historic allure is slowly reviving night tourism with lit-up tombs, museums and light and sound shows. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/actor-khushbu-sundar-appointed-bjp-tamil-nadu-vice-president-urges-tvk-vijay-to-join-bjp-aiadmk-alliance-2763756-2025-07-30",
      "headline": "Khushbu Sundar becomes BJP Tamil Nadu Vice-President, urges actor Vijay to allyActor-politician Khushbu Sundar has been appointed BJP Vice-President in Tamil Nadu. She aims to boost grassroots outreach and has urged actor Vijay's party to join the BJP-AIADMK alliance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/donald-trump-tariffs-india-riskier-being-us-friend-than-rival-opinion-2763925-2025-07-31",
      "headline": "The Trumpian paradox: For India, its riskier being his friend than rivalTrump threw a curveball at India by announcing a 25% tariff on merchandise exports plus an undisclosed penalty. On the other hand, Trump keeps extending the deadline for China, a noted adversary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/potholes-nhai-delhi-blamegame-pwd-viral-video-social-media-irony-memes-2763941-2025-07-31",
      "headline": "Video shows potholes near highways office, internet sees through the cracksAs the video of the poor road conditions outside the country's top highways authority went viral, the NHAI reacted swiftly and blamed the Delhi PWD for it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/isro-will-unfold-nisars-origami-antenna-in-space-explained-in-graphics-2763742-2025-07-31",
      "headline": "Isro will unfold Nisar's origami antenna in space: Explained in graphicsAll eyes are on the commissioning phase of the mission, which will begin with the unfolding of the antenna that had been folded for launch. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-rahul-gandhi-armed-forces-operational-freedom-pakistan-war-narendra-modi-lok-sabha-debate-analysis-2763589-2025-07-30",
      "headline": "That's democracy, RahulThe issue of operational freedom to Indian forces came up during a debate on Operation Sindoor in Parliament. The Indian armed forces, unlike Pakistan's, work in a democratic country, where an elected civilian leadership is answerable to the people."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/maybe-theyll-sell-to-india-trump-finalise-trade-deal-with-pakistan-to-develop-massive-oil-reserves-glbs-2763875-2025-07-31",
      "headline": "Maybe they'll sell to India: Trump strikes trade deal, oil partnership with PakDonald Trump announced a new US-Pakistan oil trade deal, hinting it could pave the way for future exports to India. The move follows Trump's declaration of a 25% tariff and extra penalties on goods imported from India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/microsoft-study-reveals-40-jobs-most-likely-to-be-transformed-by-chatbots-2763961-2025-07-31",
      "headline": "Is your job safe? Microsoft lists 40 professions chatbots could replaceGenerative AI is rapidly reshaping the world of work, and a new Microsoft study reveals which jobs are most at risk. Is your profession on the list?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/karnataka-railway-clerk-chats-on-call-ignores-queue-suspended-after-video-viral-2763755-2025-07-30",
      "headline": "Karnataka railway clerk chats on call, ignores queue, suspended as video goes viralA railway clerk from Karnataka has been suspended after a viral video showed him ignoring a long queue to take a personal call while on duty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/not-to-punish-us-sanctions-hit-indian-firms-over-iran-oil-trade-glbs-2763890-2025-07-31",
      "headline": "6 Indian companies among those sanctioned by US over Iran oil tradeThe US sanctioned global companies, including several from India, for allegedly trafficking Iranian oil and petrochemicals, targeting illicit shipping networks. Sanctions freeze assets and prohibit US dealings to curb Iran's destabilising activities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kingdom-x-review-vijay-deverakonda-career-best-act-in-emotional-2763907-2025-07-31",
      "headline": "Kingdom X review: Vijay Deverakonda delivers career-best act in emotional filmVijay Deverakonda's 'Kingdom' released on July 31 amid massive anticipation. Internet users on X, who caught the early shows, called it one of his best performances in his career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/parliament-monsoon-session-live-us-tariffs-bihar-roll-revision-to-dominate-house-proceedings-today-2763975-2025-07-31",
      "headline": "Live: Rajya Sabha proceedings begin after adjournmentWith Parliament bracing for another stormy day, the Centre is likely to come under fire over two escalating flashpoints: the ongoing row over the Bihar Special Intensive Revision, and a fresh blow from Washington - a 25 per cent tariff on Indian goods announced by US President Donald Trump. The Opposition, which has already been disrupting proceedings demanding a debate on the Bihar issue, is expected to sharpen its attack on the government over its failure to clinch a trade deal with the US. The Opposition has pointed to the Prime Minister's repeated praise for his \"friend\" Donald Trump, questioning what that friendship has delivered amid rising economic pressure from Washington. India, in response, has said it remains committed to a fair and mutually beneficial trade agreement with the US - but emphasised that it would take all necessary steps to protect its farmers, MSMEs, and domestic entrepreneurs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-box-office-collection-day-13-detailed-report-rs-300-crore-a-cakewalk-for-ahaan-panday-film-now-2764009-2025-07-31",
      "headline": "Saiyaara box office Day 13: Rs 300 crore a cakewalk for Ahaan Panday's film nowYRF's 'Saiyaara' is moving towards the Rs 300 crore club. The Mohit Suri-directorial is in its third weekend, and it will now face 'Son of Sardaar 2' and 'Dhadak 2' at the box office. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karisma-kapoor-arrives-in-delhi-with-children-amid-ex-husbands-property-feud-2763984-2025-07-31",
      "headline": "Karisma in Delhi with children amid Sanjay Kapur's Rs 30,000 crore estate battleActor Karisma Kapoor arrived in Delhi with her children, Kiaan and Samaira, amid her late ex-husband Sunjay Kapur's property feud. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kerala-rapper-vedan-faces-sexual-assault-case-false-promise-of-marriage-doctor-woman-hirandas-murali-2763965-2025-07-31",
      "headline": "Kerala Rapper Vedan faces sexual assault case over false promise of marriageA sexual harassment case has been registered against Kerala rapper Vedan involving allegations of a false promise of marriage. He was previously arrested in a drug-related case.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-sethupathi-slams-sexual-harassment-claims-takes-legal-action-2763944-2025-07-31",
      "headline": "Vijay Sethupathi slams filthy sexual harassment claims, takes legal actionActor Vijay Sethupathi has finally spoken out regarding serious casting couch allegations made against him by a woman on social media.\r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/brad-haddin-criticises-england-approach-vs-india-old-trafford-test-2764017-2025-07-31",
      "headline": "Brad Haddin slams England for Manchester Day 5 drama: I liked what India didFormer Australia wicketkeeper Brad Haddin has taken a swipe at England for their conduct during the closing stages of the fourth Test in Manchester, accusing Ben Stokes' side of attempting to call off the match prematurely once a win was no longer possible."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-dhruv-jurel-ms-dhoni-meme-london-2764016-2025-07-31",
      "headline": "Wicketkeeping first: Dhruv Jurel reacts to MS Dhoni meme ahead of Oval TestDhruv Jurel opened up on the memes he got after just being asked to do the wicketkeeper's job in the ongoing series against England. Jurel played the last two games as a substitute wicketkeeper and didn't get a chance to bat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-spinner-final-test-selection-debate-aakash-chopra-anderson-tendulkar-trophy-2764006-2025-07-31",
      "headline": " Aakash Chopra slams England's spin bowling choices for Oval TestAakash Chopra has questioned England's decision to enter the final Test of the Anderson-Tendulkar Trophy without a specialist spinner, calling it a surprising move ahead of a high-stakes decider. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/ruben-amorim-reaction-manchester-united-transfer-plans-benjamin-sesko-links-2764001-2025-07-31",
      "headline": "Ruben Amorim remains coy on Manchester United transfer plans, Sesko linksManchester United manager Ruben Amorim remained coy about potential transfer activity and links to Benjamin Sesko following his side's dominant 4-1 win over Bournemouth in the Premier League Summer Series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-divya-deshmukh-nagpur-return-world-cup-win-2763985-2025-07-31",
      "headline": "Divya Deshmukh gets grand reception after World Cup win, credits family for triumphDivya Deshmukh was overwhelmed as she received a grand welcome from her hometown of Nagpur on Wednesday, July 31 after her Women's World Cup win in Georgia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ben-stokes-shubman-gill-question-scheduling-gap-england-vs-india-test-series-2763970-2025-07-31",
      "headline": "Stokes, Gill question short 3-day gap between Tests in 5-match seriesBen Stokes and Shubman Gill on Wednesday called for longer gaps between matches, stating that a three-day break is too short for a five-Test series like the ongoing one, especially given the heavy workload on the bowlers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-oval-test-gautam-gambhir-india-ready-post-rohit-kohli-era-2763856-2025-07-31",
      "headline": "Oval Test: Gambhir's chance to show India's ready for post-Rohit-Kohli eraThe Oval Test presents Gautam Gambhir with a golden opportunity to prove he's the right man to lead India's next-gen Test team in the post-Rohit-Kohli era. With the series on the line, this could well be his defining red-ball moment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/football-fever-returns-imphal-trau-fc-neroca-fc-clash-durand-cup-opener-2763945-2025-07-31",
      "headline": "Football fever returns to Imphal as TRAU FC, NEROCA clash in Durand Cup openerNEROCA FC snatched a dramatic 1-1 draw against 10-man TRAU FC in their Group E opener at the 134th IndianOil Durand Cup in Imphal on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-u19-tour-of-australia-squad-announced-schedule-ayush-mhatre-vaibhav-suryavanshi-2763942-2025-07-31",
      "headline": "Mhatre to lead, Suryavanshi retained as India announce U19 squad for AUS tourAyush Mhatre will captain the India U19 side on their Australia tour starting September. The squad retains core players from the England tour, aiming to build on recent successes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-last-assist-helps-inter-miami-beat-atlas-2-1-in-league-cup-2763933-2025-07-31",
      "headline": "Messi's late assist helps Inter Miami beat Atlas 2-1 in Leagues Cup openerLionel Messi provided assists for both of Inter Miami's goals, including the stoppage-time winner, as the Herons edged past Atlas 2-1 in their Leagues Cup group-stage opener on Wednesday in Fort Lauderdale, Florida."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-gautam-gambhir-spat-indian-team-riled-up-2763724-2025-07-31",
      "headline": "Don't rile up India! When teams learned it hard way after going at Indian teamWhen riled up, India tends to answer back with a bit of spice and some great wins. The message is pretty clear when it comes to the Indian cricket team. Don't rile them up as they can hit back with a strong answer. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-oval-test-gautam-gambhir-india-ready-post-rohit-kohli-era-2763856-2025-07-31",
      "headline": "Oval Test: Gambhir's chance to show India's ready for post-Rohit-Kohli eraThe Oval Test presents Gautam Gambhir with a golden opportunity to prove he's the right man to lead India's next-gen Test team in the post-Rohit-Kohli era. With the series on the line, this could well be his defining red-ball moment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/football-fever-returns-imphal-trau-fc-neroca-fc-clash-durand-cup-opener-2763945-2025-07-31",
      "headline": "Football fever returns to Imphal as TRAU FC, NEROCA clash in Durand Cup openerNEROCA FC snatched a dramatic 1-1 draw against 10-man TRAU FC in their Group E opener at the 134th IndianOil Durand Cup in Imphal on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-u19-tour-of-australia-squad-announced-schedule-ayush-mhatre-vaibhav-suryavanshi-2763942-2025-07-31",
      "headline": "Mhatre to lead, Suryavanshi retained as India announce U19 squad for AUS tourAyush Mhatre will captain the India U19 side on their Australia tour starting September. The squad retains core players from the England tour, aiming to build on recent successes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-last-assist-helps-inter-miami-beat-atlas-2-1-in-league-cup-2763933-2025-07-31",
      "headline": "Messi's late assist helps Inter Miami beat Atlas 2-1 in Leagues Cup openerLionel Messi provided assists for both of Inter Miami's goals, including the stoppage-time winner, as the Herons edged past Atlas 2-1 in their Leagues Cup group-stage opener on Wednesday in Fort Lauderdale, Florida."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-gautam-gambhir-spat-indian-team-riled-up-2763724-2025-07-31",
      "headline": "Don't rile up India! When teams learned it hard way after going at Indian teamWhen riled up, India tends to answer back with a bit of spice and some great wins. The message is pretty clear when it comes to the Indian cricket team. Don't rile them up as they can hit back with a strong answer. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}