{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/personal-loan-for-wedding-why-borrowing-for-the-big-day-needs-rethinking-wedding-budget-planning-wedding-loan-interest-rates-2765508-2025-08-03",
      "headline": "Personal loan for wedding? Why borrowing for the big day needs rethinkingA wedding is a beautiful milestone, but is it worth starting your new life under a mountain of debt? With the rising trend of using personal loans to fund lavish celebrations, it's time to rethink the cost of saying \"I do.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-donald-trump-25-percent-tariff-pressure-tactic-farm-dairy-2765184-2025-08-02",
      "headline": "Explained: Why India shouldn't lose sleep over Trump's 25% tariffsIndia shouldn't trade its future for short-term calm. Trump's tariff move is more noise than policy. Staying firm now will protect India's strength and choices in the long run."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-president-donald-trump-he-may-consider-giving-tariff-revenue-dividends-to-citizens-2765106-2025-08-02",
      "headline": "May consider dividends to citizens: Trump on tariff revenue disbursal plansTrump has signed a new executive order that imposes fresh import tariffs on goods from 69 countries and the European Union, which will come into effect on August 7."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/loan-fraud-case-ed-issues-lookout-notice-against-anil-ambani-2764968-2025-08-01",
      "headline": "Loan fraud case: ED issues lookout notice against Anil AmbaniA lookout circular has been issued against Anil Ambani at the request of the Enforcement Directorate (ED), preventing him from travelling abroad without court permission. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/lookout-notice-against-anil-ambani-in-alleged-rs-3000-crore-loan-fraud-case-2764939-2025-08-01",
      "headline": "Anil Ambani faces lookout notice in Rs 3,000-crore loan fraud caseAnil Ambani can now no longer travel outside India without court permission. This comes after a series of crackdowns on his business entities, allegations of fraud against his firms, and a summons issued by a federal agency."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vandana-vasudevan-on-how-tech-is-reshaping-daily-life-2764868-2025-08-01",
      "headline": "Vandana Vasudevan on how tech is reshaping daily lifeSpeaking with Business Today's Sakshi Batra, OTP Please author Vandana Vasudevan explains how this shift is changing daily routines."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/otp-please-the-double-edged-sword-of-digital-living-vandana-vasudevan-2764846-2025-08-01",
      "headline": "OTP Please! The double-edged sword of digital living: Vandana VasudevanSpeaking with Business Today's Sakshi Batra, OTP Please author Vandana Vasudevan tells how tech has changed how we live, making travel easier for the disabled, food more accessible, and work more flexible. But she warns of fading community bonds, unhealthy habits, and insecure gig jobs. Tech must support life, not replace human connection."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/us-tariffs-will-not-have-significant-adverse-impact-on-indian-economy-sources-2764783-2025-08-01",
      "headline": "US tariffs will not have significant adverse impact on Indian economy: SourcesThe 25% tariff announced by US President Donald Trump will not have a significant adverse impact on the Indian economy, government sources said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musk-starlink-monthly-plan-cost-spacex-telecom-satellite-launch-jyotiraditya-scindia-2764764-2025-08-01",
      "headline": "Elon Musk's Starlink to operate soon in India. Check monthly plansUnion Telecom Minister Jyotiraditya Scindia confirmed that Starlink has been awarded a Unified Licence to launch its satellite internet operations in India. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-586-points-lower-nifty-below-25600-infosys-ends-3-percent-down-2764795-2025-08-01",
      "headline": "Sensex closes 586 points lower, Nifty below 25,600; Infosys ends 3% downThe S&P BSE Sensex lost 585.67 points to close at 80,599.91, while the NSE Nifty50 was down by 203 points to end at 24,565.35. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/fd-tips-loss-emergency-fund-mistake-insurance-fund-personal-finance-money-saving-2764639-2025-08-01",
      "headline": "CA explains why you should not use FDs as an emergency fundAccording to RBI guidelines, banks can charge up to 0.5% to 1.0% of the interest rate as a penalty if FDs are broken before their maturity period."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/no-compromise-on-agriculture-dairy-farmers-interest-government-sources-on-us-tariff-2764724-2025-08-01",
      "headline": "Indian interests top priority, no chance of compromising due to US tariffs: SourcesAn official said that the government is closely watching the developments but sees no reason for alarm after the US imposed a 25% tariff on India. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/chalti-ka-naam-gaadi-madhubala-kishore-2765510-2025-08-03",
      "headline": "Chalti Ka Naam Gaadi: Madhubala and Kishore's defiant dance of joy amidst shadows'Chalti Ka Naam Gaadi' remains a beloved 1958 Bollywood classic starring Madhubala and Kishore Kumar. The film blends humour, music, and family values, reflecting the spirit of post-independence India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/tamannaah-bhatia-denies-rape-of-avantika-in-baahubali-the-beginning-2765492-2025-08-03",
      "headline": "Tamannaah denies rape of Avantika in Baahubali: It's finding herself through a manActor Tamannaah Bhatia, in an interview with The Lallantop, opened up about the controversial scene featuring her and Prabhas in 'Baahubali: The Beginning'. She explained the thought process behind the particular sequence and SS Rajamouli's vision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/son-of-sardaar-2-vs-dhadak-2-box-office-collection-day-2-ajay-devgn-film-leads-the-race-2765488-2025-08-03",
      "headline": "Son of Sardaar 2 vs Dhadak 2 box office Day 2: Ajay Devgn's film leads the race'Son of Sardaar 2' emerged as the audience's preferred choice over 'Dhadak 2' despite mixed reviews. Both films were released on Friday. The Ajay Devgn-starrer earned Rs 7.5 crore India nett, while the Siddhant Chaturvedi and Tripti Dimri film collected Rs 3.7 crore India nett on Day 2. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-full-speech-roasts-director-lokesh-kanagraj-self-deprecating-jones-coolie-audio-launch-2765456-2025-08-03",
      "headline": "Rajinikanth roasts Coolie director, his self-deprecating jokes win hearts at eventSuperstar Rajinikanth is known for his public speaking skills. At the 'Coolie' audio launch, he made everyone laugh out loud while appreciating and complimenting the cast and crew of the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/veteran-tamil-actor-madhan-bob-dies-after-cancer-battle-2765443-2025-08-03",
      "headline": "Veteran Tamil actor and comedian Madhan Bob dies at 71 after cancer battleMadhan Bob, renowned Tamil actor and comedian, died at 71 in Chennai. He was undergoing cancer treatment for the past few years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/gauri-khan-suhana-celebrate-shah-rukh-khan-rani-mukerjee-karan-johar-national-award-win-2765432-2025-08-03",
      "headline": "Gauri Khan, Suhana celebrate SRK, Rani and Karan Johar's National Award winShah Rukh Khan won his first National Award for his performance in 'Jawan'. His wife, Gauri Khan and daughter Suhana celebrated SRK, Rani Mukerji and Karan Johar's win at the 71st National Film Awards.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/fwice-warns-kartik-aaryan-over-pakistani-event-actor-denies-link-azadi-utsav-2765376-2025-08-02",
      "headline": "Film body warns Kartik Aaryan over event by Pakistani restaurant, actor denies linkActor Kartik Aaryan's team has clarified that he is not associated with the event organised by a Pakistani-owned restaurant. The response came after Federation of Western lndia Cine Employees (FWICE) warned him against the same."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/coolie-trailer-rajinikanth-kollywood-first-1000-crore-loading-2765359-2025-08-02",
      "headline": "Kollywood's 1st Rs 1,000 crore loading: Internet on Rajinikanth's Coolie trailerThe trailer of director Lokesh Kanagaraj's 'Coolie' has been released amid much anticipation. Social media users have predicted that the Rajinikanth-starrer could be Kollywood's first Rs 1,000 crore film. The film, featuring an ensemble cast, is set to release on August 14. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-entry-coolie-audio-launch-aamir-khan-hugs-nagarjuna-lokesh-kanagaraj-2765362-2025-08-02",
      "headline": "Coolie audio launch: Crowd erupts as Rajinikanth enters venue, Aamir Khan hugs himSuperstar Rajinikanth received a rousing welcome at the Nehru Indoor Stadium in Chennai on Saturday. He greeted the cast and crew and hugged them as he welcomed them for the event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/coolie-trailer-rajinikanth-smuggles-gold-with-style-in-this-action-thriller-2765234-2025-08-02",
      "headline": "Coolie trailer: Rajinikanth, Aamir Khan, Nagarjuna go all guns blazingThe trailer for 'Coolie', featuring superstar Rajinikanth, was unveiled in Chennai on Saturday. Directed by Lokesh Kanagaraj, the film revolves around a gold smuggler. The highly anticipated film will release on August 14 and clash with 'War 2' at the box office."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vaibhavi-merchant-wins-national-award-says-dhindora-baje-re-was-always-special-2765330-2025-08-02",
      "headline": "Vaibhavi Merchant wins National Award, says Dhindora Baje Re was always specialChoreographer Vaibhavi Merchant said the song 'Dhindora Baje Re' from 'Rocky Aur Rani Kii Prem Kahaani' was always special. She further expressed that winning the National Award for the song's choreography has infused a lot of life back into her work."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-coolie-poster-sparks-plagiarism-buzz-same-same-but-different-2765277-2025-08-02",
      "headline": "Same same but different: How Rajinikanth's Coolie poster sparks plagiarism buzzSocial media users have compared 'Coolie' posters to Hollywood films like 'Madame Web' and 'Glass'. The Rajinikanth-starrer is set for release on August 14, with its trailer launching today in Chennai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/abhishek-banerjee-aparshakti-khurana-and-varun-sharma-unite-for-imtiaz-ali-side-heroes-2765322-2025-08-02",
      "headline": "Abhishek Banerjee, Aparshakti, and Varun Sharma unite for Imtiaz Ali's Side HeroesA new film, 'Side Heroes', featuring actors Abhishek Banerjee, Aparshakti Khurana, and Varun Sharma, has been announced. The film is expected to release on Friendship Day 2026 and is backed by filmmaker Imtiaz Ali. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/the-kerala-story-director-sudipto-sen-breaks-silence-on-pinarayi-vijayan-national-award-criticism-for-film-reminds-him-of-pfi-threat-vs-achuthanandan-2765337-2025-08-02",
      "headline": "Watch film first: Kerala Story director on Pinarayi Vijayan's National Award criticism'The Kerala Story' director Sudipto Sen slammed Kerala Chief Minister Pinarayi Vijayan's remarks on the movie's National Award win, urging him to watch the film before passing judgment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/the-real-meaning-of-shah-rukh-khans-national-award-winning-speech-2765306-2025-08-02",
      "headline": "The real meaning of Shah Rukh Khan's National Award-winning speechFrom defending his reel son in 'Jawan' to standing tall for his real one, Shah Rukh Khan's National Award speech was more than gratitude. It was a statement. It was also a reminder that the King never left the throne - National Award or not. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kyunki-saas-bhi-kabhi-bahu-thi-reboot-episode-4-update-a-new-sanskaari-tulsi-enters-the-show-2765252-2025-08-02",
      "headline": "Kyunki Saas Bhi Kabhi Bahu Thi reboot Ep 4: A new sanskaari Tulsi enters the show Kyunki Saas Bhi Kabhi Bahu Thi reboot Episode 4: As Tulsi holds on to her ideals and the Tulsi plant in the middle of a storm, a new chapter begins - one that questions blood ties, justice, and what truly makes a mother."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/the-holiday-director-nancy-meyers-surprised-by-reports-of-limited-series-news-to-me-2765195-2025-08-02",
      "headline": "The Holiday director Nancy Meyers surprised by reports of limited series: News to me'The Holiday' director Nancy Meyers expressed surprise at reports of the romantic movie being reimagined for a limited series on Apple TV+. She said the development is news to her as well. The original film stars actors Cameron Diaz, Kate Winslet, Jude Law and Jack Black in key roles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/aadujeevitham-the-real-kerala-story-got-snubbed-at-the-national-awards-2765157-2025-08-02",
      "headline": "Aadujeevitham: How the real Kerala story got snubbed at the National AwardsPrithviraj Sukumaran and director Blessy's 'Aadujeevitham' aka 'The Goat Life' got snubbed at the National Film Awards, which were announced on August 1 in New Delhi. Many fans pointed out that it was a gross misjudgement by the jury.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/atlee-kamal-haasan-and-mohanlal-congratulate-shah-rukh-khan-and-other-national-award-winners-2765178-2025-08-02",
      "headline": "Atlee, Kamal Haasan, and Mohanlal congratulate SRK and other National Award winnersSouth Indian celebrities, including Atlee, Kamal Haasan, and Mohanlal, shared congratulatory messages to national award winners. Atlee, who directed Shah Rukh Khan's award-winning performance in 'Jawan', thanked the actor for giving him the opportunity to direct him. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/south/story/they-buried-her-like-dog-new-testimonies-in-dharmasthala-mass-burial-case-2765522-2025-08-03",
      "headline": "They buried her like dog: New testimonies in Dharmasthala mass burial caseRTI revelations exposing the deletion of death records by Belthangady police have triggered fresh allegations of illegal mass burials, with an eyewitness filing a formal complaint to the SIT. The case, linked to suspected cover-ups and destroyed evidence, may soon lead to exhumation and a full-scale investigation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/chidambaram-voter-addition-tamil-nadu-elections-bihar-sir-electoral-roll-revision-2765500-2025-08-03",
      "headline": "Amid Bihar roll revision, Chidambaram flags 6.5 lakh voter addition in Tamil NaduRajya Sabha MP P Chidambaram accused the Election Commission of trying to change the 'electoral character' of states."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/indian-origin-family-missing-road-trip-new-york-to-pennsylvania-burger-king-2765507-2025-08-03",
      "headline": "4 of Indian-origin family missing in US, last seen 5 days ago at Burger KingThe four senior citizens were last seen at a Burger King outlet in Pennsylvania on July 29. They were on their way to the Palace of Gold in Marshall County."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/video-mns-workers-raze-bar-in-midnight-action-after-raj-thackerays-fiery-speech-2765503-2025-08-03",
      "headline": "Video: MNS workers raze bar in midnight action after Raj Thackeray's fiery speechOver a dozen MNS workers stormed the Night Rider bar in Panvel late Saturday night, vandalising the premises with sticks and causing extensive damage. The incident came hours after Raj Thackeray criticised illegal bars in Raigad during a rally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/india-indigenous-bananas-vs-cavendish-native-varieties-climate-resilience-nutritional-benefits-chinia-kela-kerala-tamil-nadu-2765058-2025-08-03",
      "headline": "Can Indian bananas stop the invasion of colonial Cavendish?The British-origin Cavendish banana is invading markets across the world and has become the dominant variety sold everywhere. Even in India, Cavendish and its sub-varieties have gained territory, making native varieties like Bihar's Chinia and Assam's Bhimkol harder to spot. From Tamil Nadu to the Northeast, the native kadali phalams are putting up a tough fight. Will desi bananas be able to beat back the colonial Cavendish?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sadhvi-pragya-singh-thakur-bhopal-malegaon-blasts-case-congress-treason-saffron-terror-2765473-2025-08-03",
      "headline": "Malegaon case a Congress conspiracy: Sadhvi Pragya gets rousing welcome in BhopalSadhvi Pragya Singh Thakur, a resident of Madhya Pradesh, received a warm welcome as she arrived in Bhopal for the first time after being acquitted in the Malegaon blasts case. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jammu-and-kashmir-operation-akhal-terrorists-killed-pok-kulgam-pahalgam-attack-army-2765433-2025-08-03",
      "headline": "3 terrorists killed, soldier injured as Operation Akhal in J&K enters Day 3The encounter in the Akhal forest area of south Kashmir began on Friday when a joint team of the Jammu and Kashmir Police, Army and CRPF launched a cordon and search operation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/flipkart-freedom-sale-tablets-get-their-biggest-price-drop-of-the-year-2764360-2025-07-31",
      "headline": "Flipkart Freedom Sale: Tablets Get Their Biggest Price Drop of the YearFor buyers looking to invest in a new device, this could be the best chance before the festive season arrives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-biggest-chases-records-bazball-2765464-2025-08-03",
      "headline": "Can India defend 374 at The Oval to avoid a series defeat? Here's what history saysENG vs IND, 5th Test: India have set England a formidable target of 374 to win at The Oval in London. However, England have successfully chased down large targets against India in the past, which should give them some confidence."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/11-people-die-after-car-falls-into-canal-in-uttar-pradeshs-gonda-district-chief-minister-offers-condolences-2765499-2025-08-03",
      "headline": "11 die as car plunges into canal in UP's Gonda, Chief Minister offers condolencesA Bolero carrying 15 passengers lost control and plunged into a canal in Uttar Pradesh's Gonda district, leaving 11 dead."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/the-odisha-girl-who-was-allegedly-set-on-fire-by-three-unknown-men-dies-at-aiims-delhi-police-say-no-one-involved-2765395-2025-08-02",
      "headline": "Odisha girl, set 'ablaze' days ago, dies in Delhi. Then a twist from copsWhile the girl's mother alleged that three individuals were involved in setting her 15-year-old daughter on fire, the Odisha Police said their investigation found no evidence of involvement by anyone else in the incident."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shashi-tharoor-differs-with-rahul-gandhi-over-trumps-dead-economy-remarks-by-saying-that-he-has-his-reasons-2765377-2025-08-02",
      "headline": "He has his reasons: Shashi Tharoor differs with Rahul Gandhi over Trump's remarkCongress MP Shashi Tharoor has differed with party leader Rahul Gandhi over the latter's support for US President Donald Trump's 'dead economy' remark."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/chalti-ka-naam-gaadi-madhubala-kishore-2765510-2025-08-03",
      "headline": "Chalti Ka Naam Gaadi: Madhubala and Kishore's defiant dance of joy amidst shadows'Chalti Ka Naam Gaadi' remains a beloved 1958 Bollywood classic starring Madhubala and Kishore Kumar. The film blends humour, music, and family values, reflecting the spirit of post-independence India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/mumbai-local-borivali-station-viral-video-ticketless-passenger-destroys-computers-threatens-staff-2765495-2025-08-03",
      "headline": "Ticketless passenger destroys computers, threatens staff at Borivali station. Video goes viralA man without a ticket created chaos at Borivali station as he smashed computers and threatened staff. A video of the incident is now going viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/gauri-khan-suhana-celebrate-shah-rukh-khan-rani-mukerjee-karan-johar-national-award-win-2765432-2025-08-03",
      "headline": "Gauri Khan, Suhana celebrate SRK, Rani and Karan Johar's National Award winShah Rukh Khan won his first National Award for his performance in 'Jawan'. His wife, Gauri Khan and daughter Suhana celebrated SRK, Rani Mukerji and Karan Johar's win at the 71st National Film Awards.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-511-01-08-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/personal-loan-for-wedding-why-borrowing-for-the-big-day-needs-rethinking-wedding-budget-planning-wedding-loan-interest-rates-2765508-2025-08-03",
      "headline": "Personal loan for wedding? Why borrowing for the big day needs rethinkingA wedding is a beautiful milestone, but is it worth starting your new life under a mountain of debt? With the rising trend of using personal loans to fund lavish celebrations, it's time to rethink the cost of saying \"I do.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/ex-iitian-leaves-india-again-blames-reality-check-in-viral-post-sparks-debate-2765469-2025-08-03",
      "headline": "Ex-IITian says India's 'reality' made her go back to US. Viral post sparks debateDr Rajeshwari Iyer had returned to India, hoping to rebuild her life and give back to her homeland. But that hope, she said, soon wore off.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-rain-weather-waterlogging-road-block-flight-operations-cancellation-imd-forecast-2765425-2025-08-03",
      "headline": "Delhi-NCR wakes up to battering rain; waterlogging, flight delays reportedHeavy rain lashed New Delhi and adjoining areas on Sunday, causing severe waterlogging, disrupting road transport, affecting flight services."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/good-step-trump-welcomes-report-of-india-possibly-halting-russian-oil-imports-glbs-2765071-2025-08-02",
      "headline": "Good step: Trump welcomes reports of India possibly halting Russian oil importsThe US has exerted geopolitical pressure on countries continuing to purchase Russian oil, as part of its intensified efforts to curb Moscow's revenue streams amid the ongoing war in Ukraine."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/travelling-to-mussoorie-you-now-need-to-register-to-visit-the-hill-station-2765474-2025-08-03",
      "headline": "Travelling to Mussoorie? You now need to register to visit the hill stationAs of August 1, all visitors to Mussoorie are required to register online prior to arrival. The move aims to ease traffic, control crowds, and improve services for tourists.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/priyanka-chaturvedi-uddhav-sena-mp-slams-government-over-ind-vs-pak-match-money-important-than-blood-2765436-2025-08-03",
      "headline": "Money important than blood: Uddhav Sena MP slams government over Ind vs Pak matchPriyanka Chaturvedi accused the government and BCCI of prioritising monetary gains over national sentiment by allowing an India-Pakistan match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-5th-test-day-4-weather-forecast-oval-rain-interruption-2765455-2025-08-03",
      "headline": "ENG vs IND, Day 4 weather: Will rain disrupt the Oval thriller?Day 4 at The Oval could shape the entire England vs India Test series, but with rain looming over London once again, fans and players alike are bracing for a weather-interrupted thriller."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jitendra-awhad-sanatana-dharma-ruined-india-not-a-religion-sharad-pawar-ncp-leader-2765400-2025-08-03",
      "headline": "Sanatana Dharma ruined India, not a religion: Sharad Pawar's NCP leaderJitendra Awhad said that people should not hesitate to call Sanatan Dharma and its ideology perverted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saiyaara-box-office-collection-day-16-mohit-suri-film-nears-300-crore-milestone-ahaan-panday-aneet-padda-2765513-2025-08-03",
      "headline": "Saiyaara box office Day 16: Ahaan-Aneet's film sees Saturday growthDirector Mohit Suri's 'Saiyaara' edges closer to Rs 300 crore nett with a strong weekend performance. The film features debutants Aneet Padda and Ahaan Panday in lead roles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/chalti-ka-naam-gaadi-madhubala-kishore-2765510-2025-08-03",
      "headline": "Chalti Ka Naam Gaadi: Madhubala and Kishore's defiant dance of joy amidst shadows'Chalti Ka Naam Gaadi' remains a beloved 1958 Bollywood classic starring Madhubala and Kishore Kumar. The film blends humour, music, and family values, reflecting the spirit of post-independence India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/tamannaah-bhatia-denies-rape-of-avantika-in-baahubali-the-beginning-2765492-2025-08-03",
      "headline": "Tamannaah denies rape of Avantika in Baahubali: It's finding herself through a manActor Tamannaah Bhatia, in an interview with The Lallantop, opened up about the controversial scene featuring her and Prabhas in 'Baahubali: The Beginning'. She explained the thought process behind the particular sequence and SS Rajamouli's vision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/son-of-sardaar-2-vs-dhadak-2-box-office-collection-day-2-ajay-devgn-film-leads-the-race-2765488-2025-08-03",
      "headline": "Son of Sardaar 2 vs Dhadak 2 box office Day 2: Ajay Devgn's film leads the race'Son of Sardaar 2' emerged as the audience's preferred choice over 'Dhadak 2' despite mixed reviews. Both films were released on Friday. The Ajay Devgn-starrer earned Rs 7.5 crore India nett, while the Siddhant Chaturvedi and Tripti Dimri film collected Rs 3.7 crore India nett on Day 2. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-pakistan-2nd-t20i-report-jason-holder-lauderhill-2765491-2025-08-03",
      "headline": "Jason Holder's heroics help West Indies claim last-ball thriller in 2nd T20IJason Holder starred with both ball and bat as West Indies snapped their losing streak against Pakistan in the second T20I. Holder hit the winning runs off the last ball from Shaheen Shah Afridi to level the series heading into the decider. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-injury-inter-miami-vs-necaxa-leagues-cup-hamstring-2765486-2025-08-03",
      "headline": "Frustrated Lionel Messi forced off with injury in Inter Miami vs NecaxaLionel Messi's early injury against Necaxa cast a shadow over Inter Miami's dramatic shootout win, leaving fans anxious as their talisman exited with frustration and a suspected hamstring strain ahead of key fixtures.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/england-vs-india-yashasvi-jaiswal-enoyed-akash-deep-fun-partnership-oval-test-2765481-2025-08-03",
      "headline": "Yashasvi Jaiswal enjoyed fun partnership with Akash Deep in Oval TestAfter Day 3 of the Oval Test, Yashasvi Jaiswal said he thoroughly enjoyed his fun and unexpectedly effective partnership with nightwatchman Akash Deep, praising his fearless approach and valuable contribution under pressure."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/england-vs-india-oval-test-josh-tongue-press-conference-ashes-2765480-2025-08-03",
      "headline": "Living in present: Josh Tongue not thinking about Ashes after fine India seriesDespite picking up 19 wickets in the ongoing England vs India series, Josh Tongue isn't thinking about his chances of making it into the squad for the upcoming Ashes series this year. Tongue said he is focussed on the present at the moment. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-sunil-gavaskar-gift-shubman-gill-signed-cap-oval-test-2765475-2025-08-03",
      "headline": "Watch: Sunil Gavaskar gifts Shubman Gill signed cap in special Oval gestureIndia legend Sunil Gavaskar gifted Shubman Gill a specially signed cap, offering his support and best wishes ahead of the crucial Day 4 at The Oval, where India aims to level the Test series against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-biggest-chases-records-bazball-2765464-2025-08-03",
      "headline": "Can India defend 374 at The Oval to avoid a series defeat? Here's what history saysENG vs IND, 5th Test: India have set England a formidable target of 374 to win at The Oval in London. However, England have successfully chased down large targets against India in the past, which should give them some confidence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-akash-deep-fifty-shubman-gill-kl-rahul-2765458-2025-08-03",
      "headline": "66 no less than a century: When batter Akash Deep thrilled Gill, teammatesShubman Gill, KL Rahul and the rest of the Indian team were left in awe of the special innings by pacer Akash Deep on Day 3 of the Oval Test. Akash scored his maiden fifty as India put up a target of 374 for England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-5th-test-day-4-weather-forecast-oval-rain-interruption-2765455-2025-08-03",
      "headline": "ENG vs IND, Day 4 weather: Will rain disrupt the Oval thriller?Day 4 at The Oval could shape the entire England vs India Test series, but with rain looming over London once again, fans and players alike are bracing for a weather-interrupted thriller."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wcl-final-south-africa-beat-pakistan-ab-de-villiers-suresh-raina-2765450-2025-08-03",
      "headline": "Raina lauds AB de Villiers for WCL final ton, says India would've crushed PakistanSuresh Raina heaped praise on AB de Villiers for his blistering hundred in the WCL final as South Africa crushed Pakistan on Saturday, August 2. Raina also said that had India played Pakistan, they would have crushed them too. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-chase-josh-tongue-reaction-2765438-2025-08-03",
      "headline": "England pretty chilled about chasing down 374 in Oval Test: Josh TongueJosh Tongue has said that England aren't overthinking about the chase in the Oval Test and backed the batters to get the job done to seal the series. England need 374 runs to win the match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-shubman-gill-new-records-gautam-gambhir-oval-test-2765429-2025-08-03",
      "headline": "3809 runs in 5 matches: Shubman Gill's India set new records in Oval TestENG vs IND: The Shubman Gill-led India are yet to save the series against England with two days left in the Oval Test, but they have shattered quite a few records during the game. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-akash-deep-fifty-shubman-gill-kl-rahul-2765458-2025-08-03",
      "headline": "66 no less than a century: When batter Akash Deep thrilled Gill, teammatesShubman Gill, KL Rahul and the rest of the Indian team were left in awe of the special innings by pacer Akash Deep on Day 3 of the Oval Test. Akash scored his maiden fifty as India put up a target of 374 for England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-5th-test-day-4-weather-forecast-oval-rain-interruption-2765455-2025-08-03",
      "headline": "ENG vs IND, Day 4 weather: Will rain disrupt the Oval thriller?Day 4 at The Oval could shape the entire England vs India Test series, but with rain looming over London once again, fans and players alike are bracing for a weather-interrupted thriller."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wcl-final-south-africa-beat-pakistan-ab-de-villiers-suresh-raina-2765450-2025-08-03",
      "headline": "Raina lauds AB de Villiers for WCL final ton, says India would've crushed PakistanSuresh Raina heaped praise on AB de Villiers for his blistering hundred in the WCL final as South Africa crushed Pakistan on Saturday, August 2. Raina also said that had India played Pakistan, they would have crushed them too. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-chase-josh-tongue-reaction-2765438-2025-08-03",
      "headline": "England pretty chilled about chasing down 374 in Oval Test: Josh TongueJosh Tongue has said that England aren't overthinking about the chase in the Oval Test and backed the batters to get the job done to seal the series. England need 374 runs to win the match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-shubman-gill-new-records-gautam-gambhir-oval-test-2765429-2025-08-03",
      "headline": "3809 runs in 5 matches: Shubman Gill's India set new records in Oval TestENG vs IND: The Shubman Gill-led India are yet to save the series against England with two days left in the Oval Test, but they have shattered quite a few records during the game. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}