{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/despite-tax-implications-and-fema-why-are-nris-flocking-to-buy-homes-in-india-real-estate-investment-2810087-2025-10-29",
      "headline": "Why are NRIs flocking to buy homes in India?The transformation of India's real estate ecosystem has further strengthened this trust of the NRIs. Over the past decade, reforms such as the RERA improved project transparency, digitisation of land records and professionalisation of developers have collectively boosted buyer confidence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/8th-pay-commission-cabinet-clears-terms-of-reference-what-does-this-mean-2810072-2025-10-29",
      "headline": "8th Pay Commission: Cabinet clears terms of reference. What does this mean?With the Cabinet approving the Terms of Reference for the 8th Central Pay Commission, the countdown begins for the next pay and pension revision that could reshape earnings for millions of central government employees and pensioners."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-organised-farmstay-market-set-to-touch-rs-63000-crore-by-2029-2810035-2025-10-29",
      "headline": "India's organised farmstay market set to touch Rs 63,000 crore by 2029As city life grows more chaotic and polluted, many urban Indians are finding peace in the countryside. The growing shift towards wellness and greener living is now driving India's organised farmstay market to new heights."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/it-big-tech-layoffs-severance-costs-ai-restructuring-2810028-2025-10-29",
      "headline": "The billion-dollar goodbye: Why global tech giants are spending more to let people goIn this deep-dive on global tech layoffs, we analyse severance costs, project realignments, and slowing demand cycles to understand why companies are standardising leaner headcounts and shifting toward automation-driven operational efficiency."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-silver-rebound-slightly-ahead-of-us-fed-decision-check-latest-rates-2809995-2025-10-29",
      "headline": "Gold, silver prices rise slightly ahead of US Fed decision. Check latest ratesOn the Multi Commodity Exchange (MCX), Gold December futures were trading at Rs 1,19,755 per 10 grams at 9:43 am, up modestly from Tuesday's close. Silver December futures were quoted at Rs 1,44,768 per kg, also showing a slight uptick after recent losses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-open-higher-tracking-asian-markets-us-fed-decision-in-focus-2809988-2025-10-29",
      "headline": "Sensex, Nifty open higher tracking Asian markets; US Fed decision in focusThe S&P BSE Sensex was trading 153.31 points higher at 84,781.47, while the NSE Nifty50 hovered just below the 26,000 level after briefly crossing it during early trade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-and-silver-prices-fall-sharply-should-you-buy-now-gold-prices-today-silver-prices-today-2809707-2025-10-29",
      "headline": "Gold and silver prices fall sharply. Should you buy now?With gold and silver prices falling sharply, investors are eyeing the market closely. Is now the right time to buy, or could prices dip further?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/amazon-to-cut-14000-jobs-in-biggest-ever-layoffs-amid-ai-driven-cost-cuts-glbs-2809914-2025-10-29",
      "headline": "Amazon to cut 14,000 corporate jobs amid company's AI push to slash costsAmazon will cut about 14,000 corporate jobs, its biggest layoffs since 2023, as it ramps up artificial intelligence investments and trims costs under CEO Andy Jassy's ongoing restructuring plan."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/companies/story/apple-becomes-third-company-to-cross-4-trillion-dollar-market-value-2809787-2025-10-28",
      "headline": "Apple joins Microsoft, Nvidia in exclusive $4 trillion market-cap clubApple is now the third member of the $4 trillion market-cap club, joining Nvidia—currently valued above $4.5 trillion—and Microsoft, which re-entered the group following gains linked to its partnership with OpenAI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-end-slightly-lower-amid-volatility-and-profit-booking-2809612-2025-10-28",
      "headline": "Sensex, Nifty end slightly lower amid volatility and profit bookingThe S&P BSE Sensex slipped 75.11 points to close at 84,703.73 and the NSE Nifty50 fell 29.85 points to settle at 25,936.20."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/companies/story/mehli-mistry-set-to-exit-tata-trusts-after-trustees-block-reappointment-2809599-2025-10-28",
      "headline": "Mehli Mistry set to exit Tata Trusts after trustees block reappointmentMehli Mistry, who joined both trusts in 2022, has been regarded as a close associate of the late Ratan Tata. The Sir Dorabji Tata Trust and the Sir Ratan Tata Trust together hold the largest shareholding in Tata Sons and play a central role in board nominations and governance across the Tata Group."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cabinet-clears-terms-of-reference-for-8th-pay-commission-rollout-likely-from-january-2026-2809589-2025-10-28",
      "headline": "Cabinet clears terms of reference for 8th Pay CommissionInformation and Broadcasting Minister Ashwini Vaishnaw confirmed that the government has finalised the commission's composition, mandate and timelines."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/whats-driving-the-6-percent-rise-in-office-rentals-across-indias-major-cities-real-estate-prices-2809535-2025-10-28",
      "headline": "What's driving the 6% rise in office rentals across India's major cities?Average monthly office rentals increased from Rs 85 per sq. ft. in the first nine months of 2024 to Rs 90 per sq. ft. in the same period of 2025. Bengaluru saw the sharpest rise of about 9%, followed by steady gains in cities like Pune and Delhi-NCR."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/companies/story/indian-refiners-halt-new-russian-oil-deals-await-clarity-amid-sanctions-2809532-2025-10-28",
      "headline": "Indian refiners halt new Russian oil deals, await clarity amid sanctions: ReportLast week, the US imposed new sanctions on Russia's two largest oil producers, Lukoil and Rosneft, expanding restrictions already in place from the European Union and the UK over the war in Ukraine. The fresh measures have forced Indian buyers to reassess supply routes and payment mechanisms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/peyush-bansals-lenskart-ipo-opens-on-october-31-heres-all-you-need-to-know-2809502-2025-10-28",
      "headline": "Peyush Bansal's Lenskart IPO opens on October 31. Here's all you need to knowPeyush Bansal-led Lenskart is set to hit the primary market on October 31 with its Rs 7,278 crore IPO. Backed by a strong brand presence and rapid expansion, the issue is among the most awaited listings of 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/6-hidden-home-loan-traps-your-bank-wont-tell-you-expert-shares-smart-hacks-2809469-2025-10-28",
      "headline": "6 hidden home loan traps your bank won't tell you. Expert shares smart hacksBuying your dream home can quickly turn stressful when hidden costs and surprise clauses appear. From processing fees to \"mandatory\" insurance, a tax expert shares six practical hacks every borrower should know before signing their home loan papers."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/claim-denied-series-crpf-officer-care-health-insurance-fight-autistic-son-treatment-2809453-2025-10-28",
      "headline": "How a CRPF officer fought insurer for his autistic son's treatmentSyam Krishna, a CRPF officer, was advised to hospitalise his autistic son when he fell ill. However, his insurer called it \"unnecessary\" and even raised questions on the family's claim history. This week's 'Claim Denied' story delves into how genuine policyholders are forced to fight for rightful care."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-90-of-indian-investors-quit-sips-too-soon-explains-expert-2809419-2025-10-28",
      "headline": "Why quitting SIPs within 3 years is a costly mistakeStarting an SIP is easy, staying invested isn't. An expert explains why most Indian investors quit too soon, and how this one mistake can cost them lakhs in the long run."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/mcx-trading-technical-glitch-halts-gold-silver-futures-check-latest-update-2809420-2025-10-28",
      "headline": "MCX glitch halts gold, silver futures trade; check latest updateIn a series of updates issued throughout the morning, MCX stated that the issue was being addressed and that trading would now commence from its Disaster Recovery (DR) site. However, the exchange did not specify a fresh start time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/vodafone-idea-share-price-what-are-analysts-saying-after-agr-ruling-2809412-2025-10-28",
      "headline": "Vodafone Idea share price: What are analysts saying after AGR ruling?Analysts see fresh hope for Vodafone Idea after the AGR ruling, with Motilal Oswal, Emkay, and Citi turning positive on the stock and projecting scope for further upside."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/don-lee-joins-prabhas-telugu-cop-action-film-spirit-2810086-2025-10-29",
      "headline": "Don Lee to face off with Prabhas in Sandeep Vanga's Spirit, reports Korean media Multiple Korean media outlets report Don Lee, known for 'Train to Busan' and 'Eternals', will take on a pivotal role in the Telugu film 'Spirit', directed by Sandeep Reddy Vanga and starring Prabhas. The film is expected to be released in 2026, though official confirmation from the production team is pending."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/delhi-high-court-refuses-to-hear-pil-urgently-against-paresh-rawals-the-taj-story-2810058-2025-10-29",
      "headline": "Delhi High Court refuses to hear PIL urgently against Paresh Rawal's The Taj Story A petition was filed in the Delhi High Court challenging the release of the film 'The Taj Story', starring Paresh Rawal, amid concerns that it spreads fringe theories about the Taj Mahal's origins and may threaten communal harmony."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/kufar-music-video-controversy-manushi-chhillar-diljit-dosanjh-respond-to-viral-leg-lift-moment-backlash-2810085-2025-10-29",
      "headline": "Manushi, Diljit break silence on Kufar controversy after viral leg-lift moment After Diljit Dosanjh, Manushi Chhillar addressed online trolling and defended a fellow dancer after a controversial scene from Diljit Dosanjh's video 'Kufar' drew attention on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shilpa-shinde-comeback-angoori-bhabhi-bhabi-ji-ghar-par-hai-2810069-2025-10-29",
      "headline": "Shilpa Shinde to make comeback as Angoori Bhabhi in Bhabi Ji Ghar Par Hai? Actor Shilpa Shinde is likely to make her return to 'Bhabi Ji Ghar Par Hai' nearly a decade after her controversial exit. Reports are rife that discussions are underway to replace Shubhangi Atre with Shilpa as Angoori Bhabhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/benny-blanco-selena-gomez-celebrate-one-month-marriage-private-beach-outing-2810057-2025-10-29",
      "headline": "Benny Blanco is making every month count with wife Selena Gomez Singer Selena Gomez and Benny Blanco got married on September 27 in Santa Barbara, and recently commemorated their first month as newlyweds with a private beach walk and intimate dinner, joined by close friends from the entertainment industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/why-courage-the-cowardly-dog-still-feels-like-perfect-halloween-comfort-2810022-2025-10-29",
      "headline": "Why Courage the Cowardly Dog still feels like perfect Halloween comfort Revisiting 'Courage the Cowardly Dog' this Halloween proves that spooky doesn't always mean soulless. It's scary, weird, and full of heart, the perfect nostalgic comfort show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ibrahim-ali-khan-reacts-to-constant-comparisons-with-father-saif-ali-khan-2810075-2025-10-29",
      "headline": "Ibrahim Ali Khan reacts to constant comparisons with father Saif: It's a compliment Ibrahim Ali Khan opened up about being constantly compared to his father Saif Ali Khan, saying it motivates him to live up to his legacy. Despite a slow start with his first two films, the young actor remains determined as he gears up for his next project, 'Diler'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aryan-khan-pickleball-court-video-the-bads-of-bollywood-success-2810040-2025-10-29",
      "headline": "Watch Aryan Khan hit pickleball court after The Ba***ds of Bollywood success Videos of Aryan Khan, son of Shah Rukh Khan, showcasing his pickleball skills have gone viral. He recently garnered praise for his directorial debut series 'The Ba***ds of Bollywood'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/naseeruddin-shah-bids-farewell-to-satish-shah-blames-bollywood-for-typecasting-him-2810041-2025-10-29",
      "headline": "Naseeruddin Shah bids farewell to Satish Shah, blames Bollywood for typecasting him Veteran actor Naseeruddin Shah penned an emotional tribute to his late friend and 'Jaane Bhi Do Yaaro' co-star Satish Shah, recalling his warmth, humour, and brilliance. In his heartfelt note, Shah reflected on how Bollywood unfairly typecast Satish as a comedian despite his immense talent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/bison-kaalamaadan-success-mani-ratnam-praises-mari-selvaraj-impactful-film-unique-voice-2810046-2025-10-29",
      "headline": "Mani Ratnam praises Bison, calls director Mari Selvaraj's voice important Filmmaker Mani Ratnam has praised Mari Selvaraj's film 'Bison Kaalamaadan', prompting a heartfelt response from the director. The film, which features Dhruv Vikram in the lead, was released on October 17 and is based on the story of kabaddi player Manathi Ganesan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/hiten-tejwani-reveals-taxing-work-schedules-and-long-hours-faced-by-television-actors-2810016-2025-10-29",
      "headline": "Worked 22 hours a day: Actor Hiten Tejwani opens up on tough TV schedules Hiten Tejwani sheds light on the exhausting work culture of Indian television, recalling sleepless nights and relentless schedules that shaped his rise from humble beginnings to one of the industry's most respected actors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/siddharth-calls-aditi-rao-hydari-his-greatest-strength-in-poetic-birthday-post-2810044-2025-10-29",
      "headline": "Siddharth calls Aditi Rao Hydari his greatest strength in poetic birthday post Siddharth celebrated Aditi Rao Hydari's birthday with a heartfelt poem on social media, expressing his deep love and gratitude for her."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/watching-baahubali-again-in-2025-whats-changed-in-indian-cinema-in-last-decade-2809601-2025-10-29",
      "headline": "Watching Baahubali again in 2025: What's changed in Indian cinema in last decade 'Baahubali' returns to theatres in 2025, marking a decade since its release. The film revolutionised Indian cinema with pan-India appeal and bigger budgets, inspiring future blockbusters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-shares-adorable-tour-moments-with-nick-jonas-and-daughter-malti-marie-2810018-2025-10-29",
      "headline": "Priyanka Chopra shares adorable tour moments with Nick Jonas and daughter Malti Priyanka Chopra shared adorable moments from her tour with Nick Jonas and their daughter Malti, offering fans a glimpse into their joyful family life on the road."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/sydney-sweeney-denies-cosmetic-procedures-embraces-aging-gracefully-sex-symbol-2809998-2025-10-29",
      "headline": "Not apologising for being a sex symbol: Sydney Sweeney claps back at trolls Sydney Sweeney shut down rumours of cosmetic procedures, stressing her natural looks and fear of needles. She urged women to embrace confidence and stand unapologetically strong against online scrutiny."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/amitabh-bachchan-shares-family-food-stories-sweets-kaun-banega-crorepati-17-2809994-2025-10-29",
      "headline": "KBC 17: Amitabh Bachchan recalls struggling days with no money On the latest episode of 'Kaun Banega Crorepati 17', Amitabh Bachchan discussed his favourite foods and shared memories from his early career, engaging with contestants about personal and family culinary traditions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ek-deewane-ki-deewaniyat-box-office-collection-day-8-harshvardhan-rane-sonam-bajwa-film-nears-rs-50-crore-2809991-2025-10-29",
      "headline": "Ek Deewane Ki Deewaniyat box office Day 8: Harshvardhan's film nears Rs 50 crore Harshvardhan Rane and Sonam Bajwa's 'Ek Deewane Ki Deewaniyat' has become a surprise box office hit, nearing the Rs 50 crore mark despite competition from 'Thamma'. Made on a Rs 25 crore budget, the romantic drama has outperformed expectations, especially in Tier-2 and Tier-3 cities."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/annoyed-emma-thompson-blasts-ai-for-meddling-in-her-writing-process-just-fk-off-2809978-2025-10-29",
      "headline": "Annoyed Emma Thompson blasts AI for meddling in her writing process: Just f**k off Emma Thompson has spoken strongly about her annoyance with artificial intelligence interfering in her writing routine, emphasising the personal connection she feels with traditional methods and recalling past frustrations with technology."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/malaika-arora-evolution-bollywood-dance-numbers-item-songs-indian-cinema-2809973-2025-10-29",
      "headline": "Malaika Arora defends Bollywood dance numbers, says they've evolved Malaika Arora reflects on the progression of dance numbers in Bollywood, noting a shift from glamour-focused performances to numbers with greater narrative and character integration. She addresses ongoing debates about item songs, their association with the male gaze, and emphasises the importance of confidence, artistic expression, and staying relevant regardless of age."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/nicest-looking-guy-trump-praises-pm-as-he-again-claims-to-have-stopped-india-pak-conflict-2810031-2025-10-29",
      "headline": "Nicest looking guy: Trump praises PM Modi, repeats India-Pak ceasefire claimSpeaking at a luncheon in South Korea, US President Donald Trump praised Prime Minister Narendra Modi and again claimed he personally helped end fighting between India and Pakistan earlier this year."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/why-delhi-did-not-see-rain-despite-cloud-seeding-pollution-smog-2809910-2025-10-29",
      "headline": "Why Delhi's cloud-seeding trial for artificial rain was bound to failThe much-hyped cloud seeding experiment in Delhi on Tuesday to induce rainfall is yet to yield visible results. In reality, there was little chance of the experiment succeeding due to low moisture content."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/it-big-tech-layoffs-severance-costs-ai-restructuring-2810028-2025-10-29",
      "headline": "The billion-dollar goodbye: Why global tech giants are spending more to let people goIn this deep-dive on global tech layoffs, we analyse severance costs, project realignments, and slowing demand cycles to understand why companies are standardising leaner headcounts and shifting toward automation-driven operational efficiency."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/subu-vedam-detained-india-born-man-subramanyam-deportation-battle-spent-43-years-us-jail-ice-pennsylvania-2808653-2025-10-29",
      "headline": "I'm still a detainee: India-born man's new battle after 43 years in US JailSubramanyam Subu Vedam, an India-born man exonerated after 43 years in a US prison for a wrongful murder conviction, was immediately detained by ICE under a decades-old deportation order. Freed after new FBI evidence proved his innocence, 64-year-old Vedam now faces deportation to India, the country he left as a nine-month-old. Here's the story of the ordeal of the longest-serving wrongfully convicted person in Pennsylvania's history, and one of the longest in the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/childhood-vaccines-autism-controversy-mccullough-report-zoho-founder-vembu-2810052-2025-10-29",
      "headline": "Sridhar Vembu draws sharp rebuttal from doctors over unverified vaccine-autism linkA self-published report claims a link between vaccines and autism, strongly promoted by Zoho founder Sridhar Vembu. Doctors and public health experts warn this misinformation could harm decades of public health progress in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/khalistani-terrorist-gurpatwant-singh-pannun-sikhs-for-justice-threatens-diljit-dosanjh-touching-amitabh-bachchan-feet-2810011-2025-10-29",
      "headline": "Khalistani outfit threatens Diljit Dosanjh for touching Amitabh Bachchan's feetThe banned Khalistani outfit has said that Diljit Dosanjh touching Amitabh Bachchan's feet was an insult to every victim of the 1984 anti-Sikh riots."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/mahagathbandhan-cm-face-tejashwi-yadav-bihar-polls-nda-rjd-congress-india-bloc-2810017-2025-10-29",
      "headline": "Mahagathbandhan's Bihar battle a one-man show. Will Tejashwi pass the litmus test?Mahagathbandhan has released its joint manifesto titled \"Tejashwi Pran\" eight days before Bihar's first-phase voting, projecting Tejashwi Yadav as the alliance's sole face with promises of jobs, women's welfare and more. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/president-droupadi-murmu-flies-in-rafale-fighter-jet-from-ambala-airbase-2810063-2025-10-29",
      "headline": "Watch: President Droupadi Murmu takes sortie in Rafale jet from AmbalaPresident Droupadi Murmu on Wednesday became the first Indian President to take a sortie in a Rafale fighter jet at the Air Force Station in Ambala, Haryana. The Rafale jets were notably used during Operation Sindoor, India's targeted response to the April 22 Pahalgam terror attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/gurgaon-ceo-calls-employee-breakup-leave-mail-most-honest-request-approves-instantly-2810002-2025-10-29",
      "headline": "Gurgaon CEO calls employee's breakup leave mail 'most honest request', approvesJasveer Singh, co-founder and CEO of Knot Dating, opined that \"Gen Z doesn't do filters,\" suggesting that younger employees are increasingly upfront about their emotions and mental well-being. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/cloud-seeding-for-artificial-rain-in-delhi-ncr-halted-due-to-low-moisture-levels-2810055-2025-10-29",
      "headline": "IIT-Kanpur team halts cloud seeding in Delhi due to low moisture contentThe artificial rain experiment by IIT Kanpur in Delhi-NCR has been temporarily halted owing to insufficient moisture in the atmosphere. Experts confirm that current weather conditions are not favourable for cloud seeding operations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/firhad-hakim-will-break-their-legs-ec-bjp-bengal-sir-voter-roll-caa-nrc-controversy-suicide-2810036-2025-10-29",
      "headline": "Will break their legs: Bengal Minister warns BJP, poll body as SIR spurs CAA fearsEchoing Chief Minister Mamata Banerjee, who dubbed the poll roll revision a \"backdoor NRC\", Bengal Minister Firhad Hakim raised the suicide of a man who blamed the controversial exercise for his death."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/8th-pay-commission-cabinet-clears-terms-of-reference-what-does-this-mean-2810072-2025-10-29",
      "headline": "8th Pay Commission: Cabinet clears terms of reference. What does this mean?With the Cabinet approving the Terms of Reference for the 8th Central Pay Commission, the countdown begins for the next pay and pension revision that could reshape earnings for millions of central government employees and pensioners."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/bangladesh-election-uncertain-muhammad-yunus-not-happening-bnp-sheikh-hasina-awami-league-ban-bnp-history-2809571-2025-10-29",
      "headline": "Bangladesh election: One-sided under Yunus, or not happening at all in FebruaryThough an election in Bangladesh in February looks unlikely, there's an added question. Will the election, if held, be fair like the one in 2008, or will the Muhammad Yunus set-up conduct polls by keeping away a big chunk of voters like Sheikh Hasina did in 2024?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tamil-nadu-mk-stalin-cash-for-jobs-bribes-government-dmk-police-hawala-2810071-2025-10-29",
      "headline": "ED alleges bribes taken for government posts handed over by MK Stalin in Tamil NaduThe Enforcement Directorate (ED) has alerted Tamil Nadu Police to a major cash-for-jobs scam in the MAWS Department, alleging exam manipulation, hawala transactions, and bribes up to Rs 35 lakh for government posts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/cloud-seeding-delhi-pollution-reduction-artificial-rain-trial-iit-kanpur-director-data-criticism-2809992-2025-10-29",
      "headline": "No rain after Delhi's cloud seeding, but IIT Kanpur chief sees silver liningTuesday's cloud seeding trial in Delhi did not produce rain but data shows it helped reduce pollution levels. Amid criticism, here's what IIT Kanpur Director Manindra Agarwal said about learnings from the exercise and what comes next."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/mysterious-colour-glows-in-skies-over-pakistan-its-not-a-missile-launch-2809967-2025-10-29",
      "headline": "Mysterious lights glow in skies over Pakistan. It's not a missile launchResidents and early risers in Pakistan described the surreal scene, with unusual hues lighting up the sky. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/nalanda-ancient-university-india-global-scholars-64-subjects-2809603-2025-10-29",
      "headline": "What was taught at Nalanda? The 64 subjects of India's ancient universityNalanda was the world's first residential university, thriving for nearly 700 years in ancient India. Its legacy of global scholarship and multidisciplinary study continues to inspire modern education."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shafali-verma-returns-india-womens-world-cup-semi-final-australia-2809860-2025-10-29",
      "headline": "Shafali Verma rides on luck, but faces tough redemption road against AustraliaWomen's World Cup, IND vs AUS: India have included Shafali Verma in the squad as a replacement for Pratika Rawal, but the youngster faces a tough challenge as India prepare to take on Australia in the first semi-final.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/suspected-spy-arrested-delhi-for-espionage-foreign-nuclear-scientist-travelled-to-pakistan-2809982-2025-10-29",
      "headline": "'Spy' with links to foreign nuke scientists arrested in Delhi, had travelled to PakThe suspected spy, identified as Mohammad Adil Hussaini, had travelled to multiple countries, including Pakistan, and was allegedly in touch with nuclear scientists in Russia and Iran. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/why-mindful-parenting-is-the-approach-every-parent-needs-today-2809132-2025-10-29",
      "headline": "Why mindful parenting is the approach every parent needs todayFor many modern parents, mindful parenting has become the secret to building a stronger bond with their child. If you have a little one, too, this approach is definitely worth trying."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/watching-baahubali-again-in-2025-whats-changed-in-indian-cinema-in-last-decade-2809601-2025-10-29",
      "headline": "Watching Baahubali again in 2025: What's changed in Indian cinema in last decade'Baahubali' returns to theatres in 2025, marking a decade since its release. The film revolutionised Indian cinema with pan-India appeal and bigger budgets, inspiring future blockbusters."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistans-khawaja-asif-accuses-kabul-of-being-indias-puppet-vows-revenge-glbs-2809917-2025-10-29",
      "headline": "Pakistan's Khawaja Asif accuses Kabul of being India's puppet, vows revengePakistan's Defence Minister Khawaja Asif accused Kabul of acting as  a tool for Delhi, warning that if Afghanistan attacks Islamabad, Pakistan's response would be 50 times stronger, after peace talks collapsed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jk-governors-teen-relative-aarav-mishra-dies-by-suicide-during-chhath-puja-festivities-cites-haunted-by-spirits-in-note-2809985-2025-10-29",
      "headline": "J&K Governor's teen relative dies by suicide, note says was haunted by spiritsAarav Mishra, a teenager from a prominent Kanpur family, was found dead in a suspected suicide amid claims of spiritual torment. The incident has left the community and political circles deeply shaken as investigations continue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/delhi-high-court-refuses-to-hear-pil-urgently-against-paresh-rawals-the-taj-story-2810058-2025-10-29",
      "headline": "Delhi High Court refuses to hear PIL urgently against Paresh Rawal's The Taj StoryA petition was filed in the Delhi High Court challenging the release of the film 'The Taj Story', starring Paresh Rawal, amid concerns that it spreads fringe theories about the Taj Mahal's origins and may threaten communal harmony."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-poor-form-india-t20i-captain-scrutiny-australia-series-2810091-2025-10-29",
      "headline": "Suryakumar Yadav's extended poor run will create internal scrutiny: Nayar Former India cricketer Abhishek Nayar warns of intense scrutiny on Suryakumar Yadav's poor form ahead of the Australia T20I series. Suryakumar hasn't been in good form ever since being appointed as a full-time T20I captain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-1st-t20i-live-score-updates-abhishek-sharma-suryakumar-yadav-canberra-2810079-2025-10-29",
      "headline": "AUS vs IND, Live: Can Abhishek Sharma show same flair down under? AUS vs IND, Live score 1st T20I: After losing the ODI series, India will be looking to bounce back in the T20I series against Australia, with the stage set for the first match of the 5-match series in Canberra. Can the likes of Abhishek Sharma showcase the same kind of flair in Australia that he has been showing elsewhere?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/inter-goalkeeper-josep-martinez-car-accident-killls-wheelchair-2810073-2025-10-29",
      "headline": "Inter Milan's Josep Martinez in car accident that kills 81-year-old in wheelchair Inter Milan's Josep Martinez was involved in a fatal road accident in Como that killed an 81-year-old man in a wheelchair. Police have launched an investigation into the tragic incident as Inter cancelled media duties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhishek-sharma-explosive-t20-batter-ravi-shastri-warns-australia-india-series-2810062-2025-10-29",
      "headline": "Abhishek Sharma can create chaos: Ravi Shastri warns Australia ahead of 1st T20I Former India coach Ravi Shastri warns Australia about Abhishek Sharma's explosive batting ahead of the T20I series. India seek to bounce back after losing by 1-2 in the ODI series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/cristiano-ronaldo-al-nassr-trophy-curse-kings-cup-al-ittihad-loss-saudi-2810042-2025-10-29",
      "headline": "Ronaldo's Al Nassr trophy curse: 13 tournaments lost after King's Cup heartbreak Cristiano Ronaldo's hunt for silverware in Saudi Arabia continues after Al Nassr's King's Cup exit to Al Ittihad. Despite his individual brilliance, major trophies remain out of reach since his move to the Riyadh-based club."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/meg-lanning-predicts-australia-england-womens-world-cup-final-2810030-2025-10-29",
      "headline": "Meg Lanning predicts Australia vs England final, leaves out India Meg Lanning has excluded India from her Women's World Cup final prediction, tipping Australia and England to dominate their semi-finals and face off in the title clash in Navi Mumbai on November 2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-pakistan-1st-t20i-batting-issues-salman-agha-reaction-2810000-2025-10-29",
      "headline": "Pakistan need to fix middle order issues: Salman Ali Agha on 1st T20I loss vs SA Pakistan captain Salman Ali Agha admitted that his side's repeated failure to build partnerships once again proved costly, as South Africa handed them a defeat in the opening T20I of the series at the Rawalpindi Cricket Stadium on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-1st-t20i-canberra-weather-forecast-2809990-2025-10-29",
      "headline": "AUS vs IND 1st T20I Canberra weather forecast: Will rain affect the series opener? Australia vs India, Canberra Weather Forecast: Cricket fans might need to keep their fingers crossed, with rain threatening to play spoilsport when India and Australia kick off their five-match T20I series in Canberra on Wednesday (October 29)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shafali-verma-returns-india-womens-world-cup-semi-final-australia-2809860-2025-10-29",
      "headline": "Shafali Verma rides on luck, but faces tough redemption road against Australia Women's World Cup, IND vs AUS: India have included Shafali Verma in the squad as a replacement for Pratika Rawal, but the youngster faces a tough challenge as India prepare to take on Australia in the first semi-final.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-england-vs-south-africa-semi-final-preview-revenge-69-nightmare-2809968-2025-10-29",
      "headline": "South Africa look for revenge in semis against England after 69 nightmare Women's World Cup, ENG vs SA: South Africa will be looking to avenge their previous defeat to England when the two teams meet on Tuesday, October 28 at the Barsapara Stadium in Guwahati. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-irfan-pathan-suryakumar-yadav-t20i-form-2809966-2025-10-29",
      "headline": "Australian pitches will help Suryakumar Yadav regain form, says Irfan Pathan Former India all-rounder Irfan Pathan believes the Australian pitches could help Suryakumar Yadav rediscover his batting rhythm. The Indian captain has endured a lean run of form this season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-pakistan-1st-t20i-batting-issues-salman-agha-reaction-2810000-2025-10-29",
      "headline": "Pakistan need to fix middle order issues: Salman Ali Agha on 1st T20I loss vs SA Pakistan captain Salman Ali Agha admitted that his side's repeated failure to build partnerships once again proved costly, as South Africa handed them a defeat in the opening T20I of the series at the Rawalpindi Cricket Stadium on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-1st-t20i-canberra-weather-forecast-2809990-2025-10-29",
      "headline": "AUS vs IND 1st T20I Canberra weather forecast: Will rain affect the series opener? Australia vs India, Canberra Weather Forecast: Cricket fans might need to keep their fingers crossed, with rain threatening to play spoilsport when India and Australia kick off their five-match T20I series in Canberra on Wednesday (October 29)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shafali-verma-returns-india-womens-world-cup-semi-final-australia-2809860-2025-10-29",
      "headline": "Shafali Verma rides on luck, but faces tough redemption road against Australia Women's World Cup, IND vs AUS: India have included Shafali Verma in the squad as a replacement for Pratika Rawal, but the youngster faces a tough challenge as India prepare to take on Australia in the first semi-final.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-england-vs-south-africa-semi-final-preview-revenge-69-nightmare-2809968-2025-10-29",
      "headline": "South Africa look for revenge in semis against England after 69 nightmare Women's World Cup, ENG vs SA: South Africa will be looking to avenge their previous defeat to England when the two teams meet on Tuesday, October 28 at the Barsapara Stadium in Guwahati. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-irfan-pathan-suryakumar-yadav-t20i-form-2809966-2025-10-29",
      "headline": "Australian pitches will help Suryakumar Yadav regain form, says Irfan Pathan Former India all-rounder Irfan Pathan believes the Australian pitches could help Suryakumar Yadav rediscover his batting rhythm. The Indian captain has endured a lean run of form this season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ruturaj-gaikwad-player-of-the-match-award-prithvi-shaw-share-maharashtra-vs-chandigarh-2809961-2025-10-29",
      "headline": "Watch: Ruturaj shares Ranji Trophy award with double centurion Prithvi ShawRuturaj Gaikwad shared his Player of the Match award with Prithvi Shaw after Maharashtra's Ranji Trophy win over Chandigarh. Shaw's explosive double century played a decisive role in his team's 144-run victory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/shreyas-iyer-injury-scare-cricketer-suffers-lacerated-spleen-internal-bleeding-ytvd-2809955-2025-10-29",
      "headline": "Shreyas Iyer Injury Scare: Cricketer Suffers Lacerated Spleen, Internal BleedingThis special report focuses on the critical injury sustained by Indian cricketer Shreyas Iyer during the third ODI against Australia in Sydney. The BCCI confirmed the extent of the injury in a press release. According to the board, 'Shreyas Iyer sustained a blunt injury to his abdomen, resulting in a laceration of his spleen with internal bleeding on 25th October during the third ODI against Australia'. The injury, which occurred while taking a catch, was promptly identified and the bleeding was arrested, leading to his condition stabilising. Now out of the ICU, Iyer remains under the close observation of the BCCI's medical team in consultation with specialists in Sydney and India, with scans showing significant improvement on his road to recovery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-ind-2809935-2025-10-29",
      "headline": "Jasprit Bumrah returns to Australia after BGT heroics in a new avatar in T20IsAUS vs IND: Jasprit Bumrah returns to his favourite hunting ground, Australia, where he impressed everyone with his performance in BGT last year. Now in a new role as powerplay enforcer, Bumrah will have big responsibility on him to deliver. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-1st-t20i-preview-abhishek-sharma-suryakumar-2809924-2025-10-29",
      "headline": "1st T20I preview: Will Abhishek Sharma stamp his authority Down Under?India vs Australia, 1st T20I Preview: With the ODIs done, the focus finally shifts to things that matter – the build-up for T20 World Cup. Suryakumar Yadav's India are set to take on Australia in a 5-match series, one that promises a battle between high-voltage batting orders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-beat-pakistan-rawalpindi-t20i-babar-azam-report-2809912-2025-10-29",
      "headline": "Babar Azam flops as South Africa crush Pakistan by 55 runs in RawalpindiPAK vs SA: South Africa crushed Pakistan by 55 runs in the first T20I at Rawalpindi, with George Linde starring in an all-round show. Babar Azam's return ended in disappointment as he fell for a duck, deepening Pakistan's batting woes.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-duck-t20i-comeback-pakistan-vs-south-africa-rawalpindi-2809883-2025-10-28",
      "headline": "Finished Kohli > Prime Babar: Fans tear into Pakistan batter after 0 on T20I returnBabar Azam was heavily trolled after failing to open his account against South Africa, where Corbin Bosch dismissed him for a duck. Fans criticised the comparisons with Virat Kohli, saying Babar should not be measured against a player of Kohli's class and calibre.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/expecting-exciting-south-africa-contest-despite-group-stage-win-nat-sciver-brunt-2809884-2025-10-28",
      "headline": "Expecting an exciting South Africa contest despite group stage win: Sciver-BruntEngland captain Nat Sciver-Brunt has said that she expects an exciting contest against South Africa in the semi-final despite hammering them in the group stages of the Women's World Cup 2025. South Africa were bundled out for 69 by England in the game. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-1st-t20i-preview-abhishek-sharma-suryakumar-2809924-2025-10-29",
      "headline": "1st T20I preview: Will Abhishek Sharma stamp his authority Down Under?India vs Australia, 1st T20I Preview: With the ODIs done, the focus finally shifts to things that matter – the build-up for T20 World Cup. Suryakumar Yadav's India are set to take on Australia in a 5-match series, one that promises a battle between high-voltage batting orders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-beat-pakistan-rawalpindi-t20i-babar-azam-report-2809912-2025-10-29",
      "headline": "Babar Azam flops as South Africa crush Pakistan by 55 runs in RawalpindiPAK vs SA: South Africa crushed Pakistan by 55 runs in the first T20I at Rawalpindi, with George Linde starring in an all-round show. Babar Azam's return ended in disappointment as he fell for a duck, deepening Pakistan's batting woes.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-duck-t20i-comeback-pakistan-vs-south-africa-rawalpindi-2809883-2025-10-28",
      "headline": "Finished Kohli > Prime Babar: Fans tear into Pakistan batter after 0 on T20I returnBabar Azam was heavily trolled after failing to open his account against South Africa, where Corbin Bosch dismissed him for a duck. Fans criticised the comparisons with Virat Kohli, saying Babar should not be measured against a player of Kohli's class and calibre.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/expecting-exciting-south-africa-contest-despite-group-stage-win-nat-sciver-brunt-2809884-2025-10-28",
      "headline": "Expecting an exciting South Africa contest despite group stage win: Sciver-BruntEngland captain Nat Sciver-Brunt has said that she expects an exciting contest against South Africa in the semi-final despite hammering them in the group stages of the Women's World Cup 2025. South Africa were bundled out for 69 by England in the game. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shardul-thakur-eyes-india-comeback-2027-odi-world-cup-south-africa-2809879-2025-10-28",
      "headline": "Shardul Thakur eyes India return, aims to seal No.8 spot 2027 World CupShardul Thakur has said that he is eyeing an Indian comeback and wants to be part of the squad for the ODI World Cup 2027. Shardul was part of the India squad for the England tour and is currently the skipper of the Mumbai team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyanka-patil-injury-comeback-inspired-bumrah-suryakumar-guidance-2809877-2025-10-28",
      "headline": "How Jasprit Bumrah, Suryakumar Yadav inspired Shreyanka Patil amid injury layoffShreyanka Patil opened up about her injury struggles and how Jasprit Bumrah and Suryakumar Yadav inspired her to stay positive and focused during her year-long layoff. The off-spinner, who missed the WPL season, is now playing in the Senior Women's T20 Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nat-sciver-brunt-india-womens-world-cup-final-england-south-africa-semi-final-2809814-2025-10-28",
      "headline": "Nat Sciver-Brunt hopes India qualify for final, wants hosts to beat AustraliaNat Sciver-Brunt expressed her hope to see India reach the Women's World Cup final, saying the atmosphere would be incredible if the hosts made it. On Wednesday, England will face South Africa in the first semi-final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/irfan-pathan-hardik-pandya-injury-india-three-pacer-plan-australia-t20-2025-2809812-2025-10-28",
      "headline": "Hardik Pandya's injury shifts India's balance for Australia T20Is, says Irfan PathanFormer India all-rounder Irfan Pathan says Hardik Pandya's injury will affect India's balance in the T20I series against Australia. He backs a three-pacer strategy and picks Varun Chakravarthy over Kuldeep Yadav for his mystery spin in Australian conditions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/care-today-foundation-empowers-young-archers-in-a-remote-maharashtra-village-ytvd-2809809-2025-10-28",
      "headline": "Care Today Foundation empowers young archers in Maharashtra's WadhonaA year after we showed the story of Dipak Wanve, a teacher who doubled as an archery coach and trained his students with limited means, and now India Today Group's Care Today Foundation has stepped in to provide professional archery equipment to these aspiring athletes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-city-squad-rotation-haaland-injury-update-swansea-league-cup-clash-2809784-2025-10-28",
      "headline": "Erling Haaland could be rested for EFL Cup clash after knock: Pep GuardiolaPep Guardiola hinted that Erling Haaland maybe rested for the EFL Cup clash against Swansea City after sustaining a knock in the Premier League loss to Aston Villa. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-james-anderson-knighthood-honour-windsor-castle-2025-2809791-2025-10-28",
      "headline": "England great James Anderson receives knighthood for services to cricketEngland fast-bowling legend James Anderson has been knighted for his services to cricket. The 43-year-old, who took 704 Test wickets over a 22-year career, received the honour from the Princess Royal at Windsor Castle after retiring from Tests in 2024."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}