{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-is-young-india-really-spending-money-hint-its-not-gadgets-and-clothes-2835034-2025-12-12",
      "headline": "How is young India really spending money? Hint: It's not gadgets and clothesYoung Indians' spending habits are shifting quickly, and it's no longer about gadgets or new outfits. Here's a closer look at where their money is actually going."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cabinet-clears-100-percent-fdi-in-insurance-what-the-new-bill-means-for-the-sector-2835061-2025-12-12",
      "headline": "Cabinet clears 100% FDI in insurance: What the new bill means for the sectorThe government says the changes are designed to offer stronger protection to policyholders and bring more players into the market. This could lead to better products, faster claim settlements, and improved customer service."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/aroon-purie-rings-nse-bell-says-its-for-next-chapter-of-india-india-today-group-2835055-2025-12-12",
      "headline": "Aroon Purie rings NSE bell, says it's for next chapter of India, India Today GroupIndia Today Group Chairman and Editor-in-Chief Aroon Purie on Friday rang the closing bell at the National Stock Exchange (NSE) to mark the Group's 50-year journey and said it was for the next chapter of India and the India Today Group."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/aroon-purie-nse-closing-bell-ringing-next-chapter-india-today-nation-building-journalism-standard-2835038-2025-12-12",
      "headline": "NSE bell we ring today is for next chapter of India, India Today Group: Aroon PurieThe moment symbolised both a milestone for the media group and a nod to India's financial markets, which have grown alongside the Group's own evolution since 1975."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/video-nse-felicitates-india-today-group-chairman-aroon-purie-on-50-year-milestone-2835027-2025-12-12",
      "headline": "Video: NSE felicitates India Today Group Chairman Aroon Purie on 50-year milestoneNational Stock Exchange (NSE) MD & CEO Ashish Kumar Chauhan on Friday felicitated India Today Group Chairman Aroon Purie as the Group completed 50 years at a ceremony in Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/retail-inflation-rises-to-071-in-november-from-025-in-october-2835031-2025-12-12",
      "headline": "Retail inflation rises to 0.71% in November from 0.25% in OctoberFood inflation remained in deflation for the sixth straight month, but the pace of decline narrowed sharply. The Consumer Food Price Index showed a contraction of 3.91% in November, compared to a much steeper 5.02% fall in October."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/silver-prices-cross-rs-2-lakh-milestone-is-there-more-upside-left-2835028-2025-12-12",
      "headline": "Silver prices cross Rs 2 lakh milestone: Is there more upside left?Silver has been on a strong upward streak over the past month, supported by a softer US dollar, falling global interest rates and renewed buying in industrial commodities. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/video-india-today-chairman-aroon-purie-rings-nse-bell-to-mark-itgs-50-years-2835021-2025-12-12",
      "headline": "Video: India Today Chairman Aroon Purie rings NSE bell to mark ITG's 50 yearsIndia Today Group Chairman and Editor-in-Chief Aroon Purie rang the NSE bell on Friday to mark the Group's 50 years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-450-points-higher-nifty-above-26000-tata-steel-up-3-percent-2835012-2025-12-12",
      "headline": "Sensex ends 450 points higher, Nifty above 26,000; Tata Steel up 3%Sensex ends 450 points higher, Nifty above 26,000; Tata Steel up 3%"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-deal-talks-agriculture-market-refuse-to-open-defence-energy-okay-piyush-goyal-trump-tariff-2835007-2025-12-12",
      "headline": "India–US trade deal talks move forward, but Delhi refuses to open agriculture marketIndia has refused to allow American agricultural products into the Indian market. India believes that permitting US farm goods would increase competitive pressure on domestic farmers and reduce their income. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/the-heirs-dilemma-why-silence-around-money-is-leaving-families-unprepared-2834990-2025-12-12",
      "headline": "Unclaimed wealth is rising in India. How silence around money is costing familiesA growing number of Indian families are learning that wealth without communication can turn into confusion, conflict and costly mistakes. The solution begins long before any will is written."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/from-tds-gaps-to-bank-errors-why-your-itr-refund-is-delayed-and-what-to-do-now-2834954-2025-12-12",
      "headline": "From TDS gaps to bank errors: Why your ITR refund is delayed and what to do nowSeveral taxpayers in India have not received their income tax refunds for the assessment year 2025-26, with delays attributed to verification errors and compliance checks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/inside-the-world-of-indias-ultra-rich-what-they-buy-how-they-live-2834890-2025-12-12",
      "headline": "Inside the world of India's ultra-rich: What they buy, how they liveHow are India's wealthiest families redefining luxury today, and what do their latest spending habits reveal about their lifestyles? Let's have a look."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-dharavi-redevelopment-plan-new-home-keys-first-demolition-later-2834864-2025-12-12",
      "headline": "Keys to new homes first, then redevelopment begins: Pranav Adani on Dharavi planPranav Adani said that the Dharavi project is finally progressing with a concrete plan to build around 2 lakh new homes, ensuring residents are moved into these units before any demolition or redevelopment of old structures begins."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/nps-expands-investment-options-now-gold-silver-etfs-and-nifty-250-picks-allowed-2834859-2025-12-12",
      "headline": "NPS expands investment options: Now gold, silver ETFs and Nifty 250 picks allowedIndia's pension regulator issues updated unified investment rules for pension schemes, introducing clearer limits and a wider range of asset classes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/new-labour-codes-take-home-salary-pf-contribution-math-explained-2834849-2025-12-12",
      "headline": "New labour codes: No, your take-home salary isn't reducing. Here's the mathFears of reduced take-home salaries have surged since the new labour codes were notified, but a closer look at the PF calculation shows the impact may not be what many employees expect."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hindustan-zinc-shares-rise-silver-prices-metals-sector-momentum-2834830-2025-12-12",
      "headline": "Hindustan Zinc share price jumps over 3%: Why is the stock rising today?Hindustan Zinc's share price advanced over 3% in Friday trading, continuing its upward momentum amid rising silver prices and sector-wide gains in metals stocks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-gains-400-points-nifty-nears-26000-strong-domestic-global-cues-2834819-2025-12-12",
      "headline": "Sensex jumps over 400 points: Why is the stock market rising todayIndian stock markets opened higher on Friday, buoyed by improved global cues and robust domestic investor activity. Experts highlight the role of the US Federal Reserve's rate cut, domestic retail inflows, and stable earnings outlook in supporting the rally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-300-points-lower-nifty-above-25900-lt-gains-2-percent-2834812-2025-12-12",
      "headline": "Sensex opens 300 points higher, Nifty above 25,900; L&T gains 2%The S&P BSE Sensex was up by 360.58 points to 85,178.71, while the NSE Nifty50 added 106.90 points to 26,005.45 as of 9:29 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/icici-prudential-amc-ipo-review-rs-10602-crore-price-band-gmp-subscribe-skip-details-2834808-2025-12-12",
      "headline": "ICICI Prudential IPO opens for bidding today: Subscribe or skip?ICICI Prudential AMC opens its highly anticipated IPO for public subscription, offering an opportunity for investors to consider entry into one of India's largest asset management companies."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/exclusive-saali-mohabbat-radhika-apte-not-big-on-morality-but-ethics-2835276-2025-12-12",
      "headline": "Exclusive I Saali Mohabbat's Radhika Apte: Not big on morality but ethics Actor Radhika Apte discusses her selective approach to roles, driven by sharp instincts and a search for complexity. Apte, who features in 'Saali Mohabbat', speaks to India Today on drawing the line based on a film's ethical vision, viewing morality as a \"society-made thing\" that hinders empathy.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-jungkook-exhibition-opens-in-mumbai-fans-chants-and-his-golden-era-2835256-2025-12-12",
      "headline": "BTS' Jungkook's exhibition opens in Mumbai: Fans, chants and ​his Golden era Fans gathered in Bandra as 'Golden: The Moments', BTS and Jungkook's first official activity in India, opens, offering immersive exhibits and a space for community engagement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/emotional-amitabh-bachchan-humbled-by-sea-of-fans-outside-his-jalsa-home-2835234-2025-12-12",
      "headline": "Emotional Amitabh Bachchan humbled by sea of fans outside his home Jalsa Actor Amitabh Bachchan shared videos of a \"sea of fans\" cheering outside his Jalsa residence on Sunday. Moved by their \"immeasurable\" love, the 83-year-old actor humbly questioned his worthiness, asking what he had done \"to be deserving of such\" devotion from the massive crowd."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/euphoria-season-3-first-footage-teases-whats-in-store-for-zendaya-sydney-sweeney-2835193-2025-12-12",
      "headline": "Euphoria Season 3 first footage teases what's in store for Zendaya, Sydney Sweeney The first 'Euphoria Season 3' footage confirms Zendaya's Rue is deep in trouble, in debt to Laurie and running. The show is set for its HBO premiere in April 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/exo-to-release-winter-single-im-home-ahead-of-their-2026-group-comeback-2835191-2025-12-12",
      "headline": "EXO to release winter single I'm Home ahead of their 2026 group comeback EXO is making a seasonal comeback with their new single 'I'm Home'. The release hints at a sentimental 2026 album and features six of the original nine members, stirring mixed emotions among fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-joins-dhurandhar-meme-party-jokes-about-discovering-akshaye-khanna-2835183-2025-12-12",
      "headline": "Akshay Kumar joins Dhurandhar meme party, jokes about discovering Akshaye Khanna Akshaye Khanna's performance in the recently released Dhurandhar sparks a renewed wave of appreciation. Now, Akshay Kumar reacted to a meme celebrating Khanna's popularity and performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ram-charan-peddi-kicks-off-new-hyderabad-schedule-to-wrap-up-by-january-end-2835148-2025-12-12",
      "headline": "Ram Charan's Peddi kicks off new Hyderabad schedule, to wrap up by January-end Ram Charan's Peddi began a crucial new schedule in Hyderabad, with some emotionally heavy and action-driven scenes slated. The dialogue portions of the film are expected to wrap by the end of January, keeping the unit right on track for the March 2026 theatrical release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/keerthy-suresh-celebrates-1st-anniversary-with-wedding-video-watch-2835129-2025-12-12",
      "headline": "Keerthy Suresh marks anniversary with Goa wedding reel: Core day, core memory Actor Keerthy Suresh and her husband Antony Thattil celebrated their first anniversary on Friday. The couple posted a video that captures memorable moments from their Hindu and Christian wedding ceremonies held in Goa a year ago."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-cries-recalling-terror-attack-in-the-end-of-an-era-documentary-series-2835090-2025-12-12",
      "headline": "Taylor Swift cries recalling terror attack in The End of an Era documentary series Taylor Swift was seen shedding tears and sharing her anxieties regarding the thwarted Eras Tour terror attack in the premiere episode of 'The End of an Era'. The documentary series is available for streaming on JioHotstar in India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/r-madhavan-hits-back-at-dhurandhar-criticism-one-wonders-if-there-is-an-agenda-2835070-2025-12-12",
      "headline": "R Madhavan hits back at Dhurandhar criticism: One wonders if there is an agenda Actor R Madhavan responds to criticism and negative reviews surrounding 'Dhurandhar'. He linked the early negative reviews to a pattern seen in his previous films and raised concerns about the influence of such reviews on public perception."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/richa-chadha-on-postpartum-pain-industry-betrayals-and-returning-to-work-2835050-2025-12-12",
      "headline": "Richa Chadha on postpartum pain, industry betrayals and returning to work Richa Chadha shared her experiences returning to work after motherhood, addresses professional challenges, and questions the demands of social media on public figures. She welcomed her daughter, Zuneyra, in 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/kate-winslet-shares-a-wild-story-when-eminem-asked-her-to-shave-his-butt-2835086-2025-12-12",
      "headline": "Kate Winslet shares a wild story: When Eminem asked her to shave his butt Kate Winslet revealed on the Graham Norton Show an unusual encounter with Eminem during her first Saturday Night Live appearance, sharing how a surprising request added to her nerves on the show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dhurandhars-ayesha-khan-says-she-was-told-to-fix-her-nose-teeth-for-roles-2835025-2025-12-12",
      "headline": "Dhurandhar's Ayesha Khan says she was told to 'fix' her nose, teeth for roles Actor Ayesha Khan has spoken about receiving suggestions to undergo cosmetic changes for more opportunities. She recently featured in the song 'Shararat' from 'Dhurandhar' and the film 'Kis Kisko Pyaar Karoon 2'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/man-vs-baby-review-rowan-atkinson-wordless-pain-saves-sugary-festive-fare-2835010-2025-12-12",
      "headline": "Man vs Baby review: Rowan Atkinson's wordless pain saves sugary festive fareRelease Date:Thu Dec 11, 2025 In the Christmas comedy series Man vs Baby, Rowan Atkinson embodies the quiet struggle of Trevor Bingley, a man enduring personal loss and societal disregard, using minimal dialogue to convey deep emotion in an otherwise predictable holiday narrative. Here's our review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/akhanda-2-x-review-internet-calls-nandamuri-balakrishnas-film-meme-material-2835026-2025-12-12",
      "headline": "Akhanda 2 X review: Internet calls Nandamuri Balakrishna's film meme material Akhanda 2, starring Nandamuri Balakrishna, released amid great hype but met with mixed reactions due to its illogical plot and over-the-top action. Fans seeking typical Boyapati-style entertainment found some enjoyment, while critics and audiences largely expressed disappointment with the film's writing and execution."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/padayappa-re-release-rajinikanth-75th-birthday-iconic-tamil-film-2834982-2025-12-12",
      "headline": "Padayappa at 25: What aged well and what didn't in Rajinikanth's timeless drama Padayappa has been re-released in theatres to celebrate Rajinikanth's 75th birthday and 25 years of the film. The re-release sparks discussions about its timeless appeal and outdated gender views."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rohit-shetty-thinks-dhurandhar-is-a-monster-declares-it-the-new-hindi-cinema-2835014-2025-12-12",
      "headline": "Rohit Shetty thinks Dhurandhar is a monster, declares it the new Hindi cinema Rohit Shetty praised Aditya Dhar's Dhurandhar, calling it a \"monster\" and declaring it the face of bold, new Hindi cinema that \"will break in and hit hard.\" "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/randeep-hooda-begins-shoot-for-eetha-opposite-shraddha-kapoor-see-pic-2834973-2025-12-12",
      "headline": "Randeep Hooda begins shoot for Eetha opposite Shraddha Kapoor. See pic Randeep Hooda has started filming for his upcoming movie 'Eetha' opposite Shraddha Kapoor in Pune. This would mark their first on-screen collaboration under director Laxman Utekar and Maddock Films."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/christmas-karma-review-kunal-nayyar-anchors-a-tale-of-ghosts-and-redemption-2834958-2025-12-12",
      "headline": "Christmas Karma review: Kunal Nayyar anchors a tale of ghosts and redemptionRelease Date:Fri Dec 12, 2025 'Christmas Karma' tells the story of a bitter businessman transformed by festive ghosts. The film mixes music with the magic of Charles Dickens' A Christmas Carol, to explore the festival through an Indian's lens and deliver life lessons."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-bill-clinton-bill-gates-others-feature-in-19-new-photos-obtained-from-jeffrey-epsteins-estate-2835224-2025-12-12",
      "headline": "Trump, Clinton, Gates in 19 new photos obtained from Jeffrey Epstein's estateTrump has made clear that his relationship with Epstein ended around 2004, well before the latter's first arrest. The Republican leader has repeatedly maintained that he had no involvement in any wrongdoing connected to Epstein."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/cant-cap-airfares-for-whole-year-ticket-prices-surge-during-festive-season-aviation-minister-to-parliament-2835106-2025-12-12",
      "headline": "Can't cap airfares year-round, prices surge during festivals: Aviation MinisterThe Aviation Minister told the Lok Sabha that a deregulated aviation market benefits consumers and that the government cannot cap airfares throughout the year."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-pm-shehbaz-sharif-waits-minutes-before-entering-putin-erdogan-meeting-turkmenistan-2835218-2025-12-12",
      "headline": "Video: Impatient Pak PM gatecrashes Putin-Erdogan huddle after 40-minute waitPakistani Prime Minister Shehbaz Sharif barged into a room where Russian President Vladimir Putin and Turkey's Recep Tayyip Erdogan were holding a closed-door meeting in Turkmenistan, triggering a field day on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/jailed-isi-chief-faiz-hamid-to-testify-against-imran-khan-jail-case-asim-munir-tightens-grip-pakistan-faiz-hameed-2835069-2025-12-12",
      "headline": "Jailed ISI ex-chief to testify against Imran Khan as Munir tightens chokeholdEx-ISI chief Faiz Hamid, who has been sentenced to 14 years in jail, is going to testify against jailed former PM Imran Khan, claimed a Pakistani senator. Imran removed Asim Munir, the now chief of defence staff, to make Hamid the ISI chief. Munir is likely using the ex-spymaster to further trap his arch rival."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/cabinet-clears-heci-bill-to-set-up-single-higher-education-regulator-in-india-2835188-2025-12-12",
      "headline": "UGC, AICTE, NCTE to go: Bill cleared to bring one higher education regulatorThe Union Cabinet has approved the HECI Bill, now renamed Viksit Bharat Shiksha Adhikshan Bill, paving the way for a single higher education regulator to replace the UGC, AICTE, and NCTE. The new body will handle regulation, accreditation, and standards as proposed under NEP 2020, marking a major overhaul of India's higher education system."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/vladimir-putins-playful-wink-at-reporter-after-talks-with-erdogan-sparks-buzz-video-glbs-2835293-2025-12-13",
      "headline": "Watch: Putin's playful wink at reporter after talks with Erdogan sparks buzzPutin's wink at a reporter after talks with Erdogan went viral, overshadowing reports that Pakistan PM Shehbaz Sharif briefly gate-crashed their meeting after waiting 40 minutes for his own session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/pakistan-lahore-university-sanskrit-courses-mahabharat-bhagavad-gita-2835112-2025-12-12",
      "headline": "Sanskrit, courses on Mahabharat in Pak university, 1st time since PartitionApart from passages from the Bhagavad Gita, Pakistani students are also being introduced to the Urdu rendering of 'Hai katha sangram ki', the iconic theme song of the Mahabharat TV series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-announces-thailand-cambodia-ceasefire-after-fresh-border-clashes-glbs-2835286-2025-12-12",
      "headline": "Trump announces Thailand–Cambodia ceasefire after fresh border clashesDonald Trump said Thailand and Cambodia agreed to halt border hostilities Friday after speaking with their leaders, committing to revive a Malaysia-backed peace accord following recent deadly clashes this week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/700-sinkholes-destroy-turkeys-farms-whats-behind-the-mysterious-phenomenon-2835215-2025-12-12",
      "headline": "700 sinkholes destroy Turkey's farms: What is really happening?The surge in dramatic sinkholes tearing through central Turkey's farmland is being driven by a dangerous mix of geology, extreme drought and decades of over‑pumping groundwater for irrigation, scientists and officials say.​"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/indigo-parent-company-tickets-flight-status-air-deccan-cheap-tickets-air-deccan-interglobe-aviation-history-airbus-dgca-2834694-2025-12-12",
      "headline": "Why founder of India's first low-cost airline accused IndiGo parent of sabotageCaptain R Gopinath brought Air Deccan in 2003 and introduced the LCC (low-cost carrier) model to India. But he had to sell Air Deccan to Vijay Mallya under pressure from investors after the airline made losses. Gopinath, the pioneer of budget air travel in India, blamed InterGlobe Aviation, IndiGo's parent company, for sabotaging Air Deccan. This is how and why."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/himanta-biswa-sarma-miya-muslims-statement-kidney-muslim-but-not-votes-demographic-invasion-assam-2835177-2025-12-12",
      "headline": "Can give you my kidney, not my vote: Assam CM on what a Miya Muslim told himAssam Chief Minister Himanta Biswa Sarma claimed a Miya Muslim, appreciative of the work done by him, once told him that he would \"donate a kidney\" for the BJP leader but wouldn't vote for him. Sarma used the anecdote to claim that voting was done on ideological convictions, not welfare schemes or personal goodwill."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/keep-your-little-ones-cozy-this-winter-with-amazon-everyday-essentials-2833300-2025-12-09",
      "headline": "Keep Your Little Ones Cozy This Winter with Amazon Everyday EssentialsWhether you're looking to care for little ones or find the perfect gift, this collection of baby and kids' essentials brings together nourishment, comfort, and thoughtful design."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/the-loneliest-job-dhurandhar-raazi-and-the-hidden-emotional-toll-of-being-a-spy-2834057-2025-12-12",
      "headline": "The loneliest job: Dhurandhar, Raazi and the hidden emotional toll of being a spyIndian cinema is gradually learning to understand the spy as a man who can't afford much of a happy personal life. Films like 'Dhurandhar' and 'Raazi', and the show, 'The Family Man', are examples. IndiaToday.in reflects on stories that peel back glamour to reveal a human cost no gadget can fix.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/india-modi-trump-core-5-superclub-russia-china-japan-g7-alternative-2834979-2025-12-12",
      "headline": "Is Trump planning a secretive Core-5 superclub with India?President Donald Trump is reportedly toying with an audacious idea - a 'Core 5' superclub including the US, Russia, China, India, and Japan. Trump is looking to position it as a potential alternative to the G7."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-jiostar-deny-breakup-rumours-broadcast-deal-continues-2835216-2025-12-12",
      "headline": "JioStar and ICC deny break-up rumours, to continue broadcast partnershipThe ICC and JioStar has refuted claims of an imminent breakup in their broadcasting partnership with a joint statement on Friday, December 12. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/siddaramaiah-denies-delhi-summons-media-speculation-karnataka-chief-minister-travel-plans-2835158-2025-12-12",
      "headline": "Did they tell you? Siddaramaiah snaps at reporter for asking about summon to DelhiChief Minister Siddaramaiah displayed visible frustration when questioned by reporters about being summoned to Delhi. He firmly denied any such communication."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/r-madhavan-hits-back-at-dhurandhar-criticism-one-wonders-if-there-is-an-agenda-2835070-2025-12-12",
      "headline": "R Madhavan hits back at Dhurandhar criticism: One wonders if there is an agendaActor R Madhavan responds to criticism and negative reviews surrounding 'Dhurandhar'. He linked the early negative reviews to a pattern seen in his previous films and raised concerns about the influence of such reviews on public perception."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/mark-mitchell-de-indianise-us-companies-india-brilliance-american-dream-2835073-2025-12-12",
      "headline": "Mitchell's 'de-Indianisation' delusion: India's brilliance powers American dreamPollster Mark Mitchell's xenophobic threat to purge Indians ignores history's irony and parades the threat as a self-destructive policy.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/explained-winners-and-losers-of-mexicos-new-tariff-strike-on-india-2834661-2025-12-12",
      "headline": "Explained: Winners and losers of Mexico's new tariff strike on India Starting January 1, 2026, Mexico will impose tariffs of 5%–50% on 1,460 products from non-FTA countries, targeting cheap Chinese imports but severely impacting India's auto, steel, textile, and chemical exports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/canada-news/story/video-of-brampton-shooting-canada-three-indian-origin-truckers-south-asian-arrested-suspect-peel-region-gun-violence-crime-2834959-2025-12-12",
      "headline": "Canada truckers' shoot-out caught on video; 3 Indian-origin suspects heldThree Indian-origin truckers were arrested in Brampton, Canada, for their alleged involvement in a tow-truck-related shooting. One suspect is still at large. Both involved groups were reportedly of South Asian descent. Authorities have released a video and a photo of the suspect, urging the public to share information."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-joins-dhurandhar-meme-party-jokes-about-discovering-akshaye-khanna-2835183-2025-12-12",
      "headline": "Akshay Kumar joins Dhurandhar meme party, jokes about discovering Akshaye KhannaAkshaye Khanna's performance in the recently released Dhurandhar sparks a renewed wave of appreciation. Now, Akshay Kumar reacted to a meme celebrating Khanna's popularity and performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rivaba-jadeja-wife-rivaba-claims-indian-cricketers-have-addictions-2834946-2025-12-12",
      "headline": "Ravindra Jadeja's wife claims Indian cricketers indulge in vices, husband is cleanRivaba Jadeja has claimed that several Indian cricketers indulge in several vices during overseas tours. She stressed, however, that her husband Ravindra Jadeja remains disciplined and free from such vices despite the habits of others in the team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/dhurandhar-akshaye-khanna-singlehood-carefree-life-india-2834394-2025-12-12",
      "headline": "What Akshaye Khanna said about marriage 14 years ago is India's reality todayIn a now-viral 14-year-old interview, Akshaye Khanna said he preferred a carefree, responsibility-free life and therefore did not want to marry. Today, many Indians find themselves living out those very views, choosing to remain single to protect their emotional well-being and prioritise their careers and ambitions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/indian-origin-man-arrested-after-crashing-tesla-into-cars-attempting-fire-at-california-sarotoga-winery-us-mental-health-2835135-2025-12-12",
      "headline": "Indian-American entrepreneur tries to burn down winery, crashes Tesla into carsA 42-year-old Indian-origin businessman was arrested in California after he allegedly tried to start a fire at a winery after crashing his Tesla into two parked cars. Beri Vikram, the founder of a mental health platform, faces charges of assault with a deadly weapon and resisting arrest."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/antim-panghal-wins-gold-2025-senior-national-wrestling-championship-55kg-2835284-2025-12-13",
      "headline": "Olympian Antim Panghal dazzles in wrestling nationals, clinches gold medal Antim Panghal secured gold in the women's 55kg category as Haryana topped the team standings on the opening day of the Senior National Wrestling Championship on Friday, December 12. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/assam-cricket-players-suspended-corruption-syed-mushtaq-ali-trophy-2025-2835237-2025-12-12",
      "headline": "Four Assam players suspended for alleged corruption in Syed Mushtaq Ali Trophy 2025 The Assam Cricket Association has suspended four players following allegations of involvement in corrupt practices during the Syed Mushtaq Ali Trophy 2025, barring them from all cricket-related activities while investigations continue."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-2025-jofra-archer-gold-chain-ryan-harris-advice-ricky-ponting-2835228-2025-12-12",
      "headline": "Ashes 2025: Jofra Archer given cheeky gold chain advice by Ex-AUS pacer Former Australia pacer Ryan Harris took a cheeky dig at Jofra Archer, saying that the England pacer should ditch the big gold chain that he wears while playing to improve his delivery speed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-jiostar-deny-breakup-rumours-broadcast-deal-continues-2835216-2025-12-12",
      "headline": "JioStar and ICC deny break-up rumours, to continue broadcast partnership The ICC and JioStar has refuted claims of an imminent breakup in their broadcasting partnership with a joint statement on Friday, December 12. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-form-under-spotlight-india-t20i-squad-south-africa-series-2835192-2025-12-12",
      "headline": "What's going wrong with Shubman Gill in T20Is? Coach offers a strange explanation India vs South Africa: Shubman Gill's prolonged lean patch and India's continued backing of him have placed the spotlight firmly on the young opener as India prepare for next year's T20 World Cup. Gill has averaged less than 25 and hasn't hit a fifty yet in T20Is this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhav-suryavanshi-on-being-googled-more-than-virat-kohli-see-it-move-on-2835174-2025-12-12",
      "headline": "Vaibhav Suryavanshi on being Googled more than Virat Kohli: I see it, I move on India's 14-year-old sensation Vaibhav Suryavanshi has reacted calmly to being Googled more than Virat Kohli after his explosive 171 against UAE in the U19 Asia Cup. The young opener says fame does not distract him as he focuses on preparation and improving his game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/brock-lesnar-roman-reigns-tribute-john-cena-retirement-final-wwe-match-2835172-2025-12-12",
      "headline": "I can see you: Cena gets tribute from Lesnar, Reigns ahead of WWE retirement Brock Lesnar and Roman Reigns sent emotional messages to John Cena ahead of his retirement from WWE. Cena will hang up his boots on December 13 at Saturday Night's main event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/punjab-vs-jharkhand-syed-mushtaq-ali-trophy-record-chase-kumar-kushagra-ipl-gujarat-titans-2835154-2025-12-12",
      "headline": "Jharkhand keeper repays Gujarat Titans faith, inspires highest-ever SMAT chase Kumar Kushagra scored an unbeaten 86 to help Jharkhand chase the highest total in Syed Mushtaq Ali Trophy history against Punjab in Pune on December 12. The 21-year-old wicketkeeper-batter has been retained by Gujarat Titans ahead of the IPL 2026 mini-auction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/arne-slot-talks-with-mohamed-salah-liverpool-future-in-doubt-2835150-2025-12-12",
      "headline": "Arne Slot to hold talks with Salah, conversation to determine future with Liverpool Liverpool coach Arne Slot says he is in talks with Mohamed Salah after the forward's explosive outburst raised fresh doubts over his future at Anfield. Salah, frustrated by being dropped and left out of key games, claimed the club had thrown him \"under the bus\" as tensions between player and manager continue to rise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-t20is-sanju-samson-open-shubman-gill-irfan-pathan-reality-check-2835138-2025-12-12",
      "headline": "If Samson opens again, can't expect him to perform: Irfan Pathan gives reality-check IND vs SA: Irfan Pathan has raised concerns about India's top-order stability, warning that Shubman Gill's prolonged slump is putting pressure on both the player and the team management. He also highlighted captain Suryakumar Yadav's ongoing struggles and the uncertainty surrounding a possible return for Sanju Samson."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/james-anderson-appointed-lancashire-county-championship-captain-aiming-promotion-2835126-2025-12-12",
      "headline": "43, retired but new captain: Anderson dons new role with Lancashire James Anderson has been appointed as Lancashire's County Championship captain ahead of the new season. Anderson aims for promotion back to Division One after a challenging 2025 season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/quinton-de-kock-on-comeback-hunger-to-play-no-return-to-tests-2835099-2025-12-12",
      "headline": "Renewed hunger for white-ball, but Quinton de Kock rules out Test returnQuinton de Kock said that he has found renewed hunger to play white-ball cricket for South Africa but ruled out a return to Tests. De Kock made his return to play for South Africa in ODIs and T20Is in 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/david-warner-on-usman-khawaja-opening-ashes-third-test-adelaide-2835008-2025-12-12",
      "headline": "David Warner backs Usman Khawaja to replace Travis Head as opener in AdelaideDavid Warner has publicly supported Usman Khawaja's return to the opening slot for the third Ashes Test in Adelaide, urging selectors to keep Travis Head at No. 5 and maintain stability in the Australian batting order."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-goat-tour-india-meet-and-greet-ticket-ten-lakhs-price-delhi-mumbai-2834999-2025-12-12",
      "headline": "Want to shake hands with Lionel Messi? You can if you pay Rs 10 lakhLionel Messi's GOAT Tour has sparked excitement, but the Rs 10 lakh price tag for a handshake has stunned fans. The Meet and Greet is shaping up to be the most exclusive experience of his India visit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/m-chinnaswamy-stadium-cleared-for-cricket-karnataka-cabinet-approves-safety-upgrades-ipl-bengaluru-2834989-2025-12-12",
      "headline": "IPL in Bengaluru? Chinnaswamy Stadium gets government go-ahead to host matches againBengaluru's Chinnaswamy Stadium edges closer to normal duty as Karnataka clears matches in principle, but play can resume only after major safety upgrades recommended by the D'Cunha Commission are fully implemented."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-vs-sanju-samson-india-vs-south-africa-t20i-ex-batter-2834963-2025-12-12",
      "headline": "Why is Shubman Gill vice-captain? Ex-batter says pained by Sanju Samson T20I snubIndia vs South Africa: Former India batter Subramaniam Badrinath said he has been pained to see Sanju Samson warming the bench in T20Is despite scoring three hundreds in the last 12 months. He also questioned the team management's continued backing of Shubman Gill."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nitish-kumar-reddy-hattrick-syed-mushtaq-trophy-andhra-vs-madhya-pradesh-2834974-2025-12-12",
      "headline": "Nitish Kumar Reddy takes hattrick in SMAT, RCB captain one of his victimsNitish Kumar Reddy stole the spotlight with a brilliant hat-trick that included Rajat Patidar's wicket. Andhra still fell short, but his triple strike remained the defining moment of the SMAT clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rivaba-jadeja-wife-rivaba-claims-indian-cricketers-have-addictions-2834946-2025-12-12",
      "headline": "Ravindra Jadeja's wife claims Indian cricketers indulge in vices, husband is cleanRivaba Jadeja has claimed that several Indian cricketers indulge in several vices during overseas tours. She stressed, however, that her husband Ravindra Jadeja remains disciplined and free from such vices despite the habits of others in the team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/wrestler-vinesh-phogat-makes-retirement-u-turn-sets-sights-on-2028-la-olympics-ytvd-2834944-2025-12-12",
      "headline": "Wrestler Vinesh Phogat Makes Retirement U-Turn, Sets Sights On 2028 LA OlympicsIn a major development for Indian sports, wrestler Vinesh Phogat has announced a U-turn on her retirement, confirming her decision to return to the mat and target the 2028 Los Angeles Olympics. Speaking on India Today, Principal Correspondent Nitin Srivastava reports that the 31-year-old athlete is driven by her 'unfulfilled dream' of winning an Olympic medal, following her heartbreaking disqualification at the Paris Olympics in 2024. Phogat, who gave birth to a baby boy in July 2025, stated that she will have her 'young cheerleader' by her side for this second innings. Srivastava highlights the crucial support of her husband and fellow wrestler, Somvir Rathee, in her preparation. The report underscores Phogat's determination to overcome past setbacks and reclaim her position on the global stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-rohit-sharma-new-ad-srmb-steel-kite-flying-watch-video-2834941-2025-12-12",
      "headline": "Watch: MS Dhoni and Rohit Sharma flaunt their bromance in new adMS Dhoni and Rohit Sharma's latest ad has given fans a fresh dose of their easy chemistry. Their playful kite-flying banter in the ad has quickly become a favourite moment online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/karnataka-cabinet-reportedly-approves-cricket-matches-at-chinnaswamy-stadium-with-safety-riders-ytvd-2834917-2025-12-12",
      "headline": "Karnataka Approves Matches At Chinnaswamy Stadium, But Only After Safety Checks​​​​​​​The Karnataka cabinet has cleared the way for matches at Chinnaswamy Stadium, but only on tough conditions. A committee report flagged earlier structural and safety lapses, forcing the government to tighten the checklist before reopening the gates. Under the decision, the Home Department will issue the final nod once every recommendation is fulfilled. With a busy cricket season around the corner, the approval is seen as a critical step and a warning that the stadium won't get a free pass this time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/vinesh-phogat-retirement-uturn-los-angeles-olympics-wrestler-2834894-2025-12-12",
      "headline": "Vinesh Phogat's big retirement U-turn after Paris heartbreak, eyes 2028 LA OlympicsVinesh Phogat said on Friday, December 12, that she will return to the mat to chase her Olympic dreams. The 31-year-old had retired from wrestling after the heartbreaking episode at the Paris Olympics. Vinesh gave birth to a baby boy in July, and she said she will have her young cheerleader by her side in the second innings of her career."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/delhi-high-court-orders-google-meta-x-remove-fake-sunil-gavaskar-content-2834881-2025-12-12",
      "headline": "Google, Meta, X ordered to remove fake content at Sunil Gavaskar's requestUnder the court's instructions, Sunil Gavaskar must submit specific URLs, and the three tech giants are required to take action within a week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhav-suryavanshi-56-ball-century-under-19-asia-cup-india-vs-uae-2834878-2025-12-12",
      "headline": "Vaibhav Suryavanshi misses record 200, hits 95-ball 171 in U19 Asia CupVaibhav Suryavanshi missed his maiden 200 as he scored a breathtaking 95-ball 171 in the Under 19 Asia Cup against UAE. He slammed nine fours and 14 sixes during his breathtaking innings, registering his 6th hundred in 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/roger-federer-australia-open-return-exhibition-match-watch-video-confirms-2834874-2025-12-12",
      "headline": "Watch: Roger Federer confirms long-awaited Australia Open return with hilarious videoRoger Federer is set for a comeback to the Australian Open stage. Fans will get a long-overdue chance to celebrate his legacy in Melbourne."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/englands-bazball-approach-needs-balance-says-david-willey-ashes-struggles-2834838-2025-12-12",
      "headline": "Bazball is great, but England go too far with it sometimes: David WilleyDavid Willey believes England's Bazball approach is innovative but warns that players must adapt to situations, especially as England trail Australia 0-2 in the Ashes. Willey highlights missed opportunities and calls for accountability and refinement in England's strategy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-what-wrong-shubman-gill-t20i-opener-slump-robin-uthappa-2834836-2025-12-12",
      "headline": "What wrong has Sanju Samson done? Ex-teammate questions Gambhir on live TVRobin Uthappa called out India's decision to drop Sanju Samson from the opening slot in T20Is. With Shubman Gill struggling, his criticism has put fresh spotlight on India's T20I selection."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jacob-duffy-5-wicket-haul-new-zealand-nine-wicket-win-west-indies-second-test-2834823-2025-12-12",
      "headline": "NZ vs WI 2nd Test: Jacob Duffy's 5-for sets up 9-wicket win for NZ in WellingtonJacob Duffy's outstanding bowling performance led New Zealand to a nine-wicket victory over West Indies in the second Test at Basin Reserve. This win gives New Zealand a 1-0 lead in the three-match series with the final Test set to be played on December 18."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nikhil-chaudhary-ipl-virat-kohli-exclusive-interview-australia-big-bash-2834417-2025-12-12",
      "headline": "Idolising Virat Kohli, Nikhil Chaudhary dreams IPL stint with RCB legendIn an exclusive interview with India Today Digital, Nikhil Chaudhary spoke about his admiration for Virat Kohli and Kevin Pietersen, and shared his dream of representing Royal Challengers Bangalore in the Indian Premier League.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ryan-ten-doeschate-on-suryakumar-yadav-shubman-gill-poor-t20i-form-2026-world-cup-2834796-2025-12-12",
      "headline": "Gill, Suryakumar's form not a concern, they'll come good soon: Assistant coachIndia assistant coach Ryan ten Doeschate has defended captain Suryakumar Yadav and vice-captain Shubman Gill amid their poor T20I form. He expressed confidence that both players will regain form ahead of the 2026 T20 World Cup set to be hosted in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-gautam-gambhir-shubman-gill-fixation-t20-world-cup-threat-2834790-2025-12-12",
      "headline": "Is Gautam Gambhir's fixation on Shubman Gill threatening India's T20 World Cup defence?IND vs SA, 2nd T20I: Gautam Gambhir's persistence with out-of-form Shubman Gill alongside Abhishek Sharma as India's openers has intensified concerns that India's T20 World Cup title defence may be undermined by stubborn selection and ignored warning signs."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}