{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/microsoft-ceo-satya-nadella-shifts-focus-to-ai-elevates-judson-althoff-to-lead-commercial-unit-2796469-2025-10-01",
      "headline": "Satya Nadella bets big on AI, names Judson Althoff to lead Microsoft commercial unitMicrosoft has elevated Chief Commercial Officer Judson Althoff as CEO of its commercial business, allowing Satya Nadella to focus on AI, datacenter buildout, and product innovation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-the-price-of-gold-keeps-breaking-records-business-news-2796426-2025-10-01",
      "headline": "Why the price of gold keeps breaking recordsBullion has soared more than 45% this year, putting it on track for the biggest annual gain since 1979.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adar-poonawalla-in-talks-to-buy-royal-challengers-bangalore-rcb-stake-united-spirits-shares-update-2796326-2025-10-01",
      "headline": "Adar Poonawalla in talks to buy RCB stake? United Spirits shares updateThe CEO of Serum Institute, Adar Poonawalla, is in talks with Diageo to purchase a stake in RCB, one of the Indian Premier League's top teams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/are-festive-cheer-and-auto-stocks-driving-the-market-rally-heres-what-expert-says-2796279-2025-10-01",
      "headline": "Are festive cheer and auto stocks driving the market rally?The stock market showed renewed strength, as festive season cheer and gains in auto stocks lifted investor sentiment across sectors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/da-hike-58-percent-government-employee-salary-rise-how-to-calculate-diwali-gift-arrears-2796256-2025-10-01",
      "headline": "DA hiked to 58%: What it means for government employees' salary and pensionThe Union Cabinet approved the proposal to increase the DA for central government employees and Dearness Relief (DR) for pensioners by 3%. With this revision, the DA rate now stands at 58%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-716-points-higher-nifty-above-24800-tata-motors-up-5-percent-2796231-2025-10-01",
      "headline": "Sensex ends 716 points higher, Nifty above 24,800; Tata Motors up 5%The S&P BSE Sensex jumped 715.64 points to end at 80,983.31, while the NSE Nifty50 added 225.20 points to close at 24,836.30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/this-indian-gold-lender-holds-3-times-the-gold-of-pakistan-muthoot-finance-2796225-2025-10-01",
      "headline": "This Indian gold lender holds 3 times the gold of PakistanThe country's largest gold loan provider, currently holds 209 tonnes of gold in its safe deposit boxes. This is three times the gold reserves of Pakistan and higher than the reserves of Brazil, Australia, and South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mukesh-ambani-tops-hurun-rich-list-2025-shah-rukh-khan-joins-billionaire-club-2796169-2025-10-01",
      "headline": "Shah Rukh Khan joins billionaire club, Mukesh Ambani tops Hurun India Rich ListMukesh Ambani has reclaimed the top spot on the Hurun India Rich List 2025, while Bollywood superstar Shah Rukh Khan joins the billionaire club for the first time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-rally-why-reason-sensex-600-points-nifty-jump-rbi-mpc-auto-shares-tata-motors-2796146-2025-10-01",
      "headline": "Sensex jumps 500 points: 3 reasons why markets are rising todayThe S&P BSE Sensex surged 660.64 points to 80,928.26, while the NSE Nifty50 rose 185.70 points to 24,796.80 as of 12:10 PM. The rally was broad-based on Dalal Street. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-set-to-approve-da-hike-for-employees-and-pensioners-today-sources-2796115-2025-10-01",
      "headline": "Union Cabinet approves 3% DA hike for central government employeesEarlier this year, the government had approved a 2% increase in DA in March, raising it from 53% to 55% of the basic salary and pension."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-announces-big-push-for-business-reforms-and-easier-lending-details-here-2796075-2025-10-01",
      "headline": "RBI announces big push for business reforms and easier lending. Details hereThe Reserve Bank of India has unveiled a set of measures aimed at making it easier for businesses to operate and improving access to loans. The reforms are expected to help companies, exporters, and banks alike."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-holds-repo-rate-at-55-percent-how-it-impacts-your-emis-2796058-2025-10-01",
      "headline": "RBI holds repo rate at 5.5%: How it impacts your EMIsBy keeping the repo rate unchanged at 5.5%, the RBI has signalled stability for borrowers. Home loan EMIs are likely to stay where they are, offering some relief to existing and new buyers."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/kantara-chapter-1-review-rishab-shetty-folklore-saga-is-a-spellbinding-spectacle-rukmini-vasanth-jayaram-2796510-2025-10-02",
      "headline": "Kantara Chapter 1 review: Rishab Shetty's folklore saga is a spellbinding spectacleRelease Date:Thu Oct 02, 2025 Kantara Chapter 1 movie review: Director, writer, and actor Rishab Shetty's film, also starring Rukmini Vasanth and Jayaram, explores the man vs nature conflict and land rights, blending them with divinity, folklore, myth, and faith. The film is a brilliant cinematic showcase."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshan-shares-vacation-photos-with-partner-saba-azad-fourth-anniversary-2796411-2025-10-01",
      "headline": "Hrithik Roshan shares vacation photos with partner Saba Azad on fourth anniversary Actor Hrithik Roshan marked his fourth anniversary with partner Saba Azad by sharing heartfelt note and vacation pictures. The post sparked warm reactions on social media, highlighting the couple's affectionate bond."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/frankenstein-trailer-creature-jacob-elordi-unleashes-rage-on-creator-oscar-issac-2796374-2025-10-01",
      "headline": "Frankenstein trailer: Creature Jacob Elordi unleashes rage on creator Oscar Issac The trailer of director Guillermo del Toro's 'Frankenstein' was released by Netflix on October 1, 2025. The film features Oscar Isaac and Jacob Elordi and reimagines Mary Shelley's classic tale with a modern twist."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/priya-marathe-husband-shantanu-shares-heartfelt-note-a-month-after-her-death-2796369-2025-10-01",
      "headline": "Priya Marathe's husband Shantanu shares heartfelt note a month after her death Actor Shantanu Moghe posted an emotional message marking a month since Priya Marathe's death. Priya Marathe, known for 'Pavitra Rishta', died after battling cancer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-sirish-engagement-nayanika-grandfather-birth-anniversary-2796373-2025-10-01",
      "headline": "Allu Arjun's brother Allu Sirish announces engagement to Nayanika in October Actor Allu Sirish announced his engagement to Nayanika on October 1, the birth anniversary of his grandfather, actor Allu Ramalingaiah. His brother Allu Arjun, shared a congratulatory post on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/which-marvel-actor-stars-in-jason-statham-the-beekeeper-2-find-out-here-2796380-2025-10-01",
      "headline": "Which Marvel actor stars in Jason Statham's The Beekeeper 2? Find out here Apart from new additions to the cast, Jason Statham's The Beekeeper 2 will bring back Jeremy Irons, Jemma Redgrave and Emmy Raver-Lampman in familiar roles from the first film"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sunny-sanskari-ki-tulsi-kumari-box-office-day-1-advance-booking-2796344-2025-10-01",
      "headline": "Sunny Sanskari vs Kantara Chapter 1: Varun-Janhvi film trails in advance booking 'Sunny Sanskari Ki Tulsi Kumari' is set for a Rs 2 crore opening. The film faces stiff competition from actor-director Rishab Shetty's 'Kantara: Chapter 1' at the box office."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bigg-boss-19-leads-ott-non-fiction-viewership-rise-and-fall-second-on-chart-2796312-2025-10-01",
      "headline": "Bigg Boss 19 leads OTT non-fiction with 7.5 million weekly views 'Bigg Boss 19', hosted by Salman Khan, became the most watched reality show on OTT for the week of September 22-28, 2025, with 7.5 million views. The second most-watched on the list was 'Rise & Fall'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kaun-banega-crorepati-17-contestant-quits-at-rs-1-crore-question-2796280-2025-10-01",
      "headline": "KBC 17: Contestant quits at Rs 1 crore question, can you answer it? Kaun Banega Crorepati 17 contestant Kailash Rambhau Kuntewad won Rs 50 lakh after quitting the Rs 1 crore question on Amitabh Bachchan's quiz show.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/13th-review-kota-factory-dejavu-with-a-twist-of-corporate-drama-paresh-pahuja-2796287-2025-10-01",
      "headline": "13th review: Kota Factory déjà vu with a twist of corporate dramaRelease Date:Wed Oct 01, 2025 Beyond Kota's grind and IIT's glory, SonyLiv's latest series '13th: Some Lessons Aren't Taught in Classrooms' celebrates mentorship, integrity, and the power of learning that outlives any test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/they-call-him-og-pawan-kalyan-film-adds-new-neha-shetty-dance-track-2796259-2025-10-01",
      "headline": "They Call Him OG: Pawan Kalyan's film adds a new Neha Shetty dance track Neha Shetty's dance track 'Kiss Kiss Bang Bang' has been added to 'They Call Him OG' from Tuesday evening shows. The move aims to boost theatre footfall during Dasara after ticket price normalisation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/the-taj-story-poster-controversy-shiva-temple-claims-paresh-rawal-2796245-2025-10-01",
      "headline": "Explained: Taj Mahal controversy reignited by The Taj Story poster row Taj Mahal's origins spark fresh debate after Paresh Rawal's 'The Taj Story' poster depicts a Shiva idol inside the monument. Here's why the poster is raising storm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/song-kang-completes-military-service-considers-four-hands-drama-2796242-2025-10-01",
      "headline": "Song Kang completes military service, to star in musical drama Four Hands South Korean actor Song Kang was discharged from military service on October 1, 2025. He is reviewing an offer for the lead in the upcoming drama 'Four Hands'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/farah-khan-reacts-hilariously-to-viral-reel-calling-her-films-brainrot-core-2796016-2025-10-01",
      "headline": "Farah Khan reacts hilariously to viral reel calling her films brainrot core Filmmaker Farah Khan reacted with humour to a viral reel calling her films 'Om Shanti Om', 'Happy New Year', and 'Tees Maar Khan' \"brain rot core,\" asking, \"Is brain rot a compliment??\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/balika-se-vadhu-tak-avika-gor-shares-pics-from-wedding-with-milind-chandwani-2796246-2025-10-01",
      "headline": "Balika se vadhu tak: Avika Gor shares pics from wedding with Milind Chandwani Actor Avika Gor recently shared pictures from her wedding with Milind Chandwani. The couple got married on the 'Pati Patni Aur Panga' sets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rani-mukerji-comments-eight-hour-work-shift-debate-bollywood-2796171-2025-10-01",
      "headline": "Rani Mukerji on Deepika's 8-hour rule: Worked 6–7 hours while breastfeeding Adira Actor Rani Mukerji recently weighed in on the 8-hour working shift and explained how such things can be sorted out with proper conversation. Mukerji also recalled her motherhood experience with daughter Adira.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kantara-chapter-1-advance-bookings-rishab-shetty-movie-earns-rs-18-crore-2796195-2025-10-01",
      "headline": "Kantara Chapter 1: How much did Rishab Shetty's film earn through advance booking? Rishab Shetty's 'Kantara Chapter 1' has collected over Rs 11 crore (without block seats) in advance bookings ahead of its October 2 release. The film's strong regional appeal highlights growing interest in historical narratives from coastal Karnataka."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bridgerton-season-4-first-look-out-hints-at-masquerade-and-new-leading-lady-2795991-2025-10-01",
      "headline": "Bridgerton Season 4 first look out, hints at masquerade and new leading lady The first poster for 'Bridgerton' Season 4 has been unveiled. It teases a grand masquerade and introduces Yerin Ha as Sophie Baek. The new season, set to premiere in 2026, promises romance, secrets, and drama at the heart of the beloved period saga."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/idli-kadai-review-dhanush-family-drama-homecoming-non-violence-predictable-melodrama-2796190-2025-10-01",
      "headline": "Idli Kadai review: Melodrama peaks in Dhanush's middling drama on homecomingRelease Date:Wed Oct 01, 2025 Idli Kadai movie review: Written, directed, and acted by Dhanush, 'Idli Kadai' is a family drama about homecoming and choosing non-violence to fight your battles. The film has the right messaging, but melodrama and predictability weigh it down.\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-soybean-farmers-hurt-due-to-china-will-meet-xi-jinping-in-4-weeks-says-trump-2796484-2025-10-01",
      "headline": "Trump to meet Xi in four weeks, promises aid to US farmers amid tariff warDonald Trump said he will meet Xi Jinping in four weeks, with soybeans set to be a major topic. Trump accused China of halting purchases for negotiating reasons and vowed tariff revenues would support US farmers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/kantara-chapter-1-review-rishab-shetty-folklore-saga-is-a-spellbinding-spectacle-rukmini-vasanth-jayaram-2796510-2025-10-02",
      "headline": "Kantara Chapter 1 review: Rishab Shetty's folklore saga is a spellbinding spectacleKantara Chapter 1 movie review: Director, writer, and actor Rishab Shetty's film, also starring Rukmini Vasanth and Jayaram, explores the man vs nature conflict and land rights, blending them with divinity, folklore, myth, and faith. The film is a brilliant cinematic showcase."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/cough-syrup-death-case-rajasthan-madhya-pradesh-disease-control-agency-collects-samples-as-probe-begins-2796113-2025-10-01",
      "headline": "Select cough syrups under scanner after 6 children die, samples being testedAuthorities in Madhya Pradesh and Rajasthan have launched investigations and banned specific cough syrups following multiple child deaths and illnesses. The actions aim to prevent further incidents and address public health concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/did-donald-trump-benjamin-netanyahu-trick-muslim-arab-countries-on-gaza-peace-plan-hamas-2796341-2025-10-01",
      "headline": "Did Trump, Netanyahu trick Muslim countries on Gaza peace plan?The Gaza peace deal presented to Hamas is significantly different from the one on which the US and Muslim countries agreed on earlier. Israeli President Netanyahu managed to secure \"significant 11th-hour changes\". Hamas is seeking changes in clauses, while Qatar wants discussions on the details of the deal amid outrage across the Ummah."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/where-is-asia-cup-trophy-after-acc-chief-mohsin-naqvi-fled-with-it-indian-cricket-team-bcci-apology-acc-president-dubai-2796248-2025-10-01",
      "headline": "Where is the Asia Cup trophy after Pak's Mohsin Naqvi fled with it?Mohsin Naqvi, the president of the Asian Cricket Council, fled with the Asia Cup trophy after team India refused to accept it from a Pakistani minister. It has been three days since the Indian cricket team clinched the title of Asian champions, but where is the trophy?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-unveils-rs-100-coin-at-rss-event-bharat-mata-features-on-currency-for-1st-time-2796381-2025-10-01",
      "headline": "PM unveils Rs 100 coin at RSS event, Bharat Mata features on currency for 1st timeThe Rs 100 coin features the national emblem on one side, while the other side depicts a majestic image of Bharat Mata in Varada Mudra, a gesture of offering with the palm outward, accompanied by a lion."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-offers-protection-to-energy-rich-qatar-says-attack-on-doha-a-threat-to-us-2796399-2025-10-01",
      "headline": "Trump offers protection to energy-rich Qatar, says attack on Doha a threat to USThe order highlights the \"close cooperation\" and \"shared interest\" between the US and Qatar, vowing to \"guarantee the security and territorial integrity of the state of Qatar against external attack\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-wi-1st-test-ahmedabad-preview-shubman-gill-restore-home-dominance-2796430-2025-10-01",
      "headline": "IND v WI, 1st Test: Shubman Gill's India aim to reignite home dominanceIND vs WI, 1st Test preview: India will head into a home Test series without Rohit Sharma, Virat Kohli and R Ashwin for the first time in more than a decade. With the scars of a 0-3 loss to New Zealand still remaining fresh, Shubman Gill and his men will not take the West Indies lightly. With wet weather forecast, the conditions in Ahmedabad may not be straightforward. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/travel/story/the-curious-case-of-ladakhs-pregnancy-tourism-aryan-race-2796175-2025-10-01",
      "headline": "The curious case of Ladakh's 'pregnancy tourism'The concept of pregnancy tourism takes a complete U-turn when you head deep into Ladakh's Aryan Valley, where the narrative around the phenomenon has little to do with a better life or social benefits. Here, the story is tangled up in myth, folklore, and a lingering obsession with \"racial purity.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/learn-how-adobe-express-is-making-graphic-design-fun-in-classrooms-2792611-2025-09-24",
      "headline": "Learn How Adobe Express Is Making Graphic Design Fun In ClassroomsThe Adobe Express app is available on any smart device or desktop computer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/arattai-vs-whatsapp-key-differences-you-should-know-2795727-2025-09-30",
      "headline": "Arattai vs WhatsApp: Key differences you should knowArattai, Zoho's Made-in-India messaging app, is rapidly emerging as a challenger to WhatsApp with features like multi-device support, Pocket, and ad-free usage. Here are some of the key differences between  the two messaging app rivals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bareilly-i-love-muhammad-violence-unrest-mastermind-who-is-maulana-tauqeer-raza-khan-cleric-politics-riots-ala-hazrat-2796133-2025-10-01",
      "headline": "Who's Tauqeer Raza, the mastermind of 'I Love Muhammad' chaos in Bareilly?UP cleric Maulana Tauqeer Raza Khan, a descendant of Ala Hazrat, the founder of the Barelvi Sunni order, has long been both a kingmaker and a troublemaker in Bareilly and the Rohilkhand region. He is allegedly the mastermind of the 'I Love Muhammad' protests that turned violent in Bareilly. So, who is this controversial cleric?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mukesh-ambani-tops-hurun-rich-list-2025-shah-rukh-khan-joins-billionaire-club-2796169-2025-10-01",
      "headline": "Shah Rukh Khan joins billionaire club, Mukesh Ambani tops Hurun India Rich ListMukesh Ambani has reclaimed the top spot on the Hurun India Rich List 2025, while Bollywood superstar Shah Rukh Khan joins the billionaire club for the first time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/microsoft-ceo-satya-nadella-shifts-focus-to-ai-elevates-judson-althoff-to-lead-commercial-unit-2796469-2025-10-01",
      "headline": "Satya Nadella bets big on AI, names Judson Althoff to lead Microsoft commercial unitMicrosoft has elevated Chief Commercial Officer Judson Althoff as CEO of its commercial business, allowing Satya Nadella to focus on AI, datacenter buildout, and product innovation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/traitors-to-ummah-pakistan-arab-nations-outrage-trump-gaza-peace-plan-hamas-backlash-muslim-ummah-2796304-2025-10-01",
      "headline": "Traitors to Ummah: Pak, Arab nations face outrage for backing Trump's Gaza planLeaders of Pakistan and Arab-Muslim nations are facing a massive backlash after endorsing US President Donald Trump's Gaza peace plan. It has been branded as a \"betrayal of the Palestinian cause\" for recognising Israel. Leaders, including Shehbaz Sharif, are being called \"traitors to the Ummah\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/the-taj-story-poster-controversy-shiva-temple-claims-paresh-rawal-2796245-2025-10-01",
      "headline": "Explained: Taj Mahal controversy reignited by The Taj Story poster rowTaj Mahal's origins spark fresh debate after Paresh Rawal's 'The Taj Story' poster depicts a Shiva idol inside the monument. Here's why the poster is raising storm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/for-the-sake-of-kids-society-reality-of-silent-divorces-in-indian-homes-2796119-2025-10-01",
      "headline": "Married, but no connection: Reality of silent divorces in Indian homesSilent divorce is the reality of many Indian households. On paper and in society's eyes, couples remain married, but behind closed doors there is no emotional or physical connection. Rarely acknowledged, this situation often leaves people bitter, fuels mental health struggles, and has long-term consequences for children."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/south/story/karur-stampede-bjp-annamalai-criticism-dmk-government-stalin-spares-vijay-soft-tone-assembly-polls-2796111-2025-10-01",
      "headline": "Karur stampede: Why is BJP going soft on Vijay?With assembly elections due next year, the BJP is desperate to avoid being pushed to the margins in Tamil Nadu. Annamalai wants to project the party as an assertive opposition that holds the DMK to account. At the same time, it cannot afford to cross swords with Vijay."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-police-recover-forged-photos-porn-cds-in-swami-chaitanyanand-molestation-probe-2796382-2025-10-01",
      "headline": "Morphed photos with PM, Obama, sex toy, porn found in Delhi molester baba's lairInvestigators said the forged photographs indicated attempts by the accused to build a false image of influence and proximity to world leaders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/wah-donald-trump-ji-wah-opportunity-india-should-not-miss-praise-president-gaza-peace-plan-israel-hamas-war-palestine-2795750-2025-10-01",
      "headline": "Wah Trump ji wah! Opportunity that India shouldn't missAs US President Donald Trump pitches a Gaza peace plan in his bid for a Nobel Peace Prize, world leaders have rushed to applaud. India has lauded Trump's peace bid with PM Narendra Modi's message translated into seven world languages. This comes amid a low point in Indo-US ties. Trump has presented an opportunity and India must resort to realpolitik."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-man-dragged-police-zomato-cancelled-order-cctv-viral-video-2796475-2025-10-01",
      "headline": "Caught on CCTV: Drunk man refuses to pay for food delivery, Delhi cops interveneA Delhi man was allegedly dragged out of his home and assaulted by police after refusing to pay for a cancelled Zomato order. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/uk-news/story/pakistan-origin-grooming-gang-leader-6-others-jailed-for-raping-schoolgirls-in-rochdale-mohammed-zahid-united-kingdom-2796403-2025-10-01",
      "headline": "Pakistani-origin grooming gang leader, 6 others jailed for raping minors in UKA Pakistani-origin man has been sentenced to 35 years in prison for leading a Rochdale grooming gang that raped two 13-year-old schoolgirls between 2001 and 2006. Six other Pakistani-origin men received 12 to 29 years behind bars. Zahid lured victims with gifts from his market stall and demanded sexual favours from them."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/netanyahu-scripted-apology-qatar-pm-strikes-trump-phone-white-house-gaza-2796164-2025-10-01",
      "headline": "Netanyahu's apology to Qatar, phone on Trump's lap: A telling White House photoThe call, made on Monday from the Oval Office, came days after an Israeli strike in Doha killed five people, including the son of a Hamas leader. The attack rattled Washington, leading Trump to push Netanyahu to apologise to Qatar."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/shahid-afridi-mohsin-naqvi-resign-pcb-chairman-asia-cup-controversy-2796191-2025-10-01",
      "headline": "Turmoil in Pakistan cricket: Shahid Afridi urges PCB chief Mohsin Naqvi to resignShahid Afridi has called on Mohsin Naqvi to step down as PCB chairman following the Asia Cup debacle. Afridi highlighted growing concerns over Naqvi's ability to manage cricket alongside his ministerial duties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/kantara-chapter-1-review-rishab-shetty-folklore-saga-is-a-spellbinding-spectacle-rukmini-vasanth-jayaram-2796510-2025-10-02",
      "headline": "Kantara Chapter 1 review: Rishab Shetty's folklore saga is a spellbinding spectacleRelease Date:Thu Oct 02, 2025Kantara Chapter 1 movie review: Director, writer, and actor Rishab Shetty's film, also starring Rukmini Vasanth and Jayaram, explores the man vs nature conflict and land rights, blending them with divinity, folklore, myth, and faith. The film is a brilliant cinematic showcase."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshan-shares-vacation-photos-with-partner-saba-azad-fourth-anniversary-2796411-2025-10-01",
      "headline": "Hrithik Roshan shares vacation photos with partner Saba Azad on fourth anniversaryActor Hrithik Roshan marked his fourth anniversary with partner Saba Azad by sharing heartfelt note and vacation pictures. The post sparked warm reactions on social media, highlighting the couple's affectionate bond."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sophie-devine-century-new-zealand-fight-icc-womens-world-cup-opener-loss-australia-2796483-2025-10-01",
      "headline": "I'd throw it all away to win: Sophie Devine reflects on bittersweet loss vs Australia Sophie Devine scored a heroic 111 runs in New Zealand's ICC Women's World Cup opener against Australia. Despite her effort, New Zealand fell short chasing 327, highlighting the challenge posed by the defending champions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-1st-test-livestreaming-and-broadcast-details-2796480-2025-10-01",
      "headline": "India vs West Indies 1st Test livestreaming details: When and where to watch? India begin a new chapter in their Test history as Shubman Gill is set to lead the team in a home series against West Indies, beginning on October 2 at the Narendra Modi Stadium in Ahmedabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sophie-devine-century-australia-beat-new-zealand-womens-world-cup-2025-2796462-2025-10-01",
      "headline": "Women's World Cup: Australia start title defence with 89-run win over New Zealand Australia got their title defence off to a winning start in the Women's World Cup 2025, with a massive 89-run victory over New Zealand in Indore. Sophie Devine's remarkable century ended in vain as New Zealand crumbled under pressure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/hockey-india-league-sg-pipers-2796442-2025-10-01",
      "headline": "SG Pipers stick with youth, but tweak formula for new HIL season The SG Pipers were known to be a team that remained committed on the future but the mini-auction saw them make a tweak to their mantra. Balance was key as experienced stars like Rupinder Pal Singh and Udita joined the fray to make the men's and women's teams stronger. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/balance-and-belief-fatima-sana-eyes-strong-start-in-pakistans-world-cup-campaign-2796432-2025-10-01",
      "headline": "Balance and belief: Fatima Sana eyes strong start in Pakistan's World Cup campaign Pakistan skipper Fatima Sana stresses calmness, spin strength and senior batting support as key pillars of their Women's World Cup campaign, aiming to turn belief into consistent performances on the global stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-wi-1st-test-ahmedabad-preview-shubman-gill-restore-home-dominance-2796430-2025-10-01",
      "headline": "IND v WI, 1st Test: Shubman Gill's India aim to reignite home dominance IND vs WI, 1st Test preview: India will head into a home Test series without Rohit Sharma, Virat Kohli and R Ashwin for the first time in more than a decade. With the scars of a 0-3 loss to New Zealand still remaining fresh, Shubman Gill and his men will not take the West Indies lightly. With wet weather forecast, the conditions in Ahmedabad may not be straightforward. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indian-women-cricket-team-skip-handshake-pakistan-world-cup-2025-2796429-2025-10-01",
      "headline": "Women's World Cup: India to adopt no handshake policy in IND vs PAK clash The Indian women's team will opt for a no-handshake policy during their game against Pakistan in the Women's World Cup clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-predicted-xi-kuldeep-yadav-comeback-ahmedabad-pitch-report-2796412-2025-10-01",
      "headline": "IND vs WI 1st Test, pitch report and predicted XI: Will Kuldeep play? India return home for their first WTC cycle Test series against West Indies, with Shubman Gill leading a balanced XI. Key questions include Bumrah's workload, Kuldeep Yadav's comeback, Nitish Reddy's role, and Ahmedabad pitch conditions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/womens-world-cup-2025-bangladesh-captain-nigar-sultana-full-pre-match-press-conference-2796410-2025-10-01",
      "headline": "Beating Pakistan will set up a good tone for the whole tournament: Nigar Sultana Bangladesh women's cricket team captain Nigar Sultana has said that beating Pakistan will set up the tone for them for the rest of their campaign in the Women's World Cup 2025. Bangladesh take on Pakistan in their opening clash on Thursday, October 2, in Colombo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-womens-cricket-team-world-cup-opener-bangladesh-spin-attack-2796402-2025-10-01",
      "headline": "Leading with spin: Pakistan's Fatima Sana aims for winning start in Women's World Cup Pakistan captain Fatima Sana outlines her team's approach and readiness as they prepare to face Bangladesh in the opening match of the Women's World Cup, highlighting the squad's strengths, tactical focus, and aspirations for a new chapter in the nation's cricket journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-captain-nigar-sultana-wary-of-sidra-amin-womens-world-cup-2025-2796398-2025-10-01",
      "headline": "Bangladesh's Nigar Sultana wary of Pakistan's Sidra Amin ahead of opening clash Bangladesh captain Nigar Sultana highlights the threat from Pakistan batters ahead of Women's World Cup 2025 opener. The team aims to start strong and avoid mistakes to set the tone for the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indian-women-cricket-team-skip-handshake-pakistan-world-cup-2025-2796429-2025-10-01",
      "headline": "Women's World Cup: India to adopt no handshake policy in IND vs PAK clash The Indian women's team will opt for a no-handshake policy during their game against Pakistan in the Women's World Cup clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-predicted-xi-kuldeep-yadav-comeback-ahmedabad-pitch-report-2796412-2025-10-01",
      "headline": "IND vs WI 1st Test, pitch report and predicted XI: Will Kuldeep play? India return home for their first WTC cycle Test series against West Indies, with Shubman Gill leading a balanced XI. Key questions include Bumrah's workload, Kuldeep Yadav's comeback, Nitish Reddy's role, and Ahmedabad pitch conditions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/womens-world-cup-2025-bangladesh-captain-nigar-sultana-full-pre-match-press-conference-2796410-2025-10-01",
      "headline": "Beating Pakistan will set up a good tone for the whole tournament: Nigar Sultana Bangladesh women's cricket team captain Nigar Sultana has said that beating Pakistan will set up the tone for them for the rest of their campaign in the Women's World Cup 2025. Bangladesh take on Pakistan in their opening clash on Thursday, October 2, in Colombo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-womens-cricket-team-world-cup-opener-bangladesh-spin-attack-2796402-2025-10-01",
      "headline": "Leading with spin: Pakistan's Fatima Sana aims for winning start in Women's World Cup Pakistan captain Fatima Sana outlines her team's approach and readiness as they prepare to face Bangladesh in the opening match of the Women's World Cup, highlighting the squad's strengths, tactical focus, and aspirations for a new chapter in the nation's cricket journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-captain-nigar-sultana-wary-of-sidra-amin-womens-world-cup-2025-2796398-2025-10-01",
      "headline": "Bangladesh's Nigar Sultana wary of Pakistan's Sidra Amin ahead of opening clash Bangladesh captain Nigar Sultana highlights the threat from Pakistan batters ahead of Women's World Cup 2025 opener. The team aims to start strong and avoid mistakes to set the tone for the tournament."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}