{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-confirms-central-panel-ccpa-show-cause-notice-response-due-in-15-days-2614138-2024-10-09",
      "headline": "Ola Electric confirms Central panel show cause notice, response due in 15 daysThe notice accuses the company of failing to meet standards in areas concerning customer service and product advertisements."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-motor-ipo-gmp-expected-listing-gains-crashes-due-to-rich-valuation-fears-2614117-2024-10-09",
      "headline": "Hyundai Motor IPO: GMP crashes due to rich valuation fears. Check hereThe company, a subsidiary of South Korean auto giant Hyundai Motor Company, plans to raise Rs 27,856 crore through the sale of shares, priced between Rs 1,865 and Rs 1,960 each. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-end-lower-as-rbi-inflation-outlook-triggers-profit-booking-2614022-2024-10-09",
      "headline": "Sensex, Nifty end lower as RBI inflation outlook triggers profit bookingThe S&P BSE Sensex lost 161.71 points to close at 81,467.10, while the NSE Nifty50 was down 31.20 points to end at 24,981.95. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/da-hike-will-centre-offer-a-festive-gift-for-government-employees-union-cabinet-meeting-today-2613992-2024-10-09",
      "headline": "DA hike: Will Centre offer a festive gift for government employees?Currently, central government employees receive DA at 50% of their basic salary, and pensioners receive DR at 50% of their basic pension."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/torrent-power-ltd-multibagger-power-stock-hits-record-high-peak-on-massive-rs-1680-crore-order-2613963-2024-10-09",
      "headline": "Multibagger power stock hits record high peak on massive Rs 1,680 crore orderA total of 1.51 lakh shares were traded, resulting in a turnover of Rs 29.36 crore on the BSE. The company's market capitalisation rose to Rs 92,624 crore following the surge in its stock price."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-raises-upi-lite-upi-123pay-limits-how-it-affects-your-wallet-explained-2613897-2024-10-09",
      "headline": "RBI raises UPI Lite, UPI 123Pay limits at MPC: How it affects your walletRBI MPC meeting: The central bank raised the transaction limits for two key UPI services—UPI 123Pay and UPI Lite—offering more convenience for millions of users."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-meeting-key-takeaways-on-gdp-growth-inflation-interest-rate-2613856-2024-10-09",
      "headline": "RBI MPC meeting: Key takeaways on GDP growth, inflation, and interest rateRBI MPC meeting: The committee led by Governor Shaktikanta Das decided to keep interest rates unchanged and shifted its policy stance from 'withdrawal of accommodation' to 'neutral'.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-repo-rate-unchanged-stock-market-rally-sensex-surges-600-nifty-up-200-points-2613837-2024-10-09",
      "headline": "Stock market rally: Sensex surges 600 points as RBI holds repo rate The S&P BSE Sensex added 591.46 points to 82,225.81, while the NIfty50 gained 197 points to 25,210.15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-motor-ipo-opens-on-october-15-all-you-need-to-know-price-band-issue-size-dates-details-2613808-2024-10-09",
      "headline": "Hyundai Motor IPO opens on October 15: All you need to know Hyundai Motor India aims to raise Rs 27,855 crore, making it the largest IPO in the history of the Indian stock market. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-keeps-key-interest-repo-rates-unchanged-at-65-per-cent-2613807-2024-10-09",
      "headline": "RBI keeps repo rate unchanged at 6.5%, GDP for FY25 projected at 7.2% RBI Monetary Policy Meeting: The Reserve Bank of India (RBI) has decided to leave policy rates unchanged, maintaining the current levels. However, it has adjusted its stance to a neutral position."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-higher-ahead-of-rbi-mpc-announcement-repo-rate-unchanged-2613799-2024-10-09",
      "headline": "Sensex, Nifty open higher ahead of RBI decision; Tata Motors stock gains 2%The S&P BSE Sensex added 129.72 points to 81,764.53, while the NSE Nifty50 gained 46.35 points to 25,059.50. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-prices-today-october-9-2024-yellow-metal-records-dip-silver-trades-higher-mcx-latest-rates-2613798-2024-10-09",
      "headline": "Gold, silver price today, October 9, 2024: Yellow metal records dip, silver trades higher on MCXGold Price Today 9 October 2024: Gold is trading on the lower side while silver rates have recorded a hike on the Multi Commodity Exchange (MCX) on Wednesday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/us-federal-aviation-administration-faa-safety-alert-boeing-737-rudder-issue-2613724-2024-10-08",
      "headline": "US aviation agency issues safety alert over Boeing 737 rudder issueAlert comes after National Transportation Safety Board says foreign airlines could be using planes with rudder components that could pose safety risks\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-share-rally-18-percent-reason-more-upside-expert-view-analyst-review-2613469-2024-10-08",
      "headline": "Paytm shares rally 18% in last-hour surge: Is there more upside? Despite the rally in shares, Paytm's stock is still down 24.51% from its 52-week high of Rs 998.30, recorded on August 20, 2023."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-probe-ministry-of-road-transport-and-highways-to-investigate-complaints-bhavish-aggarwal-2613435-2024-10-08",
      "headline": "More trouble for Ola Electric, transport ministry to investigate complaintsThe complaints against Ola Electric have been growing in recent months, with issues ranging from service quality, customer support, to product reliability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-end-higher-led-by-auto-and-financial-paytm-shares-jump-16-percent-2613357-2024-10-08",
      "headline": "Sensex, Nifty end higher led by auto and financial; Paytm shares jump 16%The S&P BSE Sensex added 584.81 points to end at 81,634.81, while the NSE Nifty50 gained 217.40 points to close at 25,013.15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-motor-falls-4-percent-rekha-jhunjhunwala-potential-exit-from-multibagger-stock-2613322-2024-10-08",
      "headline": "Tata Group stock falls 4% as Jhunjhunwala eyes exit from multibaggerThe Jhunjhunwala family first invested in Tata Motors in the September 2020 quarter, when Rakesh Jhunjhunwala picked up 4 crore shares of the company"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-spicejet-shares-rise-9-percent-today-10-new-aircraft-by-end-of-november-expansion-fleet-2613259-2024-10-08",
      "headline": "Explained: Why SpiceJet shares jumped 9% todaySpiceJet recently raised Rs 3,000 crore through a qualified institutional placement (QIP). The airline is also set to receive an additional Rs 736 crore from a previous funding round, which will help support its growth plans."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/cognizant-discrimination-favoured-h-1b-holders-over-non-indian-workers-says-us-jury-report-2613225-2024-10-08",
      "headline": "Cognizant favoured H-1B holders over non-Indian workers, says US juryThis case dates back to 2017 when a class-action lawsuit was filed against the IT giant, accusing it of bias in its employment practices."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/crude-oil-prices-seen-to-stabilise-as-all-out-war-fears-recede-middle-east-iran-israel-conflict-2613194-2024-10-08",
      "headline": "Crude oil prices seem to stabilise as all-out war fears recedeTensions between Israel and Iran led to a 13 per cent spurt in Brent crude prices in the past seven days. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/delhi-news-chief-minister-atishi-luggage-removed-civil-lines-bungalow-aap-versus-lieutenant-governor-2614274-2024-10-09",
      "headline": "Atishi trespassed, Delhi bungalow not Chief Minister's home: Lt Governor's officeDelhi Chief Minister Atishi shifted to bungalow number 6 on Flagstaff Road in Civil Lines earlier this week, days after her predecessor Arvind Kejriwal vacated it. Atishi had illegally occupied the property as it was not officially designated to her, sources in the Lt Governor's office said on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/donald-trump-praises-narendra-modi-nicest-human-being-flagrant-podcast-us-elections-2614280-2024-10-09",
      "headline": "Friend of mine, nicest human being: Donald Trump heaps praise on PM ModiDonald Trump recently lauded Prime Minister Narendra Modi, referring to him as his \"friend\" and describing him as the \"nicest human being\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-2nd-t20i-report-series-win-nitish-rinku-delhi-2614325-2024-10-09",
      "headline": "2nd T20I: India seal series after Nitish special bludgeons BangladeshIndia vs Bangladesh, 2nd T20I: Nitish Kumar Reddy produced an all-round masterclass to help India complete an 86-run win over a hapless Bangladesh in Delhi. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/why-congress-lost-haryana-assembly-elections-bhupinder-hooda-2614092-2024-10-09",
      "headline": "Why Congress lost Haryana polls? Preeti Choudhry's big takeawaysIndia Today's Preeti Choudhry gives us a breakdown of the reasons why the Congress lost the polls in Haryana despite the BJP facing anti-incumbency."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/haryana-poll-results-bjp-orders-jalebi-for-rahul-gandhi-payment-cash-on-delivery-2614025-2024-10-09",
      "headline": "BJP orders 1 kg of jalebi for Rahul Gandhi in Delhi. Payment was cash on deliveryThe Haryana BJP placed an online order for 1 kg of jalebi for Rahul Gandhi in Delhi. The order was payment on delivery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/election-commission-congress-complaint-linked-to-haryana-result-2614021-2024-10-09",
      "headline": "Poll panel meets Congress team, urged by party to seal EVMs in 20 Haryana seatsThe meeting took place after several Congress leaders expressed doubts about the process of counting votes in several constituencies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistan-maryam-nawaz-climate-diplomacy-india-smog-issue-jaishankar-visit-sco-summit-2614284-2024-10-09",
      "headline": "Pak's Maryam Nawaz calls for climate diplomacy with India to combat smogMaryam Nawaz Sharif called for cooperation with India to effectively tackle the issue of smog during the winters."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rajasthan-barmer-district-collector-ias-tina-dabi-raid-spa-centre-sex-racket-police-2614142-2024-10-09",
      "headline": "IAS Tina Dabi raids spa centre in Rajasthan on suspicion of sex racketDuring the inspection of the Chamunda Circle area in Barmer, Tina Dabi noticed the spa centre and instructed officials to probe the premises. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/beauty/story/is-chewing-raw-curry-leaves-good-for-hair-2613906-2024-10-09",
      "headline": "Is chewing raw curry leaves good for hair? After the buzz around fitkari, raw garlic, and Japanese drinking vinegar, social media has now turned its attention to curry leaves. But can chewing raw curry leaves really give you healthy hair? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/haryana-independent-mlas-rajesh-joon-devendra-kadiyan-savitri-jindal-assembly-election-results-2613980-2024-10-09",
      "headline": "Savitri Jindal, 2 other Independents back BJP after party's Haryana stunnerIndependent MLAs Savitri Jindal, Rajesh Joon and Devender Kadyan, backed the BJP on Wednesday, a day after the party's historic hat-trick in the Haryana Assembly elections. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nitish-kumar-reddy-ind-vs-ban-arun-jaitely-stadium-new-delhi-2614237-2024-10-09",
      "headline": "IND vs BAN: Nitish Kumar Reddy repays captain's trust with 34-ball 74 in DelhiIndia batter Nitish Kumar Reddy slammed his maiden T20I fifty in the second match against Bangladesh at the Arun Jaitely Stadium in Delhi."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/video/hurricane-milton-florida-landfall-2614159-2024-10-09",
      "headline": "Video: Floridians brace for Hurricane Milton; cover homes, cars with plasticThe National Weather Service in Tampa Bay described Milton as \"a historic storm for the west coast of Florida\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/peta-india-urges-salman-khan-bigg-boss-18-makers-to-remove-donkey-from-show-2613896-2024-10-09",
      "headline": "PETA India urges Salman Khan, Bigg Boss 18 makers to remove donkey from showPETA India has urged Salman Khan and Bigg Boss producers to exclude the donkey, Max, from the show, citing public distress. They argue that using animals as entertainment is harmful and inappropriate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/high-levels-of-lead-found-in-12-cinnamon-powder-brands-in-us-report-2614082-2024-10-09",
      "headline": "High levels of lead found in 12 cinnamon powder brands in US: ReportA recent investigation has found alarming levels of lead in 12 cinnamon products. Cinnamon powder sold by Paras and EGN contained the highest levels of lead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/up-bypolls-samajwadi-party-congress-seat-sharing-india-bloc-haryana-election-result-2614056-2024-10-09",
      "headline": "Under Haryana shock, Congress snubbed by ally Samajwadi Party before UP by-pollsThe Congress wanted to contest five seats, but the Samajwadi Party hesitated, citing its performance in the general elections held from April to June and the recent Haryana polls. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/bhool-bhulaiyaa-3-trailer-x-twitter-reactions-kartik-aaryan-triptii-dimri-vidya-balan-madhuri-dixit-2614206-2024-10-09",
      "headline": "Bhool Bhulaiyaa 3 trailer X reaction: Internet says 'excitement is palpable'Bhool Bhulaiyaa 3's trailer received mixed reactions online. While some fans found the Kartik Aaryan-led film's promo incredibly entertaining, others criticised Bollywood for 'running out of ideas.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shafali-verma-youngest-india-vs-sri-lanka-record-2614217-2024-10-09",
      "headline": "Shafali Verma becomes youngest to 2000 runs in Women's T20IsWomen's T20 World Cup 2024: Shafali Verma became the youngest batter to reach the milestone of 2000 runs in Women's T20Is at the age of 20 years and 255 days. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/opinion-assembly-election-results-haryana-shocker-bjp-congress-2613810-2024-10-09",
      "headline": "Haryana Shocker: A BJP win, a Congress self-goalSo how did the BJP, written off by everyone, including privately by some of their own leaders, pull off a stunning upset against the odds and, in the face of a 10-year anti-incumbency score, a remarkable hat trick?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/david-baker-demis-hassabis-john-jumper-awarded-nobel-prize-2024-in-chemistry-2613993-2024-10-09",
      "headline": "Chemistry Nobel to David Baker, Demis Hassabis, John Jumper for work on proteinsThe announcement is part of Alfred Nobel's will, which specifically mentioned chemistry as one of the key categories."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/nasa-astronaut-shares-stunning-timelapse-of-green-and-red-auroras-from-spacecraft-watch-the-video-2613998-2024-10-09",
      "headline": "Watch: NASA astronaut shares stunning timelapse of green, red auroras from spaceA NASA astronaut has shared a timelapse video of vibrant red and green auroras that he filmed from his vantage point aboard a spacecraft. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/stabbing-attack-israel-hadera-people-injured-police-capture-suspect-2614033-2024-10-09",
      "headline": "6 injured in stabbing attack in Israel, police capture suspectSix people were left injured following a stabbing attack in Israel's Hadera on Wednesday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/israeli-military-ground-operations-southern-lebanon-hezbollah-targets-weapons-discovery-2614077-2024-10-09",
      "headline": "Israel finds Hezbollah weapons cache under residential building in LebanonThe Israeli military discovered a large underground weapons cache beneath one of the homes during an operation targeted as Hezbollah infrastructure in southern Lebanon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/story/rahul-gandhi-breaks-silence-jammu-kashmir-poll-result-constitution-analysing-unexpected-haryana-2613878-2024-10-09",
      "headline": "Day after loss, Rahul Gandhi says party analysing unexpected Haryana resultCongress MP Rahul Gandhi broke his silence on his party's poor showing in Haryana and said the party was analysing the \"unexpected result\", while flagging complaints of vote counting irregularities in some Assembly seats."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/vivian-dsena-ex-wife-vahbiz-dorabjee-rumours-joining-bigg-boss-18-2614315-2024-10-09",
      "headline": "Actor Vivian Dsena's ex-wife Vahbiz Dorabjee denies rumours of joining Bigg Boss 18TV actor Vivian Dsena's ex-wife dismissed rumours of her joining Bigg Boss 18. After speculation about her participation surfaced, she shared a social media post clarifying the matter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/yash-kgf-chapter-3-rishab-shetty-kantara-2-updates-producer-vijay-kiragandur-2614275-2024-10-09",
      "headline": "Producer Vijay Kiragandur shares KGF 3, Kantara 2 updatesProducer of KGF and Kantara, Vijay Kiragandur of Hombale films, gave some major updates about the proceedings of Yash's KGF: Chapter 3 and Rishab Shetty's Kantara 2. He spoke about them during the National Film Award ceremony held in New Delhi. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/cannes-winner-all-we-imagine-as-light-to-release-in-india-this-november-2614200-2024-10-09",
      "headline": "Cannes winner All We Imagine as Light to release in India this NovemberDirector Payal Kapadia's Cannes winner, All We Imagine as Light, is finally getting an India release date. It will hit cinemas this November. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/bhool-bhulaiyaa-3-trailer-x-twitter-reactions-kartik-aaryan-triptii-dimri-vidya-balan-madhuri-dixit-2614206-2024-10-09",
      "headline": "Bhool Bhulaiyaa 3 trailer X reaction: Internet says 'excitement is palpable'Bhool Bhulaiyaa 3's trailer received mixed reactions online. While some fans found the Kartik Aaryan-led film's promo incredibly entertaining, others criticised Bollywood for 'running out of ideas.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/who-is-satoshi-nakamoto-new-documentary-says-peter-todd-is-satoshi-todd-says-nonsense-2614191-2024-10-09",
      "headline": "Who is Satoshi Nakamoto? New documentary says Peter Todd is Satoshi, Todd says nonsenseA new HBO documentary, Money Electric: The Bitcoin Mystery, has sparked fresh debate over the identity of Satoshi Nakamoto, the mysterious creator of Bitcoin. Here is what we know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/google-winning-big-this-year-with-nobel-prize-as-geoffrey-hinton-demis-hassabis-and-john-jumper-get-laurels-2614135-2024-10-09",
      "headline": "Google wins big with Nobel: Geoffrey Hinton, Demis Hassabis, John Jumper get prizeAfter Geoffrey Hinton won the 2024 Nobel Prize for Physics, Demis Hassabis and John Jumper have been awarded the Nobel in Chemistry, and they all have Google in common."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/godfather-of-ai-geoffrey-hinton-says-he-is-particularly-proud-that-one-of-his-students-fired-sam-altman-2614103-2024-10-09",
      "headline": "Godfather of AI says he is proud that one of his students fired Sam AltmanGeoffrey Hinton who on Tuesday won the 2024 Nobel Prize for Physics thanked his students in a press conference and said he is particularly proud of one of his students for firing Sam Altman."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/apple-watch-helps-save-life-of-elderly-woman-here-is-what-happened-2614066-2024-10-09",
      "headline": "Apple Watch helps save life of elderly woman, here is what happenedAn Apple Watch has once again proven its life-saving potential by helping an elderly woman detect a serious heart condition, prompting timely medical intervention. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/michael-vaughan-claims-only-jasprit-bumrah-troubles-prolific-joe-root-2614340-2024-10-09",
      "headline": "Michael Vaughan claims only Jasprit Bumrah troubles prolific Joe RootFormer England captain Michael Vaughan said that India fast bowler Jasprit Bumrah is the only bowler in the world to have an upper hand over in form Joe Root in recent times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-ban-2nd-t20i-riyan-parag-no-ball-nitish-kumar-reddy-2614324-2024-10-09",
      "headline": "IND vs BAN: Riyan Parag given no ball for bizarre wide of the crease delivery India all-rounder Riyan Parag gave a bizarre no ball in the second T20I against Bangladesh as he bowled a wide of the crease delivery in Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-2nd-t20i-report-series-win-nitish-rinku-delhi-2614325-2024-10-09",
      "headline": "2nd T20I: India seal series after Nitish special bludgeons BangladeshIndia vs Bangladesh, 2nd T20I: Nitish Kumar Reddy produced an all-round masterclass to help India complete an 86-run win over a hapless Bangladesh in Delhi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-radha-yadav-pulls-off-stunning-catch-with-full-length-dive-vs-sri-lanka-2614312-2024-10-09",
      "headline": "Watch: Radha Yadav pulls off stunning catch with full-length dive vs Sri LankaWomen's T20 World Cup 2024: Radha Yadav pulled off a stunning catch with a full-length dive against Sri Lanka in the Group A match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/arshdeep-singh-ind-vs-ban-2nd-t20i-parvez-hossain-emon-nitish-kumar-reddy-2614308-2024-10-09",
      "headline": "IND vs BAN: Arshdeep Singh gives death stare to Parvez after shattering his stumps India seamer Arshdeep Singh was spotted giving a death stare to Bangladesh opener Parvez Hossain Emon after dismissing him in the second T20I in Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/joe-root-hungry-for-more-runs-after-breaking-england-test-record-2614306-2024-10-09",
      "headline": "Root hungry for more runs after breaking England Test recordIndia vs Bangladesh: After surpassing Sir Alastair Cook to become England's all-time leading Test run-scorer, Joe Root said that there are \"many more runs still to get.\"\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harmanpreet-kaur-india-vs-sri-lanka-dubai-landmark-fifty-2614300-2024-10-09",
      "headline": "Harmanpreet Kaur hits fastest fifty by an Indian in Women's T20 World Cup Women's T20 World Cup 2024: Harmanpreet Kaur scored 52 runs off 27 balls and helped India post a healthy score of 172 for the loss of three wickets after opting to bat first in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-squad-west-indies-t20is-dasun-shanaka-excluded-2614271-2024-10-09",
      "headline": "Sri Lanka name squad for West Indies T20Is, Shanaka excluded Left-handed batter Bhanuka Rajapaksa made a comeback as Sri Lanka named a strong squad for their T20I series against West Indies, starting October 13. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mandhana-returns-to-form-becomes-3rd-indian-to-500-runs-in-womens-t20-world-cup-2614257-2024-10-09",
      "headline": "Mandhana back in form, becomes 3rd Indian to 500 runs in Women's T20 World CupWomen's T20 World Cup 2024: Smriti Mandhana roared back to form with a blistering fifty against Sri Lanka. She also became the third Indian to score 500-plus runs in the tournament history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-2nd-t20i-rinku-singh-53-delhi-2614254-2024-10-09",
      "headline": "Rinku Singh entertains Delhi crowd with 29-ball 53India vs Bangladesh: Young batter Rinku Singh thrilled the Delhi crowd with a quickfire 53 off 29 balls on Wednesday. Rinku's explosive innings came at a crucial time for India, helping to set up a competitive 221-run total in Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nitish-kumar-reddy-ind-vs-ban-arun-jaitely-stadium-new-delhi-2614237-2024-10-09",
      "headline": "IND vs BAN: Nitish Kumar Reddy repays captain's trust with 34-ball 74 in DelhiIndia batter Nitish Kumar Reddy slammed his maiden T20I fifty in the second match against Bangladesh at the Arun Jaitely Stadium in Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harmanpreet-kaur-india-vs-sri-lanka-dubai-landmark-fifty-2614300-2024-10-09",
      "headline": "Harmanpreet Kaur hits fastest fifty by an Indian in Women's T20 World Cup Women's T20 World Cup 2024: Harmanpreet Kaur scored 52 runs off 27 balls and helped India post a healthy score of 172 for the loss of three wickets after opting to bat first in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-squad-west-indies-t20is-dasun-shanaka-excluded-2614271-2024-10-09",
      "headline": "Sri Lanka name squad for West Indies T20Is, Shanaka excluded Left-handed batter Bhanuka Rajapaksa made a comeback as Sri Lanka named a strong squad for their T20I series against West Indies, starting October 13. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mandhana-returns-to-form-becomes-3rd-indian-to-500-runs-in-womens-t20-world-cup-2614257-2024-10-09",
      "headline": "Mandhana back in form, becomes 3rd Indian to 500 runs in Women's T20 World CupWomen's T20 World Cup 2024: Smriti Mandhana roared back to form with a blistering fifty against Sri Lanka. She also became the third Indian to score 500-plus runs in the tournament history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-2nd-t20i-rinku-singh-53-delhi-2614254-2024-10-09",
      "headline": "Rinku Singh entertains Delhi crowd with 29-ball 53India vs Bangladesh: Young batter Rinku Singh thrilled the Delhi crowd with a quickfire 53 off 29 balls on Wednesday. Rinku's explosive innings came at a crucial time for India, helping to set up a competitive 221-run total in Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nitish-kumar-reddy-ind-vs-ban-arun-jaitely-stadium-new-delhi-2614237-2024-10-09",
      "headline": "IND vs BAN: Nitish Kumar Reddy repays captain's trust with 34-ball 74 in DelhiIndia batter Nitish Kumar Reddy slammed his maiden T20I fifty in the second match against Bangladesh at the Arun Jaitely Stadium in Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-exploring-option-to-move-entire-champions-trophy-out-of-pakistan-2614227-2024-10-09",
      "headline": "ICC exploring option to move entire Champions Trophy out of PakistanThe International Cricket Council (ICC) is considering shifting the 2025 Champions Trophy from Pakistan. Initially scheduled to be hosted by Pakistan, the tournament is facing uncertainties due to India's participation issues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shafali-verma-youngest-india-vs-sri-lanka-record-2614217-2024-10-09",
      "headline": "Shafali Verma becomes youngest to 2000 runs in Women's T20IsWomen's T20 World Cup 2024: Shafali Verma became the youngest batter to reach the milestone of 2000 runs in Women's T20Is at the age of 20 years and 255 days. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/melbourne-cricket-ground-transforming-before-blockbuster-india-australia-test-2614199-2024-10-09",
      "headline": "Melbourne Cricket Ground transforming before India-Australia TestThe iconic Melbourne Cricket Ground is undergoing transformation before the Border-Gavaskar Trophy Test match between India and Australia. Pakistan will also play an ODI in November. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-rohit-sharma-runs-towards-his-car-to-escape-mob-of-fans-after-training-2614207-2024-10-09",
      "headline": "Watch: Rohit Sharma runs towards his car to escape mob of fans after trainingRohit Sharma had to run towards his striking-blue Lamborghini in order to escape a sea of fans who were waiting to get a picture with him. Rohit was training at the Reliance Corporate Park Cricket Ground in Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harry-brook-pakistan-vs-england-multan-test-2614188-2024-10-09",
      "headline": "Watch: Harry Brook survives as bails don't fall on Day 3 of first Test vs PakistanEngland batter Harry Brook rode on his luck on Day 3 of the first Test in Multan as he scored an unbeaten 141  at stumps. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/sledging-room-podcast-sunil-gavaskar-gautam-gambhir-column-womens-t20-world-cup-2614145-2024-10-09",
      "headline": "The mischievous Sunil Gavaskar column and criticism of India women's team Sledging Room Podcast: Sunil Gavaskar dropped a bombshell when he wrote a column for Sportstar, hitting out at those who credited Gautam Gambhir for India's Kanpur Test win against Bangladesh. Gavaskar said the sole credit for India's aggressive approach should have gone to Rohit Sharma, the captain of the Test team. He said he felt people were indulging in 'foot-licking' by giving credit to the newly-appointed coach. It seems the legendary Gavaskar to have missed the mark on this occasion. While he stated the obvious by praising Rohit Sharma for India's fearless approach, how he took a swipe at the supporters of the head coach has left a bad taste."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sports-minister-surprised-with-dipa-karmakars-decision-to-announce-retirement-2614144-2024-10-09",
      "headline": "Sports minister surprised with Dipa Karmakar's decision to announce retirementSports Minister Mansukh Mandaviya expressed his surprise over Dipa Karmakar's sudden retirement, praising her inspiring journey from a young gymnast to an Olympic trailblazer. Mandaviya highlighted her immense contribution to Indian sports and hoped she would continue inspiring future athletes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harry-brook-pakistan-vs-england-multan-test-2614188-2024-10-09",
      "headline": "Watch: Harry Brook survives as bails don't fall on Day 3 of first Test vs PakistanEngland batter Harry Brook rode on his luck on Day 3 of the first Test in Multan as he scored an unbeaten 141  at stumps. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/sledging-room-podcast-sunil-gavaskar-gautam-gambhir-column-womens-t20-world-cup-2614145-2024-10-09",
      "headline": "The mischievous Sunil Gavaskar column and criticism of India women's team Sledging Room Podcast: Sunil Gavaskar dropped a bombshell when he wrote a column for Sportstar, hitting out at those who credited Gautam Gambhir for India's Kanpur Test win against Bangladesh. Gavaskar said the sole credit for India's aggressive approach should have gone to Rohit Sharma, the captain of the Test team. He said he felt people were indulging in 'foot-licking' by giving credit to the newly-appointed coach. It seems the legendary Gavaskar to have missed the mark on this occasion. While he stated the obvious by praising Rohit Sharma for India's fearless approach, how he took a swipe at the supporters of the head coach has left a bad taste."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sports-minister-surprised-with-dipa-karmakars-decision-to-announce-retirement-2614144-2024-10-09",
      "headline": "Sports minister surprised with Dipa Karmakar's decision to announce retirementSports Minister Mansukh Mandaviya expressed his surprise over Dipa Karmakar's sudden retirement, praising her inspiring journey from a young gymnast to an Olympic trailblazer. Mandaviya highlighted her immense contribution to Indian sports and hoped she would continue inspiring future athletes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/video/nitesh-kumar-paralympian-exclusive-indian-navy-medal-journey-2614137-2024-10-09",
      "headline": "How Indian Navy played a crucial part in Nitesh Kumar's gold medal win in Paris ParalympicsParis Paralympics gold medallist Nitesh Kumar revealed in an exclusive chat to India Today that he wore an Indian Navy made prosthetic in the Paris Paralympics. The badminton star said that before the correct prosthetic has been of a huge help and that he has not lost a single match against multiple opponents since switching to the new prosthetic in his SL3 category."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-south-africa-closer-to-semis-berth-with-win-vs-scotland-2614134-2024-10-09",
      "headline": "Women's T20 World Cup: South Africa closer to semis berth with win vs ScotlandWomen's T20 World Cup 2024: Resurgent South Africa recovered form loss against England to register a stellar win by 80 runs against Scotland. They have climbed to the top spot in the Group B table with this win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-1st-test-day-3-report-multan-root-brook-hundred-2614133-2024-10-09",
      "headline": "1st Test: Root, Brook make hay on flat Multan pitch, demoralise PakistanPakistan vs England, 1st Test: Star batter Joe Root continued his golden run with a masterful hundred to steer England to a commanding 492 for 3 at stumps on Day 3 of the first Test against Pakistan in Multan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/shanghai-masters-jannik-sinner-carlos-alcaraz-novak-djokovic-quarterfinals-2614130-2024-10-09",
      "headline": "Shanghai Masters: Sinner outlasts Shelton, joins Alcaraz and Djokovic in quartersShanghai Masters 2024: World No. 1 Jannik Sinner completed his revenge over Ben Shelton in the fourth round while Carlos Alcaraz defeated Gael Monfils in a pulsating match. Novak Djokovic eased into the last-eight for the 10th time in Shanghai. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}