{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-end-higher-on-diwali-as-reliance-bank-stocks-shine-2805815-2025-10-20",
      "headline": "Sensex, Nifty end higher on Diwali as Reliance, bank stocks shineThe BSE Sensex rose 0.5% to 84,363.37, while the NSE Nifty50 gained 0.49% to 25,851—both hitting fresh one-year highs. Over the past four sessions, the indices have climbed 2.8%, leaving them less than 2% away from their all-time highs scaled in September 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/china-files-wto-complaint-against-india-over-ev-subsidies-and-batteries-2805811-2025-10-20",
      "headline": "China files WTO complaint against India over EV subsidies and batteriesChina has filed a complaint against India at the World Trade Organization, challenging New Delhi's subsidies for electric vehicles (EVs) and batteries. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/diwali-muhurat-trading-on-october-21-everything-investors-need-to-know-special-market-session-2805749-2025-10-20",
      "headline": "Muhurat Trading on October 21: Check timing, trade strategy and moreMuhurat Trading will take place on October 21 this year. The pre-open session will run from 1:30 pm to 1:45 pm, followed by the main trading window from 1:45 pm to 2:45 pm, and a closing session until 3:05 pm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/reliance-shares-jump-q2-results-diwali-portfolio-buy-sell-explained-2805722-2025-10-20",
      "headline": "Reliance shares jump 3% after Q2 results. Should it be in your Diwali portfolio?Around 10:20 am, shares of Reliance Industries rose 3.22% to Rs 1,462.60 on the Bombay Stock Exchange (BSE). The stock's sharp upmove added to the broader market rally on Dalal Street as sentiment turned upbeat following a string of solid earnings reports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-surges-over-650-points-nifty-above-25900-reliance-banking-stocks-rally-2805697-2025-10-20",
      "headline": "Diwali cheer on Dalal Street as Sensex jumps nearly 700 pointsAt around 9:23 am, the S&P BSE Sensex jumped 673.90 points to 84,626.09, while the NSE Nifty50 surged 202.50 points to 25,912.35. Broader market indices also witnessed sharp gains, and volatility dropped, indicating strong investor confidence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/silver-price-falls-after-dhanteras-diwali-but-is-precious-metal-still-a-good-bet-explained-2805622-2025-10-20",
      "headline": "Silver prices fall after Diwali buying. Is it still a good bet?Silver has surged nearly 98% in a year, breaching Rs 2 lakh/kg in parts of India before a post-Diwali dip. But is investing in the precious metal still a good bet? With industrial demand booming and supply tightening, reports suggest silver's shine might just be getting started."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/china-rare-earth-export-curbs-impact-eu-industries-auto-defence-response-glbs-2805666-2025-10-20",
      "headline": "EU to hold urgent talks on European industries hit by China's rare earth curbsChina, the world's leading producer of the minerals used to make magnets crucial to the auto, electronics and defence industries, this month announced new controls on the export of rare-earth technologies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nirmala-sitharaman-gst-reforms-rate-cut-common-man-diwali-sales-auto-electronics-trump-tariffs-2805079-2025-10-18",
      "headline": "PM's Diwali gift delivered: Nirmala Sitharaman presents GST 2.0 report cardGST Bachat Utsav: Sitharaman, addressing a press conference along with ministers Piyush Goyal and Ashwini Vaishnaw ahead of Diwali, said the GST rate cuts resulted in bumper sales of cars and electronics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-prices-record-high-dhanteras-2025-buy-avoid-strategy-explained-diwali-2805075-2025-10-18",
      "headline": "Gold prices near record high on Dhanteras: Should you buy?Gold prices have been on a relentless rally, hitting new record highs almost every day. But does this glittering streak make it the right fit for your investment portfolio this Dhanteras?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/zoho-sridhar-vembu-gold-price-warning-systemic-risk-global-economy-2805062-2025-10-18",
      "headline": "Gold flashing a big warning signal: Zoho's Sridhar Vembu says amid rising pricesAs gold prices soar globally, Zoho's Sridhar Vembu raises a red flag. Does the surge signal investor anxiety and eroding trust in the system or reveal a deeper economic fault line?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-prices-hit-record-high-of-rs-134800-per-10-grams-in-delhi-ahead-of-dhanteras-2804887-2025-10-17",
      "headline": "Gold prices hit record high ahead of Dhanteras, see Rs 3,200 hike in DelhiTraders said gold buying activity picked up sharply as stockists built fresh positions on expectations of higher sales during the festive season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/silver-prices-india-dhanteras-soar-invest-in-silver-but-as-utensils-here-is-why-long-term-short-term-capital-gains-taxes-investment-2804634-2025-10-17",
      "headline": "Why silver utensils, not coins, could help make more moneyWith the price of silver at a record high, silverware might be a potential tax-saving alternative to bars and coins. Personal-use silver utensils are exempt from capital gains tax when sold. Here's what chartered accountants have to say about silver utensils helping investors save on taxes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-484-points-higher-nifty-above-25700-asian-paints-jumps-4-2804682-2025-10-17",
      "headline": "Sensex ends 484 points higher, Nifty above 25,700; Asian Paints jumps 4%The S&P BSE Sensex settled 484.53 points higher at 83,952.19, while the NSE Nifty50 rose 124.55 points to close at 25,709.85. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/diwali-2025-from-gold-etfs-to-sgbs-5-smart-ways-to-invest-in-gold-sovereign-gold-bonds-gold-futures-and-options-2804641-2025-10-17",
      "headline": "Diwali 2025: From ETFs to SGBs, 5 smart ways to invest in goldWith gold prices at record levels this Diwali, many people are rethinking whether to buy jewellery or look at smarter investment routes. From gold ETFs to SGBs, there are safer and more practical ways to invest without worrying about storage or high-making charges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/coca-cola-india-ipo-hindustan-coca-cola-beverages-valuation-2804639-2025-10-17",
      "headline": "Coca-Cola eyes $1 billion IPO for Indian bottling arm: ReportThe discussions are still in early stages, and Coca-Cola has not yet appointed bankers for the deal. The listing could take place as early as next year, though details such as timing, structure, and offer size are still being worked out, the report said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-keeping-all-your-money-in-saving-account-may-be-a-costly-mistake-explains-ca-2804612-2025-10-17",
      "headline": "Why keeping all your money in saving account may be a costly mistake, explains CAMany people believe that money parked in a savings account is the safest option. But an expert warns that this habit could quietly drain your wealth over time, especially when inflation eats into low returns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-rule-change-2025-what-changes-how-it-affects-you-2804586-2025-10-17",
      "headline": "EPFO rule change: What's new in PF withdrawals and how it affects youConfused about the new EPFO rules? This guide covers every update, from withdrawal limits to pension changes, in one place."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/dhanteras-2025-know-gold-and-silver-rates-in-your-city-before-you-buy-gold-price-silver-price-2804579-2025-10-17",
      "headline": "Dhanteras 2025: Know gold and silver rates in your city before you buyDhanteras is a day when many Indian families choose to bring home gold or silver, believing it invites prosperity and good fortune. From jewellery and coins to small utensils, shoppers often plan their purchases in advance. But with prices running high this season, checking the latest rates in your city has become more important than ever."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/diwali-2025-planning-to-buy-or-gift-gold-know-the-tax-rules-first-income-tax-on-gold-2804510-2025-10-17",
      "headline": "Diwali 2025: Planning to buy or gift gold? Know the tax rules firstFrom coins to jewellery, gold remains a favourite Diwali buy. However, not everyone realises that certain tax rules apply when you purchase or gift gold. Knowing these in advance can help you avoid unexpected trouble later."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/twinkle-akshay-opt-for-oranges-over-sweets-during-diwali-celebration-in-london-2805857-2025-10-20",
      "headline": "Twinkle, Akshay opt for oranges over sweets during Diwali celebration in London Twinkle Khanna and Akshay Kumar celebrated Diwali in London with a twist by choosing oranges over sweets. Their unique festive spirit highlights a healthy alternative during the celebrations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/veteran-actor-asrani-dies-at-84-nephew-ashok-confirms-2805860-2025-10-20",
      "headline": "Veteran actor and comic legend Asrani dies at 84, funeral held in Mumbai Veteran actor Asrani died at 84 today after a prolonged illness. He was known for playing versatile characters in films such as 'Sholay', 'Mere Apne', 'Bawarchi', 'Abhimaan' and 'Chupke Chupke'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ahaan-panday-mother-deanne-shares-diwali-photos-says-son-calls-her-firecracker-2805851-2025-10-20",
      "headline": "Ahaan Panday's mother Deanne shares Diwali photos, says son calls her firecracker Actor Ahaan Panday and his mother Deanne Panday celebrated Diwali in elegant traditional outfits. Their festive Instagram post received warm wishes and admiration from fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-wishes-his-fans-on-diwali-with-vibrant-festive-pictures-2805844-2025-10-20",
      "headline": "Amitabh Bachchan wishes his fans on Diwali with vibrant festive pictures Amitabh Bachchan shared heartfelt Diwali greetings and festive pictures with fans. His post sparked warm wishes and highlighted his connection with fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kjo-celebrates-diwali-with-yash-roohi-wishes-love-light-and-laughter-to-all-2805829-2025-10-20",
      "headline": "KJo celebrates Diwali with Yash, Roohi; wishes love, light and laughter to all Filmmaker Karan Johar shared warm Diwali pictures with his children in traditional clothes. The post highlights the festive spirit and received celebrity blessings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-on-30-years-of-dilwale-dulhania-le-jayenge-nobody-could-have-foreseen-its-place-in-hearts-2805825-2025-10-20",
      "headline": "Shah Rukh Khan on 30 years of DDLJ: Nobody could have foreseen its place in hearts Shah Rukh Khan reflected on 30 years of 'Dilwale Dulhania Le Jayenge', expressing gratitude for the global love he has received for his role as Raj. He credited the film's success to the team's dedication, Aditya Chopra's vision, and the lasting impact it has had on audiences and pop culture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/parmeet-sethi-reflects-on-career-after-dilwale-dulhania-le-jaayenge-and-experiences-with-yash-chopra-2805822-2025-10-20",
      "headline": "Parmeet Sethi reflects on career after DDLJ and experiences with Yash Chopra Parmeet Sethi reflected on his career after 'Dilwale Dulhaniya Le Jaayenge', sharing how advice from Aditya Chopra and challenges with negative roles shaped his journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-fragrant-flower-blooms-with-dignity-and-appears-fresh-too-2805516-2025-10-20",
      "headline": "The fragrant flower blooms with dignity, and appears fresh too In this week's Animania, we discover how 'The Fragrant Flower Blooms with Dignity' redefines the modern rom-com anime with slow-burn romance, heartfelt moments, and real character growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/diljit-dosanjh-and-sanya-malhotra-bring-style-and-energy-in-new-song-charmer-2805812-2025-10-20",
      "headline": "Diljit Dosanjh and Sanya Malhotra bring style and energy in new song Charmer Diljit Dosanjh and Sanya Malhotra team up for the Diwali release 'Charmer', showcasing their on-screen chemistry and stylish performances. The track, with its catchy visuals and festive vibe, has quickly become a highlight of the season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dilwale-dhulaniya-le-jayengey-turns-30-himani-shivpuri-talks-on-screen-chemistry-with-srk-2805788-2025-10-20",
      "headline": "DDLJ turns 30: Himani Shivpuri talks on-screen vibe with Shah Rukh Khan Veteran actor Himani Shivpuri is overjoyed as 'Dilwale Dhulaniya Le Jayengey' turned 30 today. On the iconic milestone, the actor spoke about working with Shah Rukh Khan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rajat-bedi-opens-up-about-missing-his-moment-with-hrithik-roshan-in-koi-mil-gaya-2805804-2025-10-20",
      "headline": "Rajat Bedi opens up about missing his moment with Hrithik Roshan in Koi Mil Gaya Rajat Bedi revisited a missed opportunity to shine opposite Hrithik Roshan in 'Koi Mil Gaya', calling it a formative moment in his career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jacob-elordi-euphoria-season-3-will-be-incredibly-clever-and-cinematic-2805794-2025-10-20",
      "headline": "Jacob Elordi: Euphoria season 3 will be incredibly clever and cinematic Jacob Elordi teased exciting details about 'Euphoria Season 3', calling the experience \"incredibly liberating\" and praising creator Sam Levinson's \"clever and cinematic\" vision. The Emmy-winning series, returning after three years, will premiere in Spring 2026 on HBO with both returning and new cast members."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kajol-celebrates-ddlj-at-30-and-the-love-that-travelled-from-india-to-switzerland-2805787-2025-10-20",
      "headline": "DDLJ turns 30, Kajol thanks fans: Thank u all for loving it in this phenomenal way Kajol marked 30 years of 'Dilwale Dulhania Le Jayenge' with a heartfelt post celebrating the film's timeless legacy. Sharing images from Switzerland, where a special poster honours the classic, Kajol reflected on how the love for 'DDLJ' has travelled from India to hearts across the world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kbc-17s-ishit-bhatt-says-he-was-nervous-not-rude-apologises-after-viral-backlash-2805783-2025-10-20",
      "headline": "KBC 17's Ishit Bhatt says he was nervous, not rude; apologises after viral backlash 'KBC 17' contestant Ishit Bhatt has apologised after facing backlash for his behaviour towards host Amitabh Bachchan. The 10-year-old from Gujarat said he was \"nervous, not rude,\" and expressed regret for his tone during the episode."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajmal-amir-denies-sexual-misconduct-allegations-ai-voice-controversy-2805774-2025-10-20",
      "headline": "Actor Ajmal Amir denies allegations of sexual misconduct, cites AI manipulation Ajmal Amir denied sexual misconduct allegations, citing AI manipulation, and pledged to personally manage his social media moving forward."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/30-years-dilwale-dulhania-le-jayenge-how-maratha-mandir-continues-to-celebrate-raj-simrans-love-story-2805771-2025-10-20",
      "headline": "30 years of DDLJ: How Maratha Mandir continues to celebrate Raj-Simran's love story 'Dilwale Dulhania Le Jayenge' continues its timeless run at Mumbai's Maratha Mandir, celebrating 30 years of enchanting audiences with its unforgettable love story. This enduring ritual unites generations, keeping alive a cherished Bollywood legacy in the heart of the city."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khans-viral-remark-separating-balochistan-from-pakistan-sparks-debate-2805767-2025-10-20",
      "headline": "Salman Khan's viral remark separating Balochistan from Pakistan sparks debate Salman Khan mentioned Balochistan and Pakistan separately during his speech at a Riyadh event. Social media users now discuss whether it was the possible intent or a slip of the tongue. Comment reignites conversations on Balochistan's history and identity. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ishaan-khatter-backs-fair-work-hours-after-deepika-padukones-8-hour-shift-debate-2805755-2025-10-20",
      "headline": "Ishaan Khatter backs fair work hours after Deepika Padukone's 8-hour shift debate The debate on fair work hours in Bollywood is gaining momentum, with Ishaan Khatter urging respect for everyone's time and Deepika Padukone's 8-hour stance highlighting gender double standards."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-j-hope-to-feature-in-le-sserafims-upcoming-single-spaghetti-2805758-2025-10-20",
      "headline": "BTS' J-hope to feature in Le Sserafim's upcoming single Spaghetti BTS' J-hope returns to the K-pop scene as a featured artist on Le Sserafim's upcoming single 'Spaghetti', marking his first-ever collaboration with a girl group. The track promises a bold fusion of J-hope's signature groove and Le Sserafim's experimental sound."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-warns-hamas-to-uphold-ceasefire-amid-middle-east-peace-talks-glbs-2805878-2025-10-21",
      "headline": "Be good or you'll be eradicated: Trump warns Hamas as Gaza ceasefire faltersDonald Trump warned Hamas to uphold the ceasefire with Israel, saying the group \"must behave\" or face consequences. As US envoys Jared Kushner and Steve Witkoff met Benjamin Netanyahu in Jerusalem, Washington pushed to advance its peace plan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shouldnt-be-under-protection-like-this-indian-envoy-to-canada-flags-khalistani-concerns-2805807-2025-10-20",
      "headline": "Canadian problem, not Indian: Envoy flags safety concerns from KhalistanisAs India and Canada attempt to mend strained ties, High Commissioner Dinesh Patnaik rejected Ottawa's allegations linking Indian diplomats to homicides and extortion in Canada. In an interview with CTV, Patnaik said India is still waiting for evidence and described the claims as \"preposterous and absurd\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/veteran-actor-asrani-dies-at-84-nephew-ashok-confirms-2805860-2025-10-20",
      "headline": "Veteran actor and comic legend Asrani dies at 84, funeral held in MumbaiVeteran actor Asrani died at 84 today after a prolonged illness. He was known for playing versatile characters in films such as 'Sholay', 'Mere Apne', 'Bawarchi', 'Abhimaan' and 'Chupke Chupke'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bihar-tea-seller-turns-cyber-fraud-kingpin-rs-105-crore-cash-gold-seized-in-gopalganj-raid-2805833-2025-10-20",
      "headline": "Bihar tea seller turns cyber fraud kingpin; Rs 1.05 crore cash, gold seized in raidBihar Police has uncovered a massive cybercrime racket operating out of Gopalganj, where a former tea seller allegedly ran an online fraud network. Over Rs 1 crore in cash, jewellery, and dozens of ATM cards and passbooks were recovered from his home, leading to the arrest of two brothers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/to-mark-diwali-indian-astronaut-shubhanshu-shukla-shows-how-india-looks-like-a-jewel-from-space-2805838-2025-10-20",
      "headline": "To mark Diwali, Shubhanshu Shukla shows how India looks like a jewel from spaceThe video, captured from the space station's observation module, sweeps across the subcontinent from southwest to northeast, revealing the dazzling glow of Indian cities celebrating the festival of lights. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/world-leaders-join-india-celebrating-diwali-festival-lights-glbs-2805877-2025-10-21",
      "headline": "Trump, Starmer, Netanyahu and other world leaders extend Diwali greetingsWorld leaders including Donald Trump, Benjamin Netanyahu, Keir Starmer, and Mark Carney extended warm Diwali greetings as India celebrated the festival of lights with devotion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/rjd-candidate-list-143-seats-bihar-assembly-polls-mahagathbandhan-seat-sharing-rift-2805743-2025-10-20",
      "headline": "RJD fields 143 candidates for Bihar polls amid Mahagathbandhan seat-sharing riftRJD leader Tejashwi Yadav will contest from the Raghopur assembly seat in Vaishali district. The elections are scheduled for November 6 and 11, with counting and declaration of results on November 14."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/karnataka-bengaluru-ola-ceo-bhavish-aggarwal-suicide-k-aravind-2805784-2025-10-20",
      "headline": "Ola employee dies by suicide, blames CEO Bhavish Aggarwal in 28-page noteAn Ola Electric employee in Bengaluru died after allegedly consuming poison on September 28. A 28-page death note blamed CEO Bhavish Aggarwal and senior officer Subrata Kumar Das. An FIR was filed against them on October 6."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/steve-jobs-his-daughter-lisa-and-the-apple-computer-named-after-her-2805432-2025-10-19",
      "headline": "Steve Jobs named a computer after his daughter, but denied she existedIn 1978, Steve Jobs denied that he was the father of his newborn daughter, Lisa, even as Apple secretly developed a $50 million computer with the same name. Decades later, Lisa Brennan-Jobs's memoir Small Fry revealed how her father's denial, cruelty, and late confession became Silicon Valley's most human story."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-trump-tariffs-are-piling-losses-uncertainty-on-indias-textile-sector-2805592-2025-10-19",
      "headline": "How Trump tariffs are piling losses, uncertainty on India's textile sectorThe impact is more than evident in a hub like Surat, where exporters are battling a huge drop in turnover and estimated losses totalling Rs 7,200 crore"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/jmm-opts-out-of-bihar-polls-2025-accuses-rjd-political-cunningness-seat-sharing-talks-supriyo-bhattacharya-2805854-2025-10-20",
      "headline": "JMM opts out of Bihar polls, accuses RJD of cunningness during seat-sharing talksThe JMM, a key ally in the INDIA bloc, also said it will not support any other party in the polls, which are scheduled to be held in November."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iranian-supreme-leader-ayatollah-ali-khamenei-rejects-trumps-offer-for-talks-denies-us-destroyed-irans-nukes-2805853-2025-10-20",
      "headline": "Khamenei rejects Trump's offer for talks, denies US destroyed Iran's nukesLast week, Trump told the Israeli parliament that it would be great if Washington could negotiate a \"peace deal\" with Tehran, following the start of a ceasefire in Gaza between Israel and Palestinian militant group Hamas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-on-30-years-of-dilwale-dulhania-le-jayenge-nobody-could-have-foreseen-its-place-in-hearts-2805825-2025-10-20",
      "headline": "Shah Rukh Khan on 30 years of DDLJ: Nobody could have foreseen its place in heartsShah Rukh Khan reflected on 30 years of 'Dilwale Dulhania Le Jayenge', expressing gratitude for the global love he has received for his role as Raj. He credited the film's success to the team's dedication, Aditya Chopra's vision, and the lasting impact it has had on audiences and pop culture."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-woman-cuts-off-brother-in-laws-private-parts-for-ditching-her-sister-after-affair-in-a-savage-act-of-revenge-2805797-2025-10-20",
      "headline": "Woman cuts off brother-in-law's private parts for ditching her sister after affairA shocking crime in Prayagraj's Mauaima area has left residents stunned after police uncovered that a 20-year-old youth's sister-in-law was behind a brutal attack that severed his private part."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-celebrates-diwali-with-navy-personnel-onboard-ins-vikrant-2805740-2025-10-20",
      "headline": "INS Vikrant gave sleepless nights to Pak: PM's big praise for Navy on DiwaliIn the wake of the April 22 Pahalgam terror attacks, the Navy was placed on high alert in the Arabian Sea, prompting Pakistan to issue warnings amid fears of a possible naval strike. At the heart of the deployment was INS Vikrant, accompanied by 8 to 10 warships."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/story/thousands-of-customers-hit-as-amazons-cloud-service-aws-reports-global-outage-apps-and-websites-down-2805800-2025-10-20",
      "headline": "Amazon cloud service AWS down globally; Snapchat, Prime Video among those affectedAmazon Web Services (AWS) experienced a major outage on Monday, disrupting access to numerous popular apps and websites including Fortnite, Snapchat, Coinbase, Robinhood, and Amazon's own services."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/history-and-diwali-what-old-paintings-reveal-about-the-festival-of-lights-2805823-2025-10-20",
      "headline": "History and Diwali: What old paintings reveal about the festival of lightsFor centuries, Diwali has been celebrated across India as a festival of light and renewal. From the glow of earthen lamps to the sparkle of fireworks, the tradition has carried both devotion and joy. Old paintings from royal courts and homes show how people in medieval times marked the occasion – lighting terraces, decorating courtyards, and gathering to celebrate the victory of light over darkness."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/gujarat-cabinet-reshuffle-why-bjp-rejigged-its-gujarat-cabinet-en-masse-again-2805594-2025-10-19",
      "headline": "Why BJP rejigged its Gujarat cabinet en masse againAfter a break of five years, the BJP government gets a deputy chief minister in Harsh Sanghavi, the move read in quarters as a subtle dent to CM Bhupendra Patel"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/47-magnitude-earthquake-strikes-pakistan-third-such-temblor-in-three-days-2805847-2025-10-20",
      "headline": "4.7 magnitude earthquake strikes Pakistan, third such temblor in three daysA 4.7 magnitude earthquake struck Pakistan on Monday at a shallow depth of 10 km, following moderate quakes over the weekend."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/cctv-shows-haryana-cop-puran-kumars-pso-demanding-rs-25-lakh-from-liquor-trader-in-suicide-case-2805840-2025-10-20",
      "headline": "CCTV shows Haryana cop's aide demanding Rs 2.5 lakh from liquor traderCCTV footage in the Rohtak suicide case of IG Y Puran Kumar and ASI Sandeep Lathar shows Kumar's PSO, Sushil Kumar, allegedly demanding Rs 2.5 lakh from liquor businessman Praveen Bansal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/diwali-2025-lakshmi-ganesh-puja-shubh-muhurat-tithi-puja-vidhi-and-significance-2805765-2025-10-20",
      "headline": "Diwali 2025: Lakshmi-Ganesh puja shubh muhurat, tithi, puja vidhi and significanceDiwali 2025 will be celebrated on October 20 with grandeur across India. As per the Panchang, the Lakshmi-Ganesh puja will take place during the evening's auspicious Pradosh Kaal and Sthir Lagna Muhurat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/silver-price-falls-after-dhanteras-diwali-but-is-precious-metal-still-a-good-bet-explained-2805622-2025-10-20",
      "headline": "Silver prices fall after Diwali buying. Is it still a good bet?Silver has surged nearly 98% in a year, breaching Rs 2 lakh/kg in parts of India before a post-Diwali dip. But is investing in the precious metal still a good bet? With industrial demand booming and supply tightening, reports suggest silver's shine might just be getting started."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/china-files-wto-complaint-against-india-over-ev-subsidies-and-batteries-2805811-2025-10-20",
      "headline": "China files WTO complaint against India over EV subsidies and batteriesChina has filed a complaint against India at the World Trade Organization, challenging New Delhi's subsidies for electric vehicles (EVs) and batteries. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/pehla-pehla-pyaar-hai-dance-video-delhi-metro-coach-viral-2805673-2025-10-20",
      "headline": "Video of little girls' Pehla Pehla Pyaar dance inside Delhi Metro coach goes viralA video of three little girls dancing to the Bollywood classic 'Pehla Pehla Pyaar Hai' inside a Delhi Metro coach went viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/twinkle-akshay-opt-for-oranges-over-sweets-during-diwali-celebration-in-london-2805857-2025-10-20",
      "headline": "Twinkle, Akshay opt for oranges over sweets during Diwali celebration in LondonTwinkle Khanna and Akshay Kumar celebrated Diwali in London with a twist by choosing oranges over sweets. Their unique festive spirit highlights a healthy alternative during the celebrations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/veteran-actor-asrani-dies-at-84-nephew-ashok-confirms-2805860-2025-10-20",
      "headline": "Veteran actor and comic legend Asrani dies at 84, funeral held in MumbaiVeteran actor Asrani died at 84 today after a prolonged illness. He was known for playing versatile characters in films such as 'Sholay', 'Mere Apne', 'Bawarchi', 'Abhimaan' and 'Chupke Chupke'."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-new-odi-captain-shaheen-afridi-mohammad-rizwan-replaced-2805876-2025-10-20",
      "headline": "Shaheen Afridi replaces Mohammad Rizwan as Pakistan's new ODI captain Shaheen Afridi has been named Pakistan's new ODI captain, replacing Mohammad Rizwan. He will lead the team in the upcoming series against South Africa starting November 4."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/chamari-athapaththu-last-over-heroics-sri-lanka-win-bangladesh-womens-world-cup-2025-2805875-2025-10-20",
      "headline": "Bangladesh implode in dramatic last-over thriller as Sri Lanka keep semis hopes alive Chamari Athapaththu's brilliant final over secured a narrow seven-run victory for Sri Lanka over Bangladesh. The win keeps Sri Lanka's semi-final hopes alive but leaves Bangladesh rueing missed chances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fc-goa-vs-al-nassr-afc-champions-league-2-manolo-marquez-stay-realistic-2805874-2025-10-20",
      "headline": "Manolo Marquez urges FC Goa fans to stay realistic about Al Nassr clash Manolo Marquez has called for patience and perspective from FC Goa fans ahead of their clash with Al Nassr. The Spaniard reminded supporters that facing the Saudi heavyweights is far from an ordinary game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-pace-injuries-shamar-joseph-ruled-out-bangladesh-odi-series-2805868-2025-10-20",
      "headline": "After missing India tour, West Indies' Shamar Joseph ruled out of Bangladesh series West Indies pace bowlers Shamar Joseph and Jediah Blades are ruled out of the Bangladesh ODI series due to injuries. The team brings in Akeal Hosein and Ramon Simmonds as reinforcements amid concerns over player fitness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-bcci-player-selector-clarity-mohammed-shami-ajit-agarkar-2805863-2025-10-20",
      "headline": "R Ashwin urges BCCI to practice player-selector clarity after Shami row Ravichandran Ashwin has called on the BCCI to improve clarity between players and selectors. He highlighted Mohammed Shami's recent ODI snub as an example of how indirect communication can create confusion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/barcelona-manager-hansi-flick-emotional-change-injury-crisis-olympiakos-clash-2805855-2025-10-20",
      "headline": "Barcelona's Hansi Flick admits club changed him after emotional outburst against Girona Barcelona manager Hansi Flick has opened up on how his time at the club has changed him emotionally. The team faces a tough Champions League match with many key players sidelined due to injuries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-vs-england-harry-brook-1000-t20i-runs-phil-salt-2805856-2025-10-20",
      "headline": "England captain Harry Brook completes 1000 T20I runs after New Zealand blitz England captain Harry Brook reached 1000 T20I runs with a spectacular 78 off 35 balls against New Zealand. His innings highlighted fearless strokeplay and leadership, cementing his place among England's elite T20I run-scorers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/jurgen-klopp-manchester-united-manager-job-rejection-attitude-reason-2805852-2025-10-20",
      "headline": "Jurgen Klopp cites Manchester United's attitude as reason for rejecting manager role Jurgen Klopp has revealed why he turned down Manchester United, citing issues with the club's attitude and approach. He chose to wait for a project aligned with his philosophy, ultimately finding success with Liverpool."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-sa-2nd-test-day-1-shan-masood-anchors-pakistan-south-africa-missed-chances-rawalpindi-2805848-2025-10-20",
      "headline": "Shan Masood anchors Pakistan on Day 1 as South Africa rue missed chances in Rawalpindi Pakistan reached 259 for five at stumps on day one of the second Test in Rawalpindi, with captain Shan Masood leading from the front. South Africa missed several fielding opportunities, putting themselves under pressure as Pakistan set a solid platform."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/navjot-singh-sidhu-denies-viral-quote-bcci-gambhir-rohit-sharma-india-australia-odi-2805832-2025-10-20",
      "headline": "Navjot Sidhu denies fake quote on Gambhir's sacking, Rohit Sharma's captaincy return Former India cricketer Navjot Singh Sidhu has issued a strong denial after a fabricated quote regarding the 2027 ODI World Cup went viral on social media. The incident comes amid renewed attention on the Indian cricket team following the return of Rohit Sharma and Virat Kohli to international play."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/wayne-rooney-harry-maguire-england-world-cup-2025-liverpool-vs-manchester-united-2805839-2025-10-20",
      "headline": "Maguire was a meme, bullied: Rooney backs England defender for World Cup Wayne Rooney heaped praise on Harry Maguire and claimed that the defender should be a part of England's squad for the World Cup 2026. Maguire scored the winner for Manchester United in their 2-1 win over Liverpool. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-vs-england-harry-brook-1000-t20i-runs-phil-salt-2805856-2025-10-20",
      "headline": "England captain Harry Brook completes 1000 T20I runs after New Zealand blitz England captain Harry Brook reached 1000 T20I runs with a spectacular 78 off 35 balls against New Zealand. His innings highlighted fearless strokeplay and leadership, cementing his place among England's elite T20I run-scorers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/jurgen-klopp-manchester-united-manager-job-rejection-attitude-reason-2805852-2025-10-20",
      "headline": "Jurgen Klopp cites Manchester United's attitude as reason for rejecting manager role Jurgen Klopp has revealed why he turned down Manchester United, citing issues with the club's attitude and approach. He chose to wait for a project aligned with his philosophy, ultimately finding success with Liverpool."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pak-vs-sa-2nd-test-day-1-shan-masood-anchors-pakistan-south-africa-missed-chances-rawalpindi-2805848-2025-10-20",
      "headline": "Shan Masood anchors Pakistan on Day 1 as South Africa rue missed chances in Rawalpindi Pakistan reached 259 for five at stumps on day one of the second Test in Rawalpindi, with captain Shan Masood leading from the front. South Africa missed several fielding opportunities, putting themselves under pressure as Pakistan set a solid platform."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/navjot-singh-sidhu-denies-viral-quote-bcci-gambhir-rohit-sharma-india-australia-odi-2805832-2025-10-20",
      "headline": "Navjot Sidhu denies fake quote on Gambhir's sacking, Rohit Sharma's captaincy return Former India cricketer Navjot Singh Sidhu has issued a strong denial after a fabricated quote regarding the 2027 ODI World Cup went viral on social media. The incident comes amid renewed attention on the Indian cricket team following the return of Rohit Sharma and Virat Kohli to international play."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/wayne-rooney-harry-maguire-england-world-cup-2025-liverpool-vs-manchester-united-2805839-2025-10-20",
      "headline": "Maguire was a meme, bullied: Rooney backs England defender for World Cup Wayne Rooney heaped praise on Harry Maguire and claimed that the defender should be a part of England's squad for the World Cup 2026. Maguire scored the winner for Manchester United in their 2-1 win over Liverpool. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-new-zealand-t20i-christchurch-2025-match-report-salt-brook-2805826-2025-10-20",
      "headline": "Salt, Brook and Rashid star as England thump New Zealand in 2nd T20I by 65 runsPhil Salt and Harry Brook's heroics with the bat and Adil Rashid's brilliant spell helped England secure a 65-run win over New Zealand in the second T20I. New Zealand's decision to bowl first came back to hurt them. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-women-cricket-pay-gap-world-cup-bcci-pay-equity-2805810-2025-10-20",
      "headline": "Do Indian women's cricket team get paid same as the men's team? Know real truthThe BCCI (Board of Control for Cricket in India) is the richest cricket board in the world. As BCCI earns year-round through broadcast and sponsorship deals and the IPL, the benefits also spread to the players representing India. However, are the men and women paid equally?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/cristiano-ronaldo-india-travel-snub-al-nassr-vs-fc-goa-reports-afc-champions-league-2-2805817-2025-10-20",
      "headline": "Cristiano Ronaldo snubs India trip for FC Goa clash despite repeated club requestsCristiano Ronaldo has decided not to travel to India for Al-Nassr's AFC Champions League 2 clash against FC Goa, disappointing fans who had hoped to see both Ronaldo and Lionel Messi play in India this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/graham-potter-appointed-sweden-head-coach-to-boost-2026-world-cup-qualification-hopes-2805801-2025-10-20",
      "headline": "Weeks after West Ham United sacking, Graham Potter appointed Sweden coachWeeks after being sacked by West Ham United, Graham Potter took charge of Sweden's national team on Monday, October 20. Potter will aim to revive Sweden's World Cup qualification hopes after a poor start in Group B."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-ind-rohit-sharma-tips-nitish-reddy-to-be-an-all-format-great-for-india-2805799-2025-10-20",
      "headline": "AUS vs IND: Rohit Sharma tips Nitish Reddy to be an all-format great for IndiaRohit Sharma presented Nitish Reddy his ODI debut cap and praised his commitment. The all-rounder is tipped to become a key player across all formats for India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/aus-vs-ind-mohammed-kaif-questions-kohli-rohit-preparation-australia-odi-2025-2805796-2025-10-20",
      "headline": "Virat Kohli, Rohit Sharma's lack of preparation for Australia questioned by KaifFormer cricketer Mohammed Kaif questioned both Virat Kohli and Rohit Sharma's preparation for the Australia tour, asking why both stars didn't arrive down under a few days earlier. Kohli and Rohit flopped in the first ODI against the Aussies in Perth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/simon-harmer-pakistan-vs-south-africa-imam-ul-haq-2805791-2025-10-20",
      "headline": "Watch: Simon Harmer's ridiculous delivery to dismiss Imam-ul-Haq in RawalpindiSouth Africa spinner Simon Harmer bowled a gem of a delivery against Imam ul Haq in the Rawalpindi Test match. In the morning session of Day 1, Harmer was able to turn the ball square against the opener."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-ind-rohit-sharma-tips-nitish-reddy-to-be-an-all-format-great-for-india-2805799-2025-10-20",
      "headline": "AUS vs IND: Rohit Sharma tips Nitish Reddy to be an all-format great for IndiaRohit Sharma presented Nitish Reddy his ODI debut cap and praised his commitment. The all-rounder is tipped to become a key player across all formats for India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/aus-vs-ind-mohammed-kaif-questions-kohli-rohit-preparation-australia-odi-2025-2805796-2025-10-20",
      "headline": "Virat Kohli, Rohit Sharma's lack of preparation for Australia questioned by KaifFormer cricketer Mohammed Kaif questioned both Virat Kohli and Rohit Sharma's preparation for the Australia tour, asking why both stars didn't arrive down under a few days earlier. Kohli and Rohit flopped in the first ODI against the Aussies in Perth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/simon-harmer-pakistan-vs-south-africa-imam-ul-haq-2805791-2025-10-20",
      "headline": "Watch: Simon Harmer's ridiculous delivery to dismiss Imam-ul-Haq in RawalpindiSouth Africa spinner Simon Harmer bowled a gem of a delivery against Imam ul Haq in the Rawalpindi Test match. In the morning session of Day 1, Harmer was able to turn the ball square against the opener."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/mohamed-salah-under-scrutiny-liverpool-lose-2-1-to-manchester-united-2805785-2025-10-20",
      "headline": "Salah shouldn't be an automatic starter for Liverpool in away games: CarragherJamie Carragher has cast doubt on Mohamed Salah's regular spot in Liverpool's starting eleven after a fourth consecutive loss, spotlighting the forward's declining influence and raising the prospect of reconstructing the side around recent acquisitions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/vinicius-nyom-red-card-controversy-real-madrid-getafe-2025-laliga-2805778-2025-10-20",
      "headline": "Real Madrid, Vinicius Jr. called out after Allan Nyom red card incidentReal Madrid and Vinicius jr. were called out after the Allan Nyom red card incident during the clash with Getafe on Sunday, October 19. The dismissal of Nyom proved to be the difference in the clash. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/josh-hazlewood-perth-pitch-india-vs-australia-2805768-2025-10-20",
      "headline": "Josh Hazlewood wants Perth-styled pitch for 1st Ashes TestFast bowler Josh Hazlewood wants the pitch used in India vs Australia's 1st ODI for the first Ashes Test. Hazlewood was the star of the show as the hosts ripped apart Shubman Gill's side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammad-kaif-slams-shubman-gill-for-kuldeep-yadav-snub-with-shane-warnes-example-2805744-2025-10-20",
      "headline": "Mohammad Kaif slams Shubman Gill for Kuldeep snub with Shane Warne's exampleFormer India cricketer Mohammad Kaif slammed Shubman Gill for dropping Kuldeep Yadav for the first ODI against Australia in Perth. India went in with three all-rounders for the fixture but still ended up on the losing side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-england-women-press-conference-video-2805752-2025-10-20",
      "headline": "Heather Knight explains how England outfoxed India against the odds in IndoreWomen's World Cup: England's Heather Knight believes that India were under immense pressure to win the World Cup fixture in Indore. Knight said that England's plan was to take the game deep and put pressure on India by picking wickets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/womens-world-cup-2025-ind-vs-eng-smriti-mandhana-full-post-match-press-conference-2805736-2025-10-20",
      "headline": "My innings doesn't mean anything because we lost the match: Smriti MandhanaIndia vice captain Smriti Mandhana took the blame for the team's loss in their fifth fixture of the Women's World Cup 2025 in Indore. Mandhana played a brilliant knock of 88 (94). Despite her efforts, India ended up losing the match by four runs as they failed to chase the target of 289."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}