{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-lays-off-600-customer-support-employees-report-2702418-2025-04-01",
      "headline": "Zomato lays off 600 customer support employees: ReportThe company hired nearly 1,500 customer support staff under Zomato's Zomato Associate Accelerator Program (ZAAP), with the goal of promoting them into various roles in sales, operations, supply chains and other departments, within a year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-top-gainers-loser-key-insights-sensex-nifty-technical-indicators-2702333-2025-04-01",
      "headline": "1st trading day of FY26 ends in bloodbath: Top gainers, losers, key insightsThe S&P BSE Sensex ended nearly 1,400 points lower, while the NSE Nifty50 closed below 23,200. The uncertainty surrounding the Trump administration's expected reciprocal tariff imposition on imported goods triggered a significant sell-off, causing the domestic market to underperform other global indices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-falls-nearly-1400-points-nifty-tumbles-350-points-hcltech-tanks-4-percent-2702286-2025-04-01",
      "headline": "Sensex falls nearly 1,400 points, Nifty tumbles 350 points; HCLTech tanks 4%The S&P BSE Sensex plunged 1,390.41 points to close at 76,024.51, while the NSE Nifty50 tanked 353.65 points to end at 23,165.70. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-crash-vix-volatility-fear-index-rise-10-percent-what-should-investors-know-expert-view-2702281-2025-04-01",
      "headline": "Stock market crash: Why should investors watch out for rising volatility?The stock market fear index surged 10% on Tuesday as investors braced for the impact of US reciprocal tariffs, which are set to take effect from April 2."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/us-reciprocal-tariff-impact-on-india-stock-market-crash-sensex-nifty-correction-explained-2702178-2025-04-01",
      "headline": "Sensex down over 1,400 points: US tariff panic or other factors at play?Is the surrounding uncertainty reciprocal tariffs the only factor behind today's stock market bloodbath, or are other underlying issues driving the sharp correction? Read on to find out what's spooking Dalal Street investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/will-epfo-raise-claim-withdrawal-limit-from-rs-1-lakh-to-rs-5-lakh-in-april-2025-check-here-2702170-2025-04-01",
      "headline": "Will EPFO raise claim withdrawal limit to Rs 5 lakh in April 2025? Check hereEPFO is planning to allow Provident Fund (PF) withdrawals via UPI and ATMs soon. This move will make it easier for members to withdraw their PF money without delays."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-will-what-is-no-contest-clause-meaning-rs-3800-crore-wealth-distribution-2702173-2025-04-01",
      "headline": "Ratan Tata's will includes a 'no-contest' clause: What does it mean?Ratan Tata dedicated most of his fortune, including his Tata Sons shares, to charity. However, he also ensured that his family, close friends, employees, and even his cherished pets were taken care of."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/10-major-financial-rule-changes-from-april-1-new-tax-rules-upi-updates-pan-aadhaar-updates-tds-gst-rules-2702124-2025-04-01",
      "headline": "10 major financial rule changes from April 1: Tax, UPI updates and moreFrom April 1, you won't have to pay income tax if your annual income is up to Rs 12 lakh. Also, with a standard deduction of Rs 75,000, income up to Rs 12.75 lakh is tax-free under the new tax system."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-will-rs-3800-crore-who-gets-what-family-trust-pet-dog-2702120-2025-04-01",
      "headline": "Ratan Tata's Rs 3,800 crore will: Who gets what?Ratan Tata will: The industrialist, who died on October 9, 2024, left most of his wealth, including shares in Tata Sons, to charitable causes. At the same time, he did not forget his family, close friends, staff, and even his beloved pets."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/commercial-lpg-cylinder-prices-slashed-by-rs-41-from-today-2702099-2025-04-01",
      "headline": "Commercial LPG cylinder prices slashed by Rs 41 from todayWhile the price of commercial LPG cylinders has been reduced, the price of domestic cylinders used by households has not changed."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/vodafone-idea-share-price-rise-10-percent-reason-government-stake-increase-2702091-2025-04-01",
      "headline": "Explained: Why Vodafone Idea shares hit 10% upper circuit todayVodafone Idea share price: The stock has gained 4.47% in the past five days and 0.27% over the past month. However, it remains 26.45% lower over the past six months and has dropped 46.57% in the last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-tcs-hcltech-stock-price-why-are-it-shares-falling-today-key-reasons-explained-2702090-2025-04-01",
      "headline": "Infosys, TCS, HCLTech: Why are IT stocks down today?Shares of IT companies such as Tata Consultancy Services (TCS), Infosys and HCLTech took a big hit during intraday trade. Infosys was down over 2.3%, while HCLTech and TCS fell as much as 1.7% at around 10:10 am."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/esha-deol-wants-dhoom-to-re-release-2702424-2025-04-01",
      "headline": "Esha Deol wants Dhoom to re-release: Kids still remember me for the filmActor Esha Deol recently said she wants Dhoom to be released again in cinemas. Apart from Deol, the film starred Abhishek Bachchan, Uday Chopra and John Abraham in the lead. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/subham-teaser-samantha-turns-producer-with-a-quirky-horror-comedy-2702405-2025-04-01",
      "headline": "Subham teaser: Samantha turns producer with the quirky horror-comedyActor Samantha released the teaser of her debut production, Subham. The Telugu horror-comedy offers a sneak peek into its intriguing premise, showcasing the film's distinct blend of horror and humour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/john-abraham-the-diplomat-screened-in-israel-as-tribute-to-india-israel-relations-2702394-2025-04-01",
      "headline": "John Abraham's Diplomat screened in Israel as tribute to India-Israel relationsIn a gesture celebrating India-Israel relations, Israel has screened John Abraham's film The Diplomat. Directed by Shivam Nair, the film hit theatres on March 14. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/jessica-simpson-vocal-cord-remedy-chinese-herb-cocktail-with-snake-sperm-2702368-2025-04-01",
      "headline": "Drink snake sperm if you want good vocal: Singer Jessica SimpsonAmerican singer and actor Jessica Simpson recently shared her unusual method for maintaining her vocal cords, involving a Chinese herb cocktail containing snake sperm. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/andaz-apna-apna-salman-khan-aamir-khans-cult-comedy-to-re-release-on-april-25-2702393-2025-04-01",
      "headline": "Andaz Apna Apna: Salman Khan, Aamir Khan's cult comedy to re-release on April 25Bollywood's beloved comedy 'Andaz Apna Apna' is making a comeback to the big screen. The cult classic will be re-released in cinemas nationwide, delighting both new and old fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shalini-pandey-south-director-entered-van-when-she-was-changing-2702297-2025-04-01",
      "headline": "Actor Shalini Pandey says South director entered her van when she was changingActor Shalini Pandey, who made her debut with the Telugu film Arjun Reddy, said that a South director entered her van without knocking on the door. She also recalled how she reacted at the moment."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kim-soo-hyuns-press-meet-draws-flak-from-fans-being-highest-paid-actor-backfired-2702346-2025-04-01",
      "headline": "Being highest paid actor backfired: Internet after Kim Soo-hyun's conferenceActor Kim Soo-hyun's recent press conference regarding the Kim Sae-ron death controversy has been met with significant backlash. Internet accused him of being overly rehearsed and failing to convince the public of his innocence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rasha-thadani-opposite-kartik-aaryan-in-pati-patni-aur-woh-sequel-report-2702212-2025-04-01",
      "headline": "Rasha Thadani, not Sreeleela opposite Kartik in Pati Patni Aur Woh sequel: ReportSreeleela has once again made headlines after being replaced by Rasha Thadani as the female lead opposite Kartik Aaryan in the sequel to Pati Patni Aur Woh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/who-is-to-be-blamed-for-sikandar-salman-khan-magnum-opus-by-ar-murugadoss-which-failed-to-impress-his-fans-2702250-2025-04-01",
      "headline": "Who is to be blamed for Sikandar?'Sikandar' is like the final nail in the coffin for the audience who have loved, celebrated and almost worshipped Salman Khan for being this undisputable, badass superstar, with a command on the big-screen like no other. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/24-cuts-in-mohanlal-empuraan-villain-name-changed-2702262-2025-04-01",
      "headline": "24 cuts in Mohanlal's Empuraan, villain's name changed in revised versionA total of 24, not 17, cuts have been suggested for the Prithviraj directorial, L2: Empuraan, which stars Mohanlal in a pivotal role. The film is currently running successfully in cinemas. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/first-copy-teaser-munawar-faruqui-web-series-amazon-mx-player-2702257-2025-04-01",
      "headline": "First Copy: Teaser of Munawar Faruqui's debut show outThe teaser of First Copy, featuring Munawar Faruqui, is out, and it is set to premiere on Amazon MX Player. The series explores the 90s film industry's piracy world, with Faruqui playing the lead role of Arif, a piracy mastermind."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dharmendra-undergoes-successful-cataract-surgery-assures-fans-im-strong-2702242-2025-04-01",
      "headline": "Dharmendra undergoes successful cataract surgery, assures fans: I'm strongLegendary actor Dharmendra has successfully undergone cataract surgery, with a viral video showing him in high spirits. Fans have flooded social media with well wishes, praising his resilience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/malaika-arora-wants-to-do-classical-dance-in-films-try-bharatanatyam-2702226-2025-04-01",
      "headline": "Malaika Arora wants to do classical dance in films: Would love to try BharatanatyamMalaika Arora wishes to perform Bharatanatyam in films. She said she has never explored classical Indian dance on-screen. The Hip-Hop India 2 judge also spoke about stepping out of her comfort zone."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/house-of-dragon-3-is-now-in-production-2702189-2025-04-01",
      "headline": "House of Dragon 3 is now in productionThe makers of HBO's House of Dragon recently confirmed that the third season of the show is currently in production. The show, based on George RR Martin's novels, will consist of four seasons. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/yaariyan-actor-himansh-kohli-hospitalised-says-never-take-health-for-granted-2702205-2025-04-01",
      "headline": "Yaariyan actor Himansh Kohli hospitalised, says 'never take health for granted'Yaariyan actor Himansh Kohli shared a hospital video, revealing a tough 15-day health battle. He thanked loved ones for support and urged fans to prioritise health. The Yaariyaan actor assured he would bounce back soon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/asif-ali-mohanlal-empuraan-controversy-riot-scenes-view-cinema-as-cinema-2702201-2025-04-01",
      "headline": "Malayalam actor Asif Ali reacts to Empuraan controversy: View cinema as cinemaMalayalam actor Asif Ali was asked about the ongoing controversy over the depiction of riot scenes in Mohanlal's L2: Empuraan. He also addressed the issue of the film being re-edited and online trolling on Mohanlal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/abir-gulaal-fawad-khan-returns-to-bollywood-vaani-kapoor-romantic-2702172-2025-04-01",
      "headline": "Abir Gulaal: Fawad Khan returns to Bollywood with Vaani Kapoor in romantic rolePakistan's heartthrob Fawad Khan is all set to grace Indian cinemas once again with the romantic drama, Abir Gulaal, where he will be seen sharing screen space with Vaani Kapoor. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/film-employees-federation-of-kerala-slams-personal-attacks-on-mohanlal-prithviraj-amid-l2-empuraan-row-2702174-2025-04-01",
      "headline": "Cine body slams personal attacks on Mohanlal, Prithviraj amid L2 Empuraan rowThe Film Employees Federation of Kerala (FEFKA) has condemned social media attacks on filmmaker Prithviraj Sukumaran and superstar Mohanlal amid Empuraan controversy. They emphasised the importance of constructive criticism and solidarity with L2: Empuraan's creators."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/the-beatles-franchise-cast-announced-with-paul-mescal-barry-keoghan-joseph-quinn-harris-dickinson-2702167-2025-04-01",
      "headline": "The Beatles franchise cast announced: Paul Mescal, Barry Keoghan to headlineAcclaimed director Sam Mendes has announced the cast for his Beatles biopic series set for a 2028 premiere. The project promises a fresh perspective on the Fab Four, with each film focusing on a different band member."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/china-india-partners-mutual-achievement-xi-jinping-75th-anniversary-of-ties-president-murmu-report-2702310-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India-China ties should be developed in 'dragon-elephant tango': Xi JinpingOn the 75th anniversary of diplomatic ties between India and China, Chinese President Xi Jinping said bilateral relations should take the form of a 'dragon-elephant tango', amid efforts to reset ties after the 2020 eastern Ladakh standoff."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/waqf-amendment-bill-parliament-controversial-provisions-explained-2702387-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ahead of Waqf bill war in Parliament, a look at what fuelled the controversyWaqf Amendment Bill: The Waqf bill, which will give the government a say in regulating waqf properties and settling disputes, will be tabled in Lok Sabha on Wednesday in what is expected to be stormy affair."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/diu/story/india-apparel-sector-may-be-hit-hardest-by-trump-us-reciprocal-tariffs-2702410-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why India's apparel sector may be hit hardest by Trump's reciprocal tariffsAccording to Emkay Research, while India could be among the worst-hit nations per broad reciprocal differentials, the key susceptible sectors (auto, pharma, electronics) are far better placed than feared. Apparel and gems/jewellery are the most exposed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-lays-off-600-customer-support-employees-report-2702418-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Zomato lays off 600 customer support employees: ReportThe company hired nearly 1,500 customer support staff under Zomato's Zomato Associate Accelerator Program (ZAAP), with the goal of promoting them into various roles in sales, operations, supply chains and other departments, within a year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/who-is-to-be-blamed-for-sikandar-salman-khan-magnum-opus-by-ar-murugadoss-which-failed-to-impress-his-fans-2702250-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Who is to be blamed for Sikandar?'Sikandar' is like the final nail in the coffin for the audience who have loved, celebrated and almost worshipped Salman Khan for being this undisputable, badass superstar, with a command on the big-screen like no other. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-live-score-lsg-vs-pbks-today-match-updates-lucknow-2702406-2025-04-01#?utm_source=LiveBlog_hp&utm_medium=LiveBlog&utm_campaign=home_LiveBlog",
      "headline": "LSG vs PBKS live score: Punjab, Lucknow look to carry winning momentumIPL 2025, Lucknow Super Giants (LSG) vs Punjab Kings (PBKS) Live Score: LSG began their journey with a one-wicket defeat to the Delhi Capitals, but would be high on confidence after beating Sunrisers Hyderabad. PBKS, on the other hand, beat the Gujarat Titans by 11 runs to start their campaign and are in good stead. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/up-man-wife-married-lover-brings-her-back-sant-kabir-nagar-regrets-mistake-2702380-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "UP man who got wife married to lover, regrets it, brings her back just days laterA man in Uttar Pradesh's Sant Kabir Nagar recently arranged his wife's marriage to her lover. But just a few days later, he went to her new husband's house, asking her to return as he was struggling to take care of their two children."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-up-prayagraj-demolition-hearing-viral-video-girl-running-with-books-ambedkar-nagar-2702398-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Top court refers to video of girl running with books during UP demolition hearingThe Supreme Court took note of a viral video of a girl holding on to her books and running as a bulldozer razes shanties in the background during a demolition hearing on Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/travel/story/skip-hotels-indians-are-now-swapping-homes-for-travel-2702264-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Skip hotels, Indians are now swapping homes for travelTrue to its name, HomeExchange allows you to exchange your home or living space with someone else."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/university-of-bath-school-of-management-a-pathway-to-global-career-success-2702196-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "University of Bath School of Management: A Pathway to Global Career SuccessBath's School of Management blends top academics, hands-on learning, and career support to help students secure jobs at leading global companies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/will-bjp-tieup-with-aiadmk-make-tamil-nadu-k-annamalai-the-biggest-loser-eps-amit-shah-dmk-2702171-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Will Annamalai be the biggest loser if BJP, AIADMK tie up?The BJP and the AIADMK are reported to be in talks for an alliance ahead of the Assembly elections in Tamil Nadu in 2026. Annamalai has defined the Tamil Nadu BJP's image and narrative in recent years, and a deal might reduce his role. Will he emerge as the biggest loser or is there more to the story?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/after-deepseek-r1-china-to-stun-world-with-nuclear-game-chang-er-xinghuo-fusion-fission-reactor-2702175-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "After DeepSeek R1, China might stun world with a nuclear game-chang​erChina recently shook the AI space with its DeepSeek R1. China's next surprise could be in the field of energy as it works to operationalise a fusion-fission reactor, the world's first, in the next five years. This is why its Xinghuo reactor could be a game-changer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/diu/story/ghibli-ai-art-trend-south-asia-search-boom-2702432-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Is everyone obsessed with Ghibli-fying their photos, or is it just South Asians?The internet is awash with AI-generated Ghibli-style art, sparking debates on creativity, copyright, and AI's environmental impact. OpenAI's image tool has captivated users worldwide, with South Asia leading the charge in search trends."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/russia-warns-of-catastrophic-consequences-if-us-strikes-iran-glbs-2702415-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Russia warns of 'catastrophic' consequences if US strikes IranRussia has warned the US that any military attack on Iran's nuclear sites would have \"catastrophic\" effects. Deputy Foreign Minister Sergei Ryabkov called for peaceful negotiations. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/saline-water-in-maharashtra-akola-leaves-villagers-battling-kidney-failure-2702399-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Saline water in Maharashtra's Akola leaves villagers battling kidney failureIndia Today ground report uncovered how the alarming rise in kidney failure cases due to saline water consumption has left villagers in Maharashtra desperate for a permanent solution. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/ciaz-discontinued-maruti-confirms-2702315-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ciaz discontinued, Maruti confirmsThe Maruti Suzuki Ciaz rivalled the likes of the Honda City, Volkswagen Virtus, Skoda Slavia and Hyundai Verna."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/us-student-with-145-iq-rejected-by-ivy-league-colleges-father-stunned-2702429-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US student with 145+ IQ rejected by Ivy League colleges, father stunnedA US man expressed his shock on a Reddit post after his son, a valedictorian with an IQ above 145, was rejected from Ivy League universities despite top scores and achievements."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/kunal-kamra-bail-madras-high-court-2702366-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kunal Kamra appears before Madras High Court, alleges cops trying to arrest himComedian Kunal Kamra approached the Madras High Court, seeking transit anticipatory bail over his 'traitor' job at Maharashtra Deputy Chief Minister Eknath Shinde. He was directed to appear in another court, which granted him bail."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bangladesh-muhammad-yunus-northeast-states-china-extension-himanta-sarma-pradyot-manikya-congress-2702166-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Might as well break up Bangladesh: Northeast leaders bash Yunus pitch to ChinaIn response, Assam Chief Minister Himanta Biswa Sarma labelled Muhammad Yunus's statement as \"offensive and strongly condemnable\", while Tipra Motha chief Pradyot Manikya called on the Centre to adopt a more aggressive stance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/waqf-bill-row-kiren-rijiju-centre-bjp-opposition-walkout-tabling-parliament-lok-sabha-rajya-sabha-controversy-exclusive-2702206-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Opposition walkout excuse to avoid debate: Kiren Rijiju on Waqf bill showdownWaqf bill row: A teaser of the probable showdown over the Waqf bill was seen on Tuesday after the opposition walked out of the business advisory committee (BAC) meeting chaired by the Speaker."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/health/story/the-liver-doc-dr-cyriac-abby-philips-calls-biohacker-bryan-johnson-a-fraud-he-hits-back-2702108-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Liver Doc calls biohacker Bryan Johnson a fraud. He hits backDr. Cyriac Abby Philips, known as The Liver Doc on X, has accused Bryan Johnson of scamming people with his longevity program called Blueprint."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-falling-today-sensex-nifty-decline-us-donald-trump-reciprocal-tariff-impact-2702063-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sensex crashes 1,400 points. What's behind the stock market bloodbath?Stock market crash: The Sensex and Nifty fell sharply as investors on Dalal Street are worried about the impact of US reciprocal tariffs, which will take effect on April 2. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/ranveer-allahbadia-india-got-latent-probe-row-supreme-court-rejects-petition-passport-release-ashish-chanchlani-2702274-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Will maintain decency on show, Ranveer Allahbadia assures Supreme CourtRanveer Allahbadia found himself at the centre of a huge controversy last month after his joke linked to parents sparked severe backlash and led to filing of multiple police cases. Allahbadia has now assured the Supreme Court that he would maintain decency in his shows."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/road-to-recovery-how-sunita-williams-and-butch-wilmore-are-regaining-strength-2702292-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How Sunita Williams and Butch Wilmore are regaining lost strengthSunita Williams, along with fellow astronaut Barry \"Butch\" Wilmore, returned to Earth on March 18, 2025, after an unexpectedly prolonged stay in space. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-live-score-lsg-vs-pbks-today-match-updates-lucknow-2702406-2025-04-01",
      "headline": "LSG vs PBKS live score: Punjab, Lucknow look to carry winning momentumIPL 2025, Lucknow Super Giants (LSG) vs Punjab Kings (PBKS) Live Score: LSG began their journey with a one-wicket defeat to the Delhi Capitals, but would be high on confidence after beating Sunrisers Hyderabad. PBKS, on the other hand, beat the Gujarat Titans by 11 runs to start their campaign and are in good stead. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-contract-list-updates-shreyas-iyer-ishan-kishan-rohit-sharma-virat-kohli-2702400-2025-04-01",
      "headline": "BCCI contracts: Shreyas Iyer set to return, Ishan Kishan likely to wait longerPunjab Kings captain Shreyas Iyer is set to regain his annual retainership contract after having lost it last year. Wicketkeeper-batter Ishan Kishan might have to wait longer to regain his contract despite having played a full season of domestic cricket. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rovman-powell-captaincy-sacking-dwayne-bravo-west-indies-cricket-board-2702361-2025-04-01",
      "headline": "Justice for Rovman Powell: Dwayne Bravo blasts West Indies board over captaincy changeDwayne Bravo slammed the West Indies cricket board for sacking Rovman Powell as the captain of the T20I side despite his impressive record as skipper. Powell was replaced by Shai Hope as the new T20I captain. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-gabe-vincent-and-dorian-finney-smith-make-history-for-lakers-against-rockets-glbs-2702322-2025-04-01",
      "headline": "NBA: Gabe Vincent and Dorian Finney-Smith make history for Lakers against RocketsThe Los Angeles Lakers defeated the Houston Rockets in a thriller, 104-98, on Monday, March 31, at Crypto.Com Arena. Bench duo Gabe Vincent and Dorian Finney-Smith had a top-flight shooting performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kris-srikkanths-advice-to-csk-r-ashwin-shivam-dube-2702300-2025-04-01",
      "headline": "Stop bowling R Ashwin in powerplay: Kris Srikkanth's advice to CSKFormer India cricketer Kris Srikkanth has advised Chennai Super Kings (CSK) not to bowl Ravichandran Ashwin in the powerplay after their back-to-back losses in the Indian Premier League 2025 (IPL 2025)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-united-bruno-fernandes-ruben-amorim-2702290-2025-04-01",
      "headline": "Bruno Fernandes not going anywhere: Manchester United boss Amorim squashes rumoursManchester United boss Ruben Amorim has squashed Bruno Fernandes' exit rumours, saying that the Portuguese midfielder isn't going anywhere. Fernandes has been the star man for United this season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-hardik-pandya-maggi-story-aniket-verma-srh-2702238-2025-04-01",
      "headline": "How Hardik Pandya's 'maggi story' inspired Aniket Verma: SRH star's uncle revealsAniket Verma's uncle revealed how the SRH star was inspired by Hardik Pandya's famous maggi story, as the 23-year-old has made a sensational start to life in the IPL. Aniket has been a star with the bat for SRH. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-hardik-pandyas-message-to-ashwani-kumar-mi-vs-kkr-2702232-2025-04-01",
      "headline": "Hardik Pandya's message to MI's Ashwani Kumar: You're  a Punjabi, scare opponentsMumbai Indians' seamer Ashwani Kumar revealed his captain Hardik Pandya's motivating words ahead of his Indian Premier League (IPL) against Kolkata Knight Riders (KKR)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-pbks-arshdeep-singh-title-punjab-squad-2702210-2025-04-01",
      "headline": "Arshdeep Singh reveals PBKS' IPL 2025 goal: Win title, open-bus parade in ChandigarhArshdeep Singh said that the goal of the Punjab Kings squad is to win the title and have an open-bus parade in Chandigarh. After a massive overhaul, Punjab started their season with a win. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-to-play-2027-world-cup-rcb-star-hints-at-next-big-career-goal-2702181-2025-04-01",
      "headline": "Virat Kohli to play 2027 World Cup? RCB star hints at next big career goalStar India batter Virat Kohli recently shared his next big career goal after winning back-to-back ICC trophies and expressed his desire to win the next ODI World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sam-konstas-matt-kuhnemann-cricket-australia-contract-list-2702182-2025-04-01",
      "headline": "Sam Konstas, Matt Kuhnemann rewarded as Australia announce central contractsSam Konstas and Matt Kuhnemann were rewarded for their recent performances, as the duo were among the 23 players in the central contract list released by Cricket Australia on Tuesday, April 1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-hardik-pandya-maggi-story-aniket-verma-srh-2702238-2025-04-01",
      "headline": "How Hardik Pandya's 'maggi story' inspired Aniket Verma: SRH star's uncle revealsAniket Verma's uncle revealed how the SRH star was inspired by Hardik Pandya's famous maggi story, as the 23-year-old has made a sensational start to life in the IPL. Aniket has been a star with the bat for SRH. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-hardik-pandyas-message-to-ashwani-kumar-mi-vs-kkr-2702232-2025-04-01",
      "headline": "Hardik Pandya's message to MI's Ashwani Kumar: You're  a Punjabi, scare opponentsMumbai Indians' seamer Ashwani Kumar revealed his captain Hardik Pandya's motivating words ahead of his Indian Premier League (IPL) against Kolkata Knight Riders (KKR)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-pbks-arshdeep-singh-title-punjab-squad-2702210-2025-04-01",
      "headline": "Arshdeep Singh reveals PBKS' IPL 2025 goal: Win title, open-bus parade in ChandigarhArshdeep Singh said that the goal of the Punjab Kings squad is to win the title and have an open-bus parade in Chandigarh. After a massive overhaul, Punjab started their season with a win. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-to-play-2027-world-cup-rcb-star-hints-at-next-big-career-goal-2702181-2025-04-01",
      "headline": "Virat Kohli to play 2027 World Cup? RCB star hints at next big career goalStar India batter Virat Kohli recently shared his next big career goal after winning back-to-back ICC trophies and expressed his desire to win the next ODI World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sam-konstas-matt-kuhnemann-cricket-australia-contract-list-2702182-2025-04-01",
      "headline": "Sam Konstas, Matt Kuhnemann rewarded as Australia announce central contractsSam Konstas and Matt Kuhnemann were rewarded for their recent performances, as the duo were among the 23 players in the central contract list released by Cricket Australia on Tuesday, April 1. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}