{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-447-points-higher-nifty-above-25900-ril-tata-motors-pv-up-2838547-2025-12-19",
      "headline": "Sensex ends 447 points higher, Nifty above 25,900; RIL up 1%The S&P BSE Sensex added 447.55 points to close at 84,929.36, while the NSE Nifty50 rose 150.85 points to end at 25,966.40. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/got-an-sms-or-email-from-the-income-tax-department-heres-what-it-means-2838515-2025-12-19",
      "headline": "Got an SMS or email from the Income Tax Department? Here's what it meansGot an unexpected SMS or email from the Income Tax Department about your transactions and unsure what to do next? The department has clarified the purpose behind these alerts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-group-to-bid-for-11-airports-amid-indias-air-travel-boom-report-2838460-2025-12-19",
      "headline": "Adani Group to bid for 11 airports amid India's air travel boom: ReportThe Indian government has been leasing out government-owned airports on long-term contracts to private companies. At the same time, it is encouraging the construction of new airports to improve connectivity across the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/8th-pay-commission-update-how-big-could-be-the-salary-hike-and-what-to-expect-2838427-2025-12-19",
      "headline": "8th Pay Commission update: How big could be the salary hike and what to expectWith the 7th Pay Commission ending in December 2025, what kind of salary hike can central government employees realistically expect under the 8th Pay Commission, and when will the money actually come? Let's have a look."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/icici-prudential-amc-share-price-long-short-term-investors-should-do-strategy-hold-sell-2838396-2025-12-19",
      "headline": "ICICI Prudential AMC makes strong debut: What long, short-term investors should doICICI Prudential AMC share price: The listing was slightly below grey market expectations. Ahead of the debut, the IPO was commanding a grey market premium of Rs 520–530, which had indicated possible listing gains of around 24%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/icici-prudential-amc-share-price-strong-debut-20-percent-premium-bse-nse-review-hold-or-sell-2838370-2025-12-19",
      "headline": "ICICI Prudential AMC shares list at 20% premium: Hold or sell?Shares of ICICI Prudential AMC debuted at Rs 2,606.20 on the BSE, marking a premium of 20.38% over the IPO issue price of Rs 2,165. On the NSE, the stock opened at around Rs 2,600, up 20.09%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/why-stock-market-rising-today-sensex-nifty-jump-bse-nse-us-inflation-soft-asia-market-wall-street-jump-2838350-2025-12-19",
      "headline": "Sensex jumps 500 points: 3 reasons why stock market is rising today?At around 9:45 am, the S&P BSE Sensex jumped 525.11 points to 85,006.92, while the NSE Nifty50 climbed 147.50 points to 25,963.30."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/ola-electric-share-price-fall-sell-or-hold-promoter-bhavish-aggarwal-sells-shares-3rd-stake-sale-2838325-2025-12-19",
      "headline": "Ola Electric shares fall over 60% this year: What should investors do?The stock has now fallen nearly 63% in calendar year 2025, making it one of the worst-performing newly listed technology stocks this year. Ola Electric shares hit a fresh 52-week low of Rs 31.54 on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/japan-central-bank-hikes-interest-rates-to-075-per-cent-highest-level-since-1995-2838315-2025-12-19",
      "headline": "Japan's central bank raises rates to 0.75%, highest in 30 yearsThe Bank of Japan raised its short-term policy rate to 0.75% from 0.5%, its first rate hike since January. In a statement, the Bank of Japan said that even after the hike, financial conditions would remain supportive for the economy"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/metal-sector-job-creation-aluminium-key-states-income-growth-jobs-story-india-mineral-rich-states-2838312-2025-12-19",
      "headline": "How aluminium is changing the job story in India's mineral-rich statesIndustry estimates cited by the Aluminium Association of India show that the sector has already generated over eight lakh jobs and supports 4,000 SMEs in its downstream ecosystem."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-jumps-300-points-higher-nifty-above-25900-infosys-up-1-percent-2838311-2025-12-19",
      "headline": "Sensex opens 300 points higher, Nifty above 25,900; Infosys up 1%The S&P BSE Sensex jumped 525.11 points to 85,006.92, while the NSE Nifty50 rose 147.50 points to 25,963.30 as of 9:45 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/icici-prudential-amc-ipo-listing-today-expected-share-price-gmp-today-grey-market-premium-2838291-2025-12-19",
      "headline": "ICICI Prudential AMC IPO listing today: Is GMP pointing to gains for investors?The ICICI Prudential AMC IPO saw very strong demand during its three-day bidding period. The issue was subscribed 39.17 times overall."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/your-sip-stayed-at-rs-5000-over-the-years-how-not-increasing-it-10-percent-cost-you-lakhs-2838114-2025-12-19",
      "headline": "Your SIP stayed at Rs 5,000 over the years. How not increasing it 10% cost you lakhsYour salary rose, expenses changed, but your SIP remained at Rs 5,000. Over time, this small choice can quietly cost you several lakhs in missed wealth. Let's understand how."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-some-ipo-stocks-keep-running-for-days-after-listing-explains-zerodhas-nithin-kamath-2838054-2025-12-18",
      "headline": "Why some IPO stocks keep running for days after listing, explains Nithin KamathIPO stocks continuing to rise after listing may seem puzzling.  Nithin Kamath breaks down a technical reason that is often overlooked by retail investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indigo-chaos-competition-commission-of-india-reviews-antitrust-violations-airline-crisis-2838022-2025-12-18",
      "headline": "IndiGo chaos: Competition regulator reviews 'antitrust violations' by airlineIndiGo cancelled about 4,500 flights earlier this month due to poor pilot roster planning, stranding tens of thousands of passengers, triggering a major aviation crisis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-close-lower-as-global-cues-remain-weak-it-stocks-limit-losses-2837954-2025-12-18",
      "headline": "Sensex, Nifty close lower as global cues remain weak, IT stocks limit lossesThe S&P BSE Sensex lost 77.84 points to close at 84,481.81, while the NSE Nifty50 was down by 3 points to end at 25,815.55. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-electronics-gets-rs-1500-crore-boost-as-apple-manufacturing-expands-in-india-2837871-2025-12-18",
      "headline": "Tata Electronics gets Rs 1,500 crore boost as Apple manufacturing expands in IndiaThe fresh funding underlines Tata Group's continued support for expanding capacity at Tata Electronics, which has emerged as one of Apple's largest iPhone manufacturing partners in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-is-the-demand-to-raise-the-minimum-eps-pension-to-rs-7500-still-stuck-at-rs-1000-2837808-2025-12-18",
      "headline": "Why hasn't the minimum EPS pension been raised from Rs 1,000 to Rs 7,500?The government has reiterated financial and actuarial constraints in response to renewed calls for an increase in the minimum EPS-95 pension, but no timeline or policy decision has been announced."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/amazon-to-lay-off-370-staff-in-luxembourg-whats-driving-the-job-cuts-2837784-2025-12-18",
      "headline": "Amazon to lay off 370 staff in Luxembourg. What's driving the job cuts?Amazon employs about 4,370 people in Luxembourg, and the planned cuts will affect nearly 8.5% of its workforce there. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/worst-behind-us-indigo-ceo-tells-staff-blames-compounding-effect-of-several-factors-for-cancellations-2837780-2025-12-18",
      "headline": "Worst behind us, IndiGo CEO tells staff after days of flight cancellations chaosAfter days of cancellation chaos, IndiGo said it has stabilised operations and restored its network to about 2,200 flights a day. Meanwhile, CEO Pieter Elbers has blamed the disruption on a compounding effect of several factors. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ikkis-final-trailer-dharmendra-fiery-dialogue-agastya-nanda-sriram-raghavan-arun-khetarpal-2838537-2025-12-19",
      "headline": "Ikkis releases final trailer, Dharmendra's fiery dialogue is the highlight The final trailer for the upcoming biographical film 'Ikkis', starring Agastya Nanda and directed by Sriram Raghavan, has been released. 'Ikkis' tells the story of Second Lieutenant Arun Khetarpal, India's youngest Param Vir Chakra recipient."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kerala-actor-speaks-out-after-convict-video-reveals-identity-triggers-online-abuse-2838564-2025-12-19",
      "headline": "Kerala actor assault: Survivor speaks out after convict's video reveals identity The survivor of the 2017 Kerala actor assault case has responded to a video shared by the second convict, Martin Antony, which revealed her identity and included derogatory remarks. She called out those sharing the content, appealing to everyone to let her live."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/still-grieving-esha-deol-seeks-kindness-in-moving-post-after-dharmendras-death-2838558-2025-12-19",
      "headline": "Still grieving: Esha Deol seeks kindness in moving post after Dharmendra's death Esha Deol expressed her ongoing grief over the loss of her father, actor Dharmendra, and announced she will be returning to work after a break. She shared an emotional post in her Instagram stories."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/nivin-pauly-pharma-ott-thriller-pharma-series-review-2838522-2025-12-19",
      "headline": "Pharma review: Nivin Pauly cures his recent slump with this OTT thrillerRelease Date:Fri Dec 19, 2025 Director PR Arun's web series Pharma, starring Nivin Pauly and Rajit Kapur, is a battle between a common man and a corporate giant. Set in the pharmaceutical world, the show is gripping despite minor shortcomings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-mania-peaks-as-fans-sing-to-muted-song-in-theatre-screening-padayappa-2838507-2025-12-19",
      "headline": "Rajinikanth mania peaks as fans sing to muted song in theatre screening Padayappa Rajinikanth's Padayappa re-release sparks theatre celebrations as fans sing even when songs are muted. The 1999 classic has become the fifth-biggest re-release in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mallika-sherawat-attends-white-house-christmas-dinner-trump-2838469-2025-12-19",
      "headline": "Mallika Sherawat posts pics from White House Christmas dinner, fans curious Bollywood actor Mallika Sherawat posted photos from the White House Christmas dinner, hosted by President Donald Trump. Sherawat described her experience as \"completely surreal\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/khuda-haafiz-actor-shivaleeka-oberoi-expecting-first-child-with-abhishek-pathak-2838484-2025-12-19",
      "headline": "Khuda Haafiz actor Shivaleeka Oberoi expecting first child with Abhishek Pathak Actor Shivaleeka Oberoi and director Abhishek Pathak are expecting their first child. The couple, who married in February 2023, shared the announcement on Instagram, describing it as a 'tiny blessing' for their family."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhurandhar-made-me-look-less-dabangg-pak-politician-who-inspired-rakesh-bedis-role-2838490-2025-12-19",
      "headline": "Dhurandhar made me look less dabangg: Pak politician who inspired Rakesh Bedi's role A viral video shows Pakistani politician Nabil Gabol reacting to Dhurandhar, claiming Rakesh Bedi's character didn't do justice to his real-life personality. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-great-shamsuddin-familys-kritika-kamra-success-alters-how-industry-sees-you-2838488-2025-12-19",
      "headline": "The Great Shamsuddin Family's Kritika Kamra: Success alters how industry sees you The Great Shamsuddin Family star Kritika Kamra talks about how success changes an actor's standing in showbiz, in an exclusive conversation with India Today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/raat-akeli-hai-the-bansal-murders-review-nawazuddin-siddiqui-crime-thriller-2838431-2025-12-19",
      "headline": "Raat Akeli Hai The Bansal Murders review: A moody whodunnit that rarely surprisesRelease Date:Fri Dec 19, 2025 Raat Akeli Hai The Bansal Murders review: The Netflix film, starring Nawazuddin Siddiqui in the lead, explores a brutal crime in a wealthy family. It's strong performances contrast with its predictable climax and familiar twists."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/akshay-kumar-to-host-wheel-of-fortune-india-confident-itll-be-immensely-enjoyed-2838461-2025-12-19",
      "headline": "Akshay Kumar to host Wheel of Fortune India: Confident it'll be immensely enjoyed Akshay Kumar will host the Indian edition of the internationally acclaimed game show 'Wheel of Fortune'. On Friday, the show was announced by Sony Television on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/happy-patel-trailer-release-aamir-khan-productions-quirky-spy-comedy-vir-das-2838438-2025-12-19",
      "headline": "Happy Patel Khatarnak Jasoos trailer: Release details of Aamir-Imran-Vir Das comedy The trailer for Happy Patel: Khatarnak Jasoos, directed by and featuring Vir Das with Mona Singh, has been released. The announcement, marked by its playful style, has generated significant anticipation, with the film set to release in January 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dhurandhar-deserves-to-be-indias-biggest-film-at-the-moment-adivi-sesh-2838414-2025-12-19",
      "headline": "Dhurandhar deserves to be India's biggest film at the moment, says Adivi Sesh Telugu actor Adivi Sesh has said Aditya Dhar's 'Dhurandhar' deserves to be India's biggest film at the moment. He praised the film for its nuanced portrayal of the 26/11 Mumbai attacks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-end-of-an-era-docuseries-finale-early-release-disney-plus-2838398-2025-12-19",
      "headline": "Taylor Swift's early Christmas gift to fans: New episodes of The End of an Era Disney+ has announced the early release of the final two episodes of Taylor Swift's docuseries End of an Era, moving the premiere date from December 26 to December 23 and offering fans a closer look behind the scenes of her record-breaking Eras Tour."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/stranger-things-5-did-the-duffers-hint-at-steve-harringtons-death-in-vol-2-maybe-2838411-2025-12-19",
      "headline": "Stranger Things 5: Did the Duffers hint at Steve Harrington's death in Vol 2? Maybe Stranger Things Season 5 Volume 2 is stirring intense emotions among fans, with the Duffer Brothers cleverly fuelling speculation through cryptic hints and a dramatic trailer. As the finale approaches, the fate of beloved character Steve Harrington hangs in the balance, leaving viewers anxious and deeply invested."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shilpa-shetty-denies-fraud-claims-says-rs-20-crore-her-family-loaned-is-unpaid-2838409-2025-12-19",
      "headline": "Criminal liability after 9 years is unsustainable: Shilpa Shetty on fraud case Shilpa Shetty denied fraud allegations in a Rs 60 crore cheating case, saying her role was non-executive. She also revealed that a Rs 20 crore family loan remains unpaid and confirmed legal action in the Bombay High Court."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/niddhi-agerwal-shares-her-first-post-after-hyderabad-mall-mobbing-incident-2838389-2025-12-19",
      "headline": "Niddhi Agerwal shares her first post after Hyderabad mall mobbing incident Actor Niddhi Agerwal has shared her first social media video after a mobbing incident at a Hyderabad mall during promotions for her upcoming film 'The Raja Saab'. Check out the video she shared on social media here. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/bharti-singh-delivers-baby-boy-water-breaks-laughter-chefs-shoot-2838394-2025-12-19",
      "headline": "It's a boy! Bharti Singh gives birth after sudden medical emergency Comedian Bharti Singh gave birth to a baby boy on Friday, December 19. The comedian was scheduled to shoot for Laugther Chefs today. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rgvs-defining-verdict-review-on-dhurandhar-and-aditya-dhar-quantum-leap-game-changer-2838391-2025-12-19",
      "headline": "Quantum leap, game changer: RGV's defining verdict on Dhurandhar and Aditya Dhar Ram Gopal Varma called Dhurandhar a quantum leap for Indian cinema, praising Aditya Dhar as a game changer. He highlighted Ranveer Singh, Akshaye Khanna and the film's bold craft in a long review of the film. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/no-place-for-violence-in-new-bangladesh-yunus-govt-condemns-hindu-mans-lynching-calls-for-calm-amid-chaos-2838478-2025-12-19",
      "headline": "No place for violence in New Bangladesh: Yunus govt condemns Hindu man's lynchingA Hindu garment worker, Dipu Chandra Das, was beaten to death after being accused of blasphemy amid violent protests following the death of student leader Sharif Osman Hadi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-news-h1b-visa-fraud-news-indian-origin-diplomat-mahvash-siddiqui-chennai-consulate-indians-using-bribery-programme-2837878-2025-12-19",
      "headline": "Indians using rishwat to game H-1B programme, says US diplomat who served in IndiaIndian-origin US diplomat Mahvash Siddiqui, writing for an anti-immigration think tank, alleged that the H-1B visa programme has turned into a de facto immigration shortcut dominated by India. She claimed that unqualified Indian applicants use fraud and bribery to enter the US, even as she urged the US to pause the visa programme pending a full audit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/toxic-house-toxic-irony-pollution-debate-dies-in-non-congenial-air-2838560-2025-12-19",
      "headline": "Toxic house, toxic irony: Pollution debate dies in 'non-congenial' airParliament ended its Winter Session on December 18, 2025, without debating Delhi's toxic smog because the House environment was \"non-congenial.\" Irony choked on the cruel joke."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-violence-protest-sharif-osman-hadi-shooting-faisal-karim-girlfriend-warning-election-yunus-hindu-killed-2838445-2025-12-19",
      "headline": "Will rock entire Bangladesh: What Osman Hadi's shooter boasted to his girlfriendHours before the fatal attack on anti-India leader Sharif Osman Hadi, the alleged shooter, Faisal Karim, told his girlfriend that \"something was coming that would shake the entire country\". The warning proved eerily true as Bangladesh is now reeling from violence ahead of crucial February 2026 elections."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/bondi-beach-attack-australia-terror-attack-connection-to-philippines-moro-insurgency-islamic-extremism-al-qaida-2837353-2025-12-19",
      "headline": "Why a Christian-majority Philippines attracted IS-motivated Bondi shootersThe Bondi Beach shooters visited the Philippines to get military-style training from Islamic terrorists, suspect Australian investigators. But how did Islamic terror hubs emerge in the Philippines, a Christian-majority country? From the Muslim-Moro rebellion to the rise of the Abu Sayyaf Group, it is a long history. And the US is partly to blame."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bangladesh-violence-india-bay-of-bengal-fishermen-attack-vessels-seized-2838437-2025-12-19",
      "headline": "How Bangladesh is secretly trying to provoke India in Bay of BengalRecently, a Bangladesh navy vessel hit an Indian fishing trawler. A fisherman was killed by a spear-like object. Moreover, an increasing number of Bangladeshi fishing vessels are crossing into Indian waters in the Bay of Bengal.  Is Bangladesh trying to provoke India ahead of elections?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-narendra-modi-wearing-earring-oman-visit-viral-video-speculation-2838334-2025-12-19",
      "headline": "PM Modi's ear accessory seen during Oman visit sparks buzz. What is it?As PM Modi arrived in Oman, what sparked curiosity on social media was a small, blingy sort of earring on his right ear. It opened a flood of speculations - was it PM Modi's new style?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-pollution-discussion-lok-sabha-rajya-sabha-parliament-goes-for-toss-adjourned-indefinitely-sine-die-air-quality-2838395-2025-12-19",
      "headline": "'Environment not conducive': Winter Session ends without Delhi air crisis discussionA key discussion on the worsening air quality in the Delhi-NCR has gone for a toss as the Winter Session of Parliament was adjourned indefinitely soon after resumption on the final day on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rgvs-defining-verdict-review-on-dhurandhar-and-aditya-dhar-quantum-leap-game-changer-2838391-2025-12-19",
      "headline": "Quantum leap, game changer: RGV's defining verdict on Dhurandhar and Aditya DharRam Gopal Varma called Dhurandhar a quantum leap for Indian cinema, praising Aditya Dhar as a game changer. He highlighted Ranveer Singh, Akshaye Khanna and the film's bold craft in a long review of the film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/bjp-high-command-pm-modi-amit-shah-working-president-nitin-nabin-2837882-2025-12-19",
      "headline": "The new 'high command' = BJP's jodi number oneTraditionally, the word, high command, is associated with the Congress and the Nehru-Gandhi family. But in a twist in the tale, the contemporary high command has shifted location from Congress to the BJP."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/united-arab-emirates-dubai-abu-dhabi-floods-qatar-climate-change-middle-east-adaptation-impacts-2838496-2025-12-19",
      "headline": "UAE swept by floods: Why is it raining so heavily in the desert nation?As authorities remain on alert, residents are being urged to stay cautious as unstable weather continues in the region."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-protests-osman-hadi-death-latest-updates-updates-glbs-2838242-2025-12-19",
      "headline": "Live: Security tightened outside Bangladeshi Embassy in New DelhiBangladesh Protests Live Updates: Protests erupted across Bangladesh after the death of radical leader Sharif Osman Hadi, with thousands converging at Shahbag and accusing authorities of failing to protect him. Demonstrators chanted slogans and waved placards, many of them openly showing anti-India and anti–Sheikh Hasina sentiments. The unrest escalated into violence, with protesters vandalising the offices of Daily Prothom Alo and Daily Star. The Awami League's office in Rajshahi was also reportedly torched. Protests spread beyond the capital, with stone-pelting reported at the Indian Assistant High Commission in Chattogram. Follow indiatoday.in for live updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/lightning-strikes-burj-khalifa-dubai-crown-prince-captures-rare-moment-in-viral-video-2838501-2025-12-19",
      "headline": "Lightning strikes Burj Khalifa. Dubai Crown Prince captures dramatic momentA literally striking video posted by Dubai's Crown Prince shows lightning hitting the Burj Khalifa amid severe storms. The video is viral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-boy-assaulted-neighbour-grandmothers-house-accused-arrested-thyagarajanagar-police-cctv-video-2838408-2025-12-19",
      "headline": "Video: Playing near home, boy, 5, kicked 'like a football' by man in BengaluruA five-year-old boy was injured after a passerby kicked him while he was playing near his grandmother's house in Bengaluru's Thyagarajanagar. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/delhi-government-air-purifiers-installation-schools-protect-children-pollution-2838448-2025-12-19",
      "headline": "Delhi to install air purifiers in 10,000 government school classroomsDelhi government begins phased installation of air purifiers in 10,000 government school classrooms. The move aims to shield children from worsening air pollution while broader cleanup efforts continue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/study-abroad/story/kt-rama-rao-interview-us-h-1b-visa-fees-hike-impact-on-india-tech-industry-2838536-2025-12-19",
      "headline": "KTR on why rising US H-1B visa fees could reshape India's talent storyAs US H-1B visa fees rise sharply, former Telangana minister KT Rama Rao weighs in on the impact on Indian professionals, families, talent pipelines and overseas careers in an exclusive interview with India Today Digital. He explains why higher costs could disrupt mobility, reshape talent flows and push India to strengthen innovation and job creation at home."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/gujarat-teachers-static-electricity-experiment-goes-viral-internet-loves-it-2838443-2025-12-19",
      "headline": "Gujarat teacher's static electricity experiment goes viral. Internet loves itA science demonstration by Mayur Vaishnav at Sandipani English School in Gujarat's Halvad town captured students' excitement and has since gone viral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/turning-point-usa-endorse-vp-jd-vance-2028-presidential-bid-2838519-2025-12-19",
      "headline": "Erika Kirk endorses Vance for next US President: Get my husband's friend electedTurning Point USA CEO Erika Kirk has endorsed Vice President JD Vance for president at the group's AmericaFest, marking the first major institutional backing for a likely 2028 contender and signalling an unusually early start to the Republican primary race."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kerala-actor-speaks-out-after-convict-video-reveals-identity-triggers-online-abuse-2838564-2025-12-19",
      "headline": "Kerala actor assault: Survivor speaks out after convict's video reveals identityThe survivor of the 2017 Kerala actor assault case has responded to a video shared by the second convict, Martin Antony, which revealed her identity and included derogatory remarks. She called out those sharing the content, appealing to everyone to let her live."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/mob-lynches-hindu-man-over-blasphemy-allegations-in-bangladesh-amid-massive-protests-2838363-2025-12-19",
      "headline": "Hindu man thrashed, set ablaze over blasphemy claims as protests sweep Bangladesh Live UpdatesDipu Chandra Das, a Hindu worker in Bangladesh, was killed by an angry mob who accused him of making derogatory remarks against Prophet Muhammad. The incident came amid ongoing unrest across the country over Osman Hadi's death. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/saudi-arabias-viral-snowfall-videos-leave-internet-wondering-if-its-ai-2838379-2025-12-19",
      "headline": "Saudi Arabia's viral snowfall videos leave internet wondering if it's AIUnusual heavy snowfall in the Trojena Highlands and Tabuk region in Saudi Arabia has left the internet baffled and double-checking for AI content."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-news-indians-in-the-us-news-cab-driver-rapes-woman-after-she-falls-asleep-in-california-thousand-oaks-bar-2838516-2025-12-19",
      "headline": "Woman passes out in cab after California bar trip, Indian-origin driver rapes herA 35-year-old Indian-origin cab driver has been accused of raping an intoxicated woman passenger who blacked out during the ride back from a bar in California, US. Simranjit Singh Sekhoon has been arrested and police are probing if there are other survivors."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/foreigners-step-in-to-enforce-traffic-rules-in-pune-rakshak-chowk-video-goes-viral-2838462-2025-12-19",
      "headline": "Foreign visitors take charge of traffic chaos at Pune's Rakshak ChowkA viral video capturing foreign nationals urging two-wheeler riders to respect pedestrian pathways in Pune has sparked concern. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/donald-trump-administration-suspends-green-card-lottery-diversity-visa-program-national-security-2838464-2025-12-19",
      "headline": "Trump suspends green card lottery program after Brown University, MIT shootingsThe Donald Trump administration has ordered the immediate suspension of the Green Card Lottery Program, citing national security concerns following recent high-profile incidents involving immigrants."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dasun-shanaka-named-sri-lanka-t20-world-cup-captain-replacing-charith-asalanka-2838563-2025-12-19",
      "headline": "Dasun Shanaka replaces Charith Asalanka as Sri Lanka's captain for T20 World Cup Dasun Shanaka has been appointed captain of Sri Lanka's preliminary 25-member squad for the T20 World Cup, with Charith Asalanka stepping aside after selectors prioritised experience over recent form."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yashasvi-jaiswal-recovering-acute-gastroenteritis-smat-2025-mumbai-rajasthan-2838555-2025-12-19",
      "headline": "Yashasvi Jaiswal shares positive medical update from hospital after health scare India opener Yashasvi Jaiswal said he is recovering well after being hospitalised with severe stomach cramps following Mumbai's SMAT 2025 clash against Rajasthan on December 16 at the MCA Stadium in Pune."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/indian-super-league-consortium-proposal-delay-aiff-general-meeting-2838545-2025-12-19",
      "headline": "ISL clubs told to submit consortium proposals as AIFF fails to get league underway ISL clubs have been asked to step in as Indian football remains stuck in limbo. With no season start date in sight, a proposed consortium may decide the league's immediate future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-2025-26-valtteri-bottas-joins-adelaide-crowd-travis-heads-masterclass-2838506-2025-12-19",
      "headline": "Valtteri Bottas joins Adelaide crowd for Travis Head's Ashes masterclass Travis Head lit up Adelaide with a dramatic century after a dropped chance on 99, while Valtteri Bottas soaked in the Ashes atmosphere as Australia tightened their grip on the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/anahat-singh-squash-titles-world-cup-joshna-chinappa-interview-2838494-2025-12-19",
      "headline": "Sensational Anahat Singh basks in World Cup glory, reflects on Joshna Chinappa rivalry Anahat Singh was part of a brilliant Indian team that clinched the country's maiden gold medal at the Squash World Cup, though the absence of Egypt's full-strength squad raised questions in some quarters about the credibility of the title triumph."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/manchester-united-players-leave-play-better-scott-mctominay-slams-excuse-2838500-2025-12-19",
      "headline": "Manchester United not the problem: Scott McTominay shuts post-exit form claims Scott McTominay has dismissed claims that players improve simply by leaving Manchester United. The midfielder insists the Old Trafford spotlight, not the system, often distorts how performances are judged."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/varun-chakravarthy-mental-strength-consistency-india-t20-world-cup-preparations-2838489-2025-12-19",
      "headline": "Varun Chakravarthy welcomes pressure as he refines mindset for T20 World Cup prep India spinner Varun Chakravarthy highlights the importance of mental preparation, sticking to the basics, and maintaining consistency as he prepares for the upcoming T20 World Cup. Chakravarthy's approach is shaped by recent performances and his determination to test himself at the highest level."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-england-ashes-adelaide-test-day-3-match-report-travis-head-century-2838479-2025-12-19",
      "headline": "Ashes 2025: Travis Head turns Adelaide into England's Ashes nightmare Ashes 2025: Travis Head turned fleeting English hope into Adelaide despair yet again. His unbeaten century powered Australia into total control, leaving England staring at a third straight Ashes defeat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harmanpreet-kaur-best-captain-india-says-anjum-chopra-world-cup-2838465-2025-12-19",
      "headline": "Not Richa Ghosh, Harmanpreet Kaur still the best to lead India, reckons Anjum Chopra Anjum Chopra backed Harmanpreet Kaur to continue leading India across formats, citing her match-winning pedigree despite leadership succession talk, as she prepares to captain the team against Sri Lanka.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/travis-head-adelaide-love-story-ends-bazball-ashes-hopes-3rd-test-2838405-2025-12-19",
      "headline": "Travis Head's Adelaide love story rolls on, hometown hero sinks Bazball's Ashes hopes Travis Head produced another stirring century at his beloved Adelaide Oval, surviving a dropped catch on 99 and sealing a dominant Australian position that pushed England's Ashes hopes to the brink."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/devon-conway-unsold-ipl-2026-auction-smashes-226-new-zealand-vs-west-indies-test-2838375-2025-12-19",
      "headline": "Unsold at IPL auction, Devon Conway smashes 226 vs WI in Mount Maunganui After being unsold at the IPL 2026 auction, former Chennai Super Kings opener Devon Conway went on to smash his career-best Test score in the third Test against the West Indies at Mount Maunganui."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ishan-kishan-syed-mushtaq-ali-trophy-final-century-t20i-return-shubman-gill-under-pressure-fan-reaction-2838361-2025-12-19",
      "headline": "More pressure on Shubman Gill? Ishan Kishan smashes 49-ball 101 before selectorsIshan Kishan's SMAT final century has reignited the T20I opening debate. With the World Cup just 50 days away, pressure is mounting on Shubman Gill as fans demand change."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-pick-t20-world-cup-2026-squad-december-20-mumbai-2838355-2025-12-19",
      "headline": "India to pick T20 World Cup 2026 squad on December 20 in MumbaiIndia is set to pick and reveal their squads for the upcoming home T20I series against New Zealand and the T20 World Cup 2026 squad on December 20 in Mumbai at the BCCI Headquarters. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-sri-lanka-u19-asia-cup-semi-final-live-score-updates-vaibhav-suryavanshi-dubai-2838337-2025-12-19",
      "headline": "Semi-final Live: SL (104/6 in 16 ovs), India on top as Sri Lanka struggleIND vs SL, U19 Asia Cup semi-final Live Updates: Sri Lanka have lost wickets in quick succession as India are in control in the rain-shortened semi-final clash in Dubai. Chamika Heenatigala is the key for the Lankans for the remainder of the innings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-cricket-chief-scott-weenik-resigns-disagreement-nz20-2838316-2025-12-19",
      "headline": "New Zealand cricket chief resigns citing disagreement on T20 futureNew Zealand Cricket faces a leadership shift after Scott Weenink stepped down as chief executive. Deep divisions over T20 cricket and long-term priorities have triggered a reset at the top."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/cristiano-ronaldo-portugal-needs-bruno-fernandes-not-better-without-fifa-world-cup-2026-2838304-2025-12-19",
      "headline": "Portugal needs Cristiano Ronaldo: Bruno Fernandes ahead of FIFA World Cup 2026Bruno Fernandes has shut down claims that Portugal play better without Cristiano Ronaldo. The midfielder insists Ronaldo's presence still shapes games, even as tactical debates resurface before the 2026 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-predicted-xi-sanju-samson-return-shubman-gill-injury-bumrah-ahmedabad-2838285-2025-12-19",
      "headline": "Will Samson return to open in Ahmedabad in Gill's absence?IND vs SA: Sanju Samson's long wait could finally end in Ahmedabad after fog denied him a Lucknow return. With Shubman Gill injured and the series secured, India may finally unleash Samson at the top."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-5th-t20i-ahmedabad-weather-prediction-fog-chances-narendra-modi-stadium-2838274-2025-12-19",
      "headline": "Will India vs SA 5th T20I be played or abandoned? What Ahmedabad AQI tells usIndia vs South Africa: The 5th and the final T20I match of the IND vs SA series is going to be played in Ahmedabad. As biting cold descends in the country, will this match also be ruled out by fog?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-3rd-test-ben-stokes-mitchell-starc-frustration-video-adelaide-2838272-2025-12-19",
      "headline": "Watch: Ben Stokes jumps in frustration, berates himself after Starc ripperAshes 3rd Test: England captain Ben Stokes struck a crucial 83 to steer the visitors out of trouble after they slumped to 168 for 8 on Thursday. Stokes was left gutted after being dismissed on 83 by a brilliant delivery from Mitchell Starc on the morning of Day 3."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-5th-t20i-preview-ahmedabad-weather-predicted-playing-xi-team-news-2838206-2025-12-19",
      "headline": "The last dance of 2025: India chase a perfect finish in 5th T20IIND vs SA 5th T20I preview: India will hope to sign off a challenging home assignment against South Africa on a positive note when the two sides meet in the fifth and final T20 International on Friday. While India cannot lose the series, South Africa have the chance to draw level at 2–2, an outcome that Aiden Markram's side would view as a highly successful end to their tour of India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/josh-inglis-ipl-auction-drama-punjab-kings-lsg-explained-2838234-2025-12-19",
      "headline": "How did 'unavailable' Josh Inglis fetch 8.6 cr? PBKS fume after fresh twist to storyIPL franchise Punjab Kings have been left fuming after learning that Josh Inglis might be available to play in the Indian Premier League's 2026 season. PBKS had released the player at only Rs 2.6 core after being told that he was not going to play the IPL due to his wedding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/punjab-kings-owner-ness-wadia-reaction-josh-inglis-ipl-2026-availability-2838231-2025-12-18",
      "headline": "IPL 2026: Josh Inglis' unprofessional behaviour leaves PBKS owner frustratedPunjab Kings co-owner Ness Wadia criticised Josh Inglis for informing the franchise about his limited availability for IPL 2026 just 45 minutes before the retention deadline, saying the late notice disrupted team planning and raised questions over player professionalism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kapil-dev-modern-cricket-coach-role-gautam-gambhir-management-team-india-2838215-2025-12-18",
      "headline": "Gautam Gambhir is not a coach: Kapil Dev drops a bomb amid mounting pressureWorld Cup-winning India captain Kapil Dev said a modern-day cricket coach functions more as a manager than a traditional coach, defending Gautam Gambhir's role amid criticism and emphasising the importance of player management and confidence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/physical-disability-cricket-india-a-vs-senior-2838209-2025-12-18",
      "headline": "India A end historic Physical Disability T20 series with win over India SeniorIndia A defeated India Senior in the final match of the Physical Disability T20 series at Wankhede Stadium. The series highlighted growing support and inclusivity for differently abled cricketers in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smat-final-ishan-kishan-batting-video-2838205-2025-12-18",
      "headline": "Watch: Ishan Kishan's celebration goes viral after Jharkhand's historic SMAT winJharkhand won their first ever Syed Mushtaq Ali Trophy on Thursday, December 18. Ishan Kishan took the trophy in his hand and danced his way into the team huddle as the side celebrated a major milestone in Indian cricket history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/upca-ticket-refunds-india-vs-south-africa-4th-t20-abandoned-fog-lucknow-2838196-2025-12-18",
      "headline": "UPCA to refund tickets after India-South Africa T20 abandoned due to fogThe Uttar Pradesh Cricket Association (UPCA) on Thursday announced a full refund of ticket prices for spectators after the fourth T20 International between India and South Africa was abandoned due to dense fog."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-auction-why-not-held-in-india-2838176-2025-12-18",
      "headline": "Why are IPL auctions not being hosted in India? BCCI top boss reveals reasonThe Indian Premier League auction has been held overseas in back-to-back years. Why are IPL auctions being hosted outside India? Chairman Arun Dhumal explains the key reasons behind the decision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/satwik-chirag-unbeaten-win-bwf-world-tour-finals-2025-2838165-2025-12-18",
      "headline": "BWF World Tour Finals: Satwik and Chirag close in on semifinal berth in HangzhouSatwiksairaj Rankireddy and Chirag Shetty won their second consecutive match at the BWF World Tour Finals 2025. Their strong performance puts them in a commanding position for a semi-final berth, but a tough match against Malaysian second seeds awaits on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/syed-mushtaq-ali-trophy-ishan-kishan-jharkhand-vs-haryana-2838145-2025-12-18",
      "headline": "SMAT final: Jharkhand win historic title after Ishan Kishan's redemption songSMAT Final: Ishan Kishan's belligerent hundred delivered Jharkhand their first ever Syed Mushtaq Ali title on Thursday, December 18. Kishan completed his redemption run right in front of the selectors, handing his team a 69-run win against Haryana."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}