{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-us-trade-talks-piyush-goyal-to-lead-team-to-washington-for-bta-negotiations-ytvd-2726160-2025-05-17",
      "headline": "India-US Bilateral Trade Agreement: Final Phase Negotiations Aim For ConclusionUnion Minister Piyush Goyal will lead a team to the United States for trade talks. India and the US are working to finalize the Bilateral Trade Agreement (BTA) by early July. The US President has proposed a trade agreement with India that would have no tariffs on a wide range of American products. The US President stated, 'India is one of the highest tariff nations in the world. It's very hard to sell into India.'"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-drops-chinese-lounge-partner-dragonpass-what-it-means-for-indian-flyers-2726082-2025-05-16",
      "headline": "Adani drops Chinese lounge partner DragonPass: What it means for Indian flyersThe move, triggered by rising national security concerns, has ended DragonPass's access to Adani-managed airport lounges across the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-the-middle-class-is-chasing-expensive-brands-explains-market-expert-2725916-2025-05-16",
      "headline": "Why the middle class is chasing expensive brands, explains market expertA market expert noted that nearly 75% of luxury spending today comes from the middle class, not due to rising incomes, but because of social media, marketing tricks, and peer pressure that fuel the urge to appear successful."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indian-traders-body-boycotts-turkey-and-azerbaijan-over-support-for-pakistan-2725887-2025-05-16",
      "headline": "Indian traders' body boycotts Turkey and Azerbaijan over support for PakistanThe move comes after both Turkey and Azerbaijan openly showed support for Pakistan, at a time when India is facing sensitive national security challenges. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-us-trade-deal-first-phase-likely-to-be-ready-by-july-1-say-sources-2725866-2025-05-16",
      "headline": "India-US trade deal: First phase likely to be ready by July 1, say sourcesIndia and the United States are in negotiations for a trade deal, with sources indicating that phase one could be ready by July 1st. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/un-sees-indian-economy-growing-at-63-percent-as-global-outlook-wobbles-2725850-2025-05-16",
      "headline": "India to grow at 6.3%, ahead of China, US, and European Union: UN reportAccording to the UN's mid-year update of the World Economic Situation and Prospects (WESP), India's growth is being fuelled by strong household spending and solid government investments. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-slips-200-points-nifty-holds-ground-above-25000-defence-stocks-surge-2725827-2025-05-16",
      "headline": "Sensex slips 200 points, Nifty holds ground above 25,000; defence stocks surgeThe S&P BSE Sensex lost 200.15 points to close at 82,330.59, while the NSE Nifty50 was down 42.30 points to end at 25,019.80."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/upcoming-ipo-next-week-2-public-listing-belrise-industries-borana-weaves-details-gmp-price-band-2725818-2025-05-16",
      "headline": "2 IPOs to open next week: Check Belrise Industries, Borana Weaves detailsWhile Belrise Industries will open for bidding on May 21, investors can bid for the IPO of Borana Weaves starting May 20, 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-2025-is-july-31-your-tax-deadline-find-out-2725807-2025-05-16",
      "headline": "ITR filing 2025: Is July 31 your tax deadline? Find outFiling your return on time helps avoid penalties and delays in refunds. It also keeps your financial records in order. So, if your deadline is July 31, skip the last-minute rush and file in advance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-2025-is-digital-form-16-a-game-changer-for-salaried-taxpayers-2725775-2025-05-16",
      "headline": "ITR filing 2025: Is digital Form 16 a game-changer for salaried taxpayers?Digital Form 16 is an electronic version of the traditional Form 16. It's generated directly from the TRACES portal, which is managed by the Income Tax Department. This means all your salary details, TDS, and tax-saving deductions are recorded accurately and match what the government sees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/government-clears-187-startups-for-tax-relief-heres-what-it-means-2725727-2025-05-16",
      "headline": "Government clears 187 startups for tax relief. Here's what it meansTo qualify, the start-up must be recognised by the Department for Promotion of Industry and Internal Trade (DPIIT). It should be a private limited company or a limited liability partnership and its turnover should not cross Rs 100 crore in any year since incorporation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pakistan-latest-imf-funding-what-can-be-done-india-oppose-economic-collapse-terror-support-2725731-2025-05-16",
      "headline": "What Pakistan can and can't do with IMF loanThe International Monetary Fund (IMF) has approved a fresh loan package for Pakistan, agreeing to release USD 1 billion under its Extended Fund Facility (EFF)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/defence-stocks-extend-rally-on-possible-rs-50000-crore-budget-boost-should-you-buy-sell-or-hold-2725720-2025-05-16",
      "headline": "Defence stocks extend rally on possible budget boost. What should investors do?The NSE Nifty India Defence index surged over 5% intraday on Friday. Cochin Shipyard and GRSE have been leading the charge, with the latter gaining a stunning 30% since May 13."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/singtel-offloads-12-percent-stake-in-bharti-airtel-in-154-billion-deal-2725693-2025-05-16",
      "headline": "Singtel offloads 1.2% stake in Bharti Airtel in $1.54 billion dealSingtel, which has been an investor in Airtel for over 20 years, said its stake would drop to 28.3%, valued at around S$48 billion, from 29.5% previously."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/blaming-nris-wont-solve-indias-housing-problem-says-investor-heres-why-2725672-2025-05-16",
      "headline": "Blaming NRIs won't solve India's housing problem, says investor. Here's whyNRIs earn in strong currencies like US dollars, pounds, or euros. So when they convert that money to rupees, they can afford much more. A house that seems expensive to someone in India may feel quite reasonable to someone earning abroad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/cochin-shipyard-grse-shares-rally-up-to-12-percent-why-are-these-defence-stocks-rising-2725671-2025-05-16",
      "headline": "Cochin Shipyard, GRSE rally up to 12%: Why are these defence stocks rising?Cochin Shipyard jumped 12.51% to Rs 2,039 on the BSE at around 11:47 am, extending its rally for a sixth straight session. GRSE climbed 11.10% intraday to Rs 2,510, taking its cumulative gains to over 30% since announcing results post-market on May 13."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stop-us-travel-turkey-tourism-boycott-us-deal-missile-ace-investor-shankar-sharma-2725670-2025-05-16",
      "headline": "Stop all bookings to America, warns ace investor as Indians ditch TurkeyTourism to Turkey and Azerbaijan has already taken a major hit, especially after reports that Pakistan used Turkish-made drones in its recent strikes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/borana-weaves-ipo-to-open-may-20-check-gmp-expected-listing-gains-2725648-2025-05-16",
      "headline": "Borana Weaves IPO to open May 20: Check GMP, expected listing gainsAccording to grey market trends, the IPO is commanding a premium of Rs 55 per share, suggesting potential listing gains of over 25% for successful applicants."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/apple-assures-india-manufacturing-plans-intact-despite-donald-trump-remarks-2725630-2025-05-16",
      "headline": "Apple assures India manufacturing plans intact despite Trump remarks: ReportWhile Apple has not issued a public statement, sources said the company reaffirmed to Indian officials that India remains a key part of its global supply chain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/yes-bank-share-price-stock-in-focus-today-sebi-probe-stake-sale-japan-sbmc-2725615-2025-05-16",
      "headline": "Explained: Why Yes Bank shares are in focus todayYes Bank stock: The shares fell over 1% in early trade but later recovered to trade in the green. At the start of the day, Yes Bank shares opened at Rs 21.50, slightly below Thursday's close of Rs 21.51."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pakistan-offers-zero-tariff-bilateral-trade-deal-to-us-report-2725614-2025-05-16",
      "headline": "Pakistan offers zero-tariff bilateral trade deal to US: ReportThe development comes shortly after US President Donald Trump claimed credit for brokering a ceasefire between India and Pakistan, following four days of intense cross-border hostilities involving drones and missile strikes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/bharti-airtel-share-price-falls-3-percent-in-early-trade-today-2725602-2025-05-16",
      "headline": "Explained: Why Bharti Airtel shares fell 3% in early trade today At 9:35 am, shares of Bharti Airtel were trading 2.69% lower at Rs 1,816.60 on the Bombay Stock Exchange (BSE)."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/indusind-bank-share-price-down-1-percent-internal-audit-report-rs-674-crore-interest-wrong-2725600-2025-05-16",
      "headline": "IndusInd bank shares down 2% after private lender flags interest mistakeIndusInd bank stock opened at Rs 735.95 after having closed at Rs 780.30 in the previous session. The shares have lost 7.29% in the past 5 days, 23.55% over the last 6 months, and 45.48% over the past year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-200-points-nifty-remains-above-25000-indusind-bank-down-3-2725598-2025-05-16",
      "headline": "Sensex, Nifty open lower after yesterday's rally; IndusInd Bank down 3%The BSE Sensex was down 226.18 points to 82,304.56 at 9:20 am, while the NSE Nifty50 fell 67.80 points to trade at 24,994.30."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-prediction-today-sensex-nifty-opening-higher-dalal-street-trading-rally-nse-bse-2725577-2025-05-16",
      "headline": "Stock market today: Sensex, Nifty likely to open higher. Here's whyBoth the Sensex and Nifty touched their highest levels in the last seven months in the last session. So far this week, the Nifty has gained around 4.5% and the BSE Sensex about 4%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-may-16-shares-in-news-today-hyundai-airtel-indusind-bank-bhel-bajaj-auto-nse-bse-trading-2725574-2025-05-16",
      "headline": "Stocks to watch on May 16: Hyundai, Airtel, IndusInd Bank, BHEL, Bajaj AutoHyundai Motor, BHEL, Delhivery, Emami will announce their earnings for the January-March quarter on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/indusind-bank-accounting-error-internal-audit-department-rs-674-crore-incorrect-interest-2725571-2025-05-16",
      "headline": "IndusInd Bank flags Rs 674 crore error as 'incorrectly recorded interest'The bank said its Internal Audit Department (IAD) found that a total of Rs 674 crore was wrongly shown as interest over three quarters in FY 2024-25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-offered-zero-tariff-trade-deal-donald-trump-2725297-2025-05-15",
      "headline": "India offered zero-tariff trade deal: Donald TrumpUS President Donald Trump claimed that India has offered the United States a trade deal with \"literally zero tariffs\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/yes-bank-shares-jump-21-percent-in-5-days-what-investors-need-to-know-2725245-2025-05-15",
      "headline": "YES Bank shares jump 21% in 5 days. What investors need to knowSMBC, a part of the Sumitomo Mitsui Financial Group (SMFG), plans to buy the 20% stake from State Bank of India (SBI) and seven private banks, HDFC Bank, ICICI Bank, Kotak Mahindra Bank, Axis Bank, IDFC First Bank, Federal Bank, and Bandhan Bank. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-ends-1200-points-higher-nifty-above-25000-tata-motors-surges-4-percent-2725220-2025-05-15",
      "headline": "Sensex ends 1,200 points higher, Nifty above 25,000; Tata Motors surges 4%The S&P BSE Sensex surged 1,200.18 points to end at 82,530.74, while the NSE Nifty50 gained 395.60 points to close at 25,062.10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-claims-india-offered-zero-tariff-deal-in-trade-talks-2725187-2025-05-15",
      "headline": "Donald Trump claims India has offered zero-tariff deal in trade talksSpeaking at a business forum in Qatar, Trump said, \"India has offered us a deal where basically they are willing to literally charge us no tariff.\" He didn't provide further details, and there was no immediate response from the Indian government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/planning-a-personal-loan-7-hidden-charges-you-must-know-about-processing-fee-late-payment-fee-emi-bounce-charges-2725178-2025-05-15",
      "headline": "Planning a personal loan? 7 hidden charges you must know aboutMany people only look at the interest rate when taking a personal loan. But there are several other costs that can add up. Knowing these charges helps you plan better, avoid surprises, and even negotiate some of them with the bank."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-rally-sensex-jumps-1300-points-over-reports-of-india-offering-no-tariff-deal-to-us-nifty-gain-2725179-2025-05-15",
      "headline": "Sensex jumps 1,300 points: Why is stock market rising today?As of 2:38 p.m., the S&P BSE Sensex had gained 1,217.88 points to reach 82,548.44, and the NSE Nifty50 had climbed 410.57 points to 25,077.50."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/fds-vs-ppf-which-investment-option-should-you-choose-and-why-2725126-2025-05-15",
      "headline": "FDs vs PPF: Which investment option should you choose and why?By investing in PPF, you can claim a tax exemption of up to Rs 1.5 lakh under Section 80C in a financial year, under the old tax regime. Moreover, the interest you earn from a PPF account is also tax-free. FDs, however, do not offer any tax deduction unless it's a 5-year tax-saving FD."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/i-dont-want-you-to-build-in-india-they-can-take-care-of-themselves-trump-told-apple-ceo-tim-cook-report-2725124-2025-05-15",
      "headline": "Don't want you building in India, Trump tells Apple CEO Tim CookTrump's remarks came just days after India threatened to impose retaliatory tariffs on the US. This was in response to the US raising duties on Indian steel and aluminium exports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/mutual-funds-load-up-on-it-cut-fmcg-and-telecom-stakes-in-april-report-2725083-2025-05-15",
      "headline": "Mutual funds load up on IT, cut FMCG and telecom stakes in April: ReportKotak Mahindra Bank attracted the highest MF investment in the financial sector, with Rs 1,586 crore. IDFC First Bank and HDFC Bank followed, drawing Rs 1,150 crore and Rs 1,026 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/tata-motors-share-price-rise-3-percent-why-reason-curvv-tiago-rashtrapati-bhavan-clsa-rating-2725044-2025-05-15",
      "headline": "Tata Motors shares rise 4% today. Here's whyThe rise in Tata Motors' share price comes even after the company reported a 51% fall in its consolidated net profit to Rs 8,470 crore for the quarter ending March 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/travel-sites-see-spike-in-turkey-azerbaijan-cancellations-over-pakistan-support-makemytrip-ixigo-report-major-cancellations-2725041-2025-05-15",
      "headline": "Travel sites see spike in Turkey, Azerbaijan cancellations over Pakistan supportBoycott calls grow as Turkey and Azerbaijan back Pakistan. Travel sites like MakeMyTrip and ixigo report major cancellations and suspended bookings to these destinations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/raymond-share-price-jumps-5-percent-as-technical-realty-demerger-confusion-fades-2724985-2025-05-15",
      "headline": "Raymond shares jump 5%. Why stock hit upper circuit today?At the Bombay Stock Exchange, Raymond shares were locked at Rs 578.70 in early trade, up 4.99%. The buying comes a day after the stock appeared to lose more than 60% of its value, a fall that was not driven by weak fundamentals or selling pressure but by a mechanical price adjustment."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/ipo/story/virtual-galaxy-infotech-ipo-gmp-listing-gains-rs-87000-stock-market-debut-may-19-sme-2724983-2025-05-15",
      "headline": "Rs 87,000 profit on listing? This IPO's GMP suggests bonanza for investorsVirtual Galaxy Infotech IPO: The IPO received a strong response from all categories of investors as it was subscribed 231.45 times overall."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thug-life-trailer-review-kamal-haasan-silambarasan-gangster-drama-mani-ratnam-2726382-2025-05-17",
      "headline": "Thug Life trailer review: Kamal Haasan, STR in a gangster tale more like Nayakan 2.0The trailer of Mani Ratnam's much-anticipated film 'Thug Life', starring Kamal Haasan, offered a stylish peek into a familiar gangster world, but with the director's signature storytelling depth and visual grandeur. The film also stars Trisha Krishnan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-wants-more-films-with-rashmika-mandanna-says-chemistry-not-a-problem-2726393-2025-05-17",
      "headline": "Vijay Deverakonda wants more films with Rashmika, says 'chemistry not a problem'Actor Vijay Deverakonda candidly spoke about his marriage plans, his on-screen chemistry with Rashmika Mandanna, and whether he's currently seeking a life partner. The duo has long been rumoured to be in a relationship."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ravi-mohan-ex-mother-in-law-sujatha-vijayakumar-breaks-silence-amid-row-aarti-kenishaa-2726351-2025-05-17",
      "headline": "Ravi Mohan's ex-mother-in-law breaks silence amid row: Still want him as our heroAarti's mother and producer Sujatha Vijayakumar has responded to serious allegations by actor Ravi Mohan, clarifying her financial dealings and appealing for family peace. She shared a two-page statement on Saturday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/siddharth-nigam-unaware-of-mumbai-before-dhoom-3-feared-being-trafficked-2726344-2025-05-17",
      "headline": "Siddharth Nigam was unaware of YRF before Dhoom 3: Mumbai bula ke bech diya tohActor Siddharth Nigam shares his initial disbelief and fears when auditioning for Dhoom 3. He felt the casting call was fake and feared that he would be trafficked."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rahul-bhat-on-whether-cannes-is-becoming-a-fashion-event-rather-than-film-festival-2726321-2025-05-17",
      "headline": "Cannes becoming fashion event more than film festival? Actor Rahul Bhat answersRahul Bhat shares his perspective on the Cannes Film Festival, emphasising it as a celebration of cinema rather than just fashion. He is attending Cannes for the third time this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thug-life-trailer-kamal-haasan-silambarasan-trisha-krishnan-mani-ratnam-2726320-2025-05-17",
      "headline": "Thug Life trailer: Kamal Haasan ready to fight death in Mani Ratnam actionerThe highly-anticipated trailer of Kamal Haasan and Mani Ratnam's 'Thug Life' is out. Also starring Trisha Krishnan and Silambarasan in pivotal roles, the trailer was launched at a grand event on May 17. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/murderbot-appletv-new-show-season-1-alexander-skarsgard-secunit-hacks-governor-module-reluctant-antihero-2726298-2025-05-17",
      "headline": "Murderbot review: Alexander Skarsgard elevates show with deadpan deliveryReleased-Fri May 16, 2025'Murderbot' follows a security cyborg that hacks itself and who'd rather watch telly than protect humans. Apple TV's sci-fi comedy presents Alexander Skarsgard as the reluctantly sentient SecUnit navigating freedom while hiding its autonomous status from suspicious scientists."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-to-begin-ak46-filming-in-november-eyes-mid-2026-release-2726299-2025-05-17",
      "headline": "Ajith Kumar to begin AK46 filming in November, eyes mid 2026 releaseTamil actor Ajith Kumar has confirmed his next film, tentatively titled 'AK46'. In an interview, he shared that he will begin the shooting in November 2025. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/aman-verma-turns-magician-for-living-says-paapi-pet-ka-sawaal-hai-2726290-2025-05-17",
      "headline": "Actor Aman Verma turns magician for living, says 'paapi pet ka sawaal hai'Popular television actor Aman Verma appears to have made an unexpected career shift, from being a TV personality to performing as a magician. When curious fans asked about the change, Verma humorously responded that it was for his 'paapi pet'. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tom-cruise-says-mujhpe-bharosa-karo-in-chat-with-avneet-kaur-recalls-india-visit-mission-impossible-the-final-reckoning-promotions-2726274-2025-05-17",
      "headline": "Tom Cruise says 'mujhpe bharosa karo' in chat with Avneet Kaur, recalls India visitTom Cruise surprised fans by speaking Hindi in the latest promo for 'Mission: Impossible – The Final Reckoning'. The actor expressed his love for India and fondly recalled his visit to the country. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/how-nayanthara-navigated-through-controversies-stmp-2675122-2025-02-05",
      "headline": "How Lady Superstar Nayanthara rose above controversies and ruled Tamil cinemaFrom her legal battle with Dhanush to facing online trolls after the birth of her twin boys, Nayanthara has navigated a range of controversies throughout her career. Here is an overview of some of these challenges and how the Lady Superstar managed them—all while steadily rising to fame."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nayanthara-joins-chiranjeevi-157th-film-with-anil-ravipudi-announcement-video-out-2726252-2025-05-17",
      "headline": "Nayanthara joins Chiranjeevi's 157th film with Anil Ravipudi, announcement video outIt's official! Nayanthara has been roped in for megastar Chiranjeevi's next film, tentatively titled 'Mega157'. Set for a Sankranthi 2026 release, it is directed by Anil Ravipudi. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/guns-n-roses-mumbai-concert-details-songs-expected-2726251-2025-05-17",
      "headline": "Guns N' Roses Mumbai performance: The rock revival we've all been waiting forGuns N' Roses is set to electrify Mumbai with their iconic rock energy on May 17 at the Mahalaxmi Race Course. This concert promises to be a legendary celebration of timeless anthems and unforgettable performances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/kristen-stewart-directorial-debut-the-chronology-of-water-impresses-cannes-with-four-minute-ovation-2726244-2025-05-17",
      "headline": "Kristen Stewart's directorial debut impresses Cannes with four-minute ovationKristen Stewart made her directorial debut with 'The Chronology of Water'. The film received appreciation at the ongoing Cannes Film Festival. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/beyond-beauty-beneath-pain-why-filmmakers-keep-returning-to-a-wounded-kashmir-2726217-2025-05-17",
      "headline": "Beyond beauty, beneath pain: Why filmmakers keep returning to a wounded Kashmir?What is it about Kashmir that keeps attracting cinema? Why do filmmakers keep going back to the Valley despite its turbulent past? It certainly can't be all about beauty. It is more. On Cinematic Saturday, we spoke to the actors and directors who have shot in Kashmir, to understand why Kashmir is for cinema. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/joaquin-phoenix-in-tears-as-eddington-gets-five-minute-standing-ovation-at-cannes-pedro-pascal-emma-stone-2726232-2025-05-17",
      "headline": "Joaquin Phoenix in tears as Eddington gets five-minute standing ovation at Cannes'Eddington', starring Joaquin Phoenix, Emma Stone, Pedro Pascal and Austin Butler, received thunderous applause at the 78th Cannes Film Festival. In clips that were shared online, Phoenix is seen visibly moved by the response. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/black-white-and-gray-creator-says-show-is-about-us-not-about-its-characters-2725952-2025-05-17",
      "headline": "Black, White and Gray creator says show is about us, not about its charactersSony LIV's crime thriller 'Black White and Gray - Love Kills' broke new ground with its unique mockumentary style, offering a compelling narrative that explores the complexities of human nature. The show challenged viewers to rethink their perceptions of truth and bias, delivering a culturally rooted story that resonates deeply with Indian audiences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/mission-impossible-final-reckoning-review-tom-cruise-vs-ai-2726166-2025-05-17",
      "headline": "Mission Impossible 8 review: Tom Cruise vs AI battle, guess who wins?Released-Sat May 17, 2025Tom Cruise once again dazzles with breathtaking stunts and nostalgia in 'Mission Impossible: The Final Reckoning', proving his unmatched dedication to action cinema. Despite some narrative flaws, the film stands out for its thrilling sequences and Cruise's charisma, even at 62."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/evolution-of-mental-health-portrayal-in-k-drama-its-okay-to-not-be-okay-doctor-slump-weightlifting-fairy-kim-bok-joo-2726039-2025-05-16",
      "headline": "It's Okay to Not be Okay to Doctor Slump: Evolution of mental health portrayalK-dramas have evolved significantly in portraying mental health, moving from stigma and stereotypes to nuanced and empathetic storytelling. These dramas now highlight real struggles like trauma, anxiety, and burnout, encouraging open conversations about mental well-being."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jaishankar-remarks-on-op-sindoor-misrepresented-government-on-pakistan-admission-claim-2726403-2025-05-17",
      "headline": "Jaishankar's remarks on Op Sindoor misrepresented: Centre on 'admission' claimThe Ministry of External Affairs on Saturday said that a remark made by Jaishankar on Operation Sindoor is being falsely represented. This comes after Congress MP Rahul Gandhi hit out at the government for \"informing\" Pakistan before the strikes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/who-is-jyoti-malhotra-haryana-youtuber-travel-vlogger-arrest-spying-pakistan-2726301-2025-05-17",
      "headline": "YouTuber arrested for spying visited Pak this year. Who is Jyoti Malhotra?Jyoti Malhotra, who was arrested along with six others for sharing sensitive information with Pakistani agents, operates the YouTube channel 'Travel with Jo' and has about 3,77,000 followers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjp-vs-congress-showdown-shashi-tharoor-role-operation-sindoor-global-diplomacy-2726340-2025-05-17",
      "headline": "BJP vs Congress showdown over Shashi Tharoor's role in Op Sindoor diplomacyCongress MP Shashi Tharoor will lead an all-party delegation to present the nation's point of view on recent India-Pakistan tensions. His nomination has sparked a war of words between the BJP and Congress leaders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/13-councillors-resign-from-aap-in-delhi-likely-to-form-new-faction-indraprastha-vikas-party-2726268-2025-05-17",
      "headline": "15 Delhi councillors resign from AAP, announce formation of new partyThe rebel AAP councillors, under the leadership of Mukesh Goel, announced a new party called Indraprastha Vikas Party. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/uttar-pradesh/video/noida-jaypee-aman-society-severe-storm-blows-away-safal-store-viral-video-2726408-2025-05-17",
      "headline": "Watch: Noida vegetable store ravaged by storm, blown away like deck of cardsA resident filming the storm from an upper floor captured the dramatic moment when powerful winds tore through the area."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-kkr-bengaluru-weather-live-updates-rain-score-chinnaswamy-2726188-2025-05-17",
      "headline": "RCB vs KKR Live: Rain returns at ChinnaswamyRCB vs KKR, IPL 2025 Live Score, Bengaluru weather live updates: The rain has returned in Bengaluru, further delaying the game. It had stopped for a brief moment at around 8:40 PM but it seems that there will be further delay. Stay tuned as we bring you the live visuals from the M Chinnaswamy Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/adopted-at-birth-girl-joins-2-men-to-murder-odisha-woman-who-raised-her-2726359-2025-05-17",
      "headline": "Adopted at birth, girl joins 2 men to murder Odisha woman who raised herThe 13-year-old allegedly conspired with two men to kill her adoptive mother over her opposition to the relationship and to gain control of her property."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/post-operation-sindoor-pakistan-claiming-victory-narrative-war-time-to-deploy-ins-tharoor-icbm-asaduddin-owaisi-2723063-2025-05-11",
      "headline": "Shashi Tharoor in India's global outreach mission: Why it makes senseCongress leader Shashi Tharoor has been picked for India's Operation Sindoor global outreach mission and so has AIMIM chief Asaduddin Owaisi. A few days ago, India Today commentator Kamlesh Singh had mooted the very same idea, highlighting the Kerala MP's diplomatic and linguistic prowess that can cripple Pakistan's post-operation illusion. Tharoor's gravitas and Owaisi's firepower could prove to be India's best shot at reclaiming the global narrative, he had argued. We are re-offering the full article in the context of the latest development."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/20-ft-cobra-odisha-school-classroom-rescued-video-2726410-2025-05-17",
      "headline": "Ssshowdown at school: Watch 2 men bag a hissing, slithering 20-ft CobraA 20-foot King Cobra slithered into a classroom in Odisha. In a nerve-wracking rescue, two men from the Snake Helpline team cornered the hissing, defiant cobra -- one grabbing its tail, the other guiding its head --before finally securing it inside a bag. Watch the dramatic moments unfold as students and locals look on in shock."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/an-architectural-trail-in-gujarat-2723608-2025-05-15",
      "headline": "An Architectural Trail in GujaratPress Release | Vadnagar has substantial remains of its ancient Buddhist heritage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/himanta-biswa-sarma-rahul-gandhi-gaurav-gogoi-all-party-delegations-operation-sindoor-outreach-2726289-2025-05-17",
      "headline": "Himanta Sarma's 'drop MP' request after Gaurav Gogoi named for Op Sindoor outreachAssam Chief Minister Himanta Biswa Sarma demanded Rahul Gandhi to drop Congress's Gaurav Gogoi from the list of four MPs nominated by the party for the government's delegations to be sent abroad to explain India's stance on Pak-sponsored terrorism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/available-for-country-shashi-tharoor-on-leading-delegation-for-op-sindoor-outreach-2726338-2025-05-17",
      "headline": "Nation needs me, I am available: Shashi Tharoor on key role in Op Sindoor outreachCongress MP Shashi Tharoor, who will lead one of the seven all-party delegations of parliamentarians tasked with briefing countries on Pak-sponsored terrorism and Operation Sindoor, said the nation needed him and he was available."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/little-girl-from-bengal-dances-to-aayi-nai-in-viral-video-2726352-2025-05-17",
      "headline": "Little girl from Bengal dances to Aayi Nai in viral video, delights InternetA video of a little girl from West Bengal has delighted the internet with her 'Aayi Nai' dance video. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/aiims-helicopter-emergency-landing-kedarnath-chardham-yatra-2726279-2025-05-17",
      "headline": "Video: Helicopter ambulance makes emergency landing in KedarnathThe helicopter belonged to the All India Institute of Medical Sciences (AIIMS), Rishikesh, and arrived in Kedarnath to pick up a patient."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/shashi-tharoor-in-7-member-delegation-of-mps-that-will-brief-nations-on-recent-india-pakistan-conflict-2726183-2025-05-17",
      "headline": "Shashi Tharoor among 7 MPs named for vital role in Operation Sindoor outreachSenior Congress leader Shashi Tharoor will lead one of the seven all-party delegations of MPs tasked with briefing key foreign governments on the recent India-Pakistan conflict."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shashi-tharoor-not-recommended-congress-centre-diplomatic-outreach-pakistan-conflict-2726212-2025-05-17",
      "headline": "Rift out in open? Centre snubs Congress picks, names Shashi Tharoor for key roleShashi Tharoor was among the seven MPs named by the Centre to lead an all-party delegation to expose Pakistan-sponsored terrorism. However, Tharoor's name was not recommended by the Congress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thug-life-trailer-review-kamal-haasan-silambarasan-gangster-drama-mani-ratnam-2726382-2025-05-17",
      "headline": "Thug Life trailer review: Kamal Haasan, STR in a gangster tale more like Nayakan 2.0The trailer of Mani Ratnam's much-anticipated film 'Thug Life', starring Kamal Haasan, offered a stylish peek into a familiar gangster world, but with the director's signature storytelling depth and visual grandeur. The film also stars Trisha Krishnan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/trending/weekly-quiz-484-16-05-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/mission-impossible-final-reckoning-review-tom-cruise-vs-ai-2726166-2025-05-17",
      "headline": "Mission Impossible 8 review: Tom Cruise vs AI battle, guess who wins?Released-Sat May 17, 2025Tom Cruise once again dazzles with breathtaking stunts and nostalgia in 'Mission Impossible: The Final Reckoning', proving his unmatched dedication to action cinema. Despite some narrative flaws, the film stands out for its thrilling sequences and Cruise's charisma, even at 62."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/haryana-based-youtuber-among-arrested-for-spying-for-pakistan-2726271-2025-05-17",
      "headline": "Haryana-based YouTuber among 6 arrested for spying for PakistanHaryana-based YouTuber Jyoti Malhotra and five others have been arrested for sharing sensitive information with Pakistani intelligence operatives. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/foreign-couple-says-nothing-is-too-raw-to-eat-in-india-in-video-internet-reacts-2726265-2025-05-17",
      "headline": "Foreign couple says nothing is 'too raw to eat' in India in video, Internet reactsContent creators Guru and Lia shared their admiration for Indian cuisine in a video that they shared on Instagram. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/beyond-beauty-beneath-pain-why-filmmakers-keep-returning-to-a-wounded-kashmir-2726217-2025-05-17",
      "headline": "Beyond beauty, beneath pain: Why filmmakers keep returning to a wounded Kashmir?What is it about Kashmir that keeps attracting cinema? Why do filmmakers keep going back to the Valley despite its turbulent past? It certainly can't be all about beauty. It is more. On Cinematic Saturday, we spoke to the actors and directors who have shot in Kashmir, to understand why Kashmir is for cinema. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-drone-attack-operation-sindoor-air-defence-army-2726277-2025-05-17",
      "headline": "Over 600 Pak drones downed by India's air defence during hostilitiesIndia's air defence systems successfully thwarted Pakistani drone attacks, shooting down over 600 drones under Operation Sindoor, the retaliatory response to the terrorist strikes in Pahalgam."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/karnataka-bengaluru-software-engineer-sanjay-murder-hit-and-run-cigarette-konanakunte-cross-2726219-2025-05-17",
      "headline": "Caught on camera: Bengaluru techie killed in hit-and-run over cigarette disputeA man in a Hyundai Creta followed the software engineer duo and deliberately rammed his vehicle into their motorcycle after they allegedly refused to give him a cigarette. One was killed, and his friend remains in critical condition."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-kkr-rain-delay-white-pigeon-fan-tribute-virat-kohli-2726407-2025-05-17",
      "headline": "Nature's tribute to Virat Kohli? White pigeons fly over stadium amid rain delayRCB vs KKR: As rain delayed play in Bengaluru, fans spotted a group of white pigeons flying over the M Chinnaswamy Stadium. They said that the sight of the birds was a symbolic tribute to Virat Kohli's legendary career in whites.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-dc-vs-gt-delhi-capitals-all-rounder-vipraj-nigam-full-press-conference-2726395-2025-05-17",
      "headline": "Very tough to replace Starc but Delhi Capitals have made a few changes: ViprajDelhi Capitals all-rounder Vipraj Nigam admitted that it would be a tough task for the team to replace Mitchell Starc, but expressed confidence in the management's ability to make the most of the available players. DC are currently placed fifth on the points table with 13 points, and their chances of making the playoffs look even more challenging now, especially with Starc not returning to India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-gt-vipraj-nigam-dharamsala-rescue-pbks-match-indian-army-2726388-2025-05-17",
      "headline": "Indian army helped us: DC's Vipraj Nigam on Dharamsala evacuationDelhi Capitals all-rounder Vipraj Nigam thanked the Indian army and the government of India for safely escorting players from Dharamsala after their IPL 2025 match against Punjab Kings was suspended midway due to rising tensions between India and Pakistan.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-dc-vs-gt-parthiv-patel-delhi-capitals-vs-gujarat-titans-2726387-2025-05-17",
      "headline": "We are playing good cricket and want to carry on with that: GT Assistant coachGujarat Titans (GT) assistant coach Parthiv Patel wants his team to carry the winning momentum in the last leg of the Indian Premier League 2025 (IPL 2025). GT will take on Delhi Capitals on Sunday, May 18 at Arun Jaitley Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-parthiv-patel-on-kagiso-rabada-dc-vs-gt-2726376-2025-05-17",
      "headline": "Will GT's Kagiso Rabada get a chance against Delhi? Parthiv Patel answersGujarat Titans (GT) assistant coach Parthiv Patel has opened up on Kagiso Rabada's inclusion in the playing XI for their upcoming fixture against Delhi Capitals (DC). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-tribute-rcb-fans-wear-test-jersey-ipl-match-2726373-2025-05-17",
      "headline": "RCB Fans don white jersey to celebrate Virat Kohli's Test legacy in BengaluruRoyal Challengers Bengaluru fans wore Virat Kohli's Test jersey to honour his retirement from Test cricket. The tribute highlighted Kohli's stature as India's most successful Test captain and inspired cheers despite rain delays."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/hansi-flick-warns-barcelona-against-complacency-before-villarreal-match-2726360-2025-05-17",
      "headline": "Hansi Flick issues warning to Barcelona players: Partying is no excusesHewad coach Hansi Flick has cautioned Barcelona players to remain focused on their final LaLiga match despite recent title celebrations. The coach emphasised the importance of finishing the season strongly against a motivated Villarreal side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ishant-sharma-on-virat-kohli-friendship-memories-2726362-2025-05-17",
      "headline": "Virat Kohli will always be Cheeku for us: Ishant on his bond with India starIndia pacer Ishant Sharma opened up on his long-standing bond with Virat Kohli, saying that the star Indian batter will always be \"Cheeku\" to those who grew up with him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/punjab-kings-miss-stoinis-inglis-ipl-match-rajasthan-royals-2726357-2025-05-17",
      "headline": "Punjab Kings will miss key players against Rajasthan Royals: James HopesPunjab Kings will be without key players Marcus Stoinis and Josh Inglis for their IPL match against Rajasthan Royals. The team remains confident in their squad depth despite these absences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rahul-dravid-message-to-rohit-sharma-after-wankhede-stand-honour-2726345-2025-05-17",
      "headline": "Watch: Rahul Dravid's humorous message to Rohit Sharma for Wankhede stand honourRahul Dravid congratulated Rohit Sharma after the Mumbai Cricket Association named a stand at the Wankhede Stadium in his honour, joking that he now knows who to call for match tickets at the venue.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-tribute-rcb-fans-wear-test-jersey-ipl-match-2726373-2025-05-17",
      "headline": "RCB Fans don white jersey to celebrate Virat Kohli's Test legacy in BengaluruRoyal Challengers Bengaluru fans wore Virat Kohli's Test jersey to honour his retirement from Test cricket. The tribute highlighted Kohli's stature as India's most successful Test captain and inspired cheers despite rain delays."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/hansi-flick-warns-barcelona-against-complacency-before-villarreal-match-2726360-2025-05-17",
      "headline": "Hansi Flick issues warning to Barcelona players: Partying is no excusesHewad coach Hansi Flick has cautioned Barcelona players to remain focused on their final LaLiga match despite recent title celebrations. The coach emphasised the importance of finishing the season strongly against a motivated Villarreal side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ishant-sharma-on-virat-kohli-friendship-memories-2726362-2025-05-17",
      "headline": "Virat Kohli will always be Cheeku for us: Ishant on his bond with India starIndia pacer Ishant Sharma opened up on his long-standing bond with Virat Kohli, saying that the star Indian batter will always be \"Cheeku\" to those who grew up with him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/punjab-kings-miss-stoinis-inglis-ipl-match-rajasthan-royals-2726357-2025-05-17",
      "headline": "Punjab Kings will miss key players against Rajasthan Royals: James HopesPunjab Kings will be without key players Marcus Stoinis and Josh Inglis for their IPL match against Rajasthan Royals. The team remains confident in their squad depth despite these absences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rahul-dravid-message-to-rohit-sharma-after-wankhede-stand-honour-2726345-2025-05-17",
      "headline": "Watch: Rahul Dravid's humorous message to Rohit Sharma for Wankhede stand honourRahul Dravid congratulated Rohit Sharma after the Mumbai Cricket Association named a stand at the Wankhede Stadium in his honour, joking that he now knows who to call for match tickets at the venue.\r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}