{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/tankup-engineers-ipo-check-price-dates-gmp-and-should-you-subscribe-2712921-2025-04-22",
      "headline": "Tankup Engineers IPO: Check price, dates, GMP and should you subscribe?Tankup Engineers, known for building specialised vehicle superstructures, aims to raise Rs 19.53 crore through a fresh issue of 13.95 lakh shares."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-is-money-zoho-sridhar-vembu-backs-yellow-metal-as-prices-cross-rs-1-lakh-2712833-2025-04-22",
      "headline": "'Gold is money': Zoho's Sridhar Vembu backs yellow metal as prices cross Rs 1 lakhOn Monday, gold June futures on the MCX hit a new high of Rs 99,178 per 10 grams, up nearly Rs 1,900 from the previous close. In the physical market, gold traded at Rs 97,200 per 10 grams (excluding GST), taking the final retail price past Rs 1 lakh after adding 3% GST."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-closes-187-points-higher-nifty-above-24100-indusind-bank-down-5-percent-2712840-2025-04-22",
      "headline": "Sensex closes 187 points higher, Nifty above 24,100; IndusInd bank down 5%The S&P BSE Sensex gained 187.09 points to close at 79,595.59, while the NSE Nifty50 added 41.70 points to end at 24,167.25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-price-in-us-usd-3500-donald-trump-fed-chair-jerome-powell-economic-slowdown-2712836-2025-04-22",
      "headline": "Gold prices jump to $3,500 amid Trump vs Powell dramaPrices of gold, traditionally seen as a safe-haven asset amid economic and geopolitical uncertainty, have risen by nearly a third so far this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/flipkart-eyes-public-listing-to-shift-base-from-singapore-to-india-ahead-of-ipo-2712827-2025-04-22",
      "headline": "Walmart-backed Flipkart to return to India ahead of much-awaited IPOFlipkart has grown into a large e-commerce platform that competes directly with Amazon in the market and is planning a public listing. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dubai-souk-jewellery-market-gold-prices-rise-jewellers-not-happy-diamond-demand-increase-2712777-2025-04-22",
      "headline": "Gold prices are booming, but Dubai's iconic Gold Souk is losing its sparkleThere are signs of change amid rising prices for gold, as buyers look to diamonds and lighter gold jewellery, instead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/vivad-se-vishwas-scheme-ends-on-april-30-resolve-your-income-tax-disputes-now-2712768-2025-04-22",
      "headline": "Vivad Se Vishwas Scheme ends on April 30. Resolve your income tax disputes nowThe Vivad Se Vishwas Scheme is all about reducing pending tax cases and giving taxpayers a chance to settle things amicably. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-prices-rise-today-cross-rs-1-lakh-why-should-you-invest-now-weak-dollar-safe-haven-yellow-metal-2712715-2025-04-22",
      "headline": "East or West, gold is the bestThe sharp rise in gold prices comes at a time when global markets are under pressure due to the falling US dollar and rising uncertainty in the US economy, especially after recent statements by Donald Trump."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/chinas-gold-atm-melts-jewellery-and-sends-money-in-30-minutes-check-here-2712700-2025-04-22",
      "headline": "China's gold ATM melts jewellery and sends money in 30 minutes. Check here The gold ATM, which is set up in China's Shanghai, melts gold, checks its purity and weight, and transfers the value to your bank account."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/amazon-walmart-flipkart-may-gain-from-us-push-in-india-trade-deal-2712708-2025-04-22",
      "headline": "Amazon, Walmart's Flipkart may gain from US push in India trade deal: ReportIndia currently imposes restrictions on foreign-owned online retailers, including bans on holding inventory and selling directly to consumers. Domestic players like Reliance, by contrast, face no such constraints, giving them an edge in both online and offline retail."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/air-india-boeing-jets-rejected-by-china-trade-tensions-2712683-2025-04-22",
      "headline": "Air India eyes Boeing jets rejected by China amid trade tensions: ReportThe Tata Group-owned carrier, which is undergoing a fleet overhaul and rapid expansion, is in talks with Boeing Co. to acquire several planes that were being readied for Chinese carriers before fresh tariffs disrupted their delivery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rs-500-real-or-fake-look-out-for-small-typo-mha-circular-resarve-bank-of-india-2712663-2025-04-22",
      "headline": "Is the Rs 500 note in your wallet real or fake? Look out for this small typoThe Ministry of Home Affairs has flagged a surge in fake Rs 500 notes that are so well-made, even experienced handlers are finding it hard to detect them. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/martin-scorsese-to-leonardo-dicaprio-hollywood-celebs-remember-pope-francis-2712937-2025-04-22",
      "headline": "Martin Scorsese to Leonardo DiCaprio, Hollywood celebs remember Pope FrancisPope Francis' death at 88 led to tributes from actors, filmmakers and other celebrities across Hollywood. Martin Scorsese, Leonardo DiCaprio, Whoopi Goldberg, Eva Longoria, Antonio Banderas, and Russell Crowe expressed their grief."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saif-ali-khan-buys-home-in-qatar-after-stabbing-incident-in-mumbai-2712918-2025-04-22",
      "headline": "Saif Ali Khan buys home in Qatar after stabbing incident in MumbaiActor Saif Ali Khan recently bought a luxurious home in Qatar. The actor referenced that the place should be 'safe and comfortable.' "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/this-wasnt-a-rule-internet-is-shocked-as-academy-announces-new-viewing-mandate-2712863-2025-04-22",
      "headline": "This wasn't a rule? Internet is shocked as Academy announces new viewing mandateFollowing the 2025 Oscars, controversy arose over voting practices, leading to a new rule requiring members to watch all nominated films. This change is to ensure informed voting after past oversights. However, it has sparked buzz on the internet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/andor-season-two-all-you-need-to-know-about-the-star-wars-spin-off-show-glbs-2712907-2025-04-22",
      "headline": "Andor Season Two: All you need to know about the Star Wars spin-off show'Andor' Season 2 returns on April 22, 2025, on Disney+ (JioHotstar), continuing Cassian Andor's journey to 'Rogue One'. Expect time jumps, intense arcs, and surprise cameos in this thrilling Star Wars finale.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sonal-chauhan-viral-ipl-appearance-didnt-realise-i-was-on-tv-2712896-2025-04-22",
      "headline": "Sonal Chauhan on her viral IPL appearance: Didn't realise I was on TVActor Sonal Chauhan recently became a viral sensation after her appearances at the Mumbai Indians' last two matches at Wankhede Stadium. The actor has now reacted to the same in an interview. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-khatron-ke-khiladi-to-now-air-on-sony-instead-of-colors-tv-2712898-2025-04-22",
      "headline": "Bigg Boss, Khatron Ke Khiladi to now air on Sony? Here's what we knowThe popular reality shows 'Bigg Boss' and 'Khatron Ke Khiladi' might shift from Colors TV to Sony due to creative disagreements. Ongoing discussions between the channel and the production house are currently on."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/bengaluru-priest-makes-worlds-first-full-ai-film-in-kannada-on-rs-10-lakh-budget-2712828-2025-04-22",
      "headline": "Bengaluru priest helms world's first AI film in Kannada on Rs 10 lakh budgetNarasimha Murthy, a Bengaluru-based priest, produced and directed the Kannada film 'Love You', which is being called the first AI-generated feature film in the world. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/hemanth-rao-on-agnyathavasi-promotion-criticism-silence-isnt-always-agreement-2712826-2025-04-22",
      "headline": "Agnyathavasi producer hits back at troll criticising film's poor promotionsKannada producer Hemanth Rao addressed a viral post blaming poor promotions for 'Agnyathavasi's' box office fate, defending the team's effort."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlals-thudarum-is-a-family-drama-not-a-thriller-like-drishyam-says-director-2712684-2025-04-22",
      "headline": "Mohanlal's Thudarum is a family drama, not a thriller like Drishyam, says directorWith audience speculation growing around the genre of Mohanlal's upcoming film 'Thudarum', Director Tharun Moorthy, recently stated that the film is a grounded family drama, countering interpretations that it might be a crime thriller following comparisons to 'Drishyam'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ram-charan-peddi-is-a-mix-of-real-and-fictional-tales-says-director-buchi-babu-2712747-2025-04-22",
      "headline": "Ram Charan's Peddi is a mix of real and fictional tales, says director Buchi BabuDirector Buchi Babu Sana revealed that 'Peddi', starring Ram Charan, is inspired by real-life incidents set in a village with rooted emotions. He confirmed that Charan approved the script in a single sitting, marking the start of their collaboration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/no-godzilla-no-naagin-kartik-aaryan-turns-naagzilla-in-new-film-2712765-2025-04-22",
      "headline": "No Godzilla, no naagin, Kartik Aaryan turns Naagzilla in new filmDharma Productions and Mahaveer Jain Films team up for 'Naagzilla', featuring Kartik Aaryan in a fantasy comedy role. The film, set to release on Nag Panchami 2026, promises a unique storyline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/priyanka-chopra-megan-thee-stalion-to-be-awarded-at-gold-house-gala-2712743-2025-04-22",
      "headline": "Priyanka Chopra, Megan Thee Stallion to be awarded at Gold House GalaPriyanka Chopra, who is currently working on SS Rajamouli's magnum opus starring Mahesh Babu, tentatively titled SSMB29, will be honoured with the inaugural Global Vanguard Honour in Los Angeles.  Megan Thee Stallion and several others are expected to be awarded that night."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sunny-deol-action-stunts-age-is-just-a-number-jaat-gopichand-malineni-shah-rukh-khan-akshay-kumar-ajay-devgn-2712727-2025-04-22",
      "headline": "Dhai Kilo Ka Haath and handpumps: Sunny Deol punches age in the face at 67Bollywood's OG Sunny Deol is back with another banger, 'Jaat'. In an era where action stunts are more about green screens than grit, Deol storms in at 67 with 'Jaat', reminding everyone what real action looks like. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-setia-2712709-2025-04-22",
      "headline": "Priyanka Setia: Hurts when influencers are cast based on social media numbersPriyanka Setia shares her mixed emotions about her new release 'Khauf', addressing the challenges of competing with influencers in Bollywood. She reflects on her journey from an air hostess to an actress, and her aspirations for diverse roles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/anurag-kashyap-brahmin-community-obscene-remarks-forgot-dignity-due-to-anger-2712676-2025-04-22",
      "headline": "Anurag Kashyap apologises to Brahmin community: Forgot dignity due to angerFilmmaker Anurag Kashyap has apologised to the Brahmin community after making controversial remarks. He expressed regret, acknowledging the inappropriateness of his comments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aamir-khan-on-his-dream-project-the-mahabharat-will-be-like-the-lord-of-the-rings-2712669-2025-04-22",
      "headline": "Aamir Khan's big plans for Mahabharat: Might need multiple filmmakersDuring a recent interview, Bollywood superstar Aamir Khan revealed that he hopes to start working on his dream project, 'The Mahabharat', this year. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ananya-pandays-cousin-ahaan-panday-to-debut-with-saiyaara-release-july-2025-direction-mohit-suri-2712665-2025-04-22",
      "headline": "Ananya Panday's cousin Ahaan to debut with Saiyaara, release set for July 2025Yash Raj Films is set to release 'Saiyaara', a romantic drama marking Ahaan Panday's entry into Bollywood, on July 18, 2025. The film will be directed by Mohit Suri."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mahesh-manjrekar-astitva-re-release-2712645-2025-04-22",
      "headline": "Mahesh Manjrekar bats for Astitva re-release: It doesn't age, it's still topicalVeteran filmmaker Mahesh Manjrekar sees the re-release trend as a chance to showcase 'Astitva' again. Despite 'Vaastav's' anniversary, he believes 'Astitva' holds timeless relevance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/parineeti-chopra-reacts-fans-calling-raghav-chadha-jiju-at-rcb-pbks-ipl-match-2712646-2025-04-22",
      "headline": "Parineeti Chopra reacts to fans calling Raghav Chadha 'jiju' at IPL match. WatchActor Parineeti Chopra reacted to a video of fans chanting 'jiju' after Raghav Chadha attended the RCB vs PBKS IPL match in Chandigarh. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tourists-attacked-jammu-and-kashmir-pahalgam-police-on-spot-2712834-2025-04-22",
      "headline": "1 tourist killed, 12 injured in J&K's Pahalgam, Lashkar front TRF claims attack Live UpdatesPahalgam terror attack: Terrorists opened fire on a group of tourists at the Baisaran mountain top in Pahalgam in Jammu and Kashmir. One person has died and twelve have been injured so far."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jk-pahalgam-terror-attack-pm-modi-jeddah-amit-shah-visit-site-lashkar-terrorism-kashmir-2712923-2025-04-22",
      "headline": "PM says Pahalgam attackers won't be spared, asks Amit Shah to visit sitePrime Minister Narendra Modi, currently in Saudi Arabia on a two-day visit, was briefed on the terror attack in Jammu and Kashmir's Pahalgam by Home Minister Amit Shah."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jk-pahalgam-terror-attack-chief-minister-omar-abdullah-reacts-abomination-perpetrators-animals-shocked-2712911-2025-04-22",
      "headline": "Pahalgam attack much larger than anything we've seen in...: Omar AbdullahOmar Abdullah said that the Pahalgam attack was \"much larger than anything we've seen directed at civilians in recent years\". At least 1 person has been killed and several injured in Pahalgam terror attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/finalised-outline-of-trade-agreement-with-india-us-vice-president-jd-vance-in-jaipur-2712839-2025-04-22",
      "headline": "Roadmap to final deal: JD Vance shares big update on India-US trade pactJD Vance announced that America and India have officially finalised the terms of reference for trade negotiations and termed it 'roadmap for final deal'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/woman-eyewitness-pleads-save-husband-jammu-kashmir-terror-attack-pahalgam-2712875-2025-04-22",
      "headline": "We were having bhelpuri, then terrorist shot husband: Pahalgam survivor's accountGunmen opened fire at a group of tourists in Jammu and Kashmir's Pahalgam. A woman, who was an eyewitness to the attack, narrated the sequence of events as a gunman targeted her husband."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/judiciary-row-supreme-court-judge-thick-skinned-justice-surya-kant-2712947-2025-04-22",
      "headline": "'We're thick-skinned': Supreme Court judge's remark amid judiciary rowJustice Surya Kant, while hearing a 2010 contempt of court plea, remarked in the Supreme Court about how attacks on the judiciary come every day and that judges are \"thick-skinned\" to deal with such situations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/us-vice-president-jd-vance-india-visit-praises-pm-modi-three-children-hospitality-2712848-2025-04-22",
      "headline": "Dad, maybe I could live in India: JD Vance on what son Ewan said after meeting PMUS Vice President JD Vance praised Prime Minister Narendra Modi for his warm personality and hospitality towards his family during his four-day official visit to India. He said his son, Ewan, 7, told him he wanted to live in India after meeting with PM Modi."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education-today/story/upsc-cse-final-result-2025-declared-1009-candidates-recommended-shakti-dubey-tops-2712805-2025-04-22",
      "headline": "UPSC Civil Services Final Result 2024 declared, Shakti Dubey from Prayagraj topsThe UPSC CSE Final Result 2024 has been announced. Shakti Dubey topped the exam, followed by Harshita Goyal and Dongre Archit Parag. A total of 1009 candidates have been recommended for IAS, IPS, IFS and Central Services."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/world-will-have-to-wait-longer-millenial-saint-carlo-acitus-italy-canonisation-new-pope-francis-death-news-assisi-2712373-2025-04-22",
      "headline": "After new Pope, world to get its first millennial saintCarlo Acutis, a British-Italian teenager, known as God's influencer for coding and creating Christian websites, was slated to be canonised as the first millennial saint on April 27.  With the death of Pope Francis, Acutis' canonisation will have to wait for now. Hundreds of pilgrims have been making a beeline for the Italian town of Assisi every day to his tomb, and offer prayers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jammu-and-kashmir-terror-attack-pahalgam-killed-injured-security-forces-terrorists-2712876-2025-04-22",
      "headline": "Live: Amit Shah to leave for Pahalgam soon, says terrorists won't be sparedTerror Attack In Pahalgam Live Updates: Several tourists were injured on Tuesday after terrorists attacked a group of tourists visiting Pahalgam in Anantnag district of Jammu and Kashmir, officials said. Gunshots were heard in Baisaran valley, one of the prime tourist spots in Pahalgam, following which security forces rushed to the site. According to initial inputs, unidentified gunmen opened fire on the tourists who had gone for a trekking trip. Stay tuned with indiatoday.in for live updates. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/isha-foundation-school-staff-booked-under-pocso-child-molestation-case-coimbatore-tamil-nadu-2712963-2025-04-22",
      "headline": "Pocso case against four staffers of Isha Foundation school, former studentThe police have filed an FIR under the Pocso Act against four staff members of Isha Foundation school in Coimbatore and a former student, following allegations of repeated molestation of a minor between 2017 and 2019."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/pune-porsche-case-supreme-court-interim-bail-teen-mother-tampering-evidence-swapping-blood-sample-2712946-2025-04-22",
      "headline": "Pune Porsche crash: Teen's mother accused of tampering evidence gets interim bailThe Supreme Court granted interim relief to the woman while reserving its final order on a petition challenging the legality of her arrest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/who-are-shakti-dubey-harshita-goyal-dongre-archit-parag-check-full-list-of-upsc-2024-toppers-2712892-2025-04-22",
      "headline": "Who are UPSC toppers Shakti Dubey, Harshita Goyal, Dongre Archit Parag?UPSC has released the 2024 CSE Final Result. Meet the top three UPSC toppers Shakti Dubey, Harshita Goyal and Archit Parag and check the top 25 toppers' list."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-leaves-for-saudi-hajj-quota-mous-on-defence-trade-on-agenda-2712621-2025-04-22",
      "headline": "PM Modi arrives in Saudi's Jeddah: Hajj quota, defence and trade pacts on agenda Live UpdatesPM Modi is expected to discuss Hajj quota for Indians during his meeting with the Crown Prince and Prime Minister of Saudi Arabia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/executive-versus-judiciary-row-government-sources-viksit-bharat-democracy-2712818-2025-04-22",
      "headline": "Respect for judiciary paramount: Government sources amid rowSenior government officials reaffirmed respect for the judiciary and called for harmony amongst democratic institutions amid ongoing tensions between the executive and judiciary. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/fbi-chief-kash-patel-says-terrorist-happy-passia-was-plotting-multiple-attacks-in-india-us-police-stations-2712656-2025-04-22",
      "headline": "Terrorist Happy Passia planned multiple attacks on India, US: FBI chiefFBI chief Kash Patel revealed that terrorist Harpreet Singh, alias Happy Passia, was involved in planning multiple attacks on police stations in India and the US. He said Passia, who was arrested last week, was part of a bigger foreign terrorist gang."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/anaya-bangar-chills-with-sarfaraz-khan-naushad-khan-musheer-khan-2712550-2025-04-22",
      "headline": "Anaya Bangar chills with Sarfaraz Khan and his father, Musheer misses reunionFormer Indian cricketer Sanjay Bangar's child Anaya Bangar spent time with Sarfaraz Khan and his family, and posted pictures featuring some precious moments with them. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/parliament-is-supreme-jagdeep-dhankhar-again-condemns-judiciary-supreme-court-encroachment-2712698-2025-04-22",
      "headline": "Parliament is supreme: Jagdeep Dhankhar doubles down on criticism of judiciaryVice President Jagdeep Dhankhar doubled down on criticism of judicial 'overreach' and said that \"elected representatives will be ultimate masters\" of constitution. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/pune/story/pune-road-rage-couple-beaten-with-sticks-and-stones-after-dispute-over-honking-2712798-2025-04-22",
      "headline": "Pune road rage: Couple beaten with sticks and stones after dispute over honkingThe woman claimed her husband was attacked with sticks and stones and when she tried to intervene, the accused kicked her in the stomach and punched her."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-prices-rise-today-cross-rs-1-lakh-why-should-you-invest-now-weak-dollar-safe-haven-yellow-metal-2712715-2025-04-22",
      "headline": "East or West, gold is the bestThe sharp rise in gold prices comes at a time when global markets are under pressure due to the falling US dollar and rising uncertainty in the US economy, especially after recent statements by Donald Trump."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/maharashtra/story/bal-thackeray-brothers-uddhav-raj-come-together-reclaim-legacy-aaditya-amit-shiv-sena-maharashtra-bmc-2712779-2025-04-22",
      "headline": "If Thackeray bhais join hands, it'll be for the betas If the Thackeray cousins, Uddhav and Raj, come together after a bitter parting of ways two decades ago, it won't be for themselves but for their sons. This could be the last-ditch attempt for the feuding brothers to reclaim Bal Thackeray's legacy and help Aditya and Amit inherit it.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/indian-national-20-molest-singapore-airlines-sia-cabin-crew-member-on-flight-crime-2712729-2025-04-22",
      "headline": "Grabbed, pushed into toilet: Cabin crew member molested by Indian mid-flightA 20-year-old Indian national has been charged with allegedly molesting a cabin crew member aboard a Singapore Airlines (SIA) flight. Earlier in April, an Indian-origin retired banker was sentenced to nine months in jail for molesting four SIA cabin crew members."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/woman-compares-her-life-in-gujarat-with-cousins-in-uk-viral-reddit-post-2712888-2025-04-22",
      "headline": "Woman compares her life in Gujarat with cousin's in UK, asks if West is betterIn a now-viral post on Reddit, a Gujarat-based woman asked if life in Western countries is better as she compared her own with her cousin's in the UK."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/man-sent-woman-his-credit-card-for-10-seconds-on-linkedin-viral-post-2712945-2025-04-22",
      "headline": "Man sent woman his credit card 'for 10 seconds' on LinkedIn. Here's what she did nextIn a now-viral post, a woman claimed that a man sent her his credit card on LinkedIn for just 10 seconds. Read on to find out what she did next. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-test-series-rohit-sharma-sai-sudharsan-shreyas-iyer-2712966-2025-04-22",
      "headline": "Rohit Sharma set to tour England, Sai Sudharsan in mix for Test series: ReportIndia captain Rohit Sharma is expected to retain his position as the captain in India's upcoming Test tour of England, if reports are to be believed. As many as six other players are expected to stay in contention for the Test side as well."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-live-score-lucknow-super-giants-vs-delhi-capitals-today-match-updates-2712956-2025-04-22",
      "headline": "LSG vs DC Live: KL Rahul vs Rishabh Pant as Lucknow eye revengeIPL 2025, LSG vs DC Live Score: Lucknow Super Giants lost to Delhi Capitals by one wicket earlier in the tournament and would be looking to avenge their defeat in the reverse fixture. KL Rahul will also be playing against his former opponent. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/issf-world-cup-india-finishes-3rd-in-peru-suruchi-wins-3-golds-2712948-2025-04-22",
      "headline": "ISSF World Cup: India finishes 3rd in Peru, Suruchi wins 3 goldsIndia finished 3rd in the recently concluded International Shooting Sport Federation. Young Suruchi Inder Singh had the best results for India in the competition.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/rafael-nadal-laureus-sporting-icon-retirement-2712939-2025-04-22",
      "headline": "Needed time to be sure: Nadal recalls tough retirement decisionRafael Nadal said that he wanted to be absolutely sure before he took the decision to retire from professional tennis. On Monday, Nadal won the Laureus Sporting Icon award in Madrid. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-shivam-dube-budding-atletes-award-chennai-super-kings-tamil-nadu-2712920-2025-04-22",
      "headline": "CSK's Shivam Dube pledges Rs 70,000 each to 10 athletes from Tamil NaduShivam Dube promised to give Rs 70,000 each to 10 young athletes from Tamil Nadu in a thoughtful gesture. The CSK all-rounder showed his support for grassroots talent and inspired the next generation of Indian sportspersons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kkr-ipl-points-table-venky-mysore-2712865-2025-04-22",
      "headline": "2014, 2021: KKR CEO says team has history of making comebacks in IPLKolkata Knight Riders CEO Venky Mysore believes that his team can still reach the playoffs in Indian Premier League's 2025 seaosn. Mysore has stated that KKR have a history of making comebacks and can do it this season as well."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/john-cena-shares-he-got-a-hair-transplant-after-facing-bullying-over-bald-spot-glbs-2712861-2025-04-22",
      "headline": "John Cena claims fans 'bullied' him into hair transplantJohn Cena, after winning his record-breaking 17th world title at Wrestlemania 41, on April 21, Monday, appeared on the Pat McAfee show. The 47-year-old star confirmed he had a hair transplant procedure in November 2024, due to relentless fan chants and signs about his hair loss."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-star-nicholas-pooran-meets-fan-injured-by-his-monstrous-six-2712851-2025-04-22",
      "headline": "Watch: LSG star Nicholas Pooran meets fan injured by his monstrous six in LucknowLucknow Super Giants (LSG) batter Nicholas Pooran met a fan hit by his monstrous six during the game against Gujarat Titans (GT) at the Bharat Ratna Shri Atal Bihari Vajpayee Ekana Cricket Stadium in Lucknow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-milk-five-litres-ridiculous-rumour-reaction-2712835-2025-04-22",
      "headline": "MS Dhoni on the most ridiculous rumour about himself: I drink 5 litres of milk dailyIPL 2025: Chennai Super Kings captain MS Dhoni debunked the long-standing rumour that he drinks five litres of milk a day during a fun-filled interaction at a promotional event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/vanessa-bryant-honors-late-husband-kobe-on-what-would-have-been-their-24th-wedding-anniversary-glbs-2712811-2025-04-22",
      "headline": "Vanessa Bryant honors late husband Kobe on what would have been their 24th wedding anniversaryVanessa Bryant paid an emotional tribute to her late husband, NBA legend Kobe Bryant, on what would have marked their 24th wedding anniversary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-suresh-raina-csk-criticism-instagram-video-2712801-2025-04-22",
      "headline": "CSK don't have the hunger to win, it's their weakest team ever: Suresh RainaIPL 2025: Former Chennai Super KIngs batter Suresh Raina criticised the five-time champions while reflecting on their disastrous run in 2025. Raina questioned why CSK did not tap into local talent pool and lashed out at their lack of intent in the powerplays. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/john-cena-shares-he-got-a-hair-transplant-after-facing-bullying-over-bald-spot-glbs-2712861-2025-04-22",
      "headline": "John Cena claims fans 'bullied' him into hair transplantJohn Cena, after winning his record-breaking 17th world title at Wrestlemania 41, on April 21, Monday, appeared on the Pat McAfee show. The 47-year-old star confirmed he had a hair transplant procedure in November 2024, due to relentless fan chants and signs about his hair loss."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-star-nicholas-pooran-meets-fan-injured-by-his-monstrous-six-2712851-2025-04-22",
      "headline": "Watch: LSG star Nicholas Pooran meets fan injured by his monstrous six in LucknowLucknow Super Giants (LSG) batter Nicholas Pooran met a fan hit by his monstrous six during the game against Gujarat Titans (GT) at the Bharat Ratna Shri Atal Bihari Vajpayee Ekana Cricket Stadium in Lucknow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-milk-five-litres-ridiculous-rumour-reaction-2712835-2025-04-22",
      "headline": "MS Dhoni on the most ridiculous rumour about himself: I drink 5 litres of milk dailyIPL 2025: Chennai Super Kings captain MS Dhoni debunked the long-standing rumour that he drinks five litres of milk a day during a fun-filled interaction at a promotional event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/vanessa-bryant-honors-late-husband-kobe-on-what-would-have-been-their-24th-wedding-anniversary-glbs-2712811-2025-04-22",
      "headline": "Vanessa Bryant honors late husband Kobe on what would have been their 24th wedding anniversaryVanessa Bryant paid an emotional tribute to her late husband, NBA legend Kobe Bryant, on what would have marked their 24th wedding anniversary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-suresh-raina-csk-criticism-instagram-video-2712801-2025-04-22",
      "headline": "CSK don't have the hunger to win, it's their weakest team ever: Suresh RainaIPL 2025: Former Chennai Super KIngs batter Suresh Raina criticised the five-time champions while reflecting on their disastrous run in 2025. Raina questioned why CSK did not tap into local talent pool and lashed out at their lack of intent in the powerplays. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}