{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/want-to-save-taxes-try-these-5-last-minute-investment-options-to-maximise-benefits-2681746-2025-02-18",
      "headline": "Want to save taxes? Try these 5 last-minute investment options to maximise benefitsThe Equity-Linked Savings Scheme (ELSS) is a popular tax-saving tool available under Section 80C, offering a lock-in period of three years. Under this, investments up to Rs 1.5 lakh are eligible for deductions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/sugar-gets-costlier-prices-rise-65-percent-in-a-month-as-output-dips-sugar-mill-shutdown-2681770-2025-02-18",
      "headline": "Sugar gets costlier: Prices rise 6.5% in a month as output dipsA drop in sugar output, caused by adverse weather and the reopening of sugar exports after two years, has led to a supply shortage, pushing up prices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-will-taxpayers-with-late-itr-filings-lose-refunds-2681693-2025-02-18",
      "headline": "New Income Tax Bill: Will taxpayers with late ITR filings lose refunds?Late ITR filing refund concern: The Income Tax Act, 1961, does not prevent taxpayers from claiming a refund just because the return was filed after the deadline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/licious-ipo-usd-2-billion-backed-by-temasek-public-listing-2026-profitability-report-2681690-2025-02-18",
      "headline": "Licious, backed by Temasek, preps for massive $2 billion IPO: Report Delightful Gourmet Pvt, the parent company of Licious, is expanding its physical store network and improving delivery times to compete with quick-commerce rivals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-correction-smallcap-space-bloodbath-what-should-investors-do-2681686-2025-02-18",
      "headline": "Smallcap stocks are bleeding. What should investors do?Smallcap stocks have been battered by the persistent selling by foreign institutional investors (FIIs). A dismal Q3 earnings season has only worsened the situation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indian-overseas-bank-iob-rolls-out-aadhaar-based-account-opening-check-details-2681655-2025-02-18",
      "headline": "Indian Overseas Bank rolls out Aadhaar-based account opening. Check detailsThis new initiative allows customers to open savings bank accounts online with minimal documentation, as per Reserve Bank of India's eKYC guidelines. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-weakness-continues-sensex-nifty-down-again-3-things-to-know-2681648-2025-02-18",
      "headline": "Sensex, Nifty tumble again as volatility grips Dalal Street. 3 things to knowStock Market Today, 18 Feb 2025: Dalal Street remains under pressure with no immediate relief in sight. Here are some key points investors should know. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-eyes-india-entry-for-third-time-why-ev-giants-last-two-attempts-failed-2681614-2025-02-18",
      "headline": "Tesla eyes India entry for third time. Why EV giant's last two attempts failedTesla in India: Tesla has made two previous attempts to enter the Indian market, both of which ended in failure.  Here's a look at the reasons behind its past setbacks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-begins-hiring-in-india-here-is-the-list-of-job-openings-and-locations-elon-musk-pm-modi-meeting-2681601-2025-02-18",
      "headline": "Tesla begins hiring in India: Here's the list of job openings and locationsTesla India hiring: Tesla has posted 13 job openings on its LinkedIn page, covering both customer-facing and back-end roles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-lower-despite-it-stock-gains-metal-banking-drag-2681589-2025-02-18",
      "headline": "Sensex, Nifty open lower despite IT stock gains; metal, banking dragShare Market: The S&P BSE Sensex lost 105.42 points to 75,891.44, while the NSE Nifty50 was down by 57.15 points to 22,902.35 as of 9:30 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-begins-hiring-in-india-planning-entry-ev-carmaker-after-pm-modi-recent-us-trip-elon-musk-2681581-2025-02-18",
      "headline": "Tesla hints at India entry with jobs post days after PM Modi meets Elon MuskTesla has begun hiring in India and has posted several job openings. This comes shortly after Tesla CEO Elon Musk met with Prime Minister Narendra Modi during his recent visit to the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-tips-dalal-street-continues-to-be-volatile-what-should-investors-do-expert-view-2681557-2025-02-18",
      "headline": "Dalal Street continues to be volatile: What should investors do? Dalal Street volatile: The S&P BSE Sensex gained 57.65 points to settle at 75,996.86, while the NSE Nifty50 added 30.25 points to close at 22,959.50. Despite this recovery, overall market sentiment remains cautious as investors react to various global and domestic factors."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/k-drama-2025-when-life-gives-you-tangerine-to-wife-of-a-21st-century-prince-full-list-from-kakao-entertainment-2681749-2025-02-18",
      "headline": "K-slate 2025: When Life Gives You Tangerine to Wife of a 21st Century PrinceKakao Entertainment is set to make 2025 a landmark year for K-dramas and films, with a rich array of releases across various genres. From gripping thrillers to heartwarming romances, the lineup promises stellar performances and captivating stories."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dabba-cartel-trailer-netflix-shabana-azmi-jyotika-gajraj-rao-2681735-2025-02-18",
      "headline": "Dabba Cartel trailer: Shabana Azmi, Jyotika promise an addictive showThe trailer for Netflix's Dabba Cartel unveils a gripping crime drama about five women whose dabba business unexpectedly plunges them into the dangerous world of a drug cartel."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kim-sae-rons-father-blames-youtuber-for-death-co-star-won-bin-breaks-down-at-funeral-2681684-2025-02-18",
      "headline": "Kim Sae-ron's father blames YouTuber for death, co-star Won Bin breaks downSouth Korean actor Kim Sae-ron's father spoke out at her funeral, held a day after her death, highlighting the emotional distress she suffered due to a YouTuber's videos. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/karan-singh-grover-back-on-tv-5-years-after-kasautii-zindagii-kay-report-2681666-2025-02-18",
      "headline": "Karan Singh Grover back on TV 5 years after Kasautii Zindagii Kay: ReportActor Karan Singh Grover might just be a part of a romantic show very soon. He is reported to be seen alongside Helly Shah in this new TV show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/linkin-park-singer-chester-benningtons-child-comes-out-as-transgender-2681663-2025-02-18",
      "headline": "Late Linkin Park singer Chester Bennington's child comes out as transgenderLinkin Park singer Chester Bennington's child, Draven, has come out as transgender. The artiste shared the news on her social media handle, while stating her preferred pronouns in a small note. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/amit-trivedi-global-artists-ed-sheeran-dua-lipa-coldplay-india-purely-business-exclusive-2680888-2025-02-18",
      "headline": "Amit Trivedi: Global artists performing in India is nothing but pure businessIndia has become a hotspot for global artists to perform, drawing big names like Coldplay, Ed Sheeran, and Dua Lipa. Music composer Amit Trivedi believes their choice is driven by business interests, as they seek lucrative opportunities in the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bridgerton-4-first-look-benedict-sophies-love-story-takes-centre-stage-2681436-2025-02-17",
      "headline": "Bridgerton 4 first look: Benedict-Sophie's love story takes centre stageThe fourth season of Bridgerton is set to spotlight Benedict Bridgerton's romance with Sophie Baek. New characters like Katie Leung's Lady Araminta Gun will add intrigue to the season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/legends-of-shiva-amish-tripathi-get-real-about-lord-shiva-in-discovery-show-2681343-2025-02-17",
      "headline": "Legends of Shiva: Amish Tripathi gets real about Lord Shiva in his latest showAuthor and producer Amish Tripathi returns as host of Legends of Shiva with Amish, a new show on Discovery Channel, exploring Lord Shiva beyond myths. Unveiled at the New Delhi Book Fair, it promises a deep dive into mythology coinciding with Maha Kumbh 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/amortage-review-jisoos-album-shakes-things-up-like-an-earthquake-2681277-2025-02-17",
      "headline": "Amortage review: Jisoo's album shakes things up like an 'earthquake'Jisoo's new EP, Amortage, released on February 14, 2025, marks her evolution as a solo artist. The EP blends pop and R&B to explore love's many facets, featuring English tracks and her own songwriting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bhabiji-writer-manoj-santoshi-battles-cancer-shilpa-shinde-takes-care-of-him-2681295-2025-02-17",
      "headline": "Bhabiji writer Manoj Santoshi battles cancer, Shilpa Shinde takes care of himActor Kavita Kaushik made an emotional post on social media, highlighting screenwriter Manoj Santoshi's struggle with liver cancer. She also mentioned actor Shilpa Shinde and thanked her for taking care of him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-witch-review-park-jinyoung-roh-jeong-eui-shine-in-slow-burning-psychological-mystery-2681258-2025-02-17",
      "headline": "The Witch review: Jinyoung, Jeong-eui shine in slow-burning psychological mysteryReleased-Sat Feb 15, 2025The Witch review: The Witch, a new K-drama starring Jinyoung and Jeong-eui, captivates with its psychological mystery and slow-burning narrative. The series, based on a popular webtoon, blends mystery, romance, and suspense, leaving viewers intrigued by the enigmatic characters and their complex interactions, says our review. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rashami-desai-on-love-hate-bond-with-sidharth-shukla-we-would-communicate-through-eyes-2681270-2025-02-17",
      "headline": "Rashami Desai on love-hate bond with Sidharth Shukla: We'd communicate through eyesActor Rashami Desai, who had worked with the late Sidharth Shukla on 'Dil Se Dil Tak' and 'Bigg Boss 13', was reminded of her relationship with him on comedian Bharti Singh's podcast. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/stray-kids-felix-arm-fracture-in-car-accident-misses-fan-meet-2681229-2025-02-17",
      "headline": "Stray Kids' Felix suffers fracture after car accident, misses group's fan meetFelix, a member of the boy band Stray Kids, suffered an arm fracture in a minor car accident, causing him to miss the band's fifth fan meeting."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/south-korean-actor-kim-sae-ron-suicide-comeback-to-films-2681202-2025-02-17",
      "headline": "South Korean actor Kim Sae-ron wanted to make a comeback to films, open a cafeSouth Korean actor Kim Sae-ron, who was found dead in her apartment on Sunday, had wished to make a comeback to the entertainment world, revealed a friend recently. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/gajraj-rao-renuka-shahane-dupahiya-prime-video-teaser-2681147-2025-02-17",
      "headline": "Gajraj Rao, Renuka Shahane's Dupahiya to bring laughter and chaos to Prime VideoPrime Video's Dupahiya is set in a crime-free village where the first-ever theft of a motorbike creates chaos and drama. Starring Gajraj Rao and Renuka Shahane, the comedy series starts streaming on March 7."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/south-korean-actor-kim-sae-ron-found-dead-at-24-2680949-2025-02-16",
      "headline": "South Korean actor Kim Sae-ron, 24, found deadSouth Korean actor Kim Sae-ron, known for her roles in Bloodhounds and The Man from Nowhere, was found dead at her home in Seoul. She was 24. Authorities are investigating the circumstances of her death, with no signs of foul play reported yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-white-lotus-season-3-review-lisa-parker-posey-and-jason-isaacs-show-is-predictable-but-entertaining-2680925-2025-02-16",
      "headline": "The White Lotus S3 review: Predictable? Yes. Addictive? Also, yesReleased-Mon Feb 17, 2025The White Lotus Season 3 review: The White Lotus returns with a new season set in Thailand, offering a fresh cultural backdrop while retaining its biting satire on the ultra-rich. The series continues to entertain with its dark humour and ensemble cast, though its formula is starting to feel familiar. Read our full review. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/kanye-west-says-he-fought-5-hours-for-grammy-tickets-amid-guest-list-confusion-2680934-2025-02-16",
      "headline": "Kanye West says he fought 5 hours for Grammy tickets amid guest list confusionRapper Kanye West, in a post on X, revealed that he fought for five hours to secure Grammy tickets amid guest list chaos. This comes amid claims that Kanye arrived at the event uninvited. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/comedian-anubhav-singh-bassi-lucknow-show-cancelled-by-cops-law-and-order-concern-2680788-2025-02-16",
      "headline": "Comedian Anubhav Bassi's Lucknow show cancelled after warning over foul languageThe shows of comedian Anubhav Singh Bassi in Lucknow were cancelled due to concerns over inappropriate content, following a complaint by the UP Women's Commission vice-chairperson. Authorities cited potential law and order issues as reasons for the cancellation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/chum-darang-blushes-karan-veer-mehra-confesses-love-valentine-day-bigg-boss-18-2680773-2025-02-16",
      "headline": "Watch: Chum Darang blushes as Karan Veer confesses love on Valentine's DayKaran Veer Mehra confessed his love for Chum Darang on Valentine's Day. Chum shared a post from their romantic outing on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ed-sheeran-pauses-delhi-concert-for-fan-wears-team-india-dream-11-jersey-2680728-2025-02-16",
      "headline": "Watch: Ed Sheeran pauses Delhi concert as fan faints, wears Team India jerseyEd Sheeran wrapped up his India tour in Gurugram on February 15. He paused his concert briefly to help a fan who fainted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shalin-bhanot-reacts-to-indias-got-latent-row-advocates-self-discipline-2680673-2025-02-16",
      "headline": "Shalin Bhanot reacts to India's Got Latent Row, advocates self-disciplineTV actor Shalin Bhanot has reacted to the controversy surrounding YouTuber Ranveer Allahbadia's comment on India's Got Latent during the FDCI's India Men's Weekend in Jaipur. He emphasised self-discipline and responsibility.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/jay-z-reacts-after-rape-lawsuit-against-him-dropped-2680571-2025-02-15",
      "headline": "Today is a victory: Jay-Z reacts after rape lawsuit against him droppedIn a significant legal victory, rapper Jay-Z has seen a sexual assault lawsuit against him dismissed. The rapper and entrepreneur expressed relief and satisfaction over the court's decision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/mahabharat-actor-saurav-gurjar-threatens-ranveer-allahbadia-samay-raina-controversy-indias-got-latent-stmp-2680542-2025-02-15",
      "headline": "No one can save him: Mahabharat actor threatens Ranveer Allahbadia Actor Saurav Gurjar openly threatened Ranveer Allahbadia over his recent remarks on India's Got Latent. In a video message, the actor requested the government to take strict action against the podcaster. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/drake-releases-new-album-amid-feud-with-kendrick-lamar-fails-to-impress-fans-2680481-2025-02-15",
      "headline": "Drake releases new album amid feud with Kendrick Lamar, fails to impress fansDrake appears to have ended his feud with Kendrick Lamar in his latest album, but fans remain unimpressed. Released on Valentine's Day, the album in collaboration with PartyNextDoor marks his first new work since the Super Bowl halftime show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bharti-singh-supports-samay-raina-indias-got-latent-controversy-ranveer-allahbadia-good-talented-guy-2680407-2025-02-15",
      "headline": "Bharti Singh supports Samay Raina amid India's Got Latent controversyComedian Bharti Singh supported Samay Raina amid the India's Got Latent controversy. The comedian praised Samay and said that he is very sweet, and anyone can become his fan once they get to meet him. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-18-chum-darang-elvish-yadav-racist-remarks-2680401-2025-02-15",
      "headline": "Women's panel summons Elvish Yadav over remarks against Chum Darang on Feb 17YouTuber Elvish Yadav has been summoned by a women's panel following his racist remarks against Chum Darang. Yadav criticised her name and nationality, sparking courage among northeastern citizens. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/apoorva-mukhija-aka-rebel-kid-removed-from-official-iifa-ambassador-list-indias-got-latent-controversy-2680258-2025-02-14",
      "headline": "Apoorva Mukhija aka Rebel Kid removed from official IIFA ambassador listApoorva Mukhija, known as Rebel Kid, has been removed from the IIFA ambassador list following controversy over her appearance in Samay Raina's show, India's Got Latent. The decision follows threats from Karni Sena to disrupt her upcoming shoot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/fighting-zombies-to-playing-a-psychopath-the-many-faces-of-choi-woo-shik-2680124-2025-02-14",
      "headline": "Fighting zombies to playing a psychopath: The many faces of Choi Woo-shikLong before Choi Woo-shik became a household name thanks to Parasite, he had already amassed an impressive filmography. On this week's K-Fix, we'll have a closer look at his notable works, crafted long before his Oscar-winning turn in Parasite."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/the-potato-lab-trailer-kang-tae-oh-is-set-to-headline-upcoming-rom-com-2680071-2025-02-14",
      "headline": "The Potato Lab trailer: Kang Tae-oh is set to headline upcoming rom-comThe trailer for The Potato Lab, a romantic comedy-drama starring Kang Tae-oh and Lee Sun-bin, has been released. The series, set in a rural potato research institute, promises a blend of romance, comedy, and workplace drama."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dhoom-dhaam-review-yami-gautam-pratik-gandhi-2679912-2025-02-14",
      "headline": "Dhoom Dhaam review: Romance meets thrill in this Yami Gautam-Pratik Gandhi filmReleased-Fri Feb 14, 2025Dhoom Dhaam movie review: Dhoom Dhaam blends romance with action and comedy, offering a refreshing alternative to traditional Valentine's Day films. Starring Yami Gautam and Pratik Gandhi, the movie delivers a thrilling and entertaining experience perfect for a cosy night in."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/selena-gomez-benny-blanco-song-scared-of-loving-you-released-new-album-i-said-i-love-you-first-2679975-2025-02-14",
      "headline": "Scared of Loving You: Selena Gomez's new song for her Valentine Benny Blanco out Lovebirds Selena Gomez and Benny Blanco have now collaborated for a new album titled I Said I Love You First. On the occasion of Valentine's Day 2025, Selena released the first single from the album, Scared of Loving You.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/music-composer-ilayaraja-madras-high-court-dispute-with-music-master-over-his-compositions-2679766-2025-02-14",
      "headline": "Ilaiyaraaja appears in Court in dispute with music company over his compositionsIn 2010, Music Master filed a lawsuit seeking a ban on the use of these songs on YouTube and social media platforms, calling it \"unauthorised\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/are-k-drama-men-written-by-women-too-good-to-be-true-valentine-day-special-2679923-2025-02-14",
      "headline": "Are K-Drama men written by women too good to be true? | Valentine Special K-drama male leads have captivated audiences with their idealised traits, offering a romantic fantasy of the perfect partner. These characters, crafted by female screenwriters, challenge traditional portrayals. This Valentine's Day we analyse if they are too good to be true. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/prime-videos-rings-of-power-renewed-for-third-season-2679924-2025-02-14",
      "headline": "Prime Video's Rings of Power renewed for third seasonPrime Video's Rings of Power has been renewed for the third installment, the makers announced recently. Its second season was released last year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mrs-director-arati-kadav-on-backlash-over-missing-credits-great-indian-kitchen-2679432-2025-02-14",
      "headline": "Mrs director Arati Kadav on backlash over missing credits: Glad it was called outDirector Arati Kadav addresses the backlash over Mrs not crediting The Great Indian Kitchen in the trailer, stressing the need for proper recognition. Mrs, starring Sanya Malhotra, is streaming on Zee5. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kanan-gill-asking-same-question-as-ranveer-allahbadia-video-2679865-2025-02-14",
      "headline": "Viral video: Kanan Gill made same remark as Ranveer Allahbadia years agoAs Ranveer Allahbadia faces backlash for his India's Got Latent remark, an old video of Kanan Gill asking the same question resurfaces on the internet. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/kanye-west-bianca-censori-heading-for-divorce-team-clarifies-2679842-2025-02-14",
      "headline": "Kanye West, Bianca Censori heading for divorce? Team clarifiesIt was previously reported that singer-rapper Kanye West and his wife, Bianca Censori, had split and were headed for divorce. However, a recent development has refuted these claims, labelling them as \"tabloid rumours.\"\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sanya-malhotras-mrs-makes-questions-on-marital-rape-mechanical-sex-personal-2679613-2025-02-14",
      "headline": "Sanya Malhotra's Mrs. makes questions on marital rape, mechanical sex personalImagine a woman bleeding for five days in a month, and those five days being the most peaceful in her life because she can finally refuse sex to her husband. He can't assert his power over her. That's how Sanya Malhotra's 'Mrs.' unsettles you and makes you think. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/vishal-dadlani-meets-with-accident-undergoing-treatment-2679715-2025-02-13",
      "headline": "Singer-composer Vishal Dadlani meets with an accident, undergoes treatmentVishal Dadlani of the Vishal-Sheykhar duo is undergoing treatment after an accident, leading to the postponement of their upcoming concert scheduled for March 2."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/maha-kumbh-has-become-mrityu-kumbh-mamata-banerjees-big-attack-on-yogi-government-2681772-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Maha Kumbh has turned 'mrityu kumbh': Mamata Banerjee attacks Yogi governmentMamata Banerjee slammed UP Chief Minister Yogi Adityanath over the conduct of Mahakumbh in Prayagraj, calling it 'Mrityu Kumbh' over recent stampede deaths."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-ranveer-allahbadia-relief-arrest-fir-obscene-jokes-case-indias-got-latent-passport-strong-remarks-2681645-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Supreme Court shields Ranveer Allahbadia from arrest, says no shows for nowThe Supreme Court granted relief to YouTuber Ranveer Allahbadia from being arrested over his obscene joke on 'India's Got Latent' show, but rapped him over his remarks, saying his \"perverted mind made the entire society feel ashamed\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/russia-ukraine-war-vladimir-putin-ready-to-talk-zelenskyy-kremlin-trump-2681771-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Putin ready to talk to Zelenskyy 'if necessary', says KremlinKremlin spokesperson Dmitry Peskov stated that on the issue of Ukraine war, Putin was ready to negotiate with Zelenskyy, if necessary."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-dissent-note-midnight-decision-modi-amit-shah-appoint-chief-election-commissioner-2681715-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Disrespectful: Rahul Gandhi's dissent on 'midnight' move to pick poll body chiefRahul Gandhi, who was part of the panel to pick the chief election commissioner, said the government's hasty move was disrespectful and discourteous."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/h-1b-visa-backlash-look-at-other-us-work-visa-options-l-1-h-2a-h-2b-h-3-immigration-trump-regulations-2681265-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Amid H-1B visa backlash, a look at other US work visa optionsThe H-1B visa remains the most popular choice among American work visas for Indians. However, the H-1B visa system is facing scrutiny after Donald Trump's return as the US President. Here are the lesser-known work visa categories, like H-2A, H-2B, H-3, L, O, P, Q, and R visas, that offer opportunities to work in the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-notice-centre-view-regulating-obscene-content-youtube-misuse-ranveer-allahbadia-2681689-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Need to do something: Top court notice to Centre over obscene content on YouTubeNoting that YouTubers were misusing the lack of regulation of obscene content on YouTube, the Supreme Court issued notice to Centre and called for regulation of vulgar content amid Ranveer Allahbadia's 'India's Got Latent' row."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/odisha-kiit-nepali-student-suicide-viral-video-suspends-hostel-officials-comments-protest-row-2681673-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Nepal student suicide row: Odisha university suspends 3 staffers for commentsPrakriti Lamsal, a BTech student, was found dead in her hostel room at KIIT on Sunday, triggering protests by the over 500 Nepali students on the campus. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/telangana/story/telangana-government-eases-work-hours-for-muslim-employees-during-ramzan-bjp-calls-it-appeasement-2681730-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Telangana eases work hours for Muslims during Ramzan, BJP slams 'appeasement'The Telangana government's move to allow Muslim employees leave early during Ramzan has sparked controversy, with BJP leaders accusing the government of appeasement politics and calling for equal treatment for all religious groups."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/what-ranveer-allahbadia-did-after-making-crass-joke-audience-member-reveals-2681751-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "What did Ranveer Allahbadia do after making crass joke? 'Audience member' revealsIn a now-viral video, a Mumbai-based man, who claimed to be a member of the audience present during the shoot of the particular episode of the show, revealed what Ranveer Allahbadia did after he made the crass joke. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-ukraine-rare-earth-minerals-zelenskyy-ukraine-war-vladimir-putin-russia-peace-negotiations-2681622-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump's $500 billion Ukraine payback exceeds German war reparations: ReportThe US has offered a USD 500 billion deal for war-hit Ukraine, allowing it to have exclusive access to the European country's rare earth minerals, oil and gas production, and its ports and other-related infrastructure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/seven-coimbatore-college-students-arrested-for-sexually-assaulting-minor-opposition-slam-dmk-2681736-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "7 Tamil Nadu students arrested for minor's sexual assault, Opposition slams DMKSeven college students in Tamil Nadu's Coimbatore were arrested under Pocso Act for sexually assaulting a 17-year-old girl. Opposition, including AIADMK and BJP, slammed the ruling DMK for the deteriorating law and order in the state."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/global/story/saudi-arabia-hosts-us-russia-talks-no-seat-for-ukraine-2681712-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US, Russia begin talks to end Ukraine war, Zelenskyy watches from afarDelegations led by US Secretary of State Marco Rubio and Russian Foreign Minister Sergey Lavrov met in Riyadh. The meeting marks another pivotal step by the Trump administration to reverse US policy on isolating Russia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/when-shah-rukh-khan-opened-up-about-his-sexuality-2681737-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "When SRK opened up about his sexuality: I'm sensitive, so that makes me effeminate?Superstar Shah Rukh Khan once opened up about his sexuality and said that he is neither gay nor bisexual. The actor called himself sensitive and elaborated on the oft-asked invasive question. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-india-family-travel-dubai-matches-2681723-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "BCCI allows families to attend one match in Dubai, prior permission neededThe Indian cricket board has allowed families and partners of cricketers to watch one match of the Champions Trophy 2025. However, the players will need to inform the BCCI and seek permission from them prior to the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indias-got-latent-row-supreme-court-to-hear-ranveer-allahbadias-plea-today-2681583-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Vomited dirt in his mind: Supreme Court roasts Ranveer Allahbadia over jokeThe Supreme Court pulled up Ranveer Allahbadia while hearing his plea over FIRs filed against him in connection with the row over an obscene joke on India Got Latent show. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/hyderabad/story/police-arrest-two-telangana-students-for-high-speed-stunts-on-hyderabad-outer-ring-road-2681657-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Two students use Fortuner, BMW to do 'donuts' on Hyderabad road, arrestedThe police arrested two students for performing reckless stunts in a BMW SUV and a Toyota Fortuner on Hyderabad's Outer Ring Road. The two were taken into custody after CCTV footage helped the police track them down. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/the-growing-craze-for-mahurat-deliveries-in-india-2681549-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Born at the 'right' time: The growing craze for Mahurat Deliveries in IndiaMahurat delivery craze in India: More and more people are opting for Mahurat Deliveries, believing that in an uncertain world, they can influence their baby's fate and ensure an 'auspicious', 'blessed' future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bihar-men-maha-kumbh-boat-ride-video-viral-beat-traffic-spend-rs-20000-journey-cost-2681722-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Watch: Bihar men take boat ride to Maha Kumbh to beat traffic. They spent...The group set out for their pilgrimage from Bihar's Buxar after witnessing the overwhelming traffic on roads and overcrowding on trains from February 8-9. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-begins-hiring-in-india-planning-entry-ev-carmaker-after-pm-modi-recent-us-trip-elon-musk-2681581-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Tesla hints at India entry with jobs post days after PM Modi meets Elon MuskTesla has begun hiring in India and has posted several job openings. This comes shortly after Tesla CEO Elon Musk met with Prime Minister Narendra Modi during his recent visit to the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/bhool-chuk-maaf-rajkummar-rao-returns-to-entertain-on-loop-with-his-desi-swag-2681716-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bhool Chuk Maaf: Rajkummar Rao returns to entertain on loop with his Desi swagActors Rajkummar Rao and Wamiqa Gabbi appear in a romantic comedy, titled 'Bhool Chuk Maaf', exploring a 'time loop' theme. The makers released the teaser of the film on Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-history-all-editions-mini-world-cup-journey-champions-list-2681700-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Champions Trophy history: 8 editions, 7 champions in Mini World Cup's wild journeyChampions Trophy 2025: No other tournament in cricket history has faced as many threats of being scrapped, but the Champions Trophy has survived multiple deliberations to return to the ICC calendar after an eight-year gap -- the longest between two editions of the ODI tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/teslas-first-india-dealership-to-come-up-in-mumbai-company-scouting-for-store-manager-others-2681709-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Tesla's first India dealership to come up in Mumbai? Company scouting for store manager, othersThe government announced a new EV policy in March 2024 to smoothen the entry of global carmakers, including Tesla, into India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/female-constable-manages-crowd-at-railway-station-while-carrying-baby-viral-video-2681640-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Watch: Woman constable manages crowd at Delhi railway station while carrying babyA video of a woman constable managing a crowd at a railway station in New Delhi while carrying her baby with her went viral on social media. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/ranveer-allahbadia-vulgar-joke-case-supreme-court-top-quotes-2681641-2025-02-18?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Perverted mind, dirty': Supreme Court talks tough on Ranveer Allahbadia caseThe Supreme Court, however, granted YouTuber Ranveer Allahbadia protection from arrest and directed him to cooperate in the investigation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/taapsee-pannu-in-subhash-ghai-aitraaz-2-here-is-what-we-know-exclusive-2681773-2025-02-18",
      "headline": "Exclusive: Taapsee Pannu in Subhash Ghai's Aitraaz 2? Here's what we knowActor Taapsee Pannu might have just agreed to lead 'Aitraaz 2', which is being produced by Subhash Ghai and directed by Amit Rai of 'OMG 2' fame. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/actor-amrita-singh-buys-rs-18-crore-luxury-apartment-in-juhu-2681775-2025-02-18",
      "headline": "Actor Amrita Singh buys luxury apartment worth Rs 18 crore in JuhuBollywood icon Amrita Singh has purchased a premium residential property in Mumbai's elite Juhu area, worth Rs 18 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/salman-khan-sikandar-new-poster-out-2681748-2025-02-18",
      "headline": "Salman Khan's eyes do the talking in new Sikandar posterSalman Khan's Sikandar releases on Eid 2025. The film's shoot is completed, and a new poster has fans excited. Directed by AR Murugadoss, it also stars Rashmika Mandanna and Kajal Aggarwal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/producer-skn-we-love-female-actors-who-dont-know-telugu-remark-sparks-debate-2681743-2025-02-18",
      "headline": "Producer SKN's 'we love female actors who don't know Telugu' remark sparks debateProducer SKN's statement about women actors who don't know Telugu triggered an intense online debate, with many fans speculating it was a veiled reference to Vaishnavi Chaitanya."
    }
  ],
  "sports": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-bcci-tax-exemption-case-bombay-hight-court-2681754-2025-02-18",
      "headline": "Bombay High Court rules in favour of BCCI in Tax Exemption CaseThe Bombay High Court has quashed an Income Tax Department advisory questioning BCCI's tax-exempt status, ruling that any decision regarding its exemption must follow due statutory process rather than relying on non-statutory communication from tax authorities."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-india-family-travel-dubai-matches-2681723-2025-02-18",
      "headline": "BCCI allows families to attend one match in Dubai, prior permission neededThe Indian cricket board has allowed families and partners of cricketers to watch one match of the Champions Trophy 2025. However, the players will need to inform the BCCI and seek permission from them prior to the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-laliga-barcelona-vs-rayo-controversy-penalty-var-2681703-2025-02-18",
      "headline": "Flick defends VAR after Barcelona return to top of LaLiga with controversial winFC Barcelona regained the lead in LaLiga with a controversial 1-0 win over Rayo Vallecano. Barcelona coach reacted to a contensious decision by VAR which helped Barcelona sneak a win and wipe out their point-difference against bitter rivals Real Madrid."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-history-all-editions-mini-world-cup-journey-champions-list-2681700-2025-02-18",
      "headline": "Champions Trophy history: 8 editions, 7 champions in Mini World Cup's wild journeyChampions Trophy 2025: No other tournament in cricket history has faced as many threats of being scrapped, but the Champions Trophy has survived multiple deliberations to return to the ICC calendar after an eight-year gap -- the longest between two editions of the ODI tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/neeraj-chopra-javelin-groin-injury-jan-zelezney-2681679-2025-02-18",
      "headline": "Mission 90m is on: Neeraj Chopra on how legend Zelezny is moulding his techniqueDouble Olympic medallist Neeraj Chopra is working with his new coach Jan Zelezny. The legendary former javelin star has been working on correcting Neeraj's technique post the Paris Olympics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-new-zealand-lockie-ferguson-ruled-out-kyle-jamieson-replacement-2681674-2025-02-18",
      "headline": "Champions Trophy: New Zealand name Jamieson as Lockie Ferguson's replacementChampions Trophy 2025: New Zealand suffered another setback as Lockie Ferguson was ruled out of the Champions Trophy due to injury, with Kyle Jamieson named as his replacement. The Black Caps now await further updates on Rachin Ravindra's fitness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-rohit-sharma-icc-tournaments-photoshoot-ravindra-jadeja-shubman-gill-2681658-2025-02-18",
      "headline": "Watch: Rohit featured in his 17th ICC photoshoot, wows Jadeja and GillIndia captain Rohit Sharma stunned teammates Ravindra Jadeja and Shubman Gill as he recalled his 17 ICC tournament appearances ahead of the Champions Trophy, highlighting his immense experience and impressive record in global events."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-morne-morkel-father-death-2681626-2025-02-18",
      "headline": "India bowling coach Morne Morkel returns home due to family emergencyChampions Trophy: India bowling coach Morne Morkel has rushed out of Dubai due to a family emergency. Morkel left for South Africa after his father Albert passed away. Morkel was expected to play a crucial part in guiding India's bowling attack in the absence of Jasprit Bumrah."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-bid-olympics-2036-commonwealth-games-2681615-2025-02-18",
      "headline": "Hosting CWG would be a stepping stone for India's Olympic Dream: CGF CEO SadlierCommonwealth Games Federation CEO Katie Sadleir has said that hosting the CWG 2030 would be the right step in India's hope of hosting the Olympics. India have formally submitted the bid for the 2036 Games and hope to host the event across multiple cities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-rohit-sharma-virat-kohli-relax-nets-session-mohammed-shami-autographs-2681607-2025-02-18",
      "headline": "Watch: Rohit, Kohli relax after nets, Shami signs autographs for fansIndia skipper Rohit Sharma and Virat Kohli were spotted unwinding after a training session in Dubai ahead of the Champions Trophy, while pacer Mohammed Shami delighted fans by taking time to sign autographs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/manu-bhaker-sportswoman-of-the-year-mary-kom-presents-award-2681595-2025-02-18",
      "headline": "Mary Kom presents Manu Bhaker with BBC Sportswoman of the year awardIndian boxing legend Mary Kom presented the BBC Indian Sportswoman of the Year award to Paris Olympics shooting sensation Manu Bhaker on February 17, honouring her remarkable achievements, including two historic bronze medals at the Games, solidifying her legacy in Indian sports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-rohit-sharma-icc-tournaments-photoshoot-ravindra-jadeja-shubman-gill-2681658-2025-02-18",
      "headline": "Watch: Rohit featured in his 17th ICC photoshoot, wows Jadeja and GillIndia captain Rohit Sharma stunned teammates Ravindra Jadeja and Shubman Gill as he recalled his 17 ICC tournament appearances ahead of the Champions Trophy, highlighting his immense experience and impressive record in global events."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-morne-morkel-father-death-2681626-2025-02-18",
      "headline": "India bowling coach Morne Morkel returns home due to family emergencyChampions Trophy: India bowling coach Morne Morkel has rushed out of Dubai due to a family emergency. Morkel left for South Africa after his father Albert passed away. Morkel was expected to play a crucial part in guiding India's bowling attack in the absence of Jasprit Bumrah."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-bid-olympics-2036-commonwealth-games-2681615-2025-02-18",
      "headline": "Hosting CWG would be a stepping stone for India's Olympic Dream: CGF CEO SadlierCommonwealth Games Federation CEO Katie Sadleir has said that hosting the CWG 2030 would be the right step in India's hope of hosting the Olympics. India have formally submitted the bid for the 2036 Games and hope to host the event across multiple cities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-rohit-sharma-virat-kohli-relax-nets-session-mohammed-shami-autographs-2681607-2025-02-18",
      "headline": "Watch: Rohit, Kohli relax after nets, Shami signs autographs for fansIndia skipper Rohit Sharma and Virat Kohli were spotted unwinding after a training session in Dubai ahead of the Champions Trophy, while pacer Mohammed Shami delighted fans by taking time to sign autographs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/manu-bhaker-sportswoman-of-the-year-mary-kom-presents-award-2681595-2025-02-18",
      "headline": "Mary Kom presents Manu Bhaker with BBC Sportswoman of the year awardIndian boxing legend Mary Kom presented the BBC Indian Sportswoman of the Year award to Paris Olympics shooting sensation Manu Bhaker on February 17, honouring her remarkable achievements, including two historic bronze medals at the Games, solidifying her legacy in Indian sports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-virat-kohli-perform-like-champion-childhood-coach-batting-from-2681572-2025-02-18",
      "headline": "Virat Kohli will perform like a champion: Childhood coach backs India starChampions Trophy: Virat Kohli's childhood coach, Rajkumar Sharma, has dismissed concerns over the star batter's form, backing him to deliver a \"champion\" performance in the upcoming Champions Trophy despite recent struggles in international cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/novak-djokovic-jannik-sinner-doping-ban-favouritism-2681556-2025-02-18",
      "headline": "Novak Djokovic calls out 'favouritism' shown in Jannik Sinner doping banNovak Djokovic slammed WADA for showing \"favouritism\" in Jannik Sinner's doping case, criticising the lenient three-month ban that allows the World No.1 to compete in Grand Slams, calling it unfair treatment compared to other doping cases."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-shubman-gill-india-vice-captain-mvp-opening-batter-2681554-2025-02-18",
      "headline": "Why vice-captain Shubman Gill will be India's MVP in Champions TrophyVice-captain Shubman Gill has stepped up in ODIs for India in a big way in the past few years and could prove to be India's MVP during the upcoming Champions Trophy in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/manu-bhaker-bbc-sportswoman-of-the-year-paris-olympics-khel-ratna-2681548-2025-02-18",
      "headline": "Manu Bhaker named BBC Sportswoman of the YearManu Bhaker, India's shooting sensation, won the BBC Indian Sportswoman of the Year after securing two historic bronze medals at the Paris Olympics, becoming the first Indian female shooter to achieve multiple Olympic podium finishes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-suresh-raina-reveals-indias-masterstroke-to-win-champions-trophy-2013-2681529-2025-02-18",
      "headline": "Raina reveals masterstroke which helped India win Champions Trophy 2013Former India cricketer Suresh Raina revealed India's masterstroke which helped them emerge victorious in the ICC Champions Trophy 2013 under the leadership of MS Dhoni."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-smriti-mandhana-danni-wyatt-hodge-wpl-2025-rcb-w-vs-dc-w-2681497-2025-02-17",
      "headline": "Captain, star batter, and now coach: Smriti Mandhana juggles roles in WPL 2025Royal Challengers Bengaluru women opener Danielle Wyatt Hodge credited her captain Smriti Mandhana for coaching her during their match winning century partnership against Delhi Capitals (DC-W) in Women's Premier League. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/cricket-rajesh-kannur-indias-homeless-cricket-hero-interview-2681474-2025-02-17",
      "headline": "Rajesh Kannur: India's homeless cricket hero dreams of a better futureRajesh Kannur, who won the Player of the Tournament award after India's triumph in the Physical Disability Champions Trophy in Sri Lanka earlier this year, spoke to India Today, calling for support. The cricketer has battled against the odds to pursue his passion and dreams of building a home for his family in a better future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-rcb-vs-delhi-capitals-score-smriti-mandhana-points-table-2681459-2025-02-17",
      "headline": "Fiery Smriti Mandhana and bowlers help RCB hammer DC, top table earlyWPL 2025, RCB vs DC: Smriti Mandhana smashed a 47-ball 81 as Royal Challengers Bengaluru chased 142 in just 16.2 overs. With two wins in as many matches, RCB are on top of the points table early in the season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-suresh-raina-reveals-indias-masterstroke-to-win-champions-trophy-2013-2681529-2025-02-18",
      "headline": "Raina reveals masterstroke which helped India win Champions Trophy 2013Former India cricketer Suresh Raina revealed India's masterstroke which helped them emerge victorious in the ICC Champions Trophy 2013 under the leadership of MS Dhoni."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-smriti-mandhana-danni-wyatt-hodge-wpl-2025-rcb-w-vs-dc-w-2681497-2025-02-17",
      "headline": "Captain, star batter, and now coach: Smriti Mandhana juggles roles in WPL 2025Royal Challengers Bengaluru women opener Danielle Wyatt Hodge credited her captain Smriti Mandhana for coaching her during their match winning century partnership against Delhi Capitals (DC-W) in Women's Premier League. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/cricket-rajesh-kannur-indias-homeless-cricket-hero-interview-2681474-2025-02-17",
      "headline": "Rajesh Kannur: India's homeless cricket hero dreams of a better futureRajesh Kannur, who won the Player of the Tournament award after India's triumph in the Physical Disability Champions Trophy in Sri Lanka earlier this year, spoke to India Today, calling for support. The cricketer has battled against the odds to pursue his passion and dreams of building a home for his family in a better future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-rcb-vs-delhi-capitals-score-smriti-mandhana-points-table-2681459-2025-02-17",
      "headline": "Fiery Smriti Mandhana and bowlers help RCB hammer DC, top table earlyWPL 2025, RCB vs DC: Smriti Mandhana smashed a 47-ball 81 as Royal Challengers Bengaluru chased 142 in just 16.2 overs. With two wins in as many matches, RCB are on top of the points table early in the season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-afghanistan-mohammad-nabi-odi-retirement-son-hassan-eisakhil-2681450-2025-02-17",
      "headline": "40-year-old Afghan star dreams of playing with son, hints at extending career Champions Trophy 2025: Mohammad Nabi, who had announced last year that he would retire from ODIs after the tournament, has now hinted at extending his 50-over career. Nabi revealed that his dream is to play for Afghanistan alongside his 18-year-old son, Hassan Eisakhil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-first-glimpse-of-indias-jersey-out-features-pakistan-name-2681449-2025-02-17",
      "headline": "First glimpse of India's Champions Trophy jersey, features 'Pakistan' imprintThe Indian cricket team unveiled their new jersey for the ICC Champions Trophy 2025 which interestingly has the hosts' Pakistan name printed on it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-exclusive-himani-mor-marriage-love-story-2681441-2025-02-17",
      "headline": "From casual chats to lifelong vows: Neeraj Chopra recalls love story with HimaniSpeaking to India Today, Neeraj Chopra opened up about his love story with wife Himani Mor. Neeraj tied the knot with Himani, a former tennis player, in an intimate ceremony in Shimla in January. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/video/neeraj-chopra-interview-marriage-himani-mor-90m-dream-arshad-nadeem-2681427-2025-02-17",
      "headline": "Neeraj Chopra Exclusive: Marriage, 90m dream and Arshad Nadeem rivalrySpeaking to India Today's Nikhil Naz, javelin star Neeraj Chopra opened up about his marriage, the 90m dream and his growing rivalry with Arshad Nadeem. Neeraj also spoke about the partnership with his new coach Jan Zelezny."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-pcb-chief-mohsin-naqvi-sells-vip-tickets-for-pcb-funds-ind-vs-pak-2681417-2025-02-17",
      "headline": "Champions Trophy: Pakistan cricket chief sells Rs 94 lakh VIP tickets for PCB fundsPakistan Cricket Board (PCB) Chairman Mohsin Naqvi has sold his hospitality box at Dubai International Cricket Stadium to collect money for the board's funds. He will be watching the India vs Pakistan game from normal stands."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-rcb-vs-dc-niki-prasad-dropped-five-overseas-players-delhi-2681407-2025-02-17",
      "headline": "'No surprise' as Delhi drop U19 captain Niki Prasad, field 5 overseas playersWPL 2025, RCB vs DC: Delhi Capitals dropped India U19 World Cup-winning captain Niki Prasad for the second game of the tournament. Nikki won the Player of the Match award in her WPL debut against Mumbai Indians on Saturday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-kane-williamson-to-make-his-debut-in-the-hundred-for-london-spirit-2681397-2025-02-17",
      "headline": "Kane Williamson to make his debut in The Hundred, set to lead London SpiritStar New Zealand batter Kane Williamson is all set to make his debut in the Hundred as he will be seen leading London Spirit in the upcoming season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-bangladesh-shakib-al-hasan-shanto-mahmudullah-2681190-2025-02-17",
      "headline": "Spirited Bangladesh face uphill task without Shakib Al HasanChampions Trophy 2025: Bangladesh are without their premier all-rounder Shakib Al Hasan, but skipper Najmul Hossain Shanto said that the Tigers would be playing with the goal of winning the title. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-rohit-sharma-way-better-than-virat-kohli-and-babar-abdur-rauf-khan-2681355-2025-02-17",
      "headline": "Rohit Sharma is way better than Virat Kohli and Babar: Former Pakistan bowlerFormer Pakistan bowler Abdur Rauf Khan has called India captain Rohit Sharma way better player than his teammate Virat Kohli and Pakistan star Babar Azam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-pcb-issues-clarification-on-indian-flag-controversy-in-karachi-2681329-2025-02-17",
      "headline": "Champions Trophy: Pakistan clarify Indian flag controversy after backlashThe Pakistan Cricket Board (PCB) has issued a clarification after India flag wasn't hoisted along with other nations on the the roof of the National Stadium in Karachi ahead of the ICC Champions Trophy 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-australian-arrive-in-pakistan-searching-for-1st-win-since-2009-2681299-2025-02-17",
      "headline": "Australia arrive in Pakistan searching for 1st win in Champions Trophy since 2009The Australian Cricket team landed in Pakistan for the upcoming ICC Champions Trophy 2025. They will begin their campaign on February 22 in England. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}