{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/aye-finance-ipo-opens-should-you-subscribe-check-gmp-and-other-details-2865600-2026-02-09",
      "headline": "Aye Finance IPO opens: Should you subscribe? Check GMP and other detailsFounded in 1993, Aye Finance is an NBFC that provides secured and unsecured loans to micro and small businesses. Its products include working capital loans, mortgage-backed loans and property-based financing for businesses in manufacturing, trading and services."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/fractal-analytics-ipo-opens-today-check-price-band-gmp-and-key-details-2865564-2026-02-09",
      "headline": "Fractal Analytics IPO opens today: Check price band, GMP and key detailsThe latest grey market premium for Fractal Analytics IPO stands at Rs 17, suggesting an estimated listing price of around Rs 917 and a possible gain of about 1.9% per share."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/closing-bell-sensex-ends-485-points-higher-nifty-above-25800-sbi-jumps-8-percent-2865436-2026-02-09",
      "headline": "Sensex ends 485 points higher, Nifty above 25,800; SBI jumps 8%The S&P BSE Sensex added 485.35 points to end at 84,065.75, while the NSE Nifty50 gained 173.50 points to close at 25,867.30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/who-settles-insurance-claims-fastest-2026-irdai-claim-settlement-ratio-life-insurers-2865430-2026-02-09",
      "headline": "Who settles insurance claims fastest in 2026? Check if your insurer is in top 10Many people buy insurance to make sure their family is financially safe if something unexpected happens. But buying a policy is only one part of the decision. The bigger question is whether the insurer will actually pay the claim on time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/draft-income-tax-rules-2026-and-new-forms-out-what-changes-for-taxpayers-2865383-2026-02-09",
      "headline": "Draft Income-tax Rules 2026 and new forms out: What changes for taxpayers?The drafts have been opened for public comments for 15 days, until February 22, 2026. The tax department has invited taxpayers, professionals and industry bodies to review the proposals and share feedback, saying the aim is to make the rule-making process more participative and practical."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-gdp-to-grow-64-percent-in-fy27-fastest-among-g20-nations-moodys-2865355-2026-02-09",
      "headline": "India's GDP to grow 6.4% in FY27, fastest among G-20 nations: Moody'sThe global rating agency said steady economic growth will create a solid base for financial stability and support credit demand across sectors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-rises-rs-3000-silver-up-rs-13000-will-prices-go-up-further-2865319-2026-02-09",
      "headline": "Gold rises Rs 3,000, silver up Rs 13,000: Will prices go up further?A sudden spike in gold and silver prices has put bullion back in the spotlight. The rally has shifted focus to the next big question: are prices set to rise even further?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/think-budget-2026-ignored-the-middle-class-heres-what-you-missed-2864201-2026-02-09",
      "headline": "Think the middle class got nothing in Budget 2026? Here are the hidden gainsMany middle-class taxpayers finished listening to Budget 2026 with a sense of disappointment. No big announcements, no instant tax relief. But look closer, and the Budget reveals a series of quieter reforms that could meaningfully ease everyday financial pressures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/why-is-stock-market-rising-today-reasons-sensex-nifty-jump-fii-return-sbi-share-rise-india-us-trade-deal-2865276-2026-02-09",
      "headline": "Sensex jumps 500 points: 3 reasons why stock market is rising todayThe S&P BSE Sensex was trading 491.04 points higher at 84,071.44, while the NSE Nifty50 gained 168.40 points to trade at 25,862.10. The rise came after a mix of positive global cues, strong buying by foreign investors, and sharp gains in PSU banking stocks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sbi-share-price-jumps-6-percent-hits-52-week-high-q3-results-brokerage-views-2865246-2026-02-09",
      "headline": "SBI share price jumps 7% to hit 52-week high. Here's why and if you should buySBI shares have been on a steady rise over the past year. The stock has gained 7.54% in the last five trading sessions and 13.04% over the past one month. Over six months, the shares are up 37.35%, while the one-year gain stands at 53.50%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-norway-turned-oil-into-a-2-trillion-fund-that-may-never-run-out-2865217-2026-02-09",
      "headline": "How Norway turned oil into a $2 trillion fund that may never run outNorway is more often known as one of the happiest countries in the world which has the best Northern Lights, not as a financial powerhouse. Yet behind this image of calm and comfort sits one of the most powerful financial institutions on the planet. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/opening-bell-sensex-opens-400-points-higher-nifty-above-25800-sbi-gains-it-ril-up-2865209-2026-02-09",
      "headline": "Sensex opens 400 points higher, Nifty above 25,800; SBI gains 6%The S&P BSE Sensex was up 377.94 points to 83,958.34, while the NSE Nifty50 gained 119.10 points to 25,812.80 as of 9:55 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/digital-shift-uae-real-estate-what-it-means-for-investors-2865159-2026-02-09",
      "headline": "How is the digital shift changing UAE real estate for investors?Investor decisions are now increasingly shaped upstream through digital discovery, data-led targeting, and algorithmic visibility well before a site visit or broker engagement occurs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/mutual-fund-portfolio-strategy-after-budget-trade-deals-volatility-silver-gold-etf-sgbs-2864926-2026-02-08",
      "headline": "Are mutual funds really the best place to invest your money right now?Headlines on the India–US trade deal, India–EU FTA, Budget 2026, swings in gold and silver and a sudden sell-off in IT stocks have followed one another in quick succession, and when so much unfolds at once, many investors end up reacting to every market move."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-today-exclusive-piyush-goyal-india-open-agriculture-dairy-sectors-us-bilateral-trade-deal-2864754-2026-02-07",
      "headline": "India agreed to open agriculture, dairy sectors to US players? Piyush Goyal answersEarlier, Piyush Goyal shared the details of the deal that followed a framework interim trade agreement between the two countries, aimed at boosting exports, jobs and market access. The trade deal will formally be signed in March."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-bilateral-trade-agreement-reduced-18-per-cent-us-tariffs-on-india-effective-all-about-it-2864659-2026-02-07",
      "headline": "Reduced US tariffs of 18% on India come into effect. What it meansThe agreement will reduce US reciprocal duties on Indian exports to 18 per cent, while scrapping tariffs entirely on items such as generic medicines, gems and diamonds, and aircraft components—opening up stronger export prospects across several key sectors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-us-trade-deal-bilateral-framework-boost-exports-safeguard-interest-farmers-piyush-goyal-2864639-2026-02-07",
      "headline": "India-US trade deal to boost exports, safeguard farmers' interests: Piyush GoyalUnion Commerce and Industry Minister Piyush Goyal said the India-US interim trade framework is a historic step toward achieving USD 500 billion in bilateral trade. He announced that reciprocal tariffs on Indian exports to the US will fall sharply from 50% to 18%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-deal-poses-no-threat-to-farmers-msmes-piyush-goyal-rebuts-criticism-2864611-2026-02-07",
      "headline": "Protection of farmers' interest in US deal surprised some: Govt's dig at OppositionPiyush Goyal dismissed criticism that the India-US trade deal would harm farmers and small producers, asserting that the interim framework fully safeguards their interests. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/diamonds-pharma-items-smartphone-parts-to-face-zero-tariffs-piyush-goyal-on-india-us-trade-deal-2864608-2026-02-07",
      "headline": "How India flipped the agri script on Trump? Piyush Goyal revealsUnion Minister Piyush Goyal stressed that India maintained its red lines on agriculture and dairy in its trade deal with the US, while opening its market selectively for certain items like wines and spirits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/worlds-top-10-richest-donate-half-their-wealth-what-happens-global-poverty-healthcare-2864330-2026-02-07",
      "headline": "What happens if the world's 10 richest people donate half their wealth?A trillion dollars from the world's richest may feel impossible, but pledges like Vedanta chairman Anil Agarwal's prove that big commitments are possible. Imagine what happens if the top ten step forward."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/siddharth-anand-keen-return-romance-genre-storytelling-over-scale-2865627-2026-02-09",
      "headline": "Siddharth Anand keen to return to romance: I want to do it all Director Siddharth Anand, known for his recent action blockbusters, has revealed his intention to return to romantic films, stating that his creative choices are driven by compelling stories rather than size or genre."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shanaya-kapoor-on-social-media-judgement-put-your-head-down-keep-doing-the-work-2865632-2026-02-09",
      "headline": "Shanaya Kapoor on social media judgement: Put your head down, keep doing the work Shanaya Kapoor said she doesn't see her Bollywood journey as a struggle for survival, choosing instead to focus on improving her craft and enjoying the process."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/adarsh-gourav-i-never-became-an-actor-to-become-a-movie-star-2865611-2026-02-09",
      "headline": "Adarsh Gourav on stardom: I never became an actor to be a movie star Adarsh Gourav spoke to India Today about his views on stardom and how he hopes to reach a wider audience. He reflected on his aim to use his influence to support experimental scripts and unconventional stories that lack production backing."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/biju-menon-skipped-drishyam-directors-film-promotion-rs-25-lakh-loss-unnikrishnan-2865612-2026-02-09",
      "headline": "Biju Menon skipped Drishyam director's film promotion, Rs 25 lakh loss: Unnikrishnan  The FEFKA general secretary B Unnikrishnan alleges the actor's absence from promotional events caused a producer a Rs 25 lakh loss."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/is-suriya-set-to-collaborate-with-another-telugu-director-heres-what-we-know-2865565-2026-02-09",
      "headline": "Is Suriya set to collaborate with another Telugu director? Here's what we know Suriya, who is currently juggling multiple projects, has reportedly responded positively to director Parasuram's first narration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/pankaj-tripathi-seeks-meaningful-cinema-after-a-year-long-creative-break-2865547-2026-02-09",
      "headline": "Pankaj Tripathi seeks meaningful cinema after a year-long creative break After a yearlong hiatus to combat creative fatigue, Pankaj Tripathi has revealed a shift in his cinematic priorities. The actor is now seeking projects that balance entertainment with depth, choosing roles that offer artistic satisfaction and meaningful storytelling over mere survival in the film industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/vishal-dadlani-advises-aspiring-singers-avoid-shortcuts-rely-talent-success-2865594-2026-02-09",
      "headline": "Vishal Dadlani's stern warning to aspiring singers: Don't get some mantri to call me Vishal Dadlani issued a warning to new artists not to use influential intermediaries to approach him. He called for talent, hard work, and self-belief as the path to success in music."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nick-jonas-dedicates-song-princesses-to-daughter-malti-marie-2865601-2026-02-09",
      "headline": "Nick Jonas dedicates song Princesses to daughter Malti Marie: That's how I see her Nick Jonas shared that his emotional song Princesses was inspired by his daughter Malti Marie, explaining that it reflects the way he sees her and her world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/lahore-1947-aamir-khan-productions-release-independence-day-week-2026-2865582-2026-02-09",
      "headline": "Aamir Khan, Sunny Deol's Lahore 1947 to release on Independence Day 2026 Aamir Khan Productions has confirmed that its period drama Lahore 1947 will be released in theatres on August 13, 2026, aligning with the Independence Day week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-arirang-album-2026-release-diplo-collaboration-global-world-tour-2865569-2026-02-09",
      "headline": "Diplo breaks silence on BTS collaboration, calls ARIRANG their boldest album yet Grammy-winning music producer Diplo offers rare insight into BTS's new album Arirang, teasing its sound and why it could surprise fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/lucky-ali-looks-back-on-his-30-year-musical-journey-2865578-2026-02-09",
      "headline": "Don't think I deserve this: Lucky Ali looks back on his 30-year musical journey Lucky Ali reflected on his 30-year journey in music, saying the love and success he received over the decades felt like a gift he didn't deserve."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jana-nayagan-producer-files-plea-to-withdraw-case-against-censor-board-amid-row-2865567-2026-02-09",
      "headline": "Jana Nayagan maker to withdraw case amid censor row, hearing on February 10 Jana Nayagan producer has filed plea to withdraw the case against Central Borad of Film Certification amid row. The film features Vijay in the lead role."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranveer-singh-admires-deepika-padukone-stylish-gown-fans-excited-2865511-2026-02-09",
      "headline": "Deepika Padukone's all-black look leaves Ranveer Singh swooning: Oh Mamma Deepika Padukone's all-black look sparked a viral reaction from Ranveer Singh, and fans can't get enough of the moment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prithviraj-sukumaran-villain-role-in-ss-rajamouli-varanasi-challenged-him-2865530-2026-02-09",
      "headline": "Prithviraj Sukumaran explains why playing the villain in Varanasi was complex In a recent promotional event of his upcoming film Varanasi, Prithviraj Sukumaran spoke about his role as the antagonist in the film. Varanasi is set to release in theatres on April 7, 2027."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/suriya-mounam-pesiyadhe-re-release-tamil-romantic-drama-valentines-day-2865477-2026-02-09",
      "headline": "Valentine's Day re-release: Suriya's Mounam Pesiyadhe in theatres after 24 years Suriya's romantic drama Mounam Pesiyadhe is set for a theatrical re-release after 24 years. The film's return coincides with Valentine's Day, promising nostalgic moments for Tamil cinema lovers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/prime-video-bandwaale-hindi-series-premiere-february-13-2865484-2026-02-09",
      "headline": "Zahan Kapoor, Shalini Pandey lead Prime Video's Bandwaale. Release date announced Prime Video announced Bandwaale, a Hindi musical dramedy premiering globally on February 13. The series explores youth identity and creativity through music and friendship."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sara-ali-khan-calls-mother-amrita-singh-her-biggest-blessing-in-birthday-post-2865480-2026-02-09",
      "headline": "Sara Ali Khan calls mother Amrita Singh her biggest blessing in birthday post Sara Ali Khan shared a heartfelt birthday note for her mother Amrita Singh, calling her her \"biggest blessing\" and posting adorable family vacation pictures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/asha-sarath-promises-twist-filled-climax-in-mohanlals-drishyam-3-2865479-2026-02-09",
      "headline": "Actor Asha Sarath promises twist-filled climax in Mohanlal's Drishyam 3 Actor Asha Sarath, who returns as IG Geetha Prabhakar in Drishyam 3, says the third instalment will leave audiences stunned as it brings the Georgekutty saga to a close.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/we-really-kiss-a-lot-margot-robbie-on-how-wuthering-heights-differs-from-the-book-2865411-2026-02-09",
      "headline": "We really kiss a lot: Margot Robbie on how Wuthering Heights differs from the book Margot Robbie drew parallels between the intimacy depicted in Emily Bronte's 1847 novel Wuthering Heights and her upcoming film adaptation of the same title. She also opened up on her kissing scenes with Jacob Elordi in the film."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-india-vs-pakistan-pcb-demands-icc-rejects-bangladesh-2865584-2026-02-09",
      "headline": "Pakistan seek bilateral series vs India for boycott U-turn, ICC says no Live updatesT20 World Cup 2026: The International Cricket Council rejected three of the five demands put forward by the Pakistan Cricket Board in return for reversing its decision to boycott the February 15 match against India. Pakistan's demands included the resumption of bilateral series against India and a tri-series involving Bangladesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-norway-turned-oil-into-a-2-trillion-fund-that-may-never-run-out-2865217-2026-02-09",
      "headline": "How Norway turned oil into a $2 trillion fund that may never run outNorway is more often known as one of the happiest countries in the world which has the best Northern Lights, not as a financial powerhouse. Yet behind this image of calm and comfort sits one of the most powerful financial institutions on the planet. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/wont-allow-any-impediments-in-sir-process-supreme-court-warns-states-during-ec-vs-mamata-hearing-2865485-2026-02-09",
      "headline": "Won't allow impediments to SIR, SC warns Bengal, extends deadline by a weekThe remark came after West Bengal Chief Minister filed a petition in the Supreme Court, demanding a slew of changes in the SIR process, including ending WhatsApp use for communication and the removal of micro observers."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/himanta-sarma-has-nothing-to-prove-my-pak-links-gaurav-gogoi-hits-back-2865401-2026-02-09",
      "headline": "Himanta ups 'Pak agent' attack, Gaurav Gogoi hits back, says his kids dragged in tooThe political tension in Assam escalates as Congress leader Gaurav Gogoi accuses Chief Minister Himanta Biswa Sarma of suppressing an SIT report and dragging his family into a political controversy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/bars-and-benches-learning-has-left-the-classroom-to-make-a-pint-pint-of-view-nerd-nite-unlearn-ai-rebellion-2865466-2026-02-09",
      "headline": "Bars and Benches: Learning has left the classroom to make a pintOn weeknights across Indian cities, people are skipping screens and certificates to gather over ideas (and some beer). From bars to cafés, learning is turning social, unscripted and refreshingly human. In this age of AI, is thinking together education's quiet rebellion? Read on to find out. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/student-shoots-classmate-dead-inside-classroom-in-punjabs-tarn-taran-murder-caught-on-cctv-2865343-2026-02-09",
      "headline": "Video: Punjab student shoots classmate dead, was upset over her engagementPolice said Prince Raj shot Sandeep Kaur inside the classroom and then shot himself. The shooting was caught on CCTV camera."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/uttar-pradesh/story/kanpur-businessmans-son-rams-lamborghini-into-pedestrians-vehicles-1-injured-2865195-2026-02-09",
      "headline": "Shivam's lawyer claims driver behind Lamborghini wheels, contradicts crash visualsKanpur Lamborghini Crash: The crash has sparked outrage after police initially filed an FIR without naming the driver, despite viral videos showing Shivam Mishra being pulled from the driver's seat by bouncers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-t20-world-cup-2026-pakistan-india-bangladesh-bcb-chief-lahore-meeting-mohsin-naqvi-pcb-shehbaz-sharif-2865400-2026-02-09",
      "headline": "Rushing to Lahore: Midnight text from Bangladesh cricket chief amid T20 politicsAt 1 am on Saturday, the Bangladesh Cricket Board chief took a flight to rush to Lahore without even his BCB colleagues unaware of the plans. BCB chief Aminul Islam Bulbul reached Pakistan to be at the meeting between the ICC and the Pakistan Cricket Board. Here we analyse why Bulbul took the midnight flight to Lahore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/rouble-nagi-global-teacher-prize-2026-mural-education-india-2865348-2026-02-09",
      "headline": "How meeting one child 27 years ago shaped Rouble Nagi's education missionRouble Nagi, the first Indian woman, won the Global Teacher Prize 2026 for her unique mural-based education. Her work transforms learning for children in remote and low-income communities across India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-police-files-case-over-leak-of-gen-naravane-unapproved-book-four-stars-of-destiny-2865616-2026-02-09",
      "headline": "Delhi Police files case over leak of ex-Army chief's unapproved bookDelhi Police has registered a case over the alleged leak and online circulation of a pre-print PDF of Four Stars of Destiny, the unpublished memoir of former Army chief MM Naravane, which lacks mandatory clearance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/himanta-sarma-inciting-hatred-activists-go-to-supreme-court-over-chief-ministers-now-deleted-shooting-video-2865575-2026-02-09",
      "headline": "Inciting hatred: Activists approach court after Assam CM's deleted shooting videoThe petition flags what it describes as repeated statements targeting the Muslim community and argues that such remarks undermine constitutional values and the duties attached to high public offices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/made-in-india-sarvam-ai-beats-chatgpt-in-3-key-areas-full-story-in-5-points-2865341-2026-02-09",
      "headline": "Made in India Sarvam AI beats ChatGPT in 3 key areas: Full story in 5 pointsIndia's Sarvam AI is emerging as a strong homegrown contender by outperforming ChatGPT and Gemini in key India-focused AI tasks while aligning closely with the government's push for sovereign AI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/general-mm-naravane-memoir-blocked-how-did-rahul-gandhi-get-an-unpublished-book-four-stars-of-destiny-penguin-books-2864643-2026-02-09",
      "headline": "How did Rahul Gandhi get an unpublished book by Gen Naravane?An unpublished book has reached Parliament, and it was by none other than former Army chief General MM Naravane (Retd) who oversaw one of the biggest India-China clashes since 1962. Did the publisher go ahead with printing Gen Naravane's Four Stars of Destiny even before the Defence Ministry approved the manuscript? How did Rahul Gandhi get a copy of the \"unpublished\" book?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/governemnt-to-brief-tharoor-led-parliamentary-standing-committee-on-us-eu-deals-bangladesh-polls-on-tuesday-2865645-2026-02-09",
      "headline": "Govt to brief Tharoor-led panel on US, EU deals, Bangladesh polls on TuesdayWith key details still unclear and questions over who benefits more, the committee will be briefed by both ministries. Dubbed the \"father of all deals,\" a joint statement said India will import $500 billion worth of US goods after President Donald Trump cut tariffs on Indian exports from 50% to 18%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/aimim-leader-tauqeer-nizami-from-bhopal-shoe-licker-muslims-in-congress-shoe-eaters-in-bjp-2865539-2026-02-09",
      "headline": "Shoe-licker Muslims in Congress, shoe-eaters in BJP: AIMIM leader's shockerTauqeer Nizami, while making the shocking remarks, said that \"shoe-hitting Muslim\" belongs to AIMIM. Launching a sharp attack on the Congress, he alleged that since Independence, the party has kept Muslims in a state of \"slavery.\" He claimed the Congress makes Muslims put up flags and lay carpets. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/science/story/delhi-winter-temperature-today-rise-western-disturbance-north-india-2865583-2026-02-09",
      "headline": "Is winter over? Why Delhi suddenly feels so warm todayWhen the sky is clear, sunlight reaches the ground more directly and warms the surface more efficiently, leading to a noticeable increase in daytime temperatures. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/ai-agents-in-indian-classrooms-what-educators-need-to-know-now-india-today-education-conclave-2865503-2026-02-09",
      "headline": "When AI agents book doctors and teach physics, schools should pay attentionAt the India Today Education Conclave 2026 in Delhi, Professor Kamal Bijlani from Amrita University demonstrated how AI voice agents could transform healthcare, classrooms, counselling, and student support in India -- one phone call, one language, and one conversation at a time."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/hdfc-bank-employee-casteist-abuse-viral-kanpur-customer-dispute-2865309-2026-02-09",
      "headline": "I'm a Thakur: Bank employee abuses customer, tries to hit him in viral videoA video of a Kanpur bank employee verbally abusing a customer with casteist remarks has gone viral. The incident has sparked widespread outrage and calls for accountability against the employee."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/move-over-hba1c-the-plasma-glucose-test-that-could-spot-diabetes-better-2865350-2026-02-09",
      "headline": "Move over HbA1c: The plasma glucose test that could spot diabetes betterThe consensus is emerging that public health surveys based solely on HbA1c may misrepresent India's diabetes burden.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/uttar-pradesh/story/who-is-lamborghini-crash-accused-shivam-mishra-tycoons-son-linked-to-2024-i-t-raids-2865369-2026-02-09",
      "headline": "Who is Shivam Mishra, tobacco tycoon's son behind 2024 I-T raids, Lamborghini crash?A high-speed Lamborghini crash in Kanpur has brought Shivam Mishra and his family business, Banshidhar Tobacco Group, back into the national spotlight amid ongoing controversies. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prakash-raj-denies-spirit-exit-dismisses-rift-rumours-with-sandeep-reddy-vanga-2865420-2026-02-09",
      "headline": "Prakash Raj denies Spirit exit, dismisses rift rumours with Sandeep Reddy VangaActor Prakash Raj dismissed reports of a fallout with director Sandeep Reddy Vanga, saying his scenes for the film have not even begun."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/uttar-pradesh/story/kanpur-lamborghini-crash-tobacco-tycoons-son-behind-wheels-drama-outside-police-station-fir-registered-2865289-2026-02-09",
      "headline": "Kanpur Lamborghini crash: FIR first says driver unknown, later names tycoon's sonThe Lamborghini crash in Kanpur has taken a significant turn with the driver, Shivam Mishra, now named in the FIR after initial police ambiguity. This update comes amid public outcry and scrutiny over the handling of the case.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/if-this-is-their-professionalism-its-serious-sc-raps-banks-over-digital-arrests-asks-centre-to-restore-fun-2865424-2026-02-09",
      "headline": "If this is their quality, it's serious: Supreme Court raps banks over digital fraudObserving the gravity of losses suffered by victims, the CJI said individual losses matter, noting that for an elderly couple, the loss often amounts to their entire life savings. The court said banks have a duty to protect customers and questioned why suspicious transactions are not flagged when they occur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/h1b-visa-news-ai-boom-drives-for-foreign-workers-google-amazon-meta-apple-us-immigration-limits-forbes-report-2865317-2026-02-09",
      "headline": "Amid gloom, H-1B visas find new use as US tech giants hire AI talent amid crackdownAs US tech giants rush to expand their operations in the artificial intelligence (AI) sector, they are becoming increasingly dependent on hiring foreign workers via the H-1B visa route, according to a Forbes report. However, measures by the Trump administration to limit the H-1B programme might erode US's competitive edge."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-shubman-gill-promoted-bcci-annual-contracts-2865647-2026-02-09",
      "headline": "Virat Kohli-Rohit Sharma demoted, Shubman Gill promoted in BCCI annual contracts The Board of Control for Cricket in India (BCCI) on Monday announced the Annual Player Contracts for Team India Senior Men and Senior Women for the 2025–26 season, which runs from October 1, 2025 to September 30, 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/usa-t20-world-cup-clash-pakistan-mohsin-confident-stronger-skillful-team-2865641-2026-02-09",
      "headline": "United States draw confidence from 2024 heroics to challenge Pakistan again T20 World Cup, PAK vs USA: Leg-spinner Mohammad Mohsin said the United States have a stronger squad than they did in 2024 and will head into their match against Pakistan on Tuesday in Colombo with confidence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sunil-gavaskar-responds-to-nasser-hussain-cites-vaibhav-sooryavanshito-define-bullying-2865619-2026-02-09",
      "headline": "What Vaibhav did is bullying: Sunil Gavaskar's reply to Nasser's 'ICC' jibe Former India captain Sunil Gavaskar has delivered a pointed response to English pundit Nasser Hussain, dismissing suggestions of Indian \"bullying\" in the ongoing Pakistan boycott controversy and instead drawing attention to what he termed \"real bullying\", the kind displayed with a bat in hand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/namibia-netherlands-urge-more-international-matches-t20-world-cup-2026-2865593-2026-02-09",
      "headline": "ICC T20 World Cup: Namibia and Netherlands call for a level playing field Namibia and the Netherlands face off in the ICC T20 World Cup on Tuesday, February 10. Ahead of the contest, players from both Associate nations called for more bilateral fixtures and greater exposure against Full Member teams in the build-up to global tournaments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-canada-live-score-t20-world-cup-today-match-ahmedabad-updates-2865558-2026-02-09",
      "headline": "SA vs CAN, Live Score: Onus on Miller, Stubbs in death overs SA (South Africa) vs CAN (Canada) Live Score, T20 World Cup: Ansh Patel has been brilliant as he has taken three wickets. The onus is now on Tristan Stubbs and David Miller to give the Proteas momentum in the death overs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-india-vs-pakistan-pcb-demands-icc-rejects-bangladesh-2865584-2026-02-09",
      "headline": "Pakistan seek bilateral series vs India for boycott U-turn, ICC says no Live updates T20 World Cup 2026: The International Cricket Council rejected three of the five demands put forward by the Pakistan Cricket Board in return for reversing its decision to boycott the February 15 match against India. Pakistan's demands included the resumption of bilateral series against India and a tri-series involving Bangladesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zimbabwe-t20-world-cup-win-over-oman-2026-comeback-2865581-2026-02-09",
      "headline": "Dominant Zimbabwe crush Oman to mark statement T20 World Cup comeback T20 World Cup, OMA vs ZIM: Zimbabwe marked their return to the T20 World Cup with a convincing eight-wicket win over Oman. Zimbabwe bowled their opponents out for 103 and then chased down the target with 39 balls to spare. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-t20-world-cup-controversy-live-updates-icc-bangladesh-ind-pak-latest-2865551-2026-02-09",
      "headline": "India vs Pak controversy live: PCB chief reaches out to Pak PM with ICC CEO India vs Pakistan T20 World Cup controversy live: The Pakistan Cricket Board asked the International Cricket Council to step in and push for bilateral cricket between India and Pakistan, but the request was rejected as such matters fall outside the ICC's jurisdiction. Proposals for a tri-series with Bangladesh and for India to tour Bangladesh later this year were also turned down, with the ICC reiterating that bilateral engagements are for the respective boards to decide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/badminton-2027-2030-calendar-all-england-open-inida-open-delhi-syed-modi-2865526-2026-02-09",
      "headline": "All England keeps Super 1000 status, India Open in Delhi despite hygiene row The Badminton World Federation announced the calendar for the 2027–30 cycle on Monday, February 9, with the All England Open retaining its top-tier status despite speculation over a possible downgrade. Meanwhile, Delhi is set to continue hosting the India Open Super 750 event, despite controversy earlier this year surrounding hygiene standards and pollution levels in the capital."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-t20-world-cup-2026-pakistan-india-bangladesh-bcb-chief-lahore-meeting-mohsin-naqvi-pcb-shehbaz-sharif-2865400-2026-02-09",
      "headline": "Rushing to Lahore: Midnight text from Bangladesh cricket chief amid T20 politics At 1 am on Saturday, the Bangladesh Cricket Board chief took a flight to rush to Lahore without even his BCB colleagues unaware of the plans. BCB chief Aminul Islam Bulbul reached Pakistan to be at the meeting between the ICC and the Pakistan Cricket Board. Here we analyse why Bulbul took the midnight flight to Lahore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/karnataka-beats-mumbai-four-wickets-ranji-trophy-semifinals-kl-rahul-century-2865444-2026-02-09",
      "headline": "KL Rahul hundred knocks Mumbai out, powers Karnataka to semifinal Karnataka secured a semifinal berth in the Ranji Trophy by successfully chasing down a target of 325 against Mumbai, ending the defending champions' campaign and reviving hopes for their first title since 2015. KL Rahul was the star of Karnataka's win as he hit a hundred in the fourth innings in Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-jammu-kashmir-reach-semis-1st-time-auqib-nabi-12-wicket-2865440-2026-02-09",
      "headline": "Jammu and Kashmir reach semis for 1st time after Nabi's 12-wicket haulSixty-seven years after their first appearance in the Ranji Trophy, Jammu and Kashmir made history by reaching the semi-finals for the first time with a stirring 56-run victory over Madhya Pradesh in Indore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-scotland-vs-italy-debut-match-report-wayne-madsen-injury-michael-leask-kolkata-2865386-2026-02-09",
      "headline": "T20 World Cup: Clinical Scotland and injury scare ruin Italy's dream debutItaly's historic first T20 World Cup outing turned into a tough lesson as Scotland handed them a 73-run defeat at Eden Gardens. Wayne Madsen's shoulder injury and Michael Leask's brilliance spoilt the Gli Azzuri debut."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-babar-azam-pressure-poor-form-ravi-shastri-ricky-ponting-pak-vs-ned-2865374-2026-02-09",
      "headline": "Babar Azam putting pressure on Pakistan, not himself: Legends left confusedRicky Ponting and Ravi Shastri have raised concerns over Babar Azam's slow starts in Pakistan's T20 World Cup campaign. They believe Pakistan must act quickly, either shifting his role or making changes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-leadership-praised-by-gautam-gambhir-india-survives-usa-scare-2865364-2026-02-09",
      "headline": "Secret behind Gautam Gambhir breathing easy in T20Is? Suryakumar, the leaderWhile Gautam Gambhir has endured a difficult phase in Tests and a topsy-turvy run in ODIs, the head coach has enjoyed a sensational record in T20Is. Gambhir attributed the team's success in the shortest format to Suryakumar Yadav's leadership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-italy-captain-wayne-madsen-shoulder-injury-vs-scotland-kolkata-2865324-2026-02-09",
      "headline": "Azzurri agony: Italy's 42-year-old captain dislocates shoulder on World Cup debutItaly's T20 World Cup debut was rocked as captain Wayne Madsen dislocated his shoulder against Scotland in Kolkata. The injury forced him off early, leaving Italy sweating on his availability for the rest of the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/associate-nations-disrupt-2026-t20-world-cup-fearless-performances-2865297-2026-02-09",
      "headline": "March of the underdogs: How associate nations are adding flair to World CupT20 World Cup 2026: Last-ball drama and Associates have provided the thrill in the opening week of the tournament, exposing cricket's new reality: there are no minnows any more, only disruptors capable of rattling giants on the biggest stage globally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-nepal-bilateral-series-more-tournaments-eng-vs-nep-aakash-chopra-urges-icc-2865307-2026-02-09",
      "headline": "India vs Nepal bilateral? Ex-India batter urges ICC reward for T20 World Cup showAakash Chopra has urged for more bilaterals and tournament opportunities for Nepal after their thrilling four-run fight against England in Mumbai. He said rising teams deserve sustained support, not fleeting World Cup attention."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-cricket-board-icc-meeting-t20-world-cup-ind-vs-pak-2865299-2026-02-09",
      "headline": "Pakistan ready to play India in T20 World Cup. Only if 5 conditions metPakistan have held a high-level meeting with the ICC over their boycott of the India match in the T20 World Cup 2026. During the meeting, Pakistan placed five demands, three of which were rejected by the ICC. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/iccc-u19-world-cup-should-vaibhav-sooryavanshi-fast-track-sachin-shashi-tharoor-x-2865249-2026-02-09",
      "headline": "Like Sachin, fast-track Vaibhav Sooryavanshi to Team India: Shashi TharoorCongress MP Shashi Tharoor wants Vaibhav Sooryavanshi to be fast-tracked to the Indian team. Tharoor drew comparisons with Sachin Tendulkar and said that Vaibhav deserved higher honours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/davis-cup-who-is-dhakshineswar-suresh-netherlands-stunned-guy-de-ouden-yuki-bhambri-2865241-2026-02-09",
      "headline": "Who is Dhakshineswar Suresh? India's Davis Cup star who left Netherlands stunnedDhakshineswar Suresh announced himself as India's newest Davis Cup hero, sweeping all three rubbers against the Netherlands. The 25-year-old's stunning weekend powered India into Qualifiers Round 2 for the first time since 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/liverpool-vs-manchester-city-premier-league-arne-slot-szoboszlai-red-card-marc-guehi-2865187-2026-02-09",
      "headline": "Liverpool's Slot slams referee for Szoboszlai red-card vs City: Where's the rule book?Liverpool boss Arne Slot slammed the match officials after Dominik Szoboszlai's late red card in the chaotic 2-1 defeat to Manchester City at Anfield. Slot instead highlighted Marc Guehi's foul on Mohamed Salah."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-india-boycott-t20-world-cup-decision-confirm-24-hours-icc-meeting-bcb-reports-2865178-2026-02-09",
      "headline": "ICC meeting with Pak done, Shehbaz Sharif to decide on India matchPakistan are expected to clarify their stance on boycotting the T20 World Cup 2026 match against India within 24 hours. The decision follows a key ICC meeting in Lahore as pressure mounts to resolve the tournament's biggest controversy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-2026-live-streaming-day-3-italy-south-africa-zimbabwe-predicted-playing-xis-2865156-2026-02-09",
      "headline": "Matchday Preview: Italy set for World Cup debut as SA, Zimbabwe begin campaignsT20 World Cup 2026, Matchday preview: Day 3 of the tournament features three key matches, including Italy's debut at the grand stage of the T20 World Cup as they take on Scotland in the first fixture. On the other hand, Zimbabwe will take on Oman while South Africa will lock horns with Canada in the third fixture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/dhakshineswar-suresh-triple-haul-india-davis-cup-win-netherlands-2865149-2026-02-08",
      "headline": "Dhakshineswar Suresh's triple-haul gives India historic Davis Cup win vs NetherlandsDavis Cup: Dhakshineswar Suresh produced a historic triple-win performance, claiming both singles rubbers and the doubles to power India to a memorable 3-2 Davis Cup victory over the Netherlands on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wanindu-hasaranga-maheesh-theekshana-sri-lankan-vs-ireland-t20-world-cup-2026-2865143-2026-02-08",
      "headline": "Hasaranga, Theekshana turn Colombo into Irish nightmare, guide SL to 20-run winSri Lanka spinners Wanindu Hasaranga and Maheesh Theekshana spun a web around Ireland as they guided the hosts to a 20-run victory in their opening fixture of the T20 World Cup 2026 in Colombo. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-hosts-team-dinner-delhi-india-namibia-t20-world-cup-2865141-2026-02-08",
      "headline": "Watch: Gautam Gambhir hosts special dinner for T20 World Cup team in New DelhiT20 World Cup: Indian head coach Gautam Gambhir hosted the team for a special dinner at his Delhi residence ahead of their T20 World Cup clash against Namibia, continuing his tradition of building team unity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-donald-trump-good-luck-usa-cricket-team-24-hours-india-defeat-mumbai-2865139-2026-02-08",
      "headline": "Donald Trump's good luck message to USA cricket team 24 hours after loss to IndiaT20 World Cup: Donald Trump posted a good luck message for Team USA's cricketers on Truth Social—24 hours after they'd already lost to India by 29 runs at the Wankhede Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-gautam-gambhir-fight-relationship-clarified-devajit-saikia-bcci-2865134-2026-02-08",
      "headline": "Is there a rift between Kohli and Gambhir? BCCI secretary puts end to rumoursBCCI secretary Devajit Saikia dispels rumours of discord between Virat Kohli and Gautam Gambhir in the dressing room. Several reports in the media have claimed that the duo is not in a good relationship with each other in recent times."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}