{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-loans-under-under-scanner-as-rbi-plans-stricter-norms-for-banks-lenders-report-2689913-2025-03-06",
      "headline": "Gold loans under under scanner as RBI plans stricter norms for lenders: Report The RBI wants banks and non-banking financial companies (NBFCs) to conduct deeper background checks on borrowers and verify the ownership of the gold being pledged."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/da-hike-will-central-government-employees-receive-good-news-before-holi-2689886-2025-03-06",
      "headline": "DA hike? Will central government employees receive good news before Holi?The government reviews DA twice a year; the January hike is announced around Holi, while July revision is around Diwali. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/5-special-fixed-deposits-offering-up-to-805-percent-interest-check-details-2689853-2025-03-06",
      "headline": "5 special fixed deposits offering up to 8.05% interest. Check details  These fixed deposits are available only for a limited period, with the last date for investing in these schemes being March 31, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/closing-bell-sensex-rises-600-points-nifty-nears-22550-as-auto-and-metal-stocks-rally-2689848-2025-03-06",
      "headline": "Sensex rises 600 points, Nifty nears 22,550 as auto and metal stocks rallyThe S&P BSE Sensex gained 609.86 points to close at 74,340.09, while the NSE Nifty50 added 207.40 points to end at 22,544.70. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/britannia-industries-ceo-and-executive-director-rajneet-singh-kohli-resigns-2689836-2025-03-06",
      "headline": "Britannia Industries CEO Rajneet Singh Kohli resignsKohli submitted his resignation on March 5, 2025, and the Board of Directors has taken note of it through a circular resolution passed on March 6, 2025. He will be relieved from his duties at the close of business hours on March 14, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/you-do-not-need-employer-permission-for-these-epf-account-changes-name-date-of-birth-nationality-2689806-2025-03-06",
      "headline": "You don't need employer's permission for these EPF account changesIf your UAN is already linked to Aadhaar, you can update personal details like name, date of birth, gender, nationality, parents' names, marital status, spouse's name, date of joining, and date of leaving, all without submitting any documents."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-recovers-500-points-why-is-stock-market-gaining-despite-early-losses-auto-fmcg-banking-2689816-2025-03-06",
      "headline": "Sensex gains 600 points: Why is stock market rising despite early losses?Stock market gains: The S&P BSE Sensex was up 475.17 points to 74,205.40, while the NSE Nifty50 added 171.30 points to 22,508.60 as of 2:20 PM."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-mandates-10-day-office-attendance-track-compliance-report-2689796-2025-03-06",
      "headline": "Infosys mandates 10-day office attendance, to track compliance: ReportInfosys has informed its technology workforce that a new system will track attendance and limit the number of work-from-home (WFH) days they can apply for."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-are-indian-jewellery-exporters-worried-over-us-reciprocal-tariffs-2689741-2025-03-06",
      "headline": "Indian jewellers worry as Trump's reciprocal tariffs spark job loss fears: ReportKey Indian exports to the US include cut and polished diamonds, studded gold jewellery, plain gold jewellery, lab-grown diamonds, and silver jewellery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-rally-for-second-straight-day-is-dalal-street-gearing-up-for-a-strong-bull-run-2689764-2025-03-06",
      "headline": "Sensex, Nifty rally for 2nd straight day: Is D-Street ready for a bull run?The two-day recovery rally on Dalal Street, though encouraging, comes amid global uncertainty, particularly concerns over a possible trade war. While some experts remain cautious about calling this a full-fledged market recovery, they acknowledge that conditions are improving for a potential uptrend."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-economic-impact-how-much-will-donald-trump-reciprocal-tariffs-cost-2689754-2025-03-06",
      "headline": "How much will Donald Trump's reciprocal tariffs cost India?During a joint session of the US Congress, President Donald Trump said that other countries have charged the US high tariffs for years, and it was time to respond."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/delhi-mahila-samriddhi-scheme-check-eligibility-how-to-apply-for-rs-2500-monthly-aid-2689712-2025-03-06",
      "headline": "Delhi Mahila Samriddhi Scheme: Check if you are eligible for Rs 2,500 monthly aidThe Delhi government will launch an online portal where women can submit their applications. The IT department is also developing special software to verify eligibility. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/friends-actor-stephen-park-on-toxic-environment-on-friends-set-became-race-conscious-2689896-2025-03-06",
      "headline": "Friends actor recalls 'toxic environment' on set: I had become so race-consciousActor Stephen Park shared his negative experiences on the set of Friends, highlighting racial insensitivity. He recalled an incident involving an assistant director's offensive remarks towards fellow actor James Hong."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/ayesha-khan-bigg-boss-17-faints-shooting-video-goes-viral-2689854-2025-03-06",
      "headline": "BB 17's Ayesha Khan faints while shooting, video goes viralBigg Boss 17 fae Ayesha Khan fainted on the sets of her upcoming project. Reportedly, the incident took place on Kapil Sharma's Kis Kisko Pyaar Karun set. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/nora-fatehi-jason-durelo-teache-kelly-clarkson-snake-hook-step-watch-2689838-2025-03-06",
      "headline": "Nora Fatehi, Jason Durelo teach Kelly Clarkson Snake hook step. WatchKelly Clarkson welcomed Nora Fatehi and Jason Derulo on her talk show, where they showcased their latest hit, Snake, and even taught Kelly the hook step."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/lisa-kudrow-no-good-deed-netflix-ray-romano-2689833-2025-03-06",
      "headline": "Lisa Kudrow's No Good Deed: This dark comedy could have been darker and funnierLisa Kudrow and Ray Romano are beloved comedic actors. And they deserved better treatment than Netflix's No Good Deed, which is fine at best. The series is currently streaming on the OTT platform. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/with-love-meghan-review-you-are-neither-fancy-nor-rich-enough-for-markles-show-2689801-2025-03-06",
      "headline": "With Love, Meghan review: You are neither fancy nor rich enough for Markle's show Released-Wed Mar 05, 2025With Love, Meghan could have been a lovely show about cooking and lifestyle, but it becomes a window into Markle's pretentiousness. It can't do away with its elitism, the one thing that Markle stood against during her stint at the royal palace. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/netflix-cancels-noah-centineo-led-the-recruit-after-2-seasons-2689740-2025-03-06",
      "headline": "Netflix cancels Noah Centineo-led The Recruit after 2 seasonsStreaming giant Netflix has cancelled actor Noah Centineo-starrer The Recruit after only two seasons. The news was recently confirmed by the OTT platform. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/daredevil-born-again-review-charlie-cox-vincent-donofrio-jon-bernthal-jiohotstar-2689718-2025-03-06",
      "headline": "Daredevil Born Again review: An uneven but triumphant return of Hell's Kitchen's devilReleased-Wed Mar 05, 2025Matt Murdock is back as Hell's Kitchen's favourite vigilante in Marvel Studios' Daredevil Born Again. The show had its two-episode premiere on March 5 and can be streamed on JioHotstar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ali-fazal-rakht-brahmand-physical-training-learns-ancient-martial-arts-2689730-2025-03-06",
      "headline": "Ali Fazal trains 7 hours a day for Rakht Brahmand, learns ancient martial artsAli Fazal undergoes 7-hour daily training, learning martial arts and perfecting diction for Rakht Brahmand. He calls the process \"demanding but rewarding.\" The series also stars Samantha Ruth Prabhu."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/bigg-boss-17s-anurag-dobhal-gets-engaged-to-girlfriend-ritika-2689700-2025-03-06",
      "headline": "Bigg Boss 17's Anurag Dobhal gets engaged to girlfriend RitikaBigg Boss 17's Anurag Dobhal got engaged to his girlfriend Ritika Chauhan. The vlogger shared pictures on Instagram on March 5. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/madhavan-nayanthara-siddharth-netflix-film-test-to-premiere-on-april-4-2689695-2025-03-06",
      "headline": "Madhavan, Nayanthara, Siddharth's Netflix film Test to premiere on April 4Madhavan, Nayanthara, and Siddharth star in Test, a Tamil Netflix film exploring life's biggest challenges beyond cricket. Directed by S. Sashikanth, it will stream from April 4."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/liam-payne-girlfriend-kate-cassidy-breaks-down-remembering-singer-says-cannnot-fully-accept-2689598-2025-03-06",
      "headline": "Liam Payne's girlfriend breaks down remembering singer, says 'can't fully accept'One Direction singer Liam Payne's untimely demise has left his girlfriend Kate Cassidy grappling with grief. In a heartfelt interview, she talked about her struggles and healing journey. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/actor-parambrata-jokes-about-playing-a-cop-ahead-of-khakee-the-bengal-chapter-neeraj-pandey-2689496-2025-03-05",
      "headline": "Actor Parambrata jokes about playing a cop ahead of Khakee: The Bengal ChapterActor Parambrata Chattopadhyay recently joked about playing a police officer ahead of his Netflix series, Khakee: The Bengal Chapter. The actor even shared reasons behind nodding to feature in the political drama. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-jabs-trudeau-us-canada-tariff-issue-trade-negotiations-2690017-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trudeau 'largely caused' tariff issue, now using it as re-election tactic: TrumpUS President Donald Trump accused Canadian Prime Minister Justin Trudeau of being responsible for the 25 per cent tariff on Canada and using it as an election tactic to secure re-election."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ranya-rao-kannada-actor-gold-smuggling-first-photo-karnataka-custody-2689884-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Actor Ranya Rao's first photo in custody surfaces after arrest for gold smugglingKannada actor Ranya Rao's first photo in custody emerged on Thursday as she remains in DRI custody after being caught smuggling 14.2 kg of gold worth Rs 12.86 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/watch-live-elon-musks-spacex-launches-starship-super-heavy-on-8th-test-flight-2689967-2025-03-07#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Watch LIVE: SpaceX launches Starship Super Heavy on 8th test flightThe Starship Super Heavy rocket, comprising the Super Heavy booster and the Starship upper stage, will embark on a suborbital trajectory from SpaceX's Starbase facility in southern Texas. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uk-condemns-security-breach-during-jaishankar-visit-khalistanis-2689922-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Unacceptable: UK condemns security breach during S Jaishankar's visitOn Wednesday, as Jaishankar was leaving the Chatham House venue, after a discussion, a man ran toward his car and tore the Indian national flag in front of police officers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/golden-tricks-smugglers-sneak-gold-past-authorities-how-why-ranya-rao-case-customs-officials-2689826-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How Mona hid the sona. Gold smugglers and their sneaky tricksRanya Rao, actor and daughter of a top police officer, was nabbed while trying to smuggle gold into India. She was concealing gold bars in her clothing. Gold is among the top items smuggled into India, and in recent times, smugglers have become innovative and found new ways to sneak in the precious metal into India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/athena-mission-moon-south-pole-water-ice-nasa-intuitive-machines-2690055-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Athena touches down on the Moon, but its condition remains unclearThe team's ability to confirm the lander's condition has been limited, raising concerns similar to those experienced during Intuitive Machines' previous IM-1 mission. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/after-mexico-donald-trump-delays-canadian-goods-from-tariffs-2690080-2025-03-07#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "After Mexico, Trump delays Canadian goods from tariffsUS President Donald Trump suspended 25 per cent tariffs on Canadian and Mexican goods until April 2. Canada delayed retaliatory tariffs. The move follows concerns over trade uncertainty, inflation, and economic slowdown. Markets reacted negatively.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/conclave-2025/story/india-today-conclave-2025-yogi-adityanath-rekha-gupta-aamir-khan-suryakumar-yadav-india-future-debate-2689926-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Yogi Adityanath, Rekha Gupta to Aamir Khan: Powerhouses to unite at Conclave 2025The India Today Conclave, scheduled for March 7-8 in Delhi, will see an eclectic mix of politicians, cinema stars, sportspersons, entrepreneurs, and cultural icons delve into this year's theme - 'Age of Acceleration'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/maga-make-america-great-again-trump-tariffs-india-china-americans-do-2689394-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Hey MAGA guys, who pays for Trump's tariffs on India, China? Americans doThe MAGA crowd is elated over US President Donald Trump imposing reciprocal tariffs on foreign goods. However, many in the US are explaining how tariffs on countries like India and China end up hurting US businesses and making products costlier for ordinary Americans."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pakistan-issues-tournament-india-vs-new-zealand-2690021-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Champions Trophy: Team flops. Did Pakistan fare better as hosts?Pakistan are not playing the final of an ICC tournament, that they hosted after much drama. While their cricket team has been a failure, how did Pakistan do as the hosts of the Champions Trophy 2025?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mohammed-shami-called-criminal-by-muslim-cleric-for-not-keeping-rota-during-australia-clash-2689803-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Cleric attacks Mohammed Shami for not observing roza, top Muslim body defends himIndian cricketer Mohammed Shami faced criticism from Muslim cleric Maulana Shahabuddin Razvi Bareilvi for not fasting during India's semi-final against Australia, calling it a sin and a crime against religious principles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/boatman-tells-struggle-story-before-30-crore-rupees-maha-kumbh-2025-up-cm-yogi-adityanath-2689962-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Pawned mother's gold': Boatman who earned crores during Maha Kumbh recalls gamblePintu Mallah, a struggling boatman, risked everything for Maha Kumbh 2025. His gamble paid off, earning his family Rs 30 crore and praise from Uttar Pradesh Chief Minister Yogi Adityanath."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/south/story/bjp-mp-tejasvi-surya-marries-carnatic-singer-sivasri-skandaprasad-in-bengaluru-2689930-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "BJP MP Tejasvi Surya marries Carnatic singer Sivasri Skandaprasad in BengaluruBJP MP Tejasvi Surya married Carnatic singer Sivasri Skandaprasad in a traditional ceremony in Bengaluru, attended by top BJP leaders, with images from the event widely shared on social media.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jammu-and-kashmir-dispute-stolen-pok-pakistan-s-jaishankar-omar-chief-minister-abdullah-chinese-occupation-2690047-2025-03-07#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Take back areas under China as well: Omar Abdullah after Jaishankar's PoK remarkS Jaishankar, at a London event, said the Kashmir dispute will be resolved after the \"return of the stolen part\" under Pakistan. Omar Abdullah asks what is stopping the Centre from reclaiming it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/chinese-phd-student-zhenhao-zou-london-drug-rape-convict-uk-case-2690001-2025-03-07#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Chinese PhD student convicted of drugging, raping 10 women; 50+ victims fearedA Chinese PhD student, Zhenhao Zou, was convicted on Wednesday in a London court for drugging and raping 10 women in both England and China, with investigators warning that the number of victims could exceed 50."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/sunil-chhetri-comes-out-of-international-retirement-to-play-in-fifas-march-window-2690010-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sunil Chhetri comes out of international retirement, to play in FIFA's March windowSunil Chhetri has performed a retirement U-turn as he will be back in India colours during the March international window, AIFF announced on March 6. Chhetri retired from football in 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/michelangelo-life-facts-feuds-pranks-and-untold-stories-of-the-legendary-artist-2689969-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Michelangelo's many moods: Feuds, pranks and untold stories of the legendary artistMichelangelo, the genius behind David and the Sistine Chapel, led a life filled with passion, a legendary rivalry with Leonardo da Vinci, and artistic obsession. On his 550th birth anniversary, we uncover the man and the intense emotions that fuelled his masterpieces."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/us-president-donald-trump-stops-military-flight-deportation-illegal-immigrants-indians-cost-c17-globemaster-2689942-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump suspends military deportation flights: How much did it cost USThe US government stopped the use of military aircraft to transport migrants who entered the US illegally as it proved to be very costly, according to a report. How much do these flights cost?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mumbai-terror-attacks-accused-tahawwur-rana-extradition-india-delay-2689828-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "What's holding up Mumbai terror accused Tahawwur Rana's extradition to IndiaTahawwur Rana, wanted in India for his role in facilitating the Mumbai terror attacks, has approached the US Supreme Court for an emergency stay of his extradition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/earbuds-cleaning-ear-infection-risk-how-to-clean-guide-2689988-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Wait, what? You haven't ever cleaned your earbuds?Doctors highly recommend paying attention to the often-ignored task of cleaning earbuds, as neglecting it could invite unwanted health problems."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/karnataka-bodybuilder-bride-wedding-look-video-viral-7-million-views-chitra-purushotham-2689875-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Karnataka bodybuilder bride's wedding look video goes viral with 7 million viewsEmbracing both tradition and strength, Chitra Purushotham flaunted her muscular physique while dressed in an elegant yellow and blue Kanjivaram saree. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/enemy-at-royal-property-gates-why-saif-ali-khan-family-risks-losing-assets-worth-rs-10000-cr-2689427-2025-03-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why Saif Ali Khan family risks losing assets worth Rs 10,000 crHow a court order on properties linked to the royal family of Bhopal invoked the controversial Enemy Property Act of 1968 and spotlighted a decades-long legal tangle"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-indian-air-force-aims-to-give-its-bold-modernisation-a-flying-start-2689442-2025-03-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How Indian Air Force aims to give its bold modernisation a flying startIn the works is a roadmap to address critical fleet shortages and stealth fighter jet gaps in a time-bound manner while leveraging greater private sector participation"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/devendra-fadnavis-says-learning-marathi-a-must-after-rss-leaders-comment-sparks-row-2689829-2025-03-06#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Devendra Fadnavis says learning Marathi a must after RSS leader's comment sparks rowMaharashtra Chief Minister Devendra Fadnavis asserted in the assembly that Marathi is the state's official language and must be learnt by all residents. He emphasised its cultural significance, calling it every citizen's duty to learn and respect it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/raveena-tandon-rasha-thadani-make-a-statement-paris-fashion-week-2690052-2025-03-06",
      "headline": "Raveena Tandon, Rasha Thadani make a statement at Paris Fashion Week. PicsActor Raveena Tandon, along with her daughter, Rasha Thadani, dazzled at Paris Fashion Week. The two shared pictures from the prestigious event. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/zeenat-aman-recalls-fan-mistook-her-for-parveen-babi-death-2690036-2025-03-06",
      "headline": "Zeenat Aman recalls 'awkward' moment when a fan mistook her for Parveen BabiVeteran actor Zeenat Aman recalled feeling 'uncomfortable' after a fan mistook her for Parveen Babi after the actor's death. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mika-singh-urges-people-to-forgive-samay-raina-ranveer-allahbadia-indias-got-latent-2690029-2025-03-06",
      "headline": "Mika Singh urges people to forgive Samay and Ranveer: They couldn't manage successMika Singh shared his views on Samay Raina and Ranveer Allahabadia's controversy at India's Got Latent Show. The singer, in an interview, mentioned that the two could not handle success. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/parineeti-chopra-crushing-on-raghav-chadha-after-harvard-kennedy-school-executive-education-program-invite-2690006-2025-03-06",
      "headline": "Parineeti Chopra crushing on 'inspiring' Raghav Chadha after his Harvard inviteActor Parineeti Chopra is 'crushing' on husband-AAP MP Raghav Chadha after he was invited to participate in the prestigious Harvard Kennedy School (HKS) Executive Education Program. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-match-report-mumbai-indians-vs-up-warriorz-2690066-2025-03-07",
      "headline": "UP Warriorz all but knocked out as Matthews, Kerr power MI to 6-wicket winHayley Matthews smashed a 46-ball 68, while Amelia Kerr registered her best figures of 5/38 as Mumbai Indians stormed to a six-wicket win over UP Warriorz in the Women's Premier League."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-final-mitchell-santner-comments-2690049-2025-03-06",
      "headline": "Mitchell Santner banking on form ahead of final, says extra travel part of jobNew Zealand skipper Mitchell Santner said that he was banking on his team's form ahead of the Champions Trophy final against India. New Zealand beat South Africa in a high-scoring contest to reach the summit clash.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-final-umpires-2690038-2025-03-06",
      "headline": "Champions Trophy 2025 Final: ICC announces umpiring line-upPaul Reiffel and Richard Illingworth, two of the most respected names amongst the umpires are set to officiate the Champions Trophy Final between India and New Zealand on Sunday, March 9."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pakistan-issues-tournament-india-vs-new-zealand-2690021-2025-03-06",
      "headline": "Champions Trophy: Team flops. Did Pakistan fare better as hosts?Pakistan are not playing the final of an ICC tournament, that they hosted after much drama. While their cricket team has been a failure, how did Pakistan do as the hosts of the Champions Trophy 2025?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/sunil-chhetri-comes-out-of-international-retirement-to-play-in-fifas-march-window-2690010-2025-03-06",
      "headline": "Sunil Chhetri comes out of international retirement, to play in FIFA's March windowSunil Chhetri has performed a retirement U-turn as he will be back in India colours during the March international window, AIFF announced on March 6. Chhetri retired from football in 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-england-white-ball-captain-ben-stokes-jos-buttler-replacement-rob-key-2690007-2025-03-06",
      "headline": "Ben Stokes as England white-ball captain? Rob Key says 'nothing's off the table'England's managing director of men's cricket Rob Key has hinted that Ben Stokes could be an option to be the new white-ball captain after their exit from the Champions Trophy. Jos Buttler stepped down from his role as captain following their exit from the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-final-shreyas-iyer-x-factor-dubai-2689999-2025-03-06",
      "headline": "Shreyas ready to be India's X-factor in Champions Trophy final vs New ZealandWith an impeccable record against New Zealand in ODIs, Shreyas Iyer is all set to be India's X-factor in the final of the Champions Trophy on March 9. Shreyas goes up a gear against the Blackcaps when it comes to ICC events, as he has shown in the recent past. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/saud-shakeel-pakistan-timed-out-sleeping-president-cup-2689994-2025-03-06",
      "headline": "Saud Shakeel oversleeps? 'Timed-Out' in Pakistan's President's Trophy FinalSaud Shakeel was dismissed in the oddest of manners in the President's Trophy in Pakistan. Shakeel was timed out after allegedly oversleeping in the dressing room.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-final-sunil-gavaskar-prediction-dubai-2689992-2025-03-06",
      "headline": "India not at 100 percent despite reaching Champions Trophy final: Sunil GavaskarSunil Gavaskar feels that India are still not operating at their full potential despite reaching the final of the Champions Trophy 2025. India will face New Zealand in the summit clash on March 9 in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-india-vs-new-zealand-final-sunil-gavaskar-exclusive-rohit-sharma-mitchell-santner-2689991-2025-03-06",
      "headline": "No one should take New Zealand for granted in final against India: Sunil GavaskarSunil Gavaskar has claimed that no one should be taking New Zealand for granted in the Champions Trophy final clash against India on March 9. Gavaskar feels that the clash on Sunday will be different from their previous clash during the Group stages. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-australia-hardik-pandya-smiling-indian-dressing-room-dubai-2689981-2025-03-06",
      "headline": "Why Hardik Pandya was 'laughing inside' during high-pressure semi-final chaseHardik Pandya revealed that he was 'laughing' at the tensed Indian dressing room during the high-pressure run-chase against Australia in the semi-final of the Champions Trophy 2025. Hardik played a match-winning 28 off 24 balls to get India over the line. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-final-shreyas-iyer-x-factor-dubai-2689999-2025-03-06",
      "headline": "Shreyas ready to be India's X-factor in Champions Trophy final vs New ZealandWith an impeccable record against New Zealand in ODIs, Shreyas Iyer is all set to be India's X-factor in the final of the Champions Trophy on March 9. Shreyas goes up a gear against the Blackcaps when it comes to ICC events, as he has shown in the recent past. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/saud-shakeel-pakistan-timed-out-sleeping-president-cup-2689994-2025-03-06",
      "headline": "Saud Shakeel oversleeps? 'Timed-Out' in Pakistan's President's Trophy FinalSaud Shakeel was dismissed in the oddest of manners in the President's Trophy in Pakistan. Shakeel was timed out after allegedly oversleeping in the dressing room.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-final-sunil-gavaskar-prediction-dubai-2689992-2025-03-06",
      "headline": "India not at 100 percent despite reaching Champions Trophy final: Sunil GavaskarSunil Gavaskar feels that India are still not operating at their full potential despite reaching the final of the Champions Trophy 2025. India will face New Zealand in the summit clash on March 9 in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-india-vs-new-zealand-final-sunil-gavaskar-exclusive-rohit-sharma-mitchell-santner-2689991-2025-03-06",
      "headline": "No one should take New Zealand for granted in final against India: Sunil GavaskarSunil Gavaskar has claimed that no one should be taking New Zealand for granted in the Champions Trophy final clash against India on March 9. Gavaskar feels that the clash on Sunday will be different from their previous clash during the Group stages. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-australia-hardik-pandya-smiling-indian-dressing-room-dubai-2689981-2025-03-06",
      "headline": "Why Hardik Pandya was 'laughing inside' during high-pressure semi-final chaseHardik Pandya revealed that he was 'laughing' at the tensed Indian dressing room during the high-pressure run-chase against Australia in the semi-final of the Champions Trophy 2025. Hardik played a match-winning 28 off 24 balls to get India over the line. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}