{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/assigned-two-uans-here-how-you-can-rectify-it-by-epfo-guideline-2642403-2024-12-09",
      "headline": "Assigned two UANs? Here's how you can rectify it Resolve the issue of being assigned two UANs by following these simple steps to consolidate your EPF details into a single account."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/godrej-consumer-products-shares-falls-10-percent-today-brokerage-target-price-fmcg-stock-2646993-2024-12-09",
      "headline": "Godrej Consumer shares tank 10% today. Should you buy FMCG stock?Godrej Consumer recently flagged subdued demand in India's FMCG market, citing inflationary pressures and adverse weather conditions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/meet-rishi-parti-man-who-bought-rs-190-crore-ultra-luxury-penthouse-in-gurugram-2646983-2024-12-09",
      "headline": "Rishi Parti: Man Behind Gurugram's Rs 190 Crore PenthouseA Rs 190 crore penthouse sale in Gurugram marks India's most expensive high-rise deal, cementing the city's elite property market status."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ceat-share-price-rises-11-percent-all-time-high-should-you-buy-brokerage-views-2646960-2024-12-09",
      "headline": " CEAT share price rises 11% to hit record high. Should you buy? CEAT shares reached an all-time high of Rs 3,466.40 during the day before settling slightly lower. The stock has rallied 28% since the start of the year. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/paytm-shares-rise-above-rs-1000-today-3-things-you-need-to-know-2646951-2024-12-09",
      "headline": "Paytm shares rise above Rs 1,000 today. 3 things you need to knowPaytm's share price crossed Rs 1,000 mark in early trade after rising 3% on the Bombay Stock Exchange. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-share-price-rise-3-percent-hit-52-week-high-rally-paypay-corporation-softbank-vision-fund-2-2646923-2024-12-09",
      "headline": "Paytm share price rose 3% to go past Rs 1,000. What's driving the rally?Paytm stocks: Paytm shares climbed 3.19% in early trade to reach Rs 1,007 on the Bombay Stock Exchange (BSE) in early trade. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/godrej-consumer-share-price-fall-9-percent-in-early-trade-today-reason-why-explained-growth-outlook-weak-2646914-2024-12-09",
      "headline": "Explained: Why Godrej Consumer shares fell 9% in early trade todayGodrej Consumer stock: Leading brokerage firms remain cautiously optimistic about Godrej Consumer Products Limited's long-term potential."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-sensex-nifty-open-flat-godrej-consumer-shares-fall-9-percent-paytm-2646911-2024-12-09",
      "headline": "Sensex, Nifty open flat; Godrej Consumer shares fall 9%The S&P BSE Sensex was up 37.49 points to 81,746.61, while the NSE Nifty50 gained 21.45 points to 24,699.2. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/upcoming-ipos-vishal-mega-mart-mobikwik-sai-life-sciences-rs-18340-crore-2646906-2024-12-09",
      "headline": "Upcoming IPOs: Vishal Mega Mart, Mobikwik among 5 to raise Rs 18,340 croreFrom retail giant Vishal Mega Mart to players in healthcare, fintech, and jewellery, this week's IPO lineup has something for everyone."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/flipkart-ipo-launch-12-15-months-next-year-2026-first-quarter-e-commerce-report-2646887-2024-12-09",
      "headline": "Flipkart sets sights on IPO launch within 12-15 months: Report The Walmart-owned ecommerce giant has received internal approvals to move its domicile from Singapore to India, a key step toward going public. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-paytm-lt-ultratech-ceat-it-shares-adani-zomato-2646884-2024-12-09",
      "headline": "Stocks to watch today: Paytm, L&T, Ultratech, CEATIn today's session, several stocks, including Ultratech, Paytm, L&T, Biocon, Alembic Pharma, and CEAT, will be in focus due to recent news and developments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-inaugurate-rising-rajasthan-global-investment-summit-jaipur-2646741-2024-12-08",
      "headline": "PM Modi to inaugurate 'Rising Rajasthan Global Investment Summit' tomorrowAiming to bolster investment opportunities in Rajasthan, Prime Minister Narendra Modi to unveil the Rising Rajasthan Global Investment Summit in Jaipur on Monday, December 9. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/unacademy-ceo-gaurav-munjal-denies-reports-of-sale-deal-with-allen-career-institute-2646516-2024-12-07",
      "headline": "Not doing any sale: Unacademy CEO Gaurav Munjal denies reports of takeover dealReports earlier suggested that Allen Career Institute was in talks to acquire Unacademy for $800 million, significantly lower than its peak valuation of $3.4 billion."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/india-can-become-the-ai-capital-of-the-world-metas-sandhya-devanathan-2646252-2024-12-07",
      "headline": "India can become the AI capital of the world: Meta's Sandhya DevanathanSandhya Devanathan, Vice President and Head of India at Meta, discusses the company's AI initiatives, including Meta AI and Llama models. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/we-are-going-to-be-future-ready-priyank-kharge-on-ai-transforming-job-market-2646186-2024-12-06",
      "headline": "We are going to be future ready: Priyank Kharge on AI transforming job marketSharing his thoughts on AI creating a job deficit, Priyank Kharge, Minister of IT and Biotechnology of Karnataka said that technological evolution creates new opportunities rather than eliminating them. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/forging-the-future-cp-gurnani-aditya-ghosh-discuss-ais-role-in-empowering-india-2646110-2024-12-06",
      "headline": "Forging the future: CP Gurnani, Aditya Ghosh discuss AI's role in empowering IndiaCP Gurnani highlighted the necessity of blending AI with human capabilities. Aditya Ghosh emphasised the accessibility of AI, calling this era a \"magical time\" akin to the Industrial Revolution."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/firms-leveraging-ai-to-empower-workforce-on-right-track-says-professor-das-narayandas-2645981-2024-12-06",
      "headline": "Firms using AI to empower workforce likely to excel in future: Professor Das NarayandasSpeaking at the India Today-Business Today AI Conference 2024, during a session titled 'Leadership.Change.AI', he emphasised that organisations focusing on how AI can augment their workforce are likely to emerge as industry leaders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-share-price-52-week-high-factors-behind-strong-rallt-2645945-2024-12-06",
      "headline": "Paytm share price hits 52-week high today. What's driving the rally?Paytm share price: The stock jumped 3.60% to hit a 52-week high of Rs 990.90 on Friday. At the closing bell, the stock settled 1.89% higher at Rs 974.55."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-rbi-mpc-sensex-nifty-end-flat-as-rbi-maintains-status-quo-on-interest-rates-2645938-2024-12-06",
      "headline": "Sensex, Nifty end flat as RBI maintains status quo on interest ratesThe S&P BSE Sensex lost 56.74 points to end at 81,709.12, while the NSE Nifty50 was down 30.60 points to close at 24,677.80. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/insurance-claims-denied-zerodha-ceo-nithin-kamath-explains-why-and-what-you-can-do-2645903-2024-12-06",
      "headline": "Insurance claims denied? Nithin Kamath explains why and what you can doNithin Kamath warns that having insurance doesn't guarantee full claims and lists common rejection reasons."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/parliament-winter-session-opposition-mps-pose-pm-gautam-adani-with-masks-rahul-gandhi-asks-questions-2646955-2024-12-09",
      "headline": "Describe your relationship: Rahul Gandhi to Congress MPs wearing PM-Adani masksSince the Winter Session began on November 20, the two Houses have witnessed constant washouts over the Opposition continuing to attack the Central government for avoiding a discussion on the Adani bribery case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/syria-bashar-al-assad-opposition-rebels-india-relations-damascus-2646921-2024-12-09",
      "headline": "Syria shift, Assad's fall and what it means for IndiaThe Bashar al-Assad regime has been toppled in Syria, paving the way for significant political changes for the Arab Republic and its relations with India and other nations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/watch-uber-cool-gukesh-sacrifices-queen-in-master-stroke-at-world-chess-championship-2646924-2024-12-09",
      "headline": "Watch: Uber cool Gukesh sacrifices Queen in master stroke at Chess ChampionshipGukesh's brilliant novelty in Game 11 forced Ding Liren into a shocking blunder, turning a likely draw into a decisive win. The Indian prodigy now stands on the brink of becoming the youngest World Chess Champion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/allahabad-high-court-justice-shekhar-kumar-yadav-hindustan-country-will-run-as-per-majority-wishes-2646935-2024-12-09",
      "headline": "This is Hindustan, country will run as per majority's wishes: High Court judgeJustice Shekhar Kumar Yadav, a sitting judge of the Allahabad High Court, made the controversial remarks while speaking on the Uniform Civil Code (UCC) at a Vishwa Hindu Parishad (VHP) event in Pragyagraj. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/environment/story/2024-on-its-way-to-being-the-hottest-year-ever-break-record-set-in-2023-2646979-2024-12-09",
      "headline": "2024 to be the hottest year ever, break record set in 2023Data from January to November has confirmed 2024 is now certain to be the hottest year on record, and the first in which average global temperatures exceed 1.5 degrees Celsius. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/allahabad-high-court-justice-shekhar-kumar-yadav-hindustan-country-will-run-as-per-majority-wishes-2646935-2024-12-09",
      "headline": "This is Hindustan, country will run as per majority's wishes: High Court judgeJustice Shekhar Kumar Yadav, a sitting judge of the Allahabad High Court, made the controversial remarks while speaking on the Uniform Civil Code (UCC) at a Vishwa Hindu Parishad (VHP) event in Pragyagraj. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/south-korea-president-yoon-banned-from-foreign-travel-justice-ministry-official-2646999-2024-12-09",
      "headline": "South Korea's President Yoon banned from foreign travel: Justice Ministry South Korean police, prosecutors and anti-corruption agency had requested the ban as they expand their probes into possible rebellion charges over Yoon's imposition of martial law last week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-travis-head-mohammed-siraj-icc-sanction-adelaide-fight-2646997-2024-12-09",
      "headline": "Siraj, Head likely to escape suspension after Adelaide bust-up: ReportIndia vs Australia, 2nd Test: Although not yet official, Australian media have reported that Mohammed Siraj and Travis Head are likely to be fined and severely reprimanded for their on-field spat during the pink-ball Test in Adelaide."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-angry-post-fake-news-spreaders-idiots-2646901-2024-12-09",
      "headline": "Idiots with limited brain: Big B's angry post against fake news spreadersAmitabh Bachchan criticised misinformation spreaders in a cryptic post, calling them \"idiots with limited brain.\" His remarks follow ongoing rumours about his son Abhishek Bachchan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/university-of-bath-school-of-management-a-leader-in-global-business-education-2643394-2024-12-02",
      "headline": "University of Bath School of Management: A Leader in Global Business EducationCombining top-ranked MSc programmes with practical knowledge for future corporate leaders.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/music/story/jay-z-accused-of-raping-a-13-year-old-with-sean-diddy-combs-2646883-2024-12-09",
      "headline": "Rapper Jay-Z accused of raping a 13-year-old with Sean Diddy Combs in 2000Rapper Jay-Z was accused of raping a 13-year-old girl with Sean 'Diddy' Combs in 2000. She alleged that she was assaulted at the after-party of MTV Video Music Awards."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/two-delhi-schools-dps-rk-puram-gd-goenka-public-school-paschim-vihar-receive-bomb-threats-via-e-mail-2646877-2024-12-09",
      "headline": "Bomb hoax in 40 Delhi schools, demand for $30,000 ransomDelhi Bomb Threat: As per the Delhi Police, the schools received the e-mails at around 11.30 pm on Sunday. In the wake of the threat mails, the school administrations sent the students back home."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-aus-test-series-bgt-rohit-sharma-do-not-need-to-panic-adelaide-loss-2646885-2024-12-09",
      "headline": "It's a marathon, not a sprint: India don't need to panic after 2nd Test lossThe Indian team may have faced a big loss in the pink-ball Test but there is still a lot left in the Border-Gavaskar Trophy to play for. With history backing them, India needs a couple of changes to make before the next match in Brisbane. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/music/story/diljit-dosanjh-says-its-time-for-indian-artists-to-shine-promotes-vocal-for-local-2646896-2024-12-09",
      "headline": "Vocal for Local: Diljit Dosanjh says it's time for Indian artistes to shineDiljit Dosanjh, during his Indore concert, addressed the issue of fake ticket sales, commenting on how 'times have changed' with artists holding concerts in India. He also gave a shout-out to his 'brothers' AP Dhillon and Karan Aujla. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/gujarat-junagadh-accident-killed-college-students-two-speeding-cars-collision-divider-2646936-2024-12-09",
      "headline": "7, including 5 students, dead after car topples over divider and rams vehicleSeven people, including five students heading to an exam, died on the spot in Gujarat's Junagadh after a speeding car hit a divider and rammed another car. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/meet-rishi-parti-man-who-bought-rs-190-crore-ultra-luxury-penthouse-in-gurugram-2646983-2024-12-09",
      "headline": "Rishi Parti: Man Behind Gurugram's Rs 190 Crore PenthouseA Rs 190 crore penthouse sale in Gurugram marks India's most expensive high-rise deal, cementing the city's elite property market status."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/irish-travel-influencer-compares-mumbai-locals-to-london-tube-viral-video-2647002-2024-12-09",
      "headline": "Irish travel influencer compares Mumbai locals to London's Tube in viral videoIrish travel influencer Sean Hammond, who has been living in India for some time, recently took a ride on Mumbai's local train and shared his experience in a video."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/syria-damascus-bashar-al-assad-palace-looted-car-furniture-russia-rebels-2646871-2024-12-09",
      "headline": "Syrians raid Assad's palace, loot luxury cars, Louis Vuitton trunk, clothesPeople looted, vandalised, and ransacked Syrian President Bashar al-Assad's 31,500-square-metre Al-Rawda Presidential Palace, seizing luxury vehicles, valuables, and furniture, while Assad fled to Moscow after the collapse of his regime."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/unitedhealthcare-ceos-killers-new-pics-released-gunman-had-monopoly-money-in-bag-2646869-2024-12-09",
      "headline": "UnitedHealthcare CEO's killer's new pics released, gunman had Monopoly money in bagTwo photos released by the New York Police Department show the gunman, who killed UnitedHealthcare CEO Brian Thompson on December 4, one walking near a taxi and a second inside it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjps-rahul-narvekar-colaba-mla-re-elected-unopposed-maharashtra-assembly-speaker-2646978-2024-12-09",
      "headline": "BJP's Rahul Narvekar re-elected unopposed as Maharashtra Assembly Speaker Colaba MLA Rahul Narvekar, 47, has been elected unopposed as the new Speaker of the Maharashtra Assembly. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ranbir-kapoor-says-it-was-a-dream-to-play-lord-ram-in-nitesh-tiwaris-ramayana-2646920-2024-12-09",
      "headline": "Ranbir Kapoor says 'it was a dream' to play Lord Ram in Nitesh Tiwari's RamayanaBollywood actor Ranbir Kapoor expressed his excitement about portraying Lord Ram in Nitesh Tiwari's upcoming film, Ramayana. He described it as a dream role that he is eager to bring to life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/worlds-oldest-wild-bird-becomes-mom-again-lays-egg-at-the-age-of-74-2646966-2024-12-09",
      "headline": "World's oldest bird becomes mom again. Lays egg at 74This milestone makes her the oldest known wild bird in the world, a title she has held since being tagged in 1956 when she was at least five years old."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/afghan-taliban-congratulates-syrians-after-fall-president-bashar-al-assad-regime-removal-factor-conflict-2646889-2024-12-09",
      "headline": "Taliban congratulates Syrians after Assad fall: Removal of factor of conflictIn a statement on Sunday, the Taliban's Ministry of Foreign Affairs said the collapse of the Syrian government led by the autocratic Bashar al-Asaad resulted in the \"removal of the factor of conflict and instability\"."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pushpa-2-stampede-tragedy-hyderabad-sandhya-theatre-owner-and-two-managers-arrested-2646917-2024-12-09",
      "headline": "Pushpa 2 stampede tragedy: Hyderabad theatre owner and two managers arrestedOn December 4, a 39-year-old woman named Revathi died in a stampede at Hyderabad's Sandhya Theatre during Pushpa 2 screening. The theatre owner and two managers were arrested."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/amaran-makers-modify-controversial-scene-that-led-to-rs-11-crore-legal-battle-2647006-2024-12-09",
      "headline": "Amaran makers modify controversial scene that led to Rs 1.1 crore legal battleThe makers of Amaran made slight modifications to a scene which led to a Rs 1.1 crore legal battle. A scene in Sivakarthikeyan-Sai Pallavi film showcased a phone number which belongs to a young college-goer. After the film's release, he received thousands of calls after his number was displayed without his consent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-shares-cryptic-post-after-ex-naga-chaitanyas-wedding-no-love-like-2646989-2024-12-09",
      "headline": "Samantha shares cryptic post after ex Naga Chaitanya's wedding: No love like...Actor Samantha Ruth Prabhu recently shared a post about love on social media. This came shortly after her ex-husband Naga Chaitanya's second marriage to Sobhita Dhulipala."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/janhvi-kapoor-shikhar-pahariya-varun-dhawan-baby-john-trailer-screening-2646995-2024-12-09",
      "headline": "Watch: Janhvi Kapoor, Shikhar Pahariya, Varun Dhawan at Baby John trailer screeningVarun Dhawan along with Janhvi Kapoor and Shikhar Pahariya were clicked together at Baby John trailer screening in Mumbai. The film directed by Kalees, is produced by Atlee. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/manoj-manchu-visits-hospital-amid-alleged-tiff-with-father-mohan-babu-2646981-2024-12-09",
      "headline": "Telugu actor Manoj Manchu visits hospital amid alleged tiff with Mohan BabuTelugu actor Manoj Manchu was recently seen leaving a hospital with a cast on his leg and a neck brace. This comes amid rumours of the actor's feud with his father and actor-producer Mohan Babu."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-travis-head-mohammed-siraj-icc-sanction-adelaide-fight-2646997-2024-12-09",
      "headline": "Siraj, Head likely to escape suspension after Adelaide bust-up: ReportIndia vs Australia, 2nd Test: Although not yet official, Australian media have reported that Mohammed Siraj and Travis Head are likely to be fined and severely reprimanded for their on-field spat during the pink-ball Test in Adelaide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/dr-venkatesh-iyer-kkr-star-pursues-phd-in-finance-after-completing-mba-2646998-2024-12-09",
      "headline": "Dr. Venkatesh Iyer? KKR star pursues PhD in finance after completing MBAVenkatesh Iyer revealed that he has been pursuing a PhD in finance after completing his MBA. Venkatesh was sold to KKR for Rs 23.75 crore in the IPL 2025 mega auction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-josh-hazlewood-scott-boland-gabba-test-2646847-2024-12-09",
      "headline": "Should Australia bring in Josh Hazlewood for Gabba Test?AUS vs IND: Josh Hazlewood is expected to replace Scott Boland as Australia are most likely to make a change in their playing XI despite winning the Adelaide Test by 10 wickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-aus-virat-kohli-sachin-tendulkar-sydney-adam-gilchrist-2646992-2024-12-09",
      "headline": "Virat Kohli should take a leaf out of Sachin Tendulkar's SCG knock: GilchristIND vs AUS: Virat Kohli should take a leaf out of Sachin Tendulkar's SCG book, said Adam Gilchrist. Gilchrist made his comment on the backdrop of Kohli continually getting dismissed by edging the ball behind the stumps.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/otd-in-2014-virat-kohli-took-charge-of-indias-test-captaincy-in-adelaide-2646961-2024-12-09",
      "headline": "OTD in 2014: Virat Kohli took charge of India's Test captaincy in AdelaideOn December 9, 2014, Virat Kohli took charge of India's Test captaincy vs Australia in Adelaide. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/watch-uber-cool-gukesh-sacrifices-queen-in-master-stroke-at-world-chess-championship-2646924-2024-12-09",
      "headline": "Watch: Uber cool Gukesh sacrifices Queen in master stroke at Chess ChampionshipGukesh's brilliant novelty in Game 11 forced Ding Liren into a shocking blunder, turning a likely draw into a decisive win. The Indian prodigy now stands on the brink of becoming the youngest World Chess Champion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/west-indies-vs-bangladesh-1st-odi-sherfane-rutherford-2646907-2024-12-09",
      "headline": "Sherfane Rutherford's maiden hundred helps Windies seal 1st ODI vs BangladeshWI vs BAN, 1st ODI: West Indies chased down the highest ever target at St Kitts to take a 1-0 lead in the 3-match series vs Bangladesh. Sherfane Rutherford scored a terrific hundred, his first in ODI cricket.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/new-zealand-vs-england-devon-conway-set-to-miss-3rd-test-due-to-birth-of-his-child-2646894-2024-12-09",
      "headline": "Devon Conway set to miss 3rd Test vs England due to birth of his child New Zealand's Devon Conway will miss the 3rd Test vs England due to the birth of his first child. England already lead the 3-match Test series 2–0 vs the hosts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-aus-2nd-test-sanjay-manjrekar-jasprit-bumrah-shami-siraj-2646893-2024-12-09",
      "headline": "India bowlers need to be more relentless vs Australia: Sanjay ManjrekarIND vs AUS: Former India cricketer Sanjay Manjrekar said that the bowlers needed to be more relentless against Australia in the Adelaide Test match. Manjrekar's comments came after India lost the 2nd Test by a margin of 10 wickets.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-aus-test-series-bgt-rohit-sharma-do-not-need-to-panic-adelaide-loss-2646885-2024-12-09",
      "headline": "It's a marathon, not a sprint: India don't need to panic after 2nd Test lossThe Indian team may have faced a big loss in the pink-ball Test but there is still a lot left in the Border-Gavaskar Trophy to play for. With history backing them, India needs a couple of changes to make before the next match in Brisbane. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aakash-chopra-ind-vs-aus-2nd-test-bgt-rohit-sharma-captaincy-record-2646882-2024-12-09",
      "headline": "Aakash Chopra blames defensive Rohit Sharma for India's loss in AdelaideIND vs AUS: Former India cricketer Aakash Chopra has blamed Rohit Sharma for the team's loss in Adelaide Test match. India were hammered by Australia in the Border-Gavaskar Trophy as they won the pink ball Test by 10 wickets.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/west-indies-vs-bangladesh-1st-odi-sherfane-rutherford-2646907-2024-12-09",
      "headline": "Sherfane Rutherford's maiden hundred helps Windies seal 1st ODI vs BangladeshWI vs BAN, 1st ODI: West Indies chased down the highest ever target at St Kitts to take a 1-0 lead in the 3-match series vs Bangladesh. Sherfane Rutherford scored a terrific hundred, his first in ODI cricket.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/new-zealand-vs-england-devon-conway-set-to-miss-3rd-test-due-to-birth-of-his-child-2646894-2024-12-09",
      "headline": "Devon Conway set to miss 3rd Test vs England due to birth of his child New Zealand's Devon Conway will miss the 3rd Test vs England due to the birth of his first child. England already lead the 3-match Test series 2–0 vs the hosts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-aus-2nd-test-sanjay-manjrekar-jasprit-bumrah-shami-siraj-2646893-2024-12-09",
      "headline": "India bowlers need to be more relentless vs Australia: Sanjay ManjrekarIND vs AUS: Former India cricketer Sanjay Manjrekar said that the bowlers needed to be more relentless against Australia in the Adelaide Test match. Manjrekar's comments came after India lost the 2nd Test by a margin of 10 wickets.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-aus-test-series-bgt-rohit-sharma-do-not-need-to-panic-adelaide-loss-2646885-2024-12-09",
      "headline": "It's a marathon, not a sprint: India don't need to panic after 2nd Test lossThe Indian team may have faced a big loss in the pink-ball Test but there is still a lot left in the Border-Gavaskar Trophy to play for. With history backing them, India needs a couple of changes to make before the next match in Brisbane. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aakash-chopra-ind-vs-aus-2nd-test-bgt-rohit-sharma-captaincy-record-2646882-2024-12-09",
      "headline": "Aakash Chopra blames defensive Rohit Sharma for India's loss in AdelaideIND vs AUS: Former India cricketer Aakash Chopra has blamed Rohit Sharma for the team's loss in Adelaide Test match. India were hammered by Australia in the Border-Gavaskar Trophy as they won the pink ball Test by 10 wickets.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-aus-test-series-nitish-reddy-srh-hardik-pandya-replacement-2646724-2024-12-09",
      "headline": "Have India found Pandya's replacement? Nitish Reddy shows spark in Australia   AUS vs IND: Nitish Kumar Reddy's fearless batting and maturity beyond his years mark him as India's next big hope. In just 2 Test matches, the 21-year-old has shown that he thrives under pressure and delivers when it matters the most."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chelsea-vs-tottenham-hotspur-palmer-premier-league-penalty-record-2646853-2024-12-09",
      "headline": "Palmer breaks Premier League record in Chelsea's 4-3 win over SpursCole Palmer scored twice from the penalty spot as Chelsea staged a dramatic comeback, recovering from 2-0 down to defeat Tottenham Hotspur 4-3 in a thrilling London derby. Palmer has now scored the most penalties without missing in Premier League history.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/mikel-arteta-delivers-arsenal-injury-update-after-draw-vs-fulham-2646839-2024-12-08",
      "headline": "Mikel Arteta delivers fresh Arsenal injury update after draw at FulhamWith the Monaco game fast approaching, Mikel Arteta will be hoping his defensive options are bolstered by the potential returns of Gabriel, Zinchenko, and Calafiori, allowing Arsenal to maintain their strong form in both domestic and European competitions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/pakistan-super-league-franchises-eye-unsold-foreign-ipl-players-for-2025-2646836-2024-12-08",
      "headline": "Pakistan Super League franchises eye unsold foreign IPL players for 2025Pakistan franchise owners have submitted a list of unsold overseas IPL players to the PCB for the PSL draft. The potential overlap of PSL and IPL seasons next year adds a new dimension to player availability decisions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/premier-league-arsenal-drop-points-held-1-1-by-fulham-2646833-2024-12-08",
      "headline": "Arsenal frustrated by Fulham once againArsenal were held to a 1-1 draw by London rivals Fulham in a Premier League clash on a grey, wet Sunday at Craven Cottage. Raul Jimenez gave the hosts an early lead, while William Saliba equalized for the visitors at the start of the second half."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/south-africa-vs-sri-lanka-2nd-test-day-4-report-de-silva-mendi-2646830-2024-12-08",
      "headline": "2nd Test: Dhananjaya de Silva-Mendis stand keeps Sri Lanka alive on Day 4South Africa need five wickets, while Sri Lanka require 143 runs as the second Test heads for a potentially thrilling conclusion on Monday, with both teams desperate for victory in their bid for a place in the World Test Championship final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/formula-1-lewis-hamilton-emotional-farewell-donuts-spins-mercedes-final-race-2646828-2024-12-08",
      "headline": "Watch: Emotional Hamilton wows crowd with donuts in final Mercedes raceLewis Hamilton ended his 12-year Mercedes journey with an emotional farewell at the Abu Dhabi Grand Prix, marking the end of an era filled with historic achievements and the beginning of a new chapter with Ferrari."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-day-night-test-sunil-gavaskar-2646829-2024-12-08",
      "headline": "Sunil Gavaskar shares advice on how day-night Tests can thriveAUS vs IND, 2nd Test: Sunil Gavaskar shared a suggestion about Day-Night Tests, saying that pink-ball matches should be hosted by cities with a busy corporate life. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/premier-league-arsenal-drop-points-held-1-1-by-fulham-2646833-2024-12-08",
      "headline": "Arsenal frustrated by Fulham once againArsenal were held to a 1-1 draw by London rivals Fulham in a Premier League clash on a grey, wet Sunday at Craven Cottage. Raul Jimenez gave the hosts an early lead, while William Saliba equalized for the visitors at the start of the second half."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/south-africa-vs-sri-lanka-2nd-test-day-4-report-de-silva-mendi-2646830-2024-12-08",
      "headline": "2nd Test: Dhananjaya de Silva-Mendis stand keeps Sri Lanka alive on Day 4South Africa need five wickets, while Sri Lanka require 143 runs as the second Test heads for a potentially thrilling conclusion on Monday, with both teams desperate for victory in their bid for a place in the World Test Championship final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/formula-1-lewis-hamilton-emotional-farewell-donuts-spins-mercedes-final-race-2646828-2024-12-08",
      "headline": "Watch: Emotional Hamilton wows crowd with donuts in final Mercedes raceLewis Hamilton ended his 12-year Mercedes journey with an emotional farewell at the Abu Dhabi Grand Prix, marking the end of an era filled with historic achievements and the beginning of a new chapter with Ferrari."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-day-night-test-sunil-gavaskar-2646829-2024-12-08",
      "headline": "Sunil Gavaskar shares advice on how day-night Tests can thriveAUS vs IND, 2nd Test: Sunil Gavaskar shared a suggestion about Day-Night Tests, saying that pink-ball matches should be hosted by cities with a busy corporate life. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ben-stokes-credits-england-style-of-play-new-zealand-series-win-2646823-2024-12-08",
      "headline": "Ben Stokes credits England's dominant style of play for New Zealand series winEngland captain Ben Stokes has lauded his team's bold and aggressive approach following a resounding 323-run victory in Wellington, marking their first Test series triumph in New Zealand in 16 years. Reflecting on the achievement, Stokes highlighted the significance of their attacking mindset. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gukesh-out-of-syllabus-knight-move-vs-ding-liren-game-eleven-world-chess-championship-favourite-2646819-2024-12-08",
      "headline": "Gukesh's out of syllabus move makes him World Chess Championship favouriteGukesh and Ding Liren were certain to play a draw in the 11th game of the World Chess Championship, but a novelty move from Gukesh ensured Ding Liren blundered, and it put the Indian Grandmaster in pole position to win the World Chess Championships. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/d-gukesh-reaction-11-game-win-vs-ding-liren-2646818-2024-12-08",
      "headline": "Gukesh credits team for lead in Game 11: Don't think Liren was playing for drawIndian teenage Grandmaster D. Gukesh has attributed his crucial victory in Game 11 to his team's meticulous preparation, as he moves closer to securing his first World Chess Championship title. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-marnus-labuschagne-form-2646817-2024-12-08",
      "headline": "Took a lot out of my ability: How Labuschagne recovered from poor formAUS vs IND: Marnus Labuschagne returned to form with a 64-run knock in the first innings of the Adelaide Test. His knock did not go in vain as Australia beat India by 10 wickets to draw level in the five-match series. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}