{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/google-layoff-100-job-cuts-design-related-ai-shift-seo-sunder-pichai-artificial-intelligence-2796598-2025-10-02",
      "headline": "Google layoffs: Over 100 design jobs cut in AI shiftGoogle has also been cutting back on management layers. According to reports, the company has reduced the number of middle managers by more than a third, particularly those overseeing small teams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/gandhi-jayanti-2025-stock-market-holiday-nse-bse-open-or-close-dussehra-october-2-sensex-nifty-2796520-2025-10-02",
      "headline": "Market holiday: Are NSE, BSE open on Gandhi Jayanti, Dussehra on October 2?Sensex and Nifty gained nearly 1% in the last session after the Reserve Bank of India (RBI) kept the repo rate unchanged at 5.5% and maintained its neutral stance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/microsoft-ceo-satya-nadella-shifts-focus-to-ai-elevates-judson-althoff-to-lead-commercial-unit-2796469-2025-10-01",
      "headline": "Satya Nadella bets big on AI, names Judson Althoff to lead Microsoft commercial unitMicrosoft has elevated Chief Commercial Officer Judson Althoff as CEO of its commercial business, allowing Satya Nadella to focus on AI, datacenter buildout, and product innovation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-the-price-of-gold-keeps-breaking-records-business-news-2796426-2025-10-01",
      "headline": "Why the price of gold keeps breaking recordsBullion has soared more than 45% this year, putting it on track for the biggest annual gain since 1979.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adar-poonawalla-in-talks-to-buy-royal-challengers-bangalore-rcb-stake-united-spirits-shares-update-2796326-2025-10-01",
      "headline": "Adar Poonawalla in talks to buy RCB stake? United Spirits shares updateThe CEO of Serum Institute, Adar Poonawalla, is in talks with Diageo to purchase a stake in RCB, one of the Indian Premier League's top teams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/are-festive-cheer-and-auto-stocks-driving-the-market-rally-heres-what-expert-says-2796279-2025-10-01",
      "headline": "Are festive cheer and auto stocks driving the market rally?The stock market showed renewed strength, as festive season cheer and gains in auto stocks lifted investor sentiment across sectors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/da-hike-58-percent-government-employee-salary-rise-how-to-calculate-diwali-gift-arrears-2796256-2025-10-01",
      "headline": "DA hiked to 58%: What it means for government employees' salary and pensionThe Union Cabinet approved the proposal to increase the DA for central government employees and Dearness Relief (DR) for pensioners by 3%. With this revision, the DA rate now stands at 58%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-716-points-higher-nifty-above-24800-tata-motors-up-5-percent-2796231-2025-10-01",
      "headline": "Sensex ends 716 points higher, Nifty above 24,800; Tata Motors up 5%The S&P BSE Sensex jumped 715.64 points to end at 80,983.31, while the NSE Nifty50 added 225.20 points to close at 24,836.30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/this-indian-gold-lender-holds-3-times-the-gold-of-pakistan-muthoot-finance-2796225-2025-10-01",
      "headline": "This Indian gold lender holds 3 times the gold of PakistanThe country's largest gold loan provider, currently holds 209 tonnes of gold in its safe deposit boxes. This is three times the gold reserves of Pakistan and higher than the reserves of Brazil, Australia, and South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mukesh-ambani-tops-hurun-rich-list-2025-shah-rukh-khan-joins-billionaire-club-2796169-2025-10-01",
      "headline": "Shah Rukh Khan joins billionaire club, Mukesh Ambani tops Hurun India Rich ListMukesh Ambani has reclaimed the top spot on the Hurun India Rich List 2025, while Bollywood superstar Shah Rukh Khan joins the billionaire club for the first time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-rally-why-reason-sensex-600-points-nifty-jump-rbi-mpc-auto-shares-tata-motors-2796146-2025-10-01",
      "headline": "Sensex jumps 500 points: 3 reasons why markets are rising todayThe S&P BSE Sensex surged 660.64 points to 80,928.26, while the NSE Nifty50 rose 185.70 points to 24,796.80 as of 12:10 PM. The rally was broad-based on Dalal Street. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-set-to-approve-da-hike-for-employees-and-pensioners-today-sources-2796115-2025-10-01",
      "headline": "Union Cabinet approves 3% DA hike for central government employeesEarlier this year, the government had approved a 2% increase in DA in March, raising it from 53% to 55% of the basic salary and pension."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dussehra-2025-amitabh-bachchan-to-anupam-kher-bollywood-celebs-extend-their-wishes-2796657-2025-10-02",
      "headline": "Happy Dussehra: Big B, Akshay Kumar, Sunny Deol, among celebs wishing fans Bollywood celebrities including Amitabh Bachchan, Akshay Kumar, Anupam Kher, Sunny Deol, and Randeep Hooda extended heartfelt wishes to fans on Dussehra 2025. The stars shared messages celebrating the triumph of good over evil, positivity, and truth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jr-ntr-praises-rishab-shetty-kantara-chapter-1-success-2796648-2025-10-02",
      "headline": "Jr NTR wishes Kantara team: Rishab pulled off the unthinkable as actor-director Jr NTR congratulated actor-director Rishab Shetty and the 'Kantara: Chapter 1' team. He mentioned that Shetty pulled off the unthinkable as an actor and director."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/awez-darbar-denies-family-paid-rs-2-crore-for-bigg-boss-19-eviction-2796642-2025-10-02",
      "headline": "Awez Darbar denies family paid for Bigg Boss 19 eviction Awez Darbar was evicted from 'Bigg Boss 19' amid fan disbelief and conspiracy theories. He firmly denied any family involvement in paying for his eviction and clarified his personal relationships."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-episode-39-day-38-written-update-farrhana-bhatt-ashnoor-kaur-shehbaz-badesha-2796632-2025-10-02",
      "headline": "Bigg Boss 19 episode 39: Farrhana-Ashnoor clash, Shehbaz's theft creates ruckus The ranking task created a rift between Captain Farrhana Bhatt and Ashnoor Kaur in episode 39 of 'Bigg Boss 19.' During the episode, Shehbaz's act of stealing eggs further escalated tensions inside the house.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-hugs-triptii-dimri-introduces-her-to-bvlgari-ceo-2796639-2025-10-02",
      "headline": "Priyanka Chopra hugs Triptii Dimri, introduces her to Bvlgari CEO. Watch Priyanka Chopra inaugurated Bvlgari's first-ever Indian exhibition, Serpenti Infinito, in Mumbai, where she warmly interacted with Triptii Dimri and introduced her to the brand's CEO."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kaun-banega-crorepati-17-contestant-fails-to-answer-question-on-ramayan-2796634-2025-10-02",
      "headline": "KBC 17: Contestant fails to answer question on Ramayan. Can you? In the latest episode of 'Kaun Banega Crorepati 17', contestant Shraddha failed to answer a question on Ramayan and had to use her lifeline. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/avatar-fire-and-ash-exclusive-preview-james-cameron-pandora-2025-2796603-2025-10-02",
      "headline": "James Cameron offers exclusive Avatar: Fire and Ash look with Avatar 2 re-release James Cameron offers an exclusive first look at Avatar: Fire and Ash with the re-release of Avatar: The Way of Water. The preview reveals new conflicts and ecological themes, setting high expectations for the 2025 release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aishwarya-rai-abhishek-bachchan-lawsuit-rs-4-crore-youtube-ai-deepfake-videos-personality-rights-2796604-2025-10-02",
      "headline": "Aishwarya, Abhishek sue YouTube for Rs 4 crore over alleged AI videos Aishwarya Rai Bachchan and Abhishek Bachchan have filed a lawsuit against YouTube and Google, seeking Rs 4 crore in damages for alleged AI deepfake videos. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-pulled-by-fan-for-selfie-at-durga-puja-pandal-handles-it-calmly-2796594-2025-10-02",
      "headline": "Alia Bhatt pulled by fan for selfie at Durga Puja pandal, handles it calmly. Video Alia Bhatt handled a brief fan encounter with grace during her visit to the star-studded Durga Puja pandal in Mumbai. She posed for a photo and calmly ensured her security team didn't escalate the situation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/karan-kundrra-hits-back-at-anusha-dandekar-cheating-claims-in-now-deleted-post-2796582-2025-10-02",
      "headline": "Cruel elite women: Karan hits back at Anusha's cheating claims in now-deleted post Anusha Dandekar reignited her feud with ex-boyfriend Karan Kundrra by hinting on her podcast that he cheated on her, saying he was \"sleeping with all of Mumbai.\" Karan hit back with a now-deleted Instagram note, accusing \"elite women with Bollywood connections\" of harassment and mental badgering."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/pandit-chhannulal-mishra-dies-89-mirzapur-hindustani-classical-singer-2796573-2025-10-02",
      "headline": "Classical singer Pandit Chhannulal Mishra dies at 89 Pandit Chhannulal Mishra, acclaimed Hindustani classical singer, died early Thursday in Mirzapur. He was 89 years old. Prime Minister Narendra Modi paid his last respects to the late singer on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/leonardo-dicaprio-pays-tribute-to-primatologist-jane-goodall-2796562-2025-10-02",
      "headline": "Lost a true hero: Leonardo DiCaprio pays tribute to primatologist Jane Goodall Leonardo DiCaprio paid an emotional tribute to legendary primatologist Jane Goodall, who died at 91, calling her \"a true hero for the planet.\" The two shared a long friendship rooted in their passion for conservation and environmental advocacy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kantara-chapter-1-rishab-shetty-craftsmanship-cultural-impact-karnataka-2796542-2025-10-02",
      "headline": "Kantara Chapter 1 X reviews: Fans call Rishab Shetty film a divine roar 'Kantara: Chapter 1' has received spectacular reviews on X, with fans praising Rishab Shetty's masterful storytelling and immersive cinematic experience. The film has created a 'divine roar' among audiences, resonating deeply with cultural pride and raising high expectations for its success in Indian cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/sunny-sanskari-ki-tulsi-kumari-review-varun-dhawan-janhvi-kapoor-rom-com-2796536-2025-10-02",
      "headline": "Sunny Sanskari Ki review: Varun leads a shaky front in this lukewarm rom-comRelease Date:Thu Oct 02, 2025 Sunny Sanskari Ki Tulsi Kumari movie review: Varun Dhawan and Shashank Khaitan reunite for 'Sunny Sanskari Ki Tulsi Kumari', a rom-com mixing classic Bollywood style with modern humour. The film entertains with witty dialogues but stumbles with a rushed climax and awkward scenes, says our review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/kantara-chapter-1-review-rishab-shetty-folklore-saga-is-a-spellbinding-spectacle-rukmini-vasanth-jayaram-2796510-2025-10-02",
      "headline": "Kantara Chapter 1 review: Rishab Shetty's folklore saga is a spellbinding spectacle Live UpdatesRelease Date:Thu Oct 02, 2025 Kantara Chapter 1 movie review: Director, writer, and actor Rishab Shetty's film, also starring Rukmini Vasanth and Jayaram, explores the man vs nature conflict and land rights, blending them with divinity, folklore, myth, and faith. The film is a brilliant cinematic showcase."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshan-shares-vacation-photos-with-partner-saba-azad-fourth-anniversary-2796411-2025-10-01",
      "headline": "Hrithik Roshan shares vacation photos with partner Saba Azad on fourth anniversary Actor Hrithik Roshan marked his fourth anniversary with partner Saba Azad by sharing heartfelt note and vacation pictures. The post sparked warm reactions on social media, highlighting the couple's affectionate bond."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/frankenstein-trailer-creature-jacob-elordi-unleashes-rage-on-creator-oscar-issac-2796374-2025-10-01",
      "headline": "Frankenstein trailer: Creature Jacob Elordi unleashes rage on creator Oscar Issac The trailer of director Guillermo del Toro's 'Frankenstein' was released by Netflix on October 1, 2025. The film features Oscar Isaac and Jacob Elordi and reimagines Mary Shelley's classic tale with a modern twist."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/priya-marathe-husband-shantanu-shares-heartfelt-note-a-month-after-her-death-2796369-2025-10-01",
      "headline": "Priya Marathe's husband Shantanu shares heartfelt note a month after her death Actor Shantanu Moghe posted an emotional message marking a month since Priya Marathe's death. Priya Marathe, known for 'Pavitra Rishta', died after battling cancer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-sirish-engagement-nayanika-grandfather-birth-anniversary-2796373-2025-10-01",
      "headline": "Allu Arjun's brother Allu Sirish announces engagement to Nayanika in October Actor Allu Sirish announced his engagement to Nayanika on October 1, the birth anniversary of his grandfather, actor Allu Ramalingaiah. His brother Allu Arjun, shared a congratulatory post on social media. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pok-pakistan-occupied-kashmir-protests-violence-civilians-killed-2796555-2025-10-02",
      "headline": "Kashmir is ours: POK turns battlefield as protesters clash with army, 12 deadPOK violence: The unrest in Pakistan-Occupied Kashmir, which entered its third day, saw Pakistani security forces opening fire and using tear gas to disperse the protesters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-army-chief-asim-munir-photo-trump-rare-earth-minerals-criticism-senator-salesman-2796540-2025-10-02",
      "headline": "Salesman-in-chief? Asim Munir mocked at home over rock show with TrumpThe blowback indicates simmering discontent inside Pakistan over growing involvement of the military in diplomacy, which is primarily carried out by civilian leaders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/vijay-karur-tragedy-and-the-madness-of-tamil-nadu-matinee-politics-2796652-2025-10-02",
      "headline": "Vijay, Karur tragedy and the madness of Tamil Nadu's matinee-politicsThe enormity of the Karur tragedy and Vijay's instant, intuitive and inexplicable escape to personal safety has raised many questions: Is it over for Vijay's fledgling one-man political party that is the Tamilaga Vettri Kazhagam (TVK)? "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/tn-logistics-cargo-firm-wintrack-exit-india-chennai-customs-bribery-shashi-tharoor-mohandas-pai-2796613-2025-10-02",
      "headline": "Cargo firm exits India citing bribery, Chennai Customs officials deny allegationsTamil Badu-based logistics firm said it will cease operations in India from October 1, alleging harassment and bribery demands by Chennai Customs. Customs denied the charges, citing misclassification and non-compliance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/books/story/why-gandhi-teachings-remain-relevant-today-rajmohan-gandhi-explains-2796286-2025-10-02",
      "headline": "Does Gandhi still matter? Yes, and Rajmohan Gandhi explains whyRead an excerpt from the renowned historian-biographer's book on the contemporary relevance of the Mahatma. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-weat-indies-1st-test-live-score-shubman-gill-roston-chase-ahmedabad-2796548-2025-10-02",
      "headline": "1st Test Live: Siraj removes Roston chase right after LunchIndia (IND) vs West Indies (WI), Live Score 1st Test: A stunning start for India after Lunch. Mohammed Siraj removes captain Roston Chase and dents the Windies innings further."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rss-centenary-mohan-bhagwat-speech-us-trump-tariffs-india-swadeshi-atmanirbhar-isolation-helplessness-2796584-2025-10-02",
      "headline": "Dependence musn't turn into compulsion: RSS chief's swadeshi call amid US tariffsDelivering his Vijayadashami address from the RSS headquarters in Nagpur, Mohan Bhagwat said that in an interconnected world, India's dependence on trading partners should not turn into helplessness and that the country must focus on indigenous production."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aishwarya-rai-abhishek-bachchan-lawsuit-rs-4-crore-youtube-ai-deepfake-videos-personality-rights-2796604-2025-10-02",
      "headline": "Aishwarya, Abhishek sue YouTube for Rs 4 crore over alleged AI videosAishwarya Rai Bachchan and Abhishek Bachchan have filed a lawsuit against YouTube and Google, seeking Rs 4 crore in damages for alleged AI deepfake videos. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/sunny-sanskari-ki-tulsi-kumari-review-varun-dhawan-janhvi-kapoor-rom-com-2796536-2025-10-02",
      "headline": "Sunny Sanskari Ki review: Varun leads a shaky front in this lukewarm rom-comRelease Date:Thu Oct 02, 2025Sunny Sanskari Ki Tulsi Kumari movie review: Varun Dhawan and Shashank Khaitan reunite for 'Sunny Sanskari Ki Tulsi Kumari', a rom-com mixing classic Bollywood style with modern humour. The film entertains with witty dialogues but stumbles with a rushed climax and awkward scenes, says our review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/learn-how-adobe-express-is-making-graphic-design-fun-in-classrooms-2792611-2025-09-24",
      "headline": "Learn How Adobe Express Is Making Graphic Design Fun In ClassroomsThe Adobe Express app is available on any smart device or desktop computer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/travel/story/the-curious-case-of-ladakhs-pregnancy-tourism-aryan-race-2796175-2025-10-01",
      "headline": "The curious case of Ladakh's 'pregnancy tourism'The concept of pregnancy tourism takes a complete U-turn when you head deep into Ladakh's Aryan Valley, where the narrative around the phenomenon has little to do with a better life or social benefits. Here, the story is tangled up in myth, folklore, and a lingering obsession with \"racial purity.\""
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rajasthan-cough-syrup-fails-quality-tests-reinstated-free-medicine-scheme-2796635-2025-10-02",
      "headline": "Cough syrup that killed child in Rajasthan failed 40 tests but still soldEach time the syrup was blacklisted, the state's drug control and procurement systems facilitated the continued supply of the syrup through the Rajasthan Medical Services Corporation Limited."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pope-leo-xiv-blesses-glacier-ice-challenges-climate-change-deniers-2796541-2025-10-02",
      "headline": "Pope Leo's ice ritual, a veiled dig at Trump and a MAGA meltdownWithout naming anyone, history's first American pope spoke on climate change and slammed critics, just days after Donald Trump made false claims at the UN General Assembly (UNGA) about the \"con job\" of global warming."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/delta-planes-collide-new-york-airport-viral-video-aircraft-wing-detached-2796583-2025-10-02",
      "headline": "Passenger jets collide at New York airport, video shows aircraft's wing detachedThe collision at LaGuardia Airport also damaged the nose of one of the planes. Significant casualties were avoided as the planes were taxiing at low speed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/kantara-chapter-1-review-rishab-shetty-folklore-saga-is-a-spellbinding-spectacle-rukmini-vasanth-jayaram-2796510-2025-10-02",
      "headline": "Kantara Chapter 1 review: Rishab Shetty's folklore saga is a spellbinding spectacle Live UpdatesRelease Date:Thu Oct 02, 2025Kantara Chapter 1 movie review: Director, writer, and actor Rishab Shetty's film, also starring Rukmini Vasanth and Jayaram, explores the man vs nature conflict and land rights, blending them with divinity, folklore, myth, and faith. The film is a brilliant cinematic showcase."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rss-chief-mohan-bhagwat-vijayadashami-nepal-gen-z-protest-bangladesh-unrest-2796592-2025-10-02",
      "headline": "Public neglect breeds anger: RSS chief sounds alarm after Nepal unrestSpeaking during the RSS's centenary celebrations, Mohan Bhagwat said that forces attempting to create Nepal-like disturbances in India were active inside as well as outside the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/was-mahatma-gandhi-anti-science-2796270-2025-10-02",
      "headline": "Was Mahatma Gandhi anti-science?He criticised science that prioritised industrial and military gains over social justice and well-being. But there is more to him than meets the eye. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maza-aaya-nurse-shocker-after-haridwar-uttarakhand-woman-gives-birth-on-hospital-floor-2796586-2025-10-02",
      "headline": "Maza aaya? Nurse's shocker after Uttarakhand woman gives birth on hospital floorA pregnant woman in Haridwar delivered her baby on the hospital floor after allegedly being denied admission. After the delivery, one of the nurses mocked her saying, 'Mazaa aayaa?'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maharashtra-allows-shops-to-stay-open-247-bars-liquor-outlets-excluded-2796436-2025-10-01",
      "headline": "Maharashtra allows all-night shops, but bars remain barredMaharashtra government has allowed shops and establishments to operate 24/7, excluding liquor outlets. The move aims to boost business activity and ensure flexibility across the state."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/for-the-sake-of-kids-society-reality-of-silent-divorces-in-indian-homes-2796119-2025-10-01",
      "headline": "Married, but no connection: Reality of silent divorces in Indian homesSilent divorce is the reality of many Indian households. On paper and in society's eyes, couples remain married, but behind closed doors there is no emotional or physical connection. Rarely acknowledged, this situation often leaves people bitter, fuels mental health struggles, and has long-term consequences for children."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/nobel-prize-announcement-meet-the-indians-who-previously-won-the-coveted-award-2796354-2025-10-02",
      "headline": "Nobel Prize: Meet the Indians who have won the coveted awardAs the world awaits the announcement, India has a rich legacy of Nobel laureates who have excelled across various fields, including literature, peace, science, and economics. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/stress-screens-millennial-employees-face-70-percent-spike-in-heart-disease-risk-2796250-2025-10-02",
      "headline": "Stress, screens: Millennial employees face 70% spike in heart disease riskAccording to an analysis of over 30,000 employees, heart disease cases have risen by 40%, with chronic stress and demanding work schedules identified as major contributors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/deeply-ironic-to-lecture-on-human-rights-india-slams-pakistan-at-unhrc-glbs-2796534-2025-10-02",
      "headline": "Deeply ironic to lecture on human rights: India slams Pakistan at UNHRCAt the 34th meeting of the UNHRC's 60th session in Geneva on Wednesday, Indian diplomat Mohammed Hussain called out Islamabad's hypocrisy in unusually sharp terms."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/story/two-shooters-of-goldy-brar-gang-arrested-in-delhi-munawar-faruqui-was-target-2796576-2025-10-02",
      "headline": "Two shooters of Goldy Brar gang arrested in Delhi, Munawar Faruqui was targetThe two shooters, acting on orders from gangsters Rohit Godara, Goldy Brar, and Virender Charan, had been plotting the murder of a social media influencer, reportedly Munawar Faruqui, and had conducted reconnaissance of their targets in Mumbai and Bengaluru."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afg-vs-ban-afghanistan-rashid-khan-blames-media-for-second-best-in-asia-tag-2796645-2025-10-02",
      "headline": "Afghanistan's Rashid Khan blames media for 'second-best in Asia' tag Afghanistan captain Rashid Khan responded to criticism following his team's group-stage exit from the Asia Cup 2025, stressing that the 'Asia's second-best team' label was coined by media and fans, not the players."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-under-19-dominate-australia-u19-innings-58-runs-win-brisbane-2796636-2025-10-02",
      "headline": "India U19 hammer Australia U19 in 1st Youth Test after Devendran, Suryavanshi heroics India U19 crushed Australia U19 by an innings and 58 runs in Brisbane, powered by Vaibhav Suryavanshi's explosive 113, Vedant Trivedi's composed 140, and Deepesh Devendran's eight wickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-women-cricket-world-cup-qualification-spin-attack-nigar-sultana-performance-2794391-2025-10-02",
      "headline": "Bangladesh in for major learning curve amongst heavyweights Bangladesh will play in the Women's World Cup after sealing their spot through a stroke of fortune in the qualifiers, benefiting from West Indies' net run-rate miscalculation despite losing control of their own fate. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/catherine-debrunner-wins-three-gold-medals-world-para-athletics-new-delhi-2796615-2025-10-02",
      "headline": "Catherine Debrunner wins three golds at World Para Athletics in New Delhi Swiss wheelchair racer Catherine Debrunner made history by securing her third gold medal at the World Para Athletics Championships in New Delhi. She set a new championship record in the 1500m T54 event as well."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fc-goa-lose-to-fc-istiklol-2-0-in-afc-champions-league-group-d-2796614-2025-10-02",
      "headline": "AFC Champions League: FC Goa loses to FC Istiklol in Two Group D clash FC Goa lost 0-2 to FC Istiklol in their second AFC Champions League Group D match, as the Tajik champions secured their first win of the campaign."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kuldeep-yadav-test-comeback-india-vs-west-indies-ahmedabad-2796600-2025-10-02",
      "headline": "Kuldeep Yadav returns to India's Test side after almost a year vs West Indies Kuldeep Yadav's extended absence from India's Test side ended on Thursday, with the left-arm wrist-spinner named in the playing XI for the opening match of the two-Test series against West Indies at Ahmedabad's Narendra Modi Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-returns-test-cricket-workload-asia-cup-win-pakistan-2796581-2025-10-02",
      "headline": "No rest for Bumrah as India pacer plays 1st Test days after Asia Cup final India vs West Indies, 1st Test: Just days after leading India to their Asia Cup 2025 triumph over Pakistan, Jasprit Bumrah was back in action in the first Test against West Indies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/barcelona-vs-psg-champions-league-hansi-flick-2796559-2025-10-02",
      "headline": "Hansi Flick blames fatigue after PSG down Barcelona 2-1 in Champions League Barcelona coach Hansi Flick has complained about fatigue after his team fell to a 1-2 defeat against PSG in the Champions League. Barcelona were dominated in the second half by a second string PSG side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-weat-indies-1st-test-live-score-shubman-gill-roston-chase-ahmedabad-2796548-2025-10-02",
      "headline": "1st Test Live: Siraj removes Roston chase right after Lunch India (IND) vs West Indies (WI), Live Score 1st Test: A stunning start for India after Lunch. Mohammed Siraj removes captain Roston Chase and dents the Windies innings further."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kuldeep-yadav-test-comeback-india-vs-west-indies-ahmedabad-2796600-2025-10-02",
      "headline": "Kuldeep Yadav returns to India's Test side after almost a year vs West Indies Kuldeep Yadav's extended absence from India's Test side ended on Thursday, with the left-arm wrist-spinner named in the playing XI for the opening match of the two-Test series against West Indies at Ahmedabad's Narendra Modi Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-returns-test-cricket-workload-asia-cup-win-pakistan-2796581-2025-10-02",
      "headline": "No rest for Bumrah as India pacer plays 1st Test days after Asia Cup final India vs West Indies, 1st Test: Just days after leading India to their Asia Cup 2025 triumph over Pakistan, Jasprit Bumrah was back in action in the first Test against West Indies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/barcelona-vs-psg-champions-league-hansi-flick-2796559-2025-10-02",
      "headline": "Hansi Flick blames fatigue after PSG down Barcelona 2-1 in Champions League Barcelona coach Hansi Flick has complained about fatigue after his team fell to a 1-2 defeat against PSG in the Champions League. Barcelona were dominated in the second half by a second string PSG side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-weat-indies-1st-test-live-score-shubman-gill-roston-chase-ahmedabad-2796548-2025-10-02",
      "headline": "1st Test Live: Siraj removes Roston chase right after Lunch India (IND) vs West Indies (WI), Live Score 1st Test: A stunning start for India after Lunch. Mohammed Siraj removes captain Roston Chase and dents the Windies innings further."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}