{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/fd-tips-loss-emergency-fund-mistake-insurance-fund-personal-finance-money-saving-2764639-2025-08-01",
      "headline": "CA explains why you should not use FDs as an emergency fundAccording to RBI guidelines, banks can charge up to 0.5% to 1.0% of the interest rate as a penalty if FDs are broken before their maturity period."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/no-compromise-on-agriculture-dairy-farmers-interest-government-sources-on-us-tariff-2764724-2025-08-01",
      "headline": "No compromise on agriculture, farmers' interest: Government sources on tariffsAn official said that the government is closely watching the developments but sees no reason for alarm after the US imposed a 25% tariff on India. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/jane-street-news-probe-not-cooperating-staff-income-tax-department-books-outside-india-report-2764710-2025-08-01",
      "headline": "Jane Street not cooperating in probe with income tax department: ReportThe firm's servers are located outside India, and officials said they are unable to access them. Additionally, accounts books are also being maintained overseas, even though company law requires them to be kept in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/planning-to-buy-a-car-without-taking-loan-heres-how-you-can-do-it-2764705-2025-08-01",
      "headline": "Planning to buy a car without taking loan? Here's how you can do itThink you need a big salary or bank loan to own a car? Think again. A thoughtful plan, regular savings, and side gigs helped one man save Rs 7.1 lakh in three years, all without borrowing a rupee. Here's how you can do it too."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/pnb-housing-finance-ltd-share-crash-18-percent-today-4-month-low-reason-md-ceo-resign-girish-kousgi-2764659-2025-08-01",
      "headline": "Explained: Why PNB Housing Finance Ltd shares crashed 18% todayPNB Housing Finance Ltd share crash: The steep fall followed days of weak performance. Over the past five days, the stock has lost 19.59%, and in the last month, it has dropped 26.53%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/new-tax-rules-coming-soon-how-the-income-tax-bill-2025-could-impact-you-2764621-2025-08-01",
      "headline": "New tax rules coming soon. How the Income Tax Bill 2025 could impact youThe new law aims to make income tax rules easier to understand, reduce legal disputes, and help people comply with tax rules more easily. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/sebi-upcoming-ipo-proposal-equity-dilution-25-percent-rule-report-2764605-2025-08-01",
      "headline": "Sebi may relax IPO float norms for big firms to just 2.5% equity: ReportAt present, Sebi rules say that any company with a post-issue capital of more than Rs 1 lakh crore must offer 5% equity and raise at least Rs 5,000 crore. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/ed-investigates-anil-ambani-in-loan-fraud-case-summoned-on-august-5-2764523-2025-08-01",
      "headline": "ED investigates Anil Ambani in loan fraud case, summoned on August 5The Enforcement Directorate (ED) has summoned Anil Ambani for questioning on August 5 in the national capital. This is in connection with an investigation into an alleged loan fraud of Rs 12,500 crore. The development follows multiple searches the ED carried out at 35 locations in Mumbai, targeting business entities linked to the Anil Ambani group under the Prevention of Money Laundering Act (PMLA). The probe agency's action is also based on findings from a separate investigation by the Securities and Exchange Board of India (SEBI). A key point in the investigation is an alleged diversion of funds, with the transcript stating, \"The development actually came after the SEBI shared with the enforcement directorate the findings of a separate probe that launched into the alleged diversion of 10,000 crore by the Reliant infrastructure.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/anil-ambani-ed-summon-loan-fraud-news-august-5-questioning-enforcement-directorate-sebi-report-findings-2764568-2025-08-01",
      "headline": "Why has ED summoned Anil Ambani on August 5Anil Ambani, chairman and managing director of Reliance Group, has been summoned by the Enforcement Directorate (ED) for questioning on August 5. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-sensex-opens-168-points-lower-nifty-below-24800-hul-gains-4-percent-2764538-2025-08-01",
      "headline": "Sensex opens 168 points lower, Nifty below 24,800; HUL gains 4%The S&P BSE Sensex was down by 150.77 points to 81,034.81, while the NSE Nifty50 lost 62.50 points to 24,705.85 as of 9:47 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-new-tariff-rate-69-countries-august-7-us-news-trade-deal-india-syria-eu-china-canada-2764532-2025-08-01",
      "headline": "Trump's new tariffs hit 69 nations: See who pays most and least from August 7The new order on tariffs will take effect from August 7 and will range from 10% to 41%, depending on the country, while others not mentioned in the list will face a default import duty of 10%."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/enforcement-directorate-summons-anil-ambani-on-august-5-a-week-after-raids-at-several-locations-linked-to-him-2764516-2025-08-01",
      "headline": "ED summons Anil Ambani on August 5 amid fresh raids in Odisha, BengalAnil Ambani has been asked to appear before officials on August 5 at the ED headquarters in New Delhi."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/indian-refiners-halt-russian-oil-buys-amid-shrinking-deals-report-glbs-2764501-2025-08-01",
      "headline": "Indian state refiners halt Russian oil imports as US threatens penalty: ReportState-run refiners in India have halted Russian oil purchases in the past week due to shrinking discounts and mounting pressure from former US President Donald Trump's threats of tariffs and sanctions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/womens-workforce-participation-is-very-low-kalpana-viswanath-ceo-safetipin-2764307-2025-07-31",
      "headline": "Women's workforce participation is very low; Kalpana Viswanath, CEO SafetipinIn a powerful discussion on women's rights and safety, a call was made for systemic change over waiting for patriarchal mindsets to shift. 'We just need the right to walk safely without looking over our shoulders,' one speaker emphasised, highlighting that safety is a right, not a form of protection. The conversation revealed that women hold less than 2% of jobs in the burgeoning gig economy, a stark contrast to their participation in the traditional economy. The panel also explored how urban infrastructure and product design often have a male-as-norm bias, from the height of bus handrails to the lack of pockets in women's clothing. The dialogue touched upon the 'pink tax' in transportation, where trip-chaining results in higher travel costs for women. The need for an enabling environment, including better public transport and services, was stressed as crucial for women's economic and social participation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/fenesta-cmo-susmita-nag-discusses-gender-bias-in-hiring-within-professional-workspaces-2764268-2025-07-31",
      "headline": "Fenesta CMO Susmita Nag discusses gender bias in hiring within professional workspacesA discussion highlights the stark reality for women in India's corporate sector, where they make up only 18% of the workforce in top NSE-listed companies. A woman leader recounted her early career in the late 90s, where she was told the company 'don't hire girls' and faced a lack of basic facilities like restrooms and proper safety gear in a factory setting. Another speaker addressed the issue of tokenism on corporate boards, suggesting that having three or more women in a group forms a cohort, whereas one is mere tokenism. The conversation delved into unconscious biases in hiring, noting that women's resumes are scrutinised for marital status more often than men's. The speakers emphasised that while policies like flexi-working exist, they can lead to subtle penalties and that a fundamental mindset shift, beyond just policy changes, is crucial for true gender equity in the workplace."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/itr-refund-delayed-check-your-status-in-these-2-easy-ways-2764267-2025-07-31",
      "headline": "ITR refund delayed? Check your status in these 2 easy waysUsually, if your return is e-verified, the refund is credited within four to five weeks. But if you're still waiting, you can easily check your refund status online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/lead-from-the-front-pallavi-shroff-on-breaking-barriers-building-legacies-2764235-2025-07-31",
      "headline": "Lead from the front: Pallavi Shroff on breaking barriers, building legaciesSpeaking at the India Today Woman Summit 2025, Pallavi S Shroff, Managing Partner, Shardul Amarchand Mangaldas said that when she began her practice in 1981, there were barely four or five women arguing cases in court. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-will-take-all-steps-to-protect-national-interests-piyush-goyal-on-us-tariffs-2764217-2025-07-31",
      "headline": "India set to be 3rd largest economy: Minister after Trump's 'dead economy' jabThe minister's remarks come amid rising concerns over the broader implications of the US move, including potential delays to the ongoing trade deal talks and uncertainty in sectors heavily reliant on US markets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/women-had-to-work-twice-as-hard-pallavi-shroff-reflects-on-male-dominated-profession-2764126-2025-07-31",
      "headline": "Women had to work twice as hard: Pallavi Shroff reflects on male-dominated professionPallavi Shroff, Managing Partner at Shardul Amarchand Mangaldas & Co., spoke on her four-decade journey in a male-dominated legal profession. Shroff stated that when she began, women had to 'work twice as hard to prove that we are half as good as our male colleagues'. She recounted starting her practice in 1981, facing clients who refused to meet a woman lawyer and judges who were dismissive. A significant turning point came in 1991 when a client, for a matter in the Allahabad High Court, chartered a flight for her as she was unable to travel by train after a surgery. Shroff also discussed the challenges for women in the Indian judiciary, the existence of unconscious bias, the handling of an $11 billion deal by an all-women team, and her view that leadership means leading from the front with humility and compassion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/nsdl-mb-engineering-sri-lotus-ipo-best-listing-gains-latest-gmp-subscription-2764201-2025-07-31",
      "headline": "NSDL vs M&B Engineering vs Sri Lotus: Which one shows the best listing gains?While all three IPOs have seen investor interest, one of them appears to offer the highest possible listing gains based on current grey market premium (GMP) data."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-donald-trump-trade-tariff-blow-25-percent-india-what-is-at-stake-2764192-2025-07-31",
      "headline": "US trade tariff blow: How much can India really lose?Analysts say the direct hit could affect over $3 billion worth of annual shipments, though the broader impact on India's GDP is expected to be limited."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-296-points-lower-nifty-below-24800-hul-up-4-2764181-2025-07-31",
      "headline": "Sensex ends 296 points lower, Nifty below 24,800; HUL up 4%The S&P BSE Sensex was down by 296.28 points to end at 81,185.58, while the NSE Nifty50 lost 86.70 points to close at 24,768.35. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/ca-explains-how-avoiding-a-rs-5000-splurge-every-month-can-make-you-a-crorepati-2764129-2025-07-31",
      "headline": "CA explains how avoiding a Rs 5,000 splurge every month can make you a crorepatiYoung professionals often burn out chasing income, yet let their money idle. A Chartered Accountant suggests ditching one Rs 5,000 splurge a month and letting compounding turn it into crores."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-india-25-percent-tariff-sectors-risk-exports-business-strategy-oil-healthcare-auto-agriculture-donald-trump-import-duty-2764106-2025-07-31",
      "headline": "US tariff of 25% puts several sectors at risk, but what's the fix?Experts said that sectors like gems and jewellery, seafood exports, and auto components are likely to feel the immediate effects of the 25% tariffs announced by the US. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-indian-farm-market-is-coming-in-between-india-and-us-tariff-negotiations-2764038-2025-07-31",
      "headline": "Behind the delayed US-India trade deal: A standoff over farmsAt the centre of the friction is a long-standing issue that has repeatedly stalled negotiations between the two countries: agriculture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/donald-trump-us-25-percent-tariff-on-india-impact-stock-market-sectors-explained-2764076-2025-07-31",
      "headline": "Trump's 25% tariffs: These stocks and sectors are in the firing lineBoth the main indices on Dalal Street fell sharply in early trade, and despite recovering by noon, the mood remains tense after Washington's move threatened to upend trade flows across key sectors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/6-indian-firms-sanctioned-by-us-all-you-need-to-know-2764015-2025-07-31",
      "headline": "Who are the 6 Indian firms sanctioned by the US and what's at stake?Six Indian firms have been sanctioned by the US for allegedly importing Iranian petrochemicals. Here's all you need to know about them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-u-now-open-update-your-past-itr-mistakes-for-ay-2021-22-and-2022-23-2764013-2025-07-31",
      "headline": "ITR-U now open: Update your past ITR mistakes for AY 2021-22 and 2022-23The Income Tax Department has now made it possible to file updated returns (ITR-U) for Assessment Years (AY) 2021-22 and 2022-23 using the ITR-1 and ITR-2 forms. This move aims to help people fix any errors or income details they may have missed earlier."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-india-trade-deal-25-percent-tariff-which-sectors-most-impacted-gems-jewellery-2764005-2025-07-31",
      "headline": "Trump's 25% tariffs: Which sectors should brace for impact?US President Donald Trump announced a 25% tariff on Indian exports starting August 1.  An additional penalty was also announced for India's continued oil purchases from Russia, which has added more uncertainty for businesses."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/donald-trump-us-tariff-dual-hit-for-india-economy-stock-market-exporters-investors-2763992-2025-07-31",
      "headline": "Explained: Why Trump's 25% tariff is a double whammy for IndiaThe move comes at a time when Indian exports are already under pressure and global demand remains uneven. It also marks a sharp deterioration in bilateral negotiations that had, until recently, appeared to be progressing toward a limited trade understanding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-down-today-stock-market-fall-why-reasons-us-tariff-it-shares-ril-adani-port-decline-2763979-2025-07-31",
      "headline": "Sensex falls 500 points: Why is stock market down todayHeavyweight stocks fell in early trade. The S&P BSE Sensex fell over 575 points in early trade to 80,907.34, while the NSE Nifty50 dropped 185 points to 24,670.15 by 10 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-india-tariff-king-hypocrisy-donald-trump-american-duties-up-to-350-percent-2763962-2025-07-31",
      "headline": "US calls India the 'tariff king'. But its own duties go as high as 350%Donald Trump has called India tariff king, but the U.S. quietly charges 350% on milk, tobacco, and fruit.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-590-points-lower-nifty-below-24700-ril-shares-fall-2-percent-2763938-2025-07-31",
      "headline": "Sensex opens 590 points lower, Nifty below 24,700; RIL shares fall 2%The S&P BSE Sensex lost 536.92 points to 80,944.94, while the NSE Nifty50 lost 156.35 points to 24,698.70 as of 9:26 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-25-percent-tariff-india-us-trade-deal-not-confirmed-why-reason-dairy-agriculture-sector-import-duty-2763923-2025-07-31",
      "headline": "Trump announces 25% tariff: Why India and US still don't have a trade dealDespite several rounds of talks, the two nations have not managed to bridge key differences. Speaking at a press conference at the White House, Trump said that India remains one of the highest tariff-imposing countries in the world, but discussions are underway."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bse-nse-trading-setup-us-tariff-fed-rate-cut-sensex-nifty-today-2763912-2025-07-31",
      "headline": "US imposes 25% tariff on India. Will Sensex, Nifty crash today?The GIFT Nifty futures, which reflect early cues for the market, were trading 179 points lower at 24,675, down 0.73%, signalling a weak start for Dalal Street."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-imposes-25-percent-trump-tariff-on-india-what-it-means-for-exports-and-key-sectors-2763759-2025-07-30",
      "headline": "US imposes 25% tariff on India: What it means for exports and key sectorsThe newly announced duties target several of India's top-performing export sectors, like auto components, steel, aluminum, smartphones, gems and jewellery. Pharmaceuticals, semiconductors, and critical minerals, however, have been excluded."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-the-subscription-lifestyle-is-fuelling-a-new-wave-of-debt-emi-bpnl-schemes-2763577-2025-07-30",
      "headline": "How the subscription lifestyle is fuelling a new wave of debtFrom entertainment and food to wellness and shopping, subscription models are everywhere. While they promise convenience, they're also leading many into silent debt traps, especially the younger, digital-savvy crowd."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-ends-highe-lt-shares-rise-4-percent-india-us-trade-deal-2763608-2025-07-30",
      "headline": "Sensex closes 144 points higher, Nifty above 24,800; L&T up 4%The S&P BSE Sensex gained 143.91 points to close at 81,481.86, while the NSE Nifty50 added 33.95 points to end at 24,855.05. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/mb-engineering-ipo-subscription-gmp-details-review-apply-or-not-listing-gains-2763566-2025-07-30",
      "headline": "M&B Engineering IPO: Should you subscribe? Check GMP, subscription on Day 1The IPO consists of a fresh equity issue worth Rs 275 crore and an offer-for-sale (OFS) worth Rs 375 crore by the company's promoters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/central-government-staff-opt-for-unified-pension-scheme-low-adoption-explained-2763603-2025-07-30",
      "headline": "Only 1.35% central government staff opt for Unified Pension Scheme. Here's whyAs of July 20, 2025, only 30,989 employees have chosen UPS out of approximately 23 lakh (2.3 million) employees enrolled in NPS, marking a participation rate of just 1.35%."
    }
  ],
  "entertainment": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/disha-patani-sister-khushboo-clarifies-remarks-directed-at-aniruddhacharya-not-premanand-ji-2764712-2025-08-01",
      "headline": "Khushboo Patani clarifies: Remarks directed at Aniruddhacharya, not Premanand JiActor Disha Patani's sister Khusboo Patani clarified that her comments were directed at Aniruddhacharya's misogynistic views and not about spiritual leader Premanand Ji Maharaj. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saiyaara-star-aneet-gets-touching-tribute-from-her-school-still-that-girl-in-uniform-2764760-2025-08-01",
      "headline": "Saiyaara star Aneet gets touching tribute from her school: Still that girl in uniformLong before she lit up the big screen in 'Saiyaara', Aneet Padda was just a girl in a school uniform, dreaming quietly in a classroom in Amritsar. This week, her alma mater reminded her, and the world, where it all began, with a tribute that brought both tears and gratitude."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kyunki-saas-bhi-kabhi-bahu-thi-episode-3-update-tulsi-finally-gets-her-due-wrinkle-weight-and-husband-who-sees-her-2764745-2025-08-01",
      "headline": "Kyunki Episode 3: Tulsi finally gets her due-wrinkles, weight, husband who sees herKyunki Saas Bhi Kabhi Bahu Thi new episode: In a rare moment of honesty on Indian television, Mihir tells Tulsi that her wrinkles aren't signs of ageing but marks of sacrifice - lines etched by years of holding her family together. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-visit-lagaans-kunariya-village-after-25-years-sitaare-zameen-par-screening-2764750-2025-08-01",
      "headline": "Aamir Khan to visit Lagaan's Kunariya village after 25 years for special screeningAamir Khan is set to visit the 'Lagaan' village near Bhuj for the special screening of his film 'Sitaare Zameen Par.' The film released in theatres on June 20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aamir-khan-sitaare-zameen-par-premieres-on-youtube-pay-per-view-model-what-it-means-for-the-industry-2764746-2025-08-01",
      "headline": "What Sitaare Zameen Par's pay-per-view release on YouTube means for the industryAamir Khan has taken a bold step by releasing his film 'Sitaare Zameen Par' on YouTube via pay-per-view for Rs 100, marking a fresh attempt to revive TVOD in India. This move challenges traditional theatrical norms and aims to leverage YouTube's massive reach. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/my-oxford-year-review-sofia-carson-corey-mylchreest-love-loss-2764731-2025-08-01",
      "headline": "My Oxford Year review: An imperfect yet effective slow-burn anchored by Sofia, CoreyRelease Date:Fri Aug 01, 2025'My Oxford Year' movie review: 'My Oxford Year' is a reflective romantic drama about love's true meaning and impermanence. The film invites viewers to cherish moments of love beyond grand gestures and melodrama."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kingdom-box-office-vijay-deverakonda-film-breaks-record-earns-rs-15-crore-2764718-2025-08-01",
      "headline": "Kingdom box office Day 1: Vijay Deverakonda's film breaks record, earns Rs 15 croreVijay Deverakonda broke a record with his latest release 'Kingdom'. The film witnessed an impressive opening as it earned Rs 15 crore on the first day. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/whats-wrong-with-secretary-kim-perfect-starter-k-drama-beginners-2764667-2025-08-01",
      "headline": "Why What's Wrong with Secretary Kim is the perfect starter K-drama for newbiesLooking to start your K-drama journey? What's Wrong with Secretary Kim is the perfect beginner-friendly Korean drama packed with romance, comedy, and classic tropes that will leave you hooked."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/happy-gilmore-2-review-adam-sandler-returns-with-a-swing-and-a-hole-lot-of-heart-2764649-2025-08-01",
      "headline": "Happy Gilmore 2 review: Adam Sandler returns with a swing and a hole lot of heartRelease Date:Fri Jul 25, 2025Happy Gilmore 2 movie review: 'Happy Gilmore 2' sees Adam Sandler return with his trademark humour. The film balances comedy, family drama, and nostalgia, making it a heartfelt and entertaining watch for audiences across"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ali-fazal-meets-pedro-pascal-on-flight-and-the-internet-is-loving-it-2764679-2025-08-01",
      "headline": "Ali Fazal bumps into Pedro Pascal on flight, and the internet is loving itBollywood actor Ali Fazal has sparked curiosity among fans by sharing a mysterious photo with Hollywood star Pedro Pascal during a flight. The encounter has ignited excitement and speculation across. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/video/exclusive-sofia-carson-corey-mylchreest-on-my-oxford-year-bollywood-love-language-india-today-2764663-2025-08-01",
      "headline": "Exclusive: Sofia Carson, Corey Mylchreest on My Oxford Year, Bollywood, love language | India TodayIn an exclusive chat with India Today's Bhavna Agarwal, Sofia Carson and Corey Mylchreest open up about their simmering chemistry in My Oxford Year, what's their love language, and a possible Bollywood project!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/pain-behind-kishore-kumar-madness-the-real-anand-2764603-2025-08-01",
      "headline": "The Real Anand: The Pain Behind Kishore Kumar's MadnessKishore Kumar's eccentricities revealed a paradoxical genius whose soulful voice illuminated millions, masking a life of solitude and inner turmoil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kiara-advani-most-special-birthday-celebration-baby-sidharth-malhotra-war-2-2764654-2025-08-01",
      "headline": "My baby, husband and parents: Kiara Advani's most special birthday celebration yetActor and new mother Kiara Advani shared a post and gave a glimpse of her intimate celebrations at home with her baby, husband Sidharth Malhotra, and parents. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/son-of-sardaar-2-x-reviews-fans-call-ajay-devgn-starrer-cringe-and-disappointment-2764631-2025-08-01",
      "headline": "Son of Sardaar 2 X reviews: Fans call it loud, crowd-pleasing and cringeAjay Devgn's much-awaited comedy sequel 'Son of Sardaar 2' has hit theatres, drawing mixed reactions from audiences. While some praised its masala entertainment, others called it a disappointing and forgettable follow-up."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/rajiv-thakur-removed-great-indian-kapil-show-netflix-comedian-clarifies-2764575-2025-08-01",
      "headline": "Rajiv Thakur removed from Great Indian Kapil Show? Comedian clarifiesComedian Rajiv Thakur recently reacted to reports of him being removed from 'the new season of The Great Indian Kapil Show'. He clarified that nobody takes a break from such huge shows. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/son-of-sardaar-2-movie-review-ajay-devgn-lands-india-pakistan-jokes-not-the-film-2764562-2025-08-01",
      "headline": "Son of Sardaar 2 review: Ajay Devgn lands India-Pakistan jokes, not the filmRelease Date:Fri Aug 01, 2025Son of Sardaar 2 movie review: Ajay Devgn returns as Jassi, a Sardaar lost in Scotland and even more lost in the plot. With forced humour, awkward chemistry, and India-Pakistan punchlines doing the heavy lifting, 'Son of Sardaar 2' struggles to match the charm or chaos of the first film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/ishita-dutta-hospitalised-son-vaayu-weeks-after-birth-of-second-child-vatsal-sheth-2764549-2025-08-01",
      "headline": "Ishita Dutta, son hospitalised weeks after actor delivered second childActor Ishita Dutta posted a photo on her Instagram story showing her and her two-year-old son Vaayu with IV drips in the hospital. This came after she gave birth to her second child.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranbir-kapoor-arjun-kapoor-bromance-shines-step-out-for-outing-viral-videos-2764548-2025-08-01",
      "headline": "Ranbir and Arjun Kapoor's bromance shines as they step out for outing. WatchRanbir Kapoor and Arjun Kapoor stepped out for an outing together on July 31. Videos of the two posing for the paparazzi with their friends have gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/vaibhav-raj-gupta-on-breaking-the-gullak-annu-bhaiya-mould-in-vikram-singh-mandala-murders-exclusive-2764243-2025-08-01",
      "headline": "Actor Vaibhav Raj Gupta on breaking the Gullak mould in Mandala MurdersVaibhav Raj Gupta, best known as the lovable Annu Bhaiya from TVF's 'Gullak', took a bold leap into darker territory with Netflix's 'Mandala Murders'. In an exclusive interview, the actor opened up about breaking out of typecasting, navigating life as an outsider in Mumbai, and the process behind bringing his latest role to life."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/prajwal-revanna-former-jds-mp-convicted-for-rape-breaks-down-in-court-2764732-2025-08-01",
      "headline": "Ex-JDS MP Prajwal Revanna convicted for rape, verdict came in just 14 monthsA Karnataka special court has convicted former JDS MP Prajwal Revanna in a rape case filed by a domestic worker. The verdict came just 14 months after a case was filed against him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/election-commission-rebuts-rahul-gandhi-vote-theft-charge-bihar-roll-revision-sir-2764771-2025-08-01",
      "headline": "Don't pay heed: Poll body rebuts Rahul Gandhi's 'vote theft' chargeDon't pay heed to such irresponsible statements: Poll body rebuts Rahul Gandhi's 'vote theft' charge"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/no-compromise-on-agriculture-dairy-farmers-interest-government-sources-on-us-tariff-2764724-2025-08-01",
      "headline": "No compromise on agriculture, farmers' interest: Government sources on tariffsAn official said that the government is closely watching the developments but sees no reason for alarm after the US imposed a 25% tariff on India. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-eng-5th-test-chris-woakes-injury-update-ruled-out-2764755-2025-08-01",
      "headline": "Seamer Chris Woakes ruled out of the final Test due to shoulder injuryIndia vs England: England pacer Chris Woakes will play no further part in the 5th Test match, the team announced at the start of Day 2 of the final Test match. Woakes was injured while fielding on Day 1 at The Oval."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/israel-gaza-palestine-attack-family-food-truck-firing-killed-satellite-image-2764676-2025-08-01",
      "headline": "Gaza's haunting reality: Satellite image shows crowd swarming aid trucksScores of Palestinians, including women and children, were killed in the pas few weeks as they queued for food trucks in Gaza, which is facing a worst-case scenario of man-made famine."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/air-india-dreamliner-crash-investigation-transat-236-a330-emergency-landing-glide-portugal-midair-engine-failure-2764467-2025-08-01",
      "headline": "Engines dead, pilots glided plane for 120km over ocean, saved 306 livesWhen both engines of Transat Flight 236 from Canada to Portugal died out midair over the Atlantic Ocean in 2001 due to a fuel leak, it was still 120km short of an airstrip. The pilots glided the plane to safety, creating a world record and saving 306 people onboard, in what is now known as the Miracle on the Azores."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shashi-tharoor-rebuts-donald-trumps-dead-economy-jibe-after-congrsss-rahul-gandhis-endorsement-2764737-2025-08-01",
      "headline": "Not the case: Shashi Tharoor differs with Rahul Gandhi's stance on Trump remarksCongress MP Shashi Tharoor rejected US President Donald Trump's remark calling India a \"dead economy,\" apparently countering fellow Congress leader Rahul Gandhi who had supported the statement a day earlier."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/we-look-up-each-time-a-plane-takes-off-inside-ground-zero-of-air-india-crash-2764211-2025-07-31",
      "headline": "'We look up each time a plane takes off': Inside Ground Zero of Air India crashHow students and faculty at Ahmedabad's Byramjee Jeejeebhoy Medical College are coping with the trauma"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/pain-behind-kishore-kumar-madness-the-real-anand-2764603-2025-08-01",
      "headline": "The Real Anand: The Pain Behind Kishore Kumar's MadnessKishore Kumar's eccentricities revealed a paradoxical genius whose soulful voice illuminated millions, masking a life of solitude and inner turmoil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/flipkart-freedom-sale-tablets-get-their-biggest-price-drop-of-the-year-2764360-2025-07-31",
      "headline": "Flipkart Freedom Sale: Tablets Get Their Biggest Price Drop of the YearFor buyers looking to invest in a new device, this could be the best chance before the festive season arrives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-slams-cisf-presence-in-rajya-sabha-during-protest-mallikarjun-kharge-jairam-ramesh-2764772-2025-08-01",
      "headline": "Astonished, shocked: Congress slams CISF presence in Rajya Sabha during protestThe Congress on Friday condemned the deployment of CISF personnel inside the Rajya Sabha during an Opposition protest as \"most objectionable,\" with party chief Mallikarjun Kharge urging the Deputy Chairman to prevent such actions in the future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhadak-2-review-siddhant-chaturvedi-triptii-dimri-casteism-brave-hesitates-to-roar-2764526-2025-08-01",
      "headline": "Dhadak 2 review: Siddhant-Triptii's film on casteism is brave but hesitates to roarRelease Date:Fri Aug 01, 2025Siddhant Chaturvedi and Triptii Dimri's 'Dhadak 2' released in theatres today. The film is a bold attempt at the caste system in India, but pulls back from a full roar. Read our review to know more. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/video-20-minute-long-lightning-spectacle-seen-from-fight-to-india-2764723-2025-08-01",
      "headline": "Video: 20-minute-long lightning spectacle seen from flight to IndiaEyewitnesses aboard the flight reported seeing near-continuous flashes of lightning outside their windows for more than 20 minutes as the plane navigated the weather system. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/election-commission-will-publish-draft-bihar-electoral-rolls-on-its-website-at-3-pm-amid-opposition-uproar-2764647-2025-08-01",
      "headline": "Amid uproar, draft Bihar electoral rolls published. What next, SIR?Bihar SIR: The special intensive revision of the electoral rolls of poll-bound Bihar has triggered widespread panic and confusion on the ground as well as vehement protests by the opposition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/ktaka-lokayukta-seizes-rs-30-crore-assets-from-kridl-ex-clerk-earning-rs-15000-salary-2764578-2025-08-01",
      "headline": "Raids on ex-Karnataka clerk unearth Rs 30 crore in assets, including 24 housesA former clerk at Karnataka Rural Infrastructure Development Limited is under investigation after a Lokayukta raid revealed massive wealth, including houses, land and jewellery, worth over Rs 30 crore. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/malegaon-blast-probe-officer-ordered-arrest-of-rss-chief-mohan-bhagwat-retired-ats-inspector-2764593-2025-08-01",
      "headline": "Malegaon blast probe officer ordered RSS chief's arrest: Retired cop's bombshellA retired Maharashtra ATS officer has alleged that he was directed to arrest RSS chief Mohan Bhagwat to build a 'saffron terror' narrative in the 2008 Malegaon blast case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/unpaid-internship-when-companies-make-you-work-for-free-2764295-2025-08-01",
      "headline": "Brand names, empty wallets: The harsh reality of unpaid internships in IndiaDespite contributing to real work and even high-stakes projects, many students across India still take unpaid internships, often with top companies, just for 'exposure.' While the experience may be rewarding, the financial and emotional costs run deep, especially for those from modest backgrounds. So why do unpaid internships continue to thrive in even the most reputed organisations?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/photo-essay/world-lung-cancer-day-one-puff-many-scars-a-journey-inside-smoker-lungs-280-01-08-2025",
      "headline": "One puff, many scars: A journey inside smoker's lungsYou can't rewind lung damage, but you can stop fast-forwarding it. Start with awareness, and let knowledge be your breath of fresh air."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/election-to-pick-next-vice-president-after-jagdeep-dhankhars-resignation-to-be-held-on-september-9-2764677-2025-08-01",
      "headline": "Vice Presidential poll scheduled for September 9 after Jagdeep Dhankhar's exitThe Election Commission has scheduled the 17th Vice-Presidential election for September 9, following Jagdeep Dhankhar's resignation due to health reasons. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/what-online-shopping-says-about-your-mind-2764162-2025-08-01",
      "headline": "What online shopping says about your mindDoes adding to cart feel more satisfying than walking through a mall and browsing stores? This habit might say more about your mental health than you think. While it could just be about convenience, for some, it may reflect deeper needs like comfort, control, or a way to avoid social situations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/happy-gilmore-2-review-adam-sandler-returns-with-a-swing-and-a-hole-lot-of-heart-2764649-2025-08-01",
      "headline": "Happy Gilmore 2 review: Adam Sandler returns with a swing and a hole lot of heartRelease Date:Fri Jul 25, 2025Happy Gilmore 2 movie review: 'Happy Gilmore 2' sees Adam Sandler return with his trademark humour. The film balances comedy, family drama, and nostalgia, making it a heartfelt and entertaining watch for audiences across"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/modi-nehru-fixation-what-explains-it-by-rajdeep-sardesai-2764370-2025-08-01",
      "headline": "Why Modi feels the need to demolish NehruAt the Lok Sabha, while Modi punched hard at his critics on the government's handling of Operation Sindoor, there was a familiar name from the past that kept recurring throughout his speech. On 14 occasions, the prime minister referred to the 'sins' of one of his predecessors, Jawaharlal Nehru. Which leads one to ask: what explains Modi's Nehru fixation? "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/andhra-minister-bc-janardhan-reddys-cousin-arrested-for-allegedly-slapping-constable-during-temple-inauguration-in-nandyal-2764606-2025-08-01",
      "headline": "Caught on camera: Andhra Minister's cousin slaps cop at temple, arrestedDuring a temple inauguration in Andhra Pradesh, TDP Minister BC Janardhan Reddy's cousin brother slapped an on-duty constable. A case was filed, and he was arrested. The minister condemned the incident."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kyunki-saas-bhi-kabhi-bahu-thi-episode-3-update-tulsi-finally-gets-her-due-wrinkle-weight-and-husband-who-sees-her-2764745-2025-08-01",
      "headline": "Kyunki Episode 3: Tulsi finally gets her due-wrinkles, weight, husband who sees herKyunki Saas Bhi Kabhi Bahu Thi new episode: In a rare moment of honesty on Indian television, Mihir tells Tulsi that her wrinkles aren't signs of ageing but marks of sacrifice - lines etched by years of holding her family together. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/disha-patani-sister-khushboo-clarifies-remarks-directed-at-aniruddhacharya-not-premanand-ji-2764712-2025-08-01",
      "headline": "Khushboo Patani clarifies: Remarks directed at Aniruddhacharya, not Premanand JiActor Disha Patani's sister Khusboo Patani clarified that her comments were directed at Aniruddhacharya's misogynistic views and not about spiritual leader Premanand Ji Maharaj. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saiyaara-star-aneet-gets-touching-tribute-from-her-school-still-that-girl-in-uniform-2764760-2025-08-01",
      "headline": "Saiyaara star Aneet gets touching tribute from her school: Still that girl in uniformLong before she lit up the big screen in 'Saiyaara', Aneet Padda was just a girl in a school uniform, dreaming quietly in a classroom in Amritsar. This week, her alma mater reminded her, and the world, where it all began, with a tribute that brought both tears and gratitude."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-visit-lagaans-kunariya-village-after-25-years-sitaare-zameen-par-screening-2764750-2025-08-01",
      "headline": "Aamir Khan to visit Lagaan's Kunariya village after 25 years for special screeningAamir Khan is set to visit the 'Lagaan' village near Bhuj for the special screening of his film 'Sitaare Zameen Par.' The film released in theatres on June 20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aamir-khan-sitaare-zameen-par-premieres-on-youtube-pay-per-view-model-what-it-means-for-the-industry-2764746-2025-08-01",
      "headline": "What Sitaare Zameen Par's pay-per-view release on YouTube means for the industryAamir Khan has taken a bold step by releasing his film 'Sitaare Zameen Par' on YouTube via pay-per-view for Rs 100, marking a fresh attempt to revive TVOD in India. This move challenges traditional theatrical norms and aims to leverage YouTube's massive reach. "
    }
  ],
  "sports": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-eng-5th-test-chris-woakes-injury-update-ruled-out-2764755-2025-08-01",
      "headline": "Seamer Chris Woakes ruled out of the final Test due to shoulder injuryIndia vs England: England pacer Chris Woakes will play no further part in the 5th Test match, the team announced at the start of Day 2 of the final Test match. Woakes was injured while fielding on Day 1 at The Oval."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-5th-test-london-weather-day-2-live-score-updates-2764717-2025-08-01",
      "headline": "5th Test, Day 2 Live: England suffer injury blow, Woakes out of Oval TestIndia (IND) vs England (ENG), 5th Test, Day 2 Live Score and Weather Updates: Karun Nair's fighting half-century kept India alive on Day 1 of the fifth and final Test match of the series. England suffered an injury blow as Chris Woakes was ruled out of the remainder of the final Test due to a shoulder injury. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/who-is-khalid-jamil-indian-men-football-team-new-head-coach-2764709-2025-08-01",
      "headline": "Who is Khalid Jamil? The man trusted to lead Indian football's revivalKhalid Jamil has been appointed head coach of the Indian men's national football team, the first Indian in the role in over ten years. His task is to revive Indian football and steer the team to better performances in upcoming tournaments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-india-assistant-coach-reaction-shubman-gill-run-out-2764703-2025-08-01",
      "headline": "India assistant coach reacts to Shubman Gill's unfortunate run outShubman Gill came under fire from fans for a careless run-out on Day 1 of the final Test, with India's assistant coach Ryan ten Doeschate also highlighting the recklessness of the dismissal during the post-match media interaction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/india-football-men-team-new-coach-khalid-jamil-2764669-2025-08-01",
      "headline": "Khalid Jamil announced as new head coach of Indian football teamFormer East Bengal and Mohun Bagan manager Khalid Jamil has been announced as new head coach of Indian football team. Jamil joins the Indian team after the exit of Manolo Marquez."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-run-out-game-changer-oval-test-aakash-chopra-2764643-2025-08-01",
      "headline": "Shubman Gill's suicidal run-out was game-changer in Oval Test: Aakash ChopraAakash Chopra has weighed in on Shubman Gill's run-out on Day 1 of the fifth Test between India and England at The Oval, describing it as a game-changing moment that could potentially alter the course of the match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-5th-test-oval-london-weather-conditions-2764651-2025-08-01",
      "headline": "Oval Test weather report: Will rain affect playing conditions on Day 2?India vs England: The weather played a massive role on Day 1 of the final Test match at The Oval. 6 wickets fell as India struggled to cope up with the movement in overcast conditions.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/galatasaray-break-turkish-transfer-record-to-sign-victor-osimhen-from-napoli-2764604-2025-08-01",
      "headline": "Galatasaray break Turkish transfer record to sign Victor Osimhen from NapoliGalatasaray have pulled off a stunning coup by signing Nigerian striker Victor Osimhen from Napoli in a record-breaking deal, the club confirmed on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yuzvendra-chahal-dhanashree-verma-divorce-raj-shamani-suicidal-thoughts-2764583-2025-08-01",
      "headline": "I had suicidal thoughts: Chahal breaks silence on divorce sagaYuzvendra Chahal has finally opened up on his divorce with Dhanashree Verma. The spinner spoke about the saga in details on a podcast, explaining his side of the story."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-beat-west-indies-1st-t20i-report-saim-ayub-nawaz-2764570-2025-08-01",
      "headline": "Saim Ayub, Nawaz star for Pakistan as West Indies' horror run continuesWest Indies' poor run in T20 Internationals continued as they slipped to their sixth consecutive defeat, going down by 14 runs against Pakistan in the opening match at Lauderhill. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shaheen-afridi-salman-agha-controversy-pakistan-cricket-board-refute-rift-2764555-2025-08-01",
      "headline": "Shaheen Afridi-Salman Agha controversy: Pakistan refute rift between top starsThe Pakistan Cricket Board (PCB) on Thursday dismissed rumours of a rift involving pacer Shaheen Shah Afridi, captain Salman Ali Agha, and head coach Mike Hesson, labelling the allegations as fabricated and defamatory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-5th-test-oval-london-weather-conditions-2764651-2025-08-01",
      "headline": "Oval Test weather report: Will rain affect playing conditions on Day 2?India vs England: The weather played a massive role on Day 1 of the final Test match at The Oval. 6 wickets fell as India struggled to cope up with the movement in overcast conditions.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/galatasaray-break-turkish-transfer-record-to-sign-victor-osimhen-from-napoli-2764604-2025-08-01",
      "headline": "Galatasaray break Turkish transfer record to sign Victor Osimhen from NapoliGalatasaray have pulled off a stunning coup by signing Nigerian striker Victor Osimhen from Napoli in a record-breaking deal, the club confirmed on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yuzvendra-chahal-dhanashree-verma-divorce-raj-shamani-suicidal-thoughts-2764583-2025-08-01",
      "headline": "I had suicidal thoughts: Chahal breaks silence on divorce sagaYuzvendra Chahal has finally opened up on his divorce with Dhanashree Verma. The spinner spoke about the saga in details on a podcast, explaining his side of the story."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-beat-west-indies-1st-t20i-report-saim-ayub-nawaz-2764570-2025-08-01",
      "headline": "Saim Ayub, Nawaz star for Pakistan as West Indies' horror run continuesWest Indies' poor run in T20 Internationals continued as they slipped to their sixth consecutive defeat, going down by 14 runs against Pakistan in the opening match at Lauderhill. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shaheen-afridi-salman-agha-controversy-pakistan-cricket-board-refute-rift-2764555-2025-08-01",
      "headline": "Shaheen Afridi-Salman Agha controversy: Pakistan refute rift between top starsThe Pakistan Cricket Board (PCB) on Thursday dismissed rumours of a rift involving pacer Shaheen Shah Afridi, captain Salman Ali Agha, and head coach Mike Hesson, labelling the allegations as fabricated and defamatory."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}