{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/itr-1-vs-itr-2-eligibility-for-income-tax-filing-2025-26-budget-changes-which-tax-form-should-salaried-individuals-choose-2732371-2025-05-29",
      "headline": "ITR-1 or ITR-2: Know which form suits your 2025-26 tax filingAn informative guide on choosing between ITR-1 and ITR-2 for salaried individuals, highlighting the eligibility criteria and recent updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-deadline-extended-for-many-but-not-all-are-you-among-the-exceptions-2732330-2025-05-29",
      "headline": "ITR deadline extended for many, but not all. Are you among the exceptions?While most taxpayers have extra time to file their returns, not everyone's in the safe zone. If audit rules apply to you, your deadline hasn't moved. Does your name fall on the exception list? Let's find out here."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/new-pension-rules-for-psu-employees-key-things-to-know-2732328-2025-05-29",
      "headline": "New pension rules for PSU employees: Key things to knowUnder the newly notified Central Civil Services (Pension) Amendment Rules, 2025, any PSU employee dismissed or removed after absorption due to misconduct could forfeit their PSU-related benefits and pension entitlements earned during their earlier government service."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/radico-khaitan-withdraws-brand-name-of-new-single-malt-whisky-after-objections-2732272-2025-05-29",
      "headline": "Radico Khaitan withdraws brand name of new single-malt whisky after objectionsRadico Khaitan emphasised that the decision was not merely commercial but a mark of respect for public sentiment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/indusind-bank-shares-in-focus-as-sebi-probes-top-executives-for-insider-trading-2732268-2025-05-29",
      "headline": "Explained: Why IndusInd Bank shares are in focus todayIndusInd Bank shares were trading 0.62% higher at Rs 809.75 on the Bombay Stock Exchange (BSE) at 9:42 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-rises-over-400-points-nifty-nears-24900-it-stocks-rally-2732261-2025-05-29",
      "headline": "Sensex, Nifty rise as US court blocks Trump's tariffs, IT stocks rallyThe BSE Sensex was trading 424.23 points higher at 81,736.55 around 9:22 am, while the NSE Nifty50 gained 89.80 points to trade at 24,842.25. Most of the broader market indices also rose, reflecting the positive sentiments on Dalal Street."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/delhi-startup-founder-says-salary-stagnation-is-breaking-indias-middle-class-2732257-2025-05-29",
      "headline": "Delhi startup founder says salary stagnation is breaking India's middle classThe startup founder has criticised India's economic policies for overlooking the salaried middle class, who contribute heavily to tax collections and consumer demand but receive little in return. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/share-market-today-sensex-nifty-set-for-positive-opening-today-2732249-2025-05-29",
      "headline": "Stock Market Today: Sensex, Nifty set for positive opening todayGift Nifty futures were trading at 24,836 as of 8:58 am, indicating a firm start for the Nifty 50, which ended Wednesday at 24,752.45."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-indusind-bank-irctc-adani-ports-suzlon-in-focus-2732243-2025-05-29",
      "headline": "Stocks to watch today: IndusInd Bank, IRCTC, Adani Ports, Suzlon in focusKeep an eye on IndusInd Bank, Adani Ports, SAIL, IRCTC, and Cummins India today, as earnings, regulatory action, and fundraising updates drive sentiment in the final stretch of May."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-us-may-agree-on-interim-trade-deal-by-june-25-sources-2731964-2025-05-28",
      "headline": "India, US may agree on interim trade deal by June 25: SourcesAn interim trade pact between India and the US may be agreed upon by June 25, according to sources. A team of US officials is expected to visit India next month for trade talks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filing-itr-late-you-can-earn-33-percent-more-interest-on-tax-refunds-this-year-2731948-2025-05-28",
      "headline": "Filing ITR late? You can earn 33% more interest on tax refunds this yearIf you've paid extra tax via TDS, advance tax, or self-assessment, you're entitled to a refund. As per Section 244A of the Income Tax Act, the department pays 0.5% monthly interest on the excess."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/want-to-get-debt-free-sooner-5-simple-ways-to-pay-off-your-loan-faster-2731966-2025-05-28",
      "headline": "Want to get debt-free sooner? 5 simple ways to pay off your loan fasterPersonal loans help manage big expenses, but repaying them quickly saves on interest and boosts your credit score.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cabinet-approves-higher-msp-14-kharif-crops-2025-26-season-pm-modi-ashwini-vaishnav-2731916-2025-05-28",
      "headline": "MSP boost for farmers as Cabinet clears new rates for Kharif season 2025-26The MSP is the minimum price at which the government promises to buy crops from farmers, even if the market prices are lower. It is set every year for various crops to make sure farmers get a fair price."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-204-points-lower-nifty-below-24800-indusind-bank-down-2-2731884-2025-05-28",
      "headline": "Sensex ends 240 points lower, Nifty below 24,800; ITC falls 3%The BSE Sensex ended 239.31 points lower at 81,312.32, while the NSE Nifty50 fell 73.75 points to settle at 24,752.45. Most of the broader market indices also fell due to high volatility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/zerodhas-nithin-kamath-explains-why-indias-gdp-growth-isnt-enough-india-becomes-fourth-largest-economy-2731874-2025-05-28",
      "headline": "Zerodha's Nithin Kamath explains why India's GDP growth isn't enoughNithin Kamath mentioned that both the government and private companies need to work together to improve education, research, and regulations. Otherwise, many talented Indians may choose to work abroad, and India will miss out on its chance to grow faster."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-deadline-extension-why-it-happened-and-what-you-need-to-do-now-income-tax-filing-by-september-15-2731832-2025-05-28",
      "headline": "ITR deadline extension: Why it happened and what you need to do nowEven though the deadline to file your ITR has been extended to September 15, 2025, it's still wise to get started early. Waiting till the last minute often leads to unnecessary stress and errors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/world-richest-move-monaco-why-tax-free-haven-no-wealth-capital-gain-tax-2731780-2025-05-28",
      "headline": "Why the world's ultra-rich are looking for a Monaco addressMore and more of the world's richest people are looking to move to Monaco or at least have an address there. But why is this tiny country, smaller than many cities, drawing so much interest from the ultra-rich?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/decoding-finfluencer-stock-tips-investor-crypto-gensol-ipos-risks-2731777-2025-05-28",
      "headline": "Finfluencer frenzy: Why you shouldn't chase viral stock tipsCan you spot when a finfluencer's tip will make you money or cost you everything? How much are you really risking chasing the next viral stock? Read on to find out."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/soon-every-indian-address-may-get-a-unique-digital-id-government-to-introduce-digipin-2731752-2025-05-28",
      "headline": "Soon, every Indian address may get a unique Digital IDThe Centre wants to bring addresses under India's Digital Public Infrastructure (DPI) matrix. Right now, there is no proper system or rule to manage address details in the country. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/belrise-industries-share-price-listing-below-expectation-11-percent-premium-2731711-2025-05-28",
      "headline": "Belrise Industries share price: Stock lists below expectations with 11% premiumBelrise Industries listing: The company's shares listed at Rs 100 on the BSE, which is an 11.11% rise over the issue price of Rs 90. On the NSE, the stock started trading at Rs 98.50, which is a gain of 9.44%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/draft-bill-online-property-registration-key-details-explained-2731694-2025-05-28",
      "headline": "Centre proposes bill for online property registration. What it means for you?The Centre has floated a draft bill to digitise property registration. If passed, it could change how you buy, sell, or prove ownership of real estate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/itc-share-price-fall-3-percent-why-reason-stake-sale-bat-should-you-buy-expert-view-2731692-2025-05-28",
      "headline": "ITC share price falls over 3% today. Here's why and should you buy?ITC shares fell over 3% in early trade. The stock is down 2.02% in the last month, and has fallen over 11% in the past 6 months. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-opening-bell-sensex-opens-over-150-points-lower-nifty-below-24900-itc-down-3-percent-titan-2731669-2025-05-28",
      "headline": "Sensex opens over 150 points lower, Nifty below 24,900; ITC down 3%The S&P BSE Sensex fell 164.83 points to 81,386.80, while the NSE Nifty50 was down by 22.25 points to 24,803.70 as of 9:26 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/belrise-industries-listing-today-strong-debut-low-dull-share-price-ipo-latest-gmp-2731665-2025-05-28",
      "headline": "Belrise Industries listing: Will the stock make strong market debut? Check GMPBelrise Industries IPO received a good response from all types of investors. By the end of the three-day bidding period on May 23, it was subscribed 43.14 times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-sensex-nifty-today-low-high-trading-setup-nse-bse-key-levels-2731636-2025-05-28",
      "headline": "Stock market opening: Sensex, Nifty to fall even more today? Check key levelsGift Nifty futures were trading at 24,850.5 at around 8:06 am, suggesting that the Nifty50 may start the day close to its previous close of 24,826.2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-focus-may-28-itc-lic-sail-belrise-industries-listing-irctc-trading-2731630-2025-05-28",
      "headline": "Stocks to watch on May 28: ITC, LIC, SAIL, Belrise Industries, IRCTCSeveral important companies are in focus today, including ITC, LIC, SAIL, Belrise Industries and IRCTC, due to upcoming announcements, stock movements, and earnings results."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/date-of-filing-of-income-tax-returns-extended-from-july-31-to-september-15-2731366-2025-05-27",
      "headline": "Income tax return filing deadline extended from July 31 to September 15This extension mostly helps salaried employees and other individuals whose accounts don't need to be audited. These taxpayers generally have a July 31 deadline each year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-closes-624-points-lower-nifty-below-24900-indusind-bank-ends-3-percent-up-2731287-2025-05-27",
      "headline": "Sensex closes 624 points lower, Nifty below 24,900; IndusInd Bank ends 3% upSensex closes 624 points lower, Nifty below 24,900; IndusInd Bank ends 3% up"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/retired-before-march-2025-do-not-miss-ups-benefits-for-you-or-your-spouse-2731238-2025-05-27",
      "headline": "Retired before March 2025? Don't miss UPS benefits for you or your spouseIntroduced by the Central Government on April 1, 2025, the UPS provides additional benefits to those who have completed at least 10 years of qualifying service in the Central Government and their legally wedded spouses. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pakistan-loans-bailouts-imf-world-bank-economic-crisis-never-recovers-terrorism-tax-2731219-2025-05-27",
      "headline": "Pakistan's bailout addiction: Why the IMF keeps saving a sinking economyWhy does Pakistan keep turning to the IMF for rescue, but never seems to recover? What's trapping its economy in this endless bailout loop? Dive in to find out."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gdp-means-little-if-it-hides-empty-plates-analyst-on-india-inequality-crisis-2731215-2025-05-27",
      "headline": "'GDP means little if it hides empty plates': Analyst on India's inequality crisisIndia's economy may be booming, but over half its people still can't afford three meals a day, notes an analyst. In contrast, smaller African economies like Nigeria, Kenya, and Ghana rank higher in tackling hunger."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/borana-weaves-listing-today-113-percent-premium-share-price-hold-book-profit-expert-view-2731190-2025-05-27",
      "headline": "Borana Weaves lists at 13% premium: Should you hold or book profit?Borana Weaves' listing was slightly below what many in the market had expected. The grey market premium (GMP) had been showing a possible listing gain of 20-22%, with the premium standing at Rs 43-45 before the listing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/could-take-50-years-gurugram-startup-founder-on-india-matching-japans-life-2731181-2025-05-27",
      "headline": "'Could take 50 years': Gurugram startup founder on India matching Japan's lifeIndia's economic journey faces significant hurdles as inequality, agricultural dependency, and regional disparities hinder progress towards matching Japan's quality of life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/volvo-to-slash-3000-white-collar-jobs-in-restructuring-move-report-employee-layoff-2731146-2025-05-27",
      "headline": "Volvo to slash 3,000 white-collar jobs in restructuring move: ReportA major portion of the cost-cutting will come from trimming white-collar roles, which account for around 40% of the company's total staff. Globally, the company has about 29,000 employees in Europe, 10,000 in Asia, and 3,000 in the Americas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/borana-weaves-share-price-listing-today-stock-rises-13-percent-premium-2731147-2025-05-27",
      "headline": "Borana Weaves share price: Stock extends gains after listing at 13% premiumWhile the listing price was above the issue price, it was slightly lower than what many expected. In the grey market, the stock had shown a premium of Rs 43-45 ahead of the listing, which suggested possible gains of around 20-22% on debut."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/good-news-for-exporters-as-key-remission-of-duties-and-taxes-on-exported-products-scheme-to-return-2731143-2025-05-27",
      "headline": "Good news for exporters as key tax refund scheme to return. Details hereThe Remission of Duties and Taxes on Exported Products (RoDTEP) scheme, which reimburses levies not covered by any other government programme, had been on hold since February 5 but will now resume."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/indigo-co-founder-rakesh-gangwal-sells-airline-shares-term-sheet-report-2731127-2025-05-27",
      "headline": "IndiGo co-founder sells $1.36 billion of airline's shares: ReportThe shares were sold at 5,230.5 rupees ($61.35) each, the term sheet seen by Reuters showed, representing a discount of 3.5% to the company's closing price on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sagility-india-ltd-share-price-crash-fall-5-percent-today-why-stake-sale-ofs-promoter-2731101-2025-05-27",
      "headline": "Explained: Why Sagility India Ltd shares fell 5% todaySagility India Ltd said it remains confident of steady performance through the next financial year. It expects growth supported by a strong balance sheet, a wide client base, and consistent business execution. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-slumps-nearly-800-points-why-is-the-stock-market-falling-today-2731096-2025-05-27",
      "headline": "Sensex sinks 1,000 points: Why is the stock market falling today?At 2:34 pm, the BSE Sensex was down 931.34 points at 81,245.11, while the NSE Nifty50 dropped 252 points to 24,749.15. Broader market indices also faced selling pressure, with heightened volatility dragging down sentiment across the board."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/olectra-greentech-shares-tumble-nearly-7-percent-in-early-trade-heres-why-2731087-2025-05-27",
      "headline": "Olectra Greentech shares tumble nearly 7% in early trade. Here's whyThe stock, which has delivered over 2,250% returns in the last five years, has lost about a quarter of its value over the past year."
    }
  ],
  "entertainment": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/actor-sooraj-pancholi-recalls-terrible-jail-term-in-kasabs-cell-sleeping-on-newspaper-2732344-2025-05-29",
      "headline": "Sooraj Pancholi recalls terrible jail term in Kasab's cell, sleeping on newspaperActor Sooraj Pancholi recently recalled his terrible time in Mumbai's Arthur Road Jail where he slept on newspapers. He revealed that he was kept in the same cell where Ajmal Kasab was confined."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/emraan-hashmi-diagnosed-with-dengue-puts-pawan-kalyan-og-shoots-on-hold-2732358-2025-05-29",
      "headline": "Actor Emraan Hashmi diagnosed with dengue, puts Pawan Kalyan's OG shoots on holdBollywood actor Emraan Hashmi has been diagnosed with dengue, due to which shooting for the Pawan Kalyan-starrer 'They Call Him OG' has been temporarily halted. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kamal-haasan-regrets-not-approaching-satyajit-ray-score-music-pushpak-vimana-2732418-2025-05-29",
      "headline": "Kamal Haasan regrets not getting Satyajit Ray to score Pushpak musicIn an exclusive interview with India Today, Kamal Haasan opened up about a significant missed opportunity to involve legendary filmmaker Satyajit Ray in his silent classic 'Pushpaka Vimana'. He reflects on how it could have elevated the film to new heights and the regrets surrounding this lost chance."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tara-sutaria-dating-veer-pahariya-after-breakup-with-aadar-jain-alekha-advani-2732414-2025-05-29",
      "headline": "Tara Sutaria is dating Veer Pahariya after breakup with Aadar Jain: ReportActors Tara Sutaria and Veer Pahariya are reportedly dating. Sources close to the two shared that they are 'taking it slow'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/pankaj-tripathi-criminal-justice-season-4-madhav-mishra-lawyer-role-bank-balance-2732338-2025-05-29",
      "headline": "Pankaj Tripathi: Criminal Justice 4 has definitely improved my bank balancePankaj Tripathi returns as lawyer Madhav Mishra in Criminal Justice Season 4. The show's fresh writing and evolving characters promise renewed excitement and engagement for fans."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/yash-shoots-massive-action-sequence-with-mad-max-stunt-director-for-ramayana-2732335-2025-05-29",
      "headline": "Yash shoots massive action sequence with Mad Max stunt director for Ramayana'KGF' actor Yash has collaborated with 'Mad Max' stunt director Guy Norris for massive action sequences for the upcoming magnum opus 'Ramayana', directed by Nitesh Tiwari. The film also stars Ranbir Kapoor and Sai Pallavi in the lead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/shiva-rajkumar-defends-kamal-haasan-against-critics-amid-kannada-language-row-asks-what-have-you-done-for-kannada-cinema-2732360-2025-05-29",
      "headline": "Shiva Rajkumar to Kamal Haasan's critics: What have you done for Kannada cinema?Kannada actor Shiva Rajkumar defended Kamal Haasan amid the Kannada language row. The former made a statement at an event, appreciating Haasan's contribution to cinema and his command over the audiences. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/cha-eun-woo-military-service-army-military-band-enlistment-july-28-2732333-2025-05-29",
      "headline": "Cha Eun-woo to begin military service with Army Military BandCha Eun-woo has been accepted into the Army Military Band and will start his mandatory military service on July 28. Fans are asked to respect privacy as enlistment details remain confidential to ensure safety."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-son-abhishek-bachchan-housefull-5-trailer-2732334-2025-05-29",
      "headline": "Big B sends best wishes to son Abhishek as Housefull 5 trailer releasesAmitabh Bachchan sent best wishes to son Abhishek Bachchan after the 'Housefull 5' trailer released. He called it a proud moment and wished luck to the entire team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kartik-aaryan-ananya-panday-shoot-for-tu-meri-main-tera-main-tera-tu-meri-video-from-sets-goes-viral-2732332-2025-05-29",
      "headline": "Kartik Aaryan, Ananya Panday shoot for Tu Meri Main…, video from sets goes viralKartik Aaryan and Ananya Panday are currently shooting for their upcoming film 'Tu Meri Main Tera Main Tera Tu Meri'. A video from the sets has gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actor-rajesh-dies-at-75-rajinikanth-close-friend-condolences-2732324-2025-05-29",
      "headline": "Rajinikanth deeply saddened as his close friend and actor Rajesh dies at 75Veteran actor Rajesh died at the age of 75 on Thursday. His close friend and actor Rajinikanth expressed his sadness over his sudden death.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/gaddar-film-awards-2025-nag-ashwin-allu-arjun-shreya-ghoshal-win-big-2732321-2025-05-29",
      "headline": "Gaddar Film Awards 2025: Nag Ashwin, Allu Arjun, Shreya Ghoshal win big'Kalki 2898 AD' director Nag Ashwin, along with actors Allu Arjun, Nivetha Thomas and singer Shreya Ghoshal, won the top honours at the Gaddar Film Awards 2025, organised by the Telangana government. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/when-life-gives-you-tangerines-extras-allege-mistreatment-on-set-2732269-2025-05-29",
      "headline": "When Life Gives You Tangerines crew and extras allege mistreatment on setThe makers of 'When Life Gives You Tangerines' are facing backlash after several extras accused them of unacceptable behaviour on set. Reports claim that the production team mistreated background actors. These allegations have sparked concern over working conditions behind the scenes of the popular show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nick-jonas-gazes-lovingly-at-priyanka-chopra-in-romantic-boat-pic-seen-yet-2732297-2025-05-29",
      "headline": "Nick Jonas gazes lovingly at Priyanka Chopra in romantic boat pic. Seen yet?Priyanka Chopra shared a mushy picture with Nick Jonas, and it is all things love. Take a look at their romantic photo here. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amid-sandeep-reddy-vanga-row-deepika-padukone-shares-kind-of-people-she-likes-to-collaborate-with-2732284-2025-05-29",
      "headline": "Amid Vanga row, Deepika shares the kind of people she likes to collaborate withDeepika Padukone shared that she likes to work with people who make her feel comfortable. Her statement comes three days after filmmaker Sandeep Reddy Vanga allegedly referred to her as a 'frustrated cat' in a cryptic post about her rumoured exit from 'Spirit'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/global-anime-awards-wave-is-real-india-is-racing-on-2732285-2025-05-29",
      "headline": "Global anime wave is real and India is racing on | Exclusive   Anime has evolved from a niche interest into a vibrant cultural movement in India, embraced by youth and celebrities alike. Streaming platforms and conventions highlight the expanding influence and emotional connection of Indian fans with anime."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/uvashi-rautela-says-leonardo-dicaprio-called-her-queen-of-cannes-shares-selfie-2732267-2025-05-29",
      "headline": "Urvashi Rautela says Leonardo DiCaprio called her queen of Cannes, shares selfieActor Urvashi Rautela woke up on a Thursday and decided to post a selfie in which she could be seen posing with Hollywood star Leonardo DiCaprio. The actor shared that the 'Titanic' actor called her the 'queen of Cannes'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anushka-sharma-virat-kohli-all-smiles-lucknow-airport-ipl-qualifier-1-rcb-vs-pbks-2732258-2025-05-29",
      "headline": "Anushka Sharma, Virat Kohli are all smiles at airport ahead of IPL Qualifier 1Anushka Sharma and Virat Kohli were seen smiling at the Lucknow airport a day after RCB's big win. The cricket franchise will now take part in IPL 2025 Qualifier 1 against Punjab Kings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kamal-haasan-nani-virumaandi-fan-analysis-2732234-2025-05-29",
      "headline": "This is enough, sir: Kamal Haasan's name-drop makes Nani's dayKamal Haasan acknowledged Nani's admiration for his work during an interview. The 'HIT 3' actor was overjoyed as his video caught the attention of his favourite actor."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/we-could-have-done-much-more-rajnath-singhs-stern-warning-to-pak-2732434-2025-05-29",
      "headline": "Could've done much more: Rajnath Singh's stern warning to Pak after Op SindoorDefence Minister Rajnath Singh asserted that after Operation Sindoor, Pakistan has \"realised the heavy cost of running the business of terrorism.\""
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/let-commander-saifullah-kasuri-pahalgam-attack-mastermind-pakistan-rally-talha-saeed-2732353-2025-05-29",
      "headline": "LeT commander behind Pahalgam attack resurfaces at anti-India rally in PakistanLeT commander Saifullah Kasuri, accused of masterminding the Pahalgam terror attack, resurfaced at a rally in Pakistan alongside political leaders and wanted terrorists like Hafiz Saeed's son Talha Saeed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pawan-khera-slams-shashi-tharoor-over-pm-modi-surgical-strike-congress-takes-veiled-dig-2732423-2025-05-29",
      "headline": "I agree...: After Shashi Tharoor's zealots jab, Pawan Khera's 2018 book reminderThe war of words between Shashi Tharoor and his party has intensified, as senior Congress leader Pawan Khera shared an excerpt from the Lok Sabha MP's book The Paradoxical Prime Minister, in which he called the Modi government 'shameless' for publicising the 2016 surgical strikes for electoral gains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-economy-investment-muhammad-yunus-grameen-bank-tax-exemption-conflict-of-interest-2731970-2025-05-29",
      "headline": "As Yunus fiddles, Bangladesh slides, his Grameen family soarsBangladesh hasn't just seen a rise of Muhammad Yunus, it has seen businesses associated with him switch to top gears. The interim government gave nod to the setting up of Grameen University, allowed Grameen Telecom to operate a mobile wallet, approved manpower export licence for Grameen Employment and reinstated tax-exemption status for Grameen Bank. Though none of the deals are illegal, they have raised a stink."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/the-lowdown/story/elon-musk-chainsaw-exit-another-donald-trump-buddy-bites-the-dust-2732366-2025-05-29",
      "headline": "Musk's chainsaw exit: Another Trump buddy bites the dustElon Musk joined Trump admin as a so-called special government employee, bringing with him big plans to shred wasteful and fraudulent spending. After 130 days at the helm of DoGE, Musk announced his resignation. His exit from the Trump administration was as predictable as it was dramatic, no surprise there."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/south/story/karnataka-minister-demands-kamal-haasan-apology-over-kannada-language-row-or-face-film-ban-2732427-2025-05-29",
      "headline": "Must apologise or face ban: Karnataka Minister on Kamal Haasan's Kannada remarksKarnataka's Culture Minister has warned actor Kamal Haasan to apologise for allegedly insulting the Kannada language, or face a ban on his films being released in the state."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/donald-trump-administration-us-court-tariffs-india-pakistan-ceasefire-2732263-2025-05-29",
      "headline": "Defending tariffs, Trump team said adverse ruling would risk India-Pak ceasefireThe argument, made last week, failed to convince the Court of International Trade, which blocked Donald Trump's tariffs from going into effect."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/3-indians-missing-in-iran-embassy-says-probe-on-warns-against-illegal-travel-agents-2732370-2025-05-29",
      "headline": "Iran says it's probing missing Indians case, warns against illegal travel agentsThe families of the missing men allege they were abducted and held for ransom. Iran's Consular Affairs Department of the Ministry of Foreign Affairs is actively pursuing the case, the Iranian embassy said."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/information/story/six-hours-that-defied-history-and-death-on-mount-everest-edmund-hillary-tenzing-norgay-2732065-2025-05-29",
      "headline": "Six hours that defied history and death on Mount EverestOn May 29, 1953, Edmund Hillary and Tenzing Norgay created history by summiting Mt Everest, the world's highest peak. On its anniversary, here is an account of the final six hours of humanity's quest for the top of the world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/amazon-fashions-serve-store-offers-convenience-selection-and-value-to-gen-z-says-nikhil-sinha-director-amazon-fashion-2729633-2025-05-24",
      "headline": "Amazon Fashion's 'SERVE' Store Offers Convenience, Selection and Value to Gen Z, says Nikhil Sinha, Director, Amazon FashionIndia's first dedicated Gen Z fashion store democratizes style access across the country with 3X customer growth\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/opinion/story/a-baloch-reproach-how-pakistan-lies-about-india-and-balochistan-2732024-2025-05-29",
      "headline": "A Baloch reproach: How Pakistan lies about India and BalochistanThe sweeping claims about freedom of expression and the press in Pakistan compared to India are not only false but also an attempt by the Pakistani military to create a false narrative and distract from its crimes and acts of terrorism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/india-4th-largest-economy-is-not-all-cheer-but-it-is-not-a-tragedy-either-2731900-2025-05-28",
      "headline": "Calm down...4th largest economy is not all cheer, but it's not a tragedy eitherWe are still fourth. Not even a podium finish. No medals. A rank which an embarrassed Indian parent would sugarcoat in front of relatives by saying we are in the Top 5 of the class. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/mumbai/video/video-mumbai-man-clings-to-bonnet-of-fast-moving-car-in-road-rage-incident-2732428-2025-05-29",
      "headline": "Video: Mumbai man clings to bonnet of fast-moving car in road rage incidentA terrifying video from Mumbai's Western Express Highway has gone viral, showing a man clinging to the bonnet of a speeding Ertiga car, fighting for his life. The incident reportedly occurred in the Vile Parle area following a heated argument between two drivers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/why-elon-musk-left-donald-trump-administration-2732406-2025-05-29",
      "headline": "What led to 'first buddy' Elon Musk's big exit from Trump CabinetIn recent weeks, there have been tell-tale signs that the personal bond between Donald Trump and Elon Musk has frayed, culminating in the cost-cutting czar's exit from the administration."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/doctor-ajay-taware-jailed-in-pune-porsche-accident-case-kidney-transplant-racket-2732368-2025-05-29",
      "headline": "Doctor jailed in Pune Porsche case linked to kidney transplant racketThe racket was initially uncovered following a complaint by the Deputy Director of the Health Services Board, Dr. Sanjog Kadam, regarding illegal financial transactions during a transplant procedure. The ensuing investigation exposed a well-organised network involving hospital staff, brokers, donors, and recipients. At least 15 individuals have been named in the case so far."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-rcb-qualifier-1-playoffs-feature-2732319-2025-05-29",
      "headline": "Can RCB leave the past behind and show consistency in the playoffs? IPL 2025: Royal Challengers Bengaluru have stormed into the playoffs and secured a top-two finish. However, the real test now lies ahead - as the playoffs have always been the stage where their temperament comes under scrutiny."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amid-sandeep-reddy-vanga-row-deepika-padukone-shares-kind-of-people-she-likes-to-collaborate-with-2732284-2025-05-29",
      "headline": "Amid Vanga row, Deepika shares the kind of people she likes to collaborate withDeepika Padukone shared that she likes to work with people who make her feel comfortable. Her statement comes three days after filmmaker Sandeep Reddy Vanga allegedly referred to her as a 'frustrated cat' in a cryptic post about her rumoured exit from 'Spirit'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ex-aide-of-congress-leader-arrested-in-rajasthan-for-allegedly-spying-for-isi-visited-pakistan-6-7-times-2732282-2025-05-29",
      "headline": "Ex-aide of Congress leader held in Rajasthan for 'spying', visited Pak 6–7 timesA Rajasthan government employee, Sakur Khan, was detained for allegedly spying for Pakistan's ISI after intelligence found suspicious links, including visits to Pakistan. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjp-jamal-siddiqui-ram-krishna-muslims-sanatan-dharma-prophet-2732209-2025-05-29",
      "headline": "Sanatan Dharma came before Islam, Muslims descendants of Ram: BJP's Jamal SiddiquiSiddiqui linked Lord Ram and Krishna to Islamic prophethood and said Muslims who do not believe in Ram and Krishna cannot be called Muslims."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/features/story/elon-musk-and-donald-trump-bromance-was-one-for-century-so-why-is-he-leaving-us-govt-role-5-reasons-2732394-2025-05-29",
      "headline": "Musk, Donald Trump's bromance was legendary, so why is he leaving US govt role?On May 29, Musk, the world's richest man took to X (formerly Twitter), a platform he owns, to formally announce his exit from the high-profile, albeit ambiguous, position as head of the Department of Government Efficiency (DOGE)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/kolkata-taxi-driver-threatens-us-man-tries-to-scam-him-will-break-your-bones-viral-video-outrage-2732400-2025-05-29",
      "headline": "Kolkata taxi driver threatens US man, tries to scam him. Video sparks outrageThe viral video detailed Dustin's harrowing encounter with the taxi driver and his associate upon his arrival in Kolkata. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kiren-rijiju-defends-shashi-tharoor-congress-row-over-operation-sindoor-praise-narendra-modi-2732221-2025-05-29",
      "headline": "What does Congress want, Kiren Rijiju backs Shashi Tharoor amid party heatUnion Minister Kiren Rijiju on Wednesday came out in support of Congress MP Shashi Tharoor, questioning the intent of the Congress party after it criticised Tharoor for his remarks praising the Narendra Modi government during an address in Panama."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/shiva-rajkumar-defends-kamal-haasan-against-critics-amid-kannada-language-row-asks-what-have-you-done-for-kannada-cinema-2732360-2025-05-29",
      "headline": "Shiva Rajkumar to Kamal Haasan's critics: What have you done for Kannada cinema?Kannada actor Shiva Rajkumar defended Kamal Haasan amid the Kannada language row. The former made a statement at an event, appreciating Haasan's contribution to cinema and his command over the audiences. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/terrorists-arrested-in-jammu-and-kashmir-shopian-arms-hand-grenades-recovered-army-crpf-2732240-2025-05-29",
      "headline": "2 Lashkar terrorists arrested in J&K's Shopian, arms and grenades recoveredThe operation came as security forces turned the focus of their anti-terror operations to specific areas in south Kashmir after the April 22 attack in Pahalgam."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/virat-kohli-received-surprise-text-from-harbhajans-daughter-after-test-retirement-2732431-2025-05-29",
      "headline": "Kohli received surprise text from my daughter after Test retirement: HarbhajanStar India batter Virat Kohli received a surprise text from Harbhajan Singh's daughter Hinaya following his retirement from Tests, the former off spinner has revealed in an interview."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-mens-relay-team-enters-final-of-asian-athletics-championships-2732387-2025-05-29",
      "headline": "India men's relay team enters final of Asian Athletics ChampionshipsIndia's 4x400m men's relay team qualified for the final of the 26th Asian Athletics Championships with its best ever effort. The team, consisting of Rince Joseph, Dharmveer Choudhary, Manu Thekkinalil Saji, and Mohit Kumar outpaced China and Korea."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/badminton/story/singapore-open-hs-prannoy-satwiksairaj-rankireddy-chirag-shetty-2732383-2025-05-29",
      "headline": "Satwik-Chirag through to quarterfinal, HS Prannoy bows outSingapore Open: Satwiksairaj Rankireddy and Chirag Shetty made their way through to the quarterfinal while HS Prannoy crashed out after losing in straight games to Christo Popov."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/norway-chess-d-gukesh-beats-hikaru-nakamura-comeback-birthday-2732388-2025-05-29",
      "headline": "Gukesh beats Nakamura to get Norway campaign back on track on birthdayOn his 19th birthday, world champion D Gukesh bounced back in style, defeating world No.2 Hikaru Nakamura in Norway Chess 2025, showcasing improved time management and nerves of steel under pressure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-director-mo-bobat-on-qualifier-1-fixture-against-punjab-kings-2732349-2025-05-29",
      "headline": "Earlier win over Punjab Kings, a confidence booster ahead of qualifier 1: RCB DirectorRoyal Challengers Bengaluru (RCB) director of cricket Mo Bobat has said that the team will take confidence from their earlier win against Punjab Kings (PBKS) as they head into Qualifier 1 of the Indian Premier League 2025 (IPL 2025) against Punjab Kings (PBKS). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-rcb-qualifier-1-playoffs-feature-2732319-2025-05-29",
      "headline": "Can RCB leave the past behind and show consistency in the playoffs? IPL 2025: Royal Challengers Bengaluru have stormed into the playoffs and secured a top-two finish. However, the real test now lies ahead - as the playoffs have always been the stage where their temperament comes under scrutiny."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pbks-vs-rcb-virat-kohlis-playoffs-record-a-worry-for-rcb-2732316-2025-05-29",
      "headline": "Virat Kohli's playoffs record a worry for RCB heading into Qualifier 1Star India and Royal Challengers Bengaluru (RCB) batter Virat Kohli will be eager to end his poor playoffs record as RCB take on Punjab Kings (PBKS) in Qualifier 1 of the Indian Premier League 2025 (IPL 2025). \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-qualifier-1-pbks-vs-rcb-virat-kohli-record-2732309-2025-05-29",
      "headline": "Virat Kohli eyes David Warner's all-time record as RCB eye fourth finalIPL 2025: Virat Kohli needs only 31 runs to become the leading run-scorer against the Punjab Kings. The veteran will have a chance to go past David Warner in the Qualifier 1 on Thursday in Mullanpur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-order-of-play-novak-djokovic-jannik-sinner-coco-gauff-2732279-2025-05-29",
      "headline": "Day 5 Order of Play: Djokovic, Sinner, Gauff vye for Round 3 berthsFrench Open 2025, Day 5 Order of Play: Novak Djokovic, Jannik Sinner, Coco Gauff and other big players will be looking to secure their berths in the third round when they play on Thursday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/many-punjabis-dont-support-pbks-and-prefer-other-teams-arshdeep-singh-2732276-2025-05-29",
      "headline": "Many Punjabis don't support PBKS and prefer other teams: Arshdeep SinghIndia and Punjab Kings' (PBKS) seamer Arshdeep Singh has said that PBKS don't get support from Punjab while replying to a fan's comment on Snapchat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-elena-rybakina-frances-tiafoe-holger-rune-2732262-2025-05-29",
      "headline": "Elena Rybakina thumps Iva Jovic, Frances Tiafoe, Holger Rune advanceFrench Open 2025: 12th seed Elena Rybakina beat Iva Jovic 6-3, 6-3, while Frances Tiafoe and Holger Rune also advanced to the third round of the clay-court major. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pbks-vs-rcb-virat-kohlis-playoffs-record-a-worry-for-rcb-2732316-2025-05-29",
      "headline": "Virat Kohli's playoffs record a worry for RCB heading into Qualifier 1Star India and Royal Challengers Bengaluru (RCB) batter Virat Kohli will be eager to end his poor playoffs record as RCB take on Punjab Kings (PBKS) in Qualifier 1 of the Indian Premier League 2025 (IPL 2025). \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-qualifier-1-pbks-vs-rcb-virat-kohli-record-2732309-2025-05-29",
      "headline": "Virat Kohli eyes David Warner's all-time record as RCB eye fourth finalIPL 2025: Virat Kohli needs only 31 runs to become the leading run-scorer against the Punjab Kings. The veteran will have a chance to go past David Warner in the Qualifier 1 on Thursday in Mullanpur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-order-of-play-novak-djokovic-jannik-sinner-coco-gauff-2732279-2025-05-29",
      "headline": "Day 5 Order of Play: Djokovic, Sinner, Gauff vye for Round 3 berthsFrench Open 2025, Day 5 Order of Play: Novak Djokovic, Jannik Sinner, Coco Gauff and other big players will be looking to secure their berths in the third round when they play on Thursday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/many-punjabis-dont-support-pbks-and-prefer-other-teams-arshdeep-singh-2732276-2025-05-29",
      "headline": "Many Punjabis don't support PBKS and prefer other teams: Arshdeep SinghIndia and Punjab Kings' (PBKS) seamer Arshdeep Singh has said that PBKS don't get support from Punjab while replying to a fan's comment on Snapchat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-elena-rybakina-frances-tiafoe-holger-rune-2732262-2025-05-29",
      "headline": "Elena Rybakina thumps Iva Jovic, Frances Tiafoe, Holger Rune advanceFrench Open 2025: 12th seed Elena Rybakina beat Iva Jovic 6-3, 6-3, while Frances Tiafoe and Holger Rune also advanced to the third round of the clay-court major. \r\n\r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}