{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-labour-codes-10-key-changes-every-employee-should-know-2824640-2025-11-23",
      "headline": "New labour codes: 10 key changes every employee should knowWhether someone works full-time, on a contract, or in sector-specific roles like media, plantations or factories, the new framework affects nearly everyone. Here are the key updates workers should be aware of, along with several other important changes that haven't received enough attention."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-to-challenge-unfair-will-cheating-inheritance-property-transfer-mental-state-doubt-witness-testimony-2824524-2025-11-23",
      "headline": "Feel cheated by a family will? Know your legal rightsWhether it is a sudden change in beneficiaries, unequal division of property, or doubts about the person's mental state when the will was written, such situations often create confusion, anger, and emotional stress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/clear-home-loan-early-simple-steps-to-pay-it-quickly-emis-high-interest-refinancing-higher-down-payment-2824523-2025-11-23",
      "headline": "Want to clear your home loan early? Simple ways to pay it off quicklyPay low EMIs and your tenure stretches, increasing your interest costs. Pay higher EMIs, and you could save years and lakhs on the total interest you pay."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-labour-code-explained-pay-structure-in-hand-salary-rise-fall-impact-basic-pf-deduction-2824336-2025-11-22",
      "headline": "New labour codes are here: Will your in-hand salary rise or fall?With the new labour codes now implemented, many employees are trying to understand what it means for their salary structure, especially basic salary, PF deductions and take-home pay."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-labour-codes-changes-paid-leaves-working-hours-health-coverage-old-vs-new-laws-2824290-2025-11-22",
      "headline": "New labour codes: What changes for paid leave, work hours and health benefitsThe new labour codes apply across sectors and are designed to improve safety, reduce fatigue and make workplaces more predictable for millions of workers in India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gratuity-new-labour-codes-law-fixed-term-employees-explained-2824241-2025-11-22",
      "headline": "Gratuity in a year? Only if you're a fixed-term employee. Here's what it meansOnly employees hired on fixed-term contracts qualify for the new one-year gratuity rule. Permanent staff remain under the five-year norm, making this benefit exclusive to India's expanding fixed-term workforce."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/labour-codes-laws-explained-from-gratuity-to-gig-worker-insurance-2824221-2025-11-22",
      "headline": "From gratuity to gig worker insurance: What new labour laws mean for employeesFrom gratuity to insurance and safer workplaces, the new rules expand what employees can expect from their jobs. Staying informed will help workers make the most of these changes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/employees-to-get-gratuity-after-1-year-of-service-as-per-new-labour-law-overhaul-2824132-2025-11-21",
      "headline": "Fixed-term employees to get gratuity after 1 year of service under new labour lawsAccording to the Union Labour Ministry, the restructuring is aimed at ensuring better wages, wider social security coverage and improved health-related protections for workers across sectors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-tumbles-400-points-nifty-ends-above-26000-amid-volatile-trade-2823801-2025-11-21",
      "headline": "Sensex tumbles 400 points, Nifty ends above 26,000 amid volatile tradeThe S&P BSE Sensex fell more than 400 points to close at 85,231, while the NSE Nifty50 managed to stay above the 26,000 mark despite broad-based weakness across sectors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-implements-four-labour-codes-replacing-29-old-laws-check-details-2823795-2025-11-21",
      "headline": "Government implements four labour codes, replacing 29 old laws. Check detailsThe move brings together decades-old labour rules that were scattered across multiple legislations into a consolidated framework. Many of these older laws date back to the pre-Independence and early post-Independence era."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/rupee-slides-to-record-low-of-rs-8945-amid-us-india-trade-uncertainty-2823785-2025-11-21",
      "headline": "Rupee slides to record low of Rs 89.45 amid US-India trade uncertaintyThe outlook for the rupee remains uncertain as global risk sentiment stays fragile and investors wait for clearer signals from both the Fed and ongoing trade negotiations between Washington and New Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/sudeep-pharma-ipo-fully-subscribed-on-day-1-check-latest-gmp-and-other-2823780-2025-11-21",
      "headline": "Sudeep Pharma IPO fully subscribed on day 1. Check latest GMP and otherThe issue, priced between Rs 563 and Rs 593, saw a clear surge from retail and high-net-worth investors, allowing the company to cross the one-time subscription mark even though institutional participation remained weak through the first session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/the-great-ipo-gamble-gmp-social-media-hype-retail-investors-explained-2823730-2025-11-21",
      "headline": "How GMP and social media hype mislead so many first-time investorsThe Great IPO Gamble series ends here, and in part 3, we break down how GMP and social media hype influence first-time investors. A look at the noise behind the numbers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-swiggy-customer-data-restaurants-controversy-privacy-concerns-2823623-2025-11-21",
      "headline": "Recipe for trouble? Zomato's customer data move stirs up controversyZomato controversy: Food delivery giant Zomato has decided to share customer data with restaurants after years of tussle. Politicians and marketing gurus have called it a recipe for trouble, expressing concerns about data privacy and spam messages."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/video/reliance-industries-halts-russian-oil-imports-at-jamnagar-refinery-amid-sanctions-ytvd-2823600-2025-11-21",
      "headline": "Russian Oil: Reliance Halts Russian Crude Imports at Jamnagar SEZ RefineryThis report covers Reliance Industries' decision to halt the import of Russian crude oil for its export-oriented refinery in Jamnagar, Gujarat. The move is in compliance with European Union and United States sanctions targeting Russian oil majors Rosneft and Lukoil, with a wind-down period ending November 21. Reliance stated, 'we'll stay aligned with government's policy.' The company will now source crude from other regions, including West Asia and the EU, for its Special Economic Zone (SEZ) refinery, with all exports to be derived from non-Russian oil starting December 1. The decision impacts a long-term deal between Reliance and Rosneft for the supply of crude oil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/jp-power-share-price-falls-after-rally-profit-taking-2823589-2025-11-21",
      "headline": "JP Power share price tumbles 7% after strong rally. Why is it down today?The JP Power share price dip reflects profit-taking after a steep run, as the market waits for clearer evidence that the broader group's restructuring will lift the company's long-term fortunes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/groww-share-price-rises-after-two-day-fall-q2-results-why-billionbrains-stock-up-2823581-2025-11-21",
      "headline": "Groww shares jump nearly 7% after two-day tumble: What's driving today's rally?Around 10:03 am, the shares of the company were trading 6.30% higher at Rs 166.44 on the Bombay Stock Exchange (BSE). The rebound comes amid growing anticipation around Groww's performance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-over-200-points-nifty-below-26200-hindalco-down-nearly-3-2823559-2025-11-21",
      "headline": "Sensex, Nifty fall in early trade as hopes of US rate cut fadeAround 9:23 am, the S&P BSE Sensex was down 131 points at 85,501.03, while the NSE Nifty50 slipped 40.70 points to 26,151.45. Volatility was high in early trade and all major sectoral indices were in the red, reflecting the cautious mood on Dalal Street."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/reliance-halts-russian-crude-jamnagar-sez-refinery-eu-sanctions-glbs-2823492-2025-11-21",
      "headline": "Reliance ends use of Russian crude for exports to comply with EU sanctionsReliance's decision shows how quickly the global rules around Russian oil are changing, and how Indian refiners are now being pushed to realign their supply chains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-group-says-ed-attached-assets-belong-to-rcom-not-part-of-group-since-2019-2823468-2025-11-20",
      "headline": "Reliance Group says ED-attached assets belong to RCom, not part of group since 2019The ED, meanwhile, detailed its searches across Tamil Nadu in a land-forgery and inflated compensation scam involving forged deeds, dummy buyers and layered transactions, seizing and freezing assets worth Rs 18.10 crore."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/photo/neha-kakkar-lights-up-sahitya-aaj-tak-grand-finale-sings-chartbusters-2824833-2025-11-24",
      "headline": "Neha Kakkar lights up Sahitya Aaj Tak grand finale, sings chartbusters The grand finale of Sahitya Aaj Tak 2025 took place at Delhi's Major Dhyan Chand Stadium, where singer Neha Kakkar lit up the evening with her high-energy performance, making the event even more special and entertaining."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-eviction-veteran-actress-kunickaa-sadanand-evicted-two-weeks-before-finale-2824828-2025-11-24",
      "headline": "Bigg Boss 19 Episode 92: Kunickaa Sadanand evicted days ahead of grand finale After thirteen weeks in the 'Bigg Boss 19' house, Kunickaa Sadanand was evicted following a unique elimination round. The Weekend Ka Vaar episode on Sunday featured guests including Ektaa Kapoor, Fatima Sana Sheikh and Vijay Varma. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/wicked-for-good-sets-box-office-records-226-million-global-debut-2824817-2025-11-23",
      "headline": "Wicked: For Good becomes biggest Broadway film debut with $226M worldwide 'Wicked: For Good', Universal's highly-anticipated musical, has made a remarkable debut at the box office with outstanding earnings and audience response, setting new records for Broadway musical adaptations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranveer-singh-says-udaipur-played-cupid-in-his-love-story-with-deepika-padukone-2824796-2025-11-23",
      "headline": "Ranveer Singh says Udaipur played Cupid in his love story with Deepika Padukone Ranveer Singh spoke about the significance of Udaipur in his personal life during the wedding celebrations of Netra Mantena and Vamsi Gadiraju. The actor shared memories from 2013 when he and Deepika Padukone first grew close during a shoot in the city. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/huma-qureshi-calls-for-equal-punishment-for-online-abuse-dirty-dms-arent-harmless-2824787-2025-11-23",
      "headline": "Huma Qureshi calls for equal punishment for online abuse: Dirty DMs aren't harmless Huma Qureshi addresses the seriousness of online abuse and calls for stronger action against digital harassment, drawing attention to the need for equal treatment of online and public space offenders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/vijay-varma-gustakh-ishq-fatima-sana-shaikh-2824784-2025-11-23",
      "headline": "Vijay Varma: Gustakh Ishq will remind of life before mobile phones Vijay Varma and Fatima Sana Shaikh discussed their upcoming romantic film, 'Gustakh Ishq', at Sahitya Aajtak 2025 on Sunday. The film also features Naseeruddin Shah."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/international-emmy-awards-2025-new-york-diljit-dosanjh-nominated-amar-singh-chamkila-2824778-2025-11-23",
      "headline": "53rd International Emmys: When and where to watch the awards and other details The 53rd International Emmy Awards will take place in New York City on November 24, 2025, honouring standout television from 26 countries, including India. This year, India marks a milestone with 64 nominations, led by 'Amar Singh Chamkila' and Diljit Dosanjh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/randeep-hooda-recalls-how-battle-of-saragarhi-changed-him-even-without-release-2824757-2025-11-23",
      "headline": "Randeep Hooda recalls how Battle of Saragarhi changed him, even without release Actor Randeep Hooda opened up about the deep personal impact of his preparation for the now-shelved film 'Battle of Saragarhi'. He recalled its making during his session on Day 3 of Sahitya Aaj Tak in New Delhi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/train-dreams-review-joel-edgerton-anchors-a-film-that-speaks-loudly-through-silence-2824730-2025-11-23",
      "headline": "Train Dreams review: Joel Edgerton anchors a film that speaks loudly through silenceRelease Date:Fri Nov 21, 2025 Netflix's newly released film 'Train Dreams' is a quiet, powerful drama about an ordinary life shaped by love, loss and change. With simple storytelling and honest emotion, it leaves a lasting impression without needing spectacle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/jennifer-lopez-goes-desi-in-saree-at-billionaire-wedding-fans-cheer-the-look-2824738-2025-11-23",
      "headline": "Jennifer Lopez goes desi in saree at billionaire wedding, fans cheer the look Jennifer Lopez made a striking appearance in a traditional pink saree at the high-profile wedding of Netra Mantena and Vamsi Gadiraju in Udaipur, drawing widespread attention from guests and fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/hanumankind-comeback-royal-enfield-motoverse-goa-knee-surgery-2824708-2025-11-23",
      "headline": "Hanumankind returns to stage in Goa three months after knee surgery. Watch Singer Hanumankind performed live at Royal Enfield MotoVerse 2025 in Goa, marking his stage comeback three months after undergoing knee surgery. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/spirit-film-mahurat-ceremony-begins-production-sandeep-reddy-vanga-prabhas-triptii-dimri-2824690-2025-11-23",
      "headline": "Sandeep Vanga, Triptii Dimri begin Spirit shooting with mahurat ceremony. Pics Sandeep Reddy Vanga's film 'Spirit' was launched with a special mahurat ceremony today. While the crew and several notable guests were present, Prabhas did not attend the ceremony."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amol-parashar-on-play-besharam-aadmi-the-story-tells-you-to-shed-misplaced-shame-2824693-2025-11-23",
      "headline": "Amol Parashar on play Besharam Aadmi: The story tells you to shed misplaced shame Actor Amol Parashar opened up at Sahitya Aajtak 2025 about why he named his play 'Besharam Aadmi', explaining that it challenges society's misplaced sense of shame. He said the story urges people to drop the guilt that stops them from doing good, especially in everyday relationships."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/never-thought-of-acting-as-profession-jaideep-ahlawat-once-wanted-to-join-the-army-2824687-2025-11-23",
      "headline": "Jaideep Ahlawat wanted to join the Army: Never thought of acting as profession Actor Jaideep Ahlawat recently revealed that he wanted to join the Indian Army before adopting acting as a profession. Here's what he said at Sahitya AajTak 2025"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/ektaa-kapoor-saw-me-at-office-reception-cast-me-as-tulsi-smriti-irani-bagging-kyunki-saas-bhi-kabhi-bahu-thi-2824654-2025-11-23",
      "headline": "Smriti Irani on bagging Kyunki: Ekta saw me at office reception, cast me as Tulsi Actor and politician Smriti Irani recently spoke about how she bagged the popular role as Tulsi Virani in 'Kyunki Saas Bhi Kabhi Bahu Thi'. The actor looked back at her initial career days and said how the role changed her role. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/divyabharathi-accuses-goat-director-naresh-kuppili-of-misconduct-aicwa-demands-womens-safety-reforms-2824629-2025-11-23",
      "headline": "Cine workers body backs Divyabharathi, urges women's safety reforms in films Actor Divyabharathi's public accusations against director Naresh Kuppili have led to calls from the All Indian Cine Workers Association for a formal enquiry and stronger mechanisms to protect women in the Indian film industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/naga-chaitanya-nc24-titled-vrushakarma-makers-unveil-poster-actor-birthday-2824618-2025-11-23",
      "headline": "Naga Chaitanya's NC24 titled Vrushakarma, makers unveil poster on actor's birthday On actor Naga Chaitanya's birthday today, the makers of his upcoming film 'NC24' unveiled the first look poster along with the title. The film also stars Meenakshi Chaudhary in a key role. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/sobhita-dhulipala-birthday-wish-naga-chaitanya-protective-husband-see-pic-2824613-2025-11-23",
      "headline": "Sobhita's birthday wish shows Naga Chaitanya as protective husband. See pic Actor Sobhita Dhulipala shared a special post on her husband Naga Chaitanya's 39th birthday with a romantic picture of the couple. Take a look at the post here. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/salman-khan-confronts-amaal-mallik-shehbaz-badeshah-bigg-boss-19-weekend-ka-vaar-2824592-2025-11-23",
      "headline": "Bigg Boss 19: Salman Khan confronts Amaal, Shehbaz for disrespectful conduct During the recent Weekend Ka Vaar episode on Bigg Boss 19, host Salman Khan confronted contestants Amaal Mallik and Shehbaz Badeshah regarding their comments and behaviour on the show. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-slams-ukraine-volodymyr-zelenskyy-zero-gratitude-as-europe-scrambles-to-save-peace-framework-2824819-2025-11-23",
      "headline": "Trump slams Ukraine's 'zero gratitude' as Europe scrambles to save peace frameworkIn a lengthy Truth Social post, Trump accused Ukraine's leadership of \"zero gratitude\" towards US's efforts in ending the war. He also slammed Europe for continuing to buy oil from Russia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/defence-minister-rajnath-singh-says-borders-can-change-and-sindh-may-return-to-india-again-2824774-2025-11-23",
      "headline": "Borders can change, Sindh may return to India: Rajnath Singh's big remarkDefence Minister Rajnath Singh, while speaking at an event, said the Sindh region, now in Pakistan, may not be part of India today but it will always be civilisationally a part of India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pm-modi-carney-india-canada-resume-trade-negotiations-glbs-2824839-2025-11-24",
      "headline": "PM Modi invites Carney to New Delhi as India, Canada move to resume trade talksThe MEA said the leaders agreed to begin negotiations on a \"high-ambition\" Comprehensive Economic Partnership Agreement (CEPA), aiming to double bilateral trade by 2030."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/zelenskyy-thanks-us-amid-geneva-peace-talks-trump-criticises-kyiv-glbs-2824824-2025-11-23",
      "headline": "Zelenskyy's 'thank you, America' post after Trump's 'zero gratitude' rantUkrainian President Zelenskyy thanked the United States and President Trump for their support during Geneva peace talks. The meetings come amid tensions over a US-drafted peace plan seen as favouring Moscow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/gujarati-ben-mumbai-ahmedabad-gujarat-making-for-america-thepla-fafda-hit-among-indian-techies-nri-students-diaspora-usa-2824509-2025-11-23",
      "headline": "How Gujarati kitchens became lifelines for Indian students and techies in USBefore flying to the US, many travellers make a quick stop at small businesses in Mumbai and Ahmedabad to stock up on vacuum-sealed packets of thepla, fafda, ready-to-eat pav bhaji, and other Gujarati snacks. The Gujarati women who run these businesses from their home kitchens are a lifeline for students and techies going to the US. Their pre-ordered foods are especially for those travelling abroad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/mamdani-repeats-trump-fascist-despot-after-white-house-meeting-glbs-2824836-2025-11-24",
      "headline": "Mamdani repeats Trump is a 'fascist, despot' days after White House meetingNew York City Mayor-elect Zohran Mamdani says he still believes Donald Trump is a \"fascist\", despite a polite meeting at the White House. Mamdani said he will work with Trump on affordability issues while standing by his past remarks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/wing-commander-afshan-wife-of-namash-syal-killed-dubai-tejas-crash-emotional-farewell-to-husband-2824739-2025-11-23",
      "headline": "Wing Commander's teary goodbye to fighter pilot husband killed in Tejas crashVideos showed an inconsolable Wing Commander Afshan, with tears profusely rolling down her eyes, paying her final salutations to her husband."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/israel-targets-hezbollah-chief-of-staff-in-first-strike-on-beirut-in-months-2824780-2025-11-23",
      "headline": "Hezbollah chief-of-staff Haytham Ali Tabatabai killed in Beirut strike: IsraelThe Israel Defense Forces have reportedly eliminated Hezbollah's chief of staff Ali Tabatabai in a rare strike on Beirut's southern suburbs, marking a significant blow to the group's leadership. This operation reflects Israel's ongoing efforts to curb Hezbollah's military capabilities amid rising regional tensions.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/video/video-protesters-march-in-washington-demanding-trumps-impeachment-removal-2824809-2025-11-23",
      "headline": "Video: Protesters march in Washington demanding Trump's impeachment, removalDemonstrators return to the streets with renewed urgency. Organisers accuse Trump of authoritarian overreach. Lawmakers promise impeachment articles before Christmas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/usha-vance-without-wedding-ring-jd-vance-marriage-rumours-america-vice-president-2824634-2025-11-23",
      "headline": "Mother of 3…: Usha Vance breaks silence after being spotted without wedding ringA recent photo of Second Lady Usha Vance without her wedding ring during a visit to Camp Lejeune reignited months of speculation around her marriage with JD Vance, prompting a clarification from her. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-odi-squad-bcci-kl-rahul-captain-2824737-2025-11-23",
      "headline": "KL Rahul to lead India vs South Africa, Ruturaj Gaikwad returns to ODI squadIndia vs South Africa: KL Rahul will lead India in the absence of Shubman Gil in the upcoming ODI series, starting November 30. Rohit Sharma and Virat Kohli have been named in India's 15-man squad, which features Ravindra Jadeja and Ruturaj Gaikwad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/fresh-protests-erupt-at-india-gate-over-delhis-toxic-air-cop-injured-in-chilli-spray-attack-6-detained-2824804-2025-11-23",
      "headline": "Fresh protests at India Gate over Delhi pollution, chilli sprayed on cops; 6 detainedThe protesters had gathered near India Gate demanding action on the city's \"very poor\" air quality, but were eventually removed by police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/vijay-varma-gustakh-ishq-fatima-sana-shaikh-2824784-2025-11-23",
      "headline": "Vijay Varma: Gustakh Ishq will remind of life before mobile phonesVijay Varma and Fatima Sana Shaikh discussed their upcoming romantic film, 'Gustakh Ishq', at Sahitya Aajtak 2025 on Sunday. The film also features Naseeruddin Shah."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/cgc-university-mohali-where-vision-becomes-legacy-and-education-becomes-evolution-2821185-2025-11-17",
      "headline": "CGC University, Mohali: Where vision becomes legacy and education becomes evolutionStories of students who dare to dream, of educators who ignite curiosity, and of a community that chooses progress with purpose."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uranium-detected-in-breastmilk-samples-in-bihar-70-of-infants-at-risk-study-2824748-2025-11-23",
      "headline": "Uranium detected in breastmilk samples in Bihar, 70% of infants at risk: StudyA recent study flagged the presence of uranium in the breastmilk of lactating mothers across several districts in Bihar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-wedding-postponed-father-unwell-palash-muchhal-2824709-2025-11-23",
      "headline": "Smriti Mandhana's wedding postponed after father shows heart attack symptomsSmriti Mandhana and Palash Muchhal's wedding has been postponed indefinitely after the cricketer's father fell ill. Dr. Naman Shah, Director of Sarvhit Hospital, said that her father showed symptoms of a heart attack after pain on the left side of his chest.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-ravindra-jadeja-odi-squad-announcement-comeback-bcci-kl-rahul-2824746-2025-11-23",
      "headline": "Ravindra Jadeja returns to ODI squad as India rest like-for-like Axar PatelIND vs SA: Ravindra Jadeja's ODI journey gets a fresh lifeline as he earns a recall for the South Africa series, ending months of speculation around his place in the format."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-545-21-11-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/lost-in-translation-indian-techie-terrified-after-uber-drivers-message-misreads-as-threat-2824315-2025-11-22",
      "headline": "Lost in translation: Indian techie terrified after Uber driver's message misreads as threatA Meta techie's Uber ride turned frightening due to a wrong auto-translated message from the driver, and no one was prepared for what the original message from the driver was."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-labour-codes-10-key-changes-every-employee-should-know-2824640-2025-11-23",
      "headline": "New labour codes: 10 key changes every employee should knowWhether someone works full-time, on a contract, or in sector-specific roles like media, plantations or factories, the new framework affects nearly everyone. Here are the key updates workers should be aware of, along with several other important changes that haven't received enough attention."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranveer-singh-says-udaipur-played-cupid-in-his-love-story-with-deepika-padukone-2824796-2025-11-23",
      "headline": "Ranveer Singh says Udaipur played Cupid in his love story with Deepika PadukoneRanveer Singh spoke about the significance of Udaipur in his personal life during the wedding celebrations of Netra Mantena and Vamsi Gadiraju. The actor shared memories from 2013 when he and Deepika Padukone first grew close during a shoot in the city. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bangladesh-urges-india-to-return-sheikh-hasina-after-tribunals-death-sentence-2824823-2025-11-23",
      "headline": "Bangladesh sends extradition request to India for Sheikh HasinaBangladesh's interim government led by Muhammad Yunus has formally requested India to extradite deposed prime minister Sheikh Hasina following her death sentence by the International Crimes Tribunal. This move intensifies diplomatic tensions between the two neighbouring countries amid serious allegations.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/dmk-functionary-named-in-rape-fir-after-woman-alleges-months-of-assault-blackmail-2824830-2025-11-23",
      "headline": "Woman accuses DMK functionary of sexual harassment, blackmail; case registeredA DMK functionary Baskaran has been FIR registered for sexual harassment and blackmail by a 25-year-old woman in Tamil Nadu. The case has sparked political reactions with opposition demanding strict action and better safety measures for women.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-police-busts-international-drug-syndicate-seizes-meth-worth-rs-262-crore-2824783-2025-11-23",
      "headline": "Delhi Police busts international drug syndicate, seizes meth worth Rs 262 croreA major drug syndicate has been busted in Delhi with the seizure of over 328 kg of methamphetamine worth Rs 262 crore. The operation highlights the success of coordinated efforts by NCB and Delhi Police against synthetic drug trafficking.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/wicked-for-good-sets-box-office-records-226-million-global-debut-2824817-2025-11-23",
      "headline": "Wicked: For Good becomes biggest Broadway film debut with $226M worldwide'Wicked: For Good', Universal's highly-anticipated musical, has made a remarkable debut at the box office with outstanding earnings and audience response, setting new records for Broadway musical adaptations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranveer-singh-says-udaipur-played-cupid-in-his-love-story-with-deepika-padukone-2824796-2025-11-23",
      "headline": "Ranveer Singh says Udaipur played Cupid in his love story with Deepika PadukoneRanveer Singh spoke about the significance of Udaipur in his personal life during the wedding celebrations of Netra Mantena and Vamsi Gadiraju. The actor shared memories from 2013 when he and Deepika Padukone first grew close during a shoot in the city. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravi-shastris-bold-advice-to-declare-early-for-india-to-win-in-guwahati-2824816-2025-11-23",
      "headline": "Shastri's bold advice for India to win in Guwahati: Declare 100 behind if needed Ravi Shastri has called on India to adopt a bold strategy in the Guwahati Test, suggesting a declaration even while trailing. India are trailing by 480 runs in the second innings after South Africa posted a massive score of 489."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-489-too-many-cheteshwar-pujara-guwahati-test-bowlers-2824818-2025-11-23",
      "headline": "India bowlers worked hard but South Africa's 489 is too many: Cheteshwar Pujara IND vs SA: Cheteshwar Pujara believes India's bowlers did their job early but let the game slip away. On a flat Guwahati pitch, South Africa's 489 has created a massive mountain for the hosts to climb."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/kl-rahul-to-captain-india-in-odis-vs-south-africa-rohit-kohli-in-squad-ytvd-2824815-2025-11-23",
      "headline": "KL Rahul to Captain India in ODIs vs South Africa | Rohit Sharma, Virat Kohli in Squad This special report covers the selection of KL Rahul as the captain for the Indian cricket team's upcoming ODI series against South Africa, starting November 29. The squad, announced by the Ajit Agarkar-led selection committee, includes senior players Virat Kohli and Rohit Sharma. The report notes the committee 'opted to hand Rahul the captaincy even though Rohit Sharma was available to act as stand-in skipper'. Rahul's appointment comes as regular captain Shubman Gill was ruled out due to a neck injury sustained during a Test match. The team composition also sees pacers Jasprit Bumrah and Mohammed Siraj being rested for the series, while all-rounder Ravindra Jadeja has been brought in as a replacement for Akshar Patel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-on-england-bazball-batting-ashes-test-perth-ben-stokes-2824802-2025-11-23",
      "headline": "R Ashwin tears into England's Bazball approach: How reckless can you be? Ravichandran Ashwin has criticised England's Bazball approach after their batting collapse in the first Ashes Test in Perth. Ashwin questioned whether high-risk batting is being wrongly justified as positive intent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-crush-zimbabwe-rawalpindi-t20i-tri-series-final-usman-tariq-babar-azam-2824805-2025-11-23",
      "headline": "Clinical Pakistan hammer Zimbabwe to storm into T20I tri-series final PAK vs ZIM: Pakistan stormed into the T20I tri-series final with a dominant 69-run win over Zimbabwe, powered by fifties from Sahibzada Farhan and Babar Azam, and Usman Tariq's hat-trick.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/usman-tariq-hat-trick-zimbabwe-pakistan-tri-series-rawalpindi-2824800-2025-11-23",
      "headline": "Usman Tariq rattles Zimbabwe, becomes 4th Pakistan bowler with Men's T20I hat-trick PAK vs ZIM: Usman Tariq etched his name into Pakistan's cricket history with a brilliant T20I hat-trick against Zimbabwe in Rawalpindi, becoming the country's fourth bowler to achieve the feat. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-apology-andre-silva-diogo-jota-obituary-video-mistake-elche-2824792-2025-11-23",
      "headline": "Real Madrid apologise to Elche's Andre Silva over Diogo Jota obituary confusion Real Madrid issued an apology after mistakenly using the wrong Andre Silva's image in a tribute video. The mix-up, made during a memorial segment, was quickly acknowledged and publicly corrected by the club."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kuldeep-yadav-defends-rishabh-pant-tactics-south-africa-test-guwahati-2824779-2025-11-23",
      "headline": "Rishabh Pant faces scrutiny for Guwahati Test captaincy, Kuldeep Yadav defends skipper Kuldeep Yadav has defended captain Rishabh Pant's field settings during the second Test against South Africa. Pant was criticised for his field placement and on-field tactics during South Africa's first innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-blind-womens-cricket-team-win-inaugural-t20-world-cup-celebration-2824775-2025-11-23",
      "headline": "Watch: India Blind team imitates Harmanpreet's iconic celebration after World Cup win India's blind women's team lifted the T20 World Cup in style, mirroring Harmanpreet Kaur's iconic celebration and dominating Nepal with a clinical all-round performance led by Phula Saren's match-winning heroics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/smriti-mandhanas-wedding-postponed-due-to-fathers-medical-emergency-ytvd-2824756-2025-11-23",
      "headline": "Smriti Mandhana's Wedding Postponed Due To Father's Medical Emergency This special report covers the indefinite postponement of Indian cricketer Smriti Mandhana's wedding to music composer Palash Muchhal. The decision was made following a medical emergency involving her father, Shrinivas Mandhana, who was hospitalised on the morning the ceremony was scheduled to take place. The report states, 'Smriti Mandana has decided that until her father recovers, the wedding which was supposed to happen today will be postponed indefinitely'. The segment includes live inputs from India Today's Nitin Srivastava, who confirms that Mandhana's father is under observation and undergoing tests. The family has requested privacy as they focus on his recovery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-kuldeep-yadav-guwahati-pitch-road-no-complaints-2824750-2025-11-23",
      "headline": "Kuldeep Yadav's stunning take on Guwahati Test pitch: It was road, but no complaints IND vs SA: Kuldeep Yadav called the Guwahati surface \"like a road\" as South Africa piled up 489, leaving India chasing time rather than turn. On a flat track, the challenge now is purely about survival and discipline."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-apology-andre-silva-diogo-jota-obituary-video-mistake-elche-2824792-2025-11-23",
      "headline": "Real Madrid apologise to Elche's Andre Silva over Diogo Jota obituary confusion Real Madrid issued an apology after mistakenly using the wrong Andre Silva's image in a tribute video. The mix-up, made during a memorial segment, was quickly acknowledged and publicly corrected by the club."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kuldeep-yadav-defends-rishabh-pant-tactics-south-africa-test-guwahati-2824779-2025-11-23",
      "headline": "Rishabh Pant faces scrutiny for Guwahati Test captaincy, Kuldeep Yadav defends skipper Kuldeep Yadav has defended captain Rishabh Pant's field settings during the second Test against South Africa. Pant was criticised for his field placement and on-field tactics during South Africa's first innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-blind-womens-cricket-team-win-inaugural-t20-world-cup-celebration-2824775-2025-11-23",
      "headline": "Watch: India Blind team imitates Harmanpreet's iconic celebration after World Cup win India's blind women's team lifted the T20 World Cup in style, mirroring Harmanpreet Kaur's iconic celebration and dominating Nepal with a clinical all-round performance led by Phula Saren's match-winning heroics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/smriti-mandhanas-wedding-postponed-due-to-fathers-medical-emergency-ytvd-2824756-2025-11-23",
      "headline": "Smriti Mandhana's Wedding Postponed Due To Father's Medical Emergency This special report covers the indefinite postponement of Indian cricketer Smriti Mandhana's wedding to music composer Palash Muchhal. The decision was made following a medical emergency involving her father, Shrinivas Mandhana, who was hospitalised on the morning the ceremony was scheduled to take place. The report states, 'Smriti Mandana has decided that until her father recovers, the wedding which was supposed to happen today will be postponed indefinitely'. The segment includes live inputs from India Today's Nitin Srivastava, who confirms that Mandhana's father is under observation and undergoing tests. The family has requested privacy as they focus on his recovery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-kuldeep-yadav-guwahati-pitch-road-no-complaints-2824750-2025-11-23",
      "headline": "Kuldeep Yadav's stunning take on Guwahati Test pitch: It was road, but no complaints IND vs SA: Kuldeep Yadav called the Guwahati surface \"like a road\" as South Africa piled up 489, leaving India chasing time rather than turn. On a flat track, the challenge now is purely about survival and discipline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-zimbabwe-tri-series-updates-babar-azam-salman-agha-2824747-2025-11-23",
      "headline": "Pakistan vs Zimbabwe, T20I tri-series, Match 4: Highlightsfrom RawalpindiPAK vs ZIM, T20I tri-series, Match 4 Highlights: Pakistan stormed into the T20I tri-series final with a dominant 69-run win over Zimbabwe, powered by fifties from Sahibzada Farhan and Babar Azam, and Usman Tariq's hat-trick.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-ravindra-jadeja-odi-squad-announcement-comeback-bcci-kl-rahul-2824746-2025-11-23",
      "headline": "Ravindra Jadeja returns to ODI squad as India rest like-for-like Axar PatelIND vs SA: Ravindra Jadeja's ODI journey gets a fresh lifeline as he earns a recall for the South Africa series, ending months of speculation around his place in the format."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-south-africa-kuldeep-yadav-press-conference-guwahati-test-2824745-2025-11-23",
      "headline": "Can't attack all the time and leak runs: Kuldeep Yadav on toiling hard in Guwahati TestIND vs SA, 2nd Test: Kuldeep Yadav picked up four wickets, but worked hard for nearly 30 overs as South Africa put up a massive score of 489 in the first innings of the second Test at the Barsapara Stadium in Guwahati. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-odi-squad-bcci-kl-rahul-captain-2824737-2025-11-23",
      "headline": "KL Rahul to lead India vs South Africa, Ruturaj Gaikwad returns to ODI squadIndia vs South Africa: KL Rahul will lead India in the absence of Shubman Gil in the upcoming ODI series, starting November 30. Rohit Sharma and Virat Kohli have been named in India's 15-man squad, which features Ravindra Jadeja and Ruturaj Gaikwad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-have-india-won-a-test-after-conceding-450-in-first-innings-2824722-2025-11-23",
      "headline": "Not impossible? Have India won a Test after conceding 450 in first inningsIndia are struggling after South Africa posted a massive 489 in the second Test at Guwahati. The hosts aim to draw inspiration from their historic comebacks to level the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-2nd-test-day-2-score-senuran-jansen-bowlers-2824711-2025-11-23",
      "headline": "Home disadvantage? India bowlers toil as South Africa pile on 489 in GuwahatiIndia vs South Africa, 2nd Test Day 2: Senuran Muthusamy's 109 and Marco Jansen's 93 ensured South Africa added 243 runs for their last four wickets and posted a massive first innings total of 489. India now face an unforgiving equation: bat big, bat fast, and find urgency, or watch South Africa stroll to a series win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-wedding-postponed-father-unwell-palash-muchhal-2824709-2025-11-23",
      "headline": "Smriti Mandhana's wedding postponed after father shows heart attack symptomsSmriti Mandhana and Palash Muchhal's wedding has been postponed indefinitely after the cricketer's father fell ill. Dr. Naman Shah, Director of Sarvhit Hospital, said that her father showed symptoms of a heart attack after pain on the left side of his chest.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-wins-inaugural-womens-t20-world-cup-for-the-blind-2824689-2025-11-23",
      "headline": "India script history, clinch inaugural Women's T20 World Cup for the BlindIndia made history by winning the first-ever Women's T20 World Cup for the Blind, outplaying Nepal with a convincing seven-wicket victory in the final. A disciplined bowling display and a commanding chase led by Phula Saren highlighted India's dominance, capping an undefeated tournament campaign."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-have-india-won-a-test-after-conceding-450-in-first-innings-2824722-2025-11-23",
      "headline": "Not impossible? Have India won a Test after conceding 450 in first inningsIndia are struggling after South Africa posted a massive 489 in the second Test at Guwahati. The hosts aim to draw inspiration from their historic comebacks to level the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-2nd-test-day-2-score-senuran-jansen-bowlers-2824711-2025-11-23",
      "headline": "Home disadvantage? India bowlers toil as South Africa pile on 489 in GuwahatiIndia vs South Africa, 2nd Test Day 2: Senuran Muthusamy's 109 and Marco Jansen's 93 ensured South Africa added 243 runs for their last four wickets and posted a massive first innings total of 489. India now face an unforgiving equation: bat big, bat fast, and find urgency, or watch South Africa stroll to a series win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-wedding-postponed-father-unwell-palash-muchhal-2824709-2025-11-23",
      "headline": "Smriti Mandhana's wedding postponed after father shows heart attack symptomsSmriti Mandhana and Palash Muchhal's wedding has been postponed indefinitely after the cricketer's father fell ill. Dr. Naman Shah, Director of Sarvhit Hospital, said that her father showed symptoms of a heart attack after pain on the left side of his chest.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-wins-inaugural-womens-t20-world-cup-for-the-blind-2824689-2025-11-23",
      "headline": "India script history, clinch inaugural Women's T20 World Cup for the BlindIndia made history by winning the first-ever Women's T20 World Cup for the Blind, outplaying Nepal with a convincing seven-wicket victory in the final. A disciplined bowling display and a commanding chase led by Phula Saren highlighted India's dominance, capping an undefeated tournament campaign."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/travis-head-australia-long-term-test-opener-ashes-century-2824680-2025-11-23",
      "headline": "David Warner makes big call: Has Travis Head locked Australia's Test opener spot?Ashes: Former opener David Warner has backed Travis Head to become Australia's permanent Test opener. Head, who batted as a makeshift opener in Perth, smashed 123 off 83 balls in their successful chase of 205 in the series opener, which finished inside two days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/marco-jansen-misses-maiden-test-hundred-south-africa-489-india-guwahati-2824688-2025-11-23",
      "headline": "Watch: Marco Jansen falls for 93, distraught after missing maiden Test hundredMarco Jansen's pursuit of a maiden Test hundred came to a painful halt as the South African all-rounder was dismissed for 93 on Day 2 of the second Test in Guwahati."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-frustration-kuldeep-warning-india-vs-south-africa-2nd-test-2824657-2025-11-23",
      "headline": "Mazak bana rakha hai? Rishabh Pant loses cool on Kuldeep Yadav in Guwahati TestStand-in India captain Rishabh Pant let his frustration show on the morning of Day 2 of the Guwahati Test, snapping at Kuldeep Yadav after India were hit with a second warning for delaying the start of an over."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/who-is-senuran-muthusamy-maiden-test-century-south-africa-control-india-2824643-2025-11-23",
      "headline": "Who is Senuran Muthusamy? Indian-origin star hits maiden Test hundredIND vs SA, 2nd Test: Indian-origin all-rounder Senuran Muthusamy hit his maiden Test hundred to put South Africa in a commanding position and frustrate India on Day 2 of the second Test in Guwahati."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-squad-odi-t20i-selection-live-updates-captaincy-rohit-virat-2824641-2025-11-23",
      "headline": "IND v SA squad announcement highlights: Jadeja, Gaikwad return to ODIsIndia vs South Africa ODI and T20I squad selection: The BCCI selection committee will meet on Sunday, November 23 to pick the one-day and T20I squad. Shubman Gill is all but ruled out of the ODI series, starting November 30 and India are looking at Shubman Gill or Rishabh Pant for leadership. Follow us for all updates on the big selection day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/lakshya-sen-wins-sydney-super-500-title-2824620-2025-11-23",
      "headline": "Resurgent Lakshya Sen wins Australian Open, ends wait for first title of the yearLakshya Sen ended his title drought by winning the Australian Open, a Super 500 tournament in Sydney. The World No. 14 defeated Japan's Yushi Tanaka in straight games in a one-sided final on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-2nd-test-guwahati-rishabh-pant-captaincy-anil-kumble-2824616-2025-11-23",
      "headline": "Passive? Pant's captaincy questioned after wicketless session in Guwahati TestIndia vs South Africa: India's lack of intent on a benign Guwahati pitch has reignited scrutiny of their tactical flexibility. South Africa added 69 runs on Sunday morning without losing a wicket in the first session as they went past 300 in the first innings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/liverpool-suffer-heavy-3-0-home-defeat-to-nottingham-forest-premier-league-2824562-2025-11-23",
      "headline": "Liverpool manager Arne Slot accepts blame for Nottingham Forest hammeringLiverpool manager Arne Slot has accepted the blame for his side's humbling loss to Nottingham Forest at Anfield on Saturday, November 22. The Reds were hammered 0-3 at home as their poor run of form continued. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}