{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/china-files-wto-complaint-against-india-over-ev-subsidies-and-batteries-2805811-2025-10-20",
      "headline": "China files WTO complaint against India over EV subsidies and batteriesChina has filed a complaint against India at the World Trade Organization, challenging New Delhi's subsidies for electric vehicles (EVs) and batteries. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/diwali-muhurat-trading-on-october-21-everything-investors-need-to-know-special-market-session-2805749-2025-10-20",
      "headline": "Muhurat Trading on October 21: Check timing, trade strategy and moreMuhurat Trading will take place on October 21 this year. The pre-open session will run from 1:30 pm to 1:45 pm, followed by the main trading window from 1:45 pm to 2:45 pm, and a closing session until 3:05 pm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/reliance-shares-jump-q2-results-diwali-portfolio-buy-sell-explained-2805722-2025-10-20",
      "headline": "Reliance shares jump 3% after Q2 results. Should it be in your Diwali portfolio?Around 10:20 am, shares of Reliance Industries rose 3.22% to Rs 1,462.60 on the Bombay Stock Exchange (BSE). The stock's sharp upmove added to the broader market rally on Dalal Street as sentiment turned upbeat following a string of solid earnings reports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-surges-over-650-points-nifty-above-25900-reliance-banking-stocks-rally-2805697-2025-10-20",
      "headline": "Diwali cheer on Dalal Street as Sensex jumps nearly 700 pointsAt around 9:23 am, the S&P BSE Sensex jumped 673.90 points to 84,626.09, while the NSE Nifty50 surged 202.50 points to 25,912.35. Broader market indices also witnessed sharp gains, and volatility dropped, indicating strong investor confidence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/silver-price-falls-after-dhanteras-diwali-but-is-precious-metal-still-a-good-bet-explained-2805622-2025-10-20",
      "headline": "Silver prices fall after Diwali buying. Is it still a good bet?Silver has surged nearly 98% in a year, breaching Rs 2 lakh/kg in parts of India before a post-Diwali dip. But is investing in the precious metal still a good bet? With industrial demand booming and supply tightening, reports suggest silver's shine might just be getting started."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/china-rare-earth-export-curbs-impact-eu-industries-auto-defence-response-glbs-2805666-2025-10-20",
      "headline": "EU to hold urgent talks on European industries hit by China's rare earth curbsChina, the world's leading producer of the minerals used to make magnets crucial to the auto, electronics and defence industries, this month announced new controls on the export of rare-earth technologies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nirmala-sitharaman-gst-reforms-rate-cut-common-man-diwali-sales-auto-electronics-trump-tariffs-2805079-2025-10-18",
      "headline": "PM's Diwali gift delivered: Nirmala Sitharaman presents GST 2.0 report cardGST Bachat Utsav: Sitharaman, addressing a press conference along with ministers Piyush Goyal and Ashwini Vaishnaw ahead of Diwali, said the GST rate cuts resulted in bumper sales of cars and electronics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-prices-record-high-dhanteras-2025-buy-avoid-strategy-explained-diwali-2805075-2025-10-18",
      "headline": "Gold prices near record high on Dhanteras: Should you buy?Gold prices have been on a relentless rally, hitting new record highs almost every day. But does this glittering streak make it the right fit for your investment portfolio this Dhanteras?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/zoho-sridhar-vembu-gold-price-warning-systemic-risk-global-economy-2805062-2025-10-18",
      "headline": "Gold flashing a big warning signal: Zoho's Sridhar Vembu says amid rising pricesAs gold prices soar globally, Zoho's Sridhar Vembu raises a red flag. Does the surge signal investor anxiety and eroding trust in the system or reveal a deeper economic fault line?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-prices-hit-record-high-of-rs-134800-per-10-grams-in-delhi-ahead-of-dhanteras-2804887-2025-10-17",
      "headline": "Gold prices hit record high ahead of Dhanteras, see Rs 3,200 hike in DelhiTraders said gold buying activity picked up sharply as stockists built fresh positions on expectations of higher sales during the festive season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/silver-prices-india-dhanteras-soar-invest-in-silver-but-as-utensils-here-is-why-long-term-short-term-capital-gains-taxes-investment-2804634-2025-10-17",
      "headline": "Why silver utensils, not coins, could help make more moneyWith the price of silver at a record high, silverware might be a potential tax-saving alternative to bars and coins. Personal-use silver utensils are exempt from capital gains tax when sold. Here's what chartered accountants have to say about silver utensils helping investors save on taxes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-484-points-higher-nifty-above-25700-asian-paints-jumps-4-2804682-2025-10-17",
      "headline": "Sensex ends 484 points higher, Nifty above 25,700; Asian Paints jumps 4%The S&P BSE Sensex settled 484.53 points higher at 83,952.19, while the NSE Nifty50 rose 124.55 points to close at 25,709.85. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/diwali-2025-from-gold-etfs-to-sgbs-5-smart-ways-to-invest-in-gold-sovereign-gold-bonds-gold-futures-and-options-2804641-2025-10-17",
      "headline": "Diwali 2025: From ETFs to SGBs, 5 smart ways to invest in goldWith gold prices at record levels this Diwali, many people are rethinking whether to buy jewellery or look at smarter investment routes. From gold ETFs to SGBs, there are safer and more practical ways to invest without worrying about storage or high-making charges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/coca-cola-india-ipo-hindustan-coca-cola-beverages-valuation-2804639-2025-10-17",
      "headline": "Coca-Cola eyes $1 billion IPO for Indian bottling arm: ReportThe discussions are still in early stages, and Coca-Cola has not yet appointed bankers for the deal. The listing could take place as early as next year, though details such as timing, structure, and offer size are still being worked out, the report said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-keeping-all-your-money-in-saving-account-may-be-a-costly-mistake-explains-ca-2804612-2025-10-17",
      "headline": "Why keeping all your money in saving account may be a costly mistake, explains CAMany people believe that money parked in a savings account is the safest option. But an expert warns that this habit could quietly drain your wealth over time, especially when inflation eats into low returns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-rule-change-2025-what-changes-how-it-affects-you-2804586-2025-10-17",
      "headline": "EPFO rule change: What's new in PF withdrawals and how it affects youConfused about the new EPFO rules? This guide covers every update, from withdrawal limits to pension changes, in one place."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/dhanteras-2025-know-gold-and-silver-rates-in-your-city-before-you-buy-gold-price-silver-price-2804579-2025-10-17",
      "headline": "Dhanteras 2025: Know gold and silver rates in your city before you buyDhanteras is a day when many Indian families choose to bring home gold or silver, believing it invites prosperity and good fortune. From jewellery and coins to small utensils, shoppers often plan their purchases in advance. But with prices running high this season, checking the latest rates in your city has become more important than ever."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/diwali-2025-planning-to-buy-or-gift-gold-know-the-tax-rules-first-income-tax-on-gold-2804510-2025-10-17",
      "headline": "Diwali 2025: Planning to buy or gift gold? Know the tax rules firstFrom coins to jewellery, gold remains a favourite Diwali buy. However, not everyone realises that certain tax rules apply when you purchase or gift gold. Knowing these in advance can help you avoid unexpected trouble later."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-rally-sensex-nifty-surge-festive-buying-fmcg-shares-diwali-2804505-2025-10-17",
      "headline": "Sensex surges 700 points: What is the stock market rising today?The S&P BSE Sensex jumped 647.53 points to 94,115.19 around 11:30 am, while the NSE Nifty50 gained 182.35 points to trade at 25,767.65. Most broader market indices also advanced, though volatility remained elevated."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dilwale-dhulaniya-le-jayengey-turns-30-himani-shivpuri-talks-on-screen-chemistry-with-srk-2805788-2025-10-20",
      "headline": "DDLJ turns 30: Himani Shivpuri talks on-screen vibe with Shah Rukh Khan Veteran actor Himani Shivpuri is overjoyed as 'Dilwale Dhulaniya Le Jayengey' turned 30 today. On the iconic milestone, the actor spoke about working with Shah Rukh Khan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rajat-bedi-opens-up-about-missing-his-moment-with-hrithik-roshan-in-koi-mil-gaya-2805804-2025-10-20",
      "headline": "Rajat Bedi opens up about missing his moment with Hrithik Roshan in Koi Mil Gaya Rajat Bedi revisited a missed opportunity to shine opposite Hrithik Roshan in 'Koi Mil Gaya', calling it a formative moment in his career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jacob-elordi-euphoria-season-3-will-be-incredibly-clever-and-cinematic-2805794-2025-10-20",
      "headline": "Jacob Elordi: Euphoria season 3 will be incredibly clever and cinematic Jacob Elordi teased exciting details about 'Euphoria Season 3', calling the experience \"incredibly liberating\" and praising creator Sam Levinson's \"clever and cinematic\" vision. The Emmy-winning series, returning after three years, will premiere in Spring 2026 on HBO with both returning and new cast members."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kajol-celebrates-ddlj-at-30-and-the-love-that-travelled-from-india-to-switzerland-2805787-2025-10-20",
      "headline": "DDLJ turns 30, Kajol thanks fans: Thank u all for loving it in this phenomenal way Kajol marked 30 years of 'Dilwale Dulhania Le Jayenge' with a heartfelt post celebrating the film's timeless legacy. Sharing images from Switzerland, where a special poster honours the classic, Kajol reflected on how the love for 'DDLJ' has travelled from India to hearts across the world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kbc-17s-ishit-bhatt-says-he-was-nervous-not-rude-apologises-after-viral-backlash-2805783-2025-10-20",
      "headline": "KBC 17's Ishit Bhatt says he was nervous, not rude; apologises after viral backlash 'KBC 17' contestant Ishit Bhatt has apologised after facing backlash for his behaviour towards host Amitabh Bachchan. The 10-year-old from Gujarat said he was \"nervous, not rude,\" and expressed regret for his tone during the episode."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajmal-amir-denies-sexual-misconduct-allegations-ai-voice-controversy-2805774-2025-10-20",
      "headline": "Actor Ajmal Amir denies allegations of sexual misconduct, cites AI manipulation Ajmal Amir denied sexual misconduct allegations, citing AI manipulation, and pledged to personally manage his social media moving forward."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/30-years-dilwale-dulhania-le-jayenge-how-maratha-mandir-continues-to-celebrate-raj-simrans-love-story-2805771-2025-10-20",
      "headline": "30 years of DDLJ: How Maratha Mandir continues to celebrate Raj-Simran's love story 'Dilwale Dulhania Le Jayenge' continues its timeless run at Mumbai's Maratha Mandir, celebrating 30 years of enchanting audiences with its unforgettable love story. This enduring ritual unites generations, keeping alive a cherished Bollywood legacy in the heart of the city."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khans-viral-remark-separating-balochistan-from-pakistan-sparks-debate-2805767-2025-10-20",
      "headline": "Salman Khan's viral remark separating Balochistan from Pakistan sparks debate Salman Khan mentioned Balochistan and Pakistan separately during his speech at a Riyadh event. Social media users now discuss whether it was the possible intent or a slip of the tongue. Comment reignites conversations on Balochistan's history and identity. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ishaan-khatter-backs-fair-work-hours-after-deepika-padukones-8-hour-shift-debate-2805755-2025-10-20",
      "headline": "Ishaan Khatter backs fair work hours after Deepika Padukone's 8-hour shift debate The debate on fair work hours in Bollywood is gaining momentum, with Ishaan Khatter urging respect for everyone's time and Deepika Padukone's 8-hour stance highlighting gender double standards."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-j-hope-to-feature-in-le-sserafims-upcoming-single-spaghetti-2805758-2025-10-20",
      "headline": "BTS' J-hope to feature in Le Sserafim's upcoming single Spaghetti BTS' J-hope returns to the K-pop scene as a featured artist on Le Sserafim's upcoming single 'Spaghetti', marking his first-ever collaboration with a girl group. The track promises a bold fusion of J-hope's signature groove and Le Sserafim's experimental sound."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/sudeep-returns-bigg-boss-kannada-host-wife-priya-24-years-marriage-2805739-2025-10-20",
      "headline": "Sudeep and wife Priya celebrate 25 years of marriage on Bigg Boss Kannada 12 Bigg Boss Kannada 12 celebrated Sudeep and Priya's 25th wedding anniversary with a surprise visit from Priya, as Sudeep's father revealed she persuaded him to return as host.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dulquer-salmaan-kaantha-release-date-out-film-to-hit-theatres-in-november-2805741-2025-10-20",
      "headline": "Dulquer Salmaan's Kaantha release date out, film to hit theatres in November Dulquer Salmaan's 'Kaantha' got a new release date. The actor announced it on the occasion of Diwali with a new motion poster."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-greets-fans-diwali-himalayas-trip-jailer-2-shoot-2805734-2025-10-20",
      "headline": "Rajinikanth greets fans on Diwali after Himalayas trip, set for Jailer 2 shoot Superstar Rajinikanth greeted fans in Chennai on Diwali after returning from a spiritual trip to the Himalayas. He is now preparing to resume shooting for the eagerly awaited sequel 'Jailer 2', generating excitement among fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/thamma-advance-booking-latest-update-ayushmann-khurrana-rashmika-mandanna-film-starts-slow-expected-to-pick-up-2805733-2025-10-20",
      "headline": "Thamma advance booking: Ayushmann-Rashmika film starts slow, expected to pick up Ayushmann Khurrana and Rashmika Mandanna's 'Thamma' opened to a slow start in advance bookings ahead of its Diwali release, selling over one lakh tickets across India. With a Rs 10 crore gross expected on Day 1, the film's performance may improve post-festivities as families return to theatres."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/maltis-diwali-party-was-lit-priyanka-chopra-shares-adorable-glimpse-from-bash-2805725-2025-10-20",
      "headline": "Malti's Diwali party was lit: Priyanka Chopra shares adorable glimpse from bash Priyanka Chopra marked Diwali with a cosy family celebration featuring daughter Malti's first festive party. She shared an adorable picture on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/parvathy-thiruvothu-wraps-filming-malayalam-feature-i-nobody-prithviraj-sukumaran-2805712-2025-10-20",
      "headline": "Actor Parvathy Thiruvothu wraps i Nobody shoot, shares heartfelt note Actor Parvathy Thiruvothu wrapped up the shoot for the Malayalam film, 'i, Nobody'. The actor reflected on her experience with co-star Prithviraj Sukumaran and the crew."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ibrahim-ali-khan-admits-nadaaniyan-was-a-bad-film-debuted-with-ho-jayega-attitude-reflects-on-trolling-and-future-projects-2805710-2025-10-20",
      "headline": "Ibrahim Ali Khan admits Nadaaniyan was a bad film: Debuted with ho jayega attitude Ibrahim Ali Khan opened up about the backlash to his Netflix debut 'Nadaaniyan', admitting the film was \"really bad\" and that he entered Bollywood with a casual \"ho jaayega\" attitude. The actor reflected on the trolling, the emotional toll it took, and how the failure reshaped his approach to acting."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dude-box-office-collection-rs-30-crore-nett-leads-diwali-tamil-films-2805705-2025-10-20",
      "headline": "Dude vs Bison box office: Pradeep's film hits Rs 30 crore, Dhruv film at Rs 10 crore Diwali witnessed a box office clash among three Tamil films, with 'Dude' leading collections. The holiday period is expected to boost ticket sales further, setting up a record opening weekend."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-tamil-9-apsara-evicted-vijay-sethupathi-addresses-fights-captaincy-bias-2805693-2025-10-20",
      "headline": "Bigg Boss Tamil 9 highlights: Apsara evicted, Vijay Sethupathi roasts Kamrudin Bigg Boss Tamil 9 saw Apsara evicted amidst heated arguments and captaincy issues. Vijay Sethupathi's intervention highlighted personal conflicts and biases within the house."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shouldnt-be-under-protection-like-this-indian-envoy-to-canada-flags-khalistani-concerns-2805807-2025-10-20",
      "headline": "Strange that I need protection in Canada: Indian envoy on Khalistani issueAs India and Canada attempt to mend strained ties, High Commissioner Dinesh Patnaik has rejected RCMP and Trudeau-era allegations linking Indian diplomats to homicides and extortion in Canada. In an interview with CTV Question Period, Patnaik said India is still waiting for evidence and described the claims as \"preposterous and absurd.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-celebrates-diwali-with-navy-personnel-onboard-ins-vikrant-2805740-2025-10-20",
      "headline": "INS Vikrant gave sleepless nights to Pak: PM's big praise for Navy on DiwaliIn the wake of the April 22 Pahalgam terror attacks, the Navy was placed on high alert in the Arabian Sea, prompting Pakistan to issue warnings amid fears of a possible naval strike. At the heart of the deployment was INS Vikrant, accompanied by 8 to 10 warships."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/rjd-candidate-list-143-seats-bihar-assembly-polls-mahagathbandhan-seat-sharing-rift-2805743-2025-10-20",
      "headline": "RJD fields 143 candidates for Bihar polls amid Mahagathbandhan seat-sharing riftRJD leader Tejashwi Yadav will contest from the Raghopur assembly seat in Vaishali district. The elections are scheduled for November 6 and 11, with counting and declaration of results on November 14."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/karnataka-bengaluru-ola-ceo-bhavish-aggarwal-suicide-k-aravind-2805784-2025-10-20",
      "headline": "Bengaluru Ola employee dies by suicide, blames CEO, company in 28-page death noteAn Ola Electric employee in Bengaluru died after allegedly consuming poison on September 28. A 28-page death note blamed CEO Bhavish Aggarwal and senior officer Subrata Kumar Das. An FIR was filed against them on October 6."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kapoor-family-celebrates-dhanteras-kareena-kapoor-alia-bhatt-karisma-kapoor-2805678-2025-10-20",
      "headline": "Kareena-Karisma, Alia Bhatt and Kapoor Khandan kickstart Diwali in style. PicsThe Kapoor family marked Dhanteras with a festive gathering, including Kareena Kapoor, Alia Bhatt, and Karisma Kapoor.  Alia Bhatt and Ibrahim Ali Khan shared glimpses of the celebrations on social media, showing the family's close bonds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/story/thousands-of-customers-hit-as-amazons-cloud-service-aws-reports-global-outage-apps-and-websites-down-2805800-2025-10-20",
      "headline": "Amazon cloud service AWS down globally; Snapchat, Prime Video among those affectedAmazon Web Services (AWS) experienced a major outage on Monday, disrupting access to numerous popular apps and websites including Fortnite, Snapchat, Coinbase, Robinhood, and Amazon's own services."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/chennai/story/tamil-nadu-chennai-rain-mk-stalin-diwali-monsoon-bay-of-bengal-imd-2805726-2025-10-20",
      "headline": "Heavy rain hits Chennai as Diwali celebrations begin, MK Stalin reviews readinessHeavy rain lashed several parts of Tamil Nadu's Chennai on Monday. IMD forecast widespread rainfall across Tamil Nadu and warned of a low-pressure formation over the Bay of Bengal around October 21."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khans-viral-remark-separating-balochistan-from-pakistan-sparks-debate-2805767-2025-10-20",
      "headline": "Salman Khan's viral remark separating Balochistan from Pakistan sparks debateSalman Khan mentioned Balochistan and Pakistan separately during his speech at a Riyadh event. Social media users now discuss whether it was the possible intent or a slip of the tongue. Comment reignites conversations on Balochistan's history and identity. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/silver-price-falls-after-dhanteras-diwali-but-is-precious-metal-still-a-good-bet-explained-2805622-2025-10-20",
      "headline": "Silver prices fall after Diwali buying. Is it still a good bet?Silver has surged nearly 98% in a year, breaching Rs 2 lakh/kg in parts of India before a post-Diwali dip. But is investing in the precious metal still a good bet? With industrial demand booming and supply tightening, reports suggest silver's shine might just be getting started."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-boards-air-force-one-using-small-stairs-sniper-nest-found-near-palm-beach-airport-glbs-2805669-2025-10-20",
      "headline": "Trump boards Air Force One using small stairs after sniper nest found near airportDonald Trump boarded Air Force One quickly on Sunday amid heightened security after the Secret Service found a suspected sniper's nest near Palm Beach airport. The FBI has taken over the probe, weeks after two assassination attempts on Trump raised fresh concerns about his safety."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-woman-cuts-off-brother-in-laws-private-parts-for-ditching-her-sister-after-affair-in-a-savage-act-of-revenge-2805797-2025-10-20",
      "headline": "Woman cuts off brother-in-law's private parts for ditching her sister after affairA shocking crime in Prayagraj's Mauaima area has left residents stunned after police uncovered that a 20-year-old youth's sister-in-law was behind a brutal attack that severed his private part."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/china-donald-trump-tariff-war-halts-soybean-imports-from-us-for-september-2805790-2025-10-20",
      "headline": "China hits back at Trump's tariffs, halts soybean imports from US for SeptemberImports last month from the US fell to zero from 1.7 million metric tons a year earlier. Shipments fell because of the high tariffs China has imposed on US imports and as previously harvested US supplies, known as old-crop beans, have already been traded. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/steve-jobs-his-daughter-lisa-and-the-apple-computer-named-after-her-2805432-2025-10-19",
      "headline": "Steve Jobs named a computer after his daughter, but denied she existedIn 1978, Steve Jobs denied that he was the father of his newborn daughter, Lisa, even as Apple secretly developed a $50 million computer with the same name. Decades later, Lisa Brennan-Jobs's memoir Small Fry revealed how her father's denial, cruelty, and late confession became Silicon Valley's most human story."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dilwale-dhulaniya-le-jayengey-turns-30-himani-shivpuri-talks-on-screen-chemistry-with-srk-2805788-2025-10-20",
      "headline": "DDLJ turns 30: Himani Shivpuri talks on-screen vibe with Shah Rukh KhanVeteran actor Himani Shivpuri is overjoyed as 'Dilwale Dhulaniya Le Jayengey' turned 30 today. On the iconic milestone, the actor spoke about working with Shah Rukh Khan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/day-after-jewel-heist-france-paris-louvre-museum-to-stay-shut-on-monday-2805795-2025-10-20",
      "headline": "Day after spectacular jewel heist, Paris's Louvre to remain shut todayEarlier, the museum's website stated that the Louvre would open late on Monday and that several rooms would be inaccessible."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/india-will-face-massive-tariffs-unless-it-halts-russian-oil-purchases-trump-warns-glbs-2805674-2025-10-20",
      "headline": "They'll keep paying: Trump ups tariff drumbeat over India's Russian oil purchaseUS President Donald Trump has once again warned India of \"massive tariffs\" if it continues buying oil from Russia, claiming Prime Minister Narendra Modi had assured him of halting such imports, a claim New Delhi has firmly denied."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/river-of-26-lakh-diyas-chorus-of-aarti-ayodhyas-diwali-celebration-makes-two-guinness-world-records-2805558-2025-10-19",
      "headline": "Ayodhya glows in divine splendour, over 26 lakh lamps light up Deepotsav 2025Ayodhya achieved two Guinness World Records: one for the record number of lamps and another for 2,128 priests and devotees performing Maa Saryu Aarti simultaneously, verified through drone counts and official certification."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/putin-will-destroy-you-trump-cursed-threw-map-zelenskyy-russia-deal-glbs-2805664-2025-10-20",
      "headline": "He will destroy you: Trump cursed, threw map urging Zelenskyy to accept Putin dealDonald Trump reportedly pressed Volodymyr Zelenskyy to accept Russia's terms to end the war, warning that Vladimir Putin would destroy Ukraine if it refused. In a tense White House meeting, Trump reportedly cursed, threw maps, and echoed Putin's proposals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jacob-elordi-euphoria-season-3-will-be-incredibly-clever-and-cinematic-2805794-2025-10-20",
      "headline": "Jacob Elordi: Euphoria season 3 will be incredibly clever and cinematicJacob Elordi teased exciting details about 'Euphoria Season 3', calling the experience \"incredibly liberating\" and praising creator Sam Levinson's \"clever and cinematic\" vision. The Emmy-winning series, returning after three years, will premiere in Spring 2026 on HBO with both returning and new cast members."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/indian-cricket-team-hatre-twitter-kitchen-troll-smriti-mandhana-harmanpreet-2805698-2025-10-20",
      "headline": "Is the criticism of Indian women's cricket team layered with misogyny?Women's ODI World Cup: The Indian women's cricket team suffered their third loss in a row in the Women's World Cup. A wave of criticism hit the team, which was majorly sexist in nature."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ddlj-30-years-beyond-shah-rukh-khan-raj-the-women-who-made-the-magic-last-kajol-farida-jalal-himani-shivpuri-mandira-bedi-pooja-ruparel-2805660-2025-10-20",
      "headline": "DDLJ at 30: Beyond Shah Rukh Khan's Raj, the women who made the magic lastThirty years since its release, 'DDLJ' continues to be Bollywood's eternal love story, but its women were the real architects of that timelessness. Simran, Lajjo, Chutki, Kammo and Preeti each held up a mirror to what freedom looks like in a patriarchal world. Beyond Raj's romance was their resilience, their laughter, and their silent strength. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-surges-over-650-points-nifty-above-25900-reliance-banking-stocks-rally-2805697-2025-10-20",
      "headline": "Diwali cheer on Dalal Street as Sensex jumps nearly 700 pointsAt around 9:23 am, the S&P BSE Sensex jumped 673.90 points to 84,626.09, while the NSE Nifty50 surged 202.50 points to 25,912.35. Broader market indices also witnessed sharp gains, and volatility dropped, indicating strong investor confidence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/cargo-plane-crash-hong-kong-airport-two-killed-runway-accident-glbs-2805670-2025-10-20",
      "headline": "Two killed after Turkish cargo plane skids off Hong Kong runway, plunges into seaA Turkish cargo plane skidded off the runway and plunged into the sea at Hong Kong International Airport early Monday killing two people."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/story/delhi-chokes-pollution-spikes-diwali-most-stations-record-very-poor-air-2805680-2025-10-20",
      "headline": "Delhi says Happy Diwali with toxic air, curbs imposed as areas slip into red zoneOn Sunday, the Commission for Air Quality Management invoked Stage II of the Graded Response Action Plan across Delhi-NCR as the national capital's air quality slipped into the \"very poor\" category, with the AQI crossing the 300 mark.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dilwale-dhulaniya-le-jayengey-turns-30-himani-shivpuri-talks-on-screen-chemistry-with-srk-2805788-2025-10-20",
      "headline": "DDLJ turns 30: Himani Shivpuri talks on-screen vibe with Shah Rukh KhanVeteran actor Himani Shivpuri is overjoyed as 'Dilwale Dhulaniya Le Jayengey' turned 30 today. On the iconic milestone, the actor spoke about working with Shah Rukh Khan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rajat-bedi-opens-up-about-missing-his-moment-with-hrithik-roshan-in-koi-mil-gaya-2805804-2025-10-20",
      "headline": "Rajat Bedi opens up about missing his moment with Hrithik Roshan in Koi Mil GayaRajat Bedi revisited a missed opportunity to shine opposite Hrithik Roshan in 'Koi Mil Gaya', calling it a formative moment in his career."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/graham-potter-appointed-sweden-head-coach-to-boost-2026-world-cup-qualification-hopes-2805801-2025-10-20",
      "headline": "Weeks after West Ham United sacking, Graham Potter appointed Sweden coach Weeks after being sacked by West Ham United, Graham Potter took charge of Sweden's national team on Monday, October 20. Potter will aim to revive Sweden's World Cup qualification hopes after a poor start in Group B."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-ind-rohit-sharma-tips-nitish-reddy-to-be-an-all-format-great-for-india-2805799-2025-10-20",
      "headline": "AUS vs IND: Rohit Sharma tips Nitish Reddy to be an all-format great for India Rohit Sharma presented Nitish Reddy his ODI debut cap and praised his commitment. The all-rounder is tipped to become a key player across all formats for India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/aus-vs-ind-mohammed-kaif-questions-kohli-rohit-preparation-australia-odi-2025-2805796-2025-10-20",
      "headline": "Virat Kohli, Rohit Sharma's lack of preparation for Australia questioned by Kaif Former cricketer Mohammed Kaif questioned both Virat Kohli and Rohit Sharma's preparation for the Australia tour, asking why both stars didn't arrive down under a few days earlier. Kohli and Rohit flopped in the first ODI against the Aussies in Perth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/simon-harmer-pakistan-vs-south-africa-imam-ul-haq-2805791-2025-10-20",
      "headline": "Watch: Simon Harmer's ridiculous delivery to dismiss Imam-ul-Haq in Rawalpindi South Africa spinner Simon Harmer bowled a gem of a delivery against Imam ul Haq in the Rawalpindi Test match. In the morning session of Day 1, Harmer was able to turn the ball square against the opener."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/mohamed-salah-under-scrutiny-liverpool-lose-2-1-to-manchester-united-2805785-2025-10-20",
      "headline": "Salah shouldn't be an automatic starter for Liverpool in away games: Carragher Jamie Carragher has cast doubt on Mohamed Salah's regular spot in Liverpool's starting eleven after a fourth consecutive loss, spotlighting the forward's declining influence and raising the prospect of reconstructing the side around recent acquisitions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/vinicius-nyom-red-card-controversy-real-madrid-getafe-2025-laliga-2805778-2025-10-20",
      "headline": "Real Madrid, Vinicius Jr. called out after Allan Nyom red card incident Real Madrid and Vinicius jr. were called out after the Allan Nyom red card incident during the clash with Getafe on Sunday, October 19. The dismissal of Nyom proved to be the difference in the clash. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/josh-hazlewood-perth-pitch-india-vs-australia-2805768-2025-10-20",
      "headline": "Josh Hazlewood wants Perth-styled pitch for 1st Ashes Test Fast bowler Josh Hazlewood wants the pitch used in India vs Australia's 1st ODI for the first Ashes Test. Hazlewood was the star of the show as the hosts ripped apart Shubman Gill's side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammad-kaif-slams-shubman-gill-for-kuldeep-yadav-snub-with-shane-warnes-example-2805744-2025-10-20",
      "headline": "Mohammad Kaif slams Shubman Gill for Kuldeep snub with Shane Warne's example Former India cricketer Mohammad Kaif slammed Shubman Gill for dropping Kuldeep Yadav for the first ODI against Australia in Perth. India went in with three all-rounders for the fixture but still ended up on the losing side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/vinicius-nyom-red-card-controversy-real-madrid-getafe-2025-laliga-2805778-2025-10-20",
      "headline": "Real Madrid, Vinicius Jr. called out after Allan Nyom red card incident Real Madrid and Vinicius jr. were called out after the Allan Nyom red card incident during the clash with Getafe on Sunday, October 19. The dismissal of Nyom proved to be the difference in the clash. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/josh-hazlewood-perth-pitch-india-vs-australia-2805768-2025-10-20",
      "headline": "Josh Hazlewood wants Perth-styled pitch for 1st Ashes Test Fast bowler Josh Hazlewood wants the pitch used in India vs Australia's 1st ODI for the first Ashes Test. Hazlewood was the star of the show as the hosts ripped apart Shubman Gill's side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammad-kaif-slams-shubman-gill-for-kuldeep-yadav-snub-with-shane-warnes-example-2805744-2025-10-20",
      "headline": "Mohammad Kaif slams Shubman Gill for Kuldeep snub with Shane Warne's example Former India cricketer Mohammad Kaif slammed Shubman Gill for dropping Kuldeep Yadav for the first ODI against Australia in Perth. India went in with three all-rounders for the fixture but still ended up on the losing side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-england-women-press-conference-video-2805752-2025-10-20",
      "headline": "Heather Knight explains how England outfoxed India against the odds in IndoreWomen's World Cup: England's Heather Knight believes that India were under immense pressure to win the World Cup fixture in Indore. Knight said that England's plan was to take the game deep and put pressure on India by picking wickets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/womens-world-cup-2025-ind-vs-eng-smriti-mandhana-full-post-match-press-conference-2805736-2025-10-20",
      "headline": "My innings doesn't mean anything because we lost the match: Smriti MandhanaIndia vice captain Smriti Mandhana took the blame for the team's loss in their fifth fixture of the Women's World Cup 2025 in Indore. Mandhana played a brilliant knock of 88 (94). Despite her efforts, India ended up losing the match by four runs as they failed to chase the target of 289."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-explains-jemimah-rodrigues-drop-womens-world-cup-2025-2805730-2025-10-20",
      "headline": "Why India dropped Jemimah Rodrigues against England? Smriti Mandhana explainsSmriti Mandhana revealed the reasoning behind dropping Jemimah Rodrigues for India's fixture against England. The decision followed back-to-back defeats and has sparked debate among fans and experts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-women-match-social-media-troll-2805724-2025-10-20",
      "headline": "Aakash Chopra slams trolls for abusing Indian women's team after loss vs EnglandFormer cricketer Aakash Chopra came in the defence of the Indian women's team after they were trolled on social media. A wave of criticism came in the team's way after their loss against England in the Women's ODI World Cup."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/indian-cricket-team-hatre-twitter-kitchen-troll-smriti-mandhana-harmanpreet-2805698-2025-10-20",
      "headline": "Is the criticism of Indian women's cricket team layered with misogyny?Women's ODI World Cup: The Indian women's cricket team suffered their third loss in a row in the Women's World Cup. A wave of criticism hit the team, which was majorly sexist in nature."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-ind-1st-odi-virat-kohli-rohit-sharma-fail-indias-future-plans-gambhir-2805699-2025-10-20",
      "headline": "Not on trial, but on a tightrope: Should India worry about rusty Rohit and Virat?Rohit Sharma and Virat Kohli face a rare test: proving they belong while adapting to changing conditions and limited opportunities. One poor outing won't define them. If they trust their instincts, stay match-ready, and let experience guide them, India's legends could still shine en route to 2027."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-smriti-mandhana-fights-back-tears-after-india-collapse-in-easy-chase-against-england-2805690-2025-10-20",
      "headline": "Mandhana fights back tears after India collapse in easy chase against EnglandIndia vice-captain Smriti Mandhana was seen fighting back her tears, following their third consecutive loss of the Women's World Cup 2025 against England. India failed to chase down 289, despite being in a dominating position till the 40th over of the second innings."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/indian-cricket-team-hatre-twitter-kitchen-troll-smriti-mandhana-harmanpreet-2805698-2025-10-20",
      "headline": "Is the criticism of Indian women's cricket team layered with misogyny?Women's ODI World Cup: The Indian women's cricket team suffered their third loss in a row in the Women's World Cup. A wave of criticism hit the team, which was majorly sexist in nature."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-ind-1st-odi-virat-kohli-rohit-sharma-fail-indias-future-plans-gambhir-2805699-2025-10-20",
      "headline": "Not on trial, but on a tightrope: Should India worry about rusty Rohit and Virat?Rohit Sharma and Virat Kohli face a rare test: proving they belong while adapting to changing conditions and limited opportunities. One poor outing won't define them. If they trust their instincts, stay match-ready, and let experience guide them, India's legends could still shine en route to 2027."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-smriti-mandhana-fights-back-tears-after-india-collapse-in-easy-chase-against-england-2805690-2025-10-20",
      "headline": "Mandhana fights back tears after India collapse in easy chase against EnglandIndia vice-captain Smriti Mandhana was seen fighting back her tears, following their third consecutive loss of the Women's World Cup 2025 against England. India failed to chase down 289, despite being in a dominating position till the 40th over of the second innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kuldeep-yadav-dropped-india-odi-australia-ashwin-questions-selection-2805685-2025-10-20",
      "headline": "Ashwin slams selection: Where will Kuldeep play, how many all-rounders needed?Former spinner Ravichandran Ashwin criticised India for dropping Kuldeep Yadav in the first ODI against Australia. He highlighted the importance of playing the best bowlers rather than prioritising batting depth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravichandran-ashwin-fake-adam-zampa-scam-hilarious-chat-jasprit-bumrah-number-2805658-2025-10-20",
      "headline": "Fake Adam Zampa exposed: R Ashwin leaves fans in laughs after chat with scammerFormer India spinner Ravichandran Ashwin left fans in splits after trolling a scammer pretending to be Australian spinner Adam Zampa, who attempted to get the numbers of India stars like Jasprit Bumrah and Abhishek Sharma."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-ind-kuldeep-yadav-indias-wicket-taking-answer-for-adelaide-odi-2805675-2025-10-20",
      "headline": "AUS vs IND: Kuldeep Yadav, India's obvious wicket-taking answer for Adelaide ODIAUS vs IND: After India's 1st ODI loss in Perth exposed a lack of wicket-taking options, the focus turns to Kuldeep Yadav. With 31 wickets against Australia in 23 matches, his inclusion in the 2nd ODI could provide the attacking edge India desperately needs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-womens-world-cup-india-vs-england-press-conference-2805661-2025-10-20",
      "headline": "Smriti Mandhana takes blame for India's defeat to England: I should have been smarterWomen's World Cup: Smriti Mandhana said that she should have been smarter with her shot selection after India lost to England by four wickets. Mandhana scored 88, but India failed to chase down 289. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/bangladesh-confident-vs-sri-lanka-womens-world-cup-fahima-khatun-press-conference-2805659-2025-10-20",
      "headline": "Bangladesh confident of beating Sri Lanka, did so in practice-match: Fahima KhatunWomen's World Cup 2025: Fahima Khatun believes Bangladesh batters can take confidence from their thrilling one-run win over Sri Lanka in the World Cup practice match. She says the victory sets the tone for their must-win clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-womens-world-cup-england-qualification-scenario-semifinal-2805657-2025-10-19",
      "headline": "Women's World Cup: How India can qualify for semis. ExplainedWomen's World Cup, IND vs ENG: India lost to England by four runs on Sunday at the Holkar Stadium in Indore, but are still in with a decent chance of qualifying for the semi-final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indw-vs-engw-womens-world-cup-india-batting-collapse-smriti-mandhana-deepti-sharma-2805650-2025-10-19",
      "headline": "India's Indore collapse: Mandhana, Deepti under fire for poor judgement calls vs ENGIndia came agonisingly close to a record chase but lost by four runs to England. Crucial batting errors under pressure proved costly in the Women's World Cup match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-wicket-turning-point-india-loss-england-womens-world-cup-harmanpreet-kaur-2805645-2025-10-19",
      "headline": "Smriti Mandhana's wicket was the turning point vs England: Harmanpreet KaurWomen's World Cup, IND vs ENG: Harmanpreet Kaur said that losing Smriti Mandhana's wicket was a key moment in their clash against England where the Women in Blue lost by four runs at the Holkar Stadium in Indore. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}