{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-adds-1458-lakh-members-in-march-women-and-youth-lead-the-way-2728646-2025-05-22",
      "headline": "EPFO adds 14.58 lakh members in March. Women and youth lead the wayMost of the new members who joined EPFO for the first time in March were youngsters. Around 4.45 lakh people in the 18–25 age group signed up in March, making up nearly 59% of all new subscribers. Many in this age group are first-time jobseekers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/tata-teleservices-shares-jumps-11-percent-today-whats-driving-the-rally-2728642-2025-05-22",
      "headline": "Tata Teleservices shares jumps 11% today. What's driving the rally?The trigger behind the rally appears to be growing speculation around a potential capital infusion by Tata Sons Ltd into its struggling telecom subsidiary, Tata Teleservices Ltd (TTSL). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/abfrl-demerger-brokerages-assign-fair-value-to-new-fashion-twins-details-here-2728621-2025-05-22",
      "headline": "ABFRL demerger: Brokerages assign fair value to new fashion twins. Details hereBrokerages have begun breaking down the newly split entities, laying out distinct growth paths and fair value estimates for both ABFRL and ABLBL. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/all-itr-forms-are-out-but-you-still-cannot-file-what-causing-the-delay-e-filing-utilities-portal-2728606-2025-05-22",
      "headline": "All ITR forms are out, but you still can't file. What's causing the delay?While all seven ITR forms (ITR-1 to ITR-7) and even the updated ITR-U form are ready, the filing process can't begin until the government activates the utility software. These utilities are essential tools that help taxpayers fill in, check, and submit their returns online or offline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/aditya-birla-fashion-and-retail-ltd-abfrl-business-demerger-stock-drop-66-percent-2728594-2025-05-22",
      "headline": "ABFRL stock drops 66% post demerger. What investors should know The sharp decline from Wednesday's close of Rs 268.95 reflects the market's adjustment for the value of the demerged entity, not a deterioration in Aditya Birla Fashion and Retail Ltd's fundamentals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vaibhav-taneja-salary-tesla-cfo-more-pay-than-sunder-pichai-google-satya-nadella-microsoft-2728585-2025-05-22",
      "headline": "Who is Vaibhav Taneja? Tesla CFO who made more than Pichai and NadellaWhile Sundar Pichai took home $10.73 million and Satya Nadella received $79.1 million in 2024, Taneja's total earnings far exceeded both. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/itc-q4-results-today-check-dividend-revenue-profit-expectations-2728571-2025-05-22",
      "headline": "ITC set to report Q4 results today: Earnings, dividend payout in focusSo far this financial year, the diversified FMCG and cigarette giant has already handed out an interim dividend of Rs 6.50 per share. Given its track record, investors are now eyeing another generous payout."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-fresh-record-high-us-dollar-stability-risks-other-key-reasons-explained-2728564-2025-05-22",
      "headline": "Explained: Why bitcoin has hit a fresh all-time high The world's most valuable cryptocurrency has gained over 50% since April, propelled by improving global risk appetite and a flight to alternatives as doubts over the US dollar's stability grow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/government-notice-to-uber-over-advance-tipping-union-minister-calls-it-unethical-2728524-2025-05-22",
      "headline": "Government notice to Uber over advance tipping, Union Minister calls it 'unethical'The Consumer Protection Body has issued a notice to Uber regarding its practice of collecting advanced tips from users. Union Minister Prahlad Joshi has termed the practice 'deeply concerning', 'unethical and exploitative'. Uber has been given 15 days to respond to the notice. The government is widening its crackdown on practices violating consumer protection norms, with Rapido potentially facing a probe as well."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/foxconn-300-acre-plant-devanahalli-building-dorms-women-workers-iphone-production-india-report-2728554-2025-05-22",
      "headline": "Foxconn building dorms at 300-acre iPhone campus in India: ReportThe dorms are part of the company's plan to support numerous workers at its plant, which is expected to play a major role in Apple's growing operations in India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-crash-sensex-nifty-tumbles-weak-global-cues-us-bonds-2728552-2025-05-22",
      "headline": "Sensex plunges 800 points: Why is stock market falling today?At around 9:34 am, the BSE Sensex was down 850.70 points at 80,745.93, while the NSE Nifty50 slumped 262.15 points to 24,551.30. Market volatility spiked, dragging down broader indices and putting pressure on small- and mid-cap stocks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/indusind-bank-share-price-falls-stock-in-focus-fradu-q4-loss-2728548-2025-05-22",
      "headline": "IndusInd Bank shares in focus after Q4 loss amid fraud. Buy, hold or sell?The private lender reported a net loss of Rs 2,236 crore for the fourth quarter, a sharp reversal from a profit of Rs 2,347 crore in the same period last year. This marks a pivotal moment for the bank, which has now admitted that certain employees may have engaged in fraudulent activity that impacted its financial reporting."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aishwarya-rai-cannes-look-wows-fans-calls-her-an-og-queen-2728636-2025-05-22",
      "headline": "OG Queen: Internet raves about Aishwarya Rai's Sindoor and saree look at CannesAishwarya Rai stole the spotlight at the 78th Cannes Film Festival in a stunning Manish Malhotra traditional saree. The festival also saw a strong Indian presence with notable names like Payal Kapadia, Sharmila Tagore, and Neeraj Ghaywan making their mark.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tom-cruise-can-film-in-space-the-only-oxygen-he-needs-is-adrenaline-mission-impossible-2728618-2025-05-22",
      "headline": "Tom Cruise can now film in space: The only oxygen he needs is adrenalineAt 62, Tom Cruise is still Hollywood's biggest daredevil. From wild stunts to rewriting what's possible on screen, his obsession with pushing limits hasn't slowed down. The only frontier left for him to conquer is space. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/exclusive-suniel-shetty-on-stars-silence-on-operation-sindoor-admiring-shashi-tharoor-2728622-2025-05-22",
      "headline": "Exclusive: Suniel Shetty on stars' silence on Op Sindoor, 'admiring' Shashi TharoorActor Suniel Shetty, in an interview with IndiaToday.in, talked about his admiration for Congress MP Shashi Tharoor. He also answered why a few actors have chosen not to comment on Operation Sindoor. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kim-kardashian-graduates-from-law-school-without-attending-college-2728589-2025-05-22",
      "headline": "Kim Kardashian completes law studies without attending collegeKim Kardashian shared her graduation ceremony pictures on her Instagram story, sharing that she has completed law school after six years. She chose to join California's Law Office Study Program instead of attending traditional law school."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/mission-impossible-8-box-office-day-5-tom-cruises-film-eyes-rs-50-crore-in-india-2728617-2025-05-22",
      "headline": "Mission Impossible 8 box office Day 5: Tom Cruise's film eyes Rs 50 crore in IndiaTom Cruise's Mission: Impossible – The Final Reckoning is cruising steadily at the domestic box office. The high-octane action thriller is expected to cross the Rs 50-crore mark by Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/katy-perrys-witty-reply-to-fan-mid-concert-for-texting-her-partner-orlando-boom-2728605-2025-05-22",
      "headline": "Katy Perry's witty reply to fan mid-concert for 'texting' her partner Orlando BoomSinger Katy Perry halted her concert mid-way and called out a fan for allegedly sending messages to her partner, Orlando Bloom. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shoaib-ibrahim-shares-update-of-his-wife-dipika-kakars-health-2728565-2025-05-22",
      "headline": "TV actor Dipika Kakar hospitalised due to fever amid tumour surgery delayTV actor Dipika Kakar's husband, Shoaib Ibrahim, shared an update on his wife Dipika Kakar's health, who was about to undergo tumour resection surgery. He said that she developed an infection as she tried to wean her son, Ruhaan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/adito-rao-hydari-sindoor-red-saree-look-at-cannes-melts-husband-siddharth-2728570-2025-05-22",
      "headline": "Adito Rao Hydari's sindoor-red saree look at Cannes 'melts' husband SiddharthAs Aditi Rao Hydari dazzled at the Cannes Film Festival as a newlywed in a stunning red saree and 'sindoor', her husband, actor Siddharth, couldn't stop gushing over her.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/miley-cyrus-recalls-traumatic-health-scare-that-nearly-made-her-quit-music-2728555-2025-05-22",
      "headline": "Miley Cyrus recalls 'traumatic' health scare that nearly made her quit musicSinger and actor Miley Cyrus opened up about a painful ovarian cyst rupture in 2023 that nearly made her quit music. Describing the experience as traumatic and excruciating, she shared how difficult it was for her to cope.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karan-johar-says-ishaan-khatter-is-national-crush-after-netflix-the-royals-homebound-2728540-2025-05-22",
      "headline": "Karan Johar says Ishaan Khatter is 'national crush' after The RoyalsKaran Johar and Ishaan Khatter, along with the 'Homebound' team, are at Cannes for the film's screening. Amid all the appreciation that the film received, KJo praised Ishaan and his acting skills. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karan-johar-recalls-meeting-leonardo-dicaprio-martin-scorcese-2728541-2025-05-22",
      "headline": "KJo recalls meeting Leonardo DiCaprio, Martin Scorcese: My knees started rattlingAt the Cannes Film Festival, filmmaker Karan Johar recalled a past encounter with Leonardo DiCaprio and Martin Scorsese. He credited Bollywood superstar Shah Rukh Khan as his lucky charm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/elle-fanning-sentimental-value-wows-cannes-with-15-minute-standing-ovation-2728518-2025-05-22",
      "headline": "Elle Fanning's Sentimental Value wows Cannes with 15-minute standing ovation'Sentimental Value', starring Elle Fanning and Stellan Skarsgard, received the longest-standing ovation at the 78th Cannes Film Festival, earning a rousing 15-minute applause following its premiere on May 21."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/dhanush-apj-abdul-kalam-biopic-directed-by-om-raut-film-launched-at-cannes-film-festival-2728516-2025-05-22",
      "headline": "Dhanush is APJ Abdul Kalam in Om Raut-directed biopic, film launched at CannesActor Dhanush will play 'Missile Man of India' and former President of India, Dr APJ Abdul Kalam, in his biography, directed by Om Raut. The film was launched at the 78th Cannes Film Festival."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/salman-khan-to-return-with-bigg-boss-19-in-july-2728513-2025-05-22",
      "headline": "Salman Khan to return with Bigg Boss 19 in July: ReportSalman Khan-hosted 'Bigg Boss 19' is reportedly set to return in July. As per reports, the actor will shoot for the promo at the end of June. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhadkan-and-its-silent-misogyny-why-anjali-lived-a-flawed-fairytale-of-endurance-2728233-2025-05-22",
      "headline": "Dhadkan and its silent misogyny: Why Anjali lived a flawed fairytale of endurance'Dhadkan' is often seen as a classic love triangle, but below the surface, it tells a troubling story of a woman forced to make a choice from options available to her by patriarchy. The film glorifies sacrifice and sends a dangerous message about what it means to be a 'good woman' in love."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/rana-daggubati-venkatesh-rana-naidu-2-release-date-announced-2728359-2025-05-21",
      "headline": "Rana Naidu Season 2: Rana Daggubati's gritty actioner set for June releaseThe release date of Rana Daggubati and Venkatesh's 'Rana Naidu Season 2' has been announced. The makers shared the announcement with a fresh new promo on May 21. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/kapil-sharmas-shows-team-mourns-photographer-krishna-dass-death-he-was-family-2728340-2025-05-21",
      "headline": "Kapil Sharma's show's team mourns photographer Krishna Das's death: He was familyComedian Kiku Sharda and the team of Kapil Sharma's show expressed grief after the death of photographer Krishna Das. The team released an emotional statement. Dada, who was seen interacting with celebrities in The Kapil Sharma Show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/zootopia-2-trailer-nick-and-judy-reunite-for-a-new-case-disney-unveils-fresh-faces-2728337-2025-05-21",
      "headline": "Zootopia 2 trailer: Nick and Judy reunite for a new case, Disney unveils fresh facesDisney has dropped the first 'Zootopia 2' trailer, reuniting the iconic duo with a fresh squad. Stealing the spotlight is Gary De'Snake, a hilarious new pit viper character.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/homebound-team-gets-emotional-as-it-receives-9-minute-standing-ovation-at-cannes-film-festival-2025-2728318-2025-05-21",
      "headline": "Homebound team gets emotional as it receives 9-minute standing ovation at CannesNeeraj Ghaywan's 'Homebound' received a heartwarming 9-minute standing ovation at the Cannes Film Festival 2025, leaving the cast and crew emotional. The only Indian feature at Cannes this year, the film has been praised for its powerful storytelling and performances."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-mounts-attack-on-pakistan-at-bikaner-rally-sindoor-turned-barood-destroyed-terror-camps-2728653-2025-05-22",
      "headline": "Sindoor turned barood: PM Modi mounts attack on Pakistan at Bikaner rallyPM Modi emphasised that after the Pahalgam attack the country had vowed to retaliate in an unforgettable manner."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pak-leadership-especially-the-army-chief-is-driven-by-extreme-religious-outlook-jaishankar-to-dutch-channel-2728568-2025-05-22",
      "headline": "Jaishankar links Pak Army chief's 'extreme religious outlook' to Pahalgam attackS Jaishankar, speaking to Dutch broadcaster NOS, said the attack in Pahalgam was a 'barbaric' act aimed at crippling tourism in Kashmir and inciting religious discord."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-pauses-probe-agencys-action-into-rs-1000-crore-tasmac-liquor-scam-ed-is-crossing-all-limits-2728626-2025-05-22",
      "headline": "ED crossing all limits: Supreme Court pauses action into Tasmac liquor scamThe Supreme Court temporarily stayed the Enforcement Directorate's probe into Tamil Nadu's liquor body Tasmac. The order, where it criticised the agency for violating the federal structure, comes following Tamil Nadu's petition to ED's raids."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-seven-teams-outreach-mps-diplomats-indus-waters-treaty-counter-demolish-pakistan-narrative-2728562-2025-05-22",
      "headline": "How India built missile shield to intercept UNSC-member Pakistan's liesSeven teams are headed to seven corners of the world to brief countries on India's Operation Sindoor and justify the shelving of the Indus Waters Treaty. This is why these 32 countries, including Sierra Leone and Panama, were picked for India's diplomatic offensive against Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/the-lowdown/story/golden-temple-amritsar-targeted-invaders-afghans-mughals-mehtab-singh-2728551-2025-05-22",
      "headline": "How the Golden Temple defied invaders from the northThe Golden Temple hit the headlines after an Army official hinted that air defence guns were deployed in its premises to neutralise aerial threats from Pakistan. However, the Army has denied any such move. In this edition of The Lowdown, we turn back the pages to recall how the Harmandar Sahib, a citadel of faith, has been targeted by invaders who desecrated and destroyed it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-bikaner-visit-live-updates-nal-airbase-103-stations-amrit-bharat-station-scheme-operation-sindoor-2728579-2025-05-22",
      "headline": "Live: Pak's Rahim Khan airbase lying in ICU, PM Modi thunders in BikanerPrime Minister Narendra Modi on Thursday launched a scathing attack on Pakistan, while addressing a rally in Bikaner. He warned Pakistan that India's reply would be even stronger if there were any terror attacks from across the border.\r\n\r\nEarlier in the day, PM reached Bikaner and visited the iconic Karni Mata temple. Following his temple visit, he inaugurated the redeveloped Deshnoke Station under the Amrit Bharat Station Scheme -- an initiative aimed at redeveloping over 1,300 railway stations across India.\r\n\r\nHe is set to visit Nal Air Force Station in Bikaner, where he is set to interact with the Armed Forces and boost their morale. His visit comes in the aftermath of India's Operation Sindoor, during which the Nal Air Force Station was targeted by Pakistan, but all attacks were successfully thwarted by India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/terrorists-trapped-in-jammu-and-kashmir-kishtwar-after-gunfight-breaks-out-with-security-forces-encounter-2728502-2025-05-22",
      "headline": "2 terrorists killed in J&K in ongoing operation, 8 neutralised in two weeksThe encounter broke out at around 7 am after the troops of two Para SF, Army's 11RR, 7th Assam rifles and SOG Kishtwar launched a search operation in Singhpora Chatroo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/dk-shivakumar-siddaramaiah-g-parameshwara-ranya-rao-gold-case-ed-smuggling-case-2728609-2025-05-22",
      "headline": "Wedding gift to Ranya Rao: DK Shivakumar confirms financial link to G ParmeshwaraKarnataka Deputy Chief Minister DK Shivakumar has followed in Chief Minister Siddaramaiah's steps and come out in support of Home Minister G Parameshwara. The support comes amidst the second day of ED raids on institutions linked to Parameshwara."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tom-cruise-can-film-in-space-the-only-oxygen-he-needs-is-adrenaline-mission-impossible-2728618-2025-05-22",
      "headline": "Tom Cruise can now film in space: The only oxygen he needs is adrenalineAt 62, Tom Cruise is still Hollywood's biggest daredevil. From wild stunts to rewriting what's possible on screen, his obsession with pushing limits hasn't slowed down. The only frontier left for him to conquer is space. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/an-architectural-trail-in-gujarat-2723608-2025-05-15",
      "headline": "An Architectural Trail in GujaratPress Release | Vadnagar has substantial remains of its ancient Buddhist heritage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/why-trumps-new-bill-to-tax-remittances-has-got-indian-professionals-in-us-worried-h-1b-nris-2727758-2025-05-22",
      "headline": "Why Trump's new tax will have Indian professionals in US worriedThe US has proposed a 5% tax on remittances sent to foreign countries by non-citizens. This will be a cause of concern for many Indian professionals working in the US on H-1B and H-2A visas, and even green card holders. But MAGA is asking for higher remittance taxes to make foreign professionals self-deport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/two-israeli-embassy-officials-shot-dead-near-jewish-museum-in-washington-dc-2728531-2025-05-22",
      "headline": "2 Israeli Embassy staffers killed in Washington, suspect shouted 'Free Palestine'The US Homeland Security Secretary announced the death of staffers in a post on X, which took place near the FBI's field office."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/us-luxury-brand-nordstrom-sells-humble-jhola-indian-souvenir-bag-rs-4228-2728639-2025-05-22",
      "headline": "US brand sells humble jhola as 'Indian Souvenir Bag' for Rs 4,228. No, seriouslyThe jhola has been renamed by the Japanese brand Puebco as the \"Indian Souvenir Bag\", as seen on Nordstrom's website. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/punjab-and-haryana-high-court-receives-bomb-threat-via-email-premises-being-evacuated-2728638-2025-05-22",
      "headline": "Punjab and Haryana High Court receives bomb threat, probe launchedThe premises of Punjab and Haryana High Court in Chandigarh was evacuated following a bomb threat mail. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/kerala/story/kerala-reports-182-covid-cases-in-state-veena-george-discusses-omicron-variants-2728576-2025-05-22",
      "headline": "Kerala reports 182 Covid-19 cases, Health Minister urges cautionKerala reported 182 Covid-19 cases in May, prompting the state to step up precautions as similar surges are seen in South East Asia. Health Minister Veena George urged public vigilance, especially in districts like Kottayam, Ernakulam and Thiruvananthapuram.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/nepali-spy-sleeper-cells-pak-isis-big-terror-plot-before-pahalgam-attack-2728507-2025-05-22",
      "headline": "Nepali spy, sleeper cells: Pak ISI's big terror plot before Pahalgam attackDuring the arrest, investigators recovered classified documents and incriminating digital evidence from Nepali-origin ISI agent, Ansarul Mian Ansari. A forensic analysis confirmed these to be confidential military files. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/big-explosion-rocks-spacexs-mcgregor-base-during-engine-test-2728645-2025-05-22",
      "headline": "Big explosion rocks SpaceX's Mcgregor base during engine testThe incident, which occurred during a routine static fire test, resulted in a dramatic fireball and a rapid response from emergency crews, who quickly extinguished the blaze."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/video/watch-roof-blows-away-along-with-children-during-thunderstorm-in-mps-sagar-2728629-2025-05-22",
      "headline": "Watch: Roof blows away along with children during thunderstorm in MP's SagarIn a shocking incident in Banda, Sagar district, Madhya Pradesh, heavy rainfall caused a roof to be blown away, along with children who were caught in the storm. The intense winds and rain left the local area devastated."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/cbse-sugar-board-move-sparks-national-debate-on-kids-health-and-food-habits-2728141-2025-05-22",
      "headline": "As childhood diabetes rises, CBSE triggers food rethink in schools: Expert takesType 2 diabetes is rapidly emerging as a serious health threat amongst Indian schoolchildren, driven by lifestyle and dietary changes. This growing crisis demands urgent attention from schools, parents, and policymakers alike.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistan-high-commission-delhi-official-danish-isi-agent-youtuber-jyoti-malhotra-2728584-2025-05-22",
      "headline": "High Commission official who trapped YouTuber a Pakistani spy: SourcesDanish, alias Ehsan-ur-Rehman, who was posted to the Pakistan High Commission in Delhi, was expelled by India earlier this month amid tensions with Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/exclusive-suniel-shetty-on-stars-silence-on-operation-sindoor-admiring-shashi-tharoor-2728622-2025-05-22",
      "headline": "Exclusive: Suniel Shetty on stars' silence on Op Sindoor, 'admiring' Shashi TharoorActor Suniel Shetty, in an interview with IndiaToday.in, talked about his admiration for Congress MP Shashi Tharoor. He also answered why a few actors have chosen not to comment on Operation Sindoor. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bsf-explains-execution-strikes-pak-posts-surveillance-systems-akhnoor-2728487-2025-05-22",
      "headline": "Razed bunkers, struck surveillance system: How BSF inflicted heavy losses on PakThe Border Security Forces worked extensively to successfully destroy Pakistani posts and their Chinese-made surveillance system."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/video-us-minuteman-iii-nuclear-capable-intercontinental-ballistic-missile-that-can-strike-anywhere-2728557-2025-05-22",
      "headline": "Video: US tests Minuteman III nuclear-capable missile that can strike anywhereIn a show of force, the US launched an unarmed Minuteman III intercontinental ballistic missile (ICBM) -- capable of carrying nuclear warheads and targeting locations anywhere in the world -- from the Vandenberg Space Force Base in California, as part of the country's regular doomsday missile tests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/talking-points/story/an-ai-iphone-sam-altman-and-jony-ive-have-joined-hands-will-they-build-something-that-apple-so-far-hasnt-2728647-2025-05-22",
      "headline": "An AI iPhone? Sam Altman and Jony Ive have joined hands, will they build something that Apple so far hasn'tWith former Apple design guru Jony Ive's backing and support, things are about to get very interesting at OpenAI. What they come up with might not be an iPhone 2.0 but if done right, it could be the modern-day iPhone moment that fans and pundits have been waiting for."
    }
  ],
  "sports": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-mi-vs-dc-not-find-settled-opening-pair-hemang-badani-playoffs-2728651-2025-05-22",
      "headline": "DC could not find a settled opening pair: Head coach Badani after MI lossDelhi Capitals coach Hemang Badani blamed their IPL 2025 exit on not finding a settled opening pair. Despite a bright start, instability in the batting order ultimately derailed their push for a playoffs spot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-dc-mukesh-kumar-fined-code-of-conduct-breach-wankhede-2728623-2025-05-22",
      "headline": "After horror show against MI, DC's Mukesh Kumar fined for code of conduct breachDC pacer Mukesh Kumar was fined for a code of conduct breach after his poor performance in the loss to MI on Wednesday, May 21. Mukesh's final over proved to be the turning point in the game as Delhi got knocked out of the play-off race. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-lsg-preview-predicted-xi-weather-forecast-pitch-conditions-2728588-2025-05-22",
      "headline": "GT vs LSG Preview: Will confident Gujarat pounce on Lucknow's miseries?GT vs LSG, IPL 2025 Preview: Gujarat Titans aim to seal a top-two finish in IPL 2025 as they face eliminated Lucknow Super Giants in Ahmedabad, with form, depth, and Shubman Gill's captaincy driving their late-season charge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-dc-mitchell-santner-spell-varun-aaron-tom-moody-2728580-2025-05-22",
      "headline": "Mitchell Santner showing his IPL worth in MI colours: Varun Aaron after DC winVarun Aaron feels that Mitchell Santner is finally proving his worth in the IPL after his spell helped MI beat DC. Santner ended with figures of 3 for 11 as MI qualified for the play-offs with a thumping win over Delhi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-united-europa-league-final-ruben-amorim-2728474-2025-05-22",
      "headline": "Manchester United collapse: A nightmare season ends without glory or europeManchester United's Europa League final loss captured the very essence of their horror 2024-25 season. A campaign filled with missteps, a misfiring forward line and a lack of mentality has seen the Red Devils set for their worst finish in the Premier League and miss out on making it to Europe for the next season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-dc-hardik-pandya-never-gives-up-turnaround-ajay-jadeja-2728536-2025-05-22",
      "headline": "Hardik Pandya never gives up, good to see his turnaround in IPL 2025: Ajay JadejaIPL 2025: Hardik Pandya soaked in the applause from the Mumbai crowd when he led the lap of honour at the Wankhede Stadium after Mumbai Indians beat Delhi Capitals on Wednesday to secure their spot in the playoffs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/europa-league-final-manchester-united-ruben-amorim-vows-to-quit-without-payoff-2728525-2025-05-22",
      "headline": "Amorim to quit United without payoff if board loses trust after Europa lossRuben Amorim vowed to leave Manchester United without compensation if the board loses faith, following their Europa League final defeat and a disappointing season that has put his future at the club in serious doubt."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-dc-overseas-playerfs-missing-yorkers-axar-patrel-absence-hemang-badani-2728512-2025-05-22",
      "headline": "IPL 2025: DC head coach rues missed yorkers, Axar Patel absence in MI lossHemang Badani lamented Delhi's failure to execute yorkers and the absence of Axar Patel after their 59-run loss to Mumbai Indians ended their IPL 2025 playoff hopes and exposed gaps in their bowling depth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/europa-league-final-tottenham-hotspurs-son-i-am-a-legend-2728497-2025-05-22",
      "headline": "Tottenham Hotspurs captain Son Heung-min accepts legend tag after Europa winSon Heung-min finally called himself a Spurs legend after captaining Tottenham to their first European trophy — a historic Europa League win over Manchester United that ended a 17-year wait and booked a Champions League return."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-dc-naman-dhir-designated-finisher-keiron-pollard-2728485-2025-05-22",
      "headline": "How Pollard is turning Naman Dhir into Mumbai Indians' designated finisherIPL 2025, MI vs DC: Mumbai Indians batter Naman Dhir credited his rising success as a finisher to the consistent guidance of his side's batting coach, Kieron Pollard, along with his captain Hardik Pandya."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-how-can-mumbai-indians-finish-in-top-two-2728447-2025-05-22",
      "headline": "How Mumbai Indians can finish in top two after sealing their berth in playoffsHaving sealed their berth in the playoffs with a thumping win over Delhi Capitals (DC), Mumbai Indians (MI) can also finish in top two to have two chances to make it to the final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/europa-league-final-manchester-united-ruben-amorim-vows-to-quit-without-payoff-2728525-2025-05-22",
      "headline": "Amorim to quit United without payoff if board loses trust after Europa lossRuben Amorim vowed to leave Manchester United without compensation if the board loses faith, following their Europa League final defeat and a disappointing season that has put his future at the club in serious doubt."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-dc-overseas-playerfs-missing-yorkers-axar-patrel-absence-hemang-badani-2728512-2025-05-22",
      "headline": "IPL 2025: DC head coach rues missed yorkers, Axar Patel absence in MI lossHemang Badani lamented Delhi's failure to execute yorkers and the absence of Axar Patel after their 59-run loss to Mumbai Indians ended their IPL 2025 playoff hopes and exposed gaps in their bowling depth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/europa-league-final-tottenham-hotspurs-son-i-am-a-legend-2728497-2025-05-22",
      "headline": "Tottenham Hotspurs captain Son Heung-min accepts legend tag after Europa winSon Heung-min finally called himself a Spurs legend after captaining Tottenham to their first European trophy — a historic Europa League win over Manchester United that ended a 17-year wait and booked a Champions League return."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-dc-naman-dhir-designated-finisher-keiron-pollard-2728485-2025-05-22",
      "headline": "How Pollard is turning Naman Dhir into Mumbai Indians' designated finisherIPL 2025, MI vs DC: Mumbai Indians batter Naman Dhir credited his rising success as a finisher to the consistent guidance of his side's batting coach, Kieron Pollard, along with his captain Hardik Pandya."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-how-can-mumbai-indians-finish-in-top-two-2728447-2025-05-22",
      "headline": "How Mumbai Indians can finish in top two after sealing their berth in playoffsHaving sealed their berth in the playoffs with a thumping win over Delhi Capitals (DC), Mumbai Indians (MI) can also finish in top two to have two chances to make it to the final."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}