{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pay10-becomes-first-entity-to-go-live-on-cbuaes-open-finance-framework-2714105-2025-04-24",
      "headline": "Pay10 becomes first entity to go live on CBUAE's open finance frameworkThe new license gives Pay10 secure, real-time access to consumer bank accounts, enabling seamless third-party financial services. This sets the foundation for broader innovations in areas such as embedded finance, digital identity, and interoperable payment systems."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/kumar-mangalam-birla-to-receive-lata-deenanath-mangeshkar-award-2025-2714079-2025-04-24",
      "headline": "Kumar Mangalam Birla to receive Lata Deenanath Mangeshkar Award 2025The 57-year-old industrialist, Padma Bhushan awardee and Chairman of the Aditya Birla Group, is being honoured for his pivotal role in shaping India's growth story."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/wives-are-smarter-harsh-goenka-gold-vs-gadget-lesson-goes-viral-2714047-2025-04-24",
      "headline": "'Wives are smarter': Harsh Goenka's gold vs gadget lesson goes viralOn April 24, at 10.30 am, gold on the Multi Commodity Exchange (MCX) was at Rs 95,893 per 10 grams, up Rs 1,171. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-315-points-lower-nifty-below-24250-hul-falls-4-percent-2714007-2025-04-24",
      "headline": "Sensex, Nifty snap 7-day winning streak, HUL falls 4% after Q4 resultsThe S&P BSE Sensex was down 315.06 points to 79,801.43 at the closing bell, while the NSE Nifty50 fell 82.25 points to settle at 24,246.70. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/what-is-indus-waters-treaty-india-pause-impact-pakistan-economy-pahalgam-attack-2713972-2025-04-24",
      "headline": "India hits pause on Indus Waters Treaty: Could this dry up Pakistan's economy?India has suspended the Indus Waters Treaty (IWT). The announcement was made by Foreign Secretary Vikram Misri on Wednesday, a day after a deadly attack in Pahalgam killed several civilians. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-vs-mutual-funds-what-should-you-invest-in-for-better-returns-which-investment-give-higher-returns-2713963-2025-04-24",
      "headline": "Gold vs mutual funds: What should you invest in for better returns?Gold is often seen as a safe investment. When markets are shaky or inflation rises, many investors turn to gold. On the other hand, mutual funds, particularly equity funds, are linked to the stock market. When the market does well, your mutual fund investment can grow faster."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-prices-today-india-yellow-metal-rates-in-metro-cities-silver-what-to-expect-us-dollar-global-market-2713934-2025-04-24",
      "headline": "Gold prices today: Check rates in metro cities. What to expect?On the Multi Commodity Exchange (MCX), gold was priced at Rs 95,893 per 10 grams at 10.30 am, which was a rise of Rs 1,171 from the last close."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-2025-last-date-refund-timeline-and-documents-all-you-need-to-know-2713924-2025-04-24",
      "headline": "ITR filing 2025: Last date, refund timeline and documents. All you need to knowYou can submit your ITR for the year of assessment 2025-26 once the online portal goes live."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/middle-class-stuck-in-debt-trap-says-marcellus-investments-saurabh-mukherjea-2713887-2025-04-24",
      "headline": "Middle-class stuck in debt trap, says Marcellus Investment's Saurabh MukherjeaUsing data from the Reserve Bank of India, Mukherjea estimates that 5-10% of middle-class households are now stuck in a debt trap."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/want-to-share-upi-with-family-check-steps-to-use-bhim-app-upi-circle-2713877-2025-04-24",
      "headline": "Want to share UPI with family? Check steps to use BHIM app's UPI CircleUPI Circle is a feature where the main UPI account holder or the primary user can authorise up to five trusted people, i.e., secondary users to make UPI payments using his account."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gensol-clears-ed-notice-pmla-act-report-share-prce-fall-over-50-percent-in-last-6-months-2713873-2025-04-24",
      "headline": "Gensol says no ED notice received by company, stock continues steep fallGensol share price: The stock fell 5% to hit the lower circuit limit and has fallen over 50% in the last 6 months. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hul-q4-results-net-profit-4-percent-drop-rs-2464-crore-final-dividend-announced-2713861-2025-04-24",
      "headline": "HUL Q4 profit falls 4% to Rs 2,464 crore; announces Rs 24 final dividendThe FMCG major reported a consolidated net profit of Rs 2,464 crore for the March quarter, down 3.7% from Rs 2,558 crore in the same period last year."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prabhas-fauji-co-star-imanvi-denies-rumours-of-pakistani-military-links-2714078-2025-04-24",
      "headline": "Imanvi, Prabhas's Fauji co-star, denies links to Pakistani militaryImanvi, Prabhas's co-star in 'Fauji', denies false claims linking her family to the Pakistani military and calls out fake news in a strong Instagram statement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/malavika-mohanan-calls-out-male-actors-for-pretending-to-be-woke-feminist-allies-2714054-2025-04-24",
      "headline": "Malavika Mohanan calls out male actors for pretending to be woke, feminist alliesActor Malavika Mohanan called out male actors who project a facade of feminism and wokeness, only to reveal deeply misogynistic behaviour behind the scenes. She criticised those who wear the mask of being 'woke' while embodying the exact opposite in reality.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/penn-badgley-on-dating-gossip-girl-co-star-blake-lively-personal-toll-of-playing-dan-2714042-2025-04-24",
      "headline": "Penn Badgley on dating Blake Lively during Gossip Girl: It was a strugglePenn Badgley reflected on his past romance with Gossip Girl co-star Blake Lively and opened up about how portraying a long-term character on screen affected his personal life.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/gangers-review-even-vadivelus-humour-cant-save-sundar-cs-outdated-film-2714037-2025-04-24",
      "headline": "Gangers review: Even Vadivelu's humour can't save Sundar C's outdated filmReleased-Thu Apr 24, 2025Gangers movie review: While director Sundar C says he makes films for the audience, this one feels stuck, somewhere between trying too hard to please and struggling to make us laugh. It's packed with masala tropes but lacks the spark that once made his films click."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bhagyashree-slams-user-questioning-pakistan-role-pahalgam-terror-attack-2714019-2025-04-24",
      "headline": "Brainless idiot: Bhagyashree slams user questioning Pakistan's role in attackVeteran actor Bhagyashree slammed a social media user who questioned Pakistan's role in the recent Pahalgam terror attack that claimed the lives of 26 tourists. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/arijit-singh-chennai-concert-cancelled-pahalgam-attack-organisers-promise-refund-2714039-2025-04-24",
      "headline": "Arijit Singh's Chennai concert cancelled after Pahalgam attack, refund promisedSinger Arijit Singh's Chennai concert has been cancelled after the tragic Pahalgam incident. The makers shared a statement and promised. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/fahadh-faasil-rajinikanth-nelson-dilipkumar-jailer-2-2714038-2025-04-24",
      "headline": "Actor Fahadh Faasil to reunite with Rajinikanth in Jailer 2: ReportMalayalam actor Fahadh Faasil is likely to reunite with Superstar Rajinikanth for director Nelson Dilipkumar's 'Jailer 2'. The two actors earlier worked together in director TJ Gnanavel's 'Vettaiyan'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dhanashree-verma-to-make-her-acting-debut-with-telugu-film-akasam-daati-vastaava-2713971-2025-04-24",
      "headline": "Dhanashree Verma to make her acting debut with dance-centric Telugu filmChoreographer Dhanashree Verma is set to make her acting debut with the Telugu film 'Akasam Daati Vastaava.' The upcoming dance-centric movie is backed by Dil Raju. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/anirudh-ravichander-postpones-bengaluru-concert-ticket-sales-after-phalgam-terror-attack-2713927-2025-04-24",
      "headline": "Composer Anirudh pauses Bengaluru concert ticket sales after Pahalgam attackComposer Anirudh Ravichander has halted the ticket sales of his Bengaluru concert in the wake of the Pahalgam terror attack. He mentioned that the new date will be announced soon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/demi-moore-named-worlds-most-beautiful-person-of-2025-2713919-2025-04-24",
      "headline": "Demi Moore named World's Most Beautiful person of 2025Demi Moore, 'The Substance' actor, has been named the World's Most Beautiful person of 2025 by People Magazine. The 62-year-old Hollywood icon broke age norms as she appeared on the magazine's annual cover, reflecting on beauty, ageing, and self-acceptance."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/shine-tom-chacko-indecent-explicit-remarks-sexual-connotations-vincy-aloshious-2713944-2025-04-24",
      "headline": "After Vincy Aloshious, another actor accuses Shine Tom Chacko of indecent behaviourAfter Vincy Aloshious, actor Aparna John accused co-star Shine Tom Chacko of indecent behaviour. She said that his remarks were explicit with sexual connotations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/fawad-khan-film-abir-gulal-pakistani-actor-government-ib-ministry-will-not-be-allowed-to-release-in-india-2713942-2025-04-24",
      "headline": "Fawad Khan's Abir Gulal won't be allowed to release in India: Government sourcesFawad Khan and Vaani Kapoor's 'Abir Gulal' will not be allowed to release in India, according to government sources. The movie was slated for release in India on May 9. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anjali-anand-mother-was-cynical-of-her-joining-films-nothing-happens-without-contacts-2713885-2025-04-24",
      "headline": "Anjali Anand's mother was cynical about her film dreams: Nothing without contactsAnjali Anand reflects on her journey in the film industry, revealing her mother's initial scepticism about her career choice due to lack of connections. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/fawad-khan-vaani-kapoor-abir-gulaal-under-scanner-delayed-all-about-controversy-pahalgam-terror-attack-2713936-2025-04-24",
      "headline": "Why Fawad Khan, Vaani Kapoor's Abir Gulaal under scanner? All about the controversyPakistani actor Fawad Khan's upcoming film 'Abir Gulaal' has faced public outrage amid the terror attack in Pahalgam, with calls to boycott its release. The movie is slated to hit the screens on May 9. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranbir-kapoor-bas-baap-achha-hai-dont-know-his-acting-rahul-bhatt-2713878-2025-04-24",
      "headline": "Ranbir Kapoor bas baap achha hai, don't know his acting: Rahul BhattRahul Bhatt, Alia Bhatt's step-brother, talked about her husband Ranbir Kapoor in an interview. He said he doesn't know much about his acting skills but respects him for the kind of father he is. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ar-rahman-breaks-silence-on-trolling-after-split-with-saira-banu-2713870-2025-04-24",
      "headline": "AR Rahman breaks silence on trolling after split: Even God gets reviewed, who am I?Singer and music composer AR Rahman finally broke his silence surrounding the online trolling following his separation announcement with wife Saira Banu. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nani-fan-from-kerala-pitches-film-script-at-hit-3-kerala-event-viral-video-2713856-2025-04-24",
      "headline": "Nani's fan pitches film script at event, actor's encouraging gesture wins heartAn ardent fan of Telugu actor Nani from Kerala pitched a film script to him at the Kochi event of his upcoming film, 'HIT 3'. The actor promised to read his synopsis and encouraged him to pursue cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jaat-box-office-collection-day-14-detailed-report-will-sunny-deol-film-reach-rs-100-crore-in-3rd-weekend-2713838-2025-04-24",
      "headline": "Jaat box office Day 14: Will Sunny Deol's film reach Rs 100 crore in 3rd weekend?With 'Phule' and 'Ground Zero' hitting the screens this weekend, Sunny Deol's 'Jaat' will be looking at slowly but eventually surpassing the benchmark of Rs 100 crore at the box office. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/what-makes-kaiju-no-8-a-must-watch-2713683-2025-04-24",
      "headline": "Monster mayhem meets midlife-crisis and comedy: Why Kaiju No 8 is not to be missedKaiju No 8 follows Kafka Hibino, a 32-year-old who aspires to join the Defence Force to fight Kaijus alongside his friend Mina, despite repeated failures. Watch the anime for its relatable protagonist, stylish action and seamless comedy."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-asks-indians-on-saarc-visa-to-leave-shuts-wagah-border-closes-air-space-pahalgam-attack-jammu-kashmir-2714052-2025-04-24",
      "headline": "Pak pauses Simla accord, shuts airspace for India after Delhi's diplomatic strikeIndia on Wednesday announced a five-pronged diplomatic response to Pakistan, including suspension of the Indus Waters Treaty, following the Pahalgam carnage. Less than 24 hours later, Pakistan announced a series of retaliatory measures."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-live-updates-victims-funeral-centre-to-hold-all-party-meet-brief-leaders-pm-modi-rajnath-singh-amit-shah-2713787-2025-04-24",
      "headline": "Live: All-party meeting on Pahalgam terror attack to begin shortlyTerror Attack In Pahalgam Live Updates: India briefed ambassadors of select countries, including the US, the UK and China, on the Pahalgam terror attack, which claimed 26 lives on Tuesday. This comes after India downgraded diplomatic ties with Pakistan and announced major diplomatic measures, including the suspension of the Indus Waters Treaty of 1960 and immediate shutting down of the Attari border. In response, Pakistan announced tit-for-tat measures, including the shutting down of airspace for Indian airlines. Meanwhile, the Centre will hold an all-party meeting today and brief leaders on the Pahalgam attack and hear their views. Follow indiatoday.in for live updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-suspends-pakistani-visas-medical-jammu-kashmir-pahalgam-attack-2714022-2025-04-24",
      "headline": "J&K attack: India revokes visas to Pakistanis, asks Indians in Pak to returnIndia has cancelled all Pakistani visas, including medical ones, in response to the deadly Pahalgam terror attack which took place on April 22, killing as many as 26 people, mostly tourists. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bsf-jawan-pakistan-rangers-custody-accidentally-cross-international-border-flag-meets-ensure-return-2714075-2025-04-24",
      "headline": "BSF jawan in Pakistan custody after accidental border crossing: SourcesConstable PK Singh of the 182nd BSF battalion was detained by Pakistan Rangers after he accidentally crossed the Punjab border. Talks are on between the two forces to secure his safe release. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-why-pakistan-army-chief-asim-munir-risking-mini-war-with-india-2714005-2025-04-24",
      "headline": "Why Pak army chief Asim Munir is desperate for a mini-war with IndiaIndia's top leadership, including PM Narendra Modi, has vowed a befitting reply over the Pahalgam massacre. Pakistan's role is undeniable, and India has both diplomatic and kinetic options on the table, like after the Uri and Pulwama attacks. This is why Pakistan's army chief, General Asim Munir, might be risking a limited war with India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-narendra-modi-pahalgam-terror-attack-jammu-kashmir-will-identify-track-punish-terrorist-pakistan-vows-warning-2713906-2025-04-24",
      "headline": "Punishment beyond imagination for every terrorist, PM promises after J&K attackPM Modi said the terrorists and conspirators behind the April 22 Pahalgam attack will get punishment beyond their imagination as he sent a strong-worded message from Bihar's Madhubani."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/case-against-bjp-it-cell-for-rahul-gandhi-post-after-pahalgam-attack-2714010-2025-04-24",
      "headline": "Case against BJP IT cell for Rahul Gandhi post after Pahalgam attackAn FIR has been registered against the BJP IT Cell at the High Grounds Police Station in Bengaluru over a derogatory social media post targeting Congress leader Rahul Gandhi."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/mumbai-high-alert-police-sea-vigilance-increased-pahalgam-terror-attack-jk-2714089-2025-04-24",
      "headline": "Mumbai on high alert, sea vigilance stepped up after Pahalgam attackThe Maharashtra Home Department has instructed the Mumbai Police to increase vigilance at sea and tighten security at public places in the aftermath of the Pahalgam terror attack, which killed 26 people."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-indus-waters-treaty-pakistan-impact-what-it-means-pahalgam-terror-attack-2713827-2025-04-24",
      "headline": "Can India turn off Indus tap and leave Pakistan high and dry?The suspension of the Indus Waters Treaty by India is more of a pressure tactic on Pakistan to force it to rein in terror groups and stop infiltration. Here is why India can't stop Indus waters to Pakistan overnight."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-india-indus-treaty-suspension-water-warfare-pahalgam-terror-attack-2713986-2025-04-24",
      "headline": "Act of war: Pak says water lifeline for 240 million as India pauses Indus treatyAs part of its diplomatic retaliation after the deadly Pahalgam terror attack, India has suspended the Indus Waters Treaty. Pakistan has vowed to challenge the move legally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-briefs-envoys-of-select-nations-on-jk-attack-as-it-moves-to-isolate-pak-2714100-2025-04-24",
      "headline": "India briefs envoys of select nations on J&K attack as it moves to isolate PakEnvoys of select G20 countries, including China and Canada, were briefed by the MEA on the Pahalgam terror attack that claimed 26 lives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-narendra-modi-rare-switch-to-english-in-bihar-madhubani-ensures-world-gets-his-message-terrorism-2713932-2025-04-24",
      "headline": "With rare switch to English, PM Modi ensures world gets his message on terrorPrime Minister Narendra Modi, who usually uses Hindi and Indian regional languages in his speeches, made a rare switch to English at a rally in Bihar to convey that the perpetrators of the Pahalgam attack won't be spared. His use of English was to ensure that the world didn't miss a word of India's resolve to fight Pakistan-sponsored terrorism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-tourists-close-save-baisaran-meadow-salty-rogan-josh-lack-of-horses-jaipur-couple-bhelpuri-2713900-2025-04-24",
      "headline": "Salty rogan josh, horse delay helped 39 cheat death in PahalgamA rogan josh meal too salty, a delay in the arrival of horses, and a plate of bhelpuri are what saved 41 tourists from the site where terrorists were carrying out a massacre in Pahalgam. After terrorists killed 26 people in Kashmir, stories are now emerging of how luck turned into unlikely shields for over 40 people."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pahalgam-attack-visuals-capture-moment-terrorists-fired-ak-47s-at-tourists-2713848-2025-04-24",
      "headline": "Disturbing video of Pahalgam horror, terrorists round up tourists, shoot themIn the video, an individual can be seen capturing the exact moment when the terrorists surrounded the unsuspecting tourists and began firing at them. While the sounds of gunshots and the screams of tourists can be heard in the background, alarming shots of bodies lying around can also be seen."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-should-cut-pakistan-jugular-veins-former-us-pentagon-official-on-pahalgam-attack-2714077-2025-04-24",
      "headline": "High time India cuts Pakistan's 'jugular veins': Ex-US official on Pahalgam attackFormer Pentagon official Michael Rubin said that India needs to go ahead and cut 'Pakistan's jugular' and called Pakistan Army Chief Asim Munir's remarks about Kashmir being their 'jugular vein' a direct provocation to India in the days leading up to the Pahalgam attack."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/danish-kaneria-slams-pakistan-pm-shehbaz-sharif-silence-pahalgam-terror-attack-2713985-2025-04-24",
      "headline": "Danish Kaneria slams Pakistan PM's silence over Pahalgam terror attackFormer Pakistan cricketer Danish Kaneria has questioned his country's Prime Minister Shehbaz Sharif's silence over the terror attack in Jammu & Kashmir's Pahalgam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/latest-studies/story/iq-levels-are-falling-across-the-world-as-we-read-less-and-scroll-more-2713984-2025-04-24",
      "headline": "IQ levels are falling across the world as we read less and scroll moreRecent studies have shown a steady decline in IQ levels and cognitive skills among both teens and adults globally. One of the main reasons seems to be rising screen time and tech use over reading."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/fawad-khan-film-abir-gulal-pakistani-actor-government-ib-ministry-will-not-be-allowed-to-release-in-india-2713942-2025-04-24",
      "headline": "Fawad Khan's Abir Gulal won't be allowed to release in India: Government sourcesFawad Khan and Vaani Kapoor's 'Abir Gulal' will not be allowed to release in India, according to government sources. The movie was slated for release in India on May 9. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-maharashtra-sangli-man-santosh-jagdale-escapes-pahalgam-massacre-his-namesake-gets-killed-2713948-2025-04-24",
      "headline": "Maharashtra man escapes Pahalgam massacre, his namesake gets killedOn Tuesday afternoon, five to six terrorists opened fire on a group of tourists in the Baisaran meadow, which is around 5 kms from Pahalgam. The meadow - also known as 'mini Switzerland' - is accessible only by foot or by horseback. The Pahalgam carnage was one of the deadliest civilian attacks in the Kashmir Valley in recent years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tahawwur-rana-plea-family-telephonic-interaction-nia-court-2713741-2025-04-24",
      "headline": "26/11 plotter Tahawwur Rana's plea to interact with family deniedDelhi's Patiala House Court heard arguments from both the National Investigation Agency (NIA) and Tahawwur Rana's legal aid counsel on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/first-youtube-video-turns-20-watch-19-second-clip-with-355-million-views-2714029-2025-04-24",
      "headline": "The first YouTube video turns 20: Watch the 19-second clip with 355 million viewsTwo decades ago, a casually filmed video at a zoo quietly made internet history. Today, that 19-second clip still stands as a reminder of how it all began for YouTube. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/from-plan-change-to-horse-ride-delay-stories-of-those-who-escaped-death-in-jk-2713995-2025-04-24",
      "headline": "From plan change to horse ride delay: Stories of those who escaped death in J&KThe Pahalgam attack took place on what seemed like a normal afternoon on April 22. But the calmness of 'mini Switzerland' was disturbed by the echo of gunshots as terrorists shot innocent tourists even as they pleaded for mercy. Amid the chaos, a few fortunate tourists managed to escape, just moments before the attackers struck."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/video-indian-navy-warship-conducts-destroyer-ins-surat-missile-test-in-arabian-sea-2713976-2025-04-24",
      "headline": "Video: Navy warship conducts missile test in Arabian SeaThis achievement demonstrates the Indian Navy's growing prowess in indigenous warship design, development, and operations, and underscores the nation's commitment to self-reliance in defence manufacturing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/assam-professor-recounts-terror-attack-moment-terrorist-encounter-pahalgam-exclusive-2713720-2025-04-24",
      "headline": "I wasn't asked to, but I recited kalma: Assam professor's Pahalgam survival storyDebasish Bhattacharyya, who was in Pahalgam with his family when a group of tourists were attacked on April 22, said a terrorist approached him during the attack."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-live-score-royal-challengers-bengaluru-vs-rajasthan-royals-today-match-updates-2714112-2025-04-24",
      "headline": "RCB vs RR Live: Bengaluru look to arrest home slumpIPL 2025, RCB vs RR Live Score: Royal Challengers Bengaluru have lost all three of their matches at home, although they are unbeaten in away matches. Rajasthan Royals are looking to make a comeback after losing their last four games. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-jamie-vardy-set-to-leave-leicester-city-confirmed-2714097-2025-04-24",
      "headline": "Jamie Vardy to end historic Leicester City chapter at the end of the seasonPremier League: Jamie Vardy is set to leave Leicester City after 13 unforgettable years, bringing an end to one of football's most inspiring stories—but the veteran striker has no plans to hang up his boots yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-chennai-super-kings-ms-dhoni-jamie-overton-chepauk-2714090-2025-04-24",
      "headline": "You have to come experience Dhoni walking out: Jamie Overton's message to dadJamie Overton said he was in awe of seeing MS Dhoni walkout to the middle at the Chepauk stadium and revealed that he messaged his dad and agent, telling them to experience the CSK legend walkout to the middle. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-madrid-open-french-open-injury-2714068-2025-04-24",
      "headline": "Alcaraz faces injury scare before French Open after Madrid Open snubWorld No.3 Carlos Alcaraz pulled out of the Madrid Open due to hamstring and groin injuries, bearing in mind the French Open to be held from May 25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-bcci-rajeev-shukla-pahalgam-terror-attack-2714064-2025-04-24",
      "headline": "India will not play with Pakistan in bilaterals going forward: Rajeev ShuklaBCCI vice-president Rajeev Shukla has said that India will not play with Pakistan in bilateral series going forward in the aftermath of the Pahalgam terrorist attack on April 22. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-draymond-green-sparks-chaos-as-jimmy-butler-injured-and-tari-eason-clashes-in-game-2-glbs-2713994-2025-04-24",
      "headline": "NBA: Draymond Green sparks chaos as Jimmy Butler Injured and Tari Eason clashes in Game 2The Toyota Center saw clashes as the Houston Rockets evened their NBA first-round playoff series with the Golden State Warriors, on Wednesday night, April 23. Warriors star Draymond Green fell into conflicts, igniting multiple incidents that left tensions boiling over in Game 2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/if-arjun-tendulkar-trains-under-yuvraj-he-will-become-next-chris-gayle-yograj-singh-2714008-2025-04-24",
      "headline": "If Arjun Tendulkar trains under Yuvraj, he will become next Gayle: Yograj SinghFormer India cricketer Yograj Singh recently said that Sachin Tendulkar's son Arjun, has the potential to become the next Chris Gayle if he starts training under Yuvraj Singh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-mi-rohit-sharma-matthew-hayden-2714006-2025-04-24",
      "headline": "Rohit Sharma's innings vs SRH had vision, stability and perfect timing: HaydenMatthew Hayden feels that Rohit Sharma's knock against SRH had vision stability and perfect timing as MI cruised to a thumping win on April 23. Rohit continued his fine run of form with another fifty. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/which-company-made-ipl-robot-dog-camera-bcci-2714002-2025-04-24",
      "headline": "IPL's robotic dog: Everything you need to know about the latest innovationThe robotic dog is the new sensation in the Indian Premier League 2025. Here's everything you need to know about 'Champak' and how it has won over the fans in the Indian cricket."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/danish-kaneria-slams-pakistan-pm-shehbaz-sharif-silence-pahalgam-terror-attack-2713985-2025-04-24",
      "headline": "Danish Kaneria slams Pakistan PM's silence over Pahalgam terror attackFormer Pakistan cricketer Danish Kaneria has questioned his country's Prime Minister Shehbaz Sharif's silence over the terror attack in Jammu & Kashmir's Pahalgam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/will-barton-announces-retirement-after-11-years-in-nba-glbs-2713968-2025-04-24",
      "headline": "Will Barton announces retirement after 11 years in NBAWill Barton, one of the most underrated players in recent NBA history and a staple in Denver Nuggets lore, officially announced his retirement from professional basketball on Wednesday, April 23, 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/if-arjun-tendulkar-trains-under-yuvraj-he-will-become-next-chris-gayle-yograj-singh-2714008-2025-04-24",
      "headline": "If Arjun Tendulkar trains under Yuvraj, he will become next Gayle: Yograj SinghFormer India cricketer Yograj Singh recently said that Sachin Tendulkar's son Arjun, has the potential to become the next Chris Gayle if he starts training under Yuvraj Singh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-mi-rohit-sharma-matthew-hayden-2714006-2025-04-24",
      "headline": "Rohit Sharma's innings vs SRH had vision, stability and perfect timing: HaydenMatthew Hayden feels that Rohit Sharma's knock against SRH had vision stability and perfect timing as MI cruised to a thumping win on April 23. Rohit continued his fine run of form with another fifty. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/which-company-made-ipl-robot-dog-camera-bcci-2714002-2025-04-24",
      "headline": "IPL's robotic dog: Everything you need to know about the latest innovationThe robotic dog is the new sensation in the Indian Premier League 2025. Here's everything you need to know about 'Champak' and how it has won over the fans in the Indian cricket."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/danish-kaneria-slams-pakistan-pm-shehbaz-sharif-silence-pahalgam-terror-attack-2713985-2025-04-24",
      "headline": "Danish Kaneria slams Pakistan PM's silence over Pahalgam terror attackFormer Pakistan cricketer Danish Kaneria has questioned his country's Prime Minister Shehbaz Sharif's silence over the terror attack in Jammu & Kashmir's Pahalgam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/will-barton-announces-retirement-after-11-years-in-nba-glbs-2713968-2025-04-24",
      "headline": "Will Barton announces retirement after 11 years in NBAWill Barton, one of the most underrated players in recent NBA history and a staple in Denver Nuggets lore, officially announced his retirement from professional basketball on Wednesday, April 23, 2025. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}