{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indigo-gets-another-six-month-extension-to-lease-turkish-airlines-planes-glbs-2778448-2025-08-29",
      "headline": "IndiGo gets another six-month extension to lease Turkish Airlines planesThe extension will help IndiGo cut losses caused by geopolitical restrictions, the airline said, referring to an airspace ban imposed by Pakistan on Indian airlines earlier this year that has led to longer routes and higher costs."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/india-to-boost-russian-oil-imports-in-september-despite-us-pressure-report-2778293-2025-08-28",
      "headline": "India to boost Russian oil imports in September despite US pressure: ReportIndia has become Russia's biggest oil customer since Western sanctions forced Moscow to redirect supplies in 2022. Cheaper Russian crude has helped Indian refiners keep costs down, but the trade has also attracted criticism. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-extends-duty-free-cotton-imports-to-shield-textile-sector-from-us-tariffs-2778283-2025-08-28",
      "headline": "India extends duty-free cotton imports to shield textile sector from US tariffsFor mills, the duty-free extension offers much-needed relief. The earlier exemption, ending in September, was too short to allow large imports, as shipments from exporting nations often take more than a month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/cibil-credit-score-how-to-improve-grievance-loan-approval-emis-personal-finance-2778278-2025-08-28",
      "headline": "CIBIL Decoded: How delayed credit score updates can hit your loans and ratesA delay of even a few weeks in updating information with the credit bureau can decide whether a person gets a loan, how much interest they pay, or if they are denied altogether."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-drops-1500-points-in-two-sessions-will-us-tariffs-keep-hitting-dalal-street-2778229-2025-08-28",
      "headline": "Sensex drops 1,500 points in two sessions: Will US tariffs keep hitting D-Street?Dalal Street remains volatile as global trade tensions collide with domestic pressures. Investors face uncertainty, with heavyweights under pressure, mid- and small-caps slipping, while cautious buying emerges at key support levels."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/more-taxes-coming-from-people-than-companies-finds-report-2778219-2025-08-28",
      "headline": "More taxes coming from people than companies, finds reportFor the first time, personal income tax collections in India have overtaken corporate tax, signalling a major shift in the country's tax landscape."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-2-0-tax-slabs-reduction-state-revenue-loss-decoded-2778191-2025-08-28",
      "headline": "GST 2.0: Which states will take the biggest hit if taxes drop?GST 2.0 promises lower taxes and cheaper goods, but the real challenge looms for revenue-dependent states. The question is, who absorbs the shortfall when the proposals come into effect?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-sensex-closes-706-points-lower-nifty-below-24600-hcltech-down-3-percent-2778184-2025-08-28",
      "headline": "Sensex closes 706 points lower; Nifty below 24,600; HCLTech down 3%The S&P BSE Sensex was down by 706 points to close at 80,080.57, while the NSE Nifty50 lost 211.15 points to end at 24,500.90. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-on-track-to-become-2nd-largest-economy-by-2038-report-2778125-2025-08-28",
      "headline": "India on track to become 2nd largest economy by 2038: ReportWith a combination of a young population, rising domestic consumption, fiscal discipline, and structural reforms, India appears well-positioned to climb the global economic ladder in the coming decades."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/dont-miss-this-step-after-filing-itr-here-what-to-do-2778053-2025-08-28",
      "headline": "Don't miss this step after filing ITR: Here's what to doSimply filing your ITR is not enough. You must verify it within 30 days, else, missing this important step could mean delays, penalties, and even your return being declared invalid."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/raghuram-rajan-explains-trump-using-tariff-as-weapon-india-powerplay-russia-oil-buying-2778050-2025-08-28",
      "headline": "Why is Trump targeting India with tariffs? Raghuram Rajan explainsFormer RBI Governor Raghuram Rajan said that US President Donald Trump's decision to impose steep tariffs, including a 50% duty on Indian goods, is part of a wider strategy that goes beyond trade economics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-rate-cut-textile-fertiliser-us-tariff-rate-rationalisation-low-cost-tax-free-nil-slab-festive-season-2778026-2025-08-28",
      "headline": "GST 2.0 boost for textile, fertiliser sectors as Trump's 50% tariff kicks inThe textile and fertiliser industries are expected to be among the biggest beneficiaries of the upcoming GST 2.0 rationalisation amid US President Donald Trump's 50% tariff. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/dividend-mismatch-with-ais-here-is-how-taxpayers-should-report-it-2778019-2025-08-28",
      "headline": "Dividend mismatch with AIS? Here's how taxpayers should report itFiling ITR often becomes confusing when dividend income in your personal records doesn't match what appears in AIS. Here's how to handle it while filing ITR."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-council-tax-cuts-updates-milk-chocolates-textiles-fertilizers-2778009-2025-08-28",
      "headline": "Cheaper milk, chocolates, clothes and more: How GST 2.0 could slash your billsThe proposed changes, to be discussed at the Council's meeting on September 3–4 in New Delhi, focus on widening the nil rate, scrapping the 12% slab, and reducing rates on selected 18% goods."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/why-is-stock-market-down-sensex-tanks-600-points-nifty-falls-us-tariff-50-percent-2777990-2025-08-28",
      "headline": "Sensex tanks 600 points: Why is stock market falling today?The S&P BSE Sensex was down by 605.97 points to 80,180.57, while the NSE Nifty50 lost 173.50 points to 24,538.55, as both the indices continued their downward movement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-nearly-500-points-nifty-below-24600-as-us-tariffs-hit-markets-2777962-2025-08-28",
      "headline": "Sensex nosedives 600 points, Nifty tumbles as US tariffs hit marketsThe Sensex shed 600 points to close at 81,074, while the Nifty ended below the 24,600 mark after slipping into bearish territory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/high-end-electric-vehicles-likely-to-attract-18-gst-2777884-2025-08-28",
      "headline": "High-end electric vehicles likely to attract 18% GSTAccording to the proposals, GST on four-wheeled EVs priced between Rs 20 lakh and Rs 40 lakh will be raised from 5 per cent to 18 per cent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/chocolates-with-cocoa-pastries-ice-cream-likely-to-be-taxed-at-5-percent-gst-2777835-2025-08-27",
      "headline": "Chocolates with cocoa, pastries, ice cream likely to be taxed at 5% instead of 18%The proposed rationalisation stems from the Council's broader push to simplify the GST framework."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/condensed-milk-dates-jams-mushrooms-namkeens-to-get-cheaper-under-gst-2-0-2777830-2025-08-27",
      "headline": "Condensed milk, dates, jams, mushrooms, namkeens to get cheaper under GST 2.0The fitment committee has proposed that products such as butter, condensed milk, jams, mushrooms, dates, nuts, and namkeens move from the current 12 per cent GST slab to just 5 per cent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pm-svanidhi-scheme-extended-till-2030-higher-loans-and-credit-cards-for-vendors-2777686-2025-08-27",
      "headline": "PM SVANidhi scheme extended till 2030, higher loans and credit cards for vendorsThe move is expected to benefit 1.15 crore street vendors, including 50 lakh new beneficiaries. The scheme will continue to be implemented jointly by the Ministry of Housing & Urban Affairs (MoHUA) and the Department of Financial Services (DFS)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-tariff-response-india-eyes-new-markets-export-textiles-jewellery-gems-outreach-program-trade-2777643-2025-08-27",
      "headline": "India eyes new markets amid US tariffs, aims to boost textile, jewellery exportsPlans are being drawn up to explore new markets, increase outreach, and give special attention to sectors such as textiles and gems and jewellery, which are likely to be among the hardest hit by the tariff."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/can-a-rs-10000-monthly-sip-make-you-a-crorepati-heres-the-timeline-2777633-2025-08-27",
      "headline": "Can a Rs 10,000 monthly SIP make you a crorepati? Here's the timelineCan Rs 10,000 a month really make you a crorepati? The maths of SIPs shows that with discipline and time, the answer is yes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/these-3-banks-offer-special-fds-with-higher-interest-rates-till-september-2025-indian-bank-idbi-state-bank-of-india-sbi-2777597-2025-08-27",
      "headline": "These 3 banks offer special FDs with higher interest rates till September 2025For those planning to invest in FDs, three banks are running special schemes with better interest rates valid up to September 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-economy-impact-gdp-us-tariff-50-percent-donald-trump-fastest-growing-economy-pm-modi-rbi-projection-2777572-2025-08-27",
      "headline": "How will Trump's 50% tariff impact India's growth?The 50% tariff by the US comes at a time when India has reported strong growth of 6.5% in 2024–25 and has been projected to remain the fastest-growing major economy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-documents-ais-form-16-capital-gains-26-ad-pan-card-aadhar-tax-returns-fy25-2777547-2025-08-27",
      "headline": "Filing ITR for FY 2024-25? Keep these 6 documents handyKeeping your documents in order is the first step to a smooth filing process. Not having the documents in place not only delays the process but also increases the chance of errors in the return. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indian-crypto-platforms-boom-in-grey-zone-says-zerodhas-nithin-kamath-2777489-2025-08-27",
      "headline": "Indian crypto platforms boom in grey zone, says Zerodha's Nithin KamathTraders are increasingly drawn to futures and options (F&O) products in digital assets, lured by high leverage and lower tax costs compared to traditional markets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-tariff-50-percent-india-exporters-impact-gdp-trade-key-sectors-way-out-pm-modi-donald-trump-2777450-2025-08-27",
      "headline": "Trump's 50% tariff shock: How can exporters shield themselvesThe tariff was announced as a response to India's continued trade with Russia, and it now places Indian products at a disadvantage in the American market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/new-to-itr-filing-here-is-how-to-create-your-account-on-the-e-filing-portal-2777447-2025-08-27",
      "headline": "New to ITR filing? Here's how to create your account on the e-filing portalNew taxpayers often wonder how to start their ITR journey, and the answer is simple: create your account on the e-filing portal to access all tax-related services."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-tariff-indian-leather-footwear-exports-impact-trade-cle-russia-africa-markets-kanpur-piyush-goyal-2777387-2025-08-27",
      "headline": "Indian leather industry eyes expansion in Russian, African markets amid US tariffsTrade delegations are set to visit Russia and Africa soon, with Commerce Minister Piyush Goyal expected to lead the mission in Russia. Buyer-seller meets are also planned in African countries."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-holiday-ganesh-chaturthi-2025-nse-bse-close-derivatives-trading-details-us-tariff-2777143-2025-08-27",
      "headline": "Ganesh Chaturthi 2025: Is stock market open for trading today?The stock market holiday list for 2025 is available on the official BSE (Bombay Stock Exchange) website. Earlier, markets were closed on August 15 for Independence Day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/how-will-trumps-50-tariff-impact-indian-economy-and-its-exports-2777315-2025-08-27",
      "headline": "How will Trump's 50% tariff impact Indian economy and its exports?The United States has escalated its trade dispute with India, imposing new tariffs that bring the total rate to 50% on certain goods. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/what-impact-will-trumps-50-tariff-have-on-the-indian-economy-experts-weigh-in-2777272-2025-08-26",
      "headline": "How will Trump's 50% tariff impact Indian economy? Experts weigh inThe discussion centres on the implications of a 50% tariff threatened by Donald Trump on Indian goods. Experts analyse the potential impact on India's economy, particularly labour-intensive sectors such as textiles, leather, gems and jewellery. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/papa-johns-pizza-returns-to-india-with-first-outlet-in-bengaluru-plans-650-stores-by-2035-2777192-2025-08-26",
      "headline": "Papa John's to return to India with Bengaluru outlet, plans 650 stores by 2035US-based Papa John's will re-enter India this October, opening its first store in Bengaluru and targeting 650 outlets by 2035. The pizza chain, which exited in 2017 due to poor performance, has partnered with Pulsar Capital and UAE's PJP Investments Group as master franchisees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-appoints-amit-kapur-to-lead-new-ai-and-services-transformation-unit-2777191-2025-08-26",
      "headline": "TCS appoints Amit Kapur to lead new AI and services transformation unitIn a bid to deepen its AI capabilities, TCS has named Amit Kapur as the head of its newly formed AI and services transformation unit, effective September."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/no-credit-history-how-lenders-are-opening-doors-for-new-borrowers-2777127-2025-08-26",
      "headline": "No credit history? How lenders are opening doors for new borrowersFor decades, a blank credit history meant a closed door to loans. Now, fintechs and banks are rewriting the rules—using digital footprints and alternative data to bring first-time borrowers into the fold."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pmo-holds-high-level-meet-on-us-tariff-impact-explores-relief-for-exporters-2777081-2025-08-26",
      "headline": "PM holds high-level meet on US tariff impact, explores relief for exportersThe PMO on Tuesday held a high-level meeting with senior ministers and officials from the Finance and Commerce Ministries to frame India's response to the US decision to double tariffs on Indian goods to 50% from Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-acts-password-override-privacy-threat-or-necessary-power-2777086-2025-08-26",
      "headline": "New Income Tax Act's password override: Privacy threat or necessary power?India's new tax law brings a digital twist; officials can now override passwords during raids. Supporters say it's just enforcement in the digital age, but privacy advocates worry about unchecked surveillance."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-us-tariff-sensex-loses-849-points-nifty-below-24750-tata-steel-down-3-percent-2777012-2025-08-26",
      "headline": "Sensex slumps 849 points, Nifty below 24,750; Tata Steel down 3%The S&P BSE Sensex tanked 849.37 points to close at 80,786.54, while the NSE Nifty50 lost 255.70 points to end at 24,712.05."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/tax-notice-rs-258-crore-recuced-to-zero-money-saving-section-54-land-sell-property-buy-2776992-2025-08-26",
      "headline": "Woman got tax notice of Rs 2.58 crore. Here's how she reduced it to Rs 0Seema found herself staring at a tax notice of Rs 2.58 crore after selling a piece of land in Patna. The confusion arose due to a simple error in her tax return."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-tariff-25-percent-august-27-impact-economy-export-pmo-meeting-modi-government-textile-gems-pharma-2776931-2025-08-26",
      "headline": "Trump's 50% tariff takes effect tomorrow: Who wins, who losesThe United States government has issued a draft notification confirming the step, which will be applied through a supplementary 25% duty on top of existing tariffs."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-thursday-murder-club-review-engaging-whodunnit-defies-ageing-stereotypes-2778473-2025-08-29",
      "headline": "The Thursday Murder Club review: Immersive whodunnit defying ageing stereotypesRelease Date:Thu Aug 28, 2025The Thursday Murder Club review: 'The Thursday Murder Club', a classic whodunnit blended with humour, is about veteran sleuths investigating unsolved mysteries. The film is an homage to Agatha Christie and Alfred Hitchcock. Is the mystery-comedy worth your time? Here is our review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranveer-singh-deepika-padukone-ganpati-celebrations-ambani-antilia-2778480-2025-08-29",
      "headline": "Ranveer Singh lights up Ganpati bash as he dances to Deva Shree Ganesha songRanveer Singh danced to 'Deva Shree Ganesha' song at the Ganpati festivities at Ambani residence, Antilia. Deepika Padukone accompanied him to the event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/ariana-grande-announces-2026-eternal-sunshine-tour-after-seven-years-glbs-2778460-2025-08-29",
      "headline": "Ariana Grande announces 2026 Eternal Sunshine tour after seven yearsAriana Grande returns with The Eternal Sunshine Tour in 2026, her first in seven years, featuring US and London shows, blending her music career with Hollywood success after Wicked.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/radio-legend-gary-burbank-longtime-wlw-host-dies-at-84-after-illness-glbs-2778455-2025-08-29",
      "headline": "Radio legend Gary Burbank, longtime WLW host, dies at 84 after illnessRadio legend Gary Burbank, famed WLW host and creator of colorful comedy characters, died at 84 after a long illness. He left a legacy in broadcasting, music, and philanthropy.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/busan-international-film-festival-competition-spying-stars-nila-madhab-panda-indira-tiwari-2778287-2025-08-28",
      "headline": "Nila Madhab Panda's Spying Stars to compete at Busan International Film Festival'Spying Stars' is the only Indian co-production competing in the Busan International Film Festival's new competitive section. The film's themes of AI and humanity highlight a timely cinematic exploration amid changing festival formats."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/pati-patni-aur-woh-do-shoot-disrupted-prayagraj-clash-locals-crew-ayushmann-sara-ali-khan-2778347-2025-08-28",
      "headline": "Pati Patni Aur Woh Do shoot disrupted by clash between crew and locals in PrayagrajFilming of Pati Patni Aur Woh 2 has started in Prayagraj amid tensions between locals and the film crew. Viral videos reveal physical fights and heated exchanges, raising concerns over shoot disruptions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/lokah-chapter-1-chandra-review-kalyani-priyadarshan-dulquer-salmaan-film-dominic-arun-promising-world-building-hampered-by-cliches-2778345-2025-08-28",
      "headline": "Lokah Chapter 1 Chandra review: Promising world-building hampered by clichesRelease Date:Thu Aug 28, 2025Lokah Chapter 1: Chandra movie review:  Director Dominic Arun's 'Lokah Chapter 1: Chandra' is a superhero film starring Kalyani Priyadarshan, Naslen and Sandy in lead roles. Despite predictable and familiar screenplay, the film is technically strong."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anusha-dandekar-going-public-with-relationships-dealing-with-break-ups-trolls-2778304-2025-08-28",
      "headline": "Anusha Dandekar on going public with relationships, dealing with break-ups and trollsActor Anusha Dandekar opens up about her very public relationships and past break-ups. She discussed the balance between privacy and publicity and the mixed reactions she received online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nandamuri-balakrishna-akhanda-2-release-postponed-new-date-to-be-announced-soon-2778264-2025-08-28",
      "headline": "Nandamuri Balakrishna's Akhanda 2 release postponed, new date to be announced soonThe release of 'Akhanda 2', starring Balakrishna and directed by Boyapati Srinu, has been postponed. The makers promise a grand cinematic experience with a new date to be announced soon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/honey-singh-cancels-mohali-award-show-security-dispute-2778316-2025-08-28",
      "headline": "Honey Singh backs out of award show over security concerns: SourcesHoney Singh backed out of a Mohali award show due to denial of personal bodyguards. The cancellation has sparked a financial dispute between the artist and organisers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/shilpa-shirodkar-supernatural-drama-jatadhara-2778309-2025-08-28",
      "headline": "Shilpa Shirodkar is driven by greed in first look from JatadharaShilpa Shirodkar stars as Shobha in the upcoming supernatural drama 'Jatadhara'. The film promises a mysterious storyline with a powerful female lead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-summer-i-turned-pretty-season-3-episode-8-conversation-that-never-was-belly-jeremiah-2778238-2025-08-28",
      "headline": "The Summer I Turned Pretty S3 episode 8: The conversation that never was In 'The Summer I Turned Pretty' Season 3, episode 8, Belly and Jeremiah's pre-wedding talk skipped over the real issues. Here's the messy, honest showdown that should have happened."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/emma-heming-on-moving-bruce-willis-new-home-amid-dementia-hardest-decision-2778251-2025-08-28",
      "headline": "Emma Heming on moving Bruce Willis to new home amid dementia: Hardest decisionBruce Willis is living separately under full-time care as he battles frontotemporal dementia. His family has adjusted living arrangements to provide tailored support and maintain close bonds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sidharth-malhotra-fatherhood-diaper-duties-great-indian-kapil-show-param-sundari-janhvi-kapoor-2778265-2025-08-28",
      "headline": "Sidharth Malhotra shares fatherhood tales on The Great Indian Kapil ShowSidharth Malhotra appeared on The Great Indian Kapil Show to promote his film Param Sundari. He shared heartfelt stories about his new role as a father, bringing warmth and laughter to the episode."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-engagement-post-travis-kelce-becomes-most-reposted-instagram-2778121-2025-08-28",
      "headline": "Taylor Swift's engagement post with Kelce becomes most reposted on InstagramPop star Taylor Swift and athlete Travis Kelce's engagement post amassed over 1 million reposts in just six hours. While in the first hour alone, it received 14 million likes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bigg-boss-19-ashnoor-kaur-fears-abuse-ready-show-real-self-set-rules-2778242-2025-08-28",
      "headline": "Exclusive: Ashnoor Kaur fears abuse but ready for Bigg Boss 19 challengesAshnoor Kaur steps into Bigg Boss 19 with excitement and apprehension about the show's controversies. She aims to reveal her true self while advocating for respect and boundaries inside the house."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kingdom-ott-release-vijay-deverakonda-fans-disapointed-over-deleted-romantic-song-2778128-2025-08-28",
      "headline": "Kingdom OTT release: Vijay Deverakonda fans disappointed over deleted romantic songActor Vijay Deverakonda's 'Kingdom' recently disappointed fans after its OTT release as the the popular song 'Hridayam Laopala' and key fight scenes were edited."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/gaurav-khanna-shares-wife-akanksha-chamola-doesnt-want-kids-2778183-2025-08-28",
      "headline": "Gaurav Khanna shares wife Akanksha Chamola doesn't want kids: I have to stand by itBigg Boss 19 contestant Gaurav Khanna shared that while he wants to become a father, his wife Akanksha Chamola does not wish to have kids. Although he respected Akanksha's decision, he hasn't ruled out parenthood in the future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bon-appetit-your-majesty-review-yoona-lee-chae-min-royal-kitchen-comedy-netflix-2778224-2025-08-28",
      "headline": "Bon Appetit review: YoonA, Lee Chae-min's Kdrama is messy but flavourfulRelease Date:Sun Aug 24, 2025Bon Appetit, Your Majesty series review: Netflix's 'Bon Appetit, Your Majesty' follows a French chef transported to the Joseon dynasty. The show blends cooking, comedy, and time-travel but struggles with effects and pacing."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pm-modi-departs-japan-china-strengthen-strategic-economic-ties-glbs-2778439-2025-08-28",
      "headline": "Quad, AI, semi-conductors: PM Modi's jam-packed schedule in Japan Live UpdatesThe two sides will go beyond signing MoUs, with Prime Minister Modi and his Japanese counterpart expected to deliberate on the prevailing geopolitical and geo-economic landscape amid US President Donald Trump's ongoing trade war, Indian envoy to Japan Sibi George said."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/cloudburst-in-uttarakhands-rudraprayag-and-chamoli-districts-families-trapped-under-debris-2778483-2025-08-29",
      "headline": "Cloudburst in Uttarakhand's Rudraprayag, Chamoli; families trapped under debrisA cloudburst in Uttarakhand's Rudraprayag and Chamoli districts triggered flash floods, collapsing houses and bridges, leaving families trapped and livestock buried. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/justice-lokur-supreme-court-bowing-down-to-centre-judge-murlidhar-transfer-collegium-2778488-2025-08-29",
      "headline": "Ex-judges call out top court for 'bowing down' to Centre: Allowing to be dominatedJustice Lokur's book reveals the Centre repeatedly pressed to transfer Justice Muralidhar from Delhi High Court after he pulled up Delhi Police over hate speech cases during the 2020 Delhi riots. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/diamond-league-final-neeraj-chopra-second-julain-weber-91m-wins-2778447-2025-08-29",
      "headline": "Diamond League Final: Neeraj extends 4-year streak, but red-hot Weber wins crownNeeraj Chopra salvaged second place in Zurich with a last-throw effort, but Julian Weber's dominance left the Indian ace chasing shadows. With the World Championships looming, the stage is set for a high-voltage showdown next month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/modi-war-trump-delulu-peter-navarro-russian-oil-remark-india-china-tariff-2778228-2025-08-28",
      "headline": "Modi's war is Trump's deluluPeter Navarro, once an economist, now parrots Donald Trump's whims, absurdly blaming India for Russia's war over discounted oil purchases. India's crime isn't war, but survival by securing energy for its millions. And Trump's tariff madness isn't strategy, but delulu."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-day-5-live-tennis-score-iga-swiatek-jannik-sinner-zverev-coco-gauff-2778346-2025-08-28",
      "headline": "Day 5 Live Score: Altmaier tests Tsitsipas, De Minaur eases into Round 3US Open 2025 Day 5 live: Coco Gauff and Alexander Zverev win second round. Jannik Sinner moves to Round 3, beating Alexei Popyrin 6-3, 6-2, 6-2. Naomi Osaka defeated Hailey Baptiste 6-3, 6-1. Iga Swiatek moves to Round 3. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/india-not-profiting-russian-oil-energy-analyst-slams-trump-adviser-peter-navarro-glbs-2778476-2025-08-29",
      "headline": "Energy expert slams Trump aide Peter Navarro: India not profiting from Russian oilAnas Alhajji's remarks came in response to White House trade adviser Peter Navarro, who accused India of running a \"profiteering scheme\" by using discounted Russian crude to sell refined products abroad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/bengaluru-techie-death-shilpa-found-hanging-home-family-alleges-dowry-harassment-2778434-2025-08-28",
      "headline": "Pregnant Bengaluru techie found hanging at home, family alleges dowry harassmentThe victim, Shilpa, who had previously worked with IT giant Infosys, had been married to Praveen for about two-and-a-half years. The couple has a one-and-a-half-year-old child."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/mood-of-the-nation/story/pm-modis-popularity-plateaus-drop-for-nda-suggests-mood-of-the-nation-2778351-2025-08-28",
      "headline": "PM Modi's popularity remains, drop for NDA, suggests Mood of the NationPrime Minister Narendra Modi remains the most popular leader, although his government's performance witnessed a 10 per cent drop in the past six months, as per the August 2025 Mood of the Nation (MOTN) survey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pilot-dies-as-f-16-fighter-jet-crashes-at-poland-airshow-rehearsal-glbs-2778450-2025-08-29",
      "headline": "Video: F-16 fighter jet crashes in Poland during airshow rehearsal, pilot killedA Polish F-16 crashed during airshow practice in Radom, killing its pilot. The accident damaged the runway, forcing cancellation of the August 30-31 Radom Airshow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/never-said-i-will-retire-or-someone-should-retire-mohan-bhagwats-u-turn-on-retirement-at-75-rule-2778337-2025-08-28",
      "headline": "Never said I or someone should retire: Mohan Bhagwat's U-turn on 75-limit remarkMohan Bhagwat claimed that he never said that he would retire or someone else should retire. He said that the volunteers of the RSS do whatever they are asked to do by the organisation, irrespective of their age."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/losses-layoffs-looming-how-indian-jewellery-sector-could-loosen-trump-tariff-stranglehold-2778256-2025-08-28",
      "headline": "Losses, layoffs looming, how Indian jewellery sector could loosen Trump tariff strangleholdCould India leverage the free trade agreements with countries such as UAE, Australia and Japan to open up fresh opportunities for its gems and jewellery industry?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/asia-cup-hockey-2025-india-world-cup-qualification-rajgir-2778432-2025-08-29",
      "headline": "India chase World Cup ticket as Rajgir ready for hockey's grand returnHockey returns to Rajgir once again as India look to use most of their last chance and secure their spot at next year's World Cup by winning the Asia Cup 2025. India, despite their Asian dominance, will be wary of the threat posed by the other sides. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pahalgam-attack-terrorists-chose-baisaran-valley-as-it-was-deserted-say-nia-sources-2778423-2025-08-28",
      "headline": "Pahalgam attackers chose Baisaran Valley as it was deserted: NIA sourcesOn April 22, three terrorists of The Resistance Force (TRF) stormed the Baisaran Valley in Pahalgam and gunned down 25 tourists and one local."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/story/mood-of-the-nation-august-2025-survey-tamil-nadu-elections-dmk-nda-vijay-factor-2778353-2025-08-28",
      "headline": "Vijay may end up helping DMK, hurting NDA in Tamil Nadu, shows MOTN surveyThe DMK-led alliance still calls the shots, despite facing anti-incumbency, with the Mood of the Nation August 2025 survey predicting it to win 36 of the state's 39 seats."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-not-allowing-600000-chinese-students-white-house-clarifies-after-backlash-glbs-2778472-2025-08-29",
      "headline": "Trump not allowing 600,000 Chinese students, White House clarifies after backlashTrump's plan to allow Chinese student visas to be issued drew strong criticism as conservatives interpreted his comments as a signal to increase visa allocations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranveer-singh-deepika-padukone-ganpati-celebrations-ambani-antilia-2778480-2025-08-29",
      "headline": "Ranveer Singh lights up Ganpati bash as he dances to Deva Shree Ganesha songRanveer Singh danced to 'Deva Shree Ganesha' song at the Ganpati festivities at Ambani residence, Antilia. Deepika Padukone accompanied him to the event."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/zuckerberg-lobbied-trump-digital-service-taxes-eu-tariff-showdown-report-glbs-2778461-2025-08-29",
      "headline": "Zuckerberg lobbied Trump on digital service taxes before EU tariff showdown: ReportAs per the report, the Facebook co-founder and the US President discussed digital service taxes, which are levies imposed on revenues that technology companies generate from users in specific countries."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/air-turbulence-aviation-climate-change-global-warming-aviation-united-kingdom-study-reading-university-2778273-2025-08-28",
      "headline": "Air turbulence to worsen due to climate change, affecting air travel: StudyThe study used 26 global climate models to study how warming temperatures affect jet streams at typical aircraft cruising altitudes, something around 35,000 feet or 10 kilometres."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-today-mood-of-the-nation-rahul-gandhi-best-suited-to-lead-opposition-finds-survey-2778386-2025-08-28",
      "headline": "Rahul Gandhi best suited to lead Opposition, says India Today MOTN surveyMamata Banerjee, Akhilesh Yadav, Arvind Kejriwal and Priyanka Gandhi were also among people's choices, but behind Rahul Gandhi to lead the opposition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/taylor-swift-georgina-rodriguez-big-rocks-rings-jewellery-trend-2778058-2025-08-28",
      "headline": "Big rocks, bigger statements: The rise of supersized engagement ringsJust as everyone was still swooning over Georgina Rodriguez's stunning engagement ring, Taylor Swift treated us to her dreamy proposal photos, giving us yet another supersized ring to admire. Oversized rings have officially become the hottest trend."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/minneapolis-shooting-gunman-fired-116-rounds-driven-by-hate-police-say-glbs-2778464-2025-08-29",
      "headline": "Minneapolis shooting: Gunman fired 116 rounds, driven by hate, police sayA 23-year-old former student fired 116 rounds into a Minneapolis church during children's Mass, killing two kids and injuring 18 others. Police say he left behind hateful writings and died by suicide.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/europe-floats-40-km-buffer-zone-between-ukraine-russia-in-push-for-peace-report-glbs-2778469-2025-08-29",
      "headline": "Europe floats 40 km buffer zone between Russia-Ukraine in push for peace: ReportThe very idea of cordoning off a stretch of Ukrainian land to enforce a tentative peace also points at NATO allies' growing frustration as the conflict drags into its fourth year. Meanwhile, Russian President Vladimir Putin shows no sign of slowing his offensive."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indigo-gets-another-six-month-extension-to-lease-turkish-airlines-planes-glbs-2778448-2025-08-29",
      "headline": "IndiGo gets another six-month extension to lease Turkish Airlines planesThe extension will help IndiGo cut losses caused by geopolitical restrictions, the airline said, referring to an airspace ban imposed by Pakistan on Indian airlines earlier this year that has led to longer routes and higher costs."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/asia-cup-hockey-2025-india-world-cup-qualification-rajgir-2778432-2025-08-29",
      "headline": "India chase World Cup ticket as Rajgir ready for hockey's grand returnHockey returns to Rajgir once again as India look to use most of their last chance and secure their spot at next year's World Cup by winning the Asia Cup 2025. India, despite their Asian dominance, will be wary of the threat posed by the other sides. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-argentina-last-world-cup-qualifier-farewell-retirement-2778457-2025-08-29",
      "headline": "Lionel Messi hints at emotional home farewell in September World Cup qualifierLionel Messi has hinted that Argentina's World Cup qualifier against Venezuela on September 4 in Buenos Aires could be his final home game, signaling the approaching end of a legendary international career fans hoped would never close."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2025-jannik-sinner-beats-alex-popyrin-iga-swiatek-naomi-osaka-2nd-round-2778456-2025-08-29",
      "headline": "Jannik Sinner breezes past Alex Popyrin, Iga Swiatek takes down LamensDefending champion Jannik Sinner dominates Alex Popyrin in straight sets to reach the US Open third round. Iga Swiatek and Naomi Osaka also advance, setting up high-stakes clashes as the tournament heads into its second week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-champions-league-draw-paris-saint-germain-real-marid-liverpool-full-match-list-2778453-2025-08-29",
      "headline": "PSG handed toughest Champions League draw, Real Madrid and Liverpool face tough testThe 2025/26 UEFA Champions League draw pits PSG against Bayern, Chelsea, Arsenal, and more in a tough group, while Bayern face Chelsea and PSG. Real Madrid take on Manchester City, Liverpool, Juventus, and other heavyweights, promising a thrilling season opener."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/bwf-world-championships-2778446-2025-08-29",
      "headline": "Satwik and Chirag storm into quarters on dream day for Indian shuttlersBWF World Championships: Satwiksairaj Rankireddy and Chirag Shetty outclassed higher-ranked Liang Wei Keng and Wang Chang of China 19-21, 21-15, 21-17 to book a place in the quarterfinals. Earlier in the day, PV Sindhu and the mixed doubles duo of Dhruv Kapila and Tanisha Crasto also made it to the last-eight in Paris. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/diamond-league-final-neeraj-chopra-second-julain-weber-91m-wins-2778447-2025-08-29",
      "headline": "Diamond League Final: Neeraj extends 4-year streak, but red-hot Weber wins crownNeeraj Chopra salvaged second place in Zurich with a last-throw effort, but Julian Weber's dominance left the Indian ace chasing shadows. With the World Championships looming, the stage is set for a high-voltage showdown next month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/danish-malewar-duleep-trophy-central-zone-vidharbha-ranji-trophy-stats-2778409-2025-08-28",
      "headline": "Who is Danish Malewar? 21-year-old Vidarbha star continues to shine in Duleep TrophyDanish Malewar's unbeaten 198 on Duleep Trophy debut continues his meteoric rise in Indian domestic cricket. From Vidarbha's Ranji hero to Central Zone's mainstay, the 21-year-old is fast emerging as a serious contender for India's Test batting future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/diamond-league-final-zurich-live-updates-neeraj-chopra-javelin-julian-weber-2778402-2025-08-28",
      "headline": "Diamond League Highlights: Julian Weber wins with 91.51m throw, Neeraj Chopra finishes 2ndDiamond League Final Highlights: Julian Weber took the win with a world lead throw of 91.37m on his very first chance, and bested it with a 91.51m in his second. Meanwhile, Neeraj is scraped the 2nd position with his final throw, resulting in 85.01m."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/d-gukesh-vishwanathan-anand-advice-world-championship-2024-ding-liren-2778356-2025-08-28",
      "headline": "Gukesh reveals mentor's advice which inspired his historic World Championship runGukesh Dommaraju admitted that overconfidence cost him the opening game of his World Championship run. But a pep talk from Viswanathan Anand and a timely mental reset helped the teenager bounce back, leading to his historic title in Singapore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-day-5-live-tennis-score-iga-swiatek-jannik-sinner-zverev-coco-gauff-2778346-2025-08-28",
      "headline": "Day 5 Live Score: Altmaier tests Tsitsipas, De Minaur eases into Round 3US Open 2025 Day 5 live: Coco Gauff and Alexander Zverev win second round. Jannik Sinner moves to Round 3, beating Alexei Popyrin 6-3, 6-2, 6-2. Naomi Osaka defeated Hailey Baptiste 6-3, 6-1. Iga Swiatek moves to Round 3. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-2025-south-africa-coach-confirms-dane-van-niekerk-wont-feature-despite-retirement-u-turn-2778340-2025-08-28",
      "headline": "South Africa coach confirms Dane van Niekerk won't feature in Women's World CupDane van Niekerk will not feature in South Africa's Women's World Cup 2025 squad despite reversing her retirement. Coach Mandla Mashimbyi confirmed she must work her way back into contention, though she remains in plans for future series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/danish-malewar-duleep-trophy-central-zone-vidharbha-ranji-trophy-stats-2778409-2025-08-28",
      "headline": "Who is Danish Malewar? 21-year-old Vidarbha star continues to shine in Duleep TrophyDanish Malewar's unbeaten 198 on Duleep Trophy debut continues his meteoric rise in Indian domestic cricket. From Vidarbha's Ranji hero to Central Zone's mainstay, the 21-year-old is fast emerging as a serious contender for India's Test batting future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/diamond-league-final-zurich-live-updates-neeraj-chopra-javelin-julian-weber-2778402-2025-08-28",
      "headline": "Diamond League Highlights: Julian Weber wins with 91.51m throw, Neeraj Chopra finishes 2ndDiamond League Final Highlights: Julian Weber took the win with a world lead throw of 91.37m on his very first chance, and bested it with a 91.51m in his second. Meanwhile, Neeraj is scraped the 2nd position with his final throw, resulting in 85.01m."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/d-gukesh-vishwanathan-anand-advice-world-championship-2024-ding-liren-2778356-2025-08-28",
      "headline": "Gukesh reveals mentor's advice which inspired his historic World Championship runGukesh Dommaraju admitted that overconfidence cost him the opening game of his World Championship run. But a pep talk from Viswanathan Anand and a timely mental reset helped the teenager bounce back, leading to his historic title in Singapore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-day-5-live-tennis-score-iga-swiatek-jannik-sinner-zverev-coco-gauff-2778346-2025-08-28",
      "headline": "Day 5 Live Score: Altmaier tests Tsitsipas, De Minaur eases into Round 3US Open 2025 Day 5 live: Coco Gauff and Alexander Zverev win second round. Jannik Sinner moves to Round 3, beating Alexei Popyrin 6-3, 6-2, 6-2. Naomi Osaka defeated Hailey Baptiste 6-3, 6-1. Iga Swiatek moves to Round 3. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-2025-south-africa-coach-confirms-dane-van-niekerk-wont-feature-despite-retirement-u-turn-2778340-2025-08-28",
      "headline": "South Africa coach confirms Dane van Niekerk won't feature in Women's World CupDane van Niekerk will not feature in South Africa's Women's World Cup 2025 squad despite reversing her retirement. Coach Mandla Mashimbyi confirmed she must work her way back into contention, though she remains in plans for future series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cheteshwar-pujara-retirement-virat-kohli-insta-message-reaction-2778313-2025-08-28",
      "headline": "A nice compliment: Pujara on Virat Kohli's Insta message on retirementCheteshwar Pujara has retired from all formats of cricket after a notable 103-Test career. His retirement has sparked warm tributes, especially from Virat Kohli, highlighting Pujara's vital role in the Indian team and his future potential in coaching and broadcasting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/aiff-fsdl-joint-proposal-indian-football-supreme-court-verdict-postponed-2778315-2025-08-28",
      "headline": "ISL gets lifeline as AIFF, FSDL file joint resolution in Supreme Court: ExplainedAIFF and FSDL have submitted a joint proposal to the Supreme Court, outlining the roadmap for Indian football's future. The plan covers the new season kickoff, commercial partner selection, and financial commitments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-asia-cup-team-september-4-arrival-training-2778302-2025-08-28",
      "headline": "Asia Cup: India squad to assemble in Dubai on Sept 4, players to arrive in batchesIndia's 15-member squad will assemble in Dubai on September 4 ahead of the Asia Cup. The staggered arrival plan aims to ease logistics and travel for players from various cities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/duleep-trophy-2025-rajat-patidar-central-zone-century-mohammad-shami-bowling-east-zone-2778284-2025-08-28",
      "headline": "Duleep Trophy: Rajat Patidar hits quickfire ton, Mohammed Shami puts solid shiftRajat Patidar smashed a 96-ball century and Danish Malewar struck an unbeaten 198 to put Central Zone on top against North East Zone in the Duleep Trophy. Mohammed Shami also returned with a wicket for the East Zone against the North Zone."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/bwf-world-championships-pv-sindhu-wang-tanisha-dhruv-kapila-2778248-2025-08-28",
      "headline": "PV Sindhu rediscovers vintage touch, stuns World No. 2 to enter quartersBWF World Championships: PV Sindhu showed glimpses of her vintage attacking game as she decimated World No. 2 Wang Zhi Yi of China 21-17, 21-15. Sindhu is a win away from securing her sixth world meet medal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-cheteshwar-pujara-test-retirement-kris-srikkanth-bcci-2778234-2025-08-28",
      "headline": "Virat Kohli, Rohit and Pujara deserved better send-offs: Srikkanth slams BCCIFormer India chief selector Kris Srikkanth has voiced his disappointment over the manner in which Virat Kohli, Rohit Sharma, and Cheteshwar Pujara bid farewell to Test cricket. He criticised the BCCI for lapses in communication, saying that the lack of proper coordination overshadowed the send-offs of these stalwarts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virender-sehwag-names-abhishek-bumrah-chakravarthy-asia-cup-2778209-2025-08-28",
      "headline": "Asia Cup: Sehwag picks Abhishek, Bumrah and Chakravarthy as India's match-winnersFormer India opener Virendra Sehwag has picked his three game-changers for India in the upcoming Asia Cup 2025. He has picked left-hander Abhishek Sharma, pacer Jasprit Bumrah and mystery spinner Varun Chakaravarthy for the same."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-aakash-chopra-ipl-t20-leagues-2778202-2025-08-28",
      "headline": "Could Ashwin set a trend of Indians skipping IPL for foreign T20s? Aakash Chopra opinesFormer India cricketer Aakash Chopra is of the opinion that Ashwin's IPL retirement decision could pave a new way for other Indian cricketers too. He has said that it is a massive decision from Ashwin's end to let go of a Rs. 9.75 crore contract."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/bwf-world-championships-pv-sindhu-wang-tanisha-dhruv-kapila-2778248-2025-08-28",
      "headline": "PV Sindhu rediscovers vintage touch, stuns World No. 2 to enter quartersBWF World Championships: PV Sindhu showed glimpses of her vintage attacking game as she decimated World No. 2 Wang Zhi Yi of China 21-17, 21-15. Sindhu is a win away from securing her sixth world meet medal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-cheteshwar-pujara-test-retirement-kris-srikkanth-bcci-2778234-2025-08-28",
      "headline": "Virat Kohli, Rohit and Pujara deserved better send-offs: Srikkanth slams BCCIFormer India chief selector Kris Srikkanth has voiced his disappointment over the manner in which Virat Kohli, Rohit Sharma, and Cheteshwar Pujara bid farewell to Test cricket. He criticised the BCCI for lapses in communication, saying that the lack of proper coordination overshadowed the send-offs of these stalwarts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virender-sehwag-names-abhishek-bumrah-chakravarthy-asia-cup-2778209-2025-08-28",
      "headline": "Asia Cup: Sehwag picks Abhishek, Bumrah and Chakravarthy as India's match-winnersFormer India opener Virendra Sehwag has picked his three game-changers for India in the upcoming Asia Cup 2025. He has picked left-hander Abhishek Sharma, pacer Jasprit Bumrah and mystery spinner Varun Chakaravarthy for the same."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-aakash-chopra-ipl-t20-leagues-2778202-2025-08-28",
      "headline": "Could Ashwin set a trend of Indians skipping IPL for foreign T20s? Aakash Chopra opinesFormer India cricketer Aakash Chopra is of the opinion that Ashwin's IPL retirement decision could pave a new way for other Indian cricketers too. He has said that it is a massive decision from Ashwin's end to let go of a Rs. 9.75 crore contract."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-afghanistan-vs-uae-t20i-tri-series-schedule-squads-streaming-2778185-2025-08-28",
      "headline": "UAE T20I tri-series 2025 Live Streaming: Squads, schedule and all you need to knowThe UAE T20I Tri-Series 2025, featuring Pakistan, Afghanistan, and UAE, runs from August 29 to September 7 in Sharjah, serving as key preparation for the Asia Cup 2025. Teams aim to fine-tune strategies and assess combinations ahead of the continental tournament.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aaryavir-sehwag-dpl-debut-aggressive-batting-central-delhi-kings-2778172-2025-08-28",
      "headline": "Watch: Aaryavir Sehwag channels father's flair with boundary blitz in T20 leagueAaryavir Sehwag made a striking debut in the 2025 Delhi Premier League with an aggressive 22-run cameo. The 17-year-old reminded fans of his father's flair with his boundary-hitting blitz."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/duleep-trophy-bcci-india-broadcasting-backlash-reactions-2778163-2025-08-28",
      "headline": "Outrageous: BCCI draws backlash for not broadcasting Duleep Trophy quarterfinalThe BCCI has faced widespread criticism for not broadcasting the 2025 Duleep Trophy quarterfinals. Fans have expressed frustration over the lack of live coverage, with uncertainty still surrounding the semi-finals and final.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/royal-challengers-bangalore-breaks-silence-on-bengaluru-stampede-chinnaswamy-stadium-2778106-2025-08-28",
      "headline": "RCB breaks silence on Bengaluru stampede: We were grievingRoyal Challengers Bangalore (RCB) has ended its silence following the deadly stampede in Bengaluru on the 4th of June. The incident occurred during the team's victory celebrations at Chinnaswamy Stadium. In its first communication on the matter, which came after a period of silence that led to speculation, the franchise issued an emotional appeal to fans. Stating why the organisation had not commented earlier, an official statement said, \"we were grieving.\" RCB also announced a new initiative called 'RCB Cares'. This new program is intended to support people, especially during times of emergency. The team has asked people to wait for more details on the new plan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-shami-dismisses-retirement-rumours-asia-cup-2025-2778138-2025-08-28",
      "headline": "Why do you want me to retire? Shami says fire burning despite selection snubsMohammed Shami has dismissed retirement rumours, reaffirming his commitment to competitive cricket. The 34-year-old fast bowler returned to action for the first time since the IPL 2025, representing East Zone in the Duleep Trophy quarter-final, which began on 28 August."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wanindu-hasaranga-zimbabwe-vs-sri-lanka-t20is-asia-cup-2778127-2025-08-28",
      "headline": "Wanindu Hasaranga out of Zimbabwe T20Is, Sri Lanka face injury scare before Asia CupSri Lanka's Asia Cup preparations have been hit with Wanindu Hasaranga sidelined due to a hamstring injury, ruling him out of the Zimbabwe T20I series. With key fixtures in Harare from August 29 to September 7, the team will rely on youngsters to fill the all-rounder's void.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/duleep-trophy-quarter-finals-captains-dhruv-jurel-abhimanyu-easwaran-miss-matches-2778108-2025-08-28",
      "headline": "Dhruv Jurel, Abhimanyu Easwaran miss Duleep ties with fever and groin injuryCentral Zone captain Dhruv Jurel and East Zone skipper Abhimanyu Easwaran missed the Duleep Trophy quarterfinals, which began on Thursday, due to a fever and a groin niggle, respectively."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/neeraj-chopra-diamond-league-final-zurich-indian-title-world-championship-showdown-2778067-2025-08-28",
      "headline": "Ever-improving Neeraj eyes Diamond Trophy before World Championship showdownIndia's javelin ace Neeraj Chopra returns to the Diamond League Final in Zurich, chasing a second Diamond Trophy. With Julian Weber and Anderson Peters in the fray, the meet serves as the perfect prelude to next month's World Championships."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/englands-batting-line-up-will-be-unbelievable-in-ashes-josh-hazlewood-2778062-2025-08-28",
      "headline": "England's batting line-up will be unbelievable in Ashes: Josh HazlewoodAustralian fast bowler Josh Hazlewood has described the upcoming Ashes series as one of the biggest tests of his career, as he prepares to take on what he calls a strong England batting line-up."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-day-5-schedule-iga-swiatek-jannik-sinner-coco-gauff-2778060-2025-08-28",
      "headline": "US Open 2025, Day 5, Order of Play: Swiatek, Sinner, Gauff aim for Round 3 berthsUS Open 2025: Day 5 promises high-intensity action with top seeds Iga Swiatek, Jannik Sinner, Coco Gauff, and Alexander Zverev headlining the singles schedule. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-inter-miami-leagues-cup-final-win-orlando-city-2778040-2025-08-28",
      "headline": "Lionel Messi powers Inter Miami past Orlando City to Leagues Cup finalLionel Messi delivered another masterclass as Inter Miami stormed into the Leagues Cup final with a 3-1 victory over 10-man Orlando City in Fort Lauderdale on Wednesday night. The Argentine superstar struck twice and provided an assist in a decisive 15-minute spell that turned the semi-final on its head."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-emma-raducanu-carlos-alcaraz-haircut-verdict-2778023-2025-08-28",
      "headline": "Watch: Emma Raducanu gives her verdict on Carlos Alcaraz's special buzzcutEmma Raducanu defended Carlos Alcaraz's new buzzcut at the US Open, saying his confidence makes the style work despite mixed reactions. The Brit also stormed into the third round with a dominant win over Janice Tjen, setting up a clash with Elena Rybakina.\r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}