{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/books/story/success-isnt-about-number-of-followers-in-creator-economy-ankur-mehra-2750781-2025-07-04",
      "headline": "Success isn't about number of followers in creator economy: Ankur MehraIn a conversation with Business Today's Sakshi Batra, Ankur Mehra, author of Pixels to Profits, explains what it really takes to succeed in the creator economy, and why chasing viral fame or follower counts may be the wrong metric altogether."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-192-points-higher-nifty-below-25500-infosys-gains-1-percent-2750774-2025-07-04",
      "headline": "Sensex ends 192 points higher, Nifty below 25,500; Infosys gains 1%Sensex ends 192 points higher, Nifty below 25,500; Infosys gains 1%"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/prada-kolhapuri-chappal-gi-tag-law-protection-indian-articrafts-artisans-reform-global-policy-fashion-2750757-2025-07-04",
      "headline": "India tags it, West sells it. Can Prada's Kolhapuri row lead to real reform?The luxury brand's new \"toe-ring sandal\" has ignited not just cultural outrage but also legal action in India, with a Public Interest Litigation filed in the Bombay High Court."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/where-are-itr-2-and-itr-3-forms-why-they-are-missing-and-what-to-do-income-tax-filing-2750711-2025-07-04",
      "headline": "Where are ITR-2 and ITR-3 forms? Why they're missing and what to doIt's ITR season but many taxpayers can't find the ITR-2 and ITR-3 forms on the Income Tax portal yet. If you have capital gains, foreign income or business income, this delay might worry you. The good news is there's an extended deadline this year. Here's why these forms are missing and what you should do next."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/sbi-credit-card-rules-changing-from-july-15-here-is-what-cardholders-must-know-2750616-2025-07-04",
      "headline": "SBI credit card rules changing from July 15: Here's what cardholders must knowAt present, many cardholders pay only a small part of their bill to avoid late charges. But now, the way the minimum amount due (MAD) is calculated will change starting July 15, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/exclusive-world-bank-poverty-in-india-measurement-metrics-one-in-four-below-minimum-standard-of-living-2750607-2025-07-04",
      "headline": "One in 4 Indians still below minimum standard of living: World BankDespite a sharp drop in extreme poverty, about one in four Indians still falls below the level needed to meet essential needs and maintain a minimum standard of living."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sebi-ban-jane-street-stock-manipulation-bank-nifty-options-futures-shorting-reason-interim-order-2750597-2025-07-04",
      "headline": "Sebi bans Jane Street for stock market manipulation. Here's what went wrongSecurities and Exchange Board of India (Sebi) said the trades executed by the group were \"prima facie fraudulent and manipulative\" and violated the country's capital market regulations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/want-rs-36-lakh-in-5-years-know-who-can-avail-this-government-scheme-national-savings-certificate-nsc-2750564-2025-07-04",
      "headline": "Want Rs 36 lakh in 5 years? Know who can avail this government schemeThis government scheme offers guaranteed returns, so you don't have to worry about market ups and downs. For the current quarter, the interest rate is fixed at 7.7% per year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/soham-parekh-us-startups-multiple-jobs-moonlighting-why-reasons-latest-update-2750540-2025-07-04",
      "headline": "Why did Soham Parekh work multiple jobs? Indian techie shares his reasonsHe confirmed that he worked at several companies simultaneously and misrepresented his location and employment status in the process."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-gathering-dust-in-locker-financial-advisor-explains-how-to-make-it-work-2750539-2025-07-04",
      "headline": "Gold gathering dust in locker? Financial advisor explains how to make it workA financial advisor has warned that family gold stored in lockers faces risk from rust, floods, and poor insurance. He explains how a scheme can offer safety and steady returns instead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epf-nps-can-build-rs-12-crore-retirement-fund-tax-expert-breaks-it-down-2750519-2025-07-04",
      "headline": "EPF, NPS can build Rs 12 crore retirement fund. Tax expert breaks it downFor salaried individuals earning up to Rs 14.65 lakh annually, Bangar believes this combination offers the best of both worlds: zero tax under the new regime and long-term wealth creation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-82-points-higher-nifty-below-25500-bajaj-finance-up-2-percent-2750516-2025-07-04",
      "headline": "Sensex opens 82 points higher, Nifty below 25,500; Bajaj Finance up 2%The S&P BSE Sensex was up 46.97 points to 83,286.44, while the NSE Nifty50 added 14.45 points to 25,419.75 as of 9:22 am. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/boney-kapoor-anxiously-waiting-for-anshula-kapoor-return-post-engagement-2750709-2025-07-04",
      "headline": "Boney Kapoor anxiously waiting for Anshula's return from New York after engagementInfluencer Anshula Kapoor, recently announced her engagement to partner Rohan Thakkar. Her father and film producer Boney Kapoor reacted to the news along with other family members."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thammudu-review-nithiin-action-drama-wild-ambitions-tame-execution-venu-sriram-wasted-opportunity-2750779-2025-07-04",
      "headline": "Thammudu review: Wild ambitions but tamed execution in Nithiin's survival thrillerRelease Date:Fri Jul 04, 2025'Thammudu' movie review: Despite an intriguing premise and a visually rich setting, 'Thammudu' struggles with coherence, emotional depth, and narrative impact. What could have been a gripping one-night survival thriller turns into a long, meandering ride with fleeting moments of brilliance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-concert-in-india-are-we-ready-to-create-history-with-a-bts-concert-army-speaks-2750543-2025-07-04",
      "headline": "Is India ready to create history with a BTS concert? ARMY weighs inIndia's love for BTS is loud, loyal, and impossible to ignore. With HYBE now entering the Indian market, the dream of a BTS concert feels closer than ever. In this week's K-fix, we discuss whether India is ready to host a show of that scale right now. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kareena-kapoor-fangirls-over-brad-pitt-f1-javier-bardem-2750782-2025-07-04",
      "headline": "Kareena Kapoor fangirls over Brad Pitt in F1: Who wants to be 20…Bollywood actor Kareena Kapoor has expressed her admiration for Brad Pitt after watching 'F1', joining fellow star Deepika Padukone in praising the Hollywood icon. The movie, centred around Formula One racing, has garnered positive reviews and strong box office success since its release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amaal-mallik-says-bollywood-doing-to-kartik-aryan-what-it-did-to-sushant-singh-rajput-2750738-2025-07-04",
      "headline": "Bollywood doing to Kartik Aryan what it did to Sushant Singh Rajput: Amaal MallikAmaal Mallik alleged that Bollywood is trying to sideline Kartik Aaryan just like it did with Sushant Singh Rajput. He claimed powerful producers and actors are targeting Kartik, despite his success and strong family support."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/anurag-basu-metro-in-dino-hilarious-mirzapur-crossover-kaleen-bhaiya-guddu-bhaiya-scene-pankaj-tripathi-ali-fazal-2750743-2025-07-04",
      "headline": "Metro In Dino has a hilarious Mirzapur crossover you didn't see comingAnurag Basu has made 'Metro... In Dino' a nuanced narrative. But, the most hilarious scene in the film has nothing to do with its story or character, but with 'Mirzapur' and its iconic Guddu Bhaiya and Kaleen Bhaiya. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/uorfi-javed-on-being-slut-shamed-after-winning-the-traitors-hate-never-stopped-me-2750640-2025-07-04",
      "headline": "Uorfi Javed on being slut-shamed after winning The Traitors: Hate never stopped meA day after winning 'The Traitors', Influencer Uorfi Javed on Friday shared that she is being slut-shamed on social media. She expressed that hate never stopped her and never will. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/dua-lipa-romantic-italian-holiday-with-fiance-callum-turner-2750568-2025-07-04",
      "headline": "Dua Lipa's romantic Italian holiday with fiance Callum TurnerPop star Dua Lipa and her fiance Callum Turner went on a romantic getaway in Italy. Dua shared pictures of the couple on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sarzameen-trailer-prithviraj-sukumaran-ibrahim-ali-khan-tied-between-duty-family-karan-johar-kajol-dharma-productions-2750750-2025-07-04",
      "headline": "Sarzameen trailer: Ibrahim Ali Khan goes rogue against duty-bound father PrithvirajThe trailer of 'Sarzameen' starring Kajol, Prithviraj Sukumaran, and Ibrahim Ali Khan was released on Friday. The film will premiere on JioHotstar on July 25. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/actor-kanwaljit-singh-mocks-air-india-prepares-a-will-before-flying-2750725-2025-07-04",
      "headline": "Actor Kanwaljit Singh mocks Air India, prepares a will before flyingActor Kanwaljit Singh shared a video mocking Air India, saying he had prepared his will before flying with the airline, days after its tragic crash. His remark comes amid a wave of public concern, with other celebrities like Raveena Tandon and Vir Das expressing support for the airline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/jurassic-world-rebirth-review-dinos-suspense-visual-effects-2750673-2025-07-04",
      "headline": "Jurassic World Rebirth review: Dinosaurs, mayhem and visual treat with wobbly plotRelease Date:Fri Jul 04, 2025Jurassic World Rebirth movie review: The film returns with thrilling dinosaurs and suspenseful horror. The film impresses visually but struggles with an uneven plot and character development, says our review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sufi-motiwala-on-struggles-of-being-queer-muslim-asked-chatgpt-if-i-am-haram-2750691-2025-07-04",
      "headline": "Sufi Motiwala on struggles of being queer Muslim: Asked ChatGPT if I am haramSufi Motiwala, a practising Muslim and queer content creator, shared his journey of reconciling faith and sexuality in a society that often challenges both. He emphasised finding peace through a personal connection with God and urged the LGBTQ+ community to focus on meaningful activism beyond stereotypes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-refused-kuberaa-dhanush-sekhar-kammula-2750690-2025-07-04",
      "headline": "Vijay Deverakonda refused the opportunity to act in Kuberaa. Here's whyDhanush and Nagarjuna's 'Kuberaa', directed by Sekhar Kammula, is performing well in theatres. Before Dhanush, director Sekhar Kammula offered the role to Vijay Deverakonda."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kaanta-laga-makers-dismiss-sequel-reports-after-shefali-jariwala-death-2750656-2025-07-04",
      "headline": "We're retiring Kaanta Laga: Makers dismiss sequel reports after Shefali's death'Kaanta Laga' makers Radhika Rao and Vinay Sapru reacted to reports of the song's sequel after Shefali Jariwala's death. The duo, in a heartfelt post, wrote how they are retiring the song forever. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/twins-chinki-minki-surabhi-and-samriddhi-announce-professional-split-fans-react-2750589-2025-07-04",
      "headline": "Twins Chinki-Minki, Surabhi and Samriddhi, announce professional split. Fans reactPopularly known as 'Chinki-Minki', influencer duo Surabhi and Samriddhi Mehra shared that they have decided to part ways professionally. They announced their decision on Instagram. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aryan-khan-visits-dubbing-studio-with-heavy-security-ahead-of-the-bads-of-bollywood-2750583-2025-07-04",
      "headline": "Aryan Khan visits dubbing studio with heavy security ahead of The Bads of BollywoodAryan Khan, son of Shah Rukh Khan, was seen arriving at a dubbing studio with heavy security as work continues on his directorial debut, 'The Bads of Bollywood'. The series will premiere on Netflix this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/actor-mahhi-vij-reacts-to-separation-rumours-with-jay-bhanushali-2750643-2025-07-04",
      "headline": "Actor Mahhi Vij reacts to separation rumours with Jay Bhanushali: Why should I tellMahhi Vij addressed rumours about her divorce with Jay Bhanushali, saying she doesn't owe anyone an explanation about her personal life. She slammed online speculation and urged people to \"live and let live.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/janani-vs-state-of-kerala-director-pravin-narayanan-censor-board-title-change-demand-2750615-2025-07-04",
      "headline": "Difficult to change title: Janaki vs State of Kerala director on board's demandDirector Pravin Narayanan of 'Janaki vs State of Kerala' said that the censor board should look at a different perspective after the demand to change the film's title. The board wanted the makers to change 'Janaki' citing religious concerns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranveer-singh-cant-keep-calm-as-wife-deepika-padukone-gets-walk-of-fame-achievement-2750634-2025-07-04",
      "headline": "Ranveer Singh beams with pride as queen Deepika Padukone gets Walk of Fame honourDeepika Padukone has made history as the first Indian actor to receive a star on the Hollywood Walk of Fame, marking a proud moment for Indian cinema. Ranveer Singh expressed his heartfelt pride and support."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-india-express-forged-records-on-airbus-engine-fixes-report-2750798-2025-07-04",
      "headline": "Air India Express forged records on Airbus engine fixes: ReportAir India Express, in a statement, said that it had acknowledged the lapse to the Indian regulator and implemented \"remedial action and preventive measures.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/dk-shivakumar-neither-confirms-nor-denies-ambition-to-become-karnataka-cm-says-wills-follow-high-command-decision-2750799-2025-07-04",
      "headline": "Kabhi haan, kabhi naa: DK Shivakumar plays coy on chief ministerial ambitionAs Karnataka simmers with speculation over leadership change, Deputy Chief Minister DK Shivakumar walks a careful line, publicly pledging loyalty while neither confirming nor ruling out his ambition to take on the Chief Minister's chair. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-china-pakistan-updates-important-vectors-india-dgmo-talks-deputy-chief-of-army-staff-rahul-singh-2750708-2025-07-04",
      "headline": "China gave Pak live inputs on our vectors during Op Sindoor: Top Army generalTop Army general Rahul Singh said that during Operation Sindoor, India tackled a double whammy at the border, as Pakistan received real-time inputs of New Delhi's important vectors from China."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-live-score-2nd-test-day-3-updates-edgbaston-2750751-2025-07-04",
      "headline": "2nd Test, Day 3 Live: Brook, Smith counterattack after Siraj's twin strikesEngland (ENG) vs India (IND), 2nd Test Day Live Updates: Harry Brook brought up a solid fifty to steer England past the 130-run mark, steadying the innings after Mohammed Siraj's fiery burst in the second over of Day 3 that saw the quick dismissal of Joe Root and Ben Stokes. Jamie Smith also brought up his fifth half-century as he took on Prasidh Krishna.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/how-dalai-lama-successor-tibetan-buddhism-news-1959-secret-escape-china-assam-rifles-welcome-2750578-2025-07-04",
      "headline": "Dalai, dance and disguise: How Tibetan leader hoodwinked China, fled to IndiaIt was a Great Escape in 1959 from Lhasa's Norbulingka Palace, the summer seat of the Dalai Lama, the head of Tibetan Buddhism. Then just 23, the Dalai Lama had no option but to flee Tibet after it became clear that an invitation to a dance event was communist China's bid to imprison him. Disguised as a soldier, he hoodwinked Chinese soldiers and entered India after a gruelling two-week trek."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/allahabad-high-court-rejects-hindu-sides-plea-to-declare-shahi-idgah-a-disputed-structure-2750740-2025-07-04",
      "headline": "High Court rejects plea to declare Mathura Shahi Idgah mosque disputed structureThe Allahabad High Court has dismissed a petition filed by the Hindu side seeking to declare the Shahi Masjid as a disputed structure. The petition was a part of the Shri Krishna Janmabhoomi case in Mathura."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/rahul-gandhi-photo-sanitary-pad-boxes-distributed-women-bihar-elections-congress-2750727-2025-07-04",
      "headline": "Congress's 'Padman' strategy with Rahul Gandhi's photo stirs row in BiharThe initiative is part of the Congress's broader women-centric outreach ahead of the Bihar Assembly election."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/defence-proposals-army-navy-air-force-one-lakh-crore-cleared-operation-sindoor-2750752-2025-07-04",
      "headline": "In big boost after Op Sindoor, defence proposals worth Rs 1 lakh crore get nodThe Defence Acquisition Council (DAC), in its first meeting after India's Operation Sindoor, cleared 10 proposals to acquire military hardware worth Rs 1.05 lakh crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/books/story/success-isnt-about-number-of-followers-in-creator-economy-ankur-mehra-2750781-2025-07-04",
      "headline": "Success isn't about number of followers in creator economy: Ankur MehraIn a conversation with Business Today's Sakshi Batra, Ankur Mehra, author of Pixels to Profits, explains what it really takes to succeed in the creator economy, and why chasing viral fame or follower counts may be the wrong metric altogether."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-live-score-day-5-results-carlos-alcaraz-sabalenka-raducanu-2750747-2025-07-04",
      "headline": "Day 5 Live: Alcaraz in focus as tournament mourns for Diogo JotaWimbledon 2025 Day 5 Live Score and Updates: The sporting world is still recovering from the untimely death of Diogo Jota. The All England Lawn Tennis Association has decided to break its 148-year-old dress code."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/dalai-lama-succession-plan-china-warns-india-against-interference-through-actions-words-2750789-2025-07-04",
      "headline": "China urges India to 'act cautiously' amid row over Dalai Lama's successor planChinese Foreign Ministry spokesperson Mao Ning said that India should exercise caution in its words and actions, stop interfering in China's internal affairs with Xizang-related issues and avoid impact on the improvement and development of the China-India relationship. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/actor-vijay-named-tvks-cm-candidate-to-tour-tamil-nadu-before-2026-elections-tamilaga-vettri-kazhagam-slams-centre-on-farmers-rights-katchatheevu-and-keezhadi-2750724-2025-07-04",
      "headline": "Vijay to be TVK's chief ministerial face for 2026 polls, says no alliance with BJPActor Vijay was declared Tamilaga Vettri Kazhagam's chief ministerial candidate for the 2026 Tamil Nadu assembly elections. He will tour the state between September and December. Vijay ruled out alliance with the BJP and DMK, whom he called 'ideological enemies'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/anurag-basu-metro-in-dino-hilarious-mirzapur-crossover-kaleen-bhaiya-guddu-bhaiya-scene-pankaj-tripathi-ali-fazal-2750743-2025-07-04",
      "headline": "Metro In Dino has a hilarious Mirzapur crossover you didn't see comingAnurag Basu has made 'Metro... In Dino' a nuanced narrative. But, the most hilarious scene in the film has nothing to do with its story or character, but with 'Mirzapur' and its iconic Guddu Bhaiya and Kaleen Bhaiya. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/taking-a-class-from-space-astronaut-shubhanshu-shukla-speaks-to-students-from-iss-2750763-2025-07-04",
      "headline": "Shux tells Indian students about living in space, shares inspiring detailsThe session, part of Isro's Vidyarthi Samvad Programme, brought space science directly into classrooms, sparking awe, curiosity, and a renewed sense of national pride among students."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/school-boy-critically-injured-after-bmtc-bus-hits-him-in-anekal-bengaluru-2750770-2025-07-04",
      "headline": "BMTC bus hits school boy trying to cross road, leaves him critically injuredA boy was critically injured in Bengaluru Urban district after being struck by a BMTC bus while crossing the road to board his school bus. Locals blame drivers of both buses for negligence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/plea-against-prada-for-copying-kolhapuri-chappals-design-in-latest-summer-collection-bombay-high-court-2750754-2025-07-04",
      "headline": "Say sorry, pay money: Plea against Prada for copying Kolhapuri chappal designThe plea seeks court to issue direction to Prada Group and Prada India Fashion Private Limited to issue a public apology, acknowledging the unauthorised use of the \"Kolhapuri Chappal\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/vidit-gujrathi-vs-liverdoc-x-debate-ayurveda-modern-medicine-2750635-2025-07-04",
      "headline": "Chess star Vidit Gujrathi calls out LiverDoc for insulting his familyIndian chess grandmaster Vidit Gujrathi engaged in a heated online dispute with X user LiverDoc over his family's medical qualifications."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tn-dmk-minister-mimics-sanskrit-chanting-criticises-rs-2500-crore-centres-grant-for-sanksrit-2750647-2025-07-04",
      "headline": "Tamil Nadu Minister mocks Sanskrit ritual chants: Who the hell understands itTamil Nadu DMK Minister EV Velu sparked debate by mocking Sanskrit chants during rituals and questioned the understanding of the language. He also criticised the Union government's Rs 2,500 crore allocation for Sanskrit development while Tamil received just Rs 167 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/jurassic-world-rebirth-review-dinos-suspense-visual-effects-2750673-2025-07-04",
      "headline": "Jurassic World Rebirth review: Dinosaurs, mayhem and visual treat with wobbly plotRelease Date:Fri Jul 04, 2025Jurassic World Rebirth movie review: The film returns with thrilling dinosaurs and suspenseful horror. The film impresses visually but struggles with an uneven plot and character development, says our review."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/air-india-ahmedabad-crash-compensation-form-financial-details-passengers-2750649-2025-07-04",
      "headline": "India Today accesses Air India's crash compensation form amid coercion chargeA controversy has erupted over allegations by families of the Ahmedabad plane crash victims that they were pressured to make financial disclosures. Air India has denied the charges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/food/story/labubu-inspired-food-has-hit-mumbai-two-restaurants-are-now-serving-it-2750203-2025-07-04",
      "headline": "Labubu-inspired food has hit Mumbai. Two restaurants are now serving itPlanning to buy a Labubu? People in Mumbai may have a chance to get their hands on the viral doll by just dining at these two restaurants."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/indian-techie-soham-parekh-india-pakistan-war-operation-sindoor-manipulated-startup-arkadiy-telegin-moonlighting-2750626-2025-07-04",
      "headline": "Indian techie faked drone strike during Op Sindoor to shirk work, claims ex-bossA US-based startup co-founder claimed that Indian techie Soham Parekh, who admitted to moonlighting at multiple startups, emotionally manipulated him by using the India-Pakistan military conflict during Operation Sindoor. The co-founder claimed that Parekh \"guilt-tripped\" him by faking his presence in a conflict zone."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/metro-in-dino-movie-review-anurag-basu-film-is-like-the-beauty-of-the-first-monsoon-rain-pankaj-tripathi-konkona-sara-ali-khan-neena-gupta-aditya-roy-kapur-2750534-2025-07-04",
      "headline": "Metro In Dino review: Anurag Basu's film is like beauty of the first monsoon rainRelease Date:Fri Jul 04, 2025Metro In Dino movie review: Anurag Basu's 'Metro... In Dino' is a gentle reminder of how love seeps into everyday life, much like the first rain of the season. It's an anthology set in Indian metros, where characters feel heart-warmingly real. Basu creates a symphony of romance, regret, and rediscovery. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/it-is-true-soham-parekh-admits-working-multiple-full-time-jobs-at-once-says-it-was-necessary-2750525-2025-07-04",
      "headline": "Not proud but had to do it: Soham Parekh admits to working multiple jobs at onceIndia-based software engineer Soham Parekh has publicly admitted to simultaneously working full-time for multiple startups, in a disclosure that has reignited debates around remote work norms and ethics in the tech industry."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/president-donald-trump-ufc-event-in-white-house-dana-white-2750796-2025-07-04",
      "headline": "President Trump eyes UFC event at White House for USA's 250th anniversaryThe President of the United States of America, Donald Trump, has suggested the idea of holding a UFC event within the premises of the White House to celebrate the country's 250th anniversary. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/f1-british-gp-preview-lewis-hamilton-max-verstappen-2750786-2025-07-04",
      "headline": "F1 Returns to its Birthplace: All eyes on Silverstone for British Grand PrixFormula One returns to its roots  from July 4th to July 6th as the British Grand Prix takes centre stage at Silverstone, the birthplace of the F1 World Championship, which began here 75 years ago."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-live-score-2nd-test-day-3-updates-edgbaston-2750751-2025-07-04",
      "headline": "2nd Test, Day 3 Live: Brook, Smith counterattack after Siraj's twin strikesEngland (ENG) vs India (IND), 2nd Test Day Live Updates: Harry Brook brought up a solid fifty to steer England past the 130-run mark, steadying the innings after Mohammed Siraj's fiery burst in the second over of Day 3 that saw the quick dismissal of Joe Root and Ben Stokes.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/nico-williams-renews-athletic-bilbao-amidst-barcelona-rumours-2750748-2025-07-04",
      "headline": "Nico stays at Athletic Bilbao amid Barcelona talks, signs till 2035Nico Williams has extended his contract with Athletic Bilbao. The Spanish winger has put pen to paper on a new deal which will see him contracted for the club till 2035. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-live-score-day-5-results-carlos-alcaraz-sabalenka-raducanu-2750747-2025-07-04",
      "headline": "Day 5 Live: Alcaraz in focus as tournament mourns for Diogo JotaWimbledon 2025 Day 5 Live Score and Updates: The sporting world is still recovering from the untimely death of Diogo Jota. The All England Lawn Tennis Association has decided to break its 148-year-old dress code."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pakistan-squash-championship-mehwish-ali-flashes-middle-finger-after-defeat-2750721-2025-07-04",
      "headline": "Watch: Mehwish Ali flashes middle finger after loss at Squash ChampionshipA Pakistani squash player was seen flashing the middle finger following her defeat in the round of 16 stages of the 32nd Asian Junior Individual Championships in South Korea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-break-all-white-dress-code-diogo-jota-car-crash-2750706-2025-07-04",
      "headline": "Wimbledon set to break 148-year-old dress code rule in memory of Diogo JotaWimbledon will allow players to wear black armbands in tribute to Diogo Jota, reported AP on Friday. This marks the first time the tournament breaks its all-white dress code amid mourning for the late footballer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/alex-carey-beau-webster-rescue-australia-against-west-indies-brisbane-test-2750577-2025-07-04",
      "headline": "2nd Test: Webster, Carey put in yet another rescue act in GrenedaAlex Carey and Beau Webster staged a vital rescue for Australia after a top-order collapse. Their partnership helped stabilise the innings amid a fierce West Indies pace attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/vidit-gujrathi-vs-liverdoc-x-debate-ayurveda-modern-medicine-2750635-2025-07-04",
      "headline": "Chess star Vidit Gujrathi calls out LiverDoc for insulting his familyIndian chess grandmaster Vidit Gujrathi engaged in a heated online dispute with X user LiverDoc over his family's medical qualifications."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/eng-vs-ind-akash-deep-birmingham-edgbaston-test-ben-duckett-ollie-pope-wickets-2750611-2025-07-04",
      "headline": "Courageous Akash Deep comes back to give England another mini scareENG vs IND: Akash Deep struck crucial early blows, removing Ben Duckett and Ollie Pope to leave England reeling after India posted a commanding 587 in their first innings at Edgbaston, having been asked to bat first."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pakistan-squash-championship-mehwish-ali-flashes-middle-finger-after-defeat-2750721-2025-07-04",
      "headline": "Watch: Mehwish Ali flashes middle finger after loss at Squash ChampionshipA Pakistani squash player was seen flashing the middle finger following her defeat in the round of 16 stages of the 32nd Asian Junior Individual Championships in South Korea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-break-all-white-dress-code-diogo-jota-car-crash-2750706-2025-07-04",
      "headline": "Wimbledon set to break 148-year-old dress code rule in memory of Diogo JotaWimbledon will allow players to wear black armbands in tribute to Diogo Jota, reported AP on Friday. This marks the first time the tournament breaks its all-white dress code amid mourning for the late footballer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/alex-carey-beau-webster-rescue-australia-against-west-indies-brisbane-test-2750577-2025-07-04",
      "headline": "2nd Test: Webster, Carey put in yet another rescue act in GrenedaAlex Carey and Beau Webster staged a vital rescue for Australia after a top-order collapse. Their partnership helped stabilise the innings amid a fierce West Indies pace attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/vidit-gujrathi-vs-liverdoc-x-debate-ayurveda-modern-medicine-2750635-2025-07-04",
      "headline": "Chess star Vidit Gujrathi calls out LiverDoc for insulting his familyIndian chess grandmaster Vidit Gujrathi engaged in a heated online dispute with X user LiverDoc over his family's medical qualifications."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/eng-vs-ind-akash-deep-birmingham-edgbaston-test-ben-duckett-ollie-pope-wickets-2750611-2025-07-04",
      "headline": "Courageous Akash Deep comes back to give England another mini scareENG vs IND: Akash Deep struck crucial early blows, removing Ben Duckett and Ollie Pope to leave England reeling after India posted a commanding 587 in their first innings at Edgbaston, having been asked to bat first."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}