{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/less-than-40-percent-itrs-processed-as-government-pushes-deadline-to-september-15-2774766-2025-08-21",
      "headline": "Less than 40% ITRs processed as government pushes deadline to September 15The Finance Ministry has pushed the ITR deadline to 15 September citing extensive changes in forms and utilities. But three months in, processing is still crawling at under 40%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-143-points-higher-nifty-above-25000-pharma-stocks-gain-2774715-2025-08-21",
      "headline": "Sensex, Nifty gain for 6th straight session on GST reforms optimismThe S&P BSE Sensex was up 142.87 points to 82,000.71 at the closing bell, while the NSE Nifty50 rose 33.20 points to settle at 25,083.75. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/group-of-ministers-on-gst-approves-scrapping-of-12-28-slabs-2774697-2025-08-21",
      "headline": "Key panel okays scrapping of 12%, 28% GST slabs; 90% goods may get cheaperIn a key meeting held on Thursday, the panel of state ministers accepted the Centre's plan to reduce the four-rate system to two main slabs of 5% and 18%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-can-retirees-stay-safe-from-risky-too-good-to-be-true-schemes-safe-investments-for-retirees-2774609-2025-08-21",
      "headline": "How can retirees stay safe from risky 'too good to be true' schemes?Many retirees fall prey to schemes that seem too good to be true, chasing high returns without understanding the risks. Protecting your savings requires caution, awareness, and smart investment choices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gst-cut-zero-percent-insurance-premium-costly-cheap-input-tax-credit-policyholders-personal-finance-2774569-2025-08-21",
      "headline": "Why zero GST on insurance premiums doesn't mean cheaper policies for youOn the surface, removing GST on insurance premiums seems like a big relief, but experts caution that the outcome may not be what many are expecting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/pf-claims-how-to-select-right-epfo-form-for-withdrawal-pension-or-transfer-2774560-2025-08-21",
      "headline": "EPFO withdrawal, pension or transfer: How to choose the right PF formEPFO members often get confused about which form to fill for withdrawals, transfers, or pension claims. Using the right form not only saves time but also avoids delays or rejection of your application."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/80-percent-of-emergency-funds-dont-work-when-needed-ca-explains-why-2774526-2025-08-21",
      "headline": "CA explains why 80% of emergency funds don't work when neededMost people believe they are financially prepared for tough times, but when a real crisis hits, their so-called emergency funds often fall short. A chartered accountant explains why this happens and how to fix it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/online-gaming-bill-2025-fine-penalty-explained-lok-sabha-betting-apps-money-based-2774515-2025-08-21",
      "headline": "Online Gaming Bill 2025: What are the different penalties in it?The Bill, which was passed in the Lok Sabha soon after it was introduced, focusses on reducing risks linked to addiction, money laundering, and misleading advertising."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gst-on-life-and-health-insurance-may-soon-be-exempt-what-it-means-for-you-2774508-2025-08-21",
      "headline": "No GST on life, health insurance premiums soon? Here's what it means for youA proposal has been made to exempt premiums for life and health insurance from Goods and Services Tax (GST), a move that could bring down costs and boost insurance penetration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-150-points-higher-nifty-above-25000-ril-shares-gains-1-percent-2774468-2025-08-21",
      "headline": "Sensex opens 150 points higher, Nifty above 25,000; RIL gains 1%The S&P BSE Sensex added 122.01 points to 81,979.85, while the NSE Nifty50 gained 20.45 points to 25,071.00 as of 9:23 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/ipo-patel-retail-vikram-solar-gem-aromatics-shreeji-shipping-global-close-bidding-today-listing-gains-more-best-profit-2774451-2025-08-21",
      "headline": "4 IPOs to close for bidding today: Which one will give you best listing gains?All four IPOs opened for subscription on August 19 and will complete allotment on August 22. The listing of these companies is scheduled for August 26 on the BSE and NSE."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zepto-allows-you-to-buy-land-as-fast-as-groceries-check-details-house-of-abhinandan-lodha-hoabl-2774247-2025-08-20",
      "headline": "Now you can buy land via a mobile app in minutes. Here's howThe initiative is intended to make land purchases easier, quicker and more transparent by using a platform that millions already rely on for daily shopping."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/will-next-gen-gst-make-homes-more-affordable-gst-on-affordable-housing-2025-2774178-2025-08-20",
      "headline": "Will next-gen GST make homes more affordable?With the government considering a simpler two-slab GST structure, many are asking a key question: Will the new system finally make home buying more affordable?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rapido-fine-rs-10-lakh-false-misleading-ads-ccpa-refund-customers-2774174-2025-08-20",
      "headline": "Rapido fined Rs 10 lakh over false ads, regulator orders refunds to consumersThe penalty follows complaints that Rapido's ads such as \"Guaranteed Auto\" and \"Auto in 5 min or get Rs 50\" misled customers by creating the impression of guaranteed services."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-213-points-higher-nifty-above-25000-infosys-up-4-percent-2774119-2025-08-20",
      "headline": "Sensex ends 213 points higher, Nifty above 25,000; Infosys up 4%The S&P BSE Sensex gained 213.45 points to close at 81,857.84, while the NSE Nifty50 added 69.90 points to end at 25,050.55. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/ca-explains-the-risks-behind-no-emi-till-possession-schemes-2774105-2025-08-20",
      "headline": "CA explains the risks behind 'No EMI till possession' schemesMany homebuyers are lured by \"No EMI Till Possession\" schemes, but a chartered accountant warns that these offers can carry hidden financial risks that may leave buyers paying for a property they never receive."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indian-refiners-resume-russian-oil-purchases-amid-trump-tariff-threats-news-agency-reuters-2774044-2025-08-20",
      "headline": "Indian-state run refiners resume Russian oil purchase amid tariff threats: ReportThe resumption of Russian oil imports by Indian state refiners could reduce supplies for top buyer China, which had stepped up purchases during their absence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/labubu-mania-is-back-as-pop-mart-shares-rise-by-11-percent-ceo-predicts-record-sales-2774005-2025-08-20",
      "headline": "Labubu mania is back as Pop Mart shares rise by 11%, CEO predicts record salesPop Mart reported a 204% rise in revenue to 13.88 billion yuan for the first half of 2025, beating the average analyst estimate of 13.76 billion yuan. Net income jumped 397% to 4.57 billion yuan, highlighting the company's rapid growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/online-betting-gaming-real-money-shares-down-nazara-technologies-delta-corp-2773965-2025-08-20",
      "headline": "Online gaming bill: Nazara Technologies and Delta Corp shares take a hitThe bill, which proposes strict rules for money-based online games and makes online betting a punishable offence, is expected to be tabled in the Lok Sabha later today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/shifted-to-new-tax-regime-here-are-5-investments-you-shouldnt-drop-nps-elss-2773943-2025-08-20",
      "headline": "Shifted to new tax regime? Here are 5 investments you shouldn't dropAlthough the new regime comes with lower tax rates and no exemptions, several traditional investment products continue to play a vital role in securing your finances and growing long-term wealth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-targets-private-refiners-ril-nayara-ioc-india-import-russia-oil-tariff-2773938-2025-08-20",
      "headline": "US targets Indian refiners, says richest families made excess profitsThe criticism from US is focused on India's private refiners, particularly Reliance Industries and Nayara Energy, which together account for a large share of refined fuel exports to Europe."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/ola-electric-shares-jump-13-as-winning-streak-continues-what-next-2773919-2025-08-20",
      "headline": "Ola Electric shares jump 13%, up over 20% in two sessions. Should you buy?On Tuesday, the stock climbed almost sharply after founder and chairman Bhavish Aggarwal outlined an aggressive strategy to reclaim market share and improve profitability in India's competitive EV segment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-nifty-down-it-stocks-gain-banking-financials-decline-bajaj-finance-airtel-2773891-2025-08-20",
      "headline": "Sensex, Nifty open lower as financial stocks offset IT gains in early tradeThe S&P BSE Sensex was down by 125.67 points to 81,518.72, while the NSE Nifty50 lost 34.50 points to 24,946.15 as of 9:33 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/game-over-for-online-gaming-firms-industry-in-shock-over-proposed-blanket-ban-2773881-2025-08-20",
      "headline": "Game over for money-based online gaming? Industry in shock over proposed banIf passed in Parliament, the bill will outlaw all money-based online games (irrespective of whether they involve skill or chance), ban advertisements promoting such platforms, and bar banks and financial institutions from processing related transactions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/will-cause-serious-harm-all-india-gaming-federation-writes-to-amit-shah-on-online-gaming-ban-2773868-2025-08-20",
      "headline": "Death knell for industry: Gaming body writes to Amit Shah on money-based gaming banIn its communication, the All India Gaming Federation stressed the need for \"progressive regulation\" rather than outright prohibition, highlighting the potential fallout for millions of players and the broader industry."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/government-to-ban-all-money-based-gaming-transactions-under-online-gaming-bill-sources-2773674-2025-08-19",
      "headline": "Centre to ban all money-based gaming transactions under new bill: SourcesUnder the proposed Regulation & Promotion of Online Gaming Act, banks and financial institutions will not be allowed to process or transfer funds for real-money online games."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-up-370-points-nifty-above-24950-adani-ports-tata-motors-among-top-gainers-2773517-2025-08-19",
      "headline": "Sensex, Nifty close higher on GST buzz, easing global tensionsThe S&P BSE Sensex gained 370.64 points, while the NSE Nifty50 rose 103.70 points to settle at 24,980.65. Broader markets also ended in the green, with mid- and small-cap stocks outperforming."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/pm-viksit-bharat-rozgar-yojana-who-can-get-rs-15000-and-other-benefits-2773508-2025-08-19",
      "headline": "PM Viksit Bharat Rozgar Yojana: Who can get Rs 15,000 and other benefitsFirst-time employees under Part A can receive a one-time incentive equal to about one month's basic pay, up to Rs 15,000, paid in two instalments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/two-retirees-rs-2-crore-each-yet-one-runs-out-of-money-early-ca-explains-why-2773436-2025-08-19",
      "headline": "Two retirees, Rs 2 crore each, yet one runs out of money early. CA explains whyTwo retirees may have the same Rs 2 crore in savings, but their financial journeys can differ drastically. A CA explains how market timing and sequencing risk can decide who runs out of money first."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-reform-overhaul-two-slab-structure-done-deal-or-not-2773431-2025-08-19",
      "headline": "Are next-gen GST reforms a done deal?The next-gen GST overhaul could redefine India's tax landscape, but consensus among states and revenue concerns will decide its fate. For now, GST 2.0 is a promise, not a done deal. Read to know why."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-u-explained-check-eligibility-deadline-and-penalties-for-updated-returns-2773383-2025-08-19",
      "headline": "ITR-U explained: Check eligibility, deadline, and penalties for updated returnsThe Central Board of Direct Taxes (CBDT) has made it simpler for taxpayers to correct errors in their income tax returns through the updated ITR-U. Here's a guide on who can file, the deadline, and possible penalties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-you-should-wait-until-october-for-big-purchases-explains-expert-2773330-2025-08-19",
      "headline": "Why you should wait until October for big purchases, explains expertIf you've been planning to buy a car, air conditioner, or other expensive items, it might be wise to hold off for a few weeks. Expert says waiting until October could save you money thanks to upcoming GST reforms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/lower-gst-better-than-income-tax-relief-for-your-wallet-savings-2773328-2025-08-19",
      "headline": "Why lower GST is better for your wallet than income tax reliefUnlike income tax, which applies only to those earning above a certain threshold, GST is an indirect tax levied on almost every transaction, covering nearly everything you buy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-semiconductor-complex-fire-1989-impact-and-indigenous-chip-production-plan-2773326-2025-08-19",
      "headline": "How the SCL fire in Mohali sabotaged India's chip dreamsThe blaze caused losses estimated at Rs 75 crore in 1989, but the true cost the nation would pay would be known decades later."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/ola-electric-share-price-rising-today-explained-2773263-2025-08-19",
      "headline": "Explained: Why Ola Electric shares rose 7% in early tradeOla Electric's rising share price appears to be a result of renewed investor optimism, driven by the company's ambitious EV targets and gigafactory plans, but sustaining momentum will depend on market share recovery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-opens-over-150-points-higher-nifty-above-24900-ril-jumps-nearly-2-2773238-2025-08-19",
      "headline": "Sensex, Nifty gain as GST reforms buzz keeps investor sentiment bullishAt 9:21 am, the S&P BSE Sensex climbed 150.78 points to 81,424.53, while the NSE Nifty50 gained 38.15 points to 24,915.10. Most broader market indices also traded in the green during early deals, indicating improved investor sentiment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/next-generation-gst-reforms-will-reduce-tax-burden-boost-growth-chief-economic-advisor-2773229-2025-08-19",
      "headline": "Next-generation GST reforms will reduce tax burden, boost growth: CEAChief Economic Advisor Dr. V Anantha Nageshwaran said the GST overhaul, coupled with earlier tax cuts, will lower consumer costs, ease inflation, and boost disposable incomes, calling it a transformative step in India's eight-year tax reform journey"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/received-a-fake-income-tax-call-key-warning-signs-and-tips-to-protect-yourself-2772963-2025-08-18",
      "headline": "Received a fake income tax call? Key warning signs and tips to protect yourselfScammers are increasingly posing as income tax officials to trick people into sharing personal and financial information. If you receive a suspicious call during the filing season, it's important to stay calm and know the warning signs before taking any action."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-job-unemployment-rate-drops-52-percent-july-festive-season-gst-cut-agriculture-economy-gdp-2772962-2025-08-18",
      "headline": "India's job market shows relief as unemployment rate falls to 5.2% in JulyThe jobless rate in rural areas for people aged 15 years and above fell to 4.4% in July from 4.9% in June. Seasonal demand for workers in agriculture and related activities supported this improvement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/apple-bengaluru-new-office-rs-1000-crore-embassy-zenith-10-year-report-2772934-2025-08-18",
      "headline": "Apple rents 2.7 lakh sq ft in Bengaluru, costing Rs 1,000 crore over a decadeThe lease covers nine floors, from the 5th to the 13th floor, in the Embassy Zenith building. Apple has also made a security deposit of Rs 31.57 crore."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/millie-bobby-brown-jake-bongiovi-adopt-a-baby-girl-congratulations-pour-in-2775010-2025-08-22",
      "headline": "Millie Bobby Brown, Jake Bongiovi adopt a baby girl, congratulations pour inActor Millie Bobby Brown and husband Jake Bongiovi adopted a baby girl. The couple announced the news via a joint statement on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vivek-agnihotri-jibe-saif-ali-khan-kareena-kapoor-son-taimur-the-bengal-files-name-2775006-2025-08-22",
      "headline": "Vivek Agnihotri denies jibe at Saif's son: But, nobody should name child TaimurVivek Agnihotri, in an interview, clarified he did not take a jibe at Saif Ali Khan and Kareena Kapoor's son Taimur in his film 'The Bengal Files'. The director also expressed his opinion on the naming of children after historical figures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/in-a-sholay-remake-who-will-be-thakur-gabbar-sherlock-holmes-irrfan-yash-pankaj-tripathi-hrithik-roshan-2774878-2025-08-22",
      "headline": "In a Sholay remake, who'd be Thakur and Gabbar: Sherlock Holmes finds outAt 221B, the hunt for Thakur and Gabbar begins, and the casting debate turns deadly serious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/brent-hinds-mastodon-guitarist-dies-at-51-in-atlanta-motorcycle-crash-glbs-2774968-2025-08-22",
      "headline": "Brent Hinds, Mastodon Guitarist, dies at 51 in Atlanta motorcycle crash Brent Hinds, co-founder of Grammy-winning band Mastodon, died at 51 in an Atlanta motorcycle crash. The music world mourns his creative influence and upcoming projects with Fiend Without a Face.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/badlapur-2-shiddat-2-thama-prime-video-maddock-films-mega-deal-shiddat-2-2774873-2025-08-21",
      "headline": "Badlapur 2, Shiddat 2, Thama - Prime Video and Maddock team up for mega dealPrime Video has announced an exclusive multi-year licensing deal with Maddock Films for eight upcoming movies. This partnership will bring Indian films to audiences in over 240 countries shortly after their theatrical release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/lilly-singh-netflix-best-of-the-best-bollywood-dance-comedy-2774839-2025-08-21",
      "headline": "Lilly Singh to star in Hasan Minhaj's coming-of-age film 'Best of the Best'Canadian YouTuber and comedian Lilly Singh will feature in the Netflix original 'Best of the Best', penned by Hasan Minhaj and directed by Lena Khan. The story follows two childhood friends who join their college's Bollywood dance team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vishwambhara-teaser-chiranjeevi-film-high-octane-action-impressive-vfx-2774847-2025-08-21",
      "headline": "Vishwambhara teaser: Chiranjeevi's film promises high-octane action with grand VFXAhead of South superstar Chiranjeevi's birthday, the teaser for his much-awaited film 'Vishwambhara' released on Thursday. The makers confirmed that the film will release in Summer 2026. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/kylie-jenner-timothee-chalamet-shut-down-breakup-rumours-budapest-coffee-date-2774870-2025-08-21",
      "headline": "Kylie Jenner, Timothee Chalamet dismiss breakup rumours with Budapest coffee dateKylie Jenner and Timothee Chalamet dismissed breakup rumours with their recent coffee outing in Budapest. A picture of their date has emerged online. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rocky-jaiswal-denies-taking-advantage-of-hina-khan-fame-insecurity-2774817-2025-08-21",
      "headline": "Rocky Jaiswal denies taking advantage of Hina Khan's fame: I don't have insecurityMonths after their marriage, Rocky Jaiswal dismissed talk of taking advantage of actor Hina Khan's fame in a recent interview. He also responded to claims of being insecure about Hina's success."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/boxing-legend-mike-tyson-approached-bigg-boss-19-salman-khan-2774845-2025-08-21",
      "headline": "Boxing legend Mike Tyson approached for Bigg Boss 19: SourceBoxing legend Mike Tyson is expected to be a part of 'Bigg Boss 19'. He has been approached for the show, and the makers are waiting for his confirmation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-monday-fasting-for-energy-better-health-fitness-2774809-2025-08-21",
      "headline": "Akshay Kumar says he fasts on Monday for energy and better healthActor Akshay Kumar revealed his weekly fasting ritual and early dinner habit at a book launch. He emphasised on digestion and balanced health over extreme diets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/top-bigg-boss-contestants-their-journey-post-show-shehnaaz-gill-asim-riaz-nora-fatehi-sunny-leone-2774655-2025-08-21",
      "headline": "Most memorable Bigg Boss contestants and what they are doing now'Bigg Boss' has proved to be a game-changer for many celebrities, including Shehnaaz Gill, Nora Fatehi and Sunny Leone, amongst many others. Ahead of 'Bigg Boss 19', here is a look at the show's most memorable contestants and what they are doing now. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/swara-bhaskar-bisexuality-views-and-crush-on-dimple-yadav-spark-debate-2774791-2025-08-21",
      "headline": "Swara Bhaskar says everyone is bisexual, reveals having crush on Dimple YadavSwara Bhaskar named Dimple Yadav as her crush during an interview. Bhaskar shared her views on bisexuality and heterosexuality as cultural ideologies. The actor also talked about the potential impact on her husband's political career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mbc-apologises-racist-undertones-to-the-moon-drama-teaser-2774784-2025-08-21",
      "headline": "MBC apologises for racist undertones in To The Moon teaserSouth Korean broadcaster MBC apologised after backlash over racist undertones in its drama teaser. The network admitted oversight and promised more cultural sensitivity in future content."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-phenomenon-parody-salman-khan-season-19-iconic-moments-2774605-2025-08-21",
      "headline": "From phenomenon to parody: What happened to Bigg Boss?'Bigg Boss', once a beloved reality show that captivated Indian audiences with its raw drama and iconic moments, has seen its charm fade over the years due to scripted content and repetitive antics. Despite occasional genuine moments, the show now struggles to recreate the magic that once made it a cultural phenomenon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/taarak-mehta-ka-ooltah-chashmah-mrs-haathi-ambika-ranjankar-exit-buzz-needed-time-for-myself-2774755-2025-08-21",
      "headline": "Taarak Mehta's Mrs Haathi, Ambika Ranjankar, on exit buzz: Needed time for myself'Taarak Mehta Ka Ooltah Chashmah' actor Ambika Ranjankar, known for playing Mrs Hathi in the show, addressed her exit rumours. The actor stated that she just wanted time for herself. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aryan-khans-bads-of-bollywood-tracing-the-launch-of-star-kids-in-hindi-cinema-2774708-2025-08-21",
      "headline": "Aryan Khan's Bads of Bollywood: Tracing the launch of star kids in Hindi cinemaAs Aryan Khan, son of Bollywood superstar Shah Rukh Khan, makes his debut with 'The Bads of Bollywood', a glimpse at the launch of other star kids in the Hindi film industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-jokes-about-his-flop-film-zero-at-bads-of-bollywood-preview-event-2774555-2025-08-21",
      "headline": "Shah Rukh Khan jokes about his flop film Zero at Bads of Bollywood preview eventShah Rukh Khan attended the preview of Aryan Khan's directorial debut 'Bads of Bollywood', where he humorously took a dig at his 2018 flop 'Zero'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/chiranjeevi-family-jet-off-from-hyderabad-ahead-of-70th-birthday-2774750-2025-08-21",
      "headline": "Chiranjeevi and family jet off from Hyderabad ahead of Megastar's 70th birthdayMegastar Chiranjeevi will turn 70 on August 22. He, along with his family members, were seen at the Hyderabad airport as they jetted off to an undisclosed location."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/road-peace-runs-through-new-delhi-russian-oil-laundering-trump-aide-navarro-glbs-2774974-2025-08-22",
      "headline": "India a 'laundromat' for Kremlin, doesn't need Russian oil: Trump adviser NavarroThe longtime Trump aide said Indian refiners are cashing in while fuelling the war. \"They don't need oil -- it's a refining profiteering scheme,\" he argued. Navarro mixed criticism with praise for India's leadership, but pressed New Delhi to change course."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-to-pronounce-verdict-on-capture-and-relocation-of-stray-dogs-in-delhi-ncr-on-friday-2774923-2025-08-21",
      "headline": "Top court verdict on capture and relocation of stray dogs in Delhi-NCR todayIn its August 11 order, the Supreme Court ordered the authorities to pick up stray dogs from all localities and relocate them to dog shelters in the national capital. The order also warned of strict action against those who obstructed the carrying out of the order. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-administration-reviews-55-million-us-visa-holders-for-possible-deportation-glbs-2774970-2025-08-22",
      "headline": "Trump administration reviews 55 million US visa holders for possible deportationThe Trump administration is reviewing 55 million US visa holders for potential violations, citing overstays, criminal activity, or terrorism risks, sparking concerns among immigrants and advocacy groups nationwide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-china-are-double-engines-of-asia-beijing-says-it-stands-firmly-with-delhi-against-trumps-tariffs-2774842-2025-08-21",
      "headline": "Silence only emboldens the bully: China backs India against Trump's tariffsChinese envoy to India Xu Feihong said that as long as the two countries \"live in harmony,\" they can sustain what he called the \"Asian miracle\" amid global upheavals and stand united against US \"hegemony, protectionism, power politics, and bullying.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/in-a-sholay-remake-who-will-be-thakur-gabbar-sherlock-holmes-irrfan-yash-pankaj-tripathi-hrithik-roshan-2774878-2025-08-22",
      "headline": "In a Sholay remake, who'd be Thakur and Gabbar: Sherlock Holmes finds outAt 221B, the hunt for Thakur and Gabbar begins, and the casting debate turns deadly serious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jhansi-woman-murder-former-pradhan-nephew-arrested-search-accomplice-2774994-2025-08-22",
      "headline": "Pressured to marry, ex-UP pradhan chops lover into 7 pieces, dumps in wellFrustrated by a widow's repeated demands for marriage, a former village pradhan and his nephew murdered her in Jhansi's Kishorpura village, chopped the body into seven pieces, stuffed them into sacks, and dumped them in a well and near a bridge."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/endangering-american-lives-us-pauses-foreign-trucker-visas-after-fatal-crash-glbs-2774986-2025-08-22",
      "headline": "US freezes foreign trucker visas after deadly crash involving Indian driverThe US has paused issuing worker visas for commercial truck drivers after a fatal crash involving an Indian driver, with Secretary Rubio citing safety risks and Trump enforcing English-proficiency rules."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/as-modi-govt-tables-bills-to-prevent-rule-from-jail-why-opposition-smells-a-ploy-2774483-2025-08-21",
      "headline": "As Modi govt tables bills to prevent 'rule from jail', why Opposition smells a ployThe Modi government calls the three bills introduced by home minister Amit Shah as anti-corruption reform while critics allege executive overreach and political misuse"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/china-double-dance-cpec-2-afghanistan-pakistan-meet-india-outreach-wang-yi-jaishankar-modi-visit-sco-tianjin-2774703-2025-08-21",
      "headline": "What China's double dance amid India outreach revealsRight after his India visit, Chinese Foreign Minister Wang Yi headed to Kabul where it was agreed that China, Pakistan and Afghanistan would extend the CPEC to the Afghan capital. Wang is now in Pakistan. What does China's tango in Af-Pak reveal even as it moves for better ties with Delhi?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/odisha-youtuber-cooks-meat-of-protected-monitor-lizard-posts-video-online-arrested-2774790-2025-08-22",
      "headline": "Odisha YouTuber cooks protected monitor lizard meat, posts video online; arrestedA YouTuber from Mayurbhanj in Odisha was arrested for cooking meat of a protected monitor lizard and sharing the video on social media. Forest officials registered a case under the Wildlife Protection Act after the clip went viral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vivek-agnihotri-jibe-saif-ali-khan-kareena-kapoor-son-taimur-the-bengal-files-name-2775006-2025-08-22",
      "headline": "Vivek Agnihotri denies jibe at Saif's son: But, nobody should name child TaimurVivek Agnihotri, in an interview, clarified he did not take a jibe at Saif Ali Khan and Kareena Kapoor's son Taimur in his film 'The Bengal Files'. The director also expressed his opinion on the naming of children after historical figures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/russian-president-vladimir-putin-has-demanded-control-over-donbas-no-nato-and-western-troops-as-ceasefire-terms-2774945-2025-08-21",
      "headline": "Putin's Ukraine ceasefire demands: Control over Donbas, no Nato and western troopsPutin has demanded that Ukraine cede all the eastern Donbas region, renounce ambitions to join Nato, remain neutral and keep Western troops out of the country, reported Reuters, quoting sources.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/days-after-attack-on-solider-meerut-toll-staff-salute-army-personnel-video-goes-viral-2774908-2025-08-21",
      "headline": "Watch: Meerut toll staff salute Army personnel days after attack on soliderThe shift in behaviour comes after the toll staff were seen pinning the soldier, Kapil, to a lamp post and beating him with sticks, and at one point, even attacking him with a brick on August 17. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-narendra-modi-bihar-west-bengal-visit-inaugurates-infrastructure-projects-kolkata-metro-patna-gaya-2774997-2025-08-22",
      "headline": "PM to inaugurate Rs 13,000-crore projects in Bihar, new sections of Kolkata MetroPM Modi will visit West Bengal and election-bound Bihar on Friday to launch and lay the foundation stone for several infrastructure projects. His visit to poll-bound Bihar comes amid Rahul Gandhi's ongoing 'Voter Adhikar Yatra'."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/perplexed-at-this-logic-jaishankar-on-russian-oil-purchase-as-reason-behind-us-tariff-2774934-2025-08-21",
      "headline": "Perplexed at this logic: Jaishankar on Russian oil purchase as reason behind US tariffThe US announced 25 per cent tariffs on Indian goods and an additional 25 per cent levy, citing India's continued imports of Russian crude."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/us-open/story/us-open-2025-mens-singles-womens-singles-draw-carlos-alcaraz-jannik-sinner-sabalenka-2774949-2025-08-21",
      "headline": "US Open 2025: Alcaraz handed tough draw despite avoiding Sinner's halfCarlos Alcaraz faces a challenging US Open 2025 path, with a potential semi-final clash against Novak Djokovic looming. The Spaniard must navigate a tough quarter packed with stars like Daniil Medvedev, Ben Shelton, and Casper Ruud to progress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/high-salaries-empty-classrooms-why-government-school-teachers-stay-absent-2774713-2025-08-22",
      "headline": "High salaries, empty classrooms: Why government school teachers stay absentIndia pays its government school teachers high salaries, yet teacher absenteeism remains widespread in India. Around 25% of teachers remain absent on average, while 25% more stay present but don't teach. Economist Karthik Muralidharan explains how politics, centralisation, and weak accountability fuel the crisis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-dengue-is-sending-more-adults-to-the-icu-2774754-2025-08-21",
      "headline": "Why dengue is sending more adults to the ICUProlonged screen-time, device heat, electromagnetic radiation and poor posture are now known to trigger severe skin conditions"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/from-mario-to-snake-why-non-monetary-online-games-are-the-reset-we-need-2774723-2025-08-21",
      "headline": "From Mario to Snake: Why non-monetary online games are the reset we needKids today spend money on virtual items and fancy skins, often for social approval, not pure fun. It's time to remember old-school games that brought us simple pleasure, no price tag attached."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/nitish-kumar-refuses-to-wear-muslim-headgear-madrassa-event-bihar-elections-2774806-2025-08-21",
      "headline": "Paltu moment? Nitish Kumar declines to wear 'topi' at madrasa eventThe incident has stirred a political row ahead of the Bihar elections as Nitish Kumar has previously been seen donning a skull cap at Iftar parties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/programme/democratic-newsroom/video/the-contentious-constitutional-bill-cleansing-or-conspiracy-democratic-newsroom-debates-2774860-2025-08-21",
      "headline": "Bill to oust arrested ministers: Cleansing or conspiracy? Democratic Newsroom debatesIn this episode of Democratic Newsroom, the focus is on a contentious Constitutional amendment bill, which Home Minister Amit Shah introduced in the Lok Sabha on Wednesday. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/israel-to-begin-gaza-ceasefire-negotiations-to-end-war-release-hostages-says-benjamin-netanyahu-2774939-2025-08-21",
      "headline": "Netanyahu orders Gaza hostage talks as Israel plans city capture and Hamas defeatNetanyahu says Israel will start immediate negotiations for hostage release and end the war on acceptable terms, while approving Gaza City capture plans and maintaining military pressure against Hamas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/uk-news/story/nri-industrialist-lord-swraj-paul-passes-away-london-glbs-2774978-2025-08-22",
      "headline": "Lord Swraj Paul, NRI industrialist and philanthropist, dies at 94Lord Paul, founder of UK-based Caparo Group of industries, had been taken ill and hospitalised recently, where he passed away surrounded by members of his family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/satish-golcha-new-delhi-police-commissioner-2774861-2025-08-21",
      "headline": "Meet Satish Golcha, Delhi's new Police Commissioner tasked with city's safetySatish Golcha has been named the new Commissioner of Delhi Police. He brings extensive experience to the role, having previously served in key positions within the Delhi Police and with the CBI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/millie-bobby-brown-jake-bongiovi-adopt-a-baby-girl-congratulations-pour-in-2775010-2025-08-22",
      "headline": "Millie Bobby Brown, Jake Bongiovi adopt a baby girl, congratulations pour inActor Millie Bobby Brown and husband Jake Bongiovi adopted a baby girl. The couple announced the news via a joint statement on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vivek-agnihotri-jibe-saif-ali-khan-kareena-kapoor-son-taimur-the-bengal-files-name-2775006-2025-08-22",
      "headline": "Vivek Agnihotri denies jibe at Saif's son: But, nobody should name child TaimurVivek Agnihotri, in an interview, clarified he did not take a jibe at Saif Ali Khan and Kareena Kapoor's son Taimur in his film 'The Bengal Files'. The director also expressed his opinion on the naming of children after historical figures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/in-a-sholay-remake-who-will-be-thakur-gabbar-sherlock-holmes-irrfan-yash-pankaj-tripathi-hrithik-roshan-2774878-2025-08-22",
      "headline": "In a Sholay remake, who'd be Thakur and Gabbar: Sherlock Holmes finds outAt 221B, the hunt for Thakur and Gabbar begins, and the casting debate turns deadly serious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/brent-hinds-mastodon-guitarist-dies-at-51-in-atlanta-motorcycle-crash-glbs-2774968-2025-08-22",
      "headline": "Brent Hinds, Mastodon Guitarist, dies at 51 in Atlanta motorcycle crash Brent Hinds, co-founder of Grammy-winning band Mastodon, died at 51 in an Atlanta motorcycle crash. The music world mourns his creative influence and upcoming projects with Fiend Without a Face.\r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-asia-cup-kerala-cricket-league-batting-position-2775013-2025-08-22",
      "headline": "Samson preparing for new Asia Cup role? Keeper slots at No.5 in local leagueSanju Samson moved down to the No. 5 position in the batting order in Kerala Cricket League. Is he preparing for a new role for the Asia Cup?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-asia-cup-squad-selection-ravi-bishnoi-2775007-2025-08-22",
      "headline": "Ravi Bishnoi: From India's trump card to T20I outsider. What went wrong?Ravi Bishnoi could not find a place in India's Asia Cup squad. An underwhelming IPL 2025, combined with Varun Chakravarthy's rapid rise has forced the former World No.1 T20I bowler to the sidelines of the Indian squad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/wwe-big-boss-undertaker-salman-khan-2775001-2025-08-22",
      "headline": "WWE's Undertaker set to join Salman Khan's Big Boss: ReportsWWE legend The Undertaker may join Salman Khan on Bigg Boss 19, if reports are to be believed. If the move goes through, it would create a groundbreaking crossover between wrestling and Bollywood."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/us-open/story/us-open-2025-mens-singles-womens-singles-draw-carlos-alcaraz-jannik-sinner-sabalenka-2774949-2025-08-21",
      "headline": "US Open 2025: Alcaraz handed tough draw despite avoiding Sinner's halfCarlos Alcaraz faces a challenging US Open 2025 path, with a potential semi-final clash against Novak Djokovic looming. The Spaniard must navigate a tough quarter packed with stars like Daniil Medvedev, Ben Shelton, and Casper Ruud to progress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pm-modi-online-gaming-bill-esports-real-money-games-2774932-2025-08-21",
      "headline": "Gaming Bill will save society from harmful effects of online money games: PM ModiPrime Minister Narendra Modi welcomed the new Online Gaming Bill, aimed at boosting esports and curbing online money games. The law introduces strict penalties to prevent addiction, fraud, and money laundering linked to such games."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rahul-dravid-rohit-sharma-captaincy-r-ashwin-youtube-kutty-stories-2774915-2025-08-21",
      "headline": "Rahul Dravid a fan of Rohit Sharma's captaincy: He deeply cared for the teamRahul Dravid praised Rohit Sharma's leadership, saying the India ODI captain had the ability to connect emotionally with players. Their partnership helped India win the 2024 T20 World Cup after an 11-year wait for an ICC trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aisa-cup-shreyas-iyer-snub-seletors-bcci-clear-communication-ajinkya-rahane-2774912-2025-08-21",
      "headline": "Shreyas Iyer should get clear communication: Rahane after Asia Cup snubAjinkya Rahane feels Shreyas Iyer must be deeply disappointed by his Asia Cup snub. He urged selectors to maintain transparent communication with Iyer, ensuring the batter stays motivated and remains a strong contender for future national team selections."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/bengal-footballers-denied-national-team-chances-aroop-biswas-aiff-2774903-2025-08-21",
      "headline": "Bengal footballers denied national team chances: Sports Minister's jibe at AIFFWest Bengal Sports Minister Aroop Biswas has accused national sports bodies of systemic bias, claiming Bengali athletes are overlooked despite merit. His remarks spark fresh debate over regional discrimination and transparency in Indian sports selections.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/boxing-federation-of-india-ajay-singh-president-elected-third-term-2774900-2025-08-21",
      "headline": "Ajay Singh re-elected as Boxing Federation president for third consecutive termAjay Singh secured a third straight term as Boxing Federation of India President, defeating Jaslal Pradhan 40-26 in delayed elections marred by legal disputes, with new office-bearers elected amid pending Delhi High Court proceedings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-sanju-samson-will-sit-out-shubman-gill-abhishek-sharma-open-ajinkya-rahane-2774897-2025-08-21",
      "headline": "Samson will sit out, Shubman Gill and Abhishek to open in Asia Cup: RahaneAjinkya Rahane believes Shubman Gill's return and vice-captaincy will likely push Sanju Samson out of India's Asia Cup Playing XI. He backed Gill and Abhishek Sharma as openers despite praising Samson's consistency and team-first attitude."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-elections-national-sports-governance-act-2025-new-committees-2774866-2025-08-21",
      "headline": "Government keen on having BCCI election as per National Sports Governance ActThe Government is keen on conducting the Indian cricket board elections under the newly passed National Sports Governance Act 2025. BCCI has been functioning under the recommendations of the Lodha Committee."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aisa-cup-shreyas-iyer-snub-seletors-bcci-clear-communication-ajinkya-rahane-2774912-2025-08-21",
      "headline": "Shreyas Iyer should get clear communication: Rahane after Asia Cup snubAjinkya Rahane feels Shreyas Iyer must be deeply disappointed by his Asia Cup snub. He urged selectors to maintain transparent communication with Iyer, ensuring the batter stays motivated and remains a strong contender for future national team selections."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/bengal-footballers-denied-national-team-chances-aroop-biswas-aiff-2774903-2025-08-21",
      "headline": "Bengal footballers denied national team chances: Sports Minister's jibe at AIFFWest Bengal Sports Minister Aroop Biswas has accused national sports bodies of systemic bias, claiming Bengali athletes are overlooked despite merit. His remarks spark fresh debate over regional discrimination and transparency in Indian sports selections.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/boxing-federation-of-india-ajay-singh-president-elected-third-term-2774900-2025-08-21",
      "headline": "Ajay Singh re-elected as Boxing Federation president for third consecutive termAjay Singh secured a third straight term as Boxing Federation of India President, defeating Jaslal Pradhan 40-26 in delayed elections marred by legal disputes, with new office-bearers elected amid pending Delhi High Court proceedings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-sanju-samson-will-sit-out-shubman-gill-abhishek-sharma-open-ajinkya-rahane-2774897-2025-08-21",
      "headline": "Samson will sit out, Shubman Gill and Abhishek to open in Asia Cup: RahaneAjinkya Rahane believes Shubman Gill's return and vice-captaincy will likely push Sanju Samson out of India's Asia Cup Playing XI. He backed Gill and Abhishek Sharma as openers despite praising Samson's consistency and team-first attitude."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-elections-national-sports-governance-act-2025-new-committees-2774866-2025-08-21",
      "headline": "Government keen on having BCCI election as per National Sports Governance ActThe Government is keen on conducting the Indian cricket board elections under the newly passed National Sports Governance Act 2025. BCCI has been functioning under the recommendations of the Lodha Committee."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-nick-kyrgios-withdraws-mens-singles-injury-grand-slam-miss-2774865-2025-08-21",
      "headline": "Nick Kyrgios withdraws from US Open as his injury tale continuesNick Kyrgios' injury woes have struck again, ruling him out of the US Open for a third straight year. The Aussie star's stop-start career continues as fans wait for his long-promised comeback to finally materialise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/e-sports/story/online-gaming-bill-benefit-e-sports-mainstream-2774837-2025-08-21",
      "headline": "New Online Gaming Bill lifts Esports to mainstream sporting statusThe new Online Gaming Bill brings relief to millions of gamers and aspiring esports athletes in the country. There is now a clear differentiation between esports and Real Money Gaming and ambitious plans to promote and expand esports nationwide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cheteshwar-pujara-ranji-trophy-saurashtra-2774832-2025-08-21",
      "headline": "Cheteshwar Pujara available to play Ranji Trophy 2025-26 for Saurashtra: ReportSenior batter Cheteshwar Pujara has signalled his intent to play the upcoming Ranji Trophy season for Saurashtra. Pujara last featured in competitive cricket in February."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-england-squad-announcement-heather-knight-return-2774788-2025-08-21",
      "headline": "Heather Knight back as England name spin-heavy squad for 2025 Women's World CupEngland have named a spin-heavy squad for the 2025 Women's World Cup with Heather Knight returning from injury, Nat Sciver-Brunt leading for the first time, and Sarah Glenn and Danni Wyatt-Hodge also making comebacks for the subcontinental challenge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/durand-cup-diamond-harbour-fc-who-are-they-east-bengal-defeated-2774738-2025-08-21",
      "headline": "Who are Diamond Harbour FC? 3-year-old club aiming for Durand Cup gloryIn just three years, Diamond Harbour FC have surged from district football to the Durand Cup final, stunning East Bengal on debut and standing one win away from completing Indian football's most remarkable underdog story in recent times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/online-gaming-bill-2025-esports-ban-real-money-games-india-cricket-sponsorship-2774735-2025-08-21",
      "headline": "Online gaming bill: What does it mean for sports and sports enthusiasts?India's Online Gaming Bill 2025 boosts esports but bans real money games, gambling and betting. Here's all you need to know about the new bill that was passed in the Cabinet on Tuesday, August 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-pakistan-bilateral-ties-asia-cup-participation-sports-ministry-2774733-2025-08-21",
      "headline": "No bilaterals with Pak, says government; green light for Asia CupThe government on Thursday, August 21, said India will not engage in bilateral sporting ties with Pakistan. However, a Sports Ministry source confirmed that Indian men's cricket team will not be stopped from playing against Pakistan in the Asia Cup, starting September 9. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-shreyas-iyer-snub-father-santosh-2774694-2025-08-21",
      "headline": "Shreyas Iyer's father on Asia Cup snub: Not asking for captaincy, at least select himAsia Cup 2025: Shreyas Iyer's father, Santosh, has urged the selectors to give his son an opportunity in the T20I format. He revealed that Shreyas was gutted after missing out on a place in the Asia Cup squad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/durand-cup-diamond-harbour-fc-who-are-they-east-bengal-defeated-2774738-2025-08-21",
      "headline": "Who are Diamond Harbour FC? 3-year-old club aiming for Durand Cup gloryIn just three years, Diamond Harbour FC have surged from district football to the Durand Cup final, stunning East Bengal on debut and standing one win away from completing Indian football's most remarkable underdog story in recent times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/online-gaming-bill-2025-esports-ban-real-money-games-india-cricket-sponsorship-2774735-2025-08-21",
      "headline": "Online gaming bill: What does it mean for sports and sports enthusiasts?India's Online Gaming Bill 2025 boosts esports but bans real money games, gambling and betting. Here's all you need to know about the new bill that was passed in the Cabinet on Tuesday, August 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-pakistan-bilateral-ties-asia-cup-participation-sports-ministry-2774733-2025-08-21",
      "headline": "No bilaterals with Pak, says government; green light for Asia CupThe government on Thursday, August 21, said India will not engage in bilateral sporting ties with Pakistan. However, a Sports Ministry source confirmed that Indian men's cricket team will not be stopped from playing against Pakistan in the Asia Cup, starting September 9. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-shreyas-iyer-snub-father-santosh-2774694-2025-08-21",
      "headline": "Shreyas Iyer's father on Asia Cup snub: Not asking for captaincy, at least select himAsia Cup 2025: Shreyas Iyer's father, Santosh, has urged the selectors to give his son an opportunity in the T20I format. He revealed that Shreyas was gutted after missing out on a place in the Asia Cup squad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-india-asia-cup-spot-uncertain-mohammed-kaif-2774693-2025-08-21",
      "headline": "Sanju Samson's Asia Cup spot under threat after Shubman Gill's inclusion: KaifMohammad Kaif has said it will be tough for Sanju Samson to secure a spot in India's playing XI for the Asia Cup. Kaif believes Shubman Gill, who is now the vice-captain, will open the innings alongside Abhishek Sharma."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-bronco-test-indian-cricket-fitness-yo-yo-2-km-trials-2774674-2025-08-21",
      "headline": "What is Bronco test? BCCI's new fitness benchmark and how it differs from Yo-YoThe BCCI has reportedly introduced a rugby-centric Bronco fitness test for Indian players in an effort to ensure consistently high fitness standards. It will now be used alongside the established Yo-Yo test and 2-kilometer time trial to assess players' readiness for international competition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-asia-cup-2025-vice-captain-badrinath-jaiswal-sudharsan-2774657-2025-08-21",
      "headline": "No issue backing Gill, but what about Jaiswal? Ex- IND batter on Asia Cup squadFormer India batter S. Badrinath has questioned the decision to snub Yashasvi Jaiswal and Sai Sudharsan from the Asia Cup 2025 squad in favour of Shubman Gill. The 25-year-old comes into the team as the vice-captain of the team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/jake-paul-vs-gervonta-davis-netflix-fight-2025-2774632-2025-08-21",
      "headline": "Paul vs Davis confirmed, Netflix superfight set despite 60-pound gapJake Paul vs. Gervonta Davis is set for Nov 14, 2025, in Atlanta, with the event all set to be streamed exclusively by NetFlix. With a 60+ pound weight gap, the fight will see Paul try to end his feud with Davis inside the ring. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ajinkya-rahane-steps-down-mumbai-captain-ranji-trophy-2774581-2025-08-21",
      "headline": "Ajinkya Rahane steps down as Mumbai captain ahead of new domestic seasonVeteran India batter Ajinkya Rahane announced on Thursday that he would be stepping down as captain of Mumbai ahead of the upcoming domestic season. Rahane took to social media to reveal his decision, citing the need to groom a new leader within the team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-siraj-snub-asia-cup-2025-harbhajan-singh-reaction-2774583-2025-08-21",
      "headline": "Mohammed Siraj's X-factor will be missed in Asia Cup 2025: Harbhajan SinghHarbhajan Singh feels that Mohammed Siraj should have been included in the Asia Cup squad. The former cricketer thinks that the pacer could have chipped in as the 'x-factor' for India during the upcoming tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-extends-ajit-agarkars-term-senior-men-chief-selector-till-june-2026-report-2774548-2025-08-21",
      "headline": "BCCI extends Ajit Agarkar's term as men's chief selector till June 2026: ReportBCCI has reportedly extended Ajit Agarkar's tenure as chairman of the senior men's selection committee till June 2026. This move comes after India's strong performances under his leadership, signalling stability amid upcoming cricketing challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/sinquefield-cup-gukesh-held-sevian-praggnanandhaa-draw-abdusattorov-2774511-2025-08-21",
      "headline": "Sinquefield Cup: Gukesh held by Sevian, Praggnanandhaa draws with AbdusattorovWorld champion D Gukesh was held to a draw by the lone wild card, Samuel Sevian of the United States, while fellow Indian R Praggnanandhaa also split the points with Nodirbek Abdusattorov of Uzbekistan in the third round of the Sinquefield Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/us-open-2025-mixed-doubles-final-errani-vavassori-reaction-swiatek-ruud-2774504-2025-08-21",
      "headline": "Sara Errani's message after US Open Win: This one is for all doubles playersSara Errani dedicated her US Open mixed doubles win alongside Andrea Vavassori to the doubles specialists who missed out on playing in the tournament. Errani and Vavassori defeated Iga Swiatek and Casper Ruud in the final on Wednesday, August 20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-sanju-samson-t20i-future-india-shubman-gill-2774482-2025-08-21",
      "headline": "Can Sanju Samson do a KL Rahul to stay indispensable in T20Is?Asia Cup 2025: Shubman Gill's return to the T20I fold has complicated matters. Sanju Samson, who had forged a promising opening partnership with Abhishek Sharma, now finds his place under threat. Can the Kerala wicketkeeper-batter adapt, reinvent himself, and make his spot indispensable?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2025-mixed-doubles-final-errani-vavassori-beat-swiatek-ruud-2774467-2025-08-21",
      "headline": "Errani-Vavassori beat Swiatek-Ruud to win mixed doubles championshipItalians Sara Errani and Andrea Vavassori retained their mixed doubles title at the U.S. Open on Wednesday, overcoming third seeds Iga Swiatek and Casper Ruud 6-3, 5-7, 10-6 in a final that showcased the tournament's ambitious new direction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammad-rizwan-joins-st-kitts-nevis-patriots-cpl-2025-asia-cup-snub-2774460-2025-08-21",
      "headline": "After Asia Cup snub, Mohammad Rizwan signs for CPL side St Kitts and Nevis PatriotsMohammad Rizwan is reportedly set to join St Kitts & Nevis Patriots for CPL 2025 after missing Pakistan's Asia Cup squad. Rizwan joins a strong Pakistan contingent at this year's CPL. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}