{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/trumps-tariff-war-is-this-indias-1991-moment-montek-singh-ahluwalia-exclusive-2768555-2025-08-08",
      "headline": "Trump's tariff war: Is this India's 1991 moment? Montek Singh Ahluwalia exclusiveAt the Business Today India@100 Summit, Montek Singh Ahluwalia, former Deputy Chairman of the Planning Commission, discusses if the 2025 Trump tariff war presents a 1991-like moment for India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/piyush-goyal-exclusive-whole-world-recognises-india-as-fastest-growing-economy-2768534-2025-08-08",
      "headline": "Piyush Goyal exclusive: Whole world recognises India as fastest-growing economyUnion Minister Piyush Goyal hailed the Indian economy and said the whole world recognises us as the fastest-growing large economy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/a-win-for-india-piyush-goyal-on-clinching-uk-free-trade-deal-2768506-2025-08-08",
      "headline": "'A win for India': Piyush Goyal on clinching UK free trade dealUnion Minister Piyush Goyal, speaking at the Business Today India@100 Summit, called the India-UK free trade deal a big win for the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cabinet-approves-rs-30000-crore-compensation-for-oil-marketing-companies-to-maintain-lpg-price-stability-2768365-2025-08-08",
      "headline": "Cabinet approves Rs 30,000 crore subsidy to oil companies to keep LPG prices stableThe decision aims to protect consumers from changes in global LPG prices and support the financial health of the public sector oil companies. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-donald-trump-trade-talk-dalal-street-2768343-2025-08-08",
      "headline": "Sensex cracks below 80,000 as tariff fears rattle stock marketsThe S&P BSE Sensex fell 765.47 points to close below the psychological 80,000 mark, while the NSE Nifty50 dropped 232.85 points to settle at 24,363.30. Midcap and smallcap stocks witnessed deeper cuts, reflecting growing investor unease over the evolving global trade scenario."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-not-a-dead-economy-set-to-become-3rd-largest-in-world-amitabh-kant-2768334-2025-08-08",
      "headline": "India not a dead economy, poised to become 3rd-largest in world: Amitabh KantAfter Donald Trump's 'dead economy' jibe, Amitabh Kant calls India a resilient, reform-driven powerhouse on track to become the world's third-largest economy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-tariff-surge-could-stall-indias-manufacturing-momentum-warns-moodys-2768326-2025-08-08",
      "headline": "US tariff surge could stall India's manufacturing momentum, warns Moody'sOn Thursday, US President Donald Trump signed an Executive Order that adds a 25% tariff on Indian goods. This move comes in response to India's continued import of oil from Russia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-fuel-bill-may-rise-by-9-billion-in-fy26-and-12-billion-in-fy27-if-it-stops-russian-oil-import-sbi-2768284-2025-08-08",
      "headline": "How much will India's fuel bill rise if it stops buying oil from Russia?Russia currently provides 10% of the world's crude supply. If multiple countries stop buying from Russia at once, crude oil prices could rise by around 10%, as per the report. That would affect everyone, not just India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-hits-record-high-of-rs-102-lakh-is-it-the-right-time-to-buy-bullion-rates-2768222-2025-08-08",
      "headline": "Gold hits record high of Rs 1.02 lakh. Is it the right time to buy?The rally in gold comes amid growing concerns over new tariffs announced by US President Donald Trump."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/arvind-panagariya-bets-on-these-states-to-leads-indias-growth-by-2047-2768268-2025-08-08",
      "headline": "Arvind Panagariya bets on these states to leads India's growth by 2047Arvind Panagariya explained that India doesn't need to push growth artificially. He believes market forces are already at work, shaping the country's growth naturally."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/nitin-gadkari-dismisses-concerns-over-ethanol-blended-petrol-as-misinformation-2768238-2025-08-08",
      "headline": "Nitin Gadkari dismisses concerns over ethanol-blended petrol as misinformationUnion Minister Nitin Gadkari firmly defended the government's ethanol-blended petrol initiative, stating that no complaints have surfaced about vehicle issues. Speaking at the India@100 Summit, he challenged critics to cite a single case of malfunction and accused them of spreading baseless misinformation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/show-a-single-instance-of-e20-fuel-causing-car-issues-minister-hits-back-at-criticism-of-ethanol-mixed-petrol-2768205-2025-08-08",
      "headline": "Nitin Gadkari's dare on E20 petrol row: Show a single instance of cars facing issueSpeaking at a session during the Business Today India@100 Summit, Nitin Gadkari said no complaints had been reported so far and accused detractors of spreading misinformation about the government's ethanol-blending programme."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshans-pool-workout-video-has-fans-gushing-over-his-sculpted-body-war-2-2768627-2025-08-09",
      "headline": "Hrithik Roshan's pool workout video has fans gushing over his sculpted bodyHrithik Roshan has shared a behind-the-scenes glimpse of his disciplined training regime for his upcoming film 'War 2'. The unfiltered video has got fans gushing over his chiselled body. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/swara-bhasker-slams-troll-casteist-jibe-husband-fahad-ahmad-2768493-2025-08-09",
      "headline": "Swara Bhasker slams troll over casteist, classist jibe at husband Fahad AhmadActor Swara Bhasker strongly reacted to a troll for his derogatory remarks about her husband Fahad Ahmad. She emphasised the classist nature of the slur in her response.\r\n "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sooraj-barjatya-salman-khan-prem-comeback-age-appropriate-family-film-2768536-2025-08-08",
      "headline": "Sooraj Barjatya on Salman Khan's return as Prem: Script must be age-appropriateDirector Sooraj Barjatya hinted at actor Salman Khan's return as Prem in Rajshri Productions' future project. He opened up on working on an age-appropriate script for Salman."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/udaipur-files-film-release-audience-reaction-kanhaiyalal-murder-case-2768525-2025-08-08",
      "headline": "Udaipur Files released after long legal battle, audience call it mirror to societyUdaipur Files has been released nationwide after legal hurdles. The film highlights societal silence and calls for justice in the Kanhaiyalal murder case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-fan-decorates-temple-5500-posters-50-years-2768477-2025-08-08",
      "headline": "Fan pays tribute to Rajinikanth with 5,500 posters at temple dedicated to superstarA fan of actor Rajinikanth's celebrated the superstar's 50 years in cinema in a unique way. He decorated a temple with thousands of posters as a tribute to the 'Coolie' actor's legacy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-fans-figured-out-j-hope-jimin-v-had-drinks-k-pop-news-2768509-2025-08-08",
      "headline": "Here's how BTS fans realised J-Hope, Jimin and V had been drinkingCurrently in Los Angeles, the BTS members enjoyed a day out at an upscale restaurant, though Jungkook and Jin were notably absent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/ai-in-filmmaking-innovation-or-a-threat-to-creative-freedom-2768421-2025-08-08",
      "headline": "AI in filmmaking: Innovation or a threat to creative freedom?Artificial Intelligence is shaping the present phase in films. If used transparently, these tools can be a boon that helps in streamlining pre-production, improving accessibility, and even pushing artistic boundaries. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/blackpink-nine-years-global-dominance-record-tours-new-album-comeback-2768492-2025-08-08",
      "headline": "BLACKPINK still in your area: 9 years on, the band reigns supreme in K-pop sceneBLACKPINK celebrates nine years of redefining K-pop with record-breaking achievements. Their upcoming album and continued global tours hint at sustained dominance and evolving artistry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-photo-dump-malti-beach-joy-crashing-jonas-brothers-rehearsals-rakhi-celebrations-2768432-2025-08-08",
      "headline": "Malti crashes Nick's rehearsals, Priyanka celebrates early Rakhi in new photo dumpPriyanka Chopra shared a photo dump featuring all the memorable moments of her family. The carousel featured her daughter Malti enjoying her time at beach and crashing into the Jonas Brothers' rehearsal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/smriti-irani-kyunki-saas-bhi-kabhi-bahu-thi-reboot-success-ott-action-content-2768479-2025-08-08",
      "headline": "Smriti Irani reacts to Kyunki Saas Bhi Kabhi Bahu Thi reboot topping TV, OTT chartsActor-politician Smriti Irani is elated as her show 'Kyunki Saas Bhi Kabhi Bahu Thi' reboot is topping the ratings. Irani expressed her gratitude to fans and viewers for their love and support. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ashish-vidyarthi-says-he-wont-return-to-bollywood-without-central-roles-2768470-2025-08-08",
      "headline": "Actor Ashish Vidyarthi says he won't return to Bollywood without central rolesVeteran actor Ashish Vidyarthi shares why he's stepped back from films, stating he's waiting for central roles that truly excite him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/marathi-film-khalid-ka-shivaji-controversy-explained-secular-shivaji-portrayal-government-probes-2768302-2025-08-08",
      "headline": "Explained: The controversy around Marathi film Khalid Ka ShivajiThe Marathi film 'Khalid Ka Shivaji' has sparked controversy over its portrayal of Chhatrapati Shivaji Maharaj. Right-wing groups claim historical distortion, while the Centre seeks clarification from filmmakers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/varun-badola-backtracks-saiyaara-promotion-claims-viral-theatre-reactions-2768291-2025-08-08",
      "headline": "Varun Badola backtracks on Saiyaara remark, says his words were misrepresentedActor Varun Badola has clarified that his earlier comments about Saiyaara's promotions were misrepresented. He stated that malicious attempts were being made to tarnish the Mohit Suri directorial. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jennifer-lopez-denied-entry-chanel-store-istanbul-shops-rival-brands-2768236-2025-08-08",
      "headline": "Jennifer Lopez shops at rival brands after being denied entry at Chanel storeActor Jennifer Lopez was refused entry to a Chanel store in Istanbul due to full capacity. She later shopped at rival luxury brands, highlighting a rare celebrity shopping snub."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/coolie-advance-booking-soars-in-kerala-rajinikanth-film-set-for-massive-opening-box-office-update-2768445-2025-08-08",
      "headline": "Coolie advance booking soars in Kerala, Rajinikanth's film set for massive openingSuperstar Rajinikanth's 'Coolie' eyes the biggest international opening for a Tamil film. The film's advance bookings in Kerala show a promising momentum at the box office. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jimmy-fallon-roasts-trump-tariffs-india-brazil-sydney-sweeney-putin-jokes-2768375-2025-08-08",
      "headline": "Jimmy Fallon trolls Trump's India tariffs, jokes about Putin and Sydney SweeneyJimmy Fallon roasted President Trump's tariff plans affecting over 90 countries, including India and Brazil. The American comedian, in his monologue, highlighted the economic impacts surrounding Trump's trade policies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/sydney-sweeney-the-devil-wears-prada-2-with-anne-hathaway-emily-blunt-meryl-streep-2768362-2025-08-08",
      "headline": "Is Sydney Sweeney part of The Devil Wears Prada 2? Fans think soHollywood actor Sydney Sweeney sparks casting rumours after being captured on 'The Devil Wears Prada 2' set, amid backlash over her American Eagle ad campaign."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/chhoriyan-chali-gaon-anita-hassanandani-promises-to-support-village-children-after-show-wraps-2768369-2025-08-08",
      "headline": "Chhoriyan Chali Gaon: Anita promises to support village children after show wrapsActor Anita Hassanandani said she will continue to support the children she's staying with in MP's Bamuliya village. Her support came on the reality TV show 'Chhoriyan Chali Gaon' on Zee TV.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ed-sheeran-turns-bride-for-harry-potter-star-rupert-grint-2768393-2025-08-08",
      "headline": "Singer Ed Sheeran turns bride for Harry Potter star Rupert Grint. WatchPop star Ed Sheeran turned into a bride for Harry Potter star Rupert Grint, known for playing the role of Ronald Weasley in the popular fantasy franchise. He was previously featured as Ed Sheeran's stalker in the 2011 music video 'Lego House'. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/exclusive-india-will-not-bow-to-anybody-says-piyush-goyal-on-trumps-tariff-ultimatum-2768472-2025-08-08",
      "headline": "India will not bow to anybody, says Piyush Goyal amid trade warsSpeaking on the broader trade outlook, Piyush Goyal said that India's IT industry has not looked back since the year 2000, creating thousands of jobs, and noted that the country had turned the Covid-19 crisis into an opportunity. \"India will always emerge victorious during challenging times,\" he said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-says-he-will-meet-russian-president-vladimir-putin-on-august-15-in-alaska-glbs-2768594-2025-08-09",
      "headline": "Trump to meet Putin in Alaska on August 15 for high-stakes Ukraine peace talksDonald Trump says he will host Russian President Vladimir Putin in Alaska for high-stakes talks on ending the war in Ukraine, calling it a \"highly anticipated\" step towards peace."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/delhi-noida-gurgaon-heavy-rain-relief-from-humidity-waterlogging-traffic-update-2768603-2025-08-09",
      "headline": "Over 100 flights delayed as heavy rain hits Delhi, several areas waterloggedDelhi-NCR rain: The weekend started on a wet note for Delhi-NCR citizens as heavy rain pounded the national capital, Noida and Gurugram overnight. A red alert has been issued."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-tried-to-sensationalise-voter-theft-claims-should-sign-declaration-or-apologise-poll-body-2768480-2025-08-08",
      "headline": "Tired script: Poll body blasts Rahul Gandhi's vote theft claim, cites 2018 caseIn 2018, Congress leader Kamal Nath approached the Supreme Court, claiming that the same face have cropped up in Madhya Pradesh's electoral role multiple times. However, the Election Commission successfully argued before the Supreme Court that the highlighted discrepancies were already removed four months before the plea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-workload-management-test-series-selection-debate-2768610-2025-08-09",
      "headline": "DRS: Should Jasprit Bumrah be allowed to pick and choose matches?Jasprit Bumrah is a crucial pillar of India's bowling attack, but allowing him to pick and choose matches could disrupt team balance and increase pressure on other pacers. Data shows that Bumrah has struggled with injuries and workload management, so a structured rest plan is vital rather than an ad-hoc approach. A consistent, well-managed schedule can help maintain his fitness and effectiveness over the long term."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-speaks-to-vladimir-putin-on-developments-in-ukraine-reiterates-indias-stand-for-peaceful-resolution-2768486-2025-08-08",
      "headline": "PM speaks to Putin, reaffirms commitment to deepen ties amid Trump's tariff heatAmid tensions following US President Donald Trump's 50 per cent tariffs on India, Prime Minister Narendra Modi spoke to Russian President Vladimir Putin and reaffirmed India's commitment to deepen the strategic partnership between both countries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/four-astronauts-of-nasas-crew-10-leave-international-space-station-on-spacex-dragon-for-california-splashdown-2768596-2025-08-09",
      "headline": "NASA's Crew-10 astronauts undock, begin return journey to earth on SpaceX DragonThe crew had launched to the ISS on March 14 in a routine mission replacing the Crew-9 team, which included NASA astronauts Butch Wilmore and Sunita Williams, who remained on the station after arriving via Boeing's Starliner capsule."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-aide-calls-india-maharaja-of-tariffs-backs-25-per-cent-as-security-measure-glbs-2768579-2025-08-09",
      "headline": "Trump aide calls India 'maharaja of tariffs', backs 50% duty as security measureWhite House defends 25 per cent tariff hike on India, citing national security over Russian oil ties. Navarro calls India \"maharaja of tariffs\"; India slams the move as unjustified and unreasonable."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/voter-fraud-is-real-lets-talk-solutions-rahul-gandhi-claims-fraud-karnataka-rolls-election-commission-sir-2768354-2025-08-08",
      "headline": "Voter Fraud is Real, Let's Talk SolutionsIn his presentation titled 'Vote Chori', Rahul Gandhi claimed that in a state his party won, unaccounted voters stole the elections by voting or not voting. While the voter list seems to be a problem, even the SIR to fix it has sparked controversy. What's the solution then?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/trinamool-congress-congress-ties-thaw-ahead-of-bengal-polls-mamata-banerjee-rahul-gandhi-abhishek-banerjee-2768571-2025-08-08",
      "headline": "From 'ekla cholo' to handshake: Trinamool-Congress ties thaw ahead of Bengal pollsWith 42 MPs in the Lok Sabha and Rajya Sabha combined, the TMC holds the numbers to sway and stands third on the opposition list with 29 Lok Sabha MPs, after the Congress and the Samajwadi Party."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jimmy-fallon-roasts-trump-tariffs-india-brazil-sydney-sweeney-putin-jokes-2768375-2025-08-08",
      "headline": "Jimmy Fallon trolls Trump's India tariffs, jokes about Putin and Sydney SweeneyJimmy Fallon roasted President Trump's tariff plans affecting over 90 countries, including India and Brazil. The American comedian, in his monologue, highlighted the economic impacts surrounding Trump's trade policies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/rahul-gandhi-ev-vote-fraud-bengaluru-mahadevapura-congress-india-today-muni-reddy-garden-votes-2768207-2025-08-08",
      "headline": "80 voters in 10 sq ft house: India Today ground check on Rahul Gandhi's claimAfter Rahul Gandhi's explosive vote fraud claims, India Today's ground check in Bengaluru Central found 80 voters registered at a 10-15 sq ft house in Muni Reddy Garden. The current occupant denied links to them. The property's owner admitted many former tenants still return to vote."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/ai-in-filmmaking-innovation-or-a-threat-to-creative-freedom-2768421-2025-08-08",
      "headline": "AI in filmmaking: Innovation or a threat to creative freedom?Artificial Intelligence is shaping the present phase in films. If used transparently, these tools can be a boon that helps in streamlining pre-production, improving accessibility, and even pushing artistic boundaries. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-warns-of-1929-style-depression-if-court-rules-against-his-tariffs-2768539-2025-08-08",
      "headline": "Trump warns of '1929-style Depression' if court rules against his tariffs In a lengthy post on Truth Social, Donald Trump said tariffs were having a \"huge positive impact\" on the US economy, with \"new records set almost every day.\""
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-cant-win-indias-trust-with-false-claims-on-fake-voters-piyush-goyal-2768562-2025-08-08",
      "headline": "Rahul Gandhi can't win India's trust with false claims on fake voters: Piyush GoyalUnion Minister Piyush Goyal said that the examples of fake voters cited by Rahul Gandhi highlighted the need for conducting the SIR. He stressed the importance of factoring in migration and deaths that have occurred within a constituency over the years to ensure that only eligible voters can exercise their franchise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-notice-to-centre-on-plea-claiming-bns-revived-sedition-law-2768590-2025-08-09",
      "headline": "Supreme Court notice to Centre on plea claiming BNS revived sedition lawThe plea says that Section 152 of the BNS has \"revived and repackaged\" the sedition provisions in the IPC, after the Supreme Court had barred the filing of FIRs under Section 124A of the IPC."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/photo-essay/sholay-at-50-making-of-gabbar-singh-bollywood-greatest-villain-amjad-khan-290-07-08-2025",
      "headline": "Sholay@50: The Making of Gabbar, Bollywood's Greatest VillainWhat made Gabbar Singh the greatest villain in Bollywood history? It wasn't just Amjad's performance, though his raw intensity was undeniable. It was the magic of Salim-Javed's writing, Sippy's vision, and Amjad's ability to transcend the archetype of the Bollywood villain. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/what-india-us-trade-tensions-mean-for-indian-students-education-plans-abroad-2768415-2025-08-08",
      "headline": "What India-US trade tensions mean for Indian students' education plans abroadIf the diplomatic relationship continues to sour, future work visa opportunities like the H-1B or post-study Optional Practical Training programmes could face tighter caps or restrictions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/marathi-film-khalid-ka-shivaji-controversy-explained-secular-shivaji-portrayal-government-probes-2768302-2025-08-08",
      "headline": "Explained: The controversy around Marathi film Khalid Ka ShivajiThe Marathi film 'Khalid Ka Shivaji' has sparked controversy over its portrayal of Chhatrapati Shivaji Maharaj. Right-wing groups claim historical distortion, while the Centre seeks clarification from filmmakers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-make-in-india-comes-to-focus-in-submarine-plan-amidst-trump-shadow-2767819-2025-08-07",
      "headline": "How Make in India comes to focus in submarine plan amidst Trump shadowThe Indian Navy is in critical need of enhancing underwater capabilities as the Pakistan military is massively gaining underwater prowess with the help of China "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/k-drama-female-actors-rewriting-revenge-stories-the-glory-my-name-itaewon-class-2768335-2025-08-08",
      "headline": "How K-drama's female actors are rewriting revenge storiesFrom 'The Glory' to 'My Name', K-drama female leads are ditching the damsel-in-distress trope for fierce, calculated revenge. In this week's K-fix we'll discuss how they're redefining power on-screen.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/regang-la-battle-india-china-war-1962-ladakh-major-shaitan-singh-120-bahadur-army-soldiers-pla-farhan-akhtar-movie-2768180-2025-08-08",
      "headline": "Frozen bodies holding guns: When 120 bahadur took on 5,000 Chinese soldiersJust 120 Indian soldiers, led by Major Shaitan Singh Bhati, beat back 5,000 Chinese troopers at Rezang La in 1962, preventing China's takeover of Ladakh. A search party found frozen bodies of Indian soldiers still holding guns, showing the last stand in which 110 of the 120 Indians were killed. Revisiting the legendary battle of the 1962 Indo-China war, which is the subject of Farhan Akhtar's 120 Bahadur.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/us-picked-wrong-target-our-self-respect-not-up-for-bargaining-shashi-tharoor-calls-trump-school-bully-2768397-2025-08-08",
      "headline": "US picked wrong target: Tharoor calls Trump 'school bully' over 'dead economy' jibeSpeaking to India Today's Consulting Editor Rajdeep Sardesai about Donald Trump's \"dead economy\" jab, Shashi Tharoor said that India's self-respect was sacrosanct and \"simply not up for bargaining\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-says-it-welcomes-us-global-support-to-resolve-kashmir-issue-glbs-2768578-2025-08-09",
      "headline": "Pakistan says it welcomes US, global support to resolve Kashmir issuePakistan says it welcomes US and global help to resolve the Kashmir dispute, while India rejects third-party mediation, sticking to bilateral talks only."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshans-pool-workout-video-has-fans-gushing-over-his-sculpted-body-war-2-2768627-2025-08-09",
      "headline": "Hrithik Roshan's pool workout video has fans gushing over his sculpted bodyHrithik Roshan has shared a behind-the-scenes glimpse of his disciplined training regime for his upcoming film 'War 2'. The unfiltered video has got fans gushing over his chiselled body. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/swara-bhasker-slams-troll-casteist-jibe-husband-fahad-ahmad-2768493-2025-08-09",
      "headline": "Swara Bhasker slams troll over casteist, classist jibe at husband Fahad AhmadActor Swara Bhasker strongly reacted to a troll for his derogatory remarks about her husband Fahad Ahmad. She emphasised the classist nature of the slur in her response.\r\n "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sooraj-barjatya-salman-khan-prem-comeback-age-appropriate-family-film-2768536-2025-08-08",
      "headline": "Sooraj Barjatya on Salman Khan's return as Prem: Script must be age-appropriateDirector Sooraj Barjatya hinted at actor Salman Khan's return as Prem in Rajshri Productions' future project. He opened up on working on an age-appropriate script for Salman."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/udaipur-files-film-release-audience-reaction-kanhaiyalal-murder-case-2768525-2025-08-08",
      "headline": "Udaipur Files released after long legal battle, audience call it mirror to societyUdaipur Files has been released nationwide after legal hurdles. The film highlights societal silence and calls for justice in the Kanhaiyalal murder case."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-united-vs-newcastle-transfer-battle-analysis-2768620-2025-08-09",
      "headline": "Theatre of dreams, stage for stars: Manchester United's allure explainedManchester United may have finished 15th last season, but the badge still holds weight. For top players, Old Trafford offers something money can't buy — the chance to write the next great chapter in the Theatre of Dreams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-workload-management-test-series-selection-debate-2768610-2025-08-09",
      "headline": "DRS: Should Jasprit Bumrah be allowed to pick and choose matches?Jasprit Bumrah is a crucial pillar of India's bowling attack, but allowing him to pick and choose matches could disrupt team balance and increase pressure on other pacers. Data shows that Bumrah has struggled with injuries and workload management, so a structured rest plan is vital rather than an ad-hoc approach. A consistent, well-managed schedule can help maintain his fitness and effectiveness over the long term."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nat-sciver-brunt-the-hundred-record-trent-rockets-birmingham-phoenix-2768560-2025-08-08",
      "headline": "Nat Sciver-Brunt scripts history, becomes first-ever batter with 1000 runsThe Hundred: England skipper Nat Sciver-Brunt scripted history after becoming the first-ever player to reach the 1000-run landmark. She achieved the landmark in the match against Birmingham Phoenix at Edgbaston in Birmingham."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zim-vs-nz-devon-conway-henry-nicholls-rachin-ravindra-centuries-bulawayo-test-2768540-2025-08-08",
      "headline": "Conway, Nicholls and Ravindra centuries push New Zealand's lead to 476ZIM vs NZ: New Zealand extend their lead with yet another dominant batting display as the likes of Devon Conway, Rachin Ravindra and Henry Nicholls rack up their respective centuries to put them well in front. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/chris-woakes-emotion-batting-islocated-shoulder-oval-test-india-vs-england-2768532-2025-08-08",
      "headline": "Chris Woakes makes honest admission after batting with a dislocated shoulderEngland vs India: Chris Woakes opened up about entering the field wielding his bat with just one hand in an extraordinary display of courage at The Oval this week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pranav-venkatesh-world-junior-champion-chess-2768530-2025-08-08",
      "headline": "Pranav Venkatesh's grand move: World junior crown to hometown chess debutIn an exclusive interview with Sports Today, Pranav Venkatesh shared his experiences playing in the Junior World Championships and participating in the Chennai Grandmasters event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/robert-lewandowski-miss-joan-gamper-trophy-como-clash-hamstring-issue-2768524-2025-08-08",
      "headline": "Lewandowski to miss Barcelona's friendly vs Como due to hamstring problemFC Barcelona have confirmed that Robert Lewandowski will miss out on the friendly clash against Como for the Joan Gamper Trophy due to a slight hamstring issue. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mitchell-marsh-travis-head-australia-t20i-openers-2026-world-cup-2768511-2025-08-08",
      "headline": "Australia confirms Mitch Marsh and Travis Head as T20I openers till 2026 World CupMitchell Marsh, Australia's T20I captain, revealed on Friday that he and swashbuckling opener Travis Head, the ICC's No.2-ranked T20I batter, will remain the team's first-choice opening pair until the ICC Men's T20 World Cup next year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-u19-squad-india-series-2768513-2025-08-08",
      "headline": "Australia name two Indian-origin players for U19 series against IndiaAustralia have picked two Indian origin cricketers Aryan Sharma and Yash Deshmukh for their U19 series against India, starting September 21. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-carrington-training-complex-renovation-video-2768510-2025-08-08",
      "headline": "Manchester United's unveil newly re-developed Carrington Training complexManchester United have unveiled their redeveloped men's first-team building at Carrington, a project funded through Jim Ratcliffe's £300 million investment. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pranav-venkatesh-world-junior-champion-chess-2768530-2025-08-08",
      "headline": "Pranav Venkatesh's grand move: World junior crown to hometown chess debutIn an exclusive interview with Sports Today, Pranav Venkatesh shared his experiences playing in the Junior World Championships and participating in the Chennai Grandmasters event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/robert-lewandowski-miss-joan-gamper-trophy-como-clash-hamstring-issue-2768524-2025-08-08",
      "headline": "Lewandowski to miss Barcelona's friendly vs Como due to hamstring problemFC Barcelona have confirmed that Robert Lewandowski will miss out on the friendly clash against Como for the Joan Gamper Trophy due to a slight hamstring issue. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mitchell-marsh-travis-head-australia-t20i-openers-2026-world-cup-2768511-2025-08-08",
      "headline": "Australia confirms Mitch Marsh and Travis Head as T20I openers till 2026 World CupMitchell Marsh, Australia's T20I captain, revealed on Friday that he and swashbuckling opener Travis Head, the ICC's No.2-ranked T20I batter, will remain the team's first-choice opening pair until the ICC Men's T20 World Cup next year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-u19-squad-india-series-2768513-2025-08-08",
      "headline": "Australia name two Indian-origin players for U19 series against IndiaAustralia have picked two Indian origin cricketers Aryan Sharma and Yash Deshmukh for their U19 series against India, starting September 21. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-carrington-training-complex-renovation-video-2768510-2025-08-08",
      "headline": "Manchester United's unveil newly re-developed Carrington Training complexManchester United have unveiled their redeveloped men's first-team building at Carrington, a project funded through Jim Ratcliffe's £300 million investment. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}