{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-services-sector-growth-hits-10-month-low-in-september-2611118-2024-10-04",
      "headline": "India's services sector growth hits 10-month low in SeptemberThe HSBC final India Services purchasing managers' index, compiled by S&P Global, fell to 57.7 in September from a five-month high of 60.9 in August and was below a preliminary estimate of 58.9."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nirmala-sitharaman-india-per-capita-income-rise-2000-dollars-5-years-kautilya-economic-conclave-2611092-2024-10-04",
      "headline": "India's per capita income to surge by $2,000 in 5 years, says Nirmala SitharamanFinance Minister Nirmala Sitharaman highlighted that India is well on track to double its per capita income within a few years, largely driven by economic and structural reforms implemented over the past decade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-update-sensex-rises-800-points-nifty-gains-it-bank-shares-rebound-2611088-2024-10-04",
      "headline": "Sensex surges 800 points as IT, bank stocks power market reboundHigh-weightage Nifty IT led the sectoral indices, rising 1.8%, fuelled by strong performances in Infosys and Tech Mahindra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-motors-share-price-gains-2-percent-today-auto-stock-rally-what-next-gain-loss-buy-sell-2611077-2024-10-04",
      "headline": "Tata Motors shares rise 2% today. Will the auto stock's rally continue?Over the past year, Tata Motors has gained 54.05%, and over three years, it has surged by over 170%. The stock's beta over the past year is roughly 1, indicating average volatility during that period."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/apple-iphone-16-pro-models-made-in-india-new-stores-bengaluru-pune-delhi-mumbai-2611064-2024-10-04",
      "headline": "Apple deepens India foothold with new stores, local production of all iPhonesApple is planning to expand its retail presence in India with more flagship Apple stores in key cities as it aims to create more direct customer interactions and experiences. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/diffusion-engineers-listing-share-price-12-percent-premium-hold-sell-book-profit-expert-view-2611035-2024-10-04",
      "headline": "Diffusion Engineers shares list at 12% premium: Hold or book profit? Diffusion Engineers listing: The shares listed at Rs 188 on the Bombay Stock Exchange (BSE), marking an 11.90% rise over the issue price of Rs 168."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-price-today-october-4-2024-precious-metals-record-hike-on-mcx-2611027-2024-10-04",
      "headline": "Gold, silver price today, October 4, 2024: Precious metals record hike on MCXGold Price Today October 4, 2024: Both gold and silver are trading on the higher side of the Multi Commodity Exchange (MCX) on Friday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/reliance-power-share-price-5-percent-lower-circuit-today-board-approval-fccbs-2611026-2024-10-04",
      "headline": "Explained: Why Reliance Power shares hit 5% lower circuit todayDespite Friday's drop, Reliance Power shares have surged 64% in a month, gaining 112.82% year-to-date and 171.70% annually.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdfc-bank-q2-update-loan-deposit-gross-advances-casa-ldr-2611016-2024-10-04",
      "headline": "HDFC Bank shares Q2 update, says deposit growth outpaces loansHDFC Bank Q2 update: The bank's gross advances, or loans sanctioned and disbursed, rose by 1.3% to Rs 25.19 lakh crore in the quarter ending September, following a slight 0.8% decline in the previous quarter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-5-percent-stake-sale-upstox-23000-percent-returns-on-investment-2611004-2024-10-04",
      "headline": "Ratan Tata sells 5% stake in Upstox. The gains will surprise you Despite this partial sale, Ratan Tata still holds 95% of his original stake in the company."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/diffusion-engineers-listing-share-price-rs-188-bse-misses-expected-listing-gain-2611001-2024-10-04",
      "headline": "Diffusion Engineers shares list at 12% premium, misses expectationsDiffusion Engineers shares listing: The shares of Diffusion Engineers Limited opened at Rs 188 on the Bombay Stock Exchange (BSE) marking a premium of 11.90% over its issue price of Rs 168."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mark-zuckerberg-overtakes-jeff-bezos-as-worlds-second-richest-person-2610993-2024-10-04",
      "headline": "Mark Zuckerberg overtakes Jeff Bezos as world's second-richest person The dramatic rise in Mark Zuckerberg's fortune has been fuelled by a 23% increase in Meta's stock price since its better-than-expected Q2 results.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-bell-sensex-nifty-middle-east-conflict-iran-israel-war-2610988-2024-10-04",
      "headline": "Sensex falls 200 points, Nifty dips on Middle East conflict concernsThe S&P BSE Sensex was down 183.91 points at 82,306.09 at 9:46 am, while the NSE Nifty50 fell 52.25 points to 25,188.05."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/kpmg-survey-9-in-10-indian-ceos-want-employee-rewards-incentives-raise-promotion-link-to-office-attendance-2610761-2024-10-03",
      "headline": "KPMG survey: 90% of Indian CEOs wish to link rewards to office attendanceThe survey also mentioned that 78% of Indian CEOs expect a full return to office-based work in the next three years, slightly below the global figure of 83%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/iran-israel-conflict-indian-listed-companies-linked-to-middle-east-crisis-adani-port-tcs-wipro-infosys-titan-2610708-2024-10-03",
      "headline": "Middle East crisis: Indian companies linked to Israel you should know aboutThere are at least 14 listed Indian companies that have a presence or business connections in Israel. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-to-supply-clean-energy-for-google-cloud-operations-in-india-khavda-gujarat-2610686-2024-10-03",
      "headline": "Adani to supply clean energy for Google's cloud operations in IndiaThe renewable energy will come from a new solar-wind hybrid project located at Khavda, Gujarat, which is home to the world's largest renewable energy facility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-futures-and-options-new-tighter-rules-derivatives-trading-impact-brokers-traders-retail-investors-2610625-2024-10-03",
      "headline": "Sebi F&O rules: What it means for brokerage firms, stock exchanges and tradersThese new regulations, set to take effect in phases beginning November 20, could significantly impact market volumes and dampen retail trading sentiment, according to market analysts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/closing-bell-sensex-nifty-dip-as-iran-israel-conflict-triggers-oil-and-inflation-fears-2610591-2024-10-03",
      "headline": "Sensex, Nifty dip as Iran-Israel conflict triggers oil and inflation fearsThe S&P BSE Sensex lost 1769.19 points to end at 82,497.10, while the Nifty50 closed 546.80 points lower to close at 25,250.10. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/iran-israel-conflict-middle-east-tension-crude-oil-price-jumps-on-supply-fears-impact-india-expert-view-2610494-2024-10-03",
      "headline": "Iran-Israel conflict: Crude oil jumps on supply fears, will it impact India?As tensions escalate in the Middle East, a region that plays a critical role in global oil production, concerns over potential supply disruptions have driven prices higher."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-update-sensex-down-1400-points-middle-east-crisis-iran-israel-2610466-2024-10-03",
      "headline": "Sensex crashes 1,700 points as Middle East crisis triggers bloodbath on D-StreetThe Sensex was down 1,737.30 points, trading at 82,528.99 at around 1:47 pm, while the NSE Nifty50 tumbled 530.70 points to 25,266.20."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/irans-supreme-leader-ayatollah-ali-khamenei-first-friday-sermon-five-years-days-after-attack-on-israel-2610997-2024-10-04",
      "headline": "Iran's Khamenei to give 1st Friday sermon in 5 years days after attacking Israel Live UpdatesHis rare Friday sermon comes ahead of the one-year anniversary of the Israel-Hamas war in Gaza. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iraj-elahi-india-today-exclusive-iran-envoy-israel-strikes-middle-east-stability-conflict-2611067-2024-10-04",
      "headline": "Not the Iran of 1981 when Saddam Hussein invaded: Envoy warns Israel of reprisalIranian Ambassador to India Iraj Elahi said Iran's missile attack had damaged Israel's military facilities and slammed Benjamin Netanyahu for ignoring human principles while bombarding Gaza."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-amit-shah-delhi-drug-bust-kingpin-youth-dark-world-pm-modi-government-slams-2611099-2024-10-04",
      "headline": "Congress wants to take youth to dark world of drugs: Amit Shah on Delhi drug bustAmit Shah, in a post on X, claimed that while the Modi government is committed to a \"zero tolerance\" policy on drugs, Congress is allegedly using its political influence to enable drug trafficking. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/october-7-anniversary-symbolism-war-jitters-israel-hamas-gaza-iran-lebanon-conflict-yom-kippur-middle-east-2611089-2024-10-04",
      "headline": "Symbolism of war: Why fears of a big bang around October 7In a culture that lays emphasis on symbols, October 7 has gained special significance. There is a reason why Israel was attacked on October 7, and why people fear there could be a big bang on the first anniversary of the Hamas attack this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/ctrl-review-rating-ananya-panday-vikramaditya-motwane-netflix-2611022-2024-10-04",
      "headline": "CTRL review: Clever concept, tedious executionReleased-Fri Oct 04, 2024CTRL movie review: Ananya Panday's film offers an intriguing concept about AI's impact on life and love but falters with a tedious execution, ultimately failing to deliver a compelling message.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/tirupati-animal-fat-in-laddu-row-probe-team-comprising-cbi-andhra-pradesh-police-food-safety-body-fssai-supreme-court-2611030-2024-10-04",
      "headline": "Tirupati laddu row: Supreme Court forms special team, CBI to monitor probeTirupati laddu row: The new probe team will consist of members of the CBI, state police, and FSSAI. The Supreme Court said the allegations had the potential of hurting sentiments of people worldwide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-ali-khamenei-supreme-leader-friday-sermon-suicide-bombing-tehran-middle-east-tensions-2611074-2024-10-04",
      "headline": "When bomber blew self up, Khamenei had paused Friday sermon for just 3 minutesIn 1985, Iran's Ali Khamenei, then President, had survived an assassination bid while he was giving a Friday sermon at Tehran University. Thirty-nine years later, Khamenei delivered a Friday sermon for the first time in five years."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/pune/story/pune-woman-gangraped-men-posing-activists-friend-beaten-up-bopdev-ghat-area-2611008-2024-10-04",
      "headline": "21-year-old gang-raped by three men posing as activists in Pune, friend beaten upPune police arrested one suspect after he and his two friends raped a 21-year-old woman in Pune. The survivor's friend was also beaten up before the accused raped the woman."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/beauty/story/is-skincare-infused-makeup-worth-the-hype-2610698-2024-10-04",
      "headline": "Is skincare-infused makeup worth the hype?Dermatologists say that while this shift towards hybrids is a step up from traditional makeup, it can also be misleading. These hybrid products can essentially benefit those who regularly wear makeup, as several makeup products can harm the skin in various ways."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/amethi-teacher-family-killed-complaint-eve-teasing-sc-st-act-uttar-pradesh-2611075-2024-10-04",
      "headline": "If anything happens, he'll be responsible: Amethi family shot dead had told copsThe woman's complaint mentioned that \"if anything happens to her or her family,\" Chandan Verma, against whom the family had filed a case under the SC/ST Act and for eve-teasing, should be held responsible."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/the-importance-of-being-vinesh-phogat-opinion-2610804-2024-10-04",
      "headline": "The importance of being Vinesh PhogatFor the Congress, Vinesh Phogat's decision to plunge into the political battle has given them another talking point. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/agra/story/agra-teacher-scam-call-daughter-sex-racket-one-lakh-demand-dies-heart-attack-2610966-2024-10-04",
      "headline": "Agra teacher gets scam call about daughter's sex racket, dies of heart attackThe accused threatened to leak videos of the victim's daughter if Rs. 1 lakh wasn't transferred to their account. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/sun-solar-flare-earth-satellite-power-grid-2611087-2024-10-04",
      "headline": "Sun erupts with strongest flare: Earth's satellite, power grid in firing lineThis event will coincide with an earlier coronal mass ejection (CME) anticipated to arrive between October 4 and 5, heightening the likelihood of geomagnetic storms and auroras this weekend."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/hashem-safieddine-hassan-nasrallah-cousin-israeli-airstrike-lebanon-beirut-symbolic-funeral-middle-east-tensions-2610936-2024-10-04",
      "headline": "Will Hashem Safieddine's targeting cast shadow over Nasrallah's symbolic funeralHours before a symbolic funeral for slain Hezbollah chief Hassan Nasrallah is set to be held today, an Israeli airstrike in Beirut targeted his cousin, Hashem Safieddine. But will the strike on Hashem Safieddine impact Nasrallah's symbolic funeral today?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/delhi-drug-bust-fifth-arrest-amritsar-airport-cocaine-accused-2611014-2024-10-04",
      "headline": "Indian man residing in UK for 17 years caught in Rs 5,000-crore Delhi drug bustJitendra Pal Singh, alias Jassi, came to India to supervise the drug cartel's operations in the country but was planning to escape after the bust."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/video/ground-report-southern-lebanon-turns-into-warzone-as-israel-targets-hezbollah-2611043-2024-10-04",
      "headline": "Ground Report: Southern Lebanon turns into warzone as Israel targets HezbollahSouthern Lebanon has turned into a battlefield as Israel has carried out over 200 aerial strikes in the last 24 hours. In a report, India Today's Ashraf Wani highlighted the presence of the US Navy's warships in the Mediterranean Sea given the Israeli strikes. Meanwhile, a massive symbolic funeral of Hezbollah Secretary-General Hassan Nasrallah, who was killed in an Israeli airstrike, will be held on Friday, October 4. Iran's Supreme Leader Ayatollah Ali Khamenei will lead the prayers from Iran."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/joker-folie-a-deux-review-lady-gaga-and-joaquin-phoenixs-film-is-a-big-misfire-2611021-2024-10-04",
      "headline": "Joker Folie à Deux review: Lady Gaga and Joaquin Phoenix's film is a big misfireReleased-Fri Oct 04, 2024Joker Folie à Deux, starring Joaquin Phoenix and Lady Gaga, is a big disappointment. There's no proper story or character arc, says our review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-supersonic-hypersonic-missiles-hit-israel-india-air-defense-system-capabilities-against-china-pakistan-missiles-s400-2610665-2024-10-04",
      "headline": "Does India have an Iron Dome of its own to fend off swarm of missiles?Iran on October 1 fired around 200 ballistic missiles at Israel. It was the biggest test for the Jewish nation's fabled air defence system. Iran, it was reported, used hypersonic missiles too. Can India's air defence system fend off a similar missile attack by its adversaries? This is what we know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-iran-war-lebanon-beirut-attack-hezbollah-hassan-safieddine-2610957-2024-10-04",
      "headline": "Israeli strike cuts key border escape route as army widens Lebanon operation  Live UpdatesIsrael has intensified its bombardment of areas in Lebanon where Hezbollah has a strong presence. The latest round of attacks was the largest since it began its operation against the Iran-backed terror group."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ashwini-vaishnaw-telangana-minister-konda-surekha-samantha-prabhu-naga-chaitanya-divorce-remark-2610960-2024-10-04",
      "headline": "Anti-woman mindset: Ashwini Vaishnaw slams Telangana minister's divorce remarkUnion Minister Ashwini Vaishnaw slammed Telangana minister Konda Surekha over her remarks on the divorce of actors Samantha Prabhu and Naga Chaitanya, accusing the Congress of having an anti-woman mindset."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/barack-obama-shares-heartfelt-note-for-wife-michelle-on-32nd-wedding-anniversary-2611017-2024-10-04",
      "headline": "Barack Obama shares heartfelt note for wife Michelle on 32nd wedding anniversaryIn his post, Barack Obama shared a picture with his wife Michelle as both posed at an art museum and flashed million-dollar smiles. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/vinesh-phogat-coach-mahavir-phogat-tension-babita-phogat-complaint-paris-olympics-2610979-2024-10-04",
      "headline": "My father Mahavir Phogat worked hard for Vinesh, she never thanked him: BabitaBabita Phogat revealed how her father, Mahavir, helped Vinesh overcome personal loss and become one of India's most decorated wrestlers. Babita said it has been disappointing to see Vinesh not acknowledging coach Mahavir's contributions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-hezbollah-war-russia-weapon-depot-syria-west-coast-2610356-2024-10-03",
      "headline": "Iran's Khamenei leads Friday prayers in TehranIsrael-Hezbollah war news live updates: Iranian Supreme Leader Ayatollah Ali Khamenei is leading Friday prayers in Tehran. He will also deliver his first sermon in nearly five years, days after Iran launched 200 missiles at Israel in retaliation against the killing of Hezbollah chief Hassan Nasrallah. A video showed people commemorating the slain Hezbollah leader before the prayers. Notably, reports suggested that Khamenei had been shifted to a safe place following Israeli attacks on Hezbollah headquarters in Beirut. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-update-sensex-rises-800-points-nifty-gains-it-bank-shares-rebound-2611088-2024-10-04",
      "headline": "Sensex surges 800 points as IT, bank stocks power market reboundHigh-weightage Nifty IT led the sectoral indices, rising 1.8%, fuelled by strong performances in Infosys and Tech Mahindra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/bigg-boss-18-salman-khan-returns-as-host-promises-time-ka-tandav-2611083-2024-10-04",
      "headline": "Bigg Boss 18: Salman Khan returns as host, promises 'time ka tandav'Bollywood superstar Salman Khan has returned as Bigg Boss 18 host. In a new promo shared by makers, Salman teased the theme of the show and said this time around, Bigg Boss will predict the future. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/coldplay-concert-with-india-tickets-sold-out-fans-turn-to-abu-dhabi-2611126-2024-10-04",
      "headline": "Coldplay concert: With India tickets sold out, fans turn to Abu DhabiColdplay's January 2025 concerts in India have sold out, prompting many Indian fans to seek tickets for shows in Abu Dhabi. Easy visas and similar pricing make Abu Dhabi a popular choice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kareena-kapoor-has-the-sweetest-birthday-wish-for-funny-loving-soha-ali-khan-2611094-2024-10-04",
      "headline": "Kareena Kapoor has the sweetest birthday wish for 'funny, loving' Soha Ali KhanSoha Ali Khan is celebrating her birthday today, October 4. Her sister-in-law Kareena Kapoor Khan had the sweetest wish for Soha. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/govinda-discharged-hospital-greets-media-with-flying-kiss-bullet-injury-licenced-revolver-sunita-ahuja-2611114-2024-10-04",
      "headline": "Govinda gets discharged from hospital, greets media with flying kissActor and Shiv Sena leader Govinda was discharged from the hospital today, October 4, after his bullet injury. The actor was admitted at CritiCare Hospital"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-jannik-sinner-big-three-mats-wilander-comparison-2611109-2024-10-04",
      "headline": "At their best, Carlos Alcaraz and Jannik Sinner better than the Big 3: Mats WilanderLegendary Mats Wilander said Carlos Alcaraz and Jannik Sinner have been producing tennis at a higher level than the Big Three of Roger Federer, Rafael Nadal and Novak Djokovic. Alcaraz and Sinner were involved in a slugfest in the China Open earlier in October. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/irani-cup-2024-abhimanyu-easwaran-double-century-miss-mumbai-vs-rest-of-india-2611079-2024-10-04",
      "headline": "Irani Cup 2024: Abhimanyu Easwaran misses out on heroic double-hundredAbhimanyu Easwaran fell agonizingly short of a double century, dismissed for 191, while Dhruv Jurel also missed his century as Rest of India fought hard against Mumbai's massive total in the Irani Cup 2024 clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dhruv-jureal-disappointment-93-irani-cup-2024-rest-of-india-vs-mumbai-2611076-2024-10-04",
      "headline": "Irani Cup: Dhruv Jurel gutted after missing well-deserved hundred by whiskerIrani Cup 2024: Dhruv Jurel was disappointed after missing out on a well-deserved hundred on Day 4 of the Irani Cup match in Lucknow. The wicketkeeper-batter was caught down the leg-side, minutes before the lunch break. Abhimanyu Easwaran missed his double hundred by 9 runs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-birthday-yuvraj-singh-delhi-capitals-lead-wishes-27-2611059-2024-10-04",
      "headline": "Rishabh Pant turns 27: Yuvraj Singh leads birthday wishes to 'comeback King' World Cup-winning former India all-rounder Yuvraj Singh wished 'Comeback King' Rishabh Pant on his 27th birthday. Delhi Capitals came up with a special comic book, recalling the highlights of their captain's glorious career. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-t20i-pacers-hardik-pandya-arshdeep-singh-net-practice-session-2611049-2024-10-04",
      "headline": "Watch: India pacers, ft Arshdeep, Hardik gear up for Bangladesh T20IsIndia's pacers, led by Arshdeep Singh and Hardik Pandya, prepared rigorously for their upcoming T20I series against Bangladesh, aiming to carry forward the momentum from their dominant 2-0 Test series victory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-women-cricket-team-families-video-message-smriti-mandhana-harmanpreet-amol-majumdar-2611028-2024-10-04",
      "headline": "Watch: Smriti Mandhana emotional as families wish India players in video messagesWomen's T20 World Cup 2024: Families of the players and members of the support staff sent special video messages, wishing the team success in the showpiece event. India will open their campaign against New Zealand in Dubai on Friday, October 4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/vinesh-phogat-coach-mahavir-phogat-tension-babita-phogat-complaint-paris-olympics-2610979-2024-10-04",
      "headline": "My father Mahavir Phogat worked hard for Vinesh, she never thanked him: BabitaBabita Phogat revealed how her father, Mahavir, helped Vinesh overcome personal loss and become one of India's most decorated wrestlers. Babita said it has been disappointing to see Vinesh not acknowledging coach Mahavir's contributions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rashid-khan-wedding-ceremony-kabul-afghanistan-cricket-all-rounder-watch-2610965-2024-10-04",
      "headline": "Watch: Afghanistan all-rounder Rashid Khan's grand wedding in KabulAfghanistan's star spinner Rashid Khan celebrated a grand wedding in Kabul on October 3, 2024, with videos of the event taking social media by storm. National teammates and fans joined in to celebrate the cricket icon's special day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-vs-porto-erik-ten-hag-europa-league-trust-in-process-performance-2610952-2024-10-04",
      "headline": "Manchester United's Ten Hag asks for 'trust in process' after Porto scareErik ten Hag urged Manchester United fans to trust his process despite a 3-3 Europa League draw against Porto. United blew a two-goal lead, continuing their winless streak across competitions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/womens-t20-world-cup-india-new-zealand-sophie-divine-new-batting-position-future-2610941-2024-10-04",
      "headline": "Sophie Divine trusts New Zealand's new batting order for T20 World CupNew Zealand's Women's captain Sophie Divine backed the side's fresh batting order, including her new spot in the middle, for their T20 World Cup campaign. Divine hailed the new order as instrumental for the next generation of New Zealand's Women's team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-new-zealand-harmanpreet-kaur-sophie-devine-preview-2610685-2024-10-04",
      "headline": "Harmanpreet's India begin title hunt against struggling New ZealandWomen's T20 World Cup 2024: Harmanpreet Kaur's India will have the upper hand when they face Sophie Devine's New Zealand in Dubai on Friday. India won both their matches in the warm-ups and will be high on confidence before the group games. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/vinesh-phogat-coach-mahavir-phogat-tension-babita-phogat-complaint-paris-olympics-2610979-2024-10-04",
      "headline": "My father Mahavir Phogat worked hard for Vinesh, she never thanked him: BabitaBabita Phogat revealed how her father, Mahavir, helped Vinesh overcome personal loss and become one of India's most decorated wrestlers. Babita said it has been disappointing to see Vinesh not acknowledging coach Mahavir's contributions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rashid-khan-wedding-ceremony-kabul-afghanistan-cricket-all-rounder-watch-2610965-2024-10-04",
      "headline": "Watch: Afghanistan all-rounder Rashid Khan's grand wedding in KabulAfghanistan's star spinner Rashid Khan celebrated a grand wedding in Kabul on October 3, 2024, with videos of the event taking social media by storm. National teammates and fans joined in to celebrate the cricket icon's special day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-vs-porto-erik-ten-hag-europa-league-trust-in-process-performance-2610952-2024-10-04",
      "headline": "Manchester United's Ten Hag asks for 'trust in process' after Porto scareErik ten Hag urged Manchester United fans to trust his process despite a 3-3 Europa League draw against Porto. United blew a two-goal lead, continuing their winless streak across competitions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/womens-t20-world-cup-india-new-zealand-sophie-divine-new-batting-position-future-2610941-2024-10-04",
      "headline": "Sophie Divine trusts New Zealand's new batting order for T20 World CupNew Zealand's Women's captain Sophie Divine backed the side's fresh batting order, including her new spot in the middle, for their T20 World Cup campaign. Divine hailed the new order as instrumental for the next generation of New Zealand's Women's team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-new-zealand-harmanpreet-kaur-sophie-devine-preview-2610685-2024-10-04",
      "headline": "Harmanpreet's India begin title hunt against struggling New ZealandWomen's T20 World Cup 2024: Harmanpreet Kaur's India will have the upper hand when they face Sophie Devine's New Zealand in Dubai on Friday. India won both their matches in the warm-ups and will be high on confidence before the group games. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-vs-porto-europa-league-scare-draw-bruno-fernandes-harry-maguire-2610929-2024-10-04",
      "headline": "United's mishaps continue after surviving Porto scare in Europa LeagueManchester United blew a two-goal lead, ultimately settling for a 3-3 draw against Porto in the Europa League. Late heroics from Harry Maguire saved them from defeat, but criticism of their performance continues to mount."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sophie-devine-not-thinking-of-retirement-amid-decision-to-leave-t20i-captaincy-2610904-2024-10-04",
      "headline": "Sophie Devine not thinking of retirement amid decision to leave T20I captaincySophie Devine said that she is not thinking about retirement after her decision to relinquish the T20I captaincy for New Zealand after the Women's T20 World Cup 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sarfaraz-khan-musheer-khan-irani-cap-mumbai-vs-rest-of-india-2610898-2024-10-03",
      "headline": "Had promised my family that I would score hundred for Musheer too: Sarfaraz KhanIndia and Mumbai batter Sarfaraz Khan revealed that he had promised his family members that he would score a hundred on behalf of his injured brother Musheer as well in the Irani Cup. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/womens-t20-world-cup-amol-mazumdar-calls-variety-in-indian-team-happy-headache-2610889-2024-10-03",
      "headline": "Women's T20 World Cup: Amol Mazumdar calls variety in Indian team 'happy headache'Indian Women's Team head coach Amol Mazumdar said that it is a 'happy headache' to have such variety and depth in the squad. India will take on New Zealand in their tournament opener of Women's T20 World Cup 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harmanpreet-kaur-amol-muzumdar-womens-t20-world-cup-2024-2610887-2024-10-03",
      "headline": "Harmanpreet Kaur to bat at number 3 in T20 World Cup, reveals coach Amol MuzumdarIndia head coach Amol Muzumdar revealed that India captain Harmanpreet Kaur will be batting at number three in the Women's T20 World Cup 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-2024-pakistan-vs-sri-lanka-fatima-sana-chamari-athapaththu-sharjah-2610880-2024-10-03",
      "headline": "Women's T20 World Cup: Pakistan start campaign with resounding 31-run win over Sri LankaPakistan kickstarted their campaign with a resounding 31-run win against Asia Cup 2024 winners Sri Lanka in Sharjah. Pakistan captain Fatima Sana led the team from the front with her all-round show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-uncapped-player-mohammad-kaif-ipl-2025-2610861-2024-10-03",
      "headline": "Rules will keep changing till MS Dhoni wants to play: Mohammad KaifFormer India cricketer Mohammad Kaif said that the Indian Premier League (IPL) will continue to change its rules to allow MS Dhoni to play, as long as he wants it. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-favourites-new-zealand-harmanpreet-kaur-sophie-devine-2610859-2024-10-03",
      "headline": "India strong favourites against out-of-form New ZealandWomen's T20 World Cup 2024: Harmanpreet Kaur's India have been in stupendous form, having also beaten West Indies and South Africa in their warm-up matches. New Zealand, on the other hand, have lost their last 10 matches in Women's T20Is. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harmanpreet-kaur-amol-muzumdar-womens-t20-world-cup-2024-2610887-2024-10-03",
      "headline": "Harmanpreet Kaur to bat at number 3 in T20 World Cup, reveals coach Amol MuzumdarIndia head coach Amol Muzumdar revealed that India captain Harmanpreet Kaur will be batting at number three in the Women's T20 World Cup 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-2024-pakistan-vs-sri-lanka-fatima-sana-chamari-athapaththu-sharjah-2610880-2024-10-03",
      "headline": "Women's T20 World Cup: Pakistan start campaign with resounding 31-run win over Sri LankaPakistan kickstarted their campaign with a resounding 31-run win against Asia Cup 2024 winners Sri Lanka in Sharjah. Pakistan captain Fatima Sana led the team from the front with her all-round show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-uncapped-player-mohammad-kaif-ipl-2025-2610861-2024-10-03",
      "headline": "Rules will keep changing till MS Dhoni wants to play: Mohammad KaifFormer India cricketer Mohammad Kaif said that the Indian Premier League (IPL) will continue to change its rules to allow MS Dhoni to play, as long as he wants it. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-favourites-new-zealand-harmanpreet-kaur-sophie-devine-2610859-2024-10-03",
      "headline": "India strong favourites against out-of-form New ZealandWomen's T20 World Cup 2024: Harmanpreet Kaur's India have been in stupendous form, having also beaten West Indies and South Africa in their warm-up matches. New Zealand, on the other hand, have lost their last 10 matches in Women's T20Is. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-pacer-diana-baig-injury-scare-sri-lanka-2610845-2024-10-03",
      "headline": "Teary-eyed Diana Baig walks off as Pakistan suffer big injury scareWomen's T20 World Cup 2024: Pakistan fast bowler Diana Baig walked off the park after bowling only a solitary delivery in the match against Sri Lanka on Friday in Sharjah. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-nahida-akter-shakib-al-hasan-elite-club-scotland-2610812-2024-10-03",
      "headline": "Bangladesh's Nahida Akter joins Shakib Al Hasan in elite T20I clubWomen's T20 World Cup 2024: Left-arm Nahida Akter became the third Bangladeshi bowler to take 100 wickets in T20Is after Shakib Al Hasan and Mustafizur Rahman. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zaheer-abbas-pakistan-cricket-board-babar-azam-2610808-2024-10-03",
      "headline": "Zaheer Abbas blames lure of money via T20s for downfall of Pakistan cricketLegendary Pakistan batter Zaheer Abbas has blamed the involvement of money in T20s for the downfall of Pakistan cricket. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-nations-league-france-squad-announcement-kylian-mbappe-rested-didier-deschamps-2610802-2024-10-03",
      "headline": "Nations League: Kylian Mbappe rested by France, Michael Olise called up againFrance have decided to give Kylian Mbappe a rest for their upcoming UEFA Nations League matches against Israel and Belgium as they announced the squad on October 3, Thursday. Michael Olise has been added to the squad once again. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}