{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/old-income-tax-regime-benefits-proposed-hra-meal-vouchers-is-it-better-now-salaried-individuals-2871962-2026-02-21",
      "headline": "Old tax regime gets a boost. Does it work better for you than the new one?Handcrafted ByOur Editors If you have moved on to the new income tax regime, should you give the old one another look after the proposed benefits? Read on to see what the changes could mean for your tax savings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-is-catching-up-fast-with-us-china-in-ai-race-indiaai-ceo-abhishek-singh-2871846-2026-02-20",
      "headline": "India is catching up fast with US, China in AI race: IndiaAI CEO Abhishek SinghIn an exclusive interview following the Grand AI India Impact Summit, Abhishek Singh, CEO of India's Mission AI, discusses the nation's emerging role in the global artificial intelligence landscape."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/brazil-president-lula-exclusive-india-brazil-trade-own-currency-need-not-rely-on-us-dollar-2871794-2026-02-20",
      "headline": "Brazilian President Lula says India and Brazil can trade without relying on US dollarAs Brazil looks to deepen ties with India, Brazilian President Luiz Inácio Lula da Silva signals a future where the two economies trade more, rely less on the US dollar, and build a partnership driven by growth, technology and trust."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/no-debates-within-brics-to-create-new-currency-brazils-lula-to-india-today-2871784-2026-02-20",
      "headline": "No debates within BRICS to create new currency: Brazil's Lula to India TodayIn an exclusive interview with India Today TV, Brazilian President Luiz Inacio Lula da Silva clarified there is no BRICS currency plan, but said India and Brazil can still rethink dollar-based trade and slowly build alternatives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/can-you-open-multiple-ppf-accounts-here-is-the-answer-2871751-2026-02-20",
      "headline": "Can you open multiple PPF accounts? Here's the answerThe Public Provident Fund (PPF) is one of India's most trusted long-term savings options, thanks to its tax benefits, steady returns and government backing. Many investors, however, wonder if it's possible to open more than one PPF account to save more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sips-in-crypto-what-they-are-and-how-to-get-started-2871634-2026-02-20",
      "headline": "SIPs in crypto? What they are and how to get startedCrypto is often linked with sharp price swings and high risk. SIPs, on the other hand, are associated with steady, long-term investing. So what happens when these two very different ideas come together? That is where the conversation around crypto SIPs begins."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ai-is-like-a-tsunami-hitting-jobs-market-warns-imfs-chief-2871599-2026-02-20",
      "headline": "Exclusive: AI is like a tsunami hitting jobs market, warns IMF's chiefAccording to Georgieva, AI can boost growth and raise incomes. However, if not handled carefully, it can deepen inequality and unsettle workers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-over-300-points-higher-nifty-gains-despite-market-volatility-2871564-2026-02-20",
      "headline": "Sensex ends over 300 points higher, Nifty gains despite market volatilityThe S&P BSE Sensex rose 316.57 points to end at 82,814.71, while the Nifty50 gained 116.90 points to settle at 25,571.25. Broader market indices also recovered well through the afternoon, lifting overall sentiment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-jumps-nearly-rs-1000-silver-surges-rs-4000-time-to-invest-or-wait-for-a-dip-bullion-gold-prices-silver-prices-2871519-2026-02-20",
      "headline": "Gold jumps nearly Rs 1,000, silver surges Rs 4,000: Time to invest or wait for a dip?After several weeks of uncertainty, gold and silver are now moving higher with steady gains. This has boosted market sentiment, but it has also left many wondering whether to buy now or wait for more favourable prices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/biryani-billing-scam-multicrore-tax-evasion-rs-70000-turnover-supression-2871475-2026-02-20",
      "headline": "How Hyderabad's love for biryani exposed a nationwide multi-crore tax scamIn India, biryani is more than food. It is an emotion that finally left a trail too big to hide. Read on to find out how it exposed a nationwide multi-crore tax scam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/8th-pay-commission-when-will-you-get-your-arrears-and-salary-hike-2871457-2026-02-20",
      "headline": "8th Pay Commission: When will you get your arrears and salary hike?Central government employees and pensioners are closely watching every update on the 8th Pay Commission. The big questions remain, i.e., when will the new pay structure be implemented, and when will arrears actually reach your bank account?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/guardrails-needed-as-ai-reshapes-jobs-and-global-growth-says-imf-chief-2871416-2026-02-20",
      "headline": "IMF chief says India well-positioned in AI race thanks to digital infrastructureAccording to Kristalina Georgieva, India is in a strong position due to its early investment in digital public infrastructure, which now forms the base for wider AI access."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/income-tax-evasion-fraud-biryani-chains-billing-scam-2871390-2026-02-20",
      "headline": "How a biryani billing trail exposed tax scam; Rs 70,000 crore sales hiddenWhat began as a simple I-T review of biryani restaurant bills turned into a sweeping hunt for Rs 70,000 crore in suppressed sales buried across the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/dutch-company-asml-jumps-90-last-si-months-global-tech-ecosystem-explained-2871359-2026-02-20",
      "headline": "Why has this Dutch company's stock gained over 90% on Nasdaq in six months?ASML Holding's stock has gained 94.66% in the past six months on the US stock exchange Nasdaq, where many of the world's biggest technology companies list their shares. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/infosys-tech-mahindra-tcs-why-it-stocks-are-crashing-again-today-2871347-2026-02-20",
      "headline": "Infosys, Tech Mahindra, TCS: Why IT stocks are falling again todayThe slide in IT stocks raises fresh questions about what is spooking investors and how long this uneasy phase could last. A closer look may reveal more than the morning numbers suggest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-nifty-high-volatility-us-iran-tensions-2871341-2026-02-20",
      "headline": "Sensex, Nifty open flat amid volatility, IT stocks continue to declineWith global cues expected to remain volatile, investors are likely to stay cautious. Movements in crude oil, the rupee and developments in the US–Iran standoff will remain key drivers for market direction through the day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/uk-and-india-must-shape-ai-together-says-kanishka-narayan-2871082-2026-02-19",
      "headline": "UK and India must shape AI together, says Kanishka NarayanIn an exclusive conversation with India Today, UK AI Minister Kanishka Narayan highlighted the strengthening technological partnership between India and the United Kingdom."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/bnw-developments-radisson-hotel-group-launch-radisson-blu-rak-central-ras-al-khaimah-hotel-branded-residences-uae-property-market-2871035-2026-02-19",
      "headline": "BNW Developments partners with Radisson Hotel Group for hotel and residencesThe development will include the Radisson Blu Hotel, RAK Central, with 361 rooms, and Radisson Blu Residences, RAK Central, with 222 branded homes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-well-positioned-to-lead-in-ai-sam-altman-at-ai-impact-summit-2870977-2026-02-19",
      "headline": "India well-positioned to lead in AI: Sam Altman at AI Impact SummitOpenAI CEO Sam Altman hailed India's rapid progress in 'sovereign AI' and said it's well-positioned to lead in AI."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-crash-closing-bell-sensex-closes-1236-points-lower-nifty-below-25500-indigo-down-3-percent-2870960-2026-02-19",
      "headline": "Sensex closes 1,236 points lower, Nifty below 25,500; IndiGo down 3%The S&P BSE Sensex tanked 1,236.11 points to close at 82,498.14, while the NSE Nifty50 lost 365 points to end at 25,454.35. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kh-x-rk-rajinikanth-kamal-haasan-recreate-retro-vibes-in-gangster-themed-promo-2871985-2026-02-21",
      "headline": "KH X RK: Rajinikanth-Kamal Haasan recreate retro vibes in gangster themed promo The announcement video of Rajinikanth-Kamal Haasan's KH X RK was released on February 21, 2026. The promo shows both icons in a retro look."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rajpal-yadav-attends-nieces-wedding-after-bail-expresses-gratitude-to-wife-2871942-2026-02-21",
      "headline": "Rajpal Yadav attends niece's wedding after bail, expresses gratitude to wife Rajpal Yadav attended his niece's wedding after being granted interim bail in the cheque bounce case. In an emotional statement, he expressed gratitude towards his wife."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/assi-box-office-collection-day-1-taapsee-pannus-film-opens-on-decent-note-2871955-2026-02-21",
      "headline": "Assi box office collection day 1: Taapsee Pannu's film opens on decent note Taapsee Pannu's crime-drama, Assi had a slow opening on its first day. The film, directed by Anubhav Sinha, also features Kani Kusruti, Revathy, and Mohammed Zeeshan Ayyub."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/how-johnny-depp-eased-eric-danes-financial-burdens-before-his-death-from-als-2871918-2026-02-21",
      "headline": "How Johnny Depp eased Eric Dane's financial burdens before his death from ALS Johnny Depp supported late actor Eric Dane by reportedlly providing a rent-free Los Angeles home during his final months. The Grey's Anatomy star died on Thursday at the age of 53 following a 10-month battle with ALS."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/india-ott-hinterland-sagas-kohrra-mirzapur-popular-2871033-2026-02-21",
      "headline": "Mitti over metro: Heartland stories emerge as Indian OTT's bestseller genre India's OTT platforms are witnessing a surge in hinterland-themed shows that highlight regional stories and authentic rural life. In this week's Cinematic Saturday, we explore how this shift reflects audiences' desire for relatable content rooted in their own cultural and social realities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tapsee-pannu-marriage-freedom-long-distance-relationship-mathias-boe-2871864-2026-02-20",
      "headline": "Never lets me feel burden of relationship: Taapsee Pannu on husband Mathias Boe Actor Taapsee Pannu has shared candid insights about husband Mathias Boe, revealing the one condition she had before marriage and what truly makes him special.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/eric-dane-final-interview-als-battle-legacy-netflix-documentary-2871844-2026-02-20",
      "headline": "Eric Dane's final interview now streams in Netflix's 'Famous Last Words' Eric Dane opened up in a powerful Famous Last Words interview, sharing reflections on regret, resilience and legacy that leave a lasting impact.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhurandhar-espionage-thriller-breaks-box-office-records-26-11-mumbai-attack-scenes-2871779-2026-02-20",
      "headline": "R Madhavan says Dhurandhar stars broke down after 26/11 scene R Madhavan reveals how Akshaye Khanna and Arjun Rampal reacted after filming the 26/11 sequence in Dhurandhar -- and why the moment changed everything on set.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/netflix-pavane-review-slow-romance-emotional-depth-2871765-2026-02-20",
      "headline": "Pavane review: Moon Sang-min leads a tepid romance that never quite soarsRelease Date:Fri Feb 20, 2026 Netflix's Pavane is a slow-paced romance set in Seoul's department store. The film explores subtle emotional connections but struggles to gain momentum."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kh-x-rk-rajinikanth-kamal-haasan-go-full-retro-swag-in-new-poster-promo-out-soon-2871748-2026-02-20",
      "headline": "KH X RK: Rajinikanth-Kamal Haasan go retro with swag in new poster, promo out soon Rajinikanth and Kamal Haasan, two iconic figures of Tamil cinema, will share the screen again after nearly five decades, with a vintage-themed promo video set to release on Saturday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/chiraiya-teaser-divya-dutta-leads-hard-hitting-social-drama-on-marital-consent-2871743-2026-02-20",
      "headline": "Chiraiya teaser: Divya Dutta leads hard-hitting social drama on marital consent The teaser of Chiraiya, starring Divya Dutta, raises pressing questions about marital consent. Directed by Shashant Shah, the release date of the upcoming series is yet to be revealed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bollywood-actor-shanaya-kapoor-career-setbacks-growth-acting-journey-2871726-2026-02-20",
      "headline": "Actor Shanaya Kapoor says shelved Bedhadak shaped her journey Shanaya Kapoor looks back at the shelving of Bedhadak and reveals how the setback shaped her journey in Bollywood.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/jaideep-ahlawat-on-his-blink-and-miss-cameo-in-kohrra-2-calls-show-a-rare-gem-2871709-2026-02-20",
      "headline": "Sudip can't make crime shows without me: Jaideep Ahlawat on his Kohrra 2 cameo Kohrra Season 2 has surprised fans with a clever Easter egg featuring Jaideep Ahlawat in a brief, unannounced cameo. The actor has now opened up about the role and credited maker Sudip Sharma, calling the show a rare gem. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shahid-kapoor-moved-by-hrithik-roshan-praise-for-o-romeo-calls-it-special-2871703-2026-02-20",
      "headline": "Shahid Kapoor moved by Hrithik Roshan's praise for O' Romeo, calls it special After Hrithik Roshan praised O' Romeo, Shahid Kapoor shared an emotional response. He reflected on Hrithik's influence on his early years and expressed his excitement over the recognition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/eric-dane-dies-aged-53-greys-anatomy-actor-als-battle-legacy-awareness-2871685-2026-02-20",
      "headline": "Patrick Dempsey reflects on Grey's Anatomy co-star Eric Dane's final days Actor Patrick Dempsey has shared an emotional tribute to Eric Dane following his death at 53, recalling their final conversations and the laughter they shared.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-night-agent-3-review-suraj-sharma-joins-gabriel-basso-for-an-edgier-season-2871697-2026-02-20",
      "headline": "The Night Agent 3 review: Suraj Sharma joins Gabriel Basso for an edgier seasonRelease Date:Fri Feb 20, 2026 The Night Agent Season 3 on Netflix raised the bar with a gripping blend of global conspiracies and moral complexity, making the story more intense and relatable. Featuring strong performances, especially by Indian actor Suraj Sharma, the season delivered a fresh, layered thriller experience for loyal fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/karan-patel-suffered-rib-fracture-quit-the-50-reality-show-on-medical-advice-actors-team-2871658-2026-02-20",
      "headline": "Karan Patel suffered rib fracture, quit The 50 on medical advice: Actor's team Actor Karan Patel's team released a statement following his departure from The 50. It explained the circumstances around his exit and addressed narratives regarding his performance and conduct during the show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rishab-shetty-praises-yash-as-toxic-teaser-creates-frenzy-2871655-2026-02-20",
      "headline": "It's gonna get crazy: Rishab Shetty reacts to Yash's Toxic teaser The highly anticipated teaser for Toxic: A Fairytale for Grown-Ups has been released, showcasing Yash's striking transformation. The film is set for a major box office clash this March."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/second-case-of-seetharam-review-vijay-raghavendra-crime-thriller-review-2871603-2026-02-20",
      "headline": "Second Case of Seetharam review: Vijay Raghavendra anchors engaging slow burnRelease Date:Fri Feb 20, 2026 Second Case of Seetharam movie review: The Vijay Raghavendra-starrer sequel offers a slow-burn investigation with strong psychological elements but faces pacing challenges."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-shirtless-protest-at-ai-summit-inspired-by-nepals-gen-z-movement-delhi-police-tell-court-2871999-2026-02-21",
      "headline": "Congress's shirtless protest at AI Summit inspired by Nepal's Gen Z: PoliceDelhi Police told a court that the shirtless Youth Congress protest against PM Modi at the AI Summit was part of a larger conspiracy allegedly inspired by Nepal's violent Gen Z movement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-new-tariff-trump-us-supreme-court-ruling-trade-deal-explained-2871947-2026-02-21",
      "headline": "50%, 25%, 18%, 10%? Clearing the air on India Trump tariffs after court order  Live UpdatesDonald Trump has said the India-US tariff arrangement, as per the trade deal, will remain intact. However, the White House has clarified that Indian goods will be charged 10% tariff for now. We help clear the confusion for you."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-considers-military-options-against-iran-khamenei-amid-middle-east-tensions-nuclear-talks-2871936-2026-02-21",
      "headline": "Trump given options to kill Khamenei and son in targeted Iran strikes: ReportUS President Donald Trump has been briefed on military options that include a targeted strike against Iran's Supreme Leader Ali Khamenei and his son Mojtaba Khamenei, Axios reported, citing senior administration sources."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/terror-alert-in-delhi-as-let-plans-terror-attacks-on-temples-near-red-fort-chandni-chowk-intel-sources-2871945-2026-02-21",
      "headline": "Security alert in Delhi as Lashkar plans attacks on temples near Red Fort: SourcesThe alert comes nearly three months after a car explosion near Red Fort on November 10, 2025, which left at least 12 people dead and over two dozen injured, in one of the deadliest terror incidents in the capital in recent years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/talking-points/story/ai-will-not-kill-indian-saas-but-will-make-it-bleed-with-1000-cuts-2871950-2026-02-21",
      "headline": "AI will not kill Indian SaaS, but will make it bleed with 1000 cutsThe rumours that Indian SaaS is dead are greatly exaggerated. But it also doesn't mean that pain is not ahead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-tariff-us-supreme-court-ruling-neal-katyal-indian-origin-lawyer-2871992-2026-02-21",
      "headline": "The Indian-origin lawyer behind Trump's tariff setback in US courtNeal Katyal, a former Acting Solicitor General of the US and author, has emerged as a central figure in the Supreme Court case that struck down Trump's global tariffs. Who is he?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-t20-world-cup-boycott-mental-health-asif-nazrul-controversy-2871819-2026-02-20",
      "headline": "Players in mental coma: Bangladesh coach slams Yunus official for World Cup exitBangladesh senior assistant coach Mohammad Salahuddin slammed former sports advisor Asif Nazrul for allegedly making blatant false claims and criticised him for shattering the dreams of young cricketers following Bangladesh's boycott of the T20 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/cbse-class-10-english-board-exam-2026-2871988-2026-02-21",
      "headline": "Live: Easy paper surprises studentsCBSE Class 10 English Exam Analysis 2026 Live Updates: The CBSE Class 10 English board exam has seen its first detailed analysis emerge, offering clarity on the paper's structure and difficulty level. As students stepped out of examination centres, early reactions and expert reviews indicated that the paper followed a balanced format and remained within the prescribed syllabus. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-t20-world-cup-super-8s-practice-session-ahmedabad-ring-of-fire-2871909-2026-02-21",
      "headline": "IND vs SA: Under the ring of fire, new subplots emerge in India practiceIndia vs South Africa, T20 World Cup: India practised in the night session at the Narendra Modi Stadium on Friday. The session was indicative to changes that the team might make in their line-up and strategies for the South Africa game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/khaled-hosseini-red-lipstick-sojne-phul-bengal-womans-village-life-goes-global-2871396-2026-02-20",
      "headline": "This endearing housewife from a Bengal village is rocking Insta ReelsMeet Pujarini Pradhan - a small-town woman from rural Bengal whose quiet, English-spoken glimpses of everyday village life have turned simplicity into a following of over half a million on Instagram."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-news-ayatollah-ali-khamenei-dangerous-weapon-sink-us-aircraft-carrier-hyprsonic-misisle-fattah-anti-ship-missiles-2871785-2026-02-21",
      "headline": "Iran can sink US aircraft carriers, says Khamenei. What weapon can it use?Iran's Supreme Leader, Ali Khamenei, stated the country possesses a dangerous weapon capable of sending US aircraft carriers to the bottom of the sea. While he did not mention the exact weapon, Iran does possess a vast arsenal of hypersonic and subsonic missiles that it could use against US warships, should need arise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rajpal-yadav-attends-nieces-wedding-after-bail-expresses-gratitude-to-wife-2871942-2026-02-21",
      "headline": "Rajpal Yadav attends niece's wedding after bail, expresses gratitude to wifeRajpal Yadav attended his niece's wedding after being granted interim bail in the cheque bounce case. In an emotional statement, he expressed gratitude towards his wife."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/travel/story/this-japanese-photographer-didnt-like-india-at-first-now-he-has-travelled-across-it-12-times-2867133-2026-02-21",
      "headline": "He didn't like India at first. Now he has travelled across it 12 timesMasashi Mitsui is a Japanese photographer who is currently undertaking his 12th motorcycle journey across India. But what keeps drawing him back, time and again?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/old-income-tax-regime-benefits-proposed-hra-meal-vouchers-is-it-better-now-salaried-individuals-2871962-2026-02-21",
      "headline": "Old tax regime gets a boost. Does it work better for you than the new one?Handcrafted ByOur Editors If you have moved on to the new income tax regime, should you give the old one another look after the proposed benefits? Read on to see what the changes could mean for your tax savings."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/macron-meloni-italy-war-of-words-french-far-right-activist-death-diplomatic-tensions-2871966-2026-02-21",
      "headline": "Stay at home, don't interfere: Macron shreds Meloni over French activist's deathA dispute has intensified between French President Emmanuel Macron and Italian Prime Minister Giorgia Meloni following the killing of French activist Quentin Deranque, drawing attention to growing ideological divides within Europe."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/speeding-car-mows-down-zomato-delivery-rider-west-delhi-subhash-nagar-driver-allegedly-drunk-2871913-2026-02-21",
      "headline": "Speeding car mows down Zepto delivery rider in Delhi; driver arrestedThe victim, identified as Hem Shakar, a resident of Raghubir Nagar, was shifted to Deen Dayal Upadhyay Hospital, where doctors declared him brought dead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kh-x-rk-rajinikanth-kamal-haasan-recreate-retro-vibes-in-gangster-themed-promo-2871985-2026-02-21",
      "headline": "KH X RK: Rajinikanth-Kamal Haasan recreate retro vibes in gangster themed promoThe announcement video of Rajinikanth-Kamal Haasan's KH X RK was released on February 21, 2026. The promo shows both icons in a retro look."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/trending/weekly-quiz-574-20-02-2026",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/burning-questions-general-mm-naravane-book-publisher-needs-answer-penguin-random-house-india-rahul-gandhi-controversy-2869237-2026-02-21",
      "headline": "Burning questions on Gen Naravane book publisher needs to answerWhile the police probe into General MM Naravane's book is focussing on an unapproved manuscript being circulated online and copies entering digital markets abroad, the main question remains how it got printed as a book. These are the questions we put to the publisher, waited for a response, but all that was there was silence."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/pennsylvania-boy-kills-adoptive-father-birthday-party-adult-trial-video-game-dispute-2871933-2026-02-21",
      "headline": "US boy, 11, kills adoptive father for taking away game console, faces adult trialAn 11-year-old Pennsylvania boy shot his adoptive father in the head while he slept after his gaming console was taken away on the night of his birthday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/india-ott-hinterland-sagas-kohrra-mirzapur-popular-2871033-2026-02-21",
      "headline": "Mitti over metro: Heartland stories emerge as Indian OTT's bestseller genreIndia's OTT platforms are witnessing a surge in hinterland-themed shows that highlight regional stories and authentic rural life. In this week's Cinematic Saturday, we explore how this shift reflects audiences' desire for relatable content rooted in their own cultural and social realities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/charlotte-despard-india-freedom-struggle-british-empire-anti-imperialism-2871367-2026-02-20",
      "headline": "The British woman who turned against her own empire for India's freedomCharlotte Despard publicly denounced British imperial rule from London in the 1920s. Her activism linked women's suffrage with India's fight for independence, challenging imperial authority and inspiring global solidarity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/features/story/india-ai-impact-summit-defines-indian-tech-ambitions-to-see-this-look-beyond-chaos-2872000-2026-02-21",
      "headline": "India AI Impact Summit defines Indian tech ambitions, to see this look beyond chaosWhile chaos brought about by a huge crowd and early teething issues in logistics were real, the India AI Impact Summit 2026 subtly achieved something bigger: It proved that was no longer just an AI data market, but an emerging global stage for collaboration, investment and innovation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/old-smartphones-e-waste-aeroplanes-fighter-jets-india-2871491-2026-02-21",
      "headline": "Your old smartphones could be tomorrow's fighter jetsIndia is sitting on a goldmine of strategic minerals inside discarded smartphones. Explore the science behind turning e-waste into fighter jets and aeroplanes.\r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harry-brook-pakistan-players-the-hundred-2026-ipl-owned-teams-controversy-2872014-2026-02-21",
      "headline": "No Pakistan players in the Hundred? Will be a shame: England captain Harry Brook T20 World Cup: England captain Harry Brook said that it would be a shame to see Pakistan players get snubbed during the auction for the upcoming season of The Hundred this year. The four IPL-owned franchises are reportedly planning not to buy Pakistan players during the auction. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/t20-world-cup-pre-seeding-adam-zampa-australia-vs-oman-2872007-2026-02-21",
      "headline": "ICC's T20 World Cup pre-seeding: Australia's Adam Zampa not a fan of idea T20 World Cup: Adam Zampa admitted that he isn't a fan of ICC's pre-seeding system during the T20 World Cup. Zampa also reflected on Australia's campaign in the ongoing tournament, expressing disappointment at their early exit from the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-india-vs-south-africa-abhishek-sharma-vs-aiden-markram-biggest-threat-super-8-2871996-2026-02-21",
      "headline": "Abhishek vs Markram: Ex-India star flags opener's biggest threat vs SA T20 World Cup: Ahead of India's Super 8 clash against South Africa, Aakash Chopra warned that Abhishek Sharma must navigate smart match-ups rather than chase big shots. With Ngidi in form and Markram an option with the new ball, tactics could define the contest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-new-head-coach-acb-naseeb-khan-jonathan-trott-replacement-2026-2871971-2026-02-21",
      "headline": "Jonathan Trott successor's duty station will be in Afghanistan: ACB chief ACB chief executive Naseeb Khan has said that the new Afghanistan coach and Jonathan Trott's replacement will need to be based out of the country during his tenure. Khan also said that the process to find the new coach is underway. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/floyd-mayweather-professional-boxing-comeback-mike-tyson-exhibition-congo-2871939-2026-02-21",
      "headline": "Mayweather does retirement U-turn, to return to pro-boxing after Mike Tyson bout Floyd Mayweather Jr. has completed a retirement U-turn, saying that he wants to return to pro-boxing after his exhibition bout against Mike Tyson. Mayweather retired in 2017 and is now aiming to extend his unbeaten run. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/benfica-vs-real-madrid-gianluca-prestianni-anti-gay-slur-slur-vinicius-racism-allegations-2871957-2026-02-21",
      "headline": "Benfica's Prestianni admits anti-gay slur at Vinicius, denies racist abuse Benfica winger Gianluca Prestianni reportedly admitted to using a homophobic slur at Vinicius Junior while denying racist abuse. UEFA's investigation is ongoing, with severe disciplinary consequences possible if discriminatory conduct is confirmed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-new-zealand-t20-world-cup-2026-super-8-colombo-weather-report-2871943-2026-02-21",
      "headline": "PAK vs NZ, Weather report: Will rain put Pakistan under early Super 8 pressure? Pakistan and New Zealand will meet in their first T20 World Cup 2026 Super 8 match in Colombo, where both teams need improved performances after inconsistent group stage showings. However, will rain put early pressure on Salman Ali Agha and his men?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-india-vs-south-africa-shukri-conrad-expose-under-pressure-super-8-ahmedabad-2871935-2026-02-21",
      "headline": "South Africa will expose under-pressure India: Coach Conrad ahead of Super 8 clash T20 World Cup: Ahead of the Super 8 rematch in Ahmedabad, South Africa coach Shukri Conrad suggested that defending champions India will carry heavier pressure. With both sides unbeaten, he believes expectation could become the decisive factor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/arsenal-title-collapse-arteta-premier-league-bottle-job-manchester-city-2871643-2026-02-21",
      "headline": "Another year, same story? Why Arsenal may be bottling Premier League title again Arsenal's title race seems to be faltering again under pressure from Manchester City, a familiar script that their fans have become accustomed to. With 11 games left, including a trip to City, will Arteta and his men remain as bridesmaids once again?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/adam-zampa-australia-t20-world-cup-2026-exit-tests-priority-claims-2871932-2026-02-21",
      "headline": "Australia cares about Tests more than T20Is? Adam Zampa shuts down notion Adam Zampa has shut down the notion that Australia cares more about Test cricket than T20Is after their exit from the T20 World Cup 2026. Australia failed to advance from their group and qualify for the Super 8 stage. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-abhishek-sharma-india-vs-south-africa-super-8s-training-fires-up-sikh-war-cry-watch-video-2871917-2026-02-21",
      "headline": "Watch: Abhishek Sharma fires up India teammates before Super 8s clash vs SA T20 World Cup: Runless so far in the tournament, Abhishek Sharma sparked India's Super 8 build-up with a rousing Punjabi war cry in Ahmedabad. As South Africa await, the team has publicly backed the young opener despite his lean patch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-t20-world-cup-super-8s-practice-session-ahmedabad-ring-of-fire-2871909-2026-02-21",
      "headline": "IND vs SA: Under the ring of fire, new subplots emerge in India practiceIndia vs South Africa, T20 World Cup: India practised in the night session at the Narendra Modi Stadium on Friday. The session was indicative to changes that the team might make in their line-up and strategies for the South Africa game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-new-zealand-t20-world-cup-super-8s-colombo-feb-21-2025-2871817-2026-02-21",
      "headline": "Pakistan face familiar New Zealand test to kickstart Super 8s in ColomboT20 World Cup Super 8s: Pakistan face New Zealand in a crucial T20 World Cup Super 8s match in Colombo on Saturday. Babar Azam is under pressure as both teams look to bounce back from mixed group stage campaigns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/t20-world-cup-pakistan-vs-new-zealand-mike-hesson-super-8-2871866-2026-02-20",
      "headline": "Pakistan having psychological advantage over New Zealand? Mike Hesson opens upT20 World Cup 2026, PAK vs NZ: Speaking to reporters, Pakistan head coach Mike Hesson discussed whether Pakistan holds the upper hand ahead of their Super 8 clash against New Zealand. Historically, Pakistan have defeated the Black Caps in five of their seven encounters in the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/morne-morkel-curators-tricky-pitches-wankhede-narendra-modi-stadium-t20-world-cup-2871860-2026-02-20",
      "headline": "T20 World Cup: India bowling coach Morkel defends 'tacky' Wankhede, Motera pitchesIndia bowling coach Morne Morkel has come out in support of the curators at the Wankhede Stadium and the Narendra Modi Stadium in Motera, backing their efforts after the slightly tacky surfaces at both venues drew scrutiny during the T20 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/richard-kettleborough-chris-gaffaney-umpire-india-south-africa-t20-world-cup-super-8-2871856-2026-02-20",
      "headline": "Richard Kettleborough, Chris Gaffaney to officiate India vs SA Super 8 matchRichard Kettleborough and Chris Gaffaney will be the on-field umpires for India's opening Super 8 match of the T20 World Cup against South Africa in Ahmedabad on Sunday, the ICC said on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-babar-azam-batting-order-pakistan-mike-hesson-explains-2871837-2026-02-20",
      "headline": "Babar Azam's strike rate is low: Pakistan coach defends batting order changeT20 World Cup: Pakistan head coach Mike Hesson on Friday justified the decision not to send Babar Azam in at his usual No. 4 spot in the final group-stage clash against Namibia, saying he would not have been the best person to come in."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-t20-world-cup-boycott-mental-health-asif-nazrul-controversy-2871819-2026-02-20",
      "headline": "Players in mental coma: Bangladesh coach slams Yunus official for World Cup exitBangladesh senior assistant coach Mohammad Salahuddin slammed former sports advisor Asif Nazrul for allegedly making blatant false claims and criticised him for shattering the dreams of young cricketers following Bangladesh's boycott of the T20 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-oman-t20-world-cup-group-match-marsh-head-2871813-2026-02-20",
      "headline": "Australia bow out on a high, Marsh-Head hand Oman a 9-wicket thrashingAustralia ended their disappointing T20 World Cup campaign with a crushing 9-wicket win over Oman in their final Group match in Pallekele. After bowling Oman out for 105, captain Mitchell Marsh gunned down the 105-run target in just 9.4 overs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rahul-chahar-divorce-confirms-ipl-2026-chennai-super-kings-2871777-2026-02-20",
      "headline": "CSK's latest spin acquisition, Rahul Chahar, confirms divorceIndian leg-spinner Rahul Chahar confirmed his divorce from wife Ishani Johar through an Instagram post, ending his marriage after more than three and a half years together."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mike-hesson-clarifies-viral-video-pakistan-t20-world-cup-salman-agha-frustration-2871776-2026-02-20",
      "headline": "Rift in Pakistan camp? Pak coach opens up on Salman Agha outburst in Namibia clashT20 World Cup, NZ vs PAK: Mike Hesson has clarified the viral video in which he was seen speaking with Salman Agha, who smashed a bottle on the ground during Pakistan's match against Namibia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/mp-high-court-seeks-clarity-nrai-licence-orders-release-cartridges-shooters-2871772-2026-02-20",
      "headline": "MP HC asks Centre to clarify national rifle association's ammunition license statusThe Madhya Pradesh High Court has sought clarity from the Centre on NRAI's licence status while granting interim relief to shooters by ordering the release of 1,000 cartridges each for training."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-ind-vs-sa-morkel-brothers-morne-india-albie-south-africa-super-8-2871755-2026-02-20",
      "headline": "IND vs SA: Morkel brothers, Morne and Albie, set for strategic clash in Super 8India vs South Africa: Albie and Morne Morkel will face each other as coaches in the ICC Men's T20 World Cup Super 8 stage, setting up a rare off-field sibling rivalry. Back home, their mother is torn between supporting India or South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/varun-chakravarthy-t20-world-cup-super-8-india-south-africa-morne-morkel-2871752-2026-02-20",
      "headline": "Varun Chakravarthy under pressure? Morne Morkel opens up on spinner's workloadT20 World Cup, IND vs SA: Morne Morkel said that Varun Chakravarthy has been under pressure to provide India with crucial breakthroughs. Chakravarthy has been India's standout bowler in the competition so far, picking up nine wickets from four matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shahid-afridi-brutal-reality-check-shadab-khan-namibia-new-zealand-t20-world-cup-2871756-2026-02-20",
      "headline": "Shahid Afridi gives brutal reminder to Shadab: You performed only vs NamibiaT20 World Cup: Former Pakistan captain Shahid Afridi delivered a pointed response to Shadab Khan after the all-rounder defended his generation's 2021 World Cup win over India, questioning their ability to handle success."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-ind-vs-sa-aiden-markram-spin-control-practice-session-ahmedabad-2871730-2026-02-20",
      "headline": "Inside South Africa's game plan vs India: Proteas put all their chips on Aiden MarkramT20 World Cup: South Africa had a quiet training session two days ahead of their first Super 8 game against India. Aiden Markram was asked to bowl first, as the Proteas focused their preparations on bowling to India's southpaws."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-india-bowling-coach-morne-morkel-abhishek-sharma-form-ind-vs-sa-2871716-2026-02-20",
      "headline": "Three ducks, no alarm: India stands firm behind Abhishek Sharma ahead of Super 8sT20 World Cup: India bowling coach Morne Morkel has thrown his weight behind Abhishek Sharma despite the opener's string of failures, making it clear there is \"absolutely no discussion\" about his place in the playing XI ahead of the Super 8 clash against South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-oman-score-today-t20-world-cup-match-updates-pallekele-2871706-2026-02-20",
      "headline": "AUS vs OMA Highlights: Mitchell Marsh's fifty gives consolation win by 9 wicketsAustralia (AUS) vs Oman (OMA) Highlights, T20 World Cup: Mitchell Marsh's fireworks in Kandy has given Australia their first win of the tournament, albeit being a bit too late. Nonetheless a consolation win for the Aussies. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-super-league-ownership-disputes-sialkot-lahore-qalandars-2871678-2026-02-20",
      "headline": "Pakistan board grapples with ownership issues in two PSL franchisesThe Pakistan Cricket Board is facing ownership concerns involving at least two of the eight franchises in the Pakistan Super League, according to PTI. A dispute has reportedly erupted within the newly auctioned Sialkot franchise over majority ownership.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/the-hundred-england-stop-ipl-owners-pakistan-players-blocked-michael-vaughan-2871651-2026-02-20",
      "headline": "England must not allow IPL owners to block Pakistan players from Hundred: VaughanFormer England captain Michael Vaughan called for ECB's intervention to stop IPL-owned franchises in The Hundred from picking Pakistan players for the upcoming auction. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-mark-chapman-new-zealand-vs-pakistan-spin-bowling-super-8-2871583-2026-02-20",
      "headline": "New Zealand's Mark Chapman ready for Pakistan's familiar spin challenge in Super 8sNew Zealand middle-order batter Mark Chapman is banking on the familiarity factor to counter the mystery spinner Usman Tariq-led Pakistan bowling unit in their Group 2 Super 8 clash of the ICC Men's T20 World Cup here on Saturday."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}