{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/elon-musk-doge-ceo-job-difficult-to-handle-tesla-share-price-us-stock-market-crash-2692036-2025-03-11",
      "headline": "Elon Musk says balancing DOGE and CEO roles is tough as Tesla shares slideElon Musk has been actively involved in Tesla, SpaceX, X (formerly Twitter), and xAI, along with his inclination to working with the Department of Government Efficiency (DOGE). "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/indusind-bank-share-price-down-25-percent-should-you-buy-hold-sell-2692022-2025-03-11",
      "headline": "IndusInd Bank share price crashes over 25%: Buy, hold or sell?IndusInd Bank stock price: At around 12:55 PM, IndusInd Bank shares were down 25.61% at Rs 670 on the Bombay Stock Exchange (BSE), marking their worst single-day fall since the Covid-19 market meltdown in March 2020."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/da-hike-how-much-can-central-government-employees-expect-2692007-2025-03-11",
      "headline": "DA hike: How much can central government employees expect?The expected hike is likely to benefit around 12 million central government employees and pensioners under the 7th Pay Commission."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-stock-market-crash-bloodbath-on-wall-street-no-major-impact-sensex-and-nifty-2691987-2025-03-11",
      "headline": "US stock market crash: Why Sensex, Nifty aren't feeling the heatThe S&P BSE Sensex was down less than 170 points at around 11:35 am, while the NSE Nifty50 fluctuated between gains and losses. The 50-share index was down barely 20 points but showed no signs of panic. Broader market indices also stayed flat as volatility spiked."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/skipped-filing-itr-you-may-get-a-tax-notice-very-soon-2691960-2025-03-11",
      "headline": "Skipped filing ITR? You may get a tax notice very soonThe tax authorities use a risk management strategy (RMS) to flag high-risk non-filers, said the department.  This system looks at high-value transactions (property purchases, large bank deposits, etc.), income from salary, rent, mutual funds, and shares, etc."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indusind-bank-share-crash-22-percent-52-week-low-should-you-buy-net-worth-loss-rs-1577-crore-2691943-2025-03-11",
      "headline": "IndusInd Bank share crash: Should you buy as stock falls 22% today?The decline in IndusInd Bank share price came after the bank, in an internal review of its derivative portfolio, found discrepancies that could reduce its net worth by an estimated 2.35%. This amounts to an impact of nearly Rs 1,577 crore."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/donald-trumps-recession-remark-rattles-wall-street-crash-is-the-fear-justified-2691939-2025-03-11",
      "headline": "US recession: Is it a possibility or just a Wall Street worry?The massive sell-off on Wall Street was triggered by Donald Trump's recent remark on the possibility of a US recession in 2025. But is a US recession actually looming? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indusind-bank-shares-crash-20-to-hit-52-week-low-why-is-it-falling-today-2691909-2025-03-11",
      "headline": "IndusInd Bank shares crash 21% to hit 52-week low. Why is it falling today?IndusInd Bank stock price fall: IndusInd Bank's stock has lost nearly 50% in the past six months, with a 32% decline in the last four weeks alone. The stock fell nearly 4% to Rs 900.50 on the NSE in the previous session. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/sensex-down-nearly-400-points-nifty-below-22500-as-us-recession-fears-spook-investors-2691894-2025-03-11",
      "headline": "Sensex down nearly 400 points: Why is the stock market falling today? The Sensex fell nearly 400 points, while the Nifty dropped over 100 points as investors reacted to growing concerns about a possible recession in the US, along with a sharp fall in IT stocks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-fall-in-early-trade-wall-street-crash-us-stock-market-indusind-bank-shares-2691891-2025-03-11",
      "headline": "Sensex, Nifty fall as US market crash rattles investors; IndusInd Bank down 10%The S&P BSE Sensex tanked 361.25 points to 73,753.92, while the NSE Nifty50 lost 113.65 points to 22,346.65 as of 9:16 AM."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/what-to-expect-sensex-nifty-eye-shaky-opening-as-wall-street-crash-spooks-global-markets-2691869-2025-03-11",
      "headline": "Sensex, Nifty eye shaky opening as Wall Street crash spooks global marketsUS stock markets saw their biggest single-day fall since 2022 on Monday, March 10. The S&P 500 and Nasdaq crashed by up to 4%, while the Dow Jones dropped 2.08%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indusind-bank-shares-in-focus-after-rs-1577-crore-networth-hit-risk-2691864-2025-03-11",
      "headline": "IndusInd Bank shares in focus after Rs 1,577 crore networth hit riskThe stock fell nearly 4% to Rs 900.50 on the NSE in the previous session. IndusInd Bank's stock has lost more than 37% in the past six months, with a 16% decline in the last four weeks alone. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-stock-market-crash-tesla-shares-tumble-almost-16-per-cent-2691858-2025-03-11",
      "headline": "Tesla shares tumble almost 16% as US stock markets crashTesla shares plunged 15.4 per cent to USD 222.15 on Monday, their lowest since October, amid investor pessimism over slumping sales and Trump administration trade policy uncertainty. It was Tesla's steepest drop since September 2020."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-stock-market-loses-usd-4-trillion-in-value-as-donald-trump-continues-to-back-tariffs-2691854-2025-03-11",
      "headline": "Trump tariffs, recession fears slam US markets, wiping out $4 trillion in valueDonald Trump's tariffs have rattled investors, wiping out USD 4 trillion from the S&P 500 as trade uncertainty with Canada, Mexico, and China grows."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/world/story/us-stocks-fall-sharply-as-recession-fears-grow-nasdaq-down-4-2691850-2025-03-11",
      "headline": "US stocks fall sharply as recession fears grow; Nasdaq down 4%US stocks fell sharply as concerns over tariffs and a potential government shutdown fuelled recession fears. The S&P 500 had its worst one-day drop since December, falling 2.7%, while the Nasdaq dropped 4%, confirming a correction."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/us-stock-market-crash-will-wall-street-bloodbath-hurt-sensex-nifty-2691785-2025-03-10",
      "headline": "Wall Street sell-off worsens on Trump tariffs, recession worriesEuropean markets have already taken a hit, and Asian markets are unlikely to be spared. Dalal Street is likely in for a rough session on Tuesday, especially information technology (IT) stocks that rely on the US for business."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-markets-open-lower-day-after-donald-trump-declines-to-rule-out-recession-tariff-war-2691775-2025-03-10",
      "headline": "US markets open lower day after Trump declines to rule out recessionIt's not just stocks struggling. Investors are sending prices lower for all kinds of investments whose momentum had earlier seemed nearly impossible to stop at times, such as bitcoin. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-price-slips-despite-donald-trump-establishment-strategic-bitcoin-reserve-here-is-why-2691695-2025-03-10",
      "headline": "Bitcoin slips despite Trump's Strategic Bitcoin Reserve announcement. Here's whyBitcoin, the world's largest cryptocurrency, has dropped by 2.04% since the last day and is currently trading at $83,200.67, at the time of writing this article."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-shares-dip-45-percent-in-3-months-reason-behind-the-decline-2691648-2025-03-10",
      "headline": "Tesla shares dip 45% in 3 months: What's behind the decline?Tesla's market value has fallen 45% since reaching a record high of $1.5 trillion on December 17, 2024. The stock surge followed Musk's financial backing of Donald Trump's election victory. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/income-tax-department-expands-e-pay-tax-service-to-30-banks-check-latest-list-2691615-2025-03-10",
      "headline": "Income Tax Department expands e-Pay tax service to 30 banks. Check latest listIndia's Income Tax Department offers the E-Pay Tax service on the e-Filing portal, enabling individuals, businesses, and entities in India to pay direct taxes like advance tax, self-assessment tax, and TDS/TCS digitally from their bank accounts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-early-gains-to-close-lower-amid-global-headwinds-hul-gains-2-percent-2691596-2025-03-10",
      "headline": "Sensex, Nifty early gains to close lower amid global headwinds; HUL gains 2%The S&P BSE Sensex lost 217.41 points to close at 74,115.17, while the NSE Nifty50 was down 92.20 points to end at 22,460.30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/large-caps-midcaps-small-caps-where-should-you-invest-now-stock-market-tips-money-2691587-2025-03-10",
      "headline": "Large caps vs midcaps vs small caps: Where should you invest now?Markets witnessed a brief respite after closing their best week in 2025 last week. Broader markets, especially midcap and smallcap stocks, performed well. The BSE Midcap index gained 3%, while the BSE Smallcap index jumped 6% last week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/need-funds-here-is-how-to-get-a-loan-against-mutual-fund-2691564-2025-03-10",
      "headline": "Need funds? Here's how to get a loan against mutual fundYou can apply online or visit the lender's branch by submitting a loan application form and providing details of your mutual fund holdings."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/7th-pay-commission-da-hike-announcement-this-week-likely-before-holi-2691558-2025-03-10",
      "headline": "7th Pay Commission: DA hike announcement this week, likely before HoliOver 12 million central government employees and retirees are likely to benefit from the said hike under the 7th Pay Commission. With this possible revision, the DA would increase from 53% to 55% of the basic pay."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/defence-stocks-top-4-psu-stock-market-solar-industries-ptc-industries-dynamatic-technologies-azad-engineering-2691552-2025-03-10",
      "headline": "Defence boost from Europe? These 4 PSU stocks could see strong upsideAccording to ICICI Securities, defence companies that already have supply agreements, partnerships, or orders from European firms are likely to benefit the most. The brokerage firm has highlighted four companies that could gain from this. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/retail-inflation-likely-fell-below-4-in-february-shows-poll-of-45-economists-2691491-2025-03-10",
      "headline": "Retail inflation likely fell below 4% in February: ReportAs fresh winter produce hit markets over the past few months, food items - which make up nearly half of the inflation basket - saw a sustained slowdown in price increases."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/startup-funding-in-india-top-opportunities-accelerator-startup-mahakumbh-dpiit-pwc-india-2691466-2025-03-10",
      "headline": "Is your startup looking for funding? Top 4 opportunities in IndiaOne of the biggest funding programmes available right now is the Startup Maha Rathi Challenge, which is part of Startup Mahakumbh 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/shah-rukh-khan-wins-tax-dispute-case-what-is-foreign-tax-credit-and-how-to-claim-it-2691467-2025-03-10",
      "headline": "SRK wins tax dispute case: What is foreign tax credit and how to claim it? Khan had declared an income of Rs 83.42 crore in his tax return, but the tax officer reassessed it as Rs 84.17 crore and denied him foreign tax credit (FTC) for taxes paid in the UK."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indusind-bank-share-price-hits-52-week-low-check-target-price-and-whats-next-for-the-stock-2691460-2025-03-10",
      "headline": "IndusInd Bank share price hits 52-week low. Check target price and what's next?IndusInd Bank stock price: The sell-off came after the Reserve Bank of India (RBI) approved only a one-year extension for CEO Sumant Kathpalia, despite the board recommending a three-year term."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-update-sensex-nifty-gaining-why-dalal-street-investors-should-not-get-comfortable-2691437-2025-03-10",
      "headline": "Stock market bounces back, but will the relief rally last?Overall, the situation on Dalal Street looks much better than how it appeared at the beginning of last week. Does this mean investors can take it easy now? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/epfo-announces-new-rules-for-edli-scheme-3-key-death-benefits-updates-2691423-2025-03-10",
      "headline": "EPFO announces new rules for EDLI Scheme: 3 key death benefits updatesThe EDLI scheme is part of the Employees' Provident Fund (EPF) and acts as a social security benefit, offering financial assistance to the dependents of an EPF member in the event of the untimely death of the EPF member while still employed."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/tata-power-stock-price-rising-today-mou-with-andhra-pradesh-government-2691418-2025-03-10",
      "headline": "Why are Tata Power shares rising today? Details here Tata Power stock has had a mixed run. The stock is down 20% in the past six months but has still gained 67% over the past two years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gensol-engineering-stock-price-down-40-percent-in-a-week-why-is-it-falling-2691393-2025-03-10",
      "headline": "Gensol Engineering shares crash 40% in a week. Why is it falling today?Gensol Engineering stock price: The shares of the company were down 3.99% to Rs 309.05 on the Bombay Stock Exchange (BSE) at 10:24 am. In early trade, the company's shares were trading even lower."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indusind-bank-share-price-today-sharp-decline-ceo-tenure-2691381-2025-03-10",
      "headline": "Explained: Why IndusInd Bank shares fell over 5% in early tradeIndusInd Bank share price: The sell-off came after the Reserve Bank of India (RBI) gave CEO Sumant Kathpalia a one-year extension instead of the three-year term the board had wanted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-gains-400-points-3-reasons-why-stock-market-is-rising-today-dalal-street-rally-2691375-2025-03-10",
      "headline": "Sensex gains 400 points: 3 reasons why stock market is rising todaySensex opened at 74,474.98, slightly higher than its previous close of 74,332.58. The index quickly gained over 350 points, reaching the day's high of 74,713.17."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-start-the-week-higher-as-us-fed-comments-ease-worries-indusind-bank-shares-2691364-2025-03-10",
      "headline": "Sensex, Nifty open higher as US Fed comments ease worries; IndusInd down 5%The S&P BSE Sensex gained 114.62 points to 74,447.20, while the NSE Nifty50 added 42.25 points to 22,597.75 as of 9:25 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-what-to-expect-from-sensex-nifty-in-trade-on-march-10-nse-bse-2691343-2025-03-10",
      "headline": "Stock market today: What to expect from Sensex and Nifty? The Nifty ended at 22,552.50, while the Sensex closed at 74,332.58 in the last session, both gaining nearly 2% for the week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-ongc-hcltech-indusind-bank-tata-power-bhel-2691332-2025-03-10",
      "headline": "Stocks to watch today: ONGC, HCLTech, IndusInd Bank, Tata PowerInvestors are expected to remain cautious due to uncertainty over US tariff threats and global market reactions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/why-family-offices-are-crucial-to-indias-viksit-bharat-by-2047-dream-2690899-2025-03-08",
      "headline": "Why family offices are crucial to India's 'Viksit Bharat by 2047' dream?At the India Today Conclave 2025, Rishabh Shroff, Partner at Cyril Amarchand Mangaldas, discussed the growing role of family offices in India's journey towards becoming a developed economy by 2047. In a session titled \"A Case for Tomorrow\", moderated by Siddharth Zarabi, Shroff explained why family offices are vital for India's economic expansion and how they can contribute to achieving a Rs 30 trillion GDP target in the coming decades."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-gold-card-visas-not-worth-it-for-wealthy-indian-investors-rishabh-shroff-partner-law-firm-cyril-amarchand-mangaldas-2690874-2025-03-08",
      "headline": "US Gold Card visa expensive, not worth it for Indians: Top law firm bossRishabh Shroff, partner at Cyril Amarchand Mangaldas, said Donald Trump's $5 million US Gold Card visa does not make sense for Indians as cheaper alternatives are available. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/guns-n-roses-india-concert-mumbai-after-12-years-2691984-2025-03-11",
      "headline": "American rock band Guns N' Roses to return to India after 12 years American rock band Guns N' Roses will return to India after 12 years. They will perform in Mumbai on May 17."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kim-soo-hyun-denies-baseless-malicious-relationship-claims-with-late-actor-kim-sae-ron-2691967-2025-03-11",
      "headline": "Kim Soo-hyun denies 'baseless' relationship claims with late actor Kim Sae-ronActor Kim Soo-hyun and his agency Gold Medalist have rejected allegations made by the YouTube channel Garosero Research Institute. The accusations suggest a past relationship with the late Kim Sae-ron and blame the agency for her financial woes."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/aditi-sharma-heads-for-divorce-husband-abhineet-kaushik-alleges-infidelity-in-4-months-2691901-2025-03-11",
      "headline": "KKK 14's Aditi Sharma heads for divorce, husband alleges infidelity in 4 monthsTV actor Aditi Sharma's marital bliss was short-lived as her husband Abhineet Kaushik accused her of cheating. This comes just four months after their secret wedding on November 12, 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/story/mallika-sherawat-in-talks-for-khatron-ke-khiladi-15-report-2691925-2025-03-11",
      "headline": "Mallika Sherawat in talks for Khatron Ke Khiladi 15: ReportMallika Sherawat is reportedly in talks for Khatron Ke Khiladi 15. While her participation isn't confirmed, she recently returned to Bollywood and is now looking for her next big project."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/singer-isabel-larosa-on-performing-at-lolla-india-the-experience-was-surreal-2691829-2025-03-11",
      "headline": "Singer Isabel LaRosa on performing at Lolla India: The experience was surrealIsabel LaRosa, known for hits like Favourite and I'm Yours, recently performed at Lollapalooza India. She discussed her music-making process and experience with India Today Digital."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/dhanashree-verma-restores-photos-with-yuzvendra-chahal-amid-rumours-of-divorce-2691893-2025-03-11",
      "headline": "Dhanashree Verma restores photos with Yuzvendra Chahal amid rumours of divorceDhanashree Verma restored Instagram photos with Yuzvendra Chahal amid divorce rumours. While her lawyer confirmed court proceedings, her family denied claims of a Rs 60 crore alimony demand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/udit-narayan-breaks-silence-kiss-female-fans-massive-backlash-2691876-2025-03-11",
      "headline": "Udit Narayan mocks the kiss row at 'Pintu Ki Pappi' eventVeteran playback singer Udit Narayan opened up about the viral kiss incident a month after backlash. He discussed the timeline of the video where he is seen kissing his female fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/ashish-chanchlani-makes-public-appearance-after-indias-got-latent-row-2691756-2025-03-10",
      "headline": "Ashish Chanchlani makes public appearance after India's Got Latent row. WatchContent creator Ashish Chanchlani made a rare public appearance in Mumbai amid controversy surrounding Ranveer Allahbadia's comment on India's Got Latent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/hip-hop-india-2-trailer-remo-dsouza-malaika-arora-manisha-rani-participant-2691747-2025-03-10",
      "headline": "Watch: Hip Hop India 2 trailer promises to raise intensity, higher the stakesHip Hop India, the country's hip-hop dance reality show, is set to return for its second season on Amazon MX Player, promising even more thrilling performances and intense dance battles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/you-5-trailer-penn-badgeleys-joe-goldberg-returns-in-netflix-show-2691716-2025-03-10",
      "headline": "You 5 trailer: Penn Badgeley's Joe Goldberg returns for a killer finaleThe trailer for You Season 5 is out, showcasing the last chapter of Joe Goldberg's saga. Streaming starts April 24 on Netflix, with Joe facing past demons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/south-korean-singer-wheesung-found-dead-at-42-2691655-2025-03-10",
      "headline": "South Korean singer Wheesung found dead at 43Popular South Korean soloist Wheesung was found dead at his home on Monday. The authorities are still investigating the matter. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/meghan-markle-father-criticises-her-netflix-show-with-love-meghan-mocks-her-for-putting-flowers-on-food-2691629-2025-03-10",
      "headline": "Meghan Markle's father criticises her show, mocks her for putting flowers on food Meghan Markle's estranged father, Thomas Markle, talked about her Netflix show, 'With Love, Meghan', in an interview. He called her 'fake', and mentioned that she should have had a more relatable show for women who are not privileged like her. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/lisa-mishra-ed-sheeran-lollapalooza-india-2025-ananya-panday-2691282-2025-03-10",
      "headline": "Surreal and magical: Singer Lisa Mishra on sharing stage with Ed SheeranSinger Lisa Mishra performed the opening act for British singer Ed Sheeran during his concert in India earlier this year. Speaking exclusively to India Today Digital, the 31-year-old reflected on her experience of the same. Additionally, she opened up about working with Ananya Panday in Call Me Bae. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/badshah-weight-loss-video-stuns-fans-internet-thinks-he-looks-like-ap-dhillon-2691589-2025-03-10",
      "headline": "Badshah's weight-loss video stuns fans, internet thinks he looks like AP DhillonA recent video of Badshah has left fans stunned by his physical transformation. While promoting his new clothing brand, he showcased his new look, prompting fans to compare him to fellow Punjabi singer and rapper AP Dhillon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/when-life-gives-you-tangerines-review-iu-park-bo-gum-show-must-watch-netflix-2691585-2025-03-10",
      "headline": "When Life Gives You Tangerines review:  IU, Park Bo-gum's series is a must-watchReleased-Fri Mar 07, 2025In When Life Gives You Tangerines, IU and Park Bo-gum deliver mesmerising performances in a story that spans decades. Set against the backdrop of 1960s Jeju, this K-drama explores themes of love, endurance, and the quiet strength of women."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/actor-helly-shah-on-tv-future-we-need-to-up-our-game-2691576-2025-03-10",
      "headline": "Actor Helly Shah on TV's future: We need to up our gameActor Helly Shah talks about her comedy debut, TV's regressive content, and her Bollywood aspirations. She also shares that she dreams of playing bold and tough roles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/lollapalooza-day-2-green-day-louis-tomlinson-aurora-thunderous-india-debut-2691518-2025-03-10",
      "headline": "Lollapalooza Day 2: Green Day, Louis Tomlinson, Aurora make thunderous India debutMumbai's Mahalaxmi Racecourse became the epicentre of music as Lollapalooza India 2025 wrapped up Day 2. From Green Day's electrifying debut to indie rock and soulful serenades, it was a night of musical magic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/suits-la-harvey-spector-new-promo-gabriel-macht-lands-on-the-west-coast-throws-some-sass-at-ted-black-2691425-2025-03-10",
      "headline": "Suits LA: Harvey Spector lands on the West Coast, throws some sass at Ted BlackIn the new promo of 'Suits LA', Harvey Spector is finally seen interacting with Ted Black. Actor Gabriel Macht will be joining the show for a three-episode arc. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/shawn-mendes-indian-sitarist-megha-rasool-lollapalooza-india-2691422-2025-03-10",
      "headline": "Exclusive: How Shawn Mendes collaborated with Indian sitarist for Lolla India setSinger Shawn Mendes collaborated with sitarist Megha Rawoot for Day 1 for Lollapalooza India. In an exclusive interview with Megha Rawoot, she spoke about her performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/security-demanded-for-rashmika-mandanna-after-ravi-ganiga-teach-a-lesson-comment-row-2691414-2025-03-10",
      "headline": "Security sought for Rashmika Mandanna after MLA's 'teach her a lesson' remarkAn association seeking rights for natives of Karnataka's Coorg (Kodagu) region, Codava National Council, urged the state authorities to provide security for actor Rashmika Mandanna. According to the council, the actor was being unfairly targeted after Congress MLA Ravi Ganiga claimed she refused to attend a Kannada film industry event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/shankar-mahadevan-remembers-guiding-light-zakir-hussain-on-birth-anniversary-2691412-2025-03-10",
      "headline": "Shankar Mahadevan remembers 'guiding light' Zakir Hussain on birth anniversaryIt was legendary tabla maestro Zakir Hussain's 74th birth anniversary on Sunday. Marking the occasion, singer and composer Shankar Mahadevan honoured him with heartfelt birthday wishes on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/lady-gaga-recalls-psychosis-diagnosis-and-how-she-felt-ashamed-to-talk-about-it-2691361-2025-03-10",
      "headline": "Lady Gaga recalls psychosis diagnosis and how she felt 'ashamed' to talk about itIn an interview, singer Lady Gaga discussed her personal struggles that kept her away from music. She shared insights into her mental health journey, being diagnosed with psychosis and the support from her partner, Michael Polansky."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-last-of-us-2-trailer-pedro-pascal-and-bella-ramsey-thrilling-return-2691194-2025-03-09",
      "headline": "The Last of Us 2 trailer: Pedro Pascal and Bella Ramsey promise thrilling returnThe first full trailer of The Last of Us Season 2 is here. Starring Pedro Pascal and Bella Ramsey in lead roles, the HBO Max series promises a bigger and better season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/lollapalooza-india-shawn-mendes-wows-jonita-gandhi-divine-set-stage-ablaze-2691075-2025-03-09",
      "headline": "Lollapalooza India Day 1: Shawn Mendes must return for a solo concert in IndiaThe first day of Lollapalooza India 2025 kicked off on a grand note with Canadian singer Shawn Mendes' electrifying performance. The show also witnessed performances by several Indian artists, like Jonita Gandhi and Divine among others. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/shawn-mendes-honours-virat-kohli-wears-team-india-jersey-mumbai-show-lollapalooza-2025-2691066-2025-03-09",
      "headline": "Shawn Mendes honours Virat Kohli, wears Team India jersey at Mumbai show. WatchSinger Shawn Mendes impressed fans with his debut India performance on March 8 at the Lollapalooza Mumbai show. During the concert, the singer delighted fans by wearing Virat Kohli's Team India jersey.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/shawn-mendes-sings-senorita-on-mumbai-street-ahead-of-lollapalooza-india-2025-2690957-2025-03-08",
      "headline": "Viral: Shawn Mendes sings Senorita on Mumbai street ahead of concertCanadian singer Shawn Mendes, who is currently in India, performed his hit song Senorita on a Mumbai street on Saturday, much to the delight of his fans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/video/zahan-kapoor-on-legacy-black-warrant-and-carving-his-own-path-watch-video-india-today-conclave-2025-2690902-2025-03-08",
      "headline": "Zahan Kapoor on legacy, Black Warrant, and carving his own path. Watch"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/zahan-kapoor-black-warrant-kapoor-family-ranbir-kapoor-india-today-conclave-2690795-2025-03-08",
      "headline": "Zahan Kapoor reflects on celebrityhood, Kapoor legacy and Black Warrant's successActor Zahan Kapoor opened up about his career, his latest Netflix show, Black Warrant, his famous cousins, and more, at the India Today Conclave 2025 held in New Delhi on Saturday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mindy-kaling-reacts-to-criticism-of-meghan-markle-with-love-meghan-2690838-2025-03-08",
      "headline": "Mindy Kaling reacts to criticism of Meghan Markle's With Love, MeghanActor and creator Mindy Kaling has finally reacted to the criticism of Meghan Markle's lifestyle series, With Love, Meghan. The show premiered on Netflix on March 4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-electric-state-review-russo-brothers-dystopian-film-sparks-and-fizzles-out-2690796-2025-03-08",
      "headline": "The Electric State review: Russo Brothers' dystopian film sparks and fizzles outReleased-Fri Mar 14, 2025The Netflix film, 'The Electric State' falls short of entertainment. The chemistry between Millie Bobbie Brown and Chris Pratt looks awkward, while the bots don't do enough to keep the excitement alive. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/nadaaniyan-x-reviews-internet-shreds-ibrahim-ali-khan-khushi-kapoor-film-calls-it-trashy-2690816-2025-03-08",
      "headline": "Nadaaniyan X reviews: Internet shreds Ibrahim-Khushi's film, calls it trashyNadaaniyan, starring Ibrahim Ali Khan and Khushi Kapoor, debuts on Netflix to widespread criticism, with viewers and critics alike branding it 'unbearable' and 'trashy'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ruby-review-a-debut-album-thats-ambitious-polished-and-unapologetically-jennie-2690749-2025-03-08",
      "headline": "Ruby review: A debut album that's ambitious, polished, and unapologetically Jennie Blackpink's Jennie's debut solo album, Ruby, is a bold exploration of her musical identity, featuring 15 tracks that delve into themes of empowerment and self-discovery. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/meghan-markle-with-love-meghan-renewed-for-season-2-amid-criticism-2690736-2025-03-08",
      "headline": "Meghan Markle's With Love, Meghan renewed for season 2 amid criticismThe Duchess of Sussex, Meghan Markle, has announced a second season of her Netflix series, With Love, Meghan. The show premiered on the OTT giant on March 4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/armaan-malik-kritika-malik-son-zaid-diagnosed-with-rickets-dont-curse-children-payal-malik-2690728-2025-03-08",
      "headline": "BB OTT 3 fame Kritika-Armaan Malik's son Zaid diagnosed with ricketsBigg Boss OTT 3 fame Kritika Malik and husband Armaan Malik's son, Zaid has been diagnosed with rickets. The news was shared by Armaan's first wife, Payal Malik, in her latest vlog. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/neena-gupta-tvf-phulera-ka-panchayati-raj-exposes-proxy-politics-in-rural-india-2690697-2025-03-08",
      "headline": "Neena Gupta's 'Phulera Ka Panchayati Raj' exposes proxy politics in rural IndiaTVF's new series 'Phulera Ka Panchayati Raj' exposed the problem of proxy politics in rural India. In collaboration with the popular series, Panchayat, the series starring Neena Gupta, Faisal Malik, and others is currently trending at No 1 on YouTube. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/pritam-defends-blackpink-jennie-plagiarism-controversy-minor-similarities-statement-rocky-aur-rani-kii-prem-kahaani-alia-bhatt-2690676-2025-03-08",
      "headline": "Pritam defends Blackpink's Jennie amid plagiarism row: Minor similarities happenMusic composer Pritam recently shared a statement and defended Blackpink's Jennie amid plagiarism claims after her recently released teaser looked similar to Alia Bhatt's theme song from Rocky Aur Rani Kii Prem Kahaani. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mobland-trailer-out-tom-hardy-pierce-brosnan-helen-mirren-guy-ritchie-jiohotstar-2690587-2025-03-07",
      "headline": "Mobland trailer: Tom Hardy, Pierce Brosnan headline Guy Ritchie's new crime showMobland, the much-awaited crime series by Guy Ritchie, is all set for its grand premiere on JioHotstar this March. Featuring stars like Tom Hardy and Helen Mirren, the show explores the dark world of international crime syndicates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/video/rishab-sharma-on-starting-his-own-clothing-brand-popularising-sitar-2690428-2025-03-07",
      "headline": "Rishab Sharma on popularising Sitar, starting his own clothing brandRenowned 26-year-old sitar player Rishab Rikhiram Sharma blends classical and modern music. Trained under Ravi Shankar, he performs globally, including at the White House. Known for his mehendi-adorned hands, he also creates music for mental health. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/what-rick-hoffman-entry-as-louis-litt-means-for-suits-la-2690452-2025-03-07",
      "headline": "What Rick Hoffman's entry as Louis Litt means for Suits LAActor Rick Hoffman will be reprising his iconic character, Louis Litt, from 'Suits', in one of the upcoming episodes of 'Suits LA'. The news comes days after the show received bad reviews for lacking excitement like the original one. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/why-sitrarist-rishab-sharma-wears-mehndi-for-every-performance-india-today-conclave-2025-2690388-2025-03-07",
      "headline": "Why sitarist Rishab Sharma wears mehndi for every performanceSitarist Rishab Sharma embraces mehndi as part of his stage presence, blending tradition with innovation. The young sitarist shares how he enhances performance aesthetics while breaking stereotypes."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/trump-tariff-cut-claim-parliament-penal-india-trade-2692029-2025-03-11#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "No commitments made: India on Donald Trump's tariff cut claimIndia has made no trade tariff commitments to the US, Commerce Secretary Sunil Barthwal told a Parliamentary panel, rejecting President Trump's claim that New Delhi agreed to significantly slash import duties on American products. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/gold-smuggling-case-karnataka-orders-probe-into-role-of-ranya-raos-ips-father-in-protocol-breach-at-airport-2691978-2025-03-11#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ranya Rao's cop father under lens in smuggling case over airport protocol 'misuse'The Karnataka government launched an investigation into protocol violations at Bengaluru airport following actor Ranya Rao's gold smuggling arrest. The inquiry will look into IPS officer K Ramachandra Rao's role and possible police involvement in security breaches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tn-nep-three-language-policy-opposition-stalin-trolled-yappa-yappa-stalin-appa-2691924-2025-03-11#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Stalin's anti-Hindi stand gets troll treatment with 'Yappa Yappa Stalin Appa'Tamil Nadu Chief Minister MK Stalin is facing an unusual wave of trolling over his stand against the \"Hindi imposition\". The BJP seized the moment to highlight what they call DMK's hypocrisy on the three-language policy."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/elon-musk-doge-ceo-job-difficult-to-handle-tesla-share-price-us-stock-market-crash-2692036-2025-03-11#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Elon Musk says balancing DOGE and CEO roles is tough as Tesla shares slideElon Musk has been actively involved in Tesla, SpaceX, X (formerly Twitter), and xAI, along with his inclination to working with the Department of Government Efficiency (DOGE). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/india-has-democracy-not-democratic-values-opinion-2691977-2025-03-11#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India has democracy, not democratic valuesMost parties in India are family-run circuses and the one that isn't has different family values, not strictly democratic values, to guide it. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uddhav-thackeray-devendra-fadnavis-banter-mercedes-cars-prices-maharashtra-budget-2691973-2025-03-11#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Mercedes prices up?' Uddhav Thackeray, Devendra Fadnavis banter over budgetThe light-hearted banter happened when Uddhav Thackeray crossed paths with Devendra Fadnavis and his deputy Ajit Pawar in the Maharashtra Assembly after the Budget presentation on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-stock-market-crash-bloodbath-on-wall-street-no-major-impact-sensex-and-nifty-2691987-2025-03-11#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US stock market crash: Why Sensex, Nifty aren't feeling the heatThe S&P BSE Sensex was down less than 170 points at around 11:35 am, while the NSE Nifty50 fluctuated between gains and losses. The 50-share index was down barely 20 points but showed no signs of panic. Broader market indices also stayed flat as volatility spiked."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-lieutenant-general-pakistan-ties-surveillance-army-chief-coup-plot-2692032-2025-03-11#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bangladesh moves against top army general close to Pak over coup plot: SourcesThe move comes after the Bangladesh Army chief was flagged about meetings being called by Lt Gen Faizur Rahman, a known Jamaat sympathiser, without his knowledge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-comforts-nervous-shaitaan-actor-janki-bodiwala-iifa-2025-video-2691947-2025-03-11#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "SRK's comforting words to nervous Shaitaan actor at IIFA 2025 win the InternetShaitaan actor Janki Bodiwala won her first IIFA award, presented by Shah Rukh Khan. Overwhelmed, she called it a \"dream come true.\" SRK comforted her on stage, winning fans over with his humility."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/indian-origin-student-sudiksha-konanki-disappearance-in-dominican-republic-mystery-deepens-as-conflicting-accounts-emerge-2692019-2025-03-11#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Drowned or kidnapped? Mystery deepens in Indian-origin student's disappearanceAs the search for University of Pittsburgh student Sudiksha Konanki enters its fourth day, conflicting accounts from friends and growing family concerns add to the mystery of her disappearance from a Dominican Republic beach. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/dalit-student-several-fingers-chopped-off-pulled-out-of-bus-tirunelveli-tamil-nadu-2691974-2025-03-11#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Fingers of Dalit student on his way to exam chopped, family says caste violenceA Class 11 student from Scheduled Caste community was attacked and his fingers were chopped off by a gang of three men in Tirunelveli, Tamil Nadu. His family claimed it was caste-related violence because the student defeated caste Hindus in a Kabaddi match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-narendra-modi-mauritius-mini-india-1998-visit-ramayana-conference-2691944-2025-03-11#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "PM's déjà vu moment? When Modi visited 'Mini India' Mauritius 27 years agoPM Modi in Mauritius: Known as 'mini India' due to its large Indian-origin population, Mauritius holds a special place in PM Modi's heart. The connection dates back 27 years, when Modi first went to Mauritius to address the Ramayana Conference."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/donald-trumps-recession-remark-rattles-wall-street-crash-is-the-fear-justified-2691939-2025-03-11#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US recession: Is it a possibility or just a Wall Street worry?The massive sell-off on Wall Street was triggered by Donald Trump's recent remark on the possibility of a US recession in 2025. But is a US recession actually looming? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-envoy-ahsan-wagan-to-turkmenistan-denied-us-entry-deported-2691899-2025-03-11#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Pakistani envoy denied entry, deported from US in rare incident: ReportPakistan's ambassador to Turkmenistan, KK Ahsan Wagan, was deported from Los Angeles despite holding a valid visa and all legal travel documents.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-final-rohit-sharma-virat-kohli-retirement-squashed-2691892-2025-03-11#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rohit, Kohli show there is more than one way to answer retirement callsVirat Kohli and Rohit Sharma answered their critics in fine fashion and guided India to their third Champions Trophy title on Sunday, March 9. With no retirement on the horizon for both men, is the famous Ro-Ko aiming for a World Cup 2027 bow?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-buy-tesla-elon-musk-great-american-us-protests-doge-2691941-2025-03-11#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Buying a Tesla tomorrow: Trump backs Elon Musk amid boycott, plunging sharesDonald Trump has pledged to buy a Tesla, calling it a stand against an \"illegal boycott\" of Elon Musk. His announcement follows nationwide protests targeting Tesla over Musk's role in the Trump administration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/us-woman-gets-romantic-napkin-note-from-pilot-apologises-video-goes-viral-2691946-2025-03-11#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US influencer gets romantic note from pilot, apologises after video goes viralA US-based influencer apologised after a video of her claiming that she received a romantic note from an unknown pilot went viral on social media.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-yogi-adityanath-backs-sambhal-cop-in-holi-friday-namaz-row-2691478-2025-03-10#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why Yogi Adityanath backs Sambhal cop in Holi-Friday namaz rowThe Uttar Pradesh CM, speaking at the India Today Conclave 2025, underlined the segregated Holi-Friday prayers plan for the district. On DSP Anuj Kumar Chaudhary, he said…\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ranya-rao-gold-smuggling-case-hoteliers-grandson-arrested-in-rs-12-crore-gold-smuggling-case-was-friends-with-kannada-actor-2691948-2025-03-11#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Hotelier's grandson arrested in gold smuggling case, was friends with Ranya RaoThe DRI has arrested Tarun Raju, grandson of Atria Hotel's owner, in Bengaluru for his alleged role in the gold smuggling case linked to actor Ranya Rao, sources said. His arrest follows Rao's recent detention with gold worth Rs 12.56 crore."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/uttar-pradesh-kanpur-man-kills-unfaithful-girlfriend-confesses-friend-over-phone-proud-of-beauty-tell-her-father-2691945-2025-03-11#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Man kills 'unfaithful' girlfriend, calls her friend: She was proud of her beautyA man killed his 17-year-old girlfriend by slitting her throat in Uttar Pradesh's Kanpur, claiming she was unfaithful. Then, he called the victim's friend and confessed to the crime, saying \"she was very proud of her beauty\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/beauty/story/can-drinkable-sunscreen-replace-your-regular-one-2691690-2025-03-11#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Can drinkable sunscreen replace your regular one?Drinkable sunscreen is an oral supplement designed to provide internal sun protection by helping the body combat UV damage from within."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bhupesh-baghels-son-chaitanya-summoned-by-ed-day-after-raids-in-chhattisgarh-liquor-scam-2691981-2025-03-11#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "ED summons Bhupesh Baghel's son day after raids in Chhattisgarh liquor 'scam'The Enforcement Directorate has summoned former Chhattisgarh Chief Minister Bhupesh Baghel's son Chaitanya Baghel on March 15, a day after raids in connection with an alleged money laundering in a liquor scam."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/chandigarh/story/chandigarh-porsche-accident-speeding-car-collides-with-two-scooters-1-killed-2691917-2025-03-11#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Chandigarh crash: 1 killed, scooter split in two after being dragged by PorscheA speeding Porsche allegedly hit two scooters in Chandigarh's Sector 4, killing one man and injuring two women. The impact of the collision was such that the scooter rider's body was cut into two peices. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/elon-musks-net-worth-tumbles-by-132-billion-lost-29-billion-in-a-day-2692018-2025-03-11#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Elon Musk's net worth tumbles by $132 billion, lost $29 billion in a dayAs Tesla's shares tanked on Monday, Elon Musk lost $29 billion in just a day, with his net worth declining by $132 billion since the beginning of 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/javed-akhtar-wonders-why-south-films-are-dominating-aamir-khan-explains-bigger-issue-2692049-2025-03-11",
      "headline": "Javed Akhtar wonders why south films are dominating, Aamir explains bigger issueJaved Akhtar questioned why South films thrive in the North, while Aamir Khan blamed Hindi cinema's flawed OTT model and loss of emotional depth. He urged creators to focus on authentic storytelling."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/neena-gupta-share-her-take-on-modern-women-crisis-career-marriage-egg-freezing-2692013-2025-03-11",
      "headline": "Neena Gupta says women are in 'crisis' right now: Want to work but also settle downActor Neena Gupta, in an exclusive conversation with India Today Digital, discussed the challenges faced by modern women in balancing career and personal life. She underscored the societal pressures, while advocating for professional independence and acknowledging the complexities of relationships."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/chhaava-box-office-collection-day-25-detailed-report-vicky-kaushal-film-smashes-baahubali-2-hindi-record-in-week-4-2692030-2025-03-11",
      "headline": "Chhaava box office Day 25: Vicky's film smashes Baahubali 2 Hindi record in Week 4'Chhaava' has now got to beat 'Pathaan' and 'Gadar 2' to become the fourth highest-grossing Hindi film of all time. 'Pushpa 2' with its whopping Rs 835 crore nett still remains the biggest Hindi-grosser of all time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-coolie-teaser-lokesh-kanagaraj-birthday-2692025-2025-03-11",
      "headline": "Rajinikanth's Coolie teaser to be out on director Lokesh's birthday: ReportsSuperstar Rajinikanth's Coolie teaser is likely to be released later this week. Reports suggest that the glimpse will be released on Lokesh Kanagaraj's birthday."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-stadium-treated-wastewater-ipl-2025-water-crisis-2692037-2025-03-11",
      "headline": "Bengaluru's Chinnaswamy stadium to use treated wastewater for IPL 2025As Bengaluru faces another water crisis as summer approaches, the authorities will continue supplying treated wastewater to Chinnaswamy Stadium for IPL 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-mumbai-indians-hardik-pandya-2692024-2025-03-11",
      "headline": "Hardik Pandya joins Mumbai Indians after Champions Trophy winIPL 2025: After guiding India to glory in the Champions Trophy in Dubai, Hardik Pandya has joined the Mumbai Indians (MI) and will be looking to put in some strong performances for the five-time champions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-royal-challengers-bengaluru-18-years-delhi-capitals-2692011-2025-03-11",
      "headline": "On This Day: RCB sign Virat Kohli in IPL U-19 draft after Delhi blunderOn this day in 2008, Royal Challengers Bengaluru snapped up Virat Kohli during the IPL U-19 draft after Delhi opted not to sign their local man. Kohli has remained with RCB since the first IPL season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-wpl-2025-mumbai-indian-rcb-qualification-scenario-2691998-2025-03-11",
      "headline": "RCB can play party-spoilers for Mumbai Indians. Here's howWPL 2025: The match between Mumbai Indians (MI) and Royal Challengers Bengaluru (RCB) on Tuesday at the Brabourne Stadium would decide the finalist for the ongoing edition. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-indian-team-no-felicitation-ceremony-ipl-2025-2691985-2025-03-11",
      "headline": "Why Indian team won't have felicitation ceremony after Champions Trophy winThe Indian team won't have a felicitation ceremony after their Champions Trophy win on Sunday, March 9 against New Zealand. The players are slowly returning home after their title win with IPL 2025 season set to start. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/all-england-open-championships-pv-sindhu-lakshya-sen-2691980-2025-03-11",
      "headline": "All England Open Badminton Championships: When and where to watch Double Olympic medallist PV Sindhu, Lakshya Sen are amongst the Indian stars to take part in the All England Open Badminton Championships 2025 to be staged from March 11 to 16 in Birmingham. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-central-contract-list-shakib-al-hasan-mahmudullah-2691952-2025-03-11",
      "headline": "No Shakib, Mahmudullah opts out as BCB reveal 2025 central contract listShakib Al Hasan was overlooked as Mahmudullah decided to opt out of the Bangladesh Cricket Board's central contract list for 2025. Taskin Ahmed was the only player to be given the Grade A+ contract. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-united-jim-ratcliffe-ruben-amorim-2691934-2025-03-11",
      "headline": "Some Manchester United players not 'good enough', some 'overpaid': Jim RatcliffeManchester United co-owner Jim Ratcliffe has delivered a damning verdict on the current squad, saying some of the players are not 'good enough'. Ratcliffe also gave his backing to current manager Ruben Amorim. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravindra-jadeja-joins-csk-squad-pushpa-style-allu-arjun-2691914-2025-03-11",
      "headline": "Watch: After Champions Trophy win, Ravindra Jadeja joins CSK in 'Pushpa' styleAfter helping India win the Champions Trophy, Ravindra Jadeja arrived at the Chennai Super Kings team base with some 'Pushpa' swag on Monday, March 10. Jadeja will be a key player for Chennai this season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/sports-ministry-wfi-suspension-revoked-2691900-2025-03-11",
      "headline": "Sports Ministry revokes suspension of Wrestling Federation of India The Sports Ministry has revoked the suspension of the Wrestling Federation of India (WFI). Back in December 2023, the Ministry had suspended the WFI over taking hasty decision and showing disregard for the existing rules and regulations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-final-rohit-sharma-virat-kohli-retirement-squashed-2691892-2025-03-11",
      "headline": "Rohit, Kohli show there is more than one way to answer retirement callsVirat Kohli and Rohit Sharma answered their critics in fine fashion and guided India to their third Champions Trophy title on Sunday, March 9. With no retirement on the horizon for both men, is the famous Ro-Ko aiming for a World Cup 2027 bow?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-central-contract-list-shakib-al-hasan-mahmudullah-2691952-2025-03-11",
      "headline": "No Shakib, Mahmudullah opts out as BCB reveal 2025 central contract listShakib Al Hasan was overlooked as Mahmudullah decided to opt out of the Bangladesh Cricket Board's central contract list for 2025. Taskin Ahmed was the only player to be given the Grade A+ contract. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-united-jim-ratcliffe-ruben-amorim-2691934-2025-03-11",
      "headline": "Some Manchester United players not 'good enough', some 'overpaid': Jim RatcliffeManchester United co-owner Jim Ratcliffe has delivered a damning verdict on the current squad, saying some of the players are not 'good enough'. Ratcliffe also gave his backing to current manager Ruben Amorim. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravindra-jadeja-joins-csk-squad-pushpa-style-allu-arjun-2691914-2025-03-11",
      "headline": "Watch: After Champions Trophy win, Ravindra Jadeja joins CSK in 'Pushpa' styleAfter helping India win the Champions Trophy, Ravindra Jadeja arrived at the Chennai Super Kings team base with some 'Pushpa' swag on Monday, March 10. Jadeja will be a key player for Chennai this season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/sports-ministry-wfi-suspension-revoked-2691900-2025-03-11",
      "headline": "Sports Ministry revokes suspension of Wrestling Federation of India The Sports Ministry has revoked the suspension of the Wrestling Federation of India (WFI). Back in December 2023, the Ministry had suspended the WFI over taking hasty decision and showing disregard for the existing rules and regulations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-new-zealand-final-rohit-sharma-virat-kohli-retirement-squashed-2691892-2025-03-11",
      "headline": "Rohit, Kohli show there is more than one way to answer retirement callsVirat Kohli and Rohit Sharma answered their critics in fine fashion and guided India to their third Champions Trophy title on Sunday, March 9. With no retirement on the horizon for both men, is the famous Ro-Ko aiming for a World Cup 2027 bow?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-haris-rauf-baby-boy-father-new-zealand-t20is-2691884-2025-03-11",
      "headline": "Haris Rauf blessed with baby boy before New Zealand T20IsPakistan speedster Haris Rauf became a father with wife Muzna Masood Malik. Rauf's teammates Shadab Khan and Shaheen Shah Afridi took to social media to congratulate the pacer. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-mayank-yadav-lsg-pacer-injury-2691875-2025-03-11",
      "headline": "Another injury blow to Mayank Yadav, pacer to miss 1st half of IPL: Report IPL 2025: LSG fast bowler Mayank Yadav is racing against time to recover from the back injury he sustained last year. The speedster could only play four games last year due to a side strain. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-new-zealand-final-mitchell-santner-feature-2691475-2025-03-11",
      "headline": "Transitioning New Zealand deserve to be put on a high pedestal   Champions Trophy 2025: Despite not having Matt Henry, their premier fast bowler and the leading wicket-taker of the tournament, New Zealand, with their limited resources, made India work hard in the final on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-michael-bracewell-new-zealand-vs-pakistan-t20is-squad-2691857-2025-03-11",
      "headline": "Bracewell to lead New Zealand in T20I series against Pakistan NZ vs PAK: All-rounder Michael Bracewell has been named captain in Mitchell Santner's absence for New Zealand's upcoming five-match T20I series against Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-mumbai-indians-vs-gujarat-giants-wpl-2025-mi-w-ggtw-2691820-2025-03-11",
      "headline": "WPL: Mumbai Indians closing in on top spot with 9-run win over Gujarat GiantsMumbai Indians beat Gujarat Giants by nine runs in Match 19 of the Women's Premier League 2025 at Brabourne Stadium, Mumbai. Following their win, MI have a great chance of finishing at the top on points table and directly qualify for the final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-rohit-sharma-poses-with-his-two-icc-trophies-in-front-of-burj-khalifa-2691817-2025-03-10",
      "headline": "Watch: Rohit Sharma poses with his two ICC trophies in front of Burj KhalifaIndia captain Rohit Sharma posed with his two ICC trophies in front of Burj Khalifa following India's triumph in the ICC Champions Trophy 2025. India beat New Zealand by four wickets in the final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/former-steelers-player-and-broadcaster-craig-wolfley-dies-at-66-2691816-2025-03-10",
      "headline": "Former Steelers Player and Broadcaster Craig Wolfley Dies at 66Craig Wolfley, a former American footballer and broadcaster, died at 66, confirmed Pittsburgh WDVE-FM radio station on Monday, where he served as a colour commentator."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-rohit-sharma-mumbai-airport-wife-kids-2691809-2025-03-10",
      "headline": "Watch: After Champions Trophy win, Rohit Sharma back to daddy duties in MumbaiIndia captain Rohit Sharma returned back to daddy duties on his trip back home. Rohit was seen holding a sleepy Samaira (his daughter) as he arrived at the Mumbai airport on Monday, March 10."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-mumbai-indians-vs-gujarat-giants-wpl-2025-mi-w-ggtw-2691820-2025-03-11",
      "headline": "WPL: Mumbai Indians closing in on top spot with 9-run win over Gujarat GiantsMumbai Indians beat Gujarat Giants by nine runs in Match 19 of the Women's Premier League 2025 at Brabourne Stadium, Mumbai. Following their win, MI have a great chance of finishing at the top on points table and directly qualify for the final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-rohit-sharma-poses-with-his-two-icc-trophies-in-front-of-burj-khalifa-2691817-2025-03-10",
      "headline": "Watch: Rohit Sharma poses with his two ICC trophies in front of Burj KhalifaIndia captain Rohit Sharma posed with his two ICC trophies in front of Burj Khalifa following India's triumph in the ICC Champions Trophy 2025. India beat New Zealand by four wickets in the final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/former-steelers-player-and-broadcaster-craig-wolfley-dies-at-66-2691816-2025-03-10",
      "headline": "Former Steelers Player and Broadcaster Craig Wolfley Dies at 66Craig Wolfley, a former American footballer and broadcaster, died at 66, confirmed Pittsburgh WDVE-FM radio station on Monday, where he served as a colour commentator."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-rohit-sharma-mumbai-airport-wife-kids-2691809-2025-03-10",
      "headline": "Watch: After Champions Trophy win, Rohit Sharma back to daddy duties in MumbaiIndia captain Rohit Sharma returned back to daddy duties on his trip back home. Rohit was seen holding a sleepy Samaira (his daughter) as he arrived at the Mumbai airport on Monday, March 10."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-even-if-india-played-outside-of-dubai-they-would-still-be-champions-gavaskar-2691790-2025-03-10",
      "headline": "Even if India played outside of Dubai, they would still be Champions: GavaskarLegendary cricketer Sunil Gavaskar said that India would've won the ICC Champions Trophy 2025 even if they had played outside of Dubai. There was widespread criticism of team India for playing all of their matches in Dubai throughout the tournament. India beat New Zealand by four wickets in the final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/isl-mohammedan-sporting-no-wins-at-home-2691792-2025-03-10",
      "headline": "Mohammedan Sporting finish maiden ISL season without single win at homeMohammedan Sporting finished their maiden season in the Indian Super League, without a single win at home. The club drew against Punjab FC in their final home game of the season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/shows/story/the-buzz-nba-play-in-tournament-2025-when-and-where-to-watch-livestreaming-2691738-2025-03-10",
      "headline": "NBA Play-In Tournament 2025: How to Watch, Standings, Schedule, and MoreThe NBA Play-In tournament is set to start in Apri. The tournament is going to be crucial in determining the final two playoffs spots in both the Eastern and Western Conferences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/when-rohit-sharma-got-the-trophy-emotions-got-the-better-of-me-sunil-gavaskar-2691779-2025-03-10",
      "headline": "When Rohit Sharma got the trophy, emotions got the better of me: Sunil Gavaskar Legendary India cricketer Sunil Gavaskar has said that the emotions got the better of him when captain Rohit Sharma lifted the ICC Champions Trophy 2025. Gavaskar was seen dancing in jubilation as India beat New Zealand by four wickets to clinch their third Champions Trophy title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/indian-wells-qinwen-zheng-beats-lulu-su-2691777-2025-03-10",
      "headline": "Qinwen Zheng beats Lulu Sun in straight sets, advances to Round of 16China's Qinwen Zheng defeated New Zealand's Lulu Sun in straight sets to progress to the Round of 16. Zheng won the rematch of the clash from Wimbledon 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-yuzvendra-chahal-girlfriend-dhanashree-verma-instagram-2691771-2025-03-10",
      "headline": "Dhanashree Verma's cryptic post after Yuzvendra Chahal, RJ Mahvash seen togetherIndia spinner Yuzvendra Chahal went viral on social media after he was seen with internet personality RJ Mahvash during the Champions Trophy Final. A day after the final, Dhanashree Verma posted an cryptic story on her Instagram profile."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-ambati-rayudu-trolls-rcb-despite-sanjay-bangars-warning-2691763-2025-03-10",
      "headline": "Ambati Rayudu trolls RCB despite Sanjay Bangar's warning during Champions Trophy finalFormer Chennai Super Kings (CSK) batter Ambati Rayudu trolled Royal Challengers Bengaluru (RCB) fans while doing commentary during the ICC Champions Trophy 2025 final between India and New Zealand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/who-is-delhi-capitals-captain-kl-rahul-axar-patel-2691742-2025-03-10",
      "headline": "Axar Patel vs KL Rahul: Delhi Capitals set to take captaincy call soonDelhi Capitals are yet to announce their captain for the upcoming Indian Premier League season. Sources have told PTI that the franchise is considering between Axar Patel and KL Rahul."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/champions-trophy-gautam-gambhir-returns-india-delhi-airport-2691739-2025-03-10",
      "headline": "Fans give Gautam Gambhir grand welcome in Delhi after Champions Trophy triumphIndia head coach Gautam Gambhir received a grand welcome at the Delhi airport on Monday, 10 March. Gambhir returned from the UAE after winning the Champions Trophy."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/naji-marshall-joins-mavericks-elite-club-with-34-point-night-glbs-2691731-2025-03-10",
      "headline": "Naji Marshall joins Mavericks' elite club with 34-point nightNaji Marshall's career-best 34 points weren't enough as the injury-riddled Mavericks lost their fifth straight game. With 10 sidelined players, Dallas' struggles continue.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-kl-rahul-admits-being-tense-in-champions-trophy-final-2691724-2025-03-10",
      "headline": "KL Rahul admits being tense in Champions Trophy final: I was shi*** myselfIndia batter KL Rahul said that he was tense during the final of the ICC Champions Trophy 2025 against New Zealand. Rahul played a crucial innings of 34* (33) to help India chase down 252."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-best-fielder-in-the-world-jonty-rhodes-2691713-2025-03-10",
      "headline": "Jonty Rhodes vs Glenn Phillips: Proteas legend settles best fielder debateLegendary South African cricketer Jonty Rhodes has shared his thoughts on who is the best fielder in this generation, he or Glenn Phillips. Rhodes gladly agreed that Phillips is perhaps the greatest fielder of this generation."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}