{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-prices-in-india-metro-cities-should-you-invest-insights-yellow-metal-rates-2713281-2025-04-23",
      "headline": "Gold price falls from all-time high. Check latest prices in IndiaGold prices had been rising earlier due to a weaker US dollar and ongoing trade tension between the United States and China. However, the sentiment changed after a more positive message from the US President."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/income-tax-2025-e-pay-tax-feature-check-step-by-step-process-to-pay-tax-in-minutes-2713280-2025-04-23",
      "headline": "Income Tax 2025: Check step-by-step process to pay tax in minutesWhether you're a salaried individual, a business owner, or a freelancer, this digital facility helps with paying your taxes right from the comfort of your home, without the need to stand in long queues or fill out tedious forms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ather-energy-ipo-check-price-band-opening-date-gmp-key-details-2713256-2025-04-23",
      "headline": "Ather Energy IPO: Check opening date, price band and other key detailsAther Energy IPO: The subscription window will open on Monday, April 28, and close on Wednesday, April 30. Ahead of this, allocation to anchor investors is scheduled for Friday, April 25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hcltech-share-price-jumps-q4-results-brokerage-views-buy-hold-or-sell-2713235-2025-04-23",
      "headline": "HCLTech shares jumps nearly 7% after Q4 results. Should you buy, hold or sell?The IT major reported a net profit of Rs 4,307 crore for Q4FY25, marking an 8% year-on-year increase. Revenue from operations rose 6% YoY to Rs 30,246 crore. Read to know if you should buy, sell, or hold the stock."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-price-at-rs-4000-dollar-by-2026-jp-morgan-shares-view-2713228-2025-04-23",
      "headline": "Gold at $4,000 by next year? Here's what JP Morgan saysJP Morgan sees gold averaging $3,675 per ounce by the fourth quarter of 2025 and noted that prices could reach the $4,000 mark sooner if investor and central bank demand remains strong."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-hits-80000-why-is-market-rising-reasons-behind-dalal-street-rally-nifty-bse-nse-2713223-2025-04-23",
      "headline": "Sensex crosses 80,000 level: 3 reasons behind Dalal Street's rallySensex added over 500 points and crossed the 80,000 mark once again, after having corrected nearly 12-15% earlier this year. Sensex had crossed the 80,000 level for the first time in early July 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/hcltech-tech-mahindra-infosys-tcs-why-are-it-stocks-rising-today-2713212-2025-04-23",
      "headline": "HCLTech, Tech Mahindra, Infosys, TCS: Why are IT stocks rising today?IT stocks stole the spotlight on Wednesday, rallying sharply on global cues, Trump's China remarks, and renewed FII interest. Will the momentum continue? Here is all you need to know. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hcltech-share-price-today-strong-rally-after-q4-results-brokerage-views-guidance-2713202-2025-04-23",
      "headline": "Explained: Why HCLTech share price gained 7% in early tradeHCLTech shares were up 6.07% to Rs 1,569.95 at around 9:19 am.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-nse-bse-sensex-jumps-500-points-nifty-above-24300-hcltech-gains-6-percent-2713198-2025-04-23",
      "headline": "Sensex, Nifty extend gains on positive global cues; HCL Tech surges over 7%The S&P BSE Sensex added 572.48 points to 80,168.07, while the NSE Nifty50 gained 165.90 points to 24,333.15 as of 9:18 am.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-data-network-transfers-entire-spectrum-to-airtel-bharti-hexacom-roll-out-obligations-2713193-2025-04-23",
      "headline": "Adani exits telecom play, transfers entire spectrum to AirtelThe development comes at a time when Adani Data Network was at risk of losing its entire 400 megahertz (MHz) spectrum in the 26 Gigahertz (GHz) band for not meeting its roll-out obligations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-sensex-nifty-opening-dalal-street-expectation-trading-april-23-2713187-2025-04-23",
      "headline": "Sensex, Nifty opening: Stock markets to open higher. Here's whyStock market indices closed in the green for the sixth day in a row, and Nifty hit a new calendar year high of 24,242 on Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-shares-in-focus-april-23-hlctech-airtel-ltimindtree-bajaj-housing-finance-2713181-2025-04-23",
      "headline": "Stocks to watch on April 23: HLCTech, Airtel, LTIMindtree, Bajaj Housing FinanceSeveral stocks such as HCLTech, Airtel, Waaree Energies, Varun Beverages, tec are likely to remain in focus today due to earnings updates, business announcements, and market activity."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-half-brother-rahul-bhatt-says-she-is-paani-kam-chai-in-front-of-pooja-bhatt-2713276-2025-04-23",
      "headline": "Alia Bhatt's half-brother Rahul says she is 'paani kam chai' in front of PoojaRahul Bhatt, son of filmmaker Mahesh Bhatt, claimed that his half-sister Alia Bhatt's talent doesn't compare to that of Pooja Bhatt. He described Pooja as the most talented and morally grounded among them.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jaat-box-office-collection-day-12-detailed-report-sunny-deol-film-rs-22-crore-away-from-rs-100-crore-2713274-2025-04-23",
      "headline": "Jaat box office Day 12: Sunny Deol's film Rs 22 crore away from Rs 100 croreSunny Deol's 'Jaat' has slowed down at the box office, but it is not out of the race. The film is slowly inching towards the benchmark of Rs 100 crore, but it will be interesting to see how long it takes to achieve the feat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jr-ntr-body-double-slammed-bollywood-rejected-war-2-over-low-remuneration-2713273-2025-04-23",
      "headline": "Jr NTR's body double slams Bollywood after rejecting War 2 over low remunerationJr NTR's body double, Eshwar Harris, revealed that he turned down 'War 2' after he was offered a meagre salary. He also slammed Bollywood for offering to pay less. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/pankaj-tripathi-reunites-with-omg-2-director-amit-rai-for-next-untitled-shooting-bihar-2713268-2025-04-23",
      "headline": "Pankaj Tripathi reunites with OMG 2 director Amit Rai for next untitledActor Pankaj Tripathi has reunited with 'OMG 2' director Amit Rai' for his next untitled. The shooting has begun in Bihar. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/actor-chitranshi-dhyani-reacts-to-emotional-cafe-video-gross-invasion-of-privacy-2713245-2025-04-23",
      "headline": "Gross invasion of privacy: Actor Chitranshi Dhyani reacts to emotional cafe videoActor Chitranshi Dhyani has condemned a serious breach of privacy after a private video capturing her in a vulnerable moment at a café surfaced online. She described the leak as a \"gross invasion of privacy.\"\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kesari-2-box-office-collection-day-5-detailed-report-akshay-kumar-film-steady-on-weekdays-rs-50-crore-not-far-2713219-2025-04-23",
      "headline": "Kesari 2 box office Day 5: Akshay's film steady on weekdays, Rs 50 crore not farAkshay Kumar's 'Kesari Chapter 2' is doing decent business at the box office. The film's steady pace during the weekdays is a good sign of its future, with 'Jaat' still working well at the ticket window. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karisma-kapoor-recreates-90s-magic-with-her-dance-on-le-gayi-le-gayi-watch-2713200-2025-04-23",
      "headline": "Karisma Kapoor recreates 90s magic with her dance on 'Le Gayi Le Gayi'. WatchActor Karisma Kapoor recreated 90s magic with her dance on 'Le Gayi Le Gayi' from the film, 'Dil Toh Pgal Hai'. A video from the event has gone viral. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anupam-kher-demands-ruthless-action-for-pahalgam-attack-punish-them-for-7-lifetimes-2713208-2025-04-23",
      "headline": "Punish them for 7 lifetimes: Anupam Kher demands action for Pahalgam attackActor Anupam Kher, a Kashmiri, condemned the Pahalgam attack in a video on social media. A visibly emotional and furious Kher requested PM Modi and Amit Shah to not spare the terrorists this time. He called the attack beyond barbaric, and mentioned the wife of one of the victims, whose photo is going viral on the internet. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kerala-film-body-shine-tom-chaco-warning-drug-use-misconduct-row-2713205-2025-04-23",
      "headline": "One last chance: Kerala film body warns Shine Tom Chacko amid misconduct rowThe Film Employees Federation of Kerala (FEFKA) issued a final warning to actor Shine Tom Chacko. He was accused of substance abuse and misconduct by fellow actor Vincy Aloshious. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/sophie-nyweide-child-actor-in-noah-and-an-invisible-sign-dies-at-24-2713190-2025-04-23",
      "headline": "Sophie Nyweide, child actor in Noah and An Invisible Sign, dies at 24Actor Sophie Nyweide died on April 14, her family's obituary confirmed. Her family wrote that she self-medicated and refused to take medical help."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/dipika-kakar-shoaib-ibrahim-return-delhi-left-kashmir-before-pahalgam-terror-attack-2713183-2025-04-23",
      "headline": "Dipika Kakar, Shoaib Ibrahim left Kashmir just before Pahalgam terror attackThe television couple, Dipika Kakar and Shoaib Ibrahim, who were holidaying in Pahalgam just two days before the terror attack, revealed that they reached Delhi safely. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mohanlal-sanjay-dutt-raveena-tandon-nani-celebrities-pahalgam-terror-attack-2713171-2025-04-23",
      "headline": "Shocked, angry: Mohanlal, Sanjay Dutt and celebs condemn Pahalgam terror attackMohanlal, Sanjay Dutt, Chiranjeevi, Raveena Tandon, Nani and several others expressed their shock upon hearing about the Pahalgam terror attack on Tuesday. Twenty six people, including two foreigners, died in the attack in Jammu and Kashmir."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/wednesday-season-2-teaser-arrives-on-april-23-lady-gaga-joins-the-cast-glbs-2713156-2025-04-23",
      "headline": "Wednesday Season 2 teaser arrives on April 23, Lady Gaga joins the castNetflix will release the first teaser for Wednesday Season 2 on April 23. The darker new season stars Jenna Ortega, returns key cast members, and introduces Lady Gaga in a surprise role.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/hailey-bieber-dealing-with-two-ovarian-cysts-shares-health-update-glbs-2713151-2025-04-23",
      "headline": "Hailey Bieber 'dealing with two ovarian cysts', shares health updateHailey Bieber shares health update on Instagram, revealing she's dealing with two ovarian cysts. The model previously opened up about similar struggles, adding to ongoing conversations on women's health."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/enola-holmes-3-all-you-need-to-know-about-millie-bobby-browns-upcoming-film-glbs-2713150-2025-04-23",
      "headline": "Enola Holmes 3: All you need to know about Millie Bobby Brown's upcoming film\"Millie Bobby Brown returns as the clever young detective in Enola Holmes 3, now filming in the UK. Get all the latest on the plot, cast, director, and Netflix release updates for the upcoming mystery adventure.\"\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/heartstopper-bids-farewell-nick-charlies-journey-concludes-with-netflix-feature-film-glbs-2713136-2025-04-23",
      "headline": "Heartstopper bids farewell: Nick & Charlie's journey concludes with Netflix feature filmNetflix's LGBTQ+ hit Heartstopper will conclude with a feature film in 2025. The movie wraps up Nick and Charlie's love story, offering fans a heartfelt final chapter from creator Alice Oseman.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/taarak-mehta-ka-ooltah-chashmah-actor-lalit-manchandi-dies-suicide-suspected-2713101-2025-04-22",
      "headline": "Taarak Mehta... actor Lalit Manchanda dies, television association pays tributeActor Lalit Manchanda, known for his roles in TV shows like Taarak Mehta Ka Ooltah Chashmah, was found dead at his Meerut residence. The news was confirmed by CINTAA."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/actor-hina-khan-kashmiri-reacts-to-pahalgam-terrorist-attack-2713062-2025-04-22",
      "headline": "Actor Hina Khan, a Kashmiri, reacts to Pahalgam attackActor Hina Khan, a Kashmiri herself, has expressed her sorrow and condemnation over the recent terrorist attack on tourists in Pahalgam through an Instagram post."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nani-hit-3-arjun-sarkar-meant-to-be-a-cameo-did-hit-2-to-end-on-a-high-2712897-2025-04-22",
      "headline": "HIT 3 actor Nani says Arjun Sarkar was just meant to be a cameoActor Nani reveals that his role in 'HIT 3' was not originally planned as a full-fledged lead. What began as a cameo in 'HIT 2' evolved into the intense cop character Arjun Sarkar."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-sketches-of-terrorists-released-security-agencies-2713282-2025-04-23",
      "headline": "Sketches of 3 Pahalgam terrorists released by security agenciesSketches of 3 Pahalgam terrorists released by security agencies"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jammu-and-kashmir-terror-attack-pahalgam-killed-injured-security-forces-terrorists-2712876-2025-04-22",
      "headline": "Live: Amit Shah at Pahalgam attack site after meeting with families of victimsTerror Attack In Pahalgam Live Updates: In a rare terror attack on tourists in Jammu and Kashmir on Tuesday, 26 people died. Several tourists were also injured. Terrorists attacked a group of tourists visiting Baisaran valley in Pahalgam in Jammu and Kashmir, officials said. According to initial inputs, unidentified gunmen opened fire on the tourists who had gone for a trekking trip. Prime Minister Narendra Modi landed in Delhi this morning after cutting short his Saudi Arabia visit in view of the Pahalgam terrorist attack in Kashmir. He is likely to hold a Cabinet meeting today. Several top leaders have condemned the attack. Stay tuned with indiatoday.in for live updates."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-jammu-and-kashmir-first-image-one-of-terrorists-tourists-opened-fire-exclusive-2713184-2025-04-23",
      "headline": "Exclusive: J&K attacker seen wielding AK-47 during Pahalgam attack in first photoTwenty-six people were killed after terrorists opened fire on a group of tourists at Baisaran meadow in Jammu and Kashmir's Pahalgam at around 2:30 PM on Tuesday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pahalgam-terror-attack-jammu-and-kashmir-condolences-tourists-lives-concerned-pakistan-reaction-response-2713264-2025-04-23",
      "headline": "Concerned at tourist deaths, extend condolences: Pak reacts to Pahalgam attackResponding to media queries concerning the attack, the Pakistan Foreign Office said it is concerned at the loss of tourists' lives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/pahalgam-terrorist-attack-video-shows-exact-moment-terrorists-attacked-tourists-in-jk-2713197-2025-04-23",
      "headline": "Mobile phone video captures moment terror struck meadows of PahalgamIndia Today has accessed the exact moment when terrorists belonging to The Resistance Front—an offshoot of proscribed terror group Lashkar-e-Taiba (LeT)—opened fire on tourists at the popular Baisaran meadow in Pahalgam on Tuesday afternoon, killing 26 people."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pahalgam-attack-plan-maximize-casualties-terrorists-bodycam-tourists-sniper-fire-baisaran-location-slow-response-2713238-2025-04-23",
      "headline": "Pahalgam attack planned to maximize casualties, terrorists wore body cams: ProbePreliminary probe revealed the terrorists chose Baisaran due to the absence of security forces, making rescue ops slow and casualties high. They wore helmet-mounted cameras and filmed the entire assault."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pahalgam-jammu-kashmir-terror-attack-pm-modi-security-meeting-lashkar-trf-deaths-eyewitness-amit-shah-rahul-gandhi-2713170-2025-04-23",
      "headline": "Top Lashkar commander planned Pahalgam carnage that left 26 dead: SourcesThe Pahalgam attack, the biggest terror strike on civilians since the 26/11 attacks, occurred when terrorists dressed in fatigues opened fire on tourists in Baisaran meadow. Following the attack, PM Modi returned to Delhi to take stock of the situation. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pm-modis-plane-avoids-pak-airspace-while-returning-from-saudi-after-jk-attack-2713215-2025-04-23",
      "headline": "PM's plane used Pak airspace to Saudi, avoided it while returning after J&K attackPM Modi's plane avoided Pakistan airspace as he flew back to Delhi, cutting short his Saudi Arabia trip after the terror attack in J&K."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-jammu-kashmir-army-survivors-crying-viral-video-trf-lashkar-2713214-2025-04-23",
      "headline": "Video: We're Indian Army, soldier assures as woman, son scream in PahalgamTerrified after being shot at by terrorists clad in camouflage, just like Army soldiers who arrived at the scene, some survivors began sobbing and pleading for their lives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/pahalgam-terror-attack-india-today-on-ground-zero-exclusive-choppers-screen-meadow-where-terrorists-unleashed-horror-2713222-2025-04-23",
      "headline": "India Today in Pahalgam: Choppers screen meadow where terrorists unleashed horrorThe India Today team is the first media network to reach ground zero, a day after terrorists killed 26 people in Pahalgam's Baisaran. The video shows the exact place where the terror attack occurred on Tuesday afternoon."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/information/story/who-is-the-resistance-front-trf-terror-group-behind-pahalgam-terror-attack-2713247-2025-04-23",
      "headline": "TRF terror group behind Pahalgam terror attack: Who is The Resistance Front?Lashkar-linked The Resistance Front (TRF) killed 26 people in Pahalgam, including tourists, on Tuesday and took responsibility for the act. Here's more about who they are.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anupam-kher-demands-ruthless-action-for-pahalgam-attack-punish-them-for-7-lifetimes-2713208-2025-04-23",
      "headline": "Punish them for 7 lifetimes: Anupam Kher demands action for Pahalgam attackActor Anupam Kher, a Kashmiri, condemned the Pahalgam attack in a video on social media. A visibly emotional and furious Kher requested PM Modi and Amit Shah to not spare the terrorists this time. He called the attack beyond barbaric, and mentioned the wife of one of the victims, whose photo is going viral on the internet. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-kashmir-full-list-of-victims-released-2713232-2025-04-23",
      "headline": "US-based techie, IAF official among 26 killed in attack. Who were the victims?Authorities have released the names of the victims who lost their lives in the Pahalgam terror attack, acknowledging for the first time that 26 were killed in the massacre."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jk-terror-attack-ib-officer-on-family-holiday-navy-officer-on-honeymoon-killed-pahalgam-attack-2713134-2025-04-23",
      "headline": "Intel officer was holidaying in Pahalgam, terrorists killed him in front of familyAn IB officer was killed in front of his wife and children in the Pahalgam terror attack in Jammu & Kashmir on Tuesday. An Indian Navy officer, who was recently married, was also killed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-jk-observes-rare-shutdown-after-pahalgam-attack-shops-fuel-stations-shut-2713255-2025-04-23",
      "headline": "J&K observes rare shutdown after Pahalgam attack; shops, fuel stations shutTerrorists struck at a prime tourist location in Pahalgam in south Kashmir on Tuesday, killing at least 26 people, mostly tourists, and injuring several others. Security has been beefed up across the valley, especially at vital tourist spots."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/flight-data-shows-pakistan-deploying-military-assets-to-bases-near-j-k-glbs-2713153-2025-04-23",
      "headline": "Has Pak deployed military assets to bases near J&K after Pahalgam attack?After the attack in Pahalgam, there is chatter on social media about Pakistan moving military aircraft to its bases in the north near Lahore and Rawalpindi. Several users have also posted screenshots from a flight tracking website showing the movement of PAF aircraft."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/endogamy-genetic-health-cardiac-diseases-abortions-marriage-within-communities-disorders-2712841-2025-04-23",
      "headline": "Is endogamy behind cardiac diseases, abortions, arthritis in Indians?Marrying within communities is prevalent in India, which has increased the risk of population-specific diseases. Educating people, encouraging them to undergo genetic screening, and government interventions are necessary to manage the rising genetic diseases."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-pakistan-lashkar-commander-abu-musa-bloodshed-kashmir-2713189-2025-04-23",
      "headline": "Days ahead of Pahalgam attack, Lashkar commander called for bloodshed in J&KPahalgam attack: LeT commander Abu Musa referred to the abrogation of Article 370 and a bid to change the demography of Kashmir to call for attacks in the valley."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-mi-players-to-wear-black-armbands-pahalgam-terror-attack-2713265-2025-04-23",
      "headline": "IPL 2025: Players to wear black armbands to pay homage to Pahalgam attack victimsThe BCCI (Board of Control for Cricket in India) will be paying tribute to the victims of the Pahalgam terror attack during Match 41 of the Indian Premier League 2025 (IPL 2025) between Sunrisers Hyderabad and Mumbai Indians (MI)."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-jammu-and-kashmir-infiltration-bid-foiled-indian-army-baramulla-massacre-pakistan-terrorists-killed-2713201-2025-04-23",
      "headline": "Army kills 2 terrorists, foils infiltration bid in Baramulla post Pahalgam attackThe Indian Army foiled an infiltration bid in Baramulla, killing two terrorists amid an intense firefight. This comes a day after a deadly terror attack in Pahalgam claimed 26 lives, prompting a national security response.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/dhanbad-woman-slammed-for-calling-son-anxiety-nautanki-in-viral-video-2713248-2025-04-23",
      "headline": "Dhanbad woman slammed for calling son's anxiety 'nautanki' in viral videoA woman from Dhanbad was slammed online after she shared a video she recorded of her son possibly experiencing anxiety. The internet accused her of turning a distressing moment into content. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education-today/story/andhra-pradesh-board-class-10-results-declared-students-pass-percentage-direct-link-2713221-2025-04-23",
      "headline": "Andhra Pradesh Class 10 results declared, 81.14% students pass. Check scores here Live UpdatesThe AP SSC 10th result 2025 has been declared today at 10 am. Students can now check their marks on India Today, the official BSEAP site, and DigiLocker."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/newly-married-navy-officer-on-honeymoon-killed-in-pahalgam-terror-attack-2713155-2025-04-23",
      "headline": "26-year-old Navy officer, on honeymoon, killed in Pahalgam terror attackLieutenant Vinay Narwal, a 26-year-old Indian Navy officer from Karnal, Haryana, was shot dead by terrorists while he was enjoying his first trip with his wife to Pahalgam. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-tourists-killed-injured-jammu-kashmir-ordeal-security-forces-2713085-2025-04-22",
      "headline": "Hindus were singled out, shot: Tourist's blow-by-blow account of Pahalgam attackAt least 26 people are feared dead and several others were injured after terrorists from a Lashkar-e-Taiba offshoot opened fire on tourists in Jammu and Kashmir's Pahalham on Tuesday afternoon."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-mi-players-to-wear-black-armbands-pahalgam-terror-attack-2713265-2025-04-23",
      "headline": "IPL 2025: Players to wear black armbands to pay homage to Pahalgam attack victimsThe BCCI (Board of Control for Cricket in India) will be paying tribute to the victims of the Pahalgam terror attack during Match 41 of the Indian Premier League 2025 (IPL 2025) between Sunrisers Hyderabad and Mumbai Indians (MI)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-city-beat-aston-villa-pep-guardiola-reaction-2713254-2025-04-23",
      "headline": "Manchester City beat Villa: Guardiola calls season bad despite UCL hopes aliveManchester City secured a late winner against Aston Villa to boost their hopes of Champions League qualification next season, but Pep Guardiola admitted the team has had a 'bad' season.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/looking-forward-to-having-a-positive-2nd-half-to-our-season-srh-assistant-coach-simon-helmot-2713252-2025-04-23",
      "headline": "Looking forward to having a positive 2nd half to our season: SRH assistant coachSunrisers Hyderabad (SRH) assistant coach Simon Helmot is hoping for their team to make a turnaround in the second half of the Indian Premier League 2025 (IPL 2025). The Pat Cummins-led side is reeling at ninth spot with two wins from seven matches and will next take on Mumbai Indians in their home den. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-srh-vs-mi-mumbai-indians-batter-tilak-varma-press-conference-2713234-2025-04-23",
      "headline": "IPL 2025: MI always believed that we could turn things around, says Tilak VarmaMumbai Indians batter Tilak Varma said the MI dressing room remained confident of making a comeback despite a difficult start to the IPL 2025 season. Mumbai, who had lost four of their first five matches, have now won three in a row and appear to be gaining momentum."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-prediction-today-match-srh-vs-mi-team-news-hyderabad-conditions-2713227-2025-04-23",
      "headline": "SRH vs MI: Hungry Hyderabad up for revenge against in-form MumbaiIPL 2025, SRH vs MI Prediction: Sunrisers Hyderabad (SRH) will take on Mumbai Indians (MI) in Match 41 of the Indian Premier League 2025 (IPL 2025) as they will be up for revenge against the five-time champions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-cheteshwar-pujara-on-kl-rahul-57-dc-vs-lsg-2713213-2025-04-23",
      "headline": "Different Rahul in IPL 2025: Pujara credits DC batter for impressive batting runVeteran India batter Cheteshwar Pujara has praised KL Rahul's impressive form in the ongoing Indian Premier League (IPL) 2025. Rahul has now amassed 323 runs in just seven innings at an impressive average of nearly 65."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rishabh-pant-weird-captaincy-anil-kumble-boucher-lsg-vs-dc-2713194-2025-04-23",
      "headline": "Too many changes, weird calls: How Rishabh Pant's LSG fell apart in revenge clashIPL 2025, LSG vs DC: Anil Kumble and Mark Boucher said the Lucknow Super Giants made too many changes, including tinkering with Rishabh Pant's batting position, leading to their eight-wicket defeat to the Delhi Capitals. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/why-mumbai-indians-will-be-unstoppable-after-beating-chennai-super-kings-2712225-2025-04-23",
      "headline": "IPL 2025 : Why Mumbai Indians will be unstoppable after thumping Chennai SuperThe Mumbai Indians (MI) have got their campaign back on track after registering three consecutive victories against Delhi Capitals, Sunrisers Hyderabad and Chennai Super Kings. Their victory run is an ominous sign for the opposition as they will become unstoppable with every win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/lost-momentum-after-great-start-dc-bowlers-made-a-good-comeback-lsg-assistant-coach-2713188-2025-04-23",
      "headline": "Lost momentum after great start, DC made a good comeback: LSG Assistant CoachLucknow Super Giants (LSG) Assistant coach Vijay Dahiya rued the loss of momentum after a good start against Delhi Capitals (DC). DC beat LSG by eight wickets in Match 40 of the Indian Premier League 2025 (IPL 2025)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/psl-2025-ramiz-raja-says-ipl-during-psl-post-match-presentation-2713185-2025-04-23",
      "headline": "Watch: Ramiz Raja does major goof-up, says 'IPL' during PSL post-match presentationFormer Pakistan cricketer turned commentator Ramiz Raja accidentally said IPL during the post-match presentation of the Pakistan Super League 2025 (PSL 2025) Match 12 between Multan Sultans and Lahore Qalandars."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-cheteshwar-pujara-on-kl-rahul-57-dc-vs-lsg-2713213-2025-04-23",
      "headline": "Different Rahul in IPL 2025: Pujara credits DC batter for impressive batting runVeteran India batter Cheteshwar Pujara has praised KL Rahul's impressive form in the ongoing Indian Premier League (IPL) 2025. Rahul has now amassed 323 runs in just seven innings at an impressive average of nearly 65."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rishabh-pant-weird-captaincy-anil-kumble-boucher-lsg-vs-dc-2713194-2025-04-23",
      "headline": "Too many changes, weird calls: How Rishabh Pant's LSG fell apart in revenge clashIPL 2025, LSG vs DC: Anil Kumble and Mark Boucher said the Lucknow Super Giants made too many changes, including tinkering with Rishabh Pant's batting position, leading to their eight-wicket defeat to the Delhi Capitals. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/why-mumbai-indians-will-be-unstoppable-after-beating-chennai-super-kings-2712225-2025-04-23",
      "headline": "IPL 2025 : Why Mumbai Indians will be unstoppable after thumping Chennai SuperThe Mumbai Indians (MI) have got their campaign back on track after registering three consecutive victories against Delhi Capitals, Sunrisers Hyderabad and Chennai Super Kings. Their victory run is an ominous sign for the opposition as they will become unstoppable with every win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/lost-momentum-after-great-start-dc-bowlers-made-a-good-comeback-lsg-assistant-coach-2713188-2025-04-23",
      "headline": "Lost momentum after great start, DC made a good comeback: LSG Assistant CoachLucknow Super Giants (LSG) Assistant coach Vijay Dahiya rued the loss of momentum after a good start against Delhi Capitals (DC). DC beat LSG by eight wickets in Match 40 of the Indian Premier League 2025 (IPL 2025)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/psl-2025-ramiz-raja-says-ipl-during-psl-post-match-presentation-2713185-2025-04-23",
      "headline": "Watch: Ramiz Raja does major goof-up, says 'IPL' during PSL post-match presentationFormer Pakistan cricketer turned commentator Ramiz Raja accidentally said IPL during the post-match presentation of the Pakistan Super League 2025 (PSL 2025) Match 12 between Multan Sultans and Lahore Qalandars."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}