{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/volkswagen-to-trim-35000-jobs-in-germany-by-2030-german-carmakers-plans-layoffs-2735697-2025-06-04",
      "headline": "Volkswagen to trim 35,000 jobs in Germany by 2030Volkswagen is planning to cut 35,000 jobs in Germany by the year 2030. To make the transition easier, Volkswagen is preparing severance packages for affected employees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-ends-261-points-higher-nifty-above-24600-eternal-gains-over-3-percent-2735618-2025-06-04",
      "headline": "Sensex ends 261 points higher; Nifty above 24,600; Eternal gains over 3%The S&P BSE Sensex added 261 points to end at 80,998.25, while the NSE Nifty50 was up by 77.70 points to close at 24,620.20. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/india-green-steel-production-energy-costs-green-hydrogen-incentives-2735598-2025-06-04",
      "headline": "Government seeks lower energy costs for backing green steel incentives: ReportIndia's finance ministry calls for lower energy prices to facilitate incentives for green steel production, amidst concerns over high green hydrogen costs and inflation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-ay-2025-26-itr-1-and-itr-4-enabled-on-e-filing-portal-who-can-file-online-check-eligibility-2735586-2025-06-04",
      "headline": "ITR-1, ITR-4 filing begins for AY 2025–26: Are you eligible?The Income Tax Department has enabled online filing of ITR-1 and ITR-4 forms for the assessment year 2025-26. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/rbi-mpc-rate-cut-sector-stock-market-news-trading-tips-expert-recommendation-buy-shares-2735591-2025-06-04",
      "headline": "RBI policy meet begins today: These stocks could rally if rate cut happensThe market is expecting a cut of 25 to 50 basis points (bps), mainly because inflation has been coming down and there are growing worries about slower economic growth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/china-rare-earth-export-controls-disrupt-global-supply-chains-2735550-2025-06-04",
      "headline": "Why China's rare earth export curbs are shaking global supply chainsChina's recent restrictions on rare earth exports are causing global industry disruptions, prompting urgent diplomatic and economic responses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/grse-stock-jumps-10-percent-mou-kongsberg-polar-research-vessel-2735536-2025-06-04",
      "headline": "GRSE shares jump 10% today: What's fuelling the rally?GRSE shares surged by up to 10% after sealing a partnership with Norway's Kongsberg for India's first Polar Research Vessel, highlighting a pivotal moment in deep-sea research and defence shipbuilding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/1-crore-salary-mumbai-cost-living-wealth-perception-2735511-2025-06-04",
      "headline": "Is Rs 1 crore salary still a big deal? Depends on where you live and who you askAn alumnus of IIM Ahmedabad has raised questions about the real value of a 1 crore annual salary in Mumbai. He pointed out that in areas like Borivali or Thane, a Rs 1 crore salary might still make one stand out, but in South Mumbai's boardrooms, where finance and tech executives frequently earn between Rs 1 crore and Rs 5 crore, this income is seen as average."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-steel-aluminium-tariffs-50-percent-double-impact-india-donald-trump-2735508-2025-06-04",
      "headline": "Trump doubles metal tariffs to 50% but skips UK. What it means for IndiaUS President Donald Trump plans to double tariffs on imported steel and aluminium, affecting global trade dynamics. The UK's exemption contrasts with challenges for India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/coforge-stock-split-shares-drop-80-percent-explained-2735506-2025-06-04",
      "headline": "Did Coforge shares drop 80% today? Here's all you need to knowInvestors might have initially mistaken this adjustment for a loss. Despite the apparent drop, the stock actually opened higher at Rs 1,720.05 on Wednesday, with a 0.60% increase. It was up 1.4% on the BSE at 12:18 pm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pm-kisan-20th-instalment-june-2025-e-kyc-eligibility-aadhaar-linkage-check-date-beneficiary-list-and-full-scheme-details-2735475-2025-06-04",
      "headline": "Are you eligible for PM-Kisan yojana? Check 20th instalment and requirementsThe upcoming 20th instalment is anticipated to be disbursed in the first or second week of June 2025. Under this scheme, farmers can receive the annual financial aid of Rs 6,000, distributed in three equal instalments of Rs 2,000 every four months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stop-sudden-tax-demands-raghuram-rajan-on-fixing-indias-business-environment-2735480-2025-06-04",
      "headline": "Stop sudden tax demands: Raghuram Rajan on fixing India's business environmentRaghuram Rajan says India must fix its business environment, starting with killing off surprise tax shocks that are scaring investors and strangling the country's shot at global supply chain glory."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/raghav-juyal-leg-injury-while-shooting-for-shah-rukh-khan-king-2735604-2025-06-04",
      "headline": "Raghav Juyal injures leg while shooting for Shah Rukh Khan's King: ReportRaghav Juyal got injured while shooting a tough stunt for Shah Rukh Khan's upcoming film 'King' but continued filming afterward. The movie, releasing in 2026, features a star-studded cast including SRK, Suhana Khan, Deepika Padukone, and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/shanaya-kapoor-vikrant-massey-aankhon-ki-gustaakhiyan-first-look-out-2735766-2025-06-04",
      "headline": "Shanaya Kapoor-Vikrant Massey's Aankhon Ki Gustaakhiyan first look outShanaya Kapoor is set to make her Bollywood debut opposite Vikrant Massey in the romantic drama 'Aankhon Ki Gustaakhiyan'. The film's first look has been unveiled and is already generating buzz."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vishnu-manchu-hindi-cinema-rooted-films-successes-south-cinema-kannappa-2735695-2025-06-04",
      "headline": "Actor Vishnu Manchu: Hindi films are rooted too, not just South cinemaVishnu Manchu emphasised that Hindi cinema has also produced deeply rooted films. He urged the media to recognise Hindi film successes alongside South Indian cinema's achievements."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/dipika-kakar-in-icu-14-hour-cancer-surgery-shoaib-ibrahim-shares-update-2735746-2025-06-04",
      "headline": "Actor Dipika Kakar in ICU after 14-hour cancer surgery, Shoaib shares updateActor Shoaib Ibrahim gave an update about his wife Dipika Kakar's cancer surgery. Kakar underwent a 14-hour-long surgery for her stage two liver cancer. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jr-ntr-joins-prashanth-neels-midnight-birthday-bash-writes-touching-note-2735621-2025-06-04",
      "headline": "Jr NTR joins Prashanth Neel's midnight birthday bash, writes touching noteJr NTR shared a special message for director Prashanth Neel on his birthday as fans speculate a behind-the-scenes glimpse from their upcoming film, reportedly titled 'Dragon'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pawan-kalyans-ustaad-bhagat-singh-shoot-to-resume-in-june-confirms-director-2735569-2025-06-04",
      "headline": "Pawan Kalyan's Ustaad Bhagat Singh shoot to resume in June, confirms directorPawan Kalyan is set to return to the sets of 'Ustaad Bhagat Singh' as the long-delayed cop drama gears up to resume shoot in June."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pawan-kalyans-hari-hara-veera-mallu-postponed-over-vfx-finance-issues-report-2735726-2025-06-04",
      "headline": "Pawan Kalyan's Hari Hara Veera Mallu postponed over VFX, finance issues: ReportAfter several postponements, reports now suggest that Pawan Kalyan's long-delayed period epic 'Hari Hara Veera Mallu' may also miss its June 11 release due to complex production issues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/hina-khan-rocky-jaiswal-married-wedding-pictures-2735710-2025-06-04",
      "headline": "We are our home and light: Hina Khan and Rocky Jaiswal are married. PicsActor Hina Khan got married to her longtime boyfriend, Rocky Jaiswal. Khan shared pictures from the wedding on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/indian-rock-band-girish-and-the-chronicles-wins-hearts-on-americas-got-talent-2735701-2025-06-04",
      "headline": "Indian rock band Girish and the Chronicles wins hearts on America's Got TalentIndian rock band 'Girish and the Chronicles' wowed the judges on 'America's Got Talent' with a powerful rock version of Adele's 'Set Fire to the Rain'. The performance received a standing ovation and four 'yes' from the judges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anushka-sharma-virat-kohli-reach-bengaluru-after-rcb-ipl-win-pbks-fans-throng-streets-to-celebrate-2735671-2025-06-04",
      "headline": "Anushka-Virat receive grand welcome as they arrive in Bengaluru after RCB's IPL winAnushka Sharma and Virat Kohli reached Bengaluru, and fans thronged to their bus to catch a glimpse of the team after RCB won the IPL. The actor shared videos from their visit along with a beautiful note."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/virat-kohli-cheers-for-her-bangalore-girl-anushka-sharma-in-loving-post-after-ipl-win-2735668-2025-06-04",
      "headline": "Together all the way through: Virat dedicates IPL win to his Bangalore girl AnushkaVirat Kohli shared a loving post for his wife, Anushka Sharma, after the RCB ended its dry spell and lifted its first IPL trophy in 18 years. The cricketer referred to her as his 'Bangalore girl'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kamal-haasan-thug-life-ban-in-karnataka-box-office-prediction-2735648-2025-06-04",
      "headline": "Thug Life banned in Karnataka - what does it mean for film's box officeKamal Haasan and director Mani Ratnam's 'Thug Life' is just hours away from its global release on June 5. With the film banned in Karnataka, will it impact the box office?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/exclusive-rana-daggubati-interview-on-netflix-series-rana-naidu-2-and-need-to-turn-lens-on-important-things-2735632-2025-06-04",
      "headline": "Exclusive: Rana Daggubati on Rana Naidu 2, and need to turn lens on important thingsActor Rana Daggubati brings the new season of his popular Netflix series 'Rana Naidu'. In an exclusive interview with IndiaToday.in, the actor, along with Kriti Kharbanda, Abhishek Banerjee and director Karan Anshuman, spoke about the criticism that they received for featuring explicit scenes in the first season of the show, and what has changed this time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/prakash-jha-confirms-raajneeti-2-i-am-working-on-it-casting-underway-2735636-2025-06-04",
      "headline": "Prakash Jha confirms Raajneeti 2: I am working on it, casting underwayDirector Prakash Jha confirmed that he is currently working on 'Raajneeti 2'. He added that casting is underway. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/metroin-dino-trailer-anurag-basu-film-explores-love-life-longing-in-busy-city-2735589-2025-06-04",
      "headline": "Metro...In Dino trailer: Anurag Basu film explores love, life, longing in busy cityAnurag Basu returns with 'Metro…In Dino', a film that explores modern love stories set in fast-paced city life. The trailer promises emotional depth, relatable characters, and soulful music by Pritam.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kgf-director-prashanth-neel-hits-friend-rcb-ipl-win-2735523-2025-06-04",
      "headline": "KGF director playfully hits friend in excitement after RCB's IPL win. Watch'KGF' director Prashanth Neel was joyful after Royal Challengers Bengaluru (RCB) lifted the IPL trophy for the first time. He playfully hit his friend in extreme excitement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/adolescence-becomes-netflix-stranger-things-season-4-2735444-2025-06-04",
      "headline": "Adolescence becomes Netflix's 2nd most-watched English show surpassing Stranger Things 4'Adolescence' has become Netflix's second most-watched English-language series, surpassing 'Stranger Things Season 4' with 141.2 million views in 80 days. Besides, the show 'Wednesday' and non-English hits like 'Squid Game' rank higher in Netflix's all-time viewership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/nimrit-kaur-ahluwalia-missed-diljit-dosanjh-film-choti-sarrdaarni-shoot-2735434-2025-06-04",
      "headline": "Actor Nimrit Ahluwalia skipped Diljit Dosanjh's film due to Choti Sarrdaarni shootActor Nimrit Kaur Ahluwalia revealed she missed a film with Diljit Dosanjh due to her 'Choti Sarrdaarni' schedule. She later made her Punjabi debut with 'Shaunki Sardar.'.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/janhvi-kapoor-khushi-kapoor-orry-at-cannes-2025-2735498-2025-06-04",
      "headline": "Janhvi Kapoor's 'champi' session with Khushi was perfect prep before Cannes. WatchBefore actor Janhvi Kapoor's Cannes debut, she enjoyed a relaxing 'champi' from her sister Khushi. Orry posted the video along with other behind-the-scenes glimpses from Cannes."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/many-stampedes-siddaramaiah-kumbh-reference-after-bengaluru-tragedy-2735801-2025-06-04",
      "headline": "Many stampedes...: Siddaramaiah's Kumbh reference after Bengaluru tragedyKarnataka Chief Minister Siddaramaiah addressed the media following the deadly stadium stampede in Bengaluru that killed at least 11 and left several injured."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bengaluru-in-stampede-rcbs-ipl-win-celebrations-chinnaswamy-stadium-dead-injured-2735686-2025-06-04",
      "headline": "11 dead, 47 injured in stampede outside Bengaluru stadium during RCB eventAt least 11 people died in a stampede during the Karnataka government's felicitation of Royal Challengers Bengaluru for their IPL 2025 win. The crowd surge which led to the stampede occurred outside the Chinnaswamy Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-first-reaction-bengaluru-stadium-stampede-deaths-rcb-celebration-2735876-2025-06-04",
      "headline": "Absolutely gutted: Virat Kohli reacts to Bengaluru stampede during RCB eventRCB star Virat Kohli said he was lost for words as he mourned the loss of lives and injuries in a stampede outside the M Chinnaswamy Stadium in Bengaluru during the team's IPL celebration on Wednesday, June 4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/rcb-win-celebrations-inside-chinnaswamy-stadium-stampede-bengaluru-congress-bjp-spar-2735717-2025-06-04",
      "headline": "Stampede claimed lives outside Bengaluru stadium, RCB celebrations continued insideThe RCB team was being felicitated inside the Chinnaswamy Stadium after their win over Punjab Kings in the final on Tuesday. But while the celebration went on inside, chaos unfolded outside the venue."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/fact-check/story/anonymous-accounts-x-death-threats-justice-partha-sarathi-chatterjee-sharmishta-panoli-bail-2735782-2025-06-04",
      "headline": "Hiding behind fake profiles, people threaten to kill judge who denied Sharmishta Panoli bailX accounts with fake, random profile pictures called for 'unknown gunmen' to go after Calcutta High Court's Justice Partha Sarathi Chatterjee. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-bengaluru-stampede-rcb-celebration-bcci-devajit-saikia-2735752-2025-06-04",
      "headline": "Lapses at RCB event, BCCI had no role: Cricket body official on stampedeIndian cricket board secretary Devajit Saikia said the organisers of the IPL victory celebrations in Bengaluru needed better planning. 11 died due to a stampede when thousands gathered to watch the team at the M Chinnaswamy Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-rcb-bengaluru-stampede-account-reporter-chinnaswamy-stadium-2735878-2025-06-04",
      "headline": "Celebration turns into chaos: How Bengaluru stampede unfolded during RCB's IPL bashA stampede outside the M Chinnaswamy Stadium in Bengaluru left 11 dead and over 40 injured on Wednesday. RCB were rejoicing their IPL success with fans in Bengaluru when the celebration turned into chaos. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/putin-said-russia-will-strongly-respond-to-ukrainian-attack-on-airfields-trump-2735877-2025-06-04",
      "headline": "Putin said Russia will strongly respond to Ukrainian attack on airfields: TrumpUS President Donald Trump said that the conversation with Russian President Vladimir Putin \"was a good conversation, but not a conversation that will lead to immediate peace.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/hina-khan-rocky-jaiswal-married-wedding-pictures-2735710-2025-06-04",
      "headline": "We are our home and light: Hina Khan and Rocky Jaiswal are married. PicsActor Hina Khan got married to her longtime boyfriend, Rocky Jaiswal. Khan shared pictures from the wedding on social media. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-bengaluru-stampede-deaths-rcb-statement-karnataka-body-compensation-2735841-2025-06-04",
      "headline": "Promptly amended program: RCB reacts to Bengaluru stampede, condoles deathsRoyal Challengers Bengaluru and Karnataka State Cricket Association mourned the death of 11 people in a stampede outside the M Chinnaswamy Stadium during the team's IPL victory celebrations on Wednesday, June 4. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/video/video-moment-stampede-broke-out-during-rcbs-victory-celebrations-in-bengaluru-2735734-2025-06-04",
      "headline": "Video: Moment stampede broke out during RCB's victory celebrations in BengaluruIndia Today has accessed exclusive video of the moment a stampede broke out outside Bengaluru's Chinnaswamy Stadium when a drain slab collapsed, trapping over 50 people during RCB's victory celebrations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/indian-students-delete-posts-accounts-social-media-study-visa-vetting-american-colleges-admission-deport-2735103-2025-06-04",
      "headline": "Indian students are rushing to delete posts for US visa, but that's risky tooAfter the Trump administration's decision to vet social media posts thoroughly for US visas, Indian students are rushing to delete posts and even accounts to fulfil their dream of studying in the US. However, experts suggest this could raise red flags. And it isn't just about posts, even likes and shares could lead to visa denials by the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/features/story/silicon-valley-wealth-creators-are-immigrants-donald-trump-policies-may-see-them-lose-interest-in-us-2735659-2025-06-04",
      "headline": "Trump policies may drive immigrant wealth creators away from Silicon ValleySergey Brin, Sundar Pichai, Jensen Huang, Elon Musk, Satya Nadella, Dara Khosrowshahi, and Eric Yuan – what do these titans of Silicon Valley have in common?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-ahmadiyya-muslims-ahmedi-fine-eid-al-adha-punjab-sindh-religious-persecution-2735698-2025-06-04",
      "headline": "Celebrate Eid, pay Rs 5 lakh PKR as fine: Pakistan to Ahmadiyya MuslimsWith Eid al-Adha approaching, Pakistan's Punjab and Sindh provinces have tightened their stranglehold on the Ahmadiyya Muslim community, imposing a penalty of 5 lakh Pakistani rupees if they take part in the festival or perform qurbani, even in private. This adds to Pakistan's repressive measures over the decades against Ahmadiyya Muslims, who played a key role in the Islamic Republic's formation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/canada-news/story/canada-unveils-strong-border-act-amid-surge-in-students-asylum-claims-indian-immigration-citizenship-2735774-2025-06-04",
      "headline": "Canada's Strong Border Act will hit Indian asylum-seekersCanada introduced the Strong Borders Act to curb rising asylum claims and strengthen border security against fentanyl trafficking. Last year, over 20,000 asylum claims were filed by international students and Indians were among the cohort with the highest number of such claims."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/railways-passenger-confirmed-ticket-refuses-to-give-up-seat-for-family-with-rac-viral-reddit-post-sparks-debate-2735670-2025-06-04",
      "headline": "Man with confirmed train ticket refuses to give up seat for family with RACIn a now-viral post on Reddit, a man travelling via train claimed he was harassed by fellow passengers travelling on RAC. The post has triggered a debate online. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/the-real-casanova-the-spy-alchemist-and-librarian-behind-the-lovers-legend-2735769-2025-06-04",
      "headline": "The real Casanova: The spy, alchemist and librarian behind the lover's legendGiacomo Casanova, often remembered as history's greatest lover, led an adventurous life filled with espionage, scientific pursuits, intellectual endeavors, and some truly wild travel stories. He left a legacy far beyond his romantic escapades. On his death anniversary, we delve into his multifaceted life as a spy, alchemist, and intellectual."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-media-entrepreneur-salman-farooq-thrashes-hindu-man-sudhair-dhun-raj-sister-kalpana-begs-for-mercy-viral-video-2735660-2025-06-04",
      "headline": "Pak media tycoon thrashes Hindu man, lands in jail after video goes viralA media tycoon in Pakistan was arrested after a video showed him and his armed guards assaulting a Hindu man while his sister pleaded for mercy. The road-rage incident sparked public outrage after the video of the attack went viral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pain-of-tragedy-erased-joy-of-rcb-victory-siddaramaiahs-first-reaction-to-bengaluru-stampede-2735779-2025-06-04",
      "headline": "Bengaluru RCB celebration stampede: Siddaramaiah announces aid, orders enquiryKarnataka Chief Minister Siddaramaiah calls the stampede at RCB's victory celebration in Bengaluru an unexpected tragedy. He confirmed that a DC-level probe has been ordered. Siddaramaiah also announced a compensation of Rs 10 lakh for the families of the victims."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-bengaluru-stampede-deaths-prays-for-those-injured-stadium-rcb-celebration-2735772-2025-06-04",
      "headline": "Absolutely heartrending: PM Modi condoles Bengaluru stampede deathsPrime Minister Narendra Modi has expressed condolences over the deaths of people in the Bengaluru stampede during RCB victory celebration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/colour-theory-philosophy-descartes-hume-science-perception-newton-galileo-stephen-palmer-heres-more-2733356-2025-06-04",
      "headline": "Why we see a red apple red. Is colour in our eyes or in the mind's eye?Colour isn't just a physical property; it's how our brains interpret light reflected from objects. Different creatures perceive colours differently, so colour might be more about perception than reality. Philosophers debate whether colour is real, mental, or a mix of both. Simply put: colour is partly in the world and partly in the mind."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-russia-partnership-military-weapons-sales-united-states-objections-2735650-2025-06-04",
      "headline": "Despite US objections, 5 reasons why India-Russia partnership will endureThe Trump administration said India's military purchases from Russia had 'rubbed the United States the wrong way'. However, there are several reasons why India buys Russian weapons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/population-count-caste-census-likely-to-begin-from-march-1-2027-sources-2735672-2025-06-04",
      "headline": "Population count, caste census to begin from March 1, 2027The census 2027 exercise will be conducted in two phases, and the reference date for the count will be March 1, 2027, the government notification said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-verdict-delhi-waqf-board-gurdwara-property-claim-shahdara-2735685-2025-06-04",
      "headline": "There is a gurdwara, let it be: Supreme Court rejects Delhi Waqf board's claimThe order comes at a time when another bench of the top court has reserved its decision on petitions challenging the constitutional validity of the Waqf (Amendment) Act, 2025."
    }
  ],
  "sports": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-victory-parade-stampede-sachin-tendulkar-yuvraj-singh-reaction-2735879-2025-06-04",
      "headline": "RCB victory parade stampede: Sachin Tendulkar, Yuvraj condole loss of livesRCB victory parade stampede: India's legendary batter Sachin Tendulkar and World Cup-winning all-rounder Yuvraj Singh expressed their condolences over the \"tragic\" stampede near Bengaluru's M Chinnaswamy Stadium on Wednesday, which claimed 11 lives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-rcb-bengaluru-stampede-account-reporter-chinnaswamy-stadium-2735878-2025-06-04",
      "headline": "Celebration turns into chaos: How Bengaluru stampede unfolded during RCB's IPL bashA stampede outside the M Chinnaswamy Stadium in Bengaluru left 11 dead and over 40 injured on Wednesday. RCB were rejoicing their IPL success with fans in Bengaluru when the celebration turned into chaos. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-french-open-semi-finals-equal-rafael-nadal-record-2735874-2025-06-04",
      "headline": "Jannik Sinner emulates Rafael Nadal, storms into 2nd successive semi-finalWorld No. 1 Jannik Sinner continued his relentless pursuit of a maiden French Open title with a typically efficient 6-1, 7-5, 6-0 win over Kazakh showman Alexander Bublik on Wednesday to reach the semi-finals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-first-reaction-bengaluru-stadium-stampede-deaths-rcb-celebration-2735876-2025-06-04",
      "headline": "Absolutely gutted: Virat Kohli reacts to Bengaluru stampede during RCB eventRCB star Virat Kohli said he was lost for words as he mourned the loss of lives and injuries in a stampede outside the M Chinnaswamy Stadium in Bengaluru during the team's IPL celebration on Wednesday, June 4. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-chairman-arun-dhumal-on-rcb-celebration-bengaluru-stampede-2735862-2025-06-04",
      "headline": "BCCI had no knowledge of RCB celebrations: IPL chairman on Bengaluru stampedeIPL Chairman Arun Dhumal called the stampede tragic but clarified that the Board of Control for Cricket in India (BCCI) had no knowledge of Royal Challengers Bengaluru's (RCB) victory celebration in Bengaluru."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/india-lose-0-2-to-thailand-in-football-friendly-afc-asian-cup-qualifier-2735844-2025-06-04",
      "headline": "India lose 0-2 to Thailand in football friendly before AFC Asian Cup qualifierIndia lost 0-2 to Thailand in an international football friendly match at Thammasat Stadium, with goals from Ben Davis and Poramet Arjvilai securing a comfortable victory for the under-strength hosts.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-bengaluru-stampede-deaths-rcb-statement-karnataka-body-compensation-2735841-2025-06-04",
      "headline": "Promptly amended program: RCB reacts to Bengaluru stampede, condoles deathsRoyal Challengers Bengaluru and Karnataka State Cricket Association mourned the death of 11 people in a stampede outside the M Chinnaswamy Stadium during the team's IPL victory celebrations on Wednesday, June 4. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/bengaluru-stampede-tragic-rcb-celebration-ipl-chairman-arun-dhumal-reaction-2735815-2025-06-04",
      "headline": "Bengaluru stampede tragic, RCB celebration not a BCCI event: IPL chairmanIPL chairman Arun Dhumal clarified that Royal Challengers Bengaluru's (RCB) victory celebration in Bengaluru was not organised by the Board of Control for Cricket in India (BCCI)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/paris-saint-germain-d-gukesh-vs-magnus-carlsen-reaction-champions-league-emotions-2735812-2025-06-04",
      "headline": "PSG describe UCL win emotions with viral Gukesh-Carlsen reaction memeParis Saint-Germain celebrated their maiden Champions League title by drawing a fun parallel with Indian chess World Champion D Gukesh's viral win over Magnus Carlsen, sharing his emotional reaction to reflect their own long-awaited triumph."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-lois-boisson-beats-mirra-andreeva-coco-gauff-defeat-keys-semi-final-2735771-2025-06-04",
      "headline": "Wildcard Lois Boisson stuns Andreeva, joins Coco Gauff in semi-finalWorld No. 361 Loïs Boisson stunned Mirra Andreeva to book her place in the semi-finals, while Coco Gauff huffed and puffed her way into the last four with a hard-fought 6-7(6), 6-4, 6-1 win over fellow American Madison Keys.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-bengaluru-stampede-rcb-celebration-bcci-devajit-saikia-2735752-2025-06-04",
      "headline": "Lapses at RCB event, BCCI had no role: Cricket body official on stampedeIndian cricket board secretary Devajit Saikia said the organisers of the IPL victory celebrations in Bengaluru needed better planning. 11 died due to a stampede when thousands gathered to watch the team at the M Chinnaswamy Stadium."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-bengaluru-stampede-deaths-rcb-statement-karnataka-body-compensation-2735841-2025-06-04",
      "headline": "Promptly amended program: RCB reacts to Bengaluru stampede, condoles deathsRoyal Challengers Bengaluru and Karnataka State Cricket Association mourned the death of 11 people in a stampede outside the M Chinnaswamy Stadium during the team's IPL victory celebrations on Wednesday, June 4. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/bengaluru-stampede-tragic-rcb-celebration-ipl-chairman-arun-dhumal-reaction-2735815-2025-06-04",
      "headline": "Bengaluru stampede tragic, RCB celebration not a BCCI event: IPL chairmanIPL chairman Arun Dhumal clarified that Royal Challengers Bengaluru's (RCB) victory celebration in Bengaluru was not organised by the Board of Control for Cricket in India (BCCI)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/paris-saint-germain-d-gukesh-vs-magnus-carlsen-reaction-champions-league-emotions-2735812-2025-06-04",
      "headline": "PSG describe UCL win emotions with viral Gukesh-Carlsen reaction memeParis Saint-Germain celebrated their maiden Champions League title by drawing a fun parallel with Indian chess World Champion D Gukesh's viral win over Magnus Carlsen, sharing his emotional reaction to reflect their own long-awaited triumph."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-lois-boisson-beats-mirra-andreeva-coco-gauff-defeat-keys-semi-final-2735771-2025-06-04",
      "headline": "Wildcard Lois Boisson stuns Andreeva, joins Coco Gauff in semi-finalWorld No. 361 Loïs Boisson stunned Mirra Andreeva to book her place in the semi-finals, while Coco Gauff huffed and puffed her way into the last four with a hard-fought 6-7(6), 6-4, 6-1 win over fellow American Madison Keys.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-bengaluru-stampede-rcb-celebration-bcci-devajit-saikia-2735752-2025-06-04",
      "headline": "Lapses at RCB event, BCCI had no role: Cricket body official on stampedeIndian cricket board secretary Devajit Saikia said the organisers of the IPL victory celebrations in Bengaluru needed better planning. 11 died due to a stampede when thousands gathered to watch the team at the M Chinnaswamy Stadium."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}