{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-expectation-next-week-sensex-nifty-trading-setup-monday-rbi-rate-cut-2737598-2025-06-08",
      "headline": "RBI rate cut lights up Dalal Street, but will the rally continue?The RBI reduced the repo rate to 5.5% and also changed its policy stance from 'accommodative' to 'neutral', suggesting that it will now wait and watch before making further moves."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-poverty-rate-sees-sharp-decline-falls-to-53-in-2022-23-2737349-2025-06-07",
      "headline": "India's poverty rate sees sharp decline, falls to 5.3% in 2022-23India's updated consumption data helped offset the World Bank's revised International Poverty Line, reducing the global increase in extreme poverty by 125 million people."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/elon-musks-starlink-gets-licence-from-telecom-ministry-2736847-2025-06-06",
      "headline": "Elon Musk's Starlink gets licence from telecom ministryElon Musk's Starlink has received a crucial licence from India's telecom ministry, paving the way for its satellite internet services in the country. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/musks-starlink-gets-licence-for-satcom-services-in-india-news-agency-pti-quoting-sources-2736832-2025-06-06",
      "headline": "Elon Musk's Starlink gets licence to launch in India: ReportStarlink had applied for the licence back in 2022, but the process was delayed due to various concerns, including national security."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-jumps-over-700-points-nifty-goes-past-25000-rbi-mpc-rate-cut-bajaj-finance-gains-5-percent-2736785-2025-06-06",
      "headline": "Sensex jumps over 700 points, Nifty goes past 25,000; Bajaj Finance gains 5%The S&P BSE Sensex jumped 746.95 points to end at 82,188.99, while the NSE Nifty50 gained 252.15 points to close at 25,003.05. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/us-donald-trump-double-tariff-steel-aluminium-india-trade-export-impact-expert-view-2736782-2025-06-06",
      "headline": "US doubles steel, aluminium tariff: Is it a big worry for India?The tariff hike does not apply to all countries. The United Kingdom has been excluded because of a trade agreement already in place with the US. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rbi-rate-cut-may-hurt-fds-interest-rate-heres-what-investors-should-do-now-mpc-meeting-repo-rate-reduction-crr-phased-cut-2736729-2025-06-06",
      "headline": "RBI rate cut may hurt FDs. Here's what investors should do nowBanks have already begun adjusting their FD rates downward following the RBI's earlier moves since February 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-spacex-elon-musk-fallout-with-donald-trump-beyond-politics-big-losses-2736697-2025-06-06",
      "headline": "Elon Musk thought he could play politics. Now Tesla's paying the priceElon Musk's fallout with Donald Trump cost Tesla $150 billion in a day. His gamble with power seems to be backfiring fast, and the fallout could reach far beyond the stock market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-repo-rate-news-lending-cut-by-50-basis-points-front-loading-sanjay-malhotra-2736688-2025-06-06",
      "headline": "Explained: What does the RBI mean by front-loading the rate cutThe RBI's latest rate cut is being called a \"front-loaded\" rate cut, meaning the central bank is cutting interest rates earlier and by a bigger margin than usual."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbis-big-crr-boost-what-it-means-for-banks-and-you-2736664-2025-06-06",
      "headline": "RBI's big CRR boost: What it means for banks and youIf you're eyeing a home loan, car loan, or personal loan, this development could work in your favour. With banks gaining access to more funds, interest rates on loans are likely to drop, which means your monthly EMIs could reduce."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-cuts-repo-rate-again-by-50-bps-to-550-percent-5-key-takeaways-you-must-know-home-loans-may-get-cheaper-2736602-2025-06-06",
      "headline": "RBI cuts repo rate again: 5 key takeaways you must knowSince February 2025, the RBI has slashed the repo rate by a full 100 basis points. With this sharp reduction, it believes there's now less room left to cut rates further to support growth. So, the RBI has changed its policy stance from \"accommodative\" to \"neutral\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/rbi-slashes-repo-rate-by-50-basis-points-to-55-third-consecutive-cut-2736588-2025-06-06",
      "headline": "RBI slashes repo rate by 50 basis points to 5.5%, third consecutive cutThe Reserve Bank of India (RBI) has reduced the repo rate by 50 basis points to 5.5%, marking the third consecutive rate cut. This decision comes amid a sharp drop in retail inflation to 3.16% in April and strong economic growth of 7.4% in the January-March quarter. The move is expected to make loans cheaper, benefiting borrowers, especially home buyers. The RBI has also changed its stance from accommodative to neutral, indicating a data-driven approach moving forward."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sonakshi-sinha-down-with-fever-husband-zaheer-iqbal-lifts-her-mood-2737688-2025-06-08",
      "headline": "Sonakshi Sinha down with fever, husband Zaheer Iqbal lifts her mood. WatchSonakshi Sinha, currently down with fever, was seen cuddling with husband Zaheer Iqbal in a playful video where he tried to cheer her up. Fans loved their light-hearted interaction, calling it adorable and heartwarming.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-ott-3-winner-sana-makbul-hospitalised-friend-shares-update-2737668-2025-06-08",
      "headline": "Bigg Boss OTT 3 winner Sana Makbul hospitalised, friend shares updateSana Makbul, winner of 'Bigg Boss OTT 3', was hospitalised shortly after celebrating Eid with her family. The actor received an emotional support message from her friend, Dr Aashna Kanchwala, praying for her speedy recovery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kapil-sharma-sitaare-zameen-par-cast-aamir-khan-musical-evening-2737655-2025-06-08",
      "headline": "Kapil Sharma clicks pics, shares warm moment with Sitaare Zameen Par cast. WatchKapil Sharma shared an inside video from Aamir Khan's musical evening. In the clip, he was seen warmly interacting with the cast of 'Sitaare Zameen Par', including debutant actors with special needs.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/actor-jared-leto-accused-of-sexual-misconduct-by-nine-women-including-minors-2737645-2025-06-08",
      "headline": "Actor Jared Leto accused of sexual misconduct by nine women, including minorsOscar-winning actor Jared Leto has been accused by nine women of sexual misconduct, including inappropriate behaviour with underage girls. The actor and his representatives have denied all allegations, calling them false.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/boman-irani-visits-french-open-as-birthday-surprise-2737596-2025-06-08",
      "headline": "Boman Irani attends French Open as birthday surprise, calls it dream come true. PicsBoman Irani fulfilled his childhood dream by attending the French Open in Paris, a surprise birthday gift from his family. The actor shared his experiences through photos and videos on Instagram.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/badshah-responds-to-dua-lipa-comment-criticism-2737613-2025-06-08",
      "headline": "Badshah defends his Dua Lipa remark after severe backlash: Not my mindset, yoursRapper Badshah stirred controversy with a bold comment about Dua Lipa which drew heavy criticism online. He defended his remark as a form of admiration, claiming the backlash reflected others' thinking, not his."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-flew-to-new-york-called-my-husband-during-treatment-sonali-bendre-2737614-2025-06-08",
      "headline": "Salman Khan flew to New York, called my husband during treatment: Sonali BendreSonali Bendre recently opened up about Salman Khan's unwavering support during her cancer battle. In a recent interview, she recalled how the superstar flew to New York multiple times and regularly checked in on her throughout her treatment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/dipika-kakar-cancer-shoaib-ibrahim-eid-in-hospital-2737584-2025-06-08",
      "headline": "Dipika Kakar celebrates Eid in hospital with Shoaib Ibrahim amid Cancer recoveryTV actor Dipika Kakar celebrated Eid al-Adha with husband Shoaib Ibrahim in the hospital. The latter shared a photo on his Instagram Story featuring the couple holding Eidi envelopes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/akshay-kumar-goes-incognito-to-get-housefull-5-reviews-fans-react-2737575-2025-06-08",
      "headline": "Akshay Kumar goes incognito to get Housefull 5 reviews, fans reactIn a hilarious turn of events, a masked Akshay Kumar was seen outside a theatre, seeking honest reactions from the audience about his latest film, 'Housefull 5'. The comedy entertainer hit theatres on June 6.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-gauri-spratt-at-delhi-airport-sitaare-zameen-par-2737570-2025-06-08",
      "headline": "Aamir Khan, girlfriend Gauri Spratt leave Delhi airport hand-in-hand. WatchAamir Khan was clicked with girlfriend Gauri Spratt at the Delhi airport on Saturday. The couple were seen holding hands while exiting the airport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diljit-dosanjh-sardaar-ji-3-photos-teaser-coming-soon-2737550-2025-06-08",
      "headline": "Diljit Dosanjh shares BTS pics from Sardaar Ji 3 sets, says teaser coming soonDiljit Dosanjh shared behind-the-scenes photos from the sets of 'Sardaar Ji 3', shot at scenic locations abroad. The horror-comedy film, co-starring Neeru Bajwa, is set to release worldwide on June 27, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anurag-kashyap-claps-back-at-netflix-ceo-ted-sarandos-for-his-sacred-games-remark-2737547-2025-06-08",
      "headline": "Anurag Kashyap claps back at Netflix CEO Ted Sarandos for his Sacred Games remarkNetflix CEO Ted Sarandos reflected on 'Sacred Games' as Netflix India's first original, suggesting a more populist start could have been better, sparking backlash from co-creator Anurag Kashyap. The filmmaker shared his reaction on Instagram. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pawan-kalyan-wraps-og-shoot-makers-announce-with-new-poster-2737523-2025-06-08",
      "headline": "Pawan Kalyan wraps OG shoot, makers announce with new posterPawan Kalyan has completed shooting for his much-awaited action film 'OG', directed by Sujeeth. The makers have announced that the film will release in theatres on September 25, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kamal-haasan-urges-voluntary-language-learning-opposes-hindi-imposition-in-south-2737516-2025-06-08",
      "headline": "Kamal Haasan urges voluntary language learning, opposes Hindi imposition in SouthKamal Haasan has spoken out against the imposition of Hindi in southern India. He stressed that education should be free from language imposition and focus on the most efficient learning paths. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thug-life-box-office-day-3-kamal-haasan-mani-ratnam-film-crawls-past-rs-30-crore-2737499-2025-06-08",
      "headline": "Thug Life box office Day 3: Kamal Haasan, Silambarasan's film crawls past Rs 30 croreKamal Haasan and Mani Ratnam's much-anticipated collaboration 'Thug Life' is struggling at the box office. Following a sharp drop in collections on Day 2, the film barely managed to cross the Rs 30-crore mark by the end of Day 3.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/housefull-5-box-office-day-2-akshay-kumar-film-off-to-a-flyer-crosses-rs-50-crore-2737491-2025-06-08",
      "headline": "Housefull 5 box office Day 2: Akshay's film off to a flyer, crosses Rs 50 crore'Housefull 5', featuring a star-studded ensemble, has outpaced its previous installments and crossed the Rs 50-crore mark at the domestic box office within just two days of its release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/hamraaz-sunil-dutt-br-chopra-raaj-kumar-mumtaz-a-prophecy-of-vimis-real-life-tragedy-2737385-2025-06-08",
      "headline": "Hamraaz: A prophecy of Vimi's real-life tragedy'Hamraaz' is a classic Bollywood film that blends romance, mystery, and tragedy against the backdrop of 1960s India. The movie also eerily reflects the real-life heartbreak of its lead actor Vimi, whose brief stardom was shadowed by personal turmoil and loss."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-sweet-reaction-to-daughter-suhana-adidas-ad-wins-hearts-2737469-2025-06-08",
      "headline": "Shah Rukh Khan's sweet reaction to daughter Suhana's new Instagram post wins heartsShah Rukh Khan has publicly appreciated his daughter Suhana Khan's recent pictures for Adidas India on Instagram. Suhana, who made her acting debut in 'The Archies', is set to star with her father in the upcoming film 'King'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kapil-sharma-shankar-mahadevan-light-up-aamir-khans-sitaare-zameen-par-bash-2737370-2025-06-07",
      "headline": "Kapil Sharma, Shankar Mahadevan light up Aamir Khan's Sitaare Zameen Par bashKapil Sharma shared a joyous glimpse of a private musical evening at Aamir Khan's residence, celebrating the upcoming release of 'Sitaare Zameen Par' with friends and celebrities. The event featured soulful performances and star-studded guests, including Sachin Tendulkar."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/gaza-bound-aid-boat-carrying-greta-thunberg-and-other-activists-freedom-flotilla-diverted-to-israel-2737756-2025-06-09",
      "headline": "Israeli forces intercept Gaza-bound aid boat carrying Greta Thunberg, diverts itIsraeli forces intercepted a British-flagged aid boat headed to Gaza, detaining 12 activists — including Greta Thunberg and Rima Hassan — who were attempting to breach the longstanding naval blockade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-defends-roland-garros-title-beats-jannik-sinner-epic-final-2737733-2025-06-09",
      "headline": "Alcaraz remains King of Clay, outlasts Sinner in longest French Open finalCarlos Alcaraz edged past Jannik Sinner in an epic five-set French Open final, cementing his status as the new King of Clay. The marathon battle, which lasted 5 hours and 29 minutes, signalled the dawn of a thrilling rivalry set to define the post-Big Three era."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/they-spit-we-hit-trump-warns-protesters-as-la-demonstrations-turn-violent-glbs-2737753-2025-06-09",
      "headline": "They spit, we hit: Trump warns as Los Angeles immigration protest turns violentUS President Trump warned of strong action after protests in Los Angeles turned tense. Tear gas and pepper balls were used without warning as crowds opposed federal immigration raids."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/mutual-respect-will-guide-us-yunus-writes-to-modi-amid-strained-ties-glbs-2737741-2025-06-09",
      "headline": "Mutual respect will guide us: Yunus writes to PM Modi amid strained tiesIndia and Bangladesh reaffirm their commitment to work together for their people's welfare, says Bangladesh's Chief Adviser Muhammad Yunus in a letter to PM Narendra Modi. Despite ongoing political tensions, the leaders expressed hope that shared values will guide stronger ties between the two countries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/actor-jared-leto-accused-of-sexual-misconduct-by-nine-women-including-minors-2737645-2025-06-08",
      "headline": "Actor Jared Leto accused of sexual misconduct by nine women, including minorsOscar-winning actor Jared Leto has been accused by nine women of sexual misconduct, including inappropriate behaviour with underage girls. The actor and his representatives have denied all allegations, calling them false.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/chandrababu-naidu-operation-sindoor-modi-government-ceasefire-understanding-pak-conflict-2737659-2025-06-08",
      "headline": "Op Sindoor feather in cap of Modi government? 100%, says Chandrababu NaiduSpeaking to India Today TV, Andhra Pradesh Chief Minister N Chandrababu Naidu spoke about a host of issues, including Operation Sindoor, One Nation One Election, Waqf Act, calling for demonetising Rs 500 notes to tackle corruption and so on."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/federal-bureau-of-investigation-director-kash-patel-online-rebuke-jail-warning-anti-ice-protesters-2737694-2025-06-08",
      "headline": "FBI chief's 'hit a cop, you're going to jail' warning sparks online outrageSocial media users took a quick note of Kash Patel's warning to the protesters and hit back at the FBI chief, calling him out for the federal agency's different stance taken on the January 6 rioters."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pakistan-claims-destroyed-su-30-fighter-punjab-adampur-air-base-debunked-by-expert-2737604-2025-06-08",
      "headline": "Pak claims it destroyed India's fighter jet at Adampur air base, gets fact-checkedA geo-intelligence expert fact-checked Pakistan after it claimed that it struck a Su-30 at India's Adampur air base. He shared a satellite image showing a MiG-29 undergoing maintenance in March, two months before the conflict."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/internet-mocks-donald-trump-after-stumble-on-air-force-one-steps-biden-20-here-we-go-glbs-2737745-2025-06-09",
      "headline": "Biden 2.0 here we go: Internet mocks Trump after stumble on Air Force One stepsPresident Trump stumbled while climbing Air Force One steps, sparking jokes online comparing him to Joe Biden. Both Trump and Marco Rubio had trouble boarding the plane. The video went viral, and many social media users questioned Trump's health and fitness for office.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-swelters-as-maximum-temperature-crosses-40-degrees-celsius-for-first-time-in-june-2737684-2025-06-08",
      "headline": "Temperature in Delhi crosses 40°C for first time in June this seasonThe highest temperature of 44.1 degrees Celsius on Sunday was registered in south Delhi's Aya Nagar, while it stood at 42.3 degrees Celsius at Lodi Road, and 42.9 degrees Celsius in the central ridge area."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/west-bengal-woman-beaten-up-held-hostage-howrah-refusing-shoot-for-porn-2737690-2025-06-08",
      "headline": "Bengal woman confined for 6 months, beaten with iron rods for refusing porn workA woman from West Bengal is battling for her life after she was held hostage in a flat for months, where she was assaulted and tortured by a man and his mother for refusing to shoot pornographic videos and work as a bar dancer."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/nationsl-league-final-pportugal-vs-spain-result-cristiano-ronaldo-crying-video-2737746-2025-06-09",
      "headline": "Ronaldo breaks down in tears as Portugal beat Spain to clinch Nations LeagueLegendary Cristiano Ronaldo could not hold back his tears as Portugal beat Spain to clinch the Nations League. Portugal, held to a 2-2 draw at extra time, beat Spain in the penalties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/rajasthan-man-95-marries-90-year-old-partner-after-70-years-in-live-in-relationship-2737704-2025-06-08",
      "headline": "Rajasthan man, 95, marries 90-year-old partner after 70 years of live-in relationshipA couple from Rajasthan's Dungarpur who shared a life together for seven decades, recently got married with full traditional rituals as they proved it's never too late to honour love."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/israel-says-hamas-gaza-chief-sinwars-body-found-in-tunnel-beneath-gaza-hospital-glbs-2737747-2025-06-09",
      "headline": "Israel says Hamas Gaza chief's body found in tunnel beneath hospitalIsrael says it found the body of Hamas leader Mohammed Sinwar's body in a tunnel under a Gaza hospital. The tunnel was discovered during a military operation. Israeli officials claim the site was used by Hamas for militant activity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/must-discontinue-rs-500-notes-chandrababu-naidus-mantra-to-end-corruption-2737680-2025-06-08",
      "headline": "Must discontinue Rs 500 notes: Chandrababu Naidu's mantra to end corruptionIn an exclusive interview with India Today, Andhra Pradesh Chief Minister Chandrababu Naidu said that all big currencies should be abolished."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/4-killed-by-israeli-near-aid-distribution-site-gaza-claim-palestinian-medics-2737705-2025-06-08",
      "headline": "4 killed by Israel near aid distribution site in Gaza, claim Palestinian medicsThe Israeli military said in a statement that troops had opened fire in southern Gaza but said that it had directed warning shots at a group that was moving towards soldiers and deemed a threat to them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mahua-moitra-wedding-dance-video-viral-pinaki-misra-berlin-2737555-2025-06-08",
      "headline": "Viral video: Newlyweds Mahua Moitra, Pinaki Misra dance to 'Raat Ke Humsafar'Trinamool Congress MP Mahua Moitra and Biju Janata Dal (BJP) leader Pinaki Misra quietly married in Berlin on May 3."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/plane-carrying-20-aboard-crashes-in-tennessee-what-we-know-glbs-2737743-2025-06-09",
      "headline": "Plane carrying 20 aboard crashes in Tennessee: What we knowA plane carrying 20 people crashed in Coffee County, Tennessee, near Tullahoma Regional Airport on Sunday afternoon. Several seriously injured passengers were airlifted to hospitals. The FAA said the plane was a de Havilland DHC-6 Twin Otter. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/indian-astronaut-shubhanshu-shukla-completes-full-dress-rehearsal-ax-4-crew-ahead-space-launch-2737740-2025-06-09",
      "headline": "Indian astronaut completes full dress rehearsal with Ax-4 crew ahead of space launchIndian astronaut Shubhanshu Shukla gears up for space as the Ax-4 crew completes final launch rehearsal with SpaceX ahead of June 10 liftoff from NASA's Kennedy Space Center. The mission marks India's return to human spaceflight after four decades."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/brahmaputra-river-india-china-yarlung-tsangpo-dams-control-myth-assam-floods-hydrology-indus-waters-treaty-pakistan-2736646-2025-06-08",
      "headline": "Can China turn off India's tap, hit land formation?The life-sustaining Brahmaputra runs from China's Tibet as the Yarlung Tsangpo. Can China block or divert the flow of Tsangpo and hit India's water supply and soil formation? Pakistan was into scare-mongering after India suspended the Indus Waters Treaty. This is what experts and data say about China and the Brahmaputra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/photo-gallery-how-eid-al-adha-bakrid-was-celebrated-cross-borders-saudi-arabia-india-pakistan-bangladesh-2737398-2025-06-08",
      "headline": "How Eid al-Adha was celebrated across countriesFrom prayers to the sacrifice of animals, a collection of photos shows how Eid al-Adha was celebrated in different tones across West Asia and in the Indian subcontinent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/wicked-smart-focussed-listen-to-what-axiom-crew-says-about-indias-shubhanshu-shukla-2737619-2025-06-08",
      "headline": "Wicked smart, focussed: Listen to what Axiom crew says about India's Shubhanshu ShuklaAs Shukla now prepares to fly to space on his 14-day mission, Nasa and his fellow crew members are super-excited, and acknowledge that the Indian astronaut is a key asset to the mission."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/amit-shah-will-end-dmk-rule-2026-silent-operation-bjp-tamil-nadu-chief-nainar-nagendran-2737708-2025-06-08",
      "headline": "Amit Shah will end DMK rule in 2026 with silent operation: BJP Tamil Nadu chiefTamil Nadu BJP chief Nainar Nagendran said that Union Home Minister Amit Shah will carry out a 'silent operation' to bring down the MK Stalin-led government in the 2026 Assembly polls."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/goa-chief-minister-pramod-sawant-overrules-health-minister-assures-doctor-wont-be-suspended-amid-row-2737616-2025-06-08",
      "headline": "Pramod Sawant overrules Health Minister, assures doctor won't be suspended amid rowA day after Goa Health Minister ordered the suspension of a senior doctor at the state medical college over a feud, Chief Minister Pramod Sawant stepped in, assuring that there would be no suspension."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-final-carlos-alcaraz-vs-jannik-sinner-epic-golden-big-three-era-2737749-2025-06-09",
      "headline": "Alcaraz vs Sinner: A Roland Garros epic promising a golden post-Big Three eraFrench Open 2025: Carlos Alcaraz and Jannik Sinner's epic Roland Garros final reignited the fire of men's tennis, ushering in a thrilling new chapter beyond the Big Three. Their fierce, five-hour, 29-minute duel was a bold promise of greatness to come."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/nationsl-league-final-pportugal-vs-spain-result-cristiano-ronaldo-crying-video-2737746-2025-06-09",
      "headline": "Ronaldo breaks down in tears as Portugal beat Spain to clinch Nations LeagueLegendary Cristiano Ronaldo could not hold back his tears as Portugal beat Spain to clinch the Nations League. Portugal, held to a 2-2 draw at extra time, beat Spain in the penalties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-final-carlos-alcaraz-jannik-sinner-video-2737737-2025-06-09",
      "headline": "Watch: Alcaraz salutes Sinner in touching speech after French Open epicCarlos Alcaraz staged a remarkable comeback to defeat Jannik Sinner in the longest French Open final ever. After the thrilling match, Alcaraz shared a glowing tribute for Jannik Sinner."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-a-vs-england-lions-match-highlights-abhimanyu-easwaran-kl-rahul-2737734-2025-06-09",
      "headline": "2nd unofficial Test, Day 3: Easwaran gives strong audition for No.3 roleAbhimanyu Easwaran's patient knock of 80 runs helped India A take a strong lead on Day 3 against England Lions. The performance boosts his chances for India's top-four batting slot amid tough competition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-defends-roland-garros-title-beats-jannik-sinner-epic-final-2737733-2025-06-09",
      "headline": "Alcaraz remains King of Clay, outlasts Sinner in longest French Open finalCarlos Alcaraz edged past Jannik Sinner in an epic five-set French Open final, cementing his status as the new King of Clay. The marathon battle, which lasted 5 hours and 29 minutes, signalled the dawn of a thrilling rivalry set to define the post-Big Three era."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-cricket-board-salman-ali-agha-captain-observatory-committee-2737699-2025-06-09",
      "headline": "Pakistan to appoint all-format captain after Mike Hesson's arrival as coachPakistan Cricket Board is set to make major changes including appointing Salman Ali Agha as all-format captain. The board will also establish an observatory committee to monitor cricket developments and reshape the selection process."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-final-aryna-sabalenka-coco-gauff-controversy-2737697-2025-06-08",
      "headline": "Gauff deserves credit: Sabalenka clarifies emotional outburst after backlashAryna Sabalenka has clarified her emotional outburst after losing the French Open 2025 final to Coco Gauff. In a statement, Sabalenka said that she was not discrediting Gauff's effort in the final and praised her for the maiden French Open title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wtc-2025-south-africa-vs-australia-road-to-final-2737692-2025-06-08",
      "headline": "South Africa's road to WTC Final: Crucial draw vs India, domination at homeWTC Final 2025: Temba Bavuma-led South Africa have reached the World Test Championship final for the first time. Their dominant home performances set up a clash with defending champions Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/italy-football-luciano-spalletti-sacked-head-coach-norway-loss-2737691-2025-06-08",
      "headline": "Luciano Spalletti sacked as Italy head coach days after Norway thrashingLuciano Spalletti's time as Italy head coach ends just months before a crucial World Cup push, following a dismal loss to Norway. The Azzurri must now regroup to avoid another qualification disaster."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/brazil-forward-neymar-tests-positive-for-covid-19-2737665-2025-06-08",
      "headline": "Brazil forward Neymar tests positive for Covid-19Brazil forward Neymar has tested positive for COVID-19 and is sidelined by Santos. This raises questions about his playing future as his contract nears expiry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-final-aryna-sabalenka-coco-gauff-controversy-2737697-2025-06-08",
      "headline": "Gauff deserves credit: Sabalenka clarifies emotional outburst after backlashAryna Sabalenka has clarified her emotional outburst after losing the French Open 2025 final to Coco Gauff. In a statement, Sabalenka said that she was not discrediting Gauff's effort in the final and praised her for the maiden French Open title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wtc-2025-south-africa-vs-australia-road-to-final-2737692-2025-06-08",
      "headline": "South Africa's road to WTC Final: Crucial draw vs India, domination at homeWTC Final 2025: Temba Bavuma-led South Africa have reached the World Test Championship final for the first time. Their dominant home performances set up a clash with defending champions Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/italy-football-luciano-spalletti-sacked-head-coach-norway-loss-2737691-2025-06-08",
      "headline": "Luciano Spalletti sacked as Italy head coach days after Norway thrashingLuciano Spalletti's time as Italy head coach ends just months before a crucial World Cup push, following a dismal loss to Norway. The Azzurri must now regroup to avoid another qualification disaster."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/brazil-forward-neymar-tests-positive-for-covid-19-2737665-2025-06-08",
      "headline": "Brazil forward Neymar tests positive for Covid-19Brazil forward Neymar has tested positive for COVID-19 and is sidelined by Santos. This raises questions about his playing future as his contract nears expiry."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}