{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/why-are-young-millennials-leaving-cities-and-better-pay-2833782-2025-12-10",
      "headline": "Why are young millennials leaving cities and better pay?If cities offer better pay and faster growth, why are so many young millennials moving out? What's making suburban living more appealing than the urban hustle? Let's break it down."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/from-ais-mismatches-to-capital-gains-confusion-biggest-tax-mistakes-of-2025-and-how-to-fix-them-2833728-2025-12-10",
      "headline": "From AIS mismatches to capital gains confusion: Biggest tax mistakes of 2025With more Indians juggling salary, digital earnings, investments and gig income, tax filings in 2025 saw a jump in errors. The biggest trouble areas were AIS mismatches and confusion around capital gains, leading to incorrect returns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/amazon-bets-big-on-india-with-35-billion-investment-5-things-to-know-2833724-2025-12-10",
      "headline": "Amazon bets big on India with $35 billion investment: 5 things to knowBy 2030, Amazon plans to create an additional 3.8 million direct, indirect, induced and seasonal jobs in India. These roles are expected to come from the expansion of its core businesses and the rapid scaling of its fulfilment and last-mile delivery network."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/can-trading-less-really-make-you-more-profitable-zerodhas-nithin-kamath-explains-2833698-2025-12-10",
      "headline": "Can trading less really make you more profitable? Zerodha's Nithin Kamath explainsNithin Kamath shares insights on trading frequency, platform incentives, and the approach taken to protect clients from excessive trading."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hinge-founder-justin-mcleod-steps-down-to-launch-new-ai-dating-platform-overtone-2833662-2025-12-10",
      "headline": "Hinge founder Justin McLeod steps down to launch new AI dating platform OvertoneHinge founder Justin McLeod is stepping down after nearly fifteen years to lead Overtone, a new AI-powered dating venture backed by Match Group."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/aequs-listing-today-share-price-13-percent-premium-nse-bse-hold-or-sell-book-profit-expert-view-2833657-2025-12-10",
      "headline": "Aequs lists at 13% premium: Should you book profits or hold?Aequs share price: The stock listed at Rs 140 on both the NSE and the BSE, compared with its issue price of Rs 124."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/day-after-microsofts-175-billion-ai-plan-in-india-amazon-announces-to-invest-over-35-billion-by-2030-2833653-2025-12-10",
      "headline": "Amazon to invest $35 billion in India, support 3.8 million jobs by 2030With markets tightening globally, Amazon's $35 billion India bet underlines confidence in the country's digital demand, logistics scale and workforce depth as growth drivers through the next decade for investment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indigo-flight-crisis-hits-delhi-trade-loss-estimated-at-rs-1000-crore-trade-body-2833650-2025-12-10",
      "headline": "IndiGo flight crisis hits Delhi trade, loss estimated at Rs 1,000 crore: Trade bodyCTI Chairman Brijesh Goyal said that daily flight disruptions have severely impacted the movement of traders, tourists and business travellers, leading to a sharp fall in market activity across the city. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/meesho-share-price-bse-nse-listing-46-percent-premium-over-ipo-price-2833627-2025-12-10",
      "headline": "Meesho share price: Stock lists at 46% premium over IPO priceThe stock debuted at Rs 162.05 on the NSE and Rs 161.20 on the BSE, marking a gain of nearly 46% over its issue price of Rs 111."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/corona-remedies-ipo-subscription-nears-10-times-pharma-market-growth-boosts-investor-interest-2833609-2025-12-10",
      "headline": "Corona Remedies IPO Day 3: Check subscription status, latest GMP and moreInvestor interest in the Corona Remedies IPO has surged, with strong demand and key brokerages recommending a long-term approach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-nifty-open-marginally-higher-as-investors-buy-recent-market-dip-2833600-2025-12-10",
      "headline": "Sensex, Nifty open marginally higher as investors buy recent market dipThe S&P BSE Sensex was up 127.93 points to 84,794.21, while the NSE Nifty50 added 60.15 points to 25,899.80 as of 9:30 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/aequs-ipo-listing-share-price-subscribed-over-104-times-set-to-debut-strong-investor-interest-aerospace-manufacturing-2833585-2025-12-10",
      "headline": "Aequs IPO listing: What does GMP suggest about stock market debut?Applicants can check their allotment status via the KFin Technologies website or the Bombay Stock Exchange portal by providing the necessary application details."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/meesho-ipo-listing-expected-share-price-market-debut-latest-gmp-profit-investor-allotment-2833565-2025-12-10",
      "headline": "Meesho IPO listing: Does GMP signal bumper debut on stock market?Meesho IPO was subscribed 81.76 times overall. Retail investors subscribed 19.89 times, qualified institutional buyers excluding anchor investors subscribed 123.34 times, while the non-institutional investor portion was booked 39.85 times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/microsoft-ceo-satya-nadella-meets-pm-modi-commits-175-billion-to-indias-ai-first-future-2833370-2025-12-09",
      "headline": "Satya Nadella's big announcement for India: Rs 1.5 lakh crore for AI first futureMicrosoft CEO Satya Nadella announced that he is committing USD 17.5 billion, the company's largest-ever investment in Asia, to build infrastructure and skills needed for boosting Artificial Intelligence (AI) in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/are-ulips-really-giving-14-percent-returns-or-is-it-just-smart-mis-selling-2833236-2025-12-09",
      "headline": "Are ULIPS really giving 14% returns, or is it just smart mis-selling?Can ULIPs genuinely deliver 14% returns, or are these projections built on selective calculations and hidden costs? How accurate are these projections? Expert explains. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mehli-mistry-steps-down-from-ncpa-board-tata-trusts-vijay-singh-replaces-him-report-2833229-2025-12-09",
      "headline": "Mehli Mistry steps down from NCPA board, Tata Trusts' Vijay Singh replaces him: ReportMehli Mistry was on the NCPA council as a nominee of the Sir Dorabji Tata Trust and served alongside other Trusts' representatives, including Jehangir H. Jehangir and Pramit Jhaveri."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-over-400-points-lower-nifty-below-25900-as-fii-selling-hits-sentiments-2833208-2025-12-09",
      "headline": "Sensex, Nifty end lower as investors cautious ahead of US Fed policy decisionThe S&P BSE Sensex lost 436.41 points to close at 84,666.28, while the NSE Nifty50 was down by 120.90 points to end at 25,839.65. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/still-waiting-for-your-tax-refund-5-common-itr-errors-and-how-to-correct-them-2833121-2025-12-09",
      "headline": "Still waiting for your tax refund? 5 common ITR errors and how to correct themIf your tax refund is taking longer than usual, you're not the only one. In most cases, the delay isn't due to the system but small filing mistakes that can easily be fixed."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/cbi-files-criminal-case-against-anil-ambanis-son-jai-anmol-in-rs-228-crore-banking-fraud-case-2833151-2025-12-09",
      "headline": "Anil Ambani's son Jai Anmol named in Rs 228 crore banking fraud case by CBIThe complaint alleges cheating, criminal conspiracy and criminal misconduct that led to a wrongful loss of Rs 228.06 crore to the bank involved."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/corona-remedies-wakefit-innovations-ipo-subscription-update-investor-interest-latest-gmp-2833122-2025-12-09",
      "headline": "Wakefit vs Corona: Which IPO offers the best value? Check detailsIn terms of demand, Corona Remedies is witnessing stronger interest from investors. As of December 9, 2025, the Corona Remedies IPO is subscribed 1.78 times overall"
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhurandhar-ending-explained-game-changing-death-deception-and-rise-of-ranveer-singh-hamza-2833757-2025-12-10",
      "headline": "Dhurandhar ending explained: Death, deception and rise of Ranveer Singh's Hamza Dhurandhar Part 1 ends with a brutal betrayal that rewires the entire narrative and sets the stage for an explosive Part 2. As Ranveer Singh's Hamza rises, the film pivots into a darker, deadlier power struggle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-sethupathi-new-jiohotstar-series-kaattaan-suspense-gripping-narrative-2833750-2025-12-10",
      "headline": "Kaattaan glimpse: Fierce Vijay Sethupathi slashes a man's throat in new show Vijay Sethupathi will be seen in JioHotstar's Kaattaan, a web-series directed by Manikandan. The makers shared a glimpse on December 9 at an event in Chennai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-telugu-9-day-93-bonds-crack-as-finale-nears-sanjana-immanuel-rift-grows-2833727-2025-12-10",
      "headline": "Bigg Boss Telugu 9 Day 93: Bonds crack as finale nears, Sanjana–Immanuel rift grows As Bigg Boss Telugu 9 moves closer to the finale, the game has shifted beyond tasks and points, with emotional decisions, broken bonds and strategic betrayals redefining equations inside the house.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-named-new-york-times-most-stylish-people-2025-met-gala-debut-2833732-2025-12-10",
      "headline": "Shah Rukh Khan named among The New York Times' 67 Most Stylish People Shah Rukh Khan has been recognised by the New York Times for his appearance at the Met Gala, joining international celebrities on the 2025 Most Stylish People list."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vishal-dadlani-10-hour-vande-mataram-debate-indian-parliament-criticism-2833702-2025-12-10",
      "headline": "Vishal Dadlani criticises Parliament's 10-hour Vande Mataram debate Bollywood composer Vishal Dadlani has criticised India's Parliament for holding a 10-hour debate on Vande Mataram, raising concerns that major national issues are being overlooked in favour of symbolic topics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/why-akshaye-khanna-viral-sher-e-baloch-song-is-dhurandhar-most-explosive-turning-point-2833676-2025-12-10",
      "headline": "Why Akshaye Khanna's viral Sher-e-Baloch song is Dhurandhar's most explosive twist Sher-e-Baloch from Dhurandhar has gone viral for its swagger, but the song holds the film's most crucial narrative twist. It exposes its characters and flips the narrative, even setting the scene for the second part."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kamal-haasan-calls-regional-cinema-the-new-national-ethnic-the-new-international-2833689-2025-12-10",
      "headline": "Kamal Haasan calls regional cinema the new national, ethnic the new international At the JioHotstar South Unbound event in Chennai, Kamal Haasan highlighted the transformation of regional cinema into a national phenomenon, supported by major investments and changing viewer habits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kritika-kamra-makes-relationship-official-cricket-host-gaurav-kapur-2833687-2025-12-10",
      "headline": "Kritika Kamra's relationship with cricket host Gaurav Kapur is Insta official! Pics Actor Kritika Kamra made her relationship official on Instagram with cricket show host Gaurav Kapur. Take a look at their adorable pictures. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shabana-azmi-opens-up-on-infertility-acceptance-and-why-she-never-chose-adoption-2833684-2025-12-10",
      "headline": "Shabana Azmi opens up on infertility, acceptance and why she never chose adoption Shabana Azmi reflected on her journey of accepting life without biological children, sharing how she rose above societal expectations and found fulfillment through her work and her relationship with Farhan and Zoya Akhtar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/why-dhurandhar-stands-out-from-other-spy-films-in-bollywood-2833505-2025-12-10",
      "headline": "Why Dhurandhar stands out from other spy films in Bollywood More political chessboard than action fantasy, Aditya Dhar's Dhurandhar traps its spy inside a hostile world and refuses the comfort of spectacle, rewriting the rules of Bollywood espionage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/neelam-kothari-slams-etihad-airways-for-no-follow-up-care-after-fainting-2833651-2025-12-10",
      "headline": "Neelam Kothari faints on board after meal, slams airline for no follow-up care Actor Neelam Kothari called out Etihad Airways after she fainted mid-flight and alleged that the crew failed to offer any follow-up care. The airline has responded, while Neelam continues to demand accountability for what she described as \"mid-air neglect.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/malayalam-actor-parvathy-film-industry-support-survivor-dileep-acquittal-2017-assault-case-2833632-2025-12-10",
      "headline": "Parvathy supports survivor after Dileep acquittal: Our girl knows we're here Malayalam actor Parvathy has reaffirmed her support for the survivor after Dileep's acquittal in the 2017 assault case, joining several voices from the industry in expressing solidarity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/vinod-khanna-akshaye-khanna-dance-moves-compared-viral-dhurandhar-1989-lahore-charity-video-2833629-2025-12-10",
      "headline": "Did Akshaye channel father Vinod Khanna in Dhurandhar dance? Watch viral video A video featuring Vinod Khanna from a 1989 charity concert in Lahore has gone viral, prompting viewers to note similarities with his son Akshaye Khanna's entry in the recent film Dhurandhar. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-returns-mumbai-great-indian-kapil-show-varanasi-2833608-2025-12-10",
      "headline": "Priyanka has a message for Kapil Sharma before The Great Indian Kapil Show 4 Global icon Priyanka Chopra touched down in Mumbai on Wednesday, sharing her excitement and confirming her guest spot on the upcoming season of The Great Indian Kapil Show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/gaurav-gera-reacts-to-praise-for-his-role-in-dhurandhar-2833602-2025-12-10",
      "headline": "Been waiting for this: Gaurav Gera reacts to praise for his role in Dhurandhar  Gaurav Gera reacted emotionally to the overwhelming love he had received for his unrecognisable role in Dhurandhar. The actor said the film finally allowed him to showcase a new side of his craft beyond his popular comic characters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dhurandhar-success-sara-arjun-tribute-casting-director-mukesh-chhabra-2833592-2025-12-10",
      "headline": "You believed in me before the world: Sara Arjun thanks Mukesh Chhabra for Dhurandhar Actor Sara Arjun thanked casting director Mukesh Chhabra for his unwavering support and influential role in her casting for the film Dhurandhar. The film released in theatres on December 5, has received rave reviews from fans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/assamese-cultural-icon-zubeen-garg-posthumously-honoured-doctor-literature-cotton-university-2833582-2025-12-10",
      "headline": "Zubeen Garg posthumously awarded Doctor of Literature, sister accepts honour Late Assamese singer Zubeen Garg was posthumously awarded the honorary Doctor of Literature degree by Cotton University at its fourth convocation. Garg's sister Dr Palme Borthakur accepted the honour. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/tamil-cinema-december-box-office-crisis-festival-season-2025-2833213-2025-12-10",
      "headline": "Tamil cinema in crisis? Theatres witness dry December despite festival season Tamil cinema seems to be facing an unprecedented box office crisis this December despite the festival season. Industry insiders warn that financial troubles and postponements could deepen the crisis in 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-inspires-6000-plus-fans-dubai-expo-city-hard-work-perseverance-2833567-2025-12-10",
      "headline": "Watch: SRK recites iconic Om Shanti Om dialogue, makes grand entry at Dubai expo Shah Rukh Khan captivated over 6,000 fans at Dubai Expo City with reflections on hard work, gratitude, and personal philosophy. Several videos from the event have gone viral. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/how-can-airlines-charge-rs-40000-you-allowed-situation-to-precipitate-high-court-to-centre-on-indigo-crisis-2833714-2025-12-10",
      "headline": "How can tickets cost Rs 40,000? High Court tears into Centre over IndiGo chaosIndiGo chaos: Calling the situation 'alarming', the Delhi High Court pulled up the Centre for allowing the situation to precipitate and taking action against IndiGo only after the crisis had erupted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/h1b-interview-for-indians-put-off-by-months-linked-to-social-media-vetting-us-visa-trump-f1-h4-interview-postponed-2833719-2025-12-10",
      "headline": "H-1B interview for Indians put off by months. Is it linked to social-media vetting?The US has postponed H-1B visa interviews in India at the last minute, triggering chaos. The development comes days after the US State Department asked H-1B and H-4 visa applicants to make their social media accounts public. Is the postponing of H-1B interviews linked to online-profile checks? Here's what we know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/recipient-of-us-food-aid-india-now-feeds-america-pl-480-programme-green-revolution-rice-wheat-export-trump-diet-2833570-2025-12-10",
      "headline": "How India turned the dining tables on the USAmid US President Donald Trump's warning of new tariffs over the dumping of Indian rice, it is worth remembering how dramatically the US-India food dynamic has shifted over the decades. India, which was once reliant on low-grade American wheat, is now the world's largest rice exporter, and has farmers in the US complaining of dumping."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/japan-issues-first-mega-earthquake-tsunami-warning-what-it-means-and-should-india-be-worried-2833646-2025-12-10",
      "headline": "Should India be worried about Japan's megaquake warning?Japan's unprecedented \"megaquake\" advisory means the risk of a magnitude 8 or higher earthquake off its northern Pacific coast is temporarily higher than usual, but the absolute probability remains low."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/peaky-blinders-spotted-afghanistan-taliban-send-them-to-rehab-the-immortal-man-thomas-shelby-herat-sharia-law-2833758-2025-12-10",
      "headline": "Peaky Blinders spotted in Afghanistan. Taliban send them to rehabA group of Afghan men, dressed up as the Peaky Blinders were recently spotted in Afghanistan's Herat city. After their video went viral, the men, dressed up as the urban youth gang of the UK's Birmingham, stood no chance against the Taliban. The regime sent the men to rehab for promoting an \"un-Islamic culture\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/vijay-puducherry-rally-mic-snatched-bussy-anand-karur-stampede-tvk-tamil-nadu-2833784-2025-12-10",
      "headline": "40 people died: Woman IPS officer takes on TVK leader seeking more crowd at rallyDuring Vijay's Puducherry rally, IPS officer Isha Singh was seen snatching the mic from Bussy Anand mid-announcement. The rally in Puducherry was held under strict crowd restrictions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-army-chief-winks-journalist-imran-khan-controversy-2833546-2025-12-10",
      "headline": "Pak army spokesperson winks at woman journalist, video sparks outragePakistan's Lt Gen Ahmed Sharif Chaudhry is facing backlash after winking at a woman journalist during a press briefing. His gesture has drawn criticism online."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/not-aware-of-nor-accepted-shashi-tharoor-denies-receiving-veer-savarkar-award-2833739-2025-12-10",
      "headline": "Not aware of, nor accepted: Shashi Tharoor denies receiving Veer Savarkar AwardShashi Tharoor said he had not accepted the award and would not attend the event, noting that no details had been provided about the nature of the honour or the organisation presenting it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/next-gen-kia-seltos-debuts-with-revamped-styling-and-feature-rich-interior-2833722-2025-12-10",
      "headline": "Next-gen Kia Seltos debuts with revamped styling and feature-rich interiorKia has unveiled the all-new Seltos, a refreshed iteration of the midsize SUV that debuts a stronger stance and new interiors ahead of its expected India launch in January."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indigo-flight-cancellation-status-live-updates-govt-cuts-routes-operations-check-dgca-delhi-mumbai-bengaluru-chennai-airport-news-2833674-2025-12-10",
      "headline": "Live: On-site surprise safety checks ordered at 11 airports amid IndiGo fiascoIndiGo Flight Status Live Updates: IndiGo flight operations were hit for the ninth day, with Chennai and Hyderabad reporting over 100 cancellations amid ongoing disruptions across the network. The government on Tuesday said it was preparing to redistribute 10 per cent of IndiGo's curtailed operations to other airlines. Senior officials said the reallocation will be calibrated to ensure that additional flights assigned to other carriers do not result in further cancellations, with deployment based strictly on available resources. IndiGo will continue operating across all sectors, though high-demand routes may see adjustments. Stay tuned to indiatoday.in for all the latest updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-submits-dissent-in-meeting-with-pm-amit-shah-to-pick-central-information-vigilance-panel-chiefs-2833792-2025-12-10",
      "headline": "Rahul Gandhi dissents against PM, Amit Shah on selection of central panel chiefsRahul Gandhi submitted a formal note of dissent during a meeting with Prime Minister Narendra Modi and Home Minister Amit Shah to finalise appointments to the Central Information Commission and Central Vigilance Commission."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/keep-your-little-ones-cozy-this-winter-with-amazon-everyday-essentials-2833300-2025-12-09",
      "headline": "Keep Your Little Ones Cozy This Winter with Amazon Everyday EssentialsWhether you're looking to care for little ones or find the perfect gift, this collection of baby and kids' essentials brings together nourishment, comfort, and thoughtful design."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bride-reads-groom-quirky-dhoni-csk-match-contract-ahead-of-pheras-wedding-video-viral-2833738-2025-12-10",
      "headline": "Bride reads groom's quirky 'Dhoni-CSK match contract' ahead of pheras. Video viralBefore the pheras, bride Aashima, seated at the mandap, read the agreement written by Dhruv, who jokingly signed off as a \"devoted Dhoni and CSK fan and slightly terrified groom.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-breaks-shahid-afridi-odi-sixes-record-ranchi-2833656-2025-12-10",
      "headline": "New sixer King? Shahid Afridi reacts to Rohit Sharma breaking his ODI world recordFormer Pakistan captain Shahid Afridi was gracious in his response to Rohit Sharma breaking his world record for the most sixes in one-day internationals. Afridi, who turned six-hitting into a fashion statement during his heyday, ended his career with 351 maximums."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/vinod-khanna-akshaye-khanna-dance-moves-compared-viral-dhurandhar-1989-lahore-charity-video-2833629-2025-12-10",
      "headline": "Did Akshaye channel father Vinod Khanna in Dhurandhar dance? Watch viral videoA video featuring Vinod Khanna from a 1989 charity concert in Lahore has gone viral, prompting viewers to note similarities with his son Akshaye Khanna's entry in the recent film Dhurandhar. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-bankim-da-parliament-remark-controversy-dada-and-babu-difference-bengali-2833692-2025-12-10",
      "headline": "PM's Bankim da remark and a moment in Parliament: Who's Da and Babu in Bengal?During a discussion on Vande Mataram in Parliament, PM Modi referred to Bankim Chandra Chattopadhyay as 'Bankim Da'. The TMC objected to it, saying PM Modi should use 'Bankim Babu' instead. The issue has become the latest flashpoint in poll-bound Bengal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/why-akshaye-khanna-viral-sher-e-baloch-song-is-dhurandhar-most-explosive-turning-point-2833676-2025-12-10",
      "headline": "Why Akshaye Khanna's viral Sher-e-Baloch song is Dhurandhar's most explosive twistSher-e-Baloch from Dhurandhar has gone viral for its swagger, but the song holds the film's most crucial narrative twist. It exposes its characters and flips the narrative, even setting the scene for the second part."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/professor-husband-held-four-years-after-wifes-murder-following-forensic-brain-test-2833762-2025-12-10",
      "headline": "Police arrest professor husband in wife's murder case after forensic brain testThe statement of couple's only daughter Parul, who was away with her friends at the time of her mother's murder, that her parents had a heated argument just a day before the murder and her polygraph statement later also pointed towards the involvement of her father.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/new-us-visa-rule-sparks-panic-among-indians-as-social-media-checks-begin-glbs-2833541-2025-12-10",
      "headline": "New US visa rule sparks panic among Indians as social media checks beginA new US rule requiring H-1B and H-4 applicants to make social media public has sparked anxiety among Indians, as consulates cancel visa appointments and delays threaten jobs, travel and family plans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-odi-rankings-virat-kohli-rises-rohit-sharma-number-one-2833768-2025-12-10",
      "headline": "ICC ODI rankings: Virat Kohli rises to No. 2, closes in on Rohit Sharma's top spotIND vs SA: Virat Kohli jumped two places up to No.2 in the latest ODI rankings for batters after scoring 302 runs in the three-match series against South Africa. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/54-of-singles-are-okay-with-their-partner-bonding-with-ai-survey-2833393-2025-12-10",
      "headline": "54% of singles are okay with their partner bonding with AI: SurveyA new survey by happn reveals that people are normalising how chatbots can become the emotional pillars in the dating world. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/purvanchal-expressway-toll-booth-manager-leaks-cctv-footage-blackmail-travelers-2833688-2025-12-10",
      "headline": "UP toll plaza manager uses CCTV to film commuters' private videos, blackmail themA toll booth manager on the Purvanchal Expressway in Sultanpur, Uttar Pradesh, is accused of misusing CCTV footage and blackmailing travellers. The incident prompted a formal complaint to the Chief Minister."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/11-free-iit-courses-to-learn-data-science-and-analytics-with-credits-2833723-2025-12-10",
      "headline": "IITs are offering 11 free data science and analytics courses. Join by Jan 26Here are 11 free NPTEL data science and analytics courses from leading IITs cover graph theory, Bayesian modelling, Python, R, databases and big-data stats. These are all free to audit, and enrolment windows all close in January 2026."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/andhra-ttd-fake-silk-dupatta-scam-after-laddu-ghee-parakamani-case-2833681-2025-12-10",
      "headline": "After fake ghee, donation box theft, Rs 54 crore silk dupatta scam rocks TirumalaA new scam surfaced at Tirumala Tirupati Devasthanam, with vigilance officials detecting fake silk dupattas supplied between 2015 and 2025. The alleged fraud is pegged at over Rs 54 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhurandhar-ending-explained-game-changing-death-deception-and-rise-of-ranveer-singh-hamza-2833757-2025-12-10",
      "headline": "Dhurandhar ending explained: Death, deception and rise of Ranveer Singh's HamzaDhurandhar Part 1 ends with a brutal betrayal that rewires the entire narrative and sets the stage for an explosive Part 2. As Ranveer Singh's Hamza rises, the film pivots into a darker, deadlier power struggle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-sethupathi-new-jiohotstar-series-kaattaan-suspense-gripping-narrative-2833750-2025-12-10",
      "headline": "Kaattaan glimpse: Fierce Vijay Sethupathi slashes a man's throat in new showVijay Sethupathi will be seen in JioHotstar's Kaattaan, a web-series directed by Manikandan. The makers shared a glimpse on December 9 at an event in Chennai."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dinesh-karthik-london-spirit-mentor-batting-coach-the-hundred-rcb-mo-bobat-2833781-2025-12-10",
      "headline": "After RCB stint, Dinesh Karthik begins new coaching chapter in England The Hundred: Dinesh Karthik's coaching journey has officially gone global with his move to London Spirit. After guiding RCB to an IPL title, the former India wicketkeeper now takes his tactical touch to The Hundred."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-odi-rankings-virat-kohli-rises-rohit-sharma-number-one-2833768-2025-12-10",
      "headline": "ICC ODI rankings: Virat Kohli rises to No. 2, closes in on Rohit Sharma's top spot IND vs SA: Virat Kohli jumped two places up to No.2 in the latest ODI rankings for batters after scoring 302 runs in the three-match series against South Africa. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/arshdeep-singh-india-vs-south-africa-cuttack-bhuvneshwar-kumar-2833744-2025-12-10",
      "headline": "Bhuvneshwar Kumar 2.0? Arshdeep impresses pundits, firms up T20 World Cup spot IND vs SA, 1st T20I: Aakash Chopra and Irfan Pathan heaped praise on Arshdeep Singh after the Indian speedster picked up two wickets in India's 101-run win over South Africa on Tuesday in Cuttack. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/mohamed-salah-liverpool-outburst-cristiano-ronaldo-interview-premier-league-cool-or-not-2833164-2025-12-10",
      "headline": "First Ronaldo, now Salah: Is it cool or not when club legends speak out? Mohamed Salah's public outburst has pushed Liverpool into a moment of uncomfortable truth. As comparisons to Cristiano Ronaldo intensify, the debate deepens around what happens when club legends turn their voices against their own teams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-vs-west-indies-205-tickner-injured-second-test-basin-reserve-2833710-2025-12-10",
      "headline": "West Indies disappoint with the bat days after heroic display in series opener NZ vs WI, 2nd Test Day 1 Score: New Zealand shot West Indies out for 205 despite their fast bowler Blair Tickner suffering a freak injury. The disappointing batting display came days after the tourists 457 for 6 in the final innings to draw the series opener. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hardik-pandya-comeback-mahieka-sharma-girlfriend-support-india-vs-south-africa-t20-2833680-2025-12-10",
      "headline": "Runs, rhythm and romance: Hardik Pandya grateful for Mahieka's support India vs South Africa: Hardik Pandya credited the support of his girlfriend, Mahieka Sharma, for his seamless return to international cricket, saying his partner played a big role during his time away from the game. Hardik marked his comeback in style, smashing a match-winning 59 off 28 deliveries in the first T20I in Cuttack on Tuesday, December 9."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-south-africa-t20-jitesh-sharma-press-conference-batting-order-opportunity-2833672-2025-12-10",
      "headline": "Batting in middle order or lower, will make India call-up count: Jitesh Sharma IND vs SA: India wicketkeeper-batter Jitesh Sharma explained how he would bat at any position, as long as that helps his team win the match. Jitesh emphasised making every opportunity count when he is wearing the India jersey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/formula-2-kush-maini-art-2026-season-indian-racer-f1-breakthrough-2833669-2025-12-10",
      "headline": "India's Kush Maini signs with ART for 2026 as he pushes for F1 breakthrough Kush Maini's move to ART Grand Prix signals his most decisive push yet toward Formula 1. With a stronger platform beneath him, 2026 could become a make-or-break season in his rising career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-breaks-shahid-afridi-odi-sixes-record-ranchi-2833656-2025-12-10",
      "headline": "New sixer King? Shahid Afridi reacts to Rohit Sharma breaking his ODI world record Former Pakistan captain Shahid Afridi was gracious in his response to Rohit Sharma breaking his world record for the most sixes in one-day internationals. Afridi, who turned six-hitting into a fashion statement during his heyday, ended his career with 351 maximums."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-t20-world-cup-warning-cuttack-match-blow-away-2833596-2025-12-10",
      "headline": "India blow away South Africa: Should the rest of the T20 World Cup field be worried? IND vs SA, 1st T20I: A dominant 101-run win over T20 World Cup finalists South Africa, achieved despite losing the toss and being forced to bat on a damp pitch on a dewy night, has only strengthened India's standing as the overwhelming favourites in their title defence at a home T20 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-england-bazball-ashes-cricket-greats-reaction-0-2-2833616-2025-12-10",
      "headline": "England greats rip apart Ben Stokes, Bazball and Ashes disaster Ashes 2025-26: Legends have turned critics, faith has thinned, and Bazball teeters on the edge. Ben Stokes and Brendon McCullum must rescue their revolution, but the chances of England bouncing back after going 0-2 down in Australia look bleak. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nicholas-pooran-stumping-max-holden-stumping-ilt20-controversy-watch-video-desert-vipers-2833586-2025-12-10",
      "headline": "Tactics or too much? Fans divided as Pooran ignores clear stumping chance in ILT20A routine stumping ignored by Pooran quickly became the talking point of the match. The incident captured the fine line between sharp tactics and overthinking in T20 cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-champions-league-liverpool-vs-inter-mohamed-salah-chelsea-vs-atalanta-fc-barcelona-vs-frankfurt-2833568-2025-12-10",
      "headline": "Salah-less Liverpool edge Inter as Chelsea suffer shock defeat to AtalantaLiverpool and Barcelona strengthened their Champions League push on a night of high drama, while Chelsea slipped further into trouble. Big wins, late twists and rising pressure reshaped the race for the top eight."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-t20-suryakumar-yadav-contanst-batting-shuffling-2833560-2025-12-10",
      "headline": "Is constant batting order shuffling hurting Suryakumar Yadav in T20Is?IND vs SA, 1st T20I: Suryakumar Yadav failed to perform in the opening T20I at the Barabati Stadium in Cuttack. He scored 12 off 11 before Lungi Ngidi accounted for his wicket. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-australia-squad-pat-cummins-returns-adelaide-test-nathan-lyon-josh-hazlewood-injury-2833554-2025-12-10",
      "headline": "Ashes 2025: Pat Cummins returns as Australia name 15-man squad for Adelaide TestAshes 2025: Australia strengthened their Ashes campaign with Pat Cummins returning for the Adelaide Test. The captain's comeback arrived at a crucial moment as the hosts pushed to seal the series with two matches still remaining."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/arshdeep-singh-jokes-bumrah-instagram-reels-virat-kohli-india-vs-south-africa-t20i-2833517-2025-12-10",
      "headline": "Arshdeep's reel game: What Bumrah must do to get the Kohli treatmentArshdeep Singh joked about how Jasprit Bumrah could feature in his Instagram reel like Virat Kohli. Arshdeep and Bumrah picked up two wickets each as India thrashed South Africa by 101 runs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-does-shubman-gill-deserve-a-place-in-t20i-team-2833526-2025-12-10",
      "headline": "T20 World Cup: It's still not too late to abort Shubman Gill experimentIND vs SA: India begun their T20 World Cup preparation with a massive 101-run win against South Africa. As India get closer to the world tournament, they really need to ask themselves this - does Shubman Gill deserve a spot in the T20I side?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jitesh-sharma-sanju-samson-bond-india-t20-world-cup-wicketkeeper-rivalry-2833523-2025-12-10",
      "headline": "Samson is like an elder brother: Jitesh Sharma on T20 World Cup keeper rivalryIND vs SA, 1st T20I: Jitesh Sharma opened up about his relationship with Sanju Samson, describing it as one of brothers and saying the Kerala player generously shares his experience and helps him grow as a cricketer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hardik-pandya-team-first-reaction-cuttack-t20i-return-india-vs-south-africa-2833493-2025-12-09",
      "headline": "No fuss, only fire: Hardik's India-first mindset powers dream Cuttack returnHardik Pandya said that he has always kept India and the team first after making his dream return in Cuttack during the first T20I against South Africa. Hardik scored a fifty to save India and help them post a big total. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-1st-t20i-cuttack-jasprit-bumrah-arshdeep-singh-comment-2833491-2025-12-09",
      "headline": "'Senior' Arshdeep welcomes 'junior' Bumrah to 100-wicket club in T20IsIND vs SA: Jasprit Bumrah completed the milestone of 100 T20I wickets during the first match of the series against South Africa. India seamer Arshdeep Singh welcomed him into the elite list with a big smile and a cheeky comment."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-lowest-score-t20i-cricket-74-all-out-ind-vs-sa-cuttack-2833486-2025-12-09",
      "headline": "South Africa 74 all out: SA collapse to lowest T20I total after India run riotSouth Africa were bundled out for 74 during the first T20I against India in Cuttack on Tuesday, handing the hosts a commanding 101-run victory. The total was South Africa's lowest in T20I cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-100-t20i-wickets-dewald-brevis-india-south-africa-cuttack-2833484-2025-12-09",
      "headline": "Out or not out? No-ball controversy over Jasprit Bumrah's 100th T20I wicketIND vs SA: Jasprit Bumrah's 100th T20I wicket, the controversial dismissal of Dewald Brevis, became a major talking point in India's dominant 101-run win over South Africa in the first T20I at Cuttack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hardik-pandya-all-round-show-india-vs-south-africa-cuttack-t20i-2025-2833482-2025-12-09",
      "headline": "Hardik blitz, ruthless bowlers help India crush South Africa, end Cuttack jinxHardik Pandya's all-round blitz and a ruthless performance from the bowlers saw India crush South Africa by 101 runs in Cuttack on Tuesday, December 9. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-first-indian-bowler-100-wickets-three-international-formats-2833478-2025-12-09",
      "headline": "Jasprit Bumrah becomes first India bowler with 100 wickets in all formatsJasprit Bumrah made history in Cuttack by becoming the first Indian bowler to reach 100 wickets in Tests, ODIs and T20Is. He brought up his 100th T20I wicket in the opening match of the series against South Africa. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/sania-mirza-rohan-bopanna-mixed-doubles-exhibition-tpl-season-7-opener-2833448-2025-12-09",
      "headline": "From partners to rivals: Sania, Bopanna face off in TPL exhibition tieSania Mirza and Rohan Bopanna returned to the court for a special mixed-doubles exhibition, marking Mirza's first match in Ahmedabad in some time. Their reunion highlighted TPL's opening, drawing attention to the league's role in nurturing young tennis talent in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-hardik-pandya-59-fans-praise-cuttack-t20i-2833443-2025-12-09",
      "headline": "Hardik 'clutch' Pandya is true MVP: India all-rounder's 59 vs SA stuns fansIND vs SA, 2nd T20I: Fans praised Hardik Pandya's power-hitting 59-run knock in Cuttack, saying the all-rounder is India's true MVP in T20I cricket as he delivers with both bat and ball whenever the team needs him. Hardik smashed a sparkling unbeaten 28-ball 59 to lift India to 175 for six against South Africa. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/sreejesh-india-do-or-die-argentina-junior-hockey-world-cup-2025-2833430-2025-12-09",
      "headline": "Learn from Paris heroes: Sreejesh's message India before 3rd place tiePR Sreejesh asked his team to draw inspiration from India's Paris Olympics heroes ahead of their third-place tie against Argentina in the Jr.men's Hockey World Cup on Wednesday, December 10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-t20i-squad-kamalini-vaishnavi-sharma-maiden-callup-sri-lanka-series-2833419-2025-12-09",
      "headline": "From U19 heroes to India call-ups: G Kamalini, Vaishnavi Sharma make big career jumpIndia rewarded G Kamalini and Vaishnavi Sharma with maiden call-ups as they named the 15-member squad for the T20I series against Sri Lanka to be held later this month. Both players played crucial roles in India's U19 Women's T20 World Cup campaign. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-leads-ashes-series-2-0-mcgrath-warns-england-potential-embarrassing-defeat-adelaide-2833421-2025-12-09",
      "headline": "Ashes will get embarrassing if England can't win Adelaide Test: Glenn McGrathFormer Australian pacer Glenn McGrath believes England must win the third Test in Adelaide to avoid an embarrassing Ashes defeat, with Australia holding a commanding 2-0 series lead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/fans-slam-shubman-gill-t20i-failure-cuttack-india-vs-south-africa-2833412-2025-12-09",
      "headline": "Cook Maggi while Gill bats: Fans slam batter after Cuttack T20I failureFans slammed Shubman Gill after the Indian vice-captain failed with the bat during the Cuttack T20I against South Africa. Gill faced just two balls and scored four runs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-shubman-gill-details-troublesome-neck-injury-sidelined-month-2833395-2025-12-09",
      "headline": "Shubman Gill reveals details of neck injury that sidelined him for a monthIND vs SA, 1st T20I: Shubman Gill has detailed the neck injury that sidelined him for a month, explaining his hospitalisation, rehabilitation at the CoE, and preparation for India's T20I series against South Africa."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}