{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-wipro-zomato-paytm-idbi-bank-adani-enery-kotak-mahindra-bank-2667117-2025-01-20",
      "headline": "Stocks to watch today: Wipro, Zomato, Paytm, IDBI Bank, Adani Enery In today's trading session, stocks of Zomato, Paytm, IDBI Bank will be in the spotlight as they will announce their Q3 FY25 results today. Wipro shares will also be in the focus as it reported a rise in consolidated net profit in Q3 earnings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hindenburg-research-founder-ceo-nate-anderson-could-be-charged-with-securities-fraud-2667071-2025-01-19",
      "headline": "Hindenburg's Nate Anderson could be charged with securities fraud: ReportAnderson is under scrutiny for colluding with hedge funds in preparing reports to target various companies, added the report based on a Canadian portal, which cited documents filed before a court in Ontario. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-20-new-us-president-impact-indian-stock-markets-rupee-sensex-nifty-expert-view-2666867-2025-01-19",
      "headline": "Trump 2.0: What the new US President means for Indian stock marketsBack in November, news of Donald Trump's return to the White House sent the Sensex soaring by over 900 points, sparking optimism across Dalal Street."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-launches-trump-meme-coin-crypto-traders-2666804-2025-01-18",
      "headline": "Donald Trump launches $TRUMP meme coin, crypto traders make millions in minutesDonald Trump, days before his presidential inauguration, shook the crypto market with the launch of $TRUMP meme coin, which surged 220 per cent in value and hit USD 4.25 billion in hours."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/indias-growth-forecast-remains-at-65-imf-ytvd-2666600-2025-01-18",
      "headline": "IMF forecasts India's growth at 6.5% for fiscal year 2025-2026IMF maintains India's growth at 7% for 2024-2025 and 6.5% for 2025-2026, driven by investment and consumption."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/8th-pay-commission-how-were-the-salary-hikes-in-7th-and-6th-pay-commissions-2666333-2025-01-18",
      "headline": "8th Pay Commission: What were the big changes in 7th and 6th Pay Commissions?The Government has approved the formation of the 8th Pay Commission for central government employees and pensioners. Here is a look at the salary hikes under the 7th and 6th Pay Commissions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/5-simple-tips-to-get-personal-loans-at-lowest-interest-rates-2666375-2025-01-17",
      "headline": "5 simple tips to get personal loans at lowest interest ratesThis article guides you through five effective strategies to secure personal loans at the most competitive interest rates, ensuring you make informed financial decisions and reduce your overall borrowing costs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/8th-pay-commission-salary-hike-central-government-tax-relief-in-budget-demands-private-sector-fitment-factor-2666336-2025-01-17",
      "headline": "Why 8th Pay Commission is spurring calls for income tax relief in BudgetWith government employees set to benefit from a pay hike from the 8th Pay Commission, private sector employees are demanding income tax relief to boost their disposable income. Experts argue that easing the tax burden on individuals is key to spurring consumption, the backbone of India's economic growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-sensex-ends-over-400-points-lower-nifty-falls-as-it-stocks-tumble-2666288-2025-01-17",
      "headline": "Sensex ends over 400 points lower, Nifty falls as IT stocks tumbleThe S&P BSE Sensex ended 423.49 points lower at the closing bell, whil the NSE Nifty50 settled 108.60 points lower at 23,203.20."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/8th-pay-commission-time-when-will-it-start-timeline-benefits-central-government-employees-salary-hike-2666276-2025-01-17",
      "headline": "How long before 8th Pay Commission benefits reach central government employees?The 7th Pay Commission took around 22 months from its formation to the implementation of its recommendations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-artificial-intelligence-the-new-wolf-of-wall-street-2666190-2025-01-17",
      "headline": "Is artificial intelligence the new wolf of Wall Street?A recent Bloomberg Intelligence report stated that major Wall Street banks, including Citigroup, JPMorgan, and Goldman Sachs, may slash up to 200,000 jobs in the coming 3-5 years."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/bad-credit-here-is-how-you-can-still-secure-emergency-funds-2666242-2025-01-17",
      "headline": "Bad credit? Here's how you can still secure emergency fundsThough bad credit limits borrowing options and raises interest rates, some lenders still offer loans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-epf-to-nps-transfer-possible-check-the-details-here-2666218-2025-01-17",
      "headline": "Is EPF to NPS transfer possible? Check the details hereThe decision to transfer EPF to NPS must align with your financial goals, liquidity needs, and risk appetite. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/8th-pay-commission-salary-hike-how-much-salary-increase-can-government-employees-expect-fitment-factor-2666199-2025-01-17",
      "headline": "8th Pay Commission: How much salary increase can government employees expect?Union Minister Ashwini Vaishnaw confirmed the decision and said that the commission would be formed soon to revise the pay structure for central government employees and pensioners."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/world-bank-on-india-gdp-growth-strong-momentum-or-slowdown-in-fy26-2666164-2025-01-17",
      "headline": "Will India's growth story gain momentum or slow down in FY26?India's GDP, which clocked a stellar 9.7% in FY22 before settling at 7% in FY23 and 8.2% in FY24, has been on a roller-coaster ride."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/axis-bank-shares-price-fall-6-percent-to-hit-52-week-low-why-q3-results-should-you-buy-2666114-2025-01-17",
      "headline": "Axis Bank shares drop 6% to hit 52-week low. Should you buy? Axis Bank share price: The stock closed at Rs 1,040.20 in the previous session, opened at Rs 1,006.95 on Friday and slid further to Rs 974.45 on the Bombay Stock Exchange (BSE)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/8th-pay-commission-what-is-fitment-factor-that-determines-salary-hike-2666112-2025-01-17",
      "headline": "8th Pay Commission: What is fitment factor that determines salary hikeThe salary and pension hikes under the 8th Pay Commission will be calculated by applying the fitment factor to the existing basic pay. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-share-price-rises-over-2-after-q3-results-good-time-to-buy-2666104-2025-01-17",
      "headline": "Reliance share price rises over 2% after Q3 results. Should you buy now? Reliance's share price was up 1.44% to Rs 1,287 at 10:51 am on the Bombay Stock Exchange (BSE)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-share-price-down-today-overnight-adrs-q3-results-key-reasons-future-outlook-2666088-2025-01-17",
      "headline": "Explained: Why Infosys share price tumbled over 5% after strong Q3 resultsInfosys stock was down 5.40% at Rs 1,822.10 on the BSE at 10:15 a.m. The company's shares had hit a day's low of Rs 1,815.85. \r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/why-is-stock-market-falling-today-check-key-details-sensex-nifty-q3-results-infosys-axis-bank-2666080-2025-01-17",
      "headline": "Sensex drops 750 points. Why did stock market fall in early trade?Stock market down today: The fall in IT stocks was a result of Infosys' shares falling over 5.3% after the company reported its Q3 results yesterday. The drop, however, came as a surprise as the company raised its revenue forecast."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-inauguration-pre-victory-rally-harsh-limits-immigrations-first-day-office-2667112-2025-01-20?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump vows to prevent World War III, invasion of US borders before oathUS President-elect Donald Trump promised to hit the ground running when he takes office on Monday and said he would prevent World War III and stop the \"invasion\" of the country's borders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/gaza-ceasefire-deal-israel-hamas-war-update-three-hostages-freed-reunite-with-families-us-2667108-2025-01-20?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Hamas frees 3 hostages, Israel releases 90 Palestinians on Day 1 of Gaza truceOn the first day of the Gaza ceasefire that halted the 15-month-old war between Israel and Hamas, the Palestinian group released three Israeli hostages while Israel freed 90 Palestinian prisoners."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hindenburg-research-founder-ceo-nate-anderson-could-be-charged-with-securities-fraud-2667071-2025-01-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Hindenburg's Nate Anderson could be charged with securities fraud: ReportAnderson is under scrutiny for colluding with hedge funds in preparing reports to target various companies, added the report based on a Canadian portal, which cited documents filed before a court in Ontario. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-order-resuming-tiktok-operations-us-50-ownership-app-2667059-2025-01-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "TikTok fully restores services in US, credits 'President Trump's efforts'TikTok restored its services in the US after President-elect Donald Trump announced plans to revive the Chinese-based video sharing app's access on the condition of 50 per cent American ownership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/neeraj-chopra-marriage-wedding-photos-himani-private-ceremomny-2667065-2025-01-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bound by love: Neeraj Chopra gets married in dreamy ceremony, shares photosOlympic medalist Neeraj Chopra tied the knot with his partner, Himani Mor, in a dreamy private ceremony. The javelin superstar shared photos from the wedding on social media on Sunday, January 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-australian-open-day-9-live-updates-jannik-sinner-iga-swiatek-melbourne-2667100-2025-01-20?utm_source=LiveBlog_hp&utm_medium=LiveBlog&utm_campaign=home_LiveBlog",
      "headline": "Day 9 Live Updates: Svitolina beats Kudermetova, Sinner in action nextAustralian Open Day 9 Live Updates: Elina Svitolina has started off proceedings for the day at the Rod Laver Arena against Veronika Kudermetova. Later in the day, Jannik Sinner and Iga Swiatek will also be in action on Centre Court. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-us-president-elect-washington-rally-oath-taking-jfk-martin-luther-king-declassified-files-2667113-2025-01-20?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump vows to release John F Kennedy, Martin Luther King Jr assassination filesDonald Trump held a rally Capital One Arena in Washington DC a day ahead of taking charge as the US President. He said that he would declassify files linked to the assassinations of former US president John F Kennedy and civil rights activist Martin Luther King Jr."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/iit-madras-director-v-kamakoti-medicinal-value-cow-urine-benefits-viral-video-controversy-2667109-2025-01-20?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "IIT Madras Director praises cow urine's 'medicinal value' in viral clip, sparks rowIIT Madras Director V Kamakoti courted controversy after he praised the \"medicinal value\" of cow urine while highlighting the need to protect indigenous cows and the importance of switching to organic farming."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-hamas-ceasefire-who-are-romi-emily-doron-israeli-hostages-back-home-after-471-days-2667081-2025-01-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Who are Romi, Emily, Doron? Israeli hostages back home after 471 daysRomi Gonen, Doron Steinbrecher, and Emily Damari are the three Israeli hostages released by Hamas on Sunday as part of the Gaza ceasefire deal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/massive-fire-maha-kumbh-prayagraj-tenders-rushed-2666970-2025-01-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Maha Kumbh tents catch fire after cylinders explode, PM dials Chief MinisterMassive flames engulfed several tents at the Maha Kumbh Mela in UP's Prayagraj after two to three cylinders exploded at a campsite on Sunday evening. Authorities quickly controlled the fire with no casualties being reported. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-inauguration-jd-vance-republican-executive-orders-signs-s-jaishankar-other-events-2667107-2025-01-20?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Donald Trump to take oath as 47th US President today, S Jaishankar to attend eventDonald Trump will be inaugurated as the 47th US President today in a star-studded event that will be attended by a galaxy of foreign dignitaries, including External Affairs Minister S Jaishankar, and a host of business magnates."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/saif-ali-khan-attack-cctv-clip-from-7-days-before-actor-stabbing-helped-cops-catch-attacker-from-thane-2666957-2025-01-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "A CCTV clip from 7 days before Saif Ali Khan's stabbing helped cops catch attackerThe CCTV footage, dated January 9, showed the man accused of stabbing Saif Ali Khan roaming the Dadar and Prabhadevi areas, providing key leads that ultimately led to his arrest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/bigg-boss-18-winner-karan-veer-mehra-lifts-the-trophy-takes-rs-50-lakh-home-breaking-news-2667067-2025-01-20?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bigg Boss 18 Winner: Karan Veer Mehra lifts the trophy, takes Rs 50 lakh homeActor Karan Veer Mehra won Bigg Boss 18, lifted the trophy and also got a cash prize of Rs 50 lakh. Actor Vivian Dsena ended up being the first runner-up of the Salman Khan-hosted show. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/dharamshala-paragliding-accident-woman-killed-pilot-injured-canopy-crashes-himachal-pradesh-2667035-2025-01-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Video: 19-year-old woman killed as paragliding sortie goes wrong in HimachalA 19-year-old woman from Gujarat died, and a 29-year-old paragliding pilot sustained injuries in a fatal crash during a paragliding sortie in Dharamshala."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/tennis-australian-open-novak-djokovic-tony-jones-channel-9-on-court-interview-controversy-2667012-2025-01-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Djokovic explains interview boycott: A broadcaster insulted me, Serbian fansAustralian Open 2025: Novak Djokovic accused an Australian sports journalist of insulting him and Serbian fans on live television. The Serb refused to speak to the broadcasters after his fourth-round win on Sunday, citing the viral comments as the reason"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/tiktok-ban-elon-musk-opposes-ban-on-video-sharing-app-wants-x-services-to-start-in-china-2667054-2025-01-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Something needs to change': Musk opposes TikTok ban, wants X services in ChinaElon Musk opposed the ban on TikTok in the US citing free speech concerns, but criticised the lack of reciprocity, pointing out that TikTok operates freely in the US while platforms like X remain banned in China."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-rohit-sharma-champions-trophy-wankhede-stadium-gesture-viral-vieo-2667105-2025-01-20?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rohit Sharma's Champions Trophy gesture at Wankhede Stadium ceremony goes viral Champions Trophy 2025: Rohit Sharma posed with the coveted trophy along with the doyens of Mumbai cricket, including Sunil Gavaskar and Sachin Tendulkar, during the celebration of the 50th anniversary of the Wankhede Stadium on Sunday, January 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/athletics-himani-mor-neeraj-chopra-wedding-sports-management-2667085-2025-01-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Who is Himani Mor: Neeraj Chopra marries tennis player-turned sports managerNeeraj Chopra's wife, Himani Mor, was a tennis player who is currently a sports management professional. On Sunday, January 19, the Indian javelin star shared three pictures from his wedding ceremony. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-hamas-deal-us-joe-biden-gaza-ceasefire-deal-he-had-outlined-2667090-2025-01-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Joe Biden says 'guns gone silent in Gaza' under ceasefire deal he had outlinedJoe Biden said this is the toughest negotiations that he has been part of. \"But we have reached this point today because of the pressure Israel built on Hamas backed by the United States,\" he said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/donald-trump-swearing-in-ambanis-meet-president-elect-before-event-pose-for-a-picture-2667023-2025-01-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ambanis meet US President-elect Trump, to attend his swearing-in ceremonyThe Ambanis have been invited to Donald Trump's swearing-in ceremony as the 47th President of the United States. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/video/watch-moment-hamas-released-3-israeli-hostages-2667083-2025-01-19?utm_source=Videos_hp&utm_medium=Videos&utm_campaign=home_Videos",
      "headline": "Watch: Moment Hamas released 3 Israeli hostagesHamas released three Israeli hostages to the Red Cross on Sunday as part of a ceasefire agreement with Israel, ending over 15 months of conflict in Gaza."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-champions-trophy-shubman-gill-vice-captaincy-harbhajan-singh-yashasvi-jaiswal-2667043-2025-01-19?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Shubman Gill could have been made vice-captain after Champions Trophy: HarbhajanChampions Trophy 2025: Former India off-spinner Harbhajan Singh said the selectors and the team management could have waited until the end of the Champions Trophy to announce Shubman Gill as India's vice-captain. Harbhajan said he wanted Yashasvi Jaiswal to open the innings with Rohit Sharma in the one-day tournament, starting February 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-2667115-2025-01-20?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Watch: Sunil Gavaskar shakes a leg to 'Om Shanti Om' on Wankhede's 50th anniversaryLegendary India cricketer Sunil Gavaskar was seen shaking a leg to famous Bollywood song 'Om Shanti Om' during Wankhede Stadium's 50th anniversary celebration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/ahmedabad/story/ahmedabad-man-arrested-selling-coldplay-tickets-narendra-modi-stadium-black-marketing-police-2667111-2025-01-20?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Man arrested for selling Coldplay tickets at five times its price in AhmedabadThe Ahmedabad Police arrested a man who was allegedly selling tickets for Coldplay concert at five times the original price. The accused was selling the Rs 2,500 ticket for Rs 10,000 and the Rs 4,500 ticket for Rs 15,000."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kareena-kapoor-leaves-hospital-after-visiting-saif-ali-khan-stab-incident-rani-mukerji-arjun-kapoor-2667119-2025-01-20",
      "headline": "Videos: Tensed Kareena leaves after visiting Saif, Arjun, Rani Mukerji meet actorKareena Kapoor looked visibly tensed as she left Lilavati Hospital with police security after visiting husband Saif Ali Khan. Rani Mukerji, Arjun Kapoor and Malaika Arora paid a visit to the hospital on January 19."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/bigg-boss-18-runner-up-vivian-dsena-loses-the-trophy-to-karan-veer-mehra-2667098-2025-01-20",
      "headline": "Bigg Boss 18 runner-up: Vivian Dsena loses the trophy to Karan Veer Mehra Actor Vivian Dsena lost the Bigg Boss 18 trophy to Karan Veer Mehra. During the Sunday episode of the Salman Khan-hosted show, Karan took the trophy and the prize money home. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/bigg-boss-18-winner-karan-veer-mehra-lifts-the-trophy-takes-rs-50-lakh-home-breaking-news-2667067-2025-01-20",
      "headline": "Bigg Boss 18 Winner: Karan Veer Mehra lifts the trophy, takes Rs 50 lakh homeActor Karan Veer Mehra won Bigg Boss 18, lifted the trophy and also got a cash prize of Rs 50 lakh. Actor Vivian Dsena ended up being the first runner-up of the Salman Khan-hosted show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/rajat-dalal-evicted-bigg-boss-18-becomes-second-runner-up-2667103-2025-01-20",
      "headline": "Bigg Boss 18 finale: Rajat Dalal evicted, becomes second runner-upRajat Dalal was evicted from Bigg Boss 18, becoming the second runner-up, while Vivian DSena and Karan Veer Mehra advanced as the top two contestants of the season."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-2667115-2025-01-20",
      "headline": "Watch: Sunil Gavaskar shakes a leg to 'Om Shanti Om' on Wankhede's 50th anniversaryLegendary India cricketer Sunil Gavaskar was seen shaking a leg to famous Bollywood song 'Om Shanti Om' during Wankhede Stadium's 50th anniversary celebration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-rohit-sharma-champions-trophy-wankhede-stadium-gesture-viral-vieo-2667105-2025-01-20",
      "headline": "Rohit Sharma's Champions Trophy gesture at Wankhede Stadium ceremony goes viral Champions Trophy 2025: Rohit Sharma posed with the coveted trophy along with the doyens of Mumbai cricket, including Sunil Gavaskar and Sachin Tendulkar, during the celebration of the 50th anniversary of the Wankhede Stadium on Sunday, January 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-australian-open-day-9-live-updates-jannik-sinner-iga-swiatek-melbourne-2667100-2025-01-20",
      "headline": "Day 9 Live Updates: Svitolina beats Kudermetova, Sinner in action nextAustralian Open Day 9 Live Updates: Elina Svitolina has started off proceedings for the day at the Rod Laver Arena against Veronika Kudermetova. Later in the day, Jannik Sinner and Iga Swiatek will also be in action on Centre Court. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-mohammed-shami-training-nets-2667093-2025-01-19",
      "headline": "With strapped knee, Mohammed Shami sweats it out before India returnIND vs ENG: Indian right-arm speedster Mohammed Shami had an intense training session before the T20I series opener against England on January 22 at the Eden Gardens in Kolkata. Shami hasn't played for India since the ODI World Cup final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/athletics-himani-mor-neeraj-chopra-wedding-sports-management-2667085-2025-01-19",
      "headline": "Who is Himani Mor: Neeraj Chopra marries tennis player-turned sports managerNeeraj Chopra's wife, Himani Mor, was a tennis player who is currently a sports management professional. On Sunday, January 19, the Indian javelin star shared three pictures from his wedding ceremony. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/foootball-premier-league-manchester-united-1-3-brighton-result-reaction-old-trafford-2667082-2025-01-19",
      "headline": "Premier League: Man United slip again as Brighton complete Old Trafford hat-trickPremier League 2024-25: Manchester United conceded two second-half goals to slip to a 1-3 defeat to Brighton on Sunday at home. The Old Trafford club is at the 13th spot with 26 points from 22 matches in the season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/kho-world-cup-title-winners-india-men-women-teams-nepal-finals-2667063-2025-01-19",
      "headline": "Double delight: India men and women's teams clinch Kho Kho World Cup crownsIndia men and women's teams won the inaugural edition of the Kho Kho World Cup in New Delhi on Sunday. The men's team outclassed Nepal in a thrilling final after the one-sided women's final between the two nations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-australian-open-2025-iga-swiatek-gael-monfils-jannik-sinner-2667064-2025-01-19",
      "headline": "Australian Open, Day 9: Jannik Sinner, Iga Swiatek, Elina Svitolina in actionAustralian Open 2025: World No.1 and defending champion Jannik Sinner, Iga Swiatek, Elina Svitolina, Elena Rybakina and other big players will be in action on Day 9 of the hard court major at the Melbourne Park. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/neeraj-chopra-marriage-wedding-photos-himani-private-ceremomny-2667065-2025-01-19",
      "headline": "Bound by love: Neeraj Chopra gets married in dreamy ceremony, shares photosOlympic medalist Neeraj Chopra tied the knot with his partner, Himani Mor, in a dreamy private ceremony. The javelin superstar shared photos from the wedding on social media on Sunday, January 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sachin-tendulkar-wankhede-stadium-50-ceremony-mother-farewell-test-emotion-2667058-2025-01-19",
      "headline": "Wankhede 50: Sachin Tendulkar recalls emotional mother connection to farewell Test Sachin Tendulkar, speaking at the 50th anniversary of the Wankhede Stadium in Mumbai, recalled why he requested the BCCI to schedule his farewell Test in Mumbai. The legendary batter said he was not able to control his emotions over those three days in the Test against the West Indies. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-pakistan-vs-west-indies-mohammad-rizwan-babar-azam-thigh-five-2667056-2025-01-19",
      "headline": "Sajid Khan performs thigh-five celebration with Rizwan, Babar AzamPAK vs WI: Sajid Khan performed the thigh-five celebration with Babar Azam and Mohammad Rizwan after Pakistan beat West Indies by 127 runs in the opening Test at the Multan Cricket Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/kho-world-cup-title-winners-india-men-women-teams-nepal-finals-2667063-2025-01-19",
      "headline": "Double delight: India men and women's teams clinch Kho Kho World Cup crownsIndia men and women's teams won the inaugural edition of the Kho Kho World Cup in New Delhi on Sunday. The men's team outclassed Nepal in a thrilling final after the one-sided women's final between the two nations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-australian-open-2025-iga-swiatek-gael-monfils-jannik-sinner-2667064-2025-01-19",
      "headline": "Australian Open, Day 9: Jannik Sinner, Iga Swiatek, Elina Svitolina in actionAustralian Open 2025: World No.1 and defending champion Jannik Sinner, Iga Swiatek, Elina Svitolina, Elena Rybakina and other big players will be in action on Day 9 of the hard court major at the Melbourne Park. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/neeraj-chopra-marriage-wedding-photos-himani-private-ceremomny-2667065-2025-01-19",
      "headline": "Bound by love: Neeraj Chopra gets married in dreamy ceremony, shares photosOlympic medalist Neeraj Chopra tied the knot with his partner, Himani Mor, in a dreamy private ceremony. The javelin superstar shared photos from the wedding on social media on Sunday, January 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sachin-tendulkar-wankhede-stadium-50-ceremony-mother-farewell-test-emotion-2667058-2025-01-19",
      "headline": "Wankhede 50: Sachin Tendulkar recalls emotional mother connection to farewell Test Sachin Tendulkar, speaking at the 50th anniversary of the Wankhede Stadium in Mumbai, recalled why he requested the BCCI to schedule his farewell Test in Mumbai. The legendary batter said he was not able to control his emotions over those three days in the Test against the West Indies. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-pakistan-vs-west-indies-mohammad-rizwan-babar-azam-thigh-five-2667056-2025-01-19",
      "headline": "Sajid Khan performs thigh-five celebration with Rizwan, Babar AzamPAK vs WI: Sajid Khan performed the thigh-five celebration with Babar Azam and Mohammad Rizwan after Pakistan beat West Indies by 127 runs in the opening Test at the Multan Cricket Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/kho-kho-world-cup-2025-india-women-win-title-beat-nepal-final-new-delhi-2667053-2025-01-19",
      "headline": "India women win inaugural Kho Kho World Cup after beating Nepal in finalKho Kho World Cup 2025: India women defeated Nepal 78-40 in a dominant final to win the title in the inaugural edition of the tournament. India were undefeated throughout the tournament. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/bangladesh-cricket-shakib-al-hasan-arrest-warrant-bounced-cheque-2667045-2025-01-19",
      "headline": "Shakib Al Hasan slapped with arrest warrant in bounced cheque case Bangladesh all-rounder Shakib Al Hasan has received an arrest warrant over two bounced bank cheques. The warrant was issued by Ziadur Rahman, the Dhaka Additional Chief Metropolitan Magistrate. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-champions-trophy-shubman-gill-vice-captaincy-harbhajan-singh-yashasvi-jaiswal-2667043-2025-01-19",
      "headline": "Shubman Gill could have been made vice-captain after Champions Trophy: HarbhajanChampions Trophy 2025: Former India off-spinner Harbhajan Singh said the selectors and the team management could have waited until the end of the Champions Trophy to announce Shubman Gill as India's vice-captain. Harbhajan said he wanted Yashasvi Jaiswal to open the innings with Rohit Sharma in the one-day tournament, starting February 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-australian-open-2025-ball-kid-doubles-match-distressing-moment-2667036-2025-01-19",
      "headline": "Ball kid collapses in distressing moment during doubles match Australian Open 2025: A ball kid collapsed during the mixed doubles match on Sunday at the Margaret Court Arena. The boy, reportedly, is fine and is with his parents under a doctor's supervision. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-mohun-bagan-agm-scuffle-chair-throw-debashis-dutta-srinjoy-bose-2667029-2025-01-19",
      "headline": "Mohun Bagan AGM turns chaotic: Scuffle and chair-throwing over election delayThe annual general meeting of Kolkata football club, Mohun Bagan, turned chaotic as a scuffle broke out over the delay in elections, with chairs being thrown during the altercation. Tensions escalated as members expressed frustration over the postponed election process."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/tennis-novak-djokovic-viral-video-reporter-australian-open-2667017-2025-01-19",
      "headline": "Watch: Viral video of reporter that angered Novak Djokovic Australian Open 2025: The viral video where a journalist named Tony Jones can be seen 'insulting' Novak Djokovic and the Serbian fans. Djokovic chose not to appear for the customary interview after the match against Jiri Lehecka. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/tennis-australian-open-novak-djokovic-tony-jones-channel-9-on-court-interview-controversy-2667012-2025-01-19",
      "headline": "Djokovic explains interview boycott: A broadcaster insulted me, Serbian fansAustralian Open 2025: Novak Djokovic accused an Australian sports journalist of insulting him and Serbian fans on live television. The Serb refused to speak to the broadcasters after his fourth-round win on Sunday, citing the viral comments as the reason"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-australian-open-2025-carlos-alcaraz-novak-djokovic-quarterfinal-2667007-2025-01-19",
      "headline": "'Beat' Djokovic: Alcaraz goes into blockbuster clash with clear mindAustralian Open 2025: Carlos Alcaraz said that he was looking forward to facing Novak Djokovic in the quarterfinal of the hard court major at Melbourne Park. Alcaraz reached the last eight after Jack Draper retired due to injury. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-mohun-bagan-agm-scuffle-chair-throw-debashis-dutta-srinjoy-bose-2667029-2025-01-19",
      "headline": "Mohun Bagan AGM turns chaotic: Scuffle and chair-throwing over election delayThe annual general meeting of Kolkata football club, Mohun Bagan, turned chaotic as a scuffle broke out over the delay in elections, with chairs being thrown during the altercation. Tensions escalated as members expressed frustration over the postponed election process."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/tennis-novak-djokovic-viral-video-reporter-australian-open-2667017-2025-01-19",
      "headline": "Watch: Viral video of reporter that angered Novak Djokovic Australian Open 2025: The viral video where a journalist named Tony Jones can be seen 'insulting' Novak Djokovic and the Serbian fans. Djokovic chose not to appear for the customary interview after the match against Jiri Lehecka. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/tennis-australian-open-novak-djokovic-tony-jones-channel-9-on-court-interview-controversy-2667012-2025-01-19",
      "headline": "Djokovic explains interview boycott: A broadcaster insulted me, Serbian fansAustralian Open 2025: Novak Djokovic accused an Australian sports journalist of insulting him and Serbian fans on live television. The Serb refused to speak to the broadcasters after his fourth-round win on Sunday, citing the viral comments as the reason"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-australian-open-2025-carlos-alcaraz-novak-djokovic-quarterfinal-2667007-2025-01-19",
      "headline": "'Beat' Djokovic: Alcaraz goes into blockbuster clash with clear mindAustralian Open 2025: Carlos Alcaraz said that he was looking forward to facing Novak Djokovic in the quarterfinal of the hard court major at Melbourne Park. Alcaraz reached the last eight after Jack Draper retired due to injury. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-australian-open-novak-djokovic-on-court-interview-refusal-sania-mirza-reaction-2666988-2025-01-19",
      "headline": "Novak Djokovic refuses on-court interview, leaves pundit Sania Mirza baffledAustralian Open 2025: Novak Djokovic, in a strange turn of events, refused to do an on-court interview after his fourth-round win on Sunday. Djokovic clarified he boycotted the customary speech in response to a broadcaster's insulting comments about him and Serbian fans earlier in the week. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-alexander-zverev-ugo-humbert-australian-open-2025-tommy-paul-2666980-2025-01-19",
      "headline": "Australian Open: Alexander Zverev advances to quarterfinals with clinical win over HumbertAlexander Zverev advanced to the quarterfinals of the Australian Open 2025 with a clinical 6-1, 2-6, 6-3, 6-2 win over Ugo Humbert in the fourth round fixture at John Cain Arena. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-u19-womens-t20-world-cup-india-vs-west-indies-report-vj-joshitha-2666975-2025-01-19",
      "headline": "Bowlers fire India to colossal 9-wicket win against West Indies U19 Women's T20 World Cup 2025: India registered a comprehensive nine-wicket victory to go to the top of the table in Group A. VJ Joshitha starred for them with figures of 2-0-5-2. India chased down the target of 45 in 4.2 overs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-australian-open-novak-djokovic-sets-up-quarters-carlos-alcaraz-jiri-lehecka-2666972-2025-01-19",
      "headline": "Australian Open: Ruthless Djokovic sets up blockbuster quarter-final vs AlcarazAustralian Open 2025: Novak Djokovic defeated Jiri Lehecka in straight sets to progress to the quarter-final for the 15th time in his career in Melbourne. The 10-time champion will take on Carlos Alcaraz in what promises to be a blockbuster quarterfinals. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}