{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-prices-today-september-5-2024-yellow-metal-records-dip-silver-trades-higher-mcx-latest-rates-2594067-2024-09-05",
      "headline": "Gold, silver price today, September 5, 2024: Yellow metal records dip, silver trades higher on MCXGold Price Today 5 September 2024: Gold is trading on the lower side while silver rates have recorded a hike on the Multi Commodity Exchange (MCX) on Thursday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdb-financial-services-eyes-ipo-worth-usd-7-8-billion-by-end-of-fy24-report-hdfc-bank-2593812-2024-09-04",
      "headline": "HDB Financial Services eyes IPO worth $7–8 billion by end of FY24: ReportThe IPO is expected to be a mix of secondary sale and fresh capital, aiming for a valuation in the range of $7–8 billion."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/shree-tirupati-balajee-ipo-details-price-band-issue-size-opening-date-gmp-2593792-2024-09-04",
      "headline": "Shree Tirupati Balajee IPO: All you need to know before subscribingShree Tirupati Balajee's IPO is a book-built issue comprising a fresh issue of 1.48 crore shares totalling Rs 122.43 crore and an offer for sale of 57 lakh shares amounting to Rs 47.23 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-council-marathon-meetings-what-to-expect-in-its-54-meet-nirmala-sitharaman-tax-2593743-2024-09-04",
      "headline": "54th GST Council meeting: What's on the agenda?These meetings have focused on various important issues, including tax rates on hybrid vehicles, life insurance premiums, and challenges within the textiles and pharmaceuticals sectors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/another-sme-ipo-frenzy-boss-packing-135-times-subscription-despite-sebi-warning-2593654-2024-09-04",
      "headline": "Another SME IPO in spotlight over 135x subscription. Details hereBoss Packing Solutions, which supplies packaging machines, labelling, capping, and filling equipment, had an issue size of a little over Rs 8 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/quick-commerce-boom-in-india-instant-delivery-blinkit-zepto-swiggy-instamart-2593627-2024-09-04",
      "headline": "Beyond the grocery rush: What's fuelling India's instant delivery boom?Quick commerce is changing the retail landscape in India—imagine getting everything from snacks to electronic gadgets at your door in minutes. It's fast, it's fierce, and it's here to stay."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-end-lower-on-us-slowdown-worries-wipro-falls-3-percent-2593601-2024-09-04",
      "headline": "Sensex, Nifty end lower on US slowdown worries; Wipro falls 3% The S&P BSE Sensex dropped 171.32 points, closing at 82,384.12, while the NSE Nifty50 fell 81.15 points, finishing at 25,198.70."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/motilal-oswal-launches-nifty-500-momentum-50-index-fund-check-details-2593499-2024-09-04",
      "headline": "Motilal Oswal launches Nifty 500 Momentum 50 Index Fund. Check details The Nifty 500 Momentum 50 Index follows a momentum investing strategy, which involves selecting stocks that have shown strong performance recently."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jefferies-top-picks-11-stocks-to-watch-for-strong-5-year-returns-zomato-sbi-jsw-ambuja-airtel-2593493-2024-09-04",
      "headline": " Jefferies top picks: 11 stocks to watch for strong 5-year returnsAccording to Jefferies, these companies are likely to deliver a strong compound annual growth rate (CAGR) ranging from 15% to 25%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nvidia-shares-fall-market-capitalisation-drops-usd-279-billion-ceo-jensen-huang-wealth-loss-2593443-2024-09-04",
      "headline": "Nvidia's market value drops $279 billion. How much did CEO Jensen Huang lose?Despite the loss on Tuesday, Nvidia CEO Jensen Huang's wealth has still grown by $51 billion so far this year, according to the Bloomberg Billionaires Index. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/top-psu-defence-stocks-to-buy-hal-mazagon-dock-bel-government-spending-2593430-2024-09-04",
      "headline": "5 PSU defence stocks to buy as government boosts military spendingAntique Stock Broking has highlighted five defense PSUs with significant growth potential. Read on to discover more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ebix-emerges-debt-free-after-acquisition-by-eraaya-lifespaces-2593399-2024-09-04",
      "headline": "Ebix becomes debt-free after acquisition by Eraaya LifeSpacesEbix's successful restructuring and debt-free status mark a new chapter for the company, setting the stage for continued growth and investment in its business operations globally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/eco-mobility-shares-list-at-17-percent-premium-rs-319-hold-or-book-profit-expert-view-2593383-2024-09-04",
      "headline": "ECOS Mobility shares list at 17% premium: Should you hold or book profit?ECOS Mobility listing: Shares listed at a premium of 17.15% on the NSE at Rs 391.30, compared to the issue price of Rs 334."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/baazar-style-retail-ipo-allotment-step-by-step-guide-to-check-status-gmp-today-2593370-2024-09-04",
      "headline": "Baazar Style Retail IPO allotment: Step-by-step guide to check statusBaazar Style Retail IPO allotment: Investors who applied for Baazar Style Retail Limited IPO can check their allotment status online via the BSE website or through Link Intime India Private Ltd."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/sebi-staff-accuse-top-leadership-madhabi-puri-buch-of-creating-toxic-work-environment-2593342-2024-09-04",
      "headline": "Sebi employees accuse top leadership of creating toxic work environment: Report Sebi employees alleged that \"shouting, scolding, and public humiliation have become a norm in meetings,\" creating a hostile atmosphere that has negatively impacted their mental health and work-life balance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-price-today-september-4-2024-precious-metals-record-hike-on-mcx-2593331-2024-09-04",
      "headline": "Gold, silver price today, September 4, 2024: Precious metals record hike on MCXGold Price Today September 4, 2024: Both gold and silver are trading on the higher side of the Multi Commodity Exchange (MCX) on Wednesday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-services-sector-growth-5-moth-high-august-new-orders-key-factors-2593325-2024-09-04",
      "headline": "India's services sector growth jumps to 5-month high in August Despite this, companies in the services sector remained optimistic about future demand, although their confidence dipped to its lowest in over a year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-update-sensex-nifty-it-shares-coal-india-down-2593319-2024-09-04",
      "headline": "Sensex, Nifty decline as IT shares plunge; Coal India down over 3%The S&P BSE Sensex was down 404.78 points to 82,150.66 at 10:20 am, while the NSE Nifty50 fell 136.35 points to trade at 25,143.50."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gen-z-investment-trends-tips-stocks-mutual-funds-returns-building-wealth-risk-safety-2592928-2024-09-03",
      "headline": "Risk-takers or safety seekers: Deep dive into Gen Z investment trendsAccording to a report by a Chartered Financial Analyst (CFA), 55% of cryptocurrency investors are Gen Zs. Additionally, 41% of investments in stocks and 25% of investments in NFTs are made by Gen Zs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/intel-chipmaker-may-lose-position-bluechip-dow-jones-industrial-average-index-share-price-2592883-2024-09-03",
      "headline": "Intel at risk of losing spot in blue-chip Dow Jones index as shares plungeThe Dow Jones index, known for its price-weighted methodology, is heavily influenced by stock prices."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/supreme-court/story/arvind-kejriwal-bail-supreme-court-delhi-liquor-policy-aap-ed-cbi-money-laundering-2594038-2024-09-05",
      "headline": "CBI opposes Arvind Kejriwal's bail plea: Role not on par with co-accusedThe Supreme Court is set to hear Delhi Chief Minister Arvind Kejriwal's bail plea on Thursday in a CBI-filed corruption case related to the scrapped excise policy."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kolkata-rape-murder-rg-kar-hospital-doctor-parents-bribe-case-protest-west-bengal-2594006-2024-09-05",
      "headline": "Kolkata doctor's family claims police tried to suppress case, 'bribe them'The family of the doctor who was raped and murdered at Kolkata hospital accused the West Bengal police of covering up the case by hurriedly cremating her body and attempting to bribe them. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/goat-x-review-fans-applaud-vijay-performance-but-plot-draws-criticism-2594048-2024-09-05",
      "headline": "'GOAT' X review: Fans applaud Vijay's performance, but plot draws criticism'GOAT' received mixed reactions from the audience. While Thalapathy Vijay's performance is praised on social media, the film's plot has drawn mixed reviews."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/renukaswamy-murder-new-photos-show-victim-moments-before-death-2594045-2024-09-05",
      "headline": "Shirtless, pleading for life: Last moments of Darshan's fan before murderIn both the images, Renukaswamy is not wearing a shirt, while there are parked trucks in the background. An injury mark can also been seen on his body."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/food/story/virat-kohli-chhole-bhature-next-to-a-wrap-cart-in-delhi-indian-street-food-is-getting-a-health-upgrade-2593564-2024-09-05",
      "headline": "India's super-tasty street food is getting a health upgradeThis 'healthification' of street food is being seen across the country, reflecting a shift towards healthier food choices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/us-open-2024-jannik-sinner-daniil-medvedev-2594050-2024-09-05",
      "headline": "US Open: Jannik Sinner advances to semi-final after beating former champion Daniil MedvedevJannik Sinner advanced to the semi-final of US Open after beating former champion Daniil Medvedev by 6-2, 1-6, 6-1, 6-4."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-mk-stalin-cycling-video-x-banter-south-indian-lunch-sweets-chennai-2593913-2024-09-04",
      "headline": "Cycling, lunch and sweets: MK Stalin, Rahul Gandhi's 'brotherly' banterTamil Nadu Chief Minister MK Stalin and Congress leader Rahul Gandhi showcased their camaraderie on X, with a playful banter over cycling plans in Chennai and promises of a South Indian lunch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paris-paralympics-2024-india-medal-tally-harvinder-singh-dharambir-2593963-2024-09-05",
      "headline": "Harvinder, Dharambir shine as India edge close to 25 medalsIndia's medal tally at the Paris Paralympics 2024 edged closer to 25 with Harvinder Singh and Dharambir being the stars of the show on September 4, Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kolkata-rape-murder-reclaim-the-night-protest-thousands-women-west-bengal-demand-justice-2593964-2024-09-05",
      "headline": "Doctor rape-murder: 'Reclaim the night' protest by thousands of women in BengalWomen across the state marched at midnight with candles and national flags in hand, to demand justice for a raped and murdered trainee doctor. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/video/sathyabama-welcomes-the-yorker-champion-jasprit-bumrah-2590772-2024-08-30",
      "headline": "Sathyabama welcomes the Yorker Champion Jasprit BumrahIn a memorable event, Sathyabama University had the honour of hosting one of India's most celebrated cricket icons, Mr. Jasprit Bumrah. The university's President, Dr. Marie Johnson, and Chancellor, Dr. Mariazeena Johnson, warmly welcomed the champion fast bowler, renowned for his impeccable yorkers, to the campus.\r\n\r\nThe atmosphere was electric as students gathered in large numbers, eager to catch a glimpse of the cricket sensation. Their excitement and enthusiasm were palpable, reflecting the immense respect and admiration they hold for Bumrah. His visit not only inspired the students but also created an unforgettable experience, further strengthening the bond between sports and academia at Sathyabama University."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jaydeep-apte-sculptor-chhatrapati-shivaji-maharaj-statue-maharashtra-arrested-2593927-2024-09-04",
      "headline": "Sculptor of Shivaji statue that collapsed in Maharashtra arrested from Thane24-year-old Jaydeep Apte, who sculpted the Chhatrapati Shivaji Maharaj statue that collapsed in Maharashtra last month, was arrested in Thane district after being untraceable for nearly 10 days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/goat-movie-review-release-live-updates-thalapathy-vijay-venkat-prabhu-film-premieres-grand-celebrations-2594028-2024-09-05",
      "headline": "'GOAT' Movie Review and Release: Vijay's fans burst crackersVijay's 'GOAT' Movie Review and Release: Thalapathy Vijay's much-anticipated film 'GOAT,' directed by Venkat Prabhu, released in theaters on September 5 to great excitement. The film boasts an ensemble cast including Meenakshi Chaudhary, Prashanth and others in key roles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kashmir-punjab-terrorism-arms-ammunitions-for-nato-us-made-america-afghanistan-gangs-terrorist-india-2593339-2024-09-04",
      "headline": "How arms for Nato are ending up with gangs and terrorists in IndiaPolice recovered a pistol meant for Nato forces from two people in Punjab with criminal records last week. The spotting of such a firearm in India, however, is not an isolated one. Seizures in India of US-made weapons and those for Nato forces reveal the role of Pakistan-backed operatives in arms smuggling. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/meet-indias-historic-club-throw-medallists-dharambir-and-pranav-at-paralympics-2594010-2024-09-05",
      "headline": "Meet Dharambir and Pranav, India's historic Paralympic club throw medalistsIndia's para athletes script history with a stunning 1-2 finish at the Paralympics, led by Dharambir's record-breaking gold and Pranav Soorma's inspiring silver in club throw.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/gopalaswami-parthasarath-former-envoy-on-ic-814-hijacking-pakistan-spy-isi-role-2593914-2024-09-04",
      "headline": "Not al-Qaeda, it was totally Pak involvement: Ex-envoy on IC 814 hijackingIn an exclusive interview with India Today TV, former diplomat to Pakistan Gopalaswami Parthasarathy spoke about the involvement of Pakistan's Inter-Services Intelligence in the IC 814 hijacking."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/manohar-lal-khattar-vinesh-phogat-bajrang-punia-meeting-rahul-gandhi-photo-2593890-2024-09-04",
      "headline": "BJP's big claim on wrestlers' stir after Rahul Gandhi meets Vinesh PhogatManohar Lal Khattar's reaction came hours after the Congress released a picture of Vinesh Phogat and Bajrang Punia with Rahul Gandhi, which gave rise to speculation over the wrestlers' entry into politics ahead of Haryana election"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/ballon-dor-2024-nominees-lionel-messi-cristiano-ronaldo-omitted-2593958-2024-09-05",
      "headline": "No Messi, Ronaldo in Ballon d'Or nominees list for the first time since 2003There are no Lionel Messi and Cristiano Ronaldo on the Ballon d'Or nominees list for the first time since 2003 as the 30 players up for the award released on September 4, Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/14-year-old-student-opens-fire-georgia-school-kills-4-people-arrested-2593981-2024-09-05",
      "headline": "Student, 14, arrested in school shooting in US's Georgia that killed 4According to media reports, the accused was interviewed by the Federal Bureau of Investigation (FBI) last year for making online threats about an unspecified school shooting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/canada-news/story/canadian-prime-minister-justin-trudeau-party-support-ndp-new-democriatic-party-jagmeet-singh-2594001-2024-09-05",
      "headline": "Justin Trudeau's minority government at risk as ally withdraws supportCanadian Prime Minister Justin Trudeau faces a political challenge after the New Democratic Party withdrew its automatic support for his minority government, forcing him to seek new alliances to survive confidence votes. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kolkata-sandip-ghosh-cbi-custody-rg-kar-hospital-principal-kolkata-2593667-2024-09-04",
      "headline": "Sleepless night, veg meal: RG Kar ex-principal's 'restless' stay in CBI custodySandip Ghosh, former RG Kar principal, spent a restless night in CBI custody and demanded a vegetarian meal, citing observance of Kali Puja, sources said. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/remembering-islmaic-polymath-al-biruni-and-his-deep-dive-indias-timeless-wisdonm-2593735-2024-09-04",
      "headline": "Remembering Islamic polymath Al-Biruni and his deep dive into India's timeless wisdomAl-Biruni, an intellectual giant of the Islamic Golden Age, made significant contributions to astronomy, mathematics, and Indian studies. His work remains a testament to the power of cross-cultural understanding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/duleep-trophy-rishabh-pant-returns-to-red-ball-cricket-with-an-eye-on-reclaiming-test-spot-2593897-2024-09-04",
      "headline": "Duleep Trophy: Rishabh Pant returns to red-ball cricket with an eye on Test spotDuleep Trophy 2024: Rishabh Pant will return to play red-ball cricket for the first time since December 2022. Once India's X-factor in Tests, Pant will look to reclaim his spot ahead of what promises to be a busy Test cricket season for the senior national team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/maharashtra-polls-sharad-pawar-bjp-ajit-pawar-samarjeetsinh-ghatge-2593702-2024-09-05",
      "headline": "Sharad Pawar begins poll manoeuvring in Maharashtra, in talks with key leadersThe Sharad Pawar-led NCP has started gaining ground in Maharashtra as the veteran politician is in talks with several leaders of the BJP across the state."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/telangana/story/auto-driver-arrested-attempted-rape-murder-tribal-woman-telangana-asifabad-jainoor-2593789-2024-09-04",
      "headline": "Shops, houses burned in Telangana town after rape attempt on tribal womanVisuals from the Jainoor town showed grey smoke filling the sky as the mob burnt shops and houses. Heavy police deployment was done in the area to try and bring the situation under control."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ms-dhoni-special-appearance-thalapathy-vijay-goat-fans-frenzy-2594055-2024-09-05",
      "headline": "MS Dhoni's special appearance in Vijay's 'GOAT' sends fans into a frenzyCricketer MS Dhoni's brief appearance in Thalapathy Vijay's film 'GOAT' sent fans into a frenzy. The film released on September 5."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/goat-x-review-fans-applaud-vijay-performance-but-plot-draws-criticism-2594048-2024-09-05",
      "headline": "'GOAT' X review: Fans applaud Vijay's performance, but plot draws criticism'GOAT' received mixed reactions from the audience. While Thalapathy Vijay's performance is praised on social media, the film's plot has drawn mixed reviews."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/director-venkat-prabhu-expresses-gratitude-to-ajith-kumar-for-supporting-vijays-goat-2594036-2024-09-05",
      "headline": "Director Venkat Prabhu thanks Ajith Kumar for supporting Vijay's 'GOAT'Venkat Prabhu thanked actor Ajith Kumar for his wishes for Vijay's 'GOAT', sharing a throwback photo. He promised the film would be as memorable as 'Mankatha' and invited fans to enjoy the film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/goat-movie-review-release-live-updates-thalapathy-vijay-venkat-prabhu-film-premieres-grand-celebrations-2594028-2024-09-05",
      "headline": "'GOAT' Movie Review and Release: Vijay's fans burst crackersVijay's 'GOAT' Movie Review and Release: Thalapathy Vijay's much-anticipated film 'GOAT,' directed by Venkat Prabhu, released in theaters on September 5 to great excitement. The film boasts an ensemble cast including Meenakshi Chaudhary, Prashanth and others in key roles. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yashasvi-jaiswal-reveals-how-head-coach-gambhir-helps-india-play-fearless-cricket-2594054-2024-09-05",
      "headline": "Yashasvi Jaiswal reveals how head coach Gambhir helps India play 'fearless cricket'Yashasvi Jaiswal revealed head coach Gautam Gambhir's mantra which helped the Indian team play fearless cricket. Jaiswal is playing for Team A in the Duleep Trophy tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ishan-kishan-suryakumar-kumar-prasidh-krishna-to-miss-first-round-of-duleep-trophy-2024-2594046-2024-09-05",
      "headline": "Duleep Trophy: Ishan Kishan, Suryakumar and Prasidh Krishna to miss first roundSuryakumar Yadav, Prasidh Krishna and Ishan Kishan will not be featuring in the first round of the Duleep Trophy beginning from September 5 in Bengaluru and Anantapur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/us-open-2024-jannik-sinner-daniil-medvedev-2594050-2024-09-05",
      "headline": "US Open: Jannik Sinner advances to semi-final after beating former champion Daniil MedvedevJannik Sinner advanced to the semi-final of US Open after beating former champion Daniil Medvedev by 6-2, 1-6, 6-1, 6-4."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/india-at-paralympics-2024-day-8-schedule-harvinder-singh-pooja-2594032-2024-09-05",
      "headline": "India at Paralympics 2024, Day 8 schedule: Harvinder Singh, Pooja in focusAfter scripting history in Paris, India have the opportunity to add more medals to their best-ever tally at the Paralympics as total seven medal events are lined up on Day 8."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jack-draper-lives-dream-come-true-moment-on-reaching-1st-us-open-semi-final-2594031-2024-09-05",
      "headline": "Jack Draper lives 'dream come true moment' on reaching 1st US Open semi-finalJack Draper became the first British player in 12 years to reach the semi-final of the US Open after Andy Murray's title-winning campaign in 2012.  Draper called it a dream come true moment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/meet-indias-historic-club-throw-medallists-dharambir-and-pranav-at-paralympics-2594010-2024-09-05",
      "headline": "Meet Dharambir and Pranav, India's historic Paralympic club throw medalistsIndia's para athletes script history with a stunning 1-2 finish at the Paralympics, led by Dharambir's record-breaking gold and Pranav Soorma's inspiring silver in club throw.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2024-jessica-pegula-iga-swiatek-karolina-muchova-2594002-2024-09-05",
      "headline": "US Open: Jessica Pegula upsets Iga Swiatek to advance to 1st Grand Slam semi finalJessica Pegula stunned the world no one Iga Swiatek in the quarter-finals of the US Open 2024 to advance to her first ever Grand Slam semi final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-jack-draper-alex-de-minaur-quarterfinal-2593968-2024-09-05",
      "headline": "Jack Draper first British man in 12 years to reach US Open semis US Open 2024: Jack Draper is yet to drop a set in the ongoing major and has stormed into the semi-final with a dominating win over Alex de Minaur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paris-paralympics-2024-india-medal-tally-harvinder-singh-dharambir-2593963-2024-09-05",
      "headline": "Harvinder, Dharambir shine as India edge close to 25 medalsIndia's medal tally at the Paris Paralympics 2024 edged closer to 25 with Harvinder Singh and Dharambir being the stars of the show on September 4, Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/dharambir-gold-pranav-soorma-silver-club-throw-2593965-2024-09-05",
      "headline": "Club throw: Dharambir wins gold, Pranav silver in historic 1-2 for India Paralympics: India's Dharambir and Pranav Soorma won the gold and silver medals, respectively, in the men's club throw event on Wednesday in Paris. India took its medals tally to 24 in the quadrennial event. It was the first instance of a 1-2 for India in para-athletics at the Games. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-sheetal-devi-cheers-for-harvinder-singh-in-gold-medal-campaign-2593962-2024-09-05",
      "headline": "Sheetal Devi cheers for Harvinder Singh in gold-medal campaignParalympics 2024: Armless archer Sheetal Devi was there in the stands cheering for Harvinder Singh in the final of the men's recurve individual event in Paris. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2024-jessica-pegula-iga-swiatek-karolina-muchova-2594002-2024-09-05",
      "headline": "US Open: Jessica Pegula upsets Iga Swiatek to advance to 1st Grand Slam semi finalJessica Pegula stunned the world no one Iga Swiatek in the quarter-finals of the US Open 2024 to advance to her first ever Grand Slam semi final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-jack-draper-alex-de-minaur-quarterfinal-2593968-2024-09-05",
      "headline": "Jack Draper first British man in 12 years to reach US Open semis US Open 2024: Jack Draper is yet to drop a set in the ongoing major and has stormed into the semi-final with a dominating win over Alex de Minaur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paris-paralympics-2024-india-medal-tally-harvinder-singh-dharambir-2593963-2024-09-05",
      "headline": "Harvinder, Dharambir shine as India edge close to 25 medalsIndia's medal tally at the Paris Paralympics 2024 edged closer to 25 with Harvinder Singh and Dharambir being the stars of the show on September 4, Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/dharambir-gold-pranav-soorma-silver-club-throw-2593965-2024-09-05",
      "headline": "Club throw: Dharambir wins gold, Pranav silver in historic 1-2 for India Paralympics: India's Dharambir and Pranav Soorma won the gold and silver medals, respectively, in the men's club throw event on Wednesday in Paris. India took its medals tally to 24 in the quadrennial event. It was the first instance of a 1-2 for India in para-athletics at the Games. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paralympics-sheetal-devi-cheers-for-harvinder-singh-in-gold-medal-campaign-2593962-2024-09-05",
      "headline": "Sheetal Devi cheers for Harvinder Singh in gold-medal campaignParalympics 2024: Armless archer Sheetal Devi was there in the stands cheering for Harvinder Singh in the final of the men's recurve individual event in Paris. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-sri-lanka-3rd-test-josh-hall-debut-ollie-pope-press-conference-2593961-2024-09-05",
      "headline": "Lot to like about debutant Josh Hall with 'massive ceiling': Ollie PopeEngland's stand-in captain Ollie Pope has claimed that there is a lot to like about Josh Hall, who is set to make his debut during the Oval Test against Sri Lanka, starting from September 6."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/ballon-dor-2024-nominees-lionel-messi-cristiano-ronaldo-omitted-2593958-2024-09-05",
      "headline": "No Messi, Ronaldo in Ballon d'Or nominees list for the first time since 2003There are no Lionel Messi and Cristiano Ronaldo on the Ballon d'Or nominees list for the first time since 2003 as the 30 players up for the award released on September 4, Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-karolina-muchova-beatriz-haddad-maia-quarterfinal-2593950-2024-09-05",
      "headline": "Karolina Muchova dominates Haddad Maia to book semis berthUS Open: Karolina Muchova beat Beatriz Haddad Maia 6-1, 6-4 in the quarterfinal on Wednesday and made her way through to the semis at the Flushing Meadows. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/harvinder-singh-economics-scholar-wins-indias-1st-paralympic-archery-gold-2593942-2024-09-04",
      "headline": "Meet archer Harvinder, an economics scholar, now a Paralympic gold medalistParis Paralympics: Harvinder Singh, an economics scholar and talented Paralympic archer from Kaithal, Haryana, has made history by winning India's first gold medal in archery at the Games."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paris-paralympics-india-best-ever-medal-tally-prime-minister-narendra-modi-2593941-2024-09-04",
      "headline": "PM Modi calls India Paralympics star performers, happy after best-ever medals tallyPrime Minister Narendra Modi expressed his happiness at seeing India achieve their best-medal tally at the Paralympics after reaching 20 in Paris. PM Modi talked to the athletes and commented on their performance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/paris-paralympics-2024-archery-harvinder-singh-gold-medal-2593928-2024-09-04",
      "headline": "Harvinder Singh becomes first Indian archer to win Paralympic gold medalHarvinder Singh put on a dominant performance as he became the first Indian archer to win a Paralympics gold medal. Harvinder secured the medal in the final of the Men's Individual Recurve Open on September 4, Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/video/nitesh-kumar-rejoices-paralympics-gold-national-anthem-goosebumps-2593923-2024-09-04",
      "headline": "Nitesh Kumar rejoices Paralympics gold: National anthem gave me goosebumps Paralympics 2024: Nitesh Kumar opened up on the emotions that he felt after winning the gold medal in badminton in the Men's Singles SL3 event after defeating England's Daniel Bethell. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sco-vs-austravis-head-mitchell-marsh-t20i-record-powerplay-2593911-2024-09-04",
      "headline": "Travis Head, Mitchell Marsh smash T20I record with 113-run powerplaySCO vs AUS: Travis Head and Mitchell Marsh fired as Australia scored 113 runs in the powerplay against Scotland in the opening T20I on Wednesday in Edinburgh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/paris-paralympics-india-best-ever-medal-tally-prime-minister-narendra-modi-2593941-2024-09-04",
      "headline": "PM Modi calls India Paralympics star performers, happy after best-ever medals tallyPrime Minister Narendra Modi expressed his happiness at seeing India achieve their best-medal tally at the Paralympics after reaching 20 in Paris. PM Modi talked to the athletes and commented on their performance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/paris-paralympics-2024-archery-harvinder-singh-gold-medal-2593928-2024-09-04",
      "headline": "Harvinder Singh becomes first Indian archer to win Paralympic gold medalHarvinder Singh put on a dominant performance as he became the first Indian archer to win a Paralympics gold medal. Harvinder secured the medal in the final of the Men's Individual Recurve Open on September 4, Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/video/nitesh-kumar-rejoices-paralympics-gold-national-anthem-goosebumps-2593923-2024-09-04",
      "headline": "Nitesh Kumar rejoices Paralympics gold: National anthem gave me goosebumps Paralympics 2024: Nitesh Kumar opened up on the emotions that he felt after winning the gold medal in badminton in the Men's Singles SL3 event after defeating England's Daniel Bethell. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sco-vs-austravis-head-mitchell-marsh-t20i-record-powerplay-2593911-2024-09-04",
      "headline": "Travis Head, Mitchell Marsh smash T20I record with 113-run powerplaySCO vs AUS: Travis Head and Mitchell Marsh fired as Australia scored 113 runs in the powerplay against Scotland in the opening T20I on Wednesday in Edinburgh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/olympics/story/paris-olympics-australian-breakdancer-raygun-defends-her-record-2593907-2024-09-04",
      "headline": "Australian breakdancer Raygun defends her record: Paris criticism 'alarming'Australian breakdancer Rachael 'Raygun' Gunn has responded to the criticism she faced after her performance at the Paris Olympics, attributing much of the backlash to a lack of understanding of the sport. Despite losing all her battles, Gunn maintains her status as Australia's top female breaker and calls for more support for the sport in Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/duleep-trophy-rishabh-pant-returns-to-red-ball-cricket-with-an-eye-on-reclaiming-test-spot-2593897-2024-09-04",
      "headline": "Duleep Trophy: Rishabh Pant returns to red-ball cricket with an eye on Test spotDuleep Trophy 2024: Rishabh Pant will return to play red-ball cricket for the first time since December 2022. Once India's X-factor in Tests, Pant will look to reclaim his spot ahead of what promises to be a busy Test cricket season for the senior national team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sco-vs-aus-red-hot-travis-head-joint-fastest-fifty-australia-t20is-2593889-2024-09-04",
      "headline": "Red-hot Travis Head smacks joint-fastest fifty for Australia in T20IsSCO vs AUS: Travis Head scored a 17-ball fifty and went on to smash 80 off 25 balls. Australia won the match by seven wickets to take a 1-0 series lead. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyer-vs-kl-rahul-battle-for-test-no-5-begins-in-duleep-trophy-2593876-2024-09-04",
      "headline": "Shreyas Iyer vs KL Rahul: Battle for No. 5 begins in Duleep TrophyDuleep Trophy: Several Indian Test cricketers will play the Duleep Trophy round 1 ahead of the start of the home Test season. The focus will be on Shreyas Iyer and KL Rahul, who will be looking to make a comeback in the Test team.\r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/how-i-made-it/story/wc-influential-ten-writers-community-honors-digital-social-change-makers-2527796-2024-04-16",
      "headline": "WC influential ten: Writers community honors digital social change makersWriters Community Freelancers Releases 'WC Influential Ten' List Recognizing Social Impact through Virtual Space and Social Media"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}