{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/ulips-mutual-funds-or-stocks-what-is-the-best-for-long-term-wealth-creation-2721078-2025-05-07",
      "headline": "ULIPs, mutual funds or stocks: What's the best for long-term wealth creation?Mutual funds, ULIPs, and stocks offer different paths to wealth. While ULIPs mix insurance with investment, mutual funds offer flexibility and professional management. Stocks offer high returns but carry more risk and demand expertise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/new-nps-rules-how-to-close-your-account-after-renouncing-indian-citizenship-2721011-2025-05-07",
      "headline": "New NPS rules: How to close your account after renouncing Indian citizenshipAny Indian citizen aged between 18 and 70 years can open an NPS account. Additionally, Non-Resident Indians (NRIs) and Overseas Citizens of India (OCIs) can also open an NPS account, as long as they meet the necessary requirements set by the PFRDA."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-106-points-higher-nifty-above-24400-tata-motors-jumps-5-2720999-2025-05-07",
      "headline": "Sensex ends 106 points higher, Nifty above 24,400; Tata Motors jumps 5%The BSE Sensex was up 105.71 points higher to 80,746.78 at the closing bell, while the NSE Nifty50 rose 34.80 points to settle at 24,414.40. Most of the broader market indices also recovered after falling in early trade. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/hdfc-bank-trims-these-lending-rates-mclr-from-may-7-will-your-emis-go-down-2720970-2025-05-07",
      "headline": "HDFC Bank trims these lending rates from May 7. Will your EMIs go down?This move comes shortly after the Reserve Bank of India (RBI) cut the repo rate by 25 bps in April, taking the total cut to 50 bps since February 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/operation-sindoor-how-will-stock-markets-react-to-rising-indo-pak-tensions-2720948-2025-05-07",
      "headline": "Operation Sindoor: Should Dalal Street investors worry about what's next?There was no sell-off, no bloodbath, just a bit of volatility. For many retail investors, the calm felt unusual — shouldn't a military flare-up between nuclear neighbours spook the markets? But past data suggests otherwise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/taking-a-personal-loan-for-wedding-here-are-6-key-tips-to-keep-in-mind-2720932-2025-05-07",
      "headline": "Taking a personal loan for a wedding? Here are 6 key tips to keep in mindWeddings can tempt us to go overboard, but it's best to plan a realistic budget. See where you can cut costs or use your savings first. Borrow just the amount you really need, don't take a bigger loan just because you're eligible for it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filing-itr-heres-how-to-choose-the-right-tax-regime-old-tax-regime-new-tax-regime-standard-deduction-2720891-2025-05-07",
      "headline": "Filing ITR? Here's how to choose the right tax regimeWhile the new regime offers reduced tax slabs, it doesn't let you claim the usual deductions available under the old regime. It's lower rates, but with fewer tax-saving options."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-uk-free-trade-agreement-benefits-impact-goods-cheaper-costlier-decoded-2720888-2025-05-07",
      "headline": "Whisky, cars, and jobs: Inside India's game-changing UK free trade pactThe India-UK trade deal holds significance in a world drifting back toward trade barriers and tariff wars. With Trump-era protectionism rearing its head again, the timing of this pact couldn't be better."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/pwc-to-lay-off-2-percent-of-us-workforce-report-2720852-2025-05-07",
      "headline": "PwC to cut 1,500 jobs in the US: ReportLast year, PwC was in the news for possibly cutting half of its auditing staff in China's financial services sector. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/pakistan-karachi-stock-exchange-crashes-nearly-6-percent-operation-sindoor-military-strike-impact-2720824-2025-05-07",
      "headline": "Pakistan's Karachi Stock Exchange crashes nearly 6% after 'Operation Sindoor'The Karachi Stock Exchange 100 index (KSE-100) plunged 6,272 points in early trade, sliding to 107,296.64 — a sharp drop from Tuesday's close of 113,568.51."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/info-edge-share-price-down-80-percent-bse-trading-apps-reason-explained-2720820-2025-05-07",
      "headline": "Explained: Why Info Edge shares look like they've crashed 80% todayInfo Edge shares traded ex-split today after the company carried out a 1:5 stock split, its first since its 2006 listing. As a result, each share with a face value of Rs 10 has been subdivided into five shares of Rs 2 each."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/why-foreign-portfolio-investors-are-buying-indian-financial-stocks-explained-2720810-2025-05-07",
      "headline": "Explained: Why foreign portfolio investors are buying Indian financial stocksData from the National Securities Depository shows FPIs bought Rs 18,409 crore ($2.18 billion) worth of shares in the sector last month, propelling the Nifty Financial Services index to a 4.1% gain."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepika-padukone-on-her-pregnancy-journey-2721175-2025-05-07",
      "headline": "Deepika Padukone on her pregnancy: I went through a lotDeepika Padukone, who recently welcomed her baby girl Dua, opened up about her tough pregnancy journey and the emotional meaning behind her daughter's name. The actor is currently enjoying motherhood and has not announced her next film yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/neil-nitin-mukesh-praises-deepika-padukone-she-inspires-me-2721186-2025-05-07",
      "headline": "Neil Nitin Mukesh wants to work with Deepika Padukone again: She inspires meActor Neil Nitin Mukesh reminisces about his experience working with Deepika Padukone in 'Lafangey Parindey', highlighting their bond and his admiration for her dedication and talent. Despite busy lives, Neil cherishes their friendship and wishes to reunite with her on screen."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/naga-chaitanya-shares-first-look-poster-from-nc-24-his-first-pan-india-film-begins-shoot-2721076-2025-05-07",
      "headline": "Naga Chaitanya begins shoot for his first pan-India film NC 24Naga Chaitanya, riding high on the success of his recent release 'Thandel', released the first-look poster of his next film, a sci-fi action adventure, tentatively titled 'NC24'. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dulquer-salmaan-shares-adorable-moment-with-daughter-maryam-ameerah-salmaan-on-superbike-2721156-2025-05-07",
      "headline": "Dulquer Salmaan shares adorable moment with daughter on superbike. See picDulquer Salmaan was seen teaching his daughter Maryam to handle a bike on her 8th birthday, winning hearts online. The cute father-daughter moment came during a week full of celebrations in the Mammootty family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karan-johar-reacts-to-career-destroyer-tag-says-i-just-do-my-job-2721129-2025-05-07",
      "headline": "Karan Johar reacts to 'career destroyer' tag, says 'I just do my job'Filmmaker Karan Johar responded to criticism claiming he has negatively impacted careers in Bollywood, stating that his support for outsiders is often overlooked, while the focus remains solely on the star kids he has launched."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hina-khan-begins-her-highly-exciting-trip-to-south-korea-shares-pictures-2721083-2025-05-07",
      "headline": "Hina Khan begins her 'highly exciting' trip to South Korea, shares photosHina Khan has embarked on her first trip to South Korea, calling it a 'much-needed' and 'highly exciting' journey. While battling cancer, she is enjoying traveling again and sharing happy moments with her fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/21-years-of-arya-allu-arjun-film-that-changed-his-life-forever-2721067-2025-05-07",
      "headline": "21 years of Arya, a film that changed Allu Arjun's life foreverAllu Arjun celebrates 21 years of Arya today - the film that marked the beginning of his career-changing journey. Reflecting on its impact, he expressed gratitude for the love and memories it created."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sonu-sood-to-be-honoured-with-humanitarian-award-at-72-miss-world-for-covid-19-relief-work-2721046-2025-05-07",
      "headline": "Sonu Sood to be honoured with Humanitarian Award for Covid-19 relief workActor Sonu Sood will receive the Humanitarian Award at the Miss World 2025 grand finale. The award will recognise Sood for his contributions during the Covid-19 pandemic. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amul-tribute-shah-rukh-khan-met-gala-2025-debut-2721038-2025-05-07",
      "headline": "Amul celebrates Shah Rukh Khan aka 'India's Biggest Galakaar' after Met debutAmul celebrated Shah Rukh Khan's Met Gala debut in their new post, calling the actor 'India's biggest Galakaar'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-equal-pay-debut-production-film-subham-all-set-for-release-on-may-9-2721006-2025-05-07",
      "headline": "Samantha bats for equal pay as debut production film Subham gears up for releaseActor Samantha advocated for equal pay in a recent media interaction. Her debut production film, 'Subham' is all set for a grand release on May 9."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ahilyabai-biopic-announced-by-maharashtra-government-for-300th-birth-anniversary-2720979-2025-05-07",
      "headline": "Maharashtra government announces a biopic on AhilyabaiThe Maharashtra government will make a film on Ahilyabai Holkar's life for her 300th birth anniversary in 2025. The movie will be shown on Doordarshan and OTT platforms in Marathi and other languages."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rishab-shetty-kantara-2-sets-junior-artiste-dies-by-drowning-2720935-2025-05-07",
      "headline": "Junior artiste dies by drowning on Rishab Shetty's Kantara 2 setsRishab Shetty's 'Kantara: Chapter 1' has consistently faced several problems during its production. Now, a junior artiste from Kerala died by drowning on the sets of the highly anticipated film on Tuesday afternoon. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mammootty-allu-arjun-mohanlal-celebs-hail-indian-forces-after-operation-sindoor-2720940-2025-05-07",
      "headline": "Mammootty, Allu Arjun, Mohanlal, celebs salute Indian forces for Operation SindoorFrom Mammootty and Mohanlal to Kichcha Sudeep and Samantha, celebrities across Indian cinema praised the Armed Forces and expressed solidarity following India's counterstrike on terror camps in Pakistan and Pakistan-occupied Kashmir."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/suniel-shetty-defends-patriotism-in-cinema-amid-propaganda-debates-2720933-2025-05-07",
      "headline": "Exclusive: Suniel Shetty defends patriotism in cinema amid 'propaganda' debatesBollywood actor Suniel Shetty discusses the significance of patriotism in cinema, particularly through historical films like 'Kesari Veer'. Amid debates on propaganda in films, Shetty emphasises unity and empathy, asserting that such stories aim to celebrate and protect India's diverse history without inciting division.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/neil-nitin-mukesh-regrets-rejecting-sondhi-rahul-bose-role-in-atul-sabharwal-film-berlin-exclusive-2720939-2025-05-07",
      "headline": "Exclusive: Neil Nitin Mukesh regrets rejecting a role in BerlinNeil Nitin Mukesh expresses regret over not taking a role in the film 'Berlin', realising its potential only after watching it. He attributes his decision to prior commitments and concerns about age-drafting for another project."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shehzad-khan-opens-up-about-strained-relationship-with-father-ajit-khan-2720931-2025-05-07",
      "headline": "Shehzad Khan opens up about strained relationship with father AjitActor Shehzad Khan opened up about his tough and distant relationship with his father, famous Bollywood villain Ajit, and the struggles he faced growing up in his shadow. Even without any support from his father, Shehzad made his own way in the film industry without using his father's name."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ralph-fiennes-conclave-unveils-vatican-secrets-on-prime-video-2720922-2025-05-07",
      "headline": "Conclave OTT release: Ralph Fiennes's film starts streaming in IndiaThe political thriller 'Conclave', starring Ralph Fiennes, is now streaming in India on Prime Video. The film delves into the clandestine papal election, revealing dark Vatican secrets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/keanu-reeves-sandra-bullock-to-reunite-after-speed-for-untitled-romantic-thriller-2720900-2025-05-07",
      "headline": "Keanu Reeves, Sandra Bullock to reunite after Speed for a romantic thrillerKeanu Reeves and Sandra Bullock are reuniting for a new romantic thriller, marking their first collaboration in nearly 30 years. The film, produced by Mark Gordon, promises a fast-paced and emotionally charged narrative."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/janhvi-kapoor-reacts-to-trolls-saying-indians-are-chandivalification-of-met-2720859-2025-05-07",
      "headline": "Janhvi Kapoor reacts to trolls saying Indians are 'Chandivalification of Met'Actor Janhvi Kapoor hit back at trolls mocking Indian celebrities at the Met Gala 2025, calling out classist and colonial mindsets. She praised Indian designers and celebrities for finally getting the global recognition they long deserved. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-retires-test-cricket-india-tour-of-england-2721160-2025-05-07",
      "headline": "Rohit Sharma announces Test retirement via Insta story, to continue in ODIsCaptain Rohit Sharma announced his retirement from Test cricket. His decision comes days ahead of the selection of India's squad for the tour of England. The 38-year-old said he will continue to play for India in one-day internationals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/drills-new-delhi-area-blackout-may-7-rashtrapati-bhavan-pm-residence-hospitals-exempt-2721133-2025-05-07",
      "headline": "15-minute blackout in New Delhi area as part of security drillA complete blackout was observed for 15 minutes from 8 pm in the New Delhi area as part of the nationwide security drill, excepting at the PM's residence, metro stations and Rashtrapati Bhavan."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/kkr-vs-csk-ipl-match-kolkata-eden-gardens-cricket-association-bengal-bomb-threat-mail-2721204-2025-05-07",
      "headline": "Cricket association of Bengal gets bomb threat mail amid KKR vs CSK match at Kolkata's Eden GardensCricket association of Bengal gets bomb threat mail amid KKR vs CSK match at Kolkata's Eden Gardens"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/funerals-in-pakistan-pok-india-strikes-terror-camps-operation-sindoor-pahalgam-attack-retaliation-2721026-2025-05-07",
      "headline": "Video: LeT terrorist, Pak army attend funeral after India's strike on terror campsVideos from Pakistan and PoK showed funeral being held after India's strike on terror camps killed over 80."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-no-grip-balochistan-quetta-security-especially-after-dark-former-pm-shahid-khaqan-abbasi-2721118-2025-05-07",
      "headline": "Pak has no grip on Balochistan, especially after dark, says former PMFormer Pakistani Prime Minister Shahid Khaqan Abbasi has revealed that both the federal government and the army are losing control over the restive province of Balochistan, especially after nightfall. He said senior government officials and ministers cannot move around in Balochistan without security escorts. Abbasi also challenged the narrative of Army Chief Asim Munir regarding the scale of rebellion in Balochistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-live-updates-indian-armed-forces-carried-out-precision-strike-at-terrorist-camps-2720648-2025-05-07",
      "headline": "Live: Amit Shah's meet with Chief Ministers, Governors of states bordering Pak, NepalOperation Sindoor Live Updates: India carried out precision strikes on terror camps in Pakistan and Pakistan-occupied Kashmir in response to the April 22 Pahalgam terror attack which killed 26 people. The government said its actions have been \"focused, measured and non-escalatory in nature\" and that \"no Pakistani military facilities have been targeted\". Prime Minister Narendra Modi told his colleagues in the Cabinet meeting that it was a proud moment for everyone following the operation.  The government will hold an all-party meeting at 11 am tomorrow following Operation Sindoor.  Follow Indiatoday.in for the latest updates."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/school-students-cab-driver-killed-in-car-tipper-truck-collision-in-punjab-2721152-2025-05-07",
      "headline": "6 school students, cab driver killed in car-tipper truck collision in PunjabAnother student, who was onboard the ill-fated school cab, was admitted to a nearby hospital in a critical condition. He is currently admitted to the Intensive Care Unit (ICU)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/blackout-alert-state-wise-blackout-timings-for-security-mock-drills-2721131-2025-05-07",
      "headline": "Blackout alert: State-wise blackout timings for security drillsIndia is conducting a massive civil defence mock drill across multiple states today. Timed blackouts are part of the exercise. Check when your city will go dark tonight.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/operation-sindoor-and-the-myth-of-nuclear-deterrence-india-strikes-pakistan-pak-terror-camp-2721104-2025-05-07",
      "headline": "Operation Sindoor and The Myth of Nuclear DeterrenceOn the intervening night of May 6 and May 7, Indian Air Force jets, backed by drones and special forces, launched a series of precision strikes on terrorist infrastructure across POK and Pakistan's Punjab province."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-precision-strikes-indian-army-video-pakistan-pak-occupied-kashmir-2721030-2025-05-07",
      "headline": "Target locked, missile fired: Videos show India's precision strikes in Pak, POKNine targets-- Sawai Nalla, Sarjal, Muridke, Kotli, Kotli Gulpur, Mehmoona Joya, Bhimber and Bahawalpur – in Pakistan and Pakistan-occupied Kashmir were carefully chosen and hit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-nsa-ajit-doval-operation-sindoor-pakistan-pok-terror-camps-targeted-countries-briefed-2721012-2025-05-07",
      "headline": "No intent to escalate but prepared to retaliate: India as Pak threatens responseNational Security Advisor Ajit Doval briefed several countries on India's actions taken in response to the deadly terror attack in Pahalgam that left 26 innocents dead on April 22."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-pm-narendra-modi-one-move-several-targets-starring-grandmaster-geopolitics-2721027-2025-05-07",
      "headline": "One move, several targets: Operation Sindoor starring Modi as grandmaster of geopoliticsOn the face of it, 'Operation Sindoor' is a coordinated strike on 9 targets in Pakistan and the parts of Kashmir it occupies. But before making this audacious move, Modi had already placed several pieces on the board, offering deep insights into his understanding of warfare and India's society and politics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-pm-modi-art-of-deception-pakistan-strikes-pok-pahalgam-attack-2720731-2025-05-07",
      "headline": "Indicate left, turn right: PM Modi's art of deception Pakistan failed to noticeBefore both Balakot and \"Operation Sindoor\", PM Modi kept public appearances routine, speeches calm, and intent hidden — masking precision strikes behind a poker face that Pakistan failed to read twice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-indian-army-air-force-navy-biggest-strike-inside-pakistan-punjab-explained-5-points-2720990-2025-05-07",
      "headline": "Why Operation Sindoor is the biggest strike inside Pak. Explained in 5 pointsStriking deep in Pakistan's heart, Punjab, for the first time since the 1971 War, Indian forces dismantled key terror hubs of JeM, LeT, and Hizb across nine locations in just 25 minutes. These are the five reasons why Operation Sindoor is the biggest Indian strike inside Pakistan in 55 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/modi-talks-space-on-operation-sindoor-day-reveals-india-pakistan-pahalgam-terror-attack-war-2025-2720997-2025-05-07",
      "headline": "Modi talks space on Op Sindoor day, reveals space between India, PakJust hours after India hit terror infrastructure inside Pakistan and prepared for escalation, PM Narendra Modi addressed a seminar on space technology. His poise revealed a leader who was tackling an incorrigible neighbour while aiming for the stars."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-himanshi-narwal-pahalgam-terror-attack-pakistan-strikes-2720994-2025-05-07",
      "headline": "Terrorists said ask Modi, he replied: Navy officer's widow praises Op SindoorHimanshi Narwal, widow of Lt Vinay Narwal, called Operation Sindoor a \"befitting reply\" to the Pahalgam ambush, saying it honoured the pain of 26 fallen soldiers' families."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/who-are-indian-officers-sofiya-qureshi-vyomika-singh-powering-operation-sindoor-2720862-2025-05-07",
      "headline": "Who are officers Sofiya Qureshi and Vyomika Singh who briefed on Operation Sindoor?Col. Sofia Qureshi and Wing Commander Vyomika Singh led the press briefing after Operation Sindoor, sending a strong message to enemies of India. Here we look at who they are, what they have achieved, and how their growing roles reflect the rising power of women in India's armed forces."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/what-blackout-war-drills-may-7-achieve-in-age-of-gps-tracking-precision-weapons-war-india-pakistan-2720542-2025-05-07",
      "headline": "What blackouts achieve in age of GPS, precision bombsIndia conducted drills to prepare for further military escalation with Pakistan. Blackouts, periods when entire cities switch off lights to blind enemy fighter planes, have been part of the drills. Do blackouts serve any purpose in the day and age of GPS, online maps and navigation, and precision weapons?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-tour-of-england-rohit-sharma-captaincy-tests-selectors-2721145-2025-05-07",
      "headline": "Rohit Sharma unlikely to lead India in England Tests, selectors to name new captainIndia tour of England: Rohit Sharma is unlikely to lead India in the five-Test series. The selectors are not sure if the senior batter will be picked for the tour, starting June 20. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-ready-to-back-down-defence-ministers-climbdown-after-india-strikes-2720937-2025-05-07",
      "headline": "Pakistan ready to back down? Minister's tone-shift after Operation SindoorHours after vowing a forceful response to India's military strikes, Pakistan's Defence Minister Khawaja Asif left room for dialogue, saying Islamabad would \"wrap up\" tensions if New Delhi backs down."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/white-smoke-new-pope-the-hidden-chemistry-behind-the-vatican-signal-2720516-2025-05-07",
      "headline": "White smoke, new Pope: The hidden chemistry behind the Vatican signalAs the world awaits the outcome of the papal conclave, all eyes turn to the chimney atop the Sistine Chapel, where a centuries-old ritual unfolds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-civilians-evacuated-airports-shut-india-pakistan-on-edge-after-strikes-on-terror-camps-2721033-2025-05-07",
      "headline": "Civilians evacuated, airports shut: What's happening in India, Pak after Op SindoorBoth India and Pakistan have taken precautionary measures in case tensions escalate following Operation Sindoor, under which Indian Armed Forces targetted terror camps at 9 locations in Pak and POK."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/chinese-chatter-on-operation-sindoor-and-what-it-says-about-nuclear-conflict-2720953-2025-05-07",
      "headline": "Chinese chatter on Operation Sindoor and what it says about nuclear conflictIndia carried out Operation Sindoor targeting terror camps across Pakistan and Pakistan-occupied Kashmir (PoK) in the early hours of Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/amazon-indias-great-summer-sale-2025-is-here-transform-your-garden-with-upto-60-off-on-lawn-garden-essentials-2718704-2025-05-02",
      "headline": "Amazon India's Great Summer Sale 2025 is here: Transform your garden with upto 60% off on lawn & garden essentialsMake your Garden and Lawn summer ready with Amazon India's Great Summer Sale 2025 that is live now. Enjoy Up to 60% off on Lawn & Garden Essentials such as Plants, Solar Lights and more."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-test-retirement-indian-team-fans-reaction-2721178-2025-05-07",
      "headline": "Thank you Rohit Sharma: Fans pay tribute to India captain after Test retirementFans paid tribute to Rohit Sharma after the 38-year-old announced his decision to retire from Tests with immediate effect on Wednesday, May 7. Rohit announced his decision via an Instagram story. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-retires-test-cricket-india-tour-of-england-2721160-2025-05-07",
      "headline": "Rohit Sharma announces Test retirement via Insta story, to continue in ODIsCaptain Rohit Sharma announced his retirement from Test cricket. His decision comes days ahead of the selection of India's squad for the tour of England. The 38-year-old said he will continue to play for India in one-day internationals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-vs-csk-ms-dhoni-eden-gardens-return-kolkata-2721159-2025-05-07",
      "headline": "KKR vs CSK: Emotional MS Dhoni gets grand welcome at 'home ground' Eden GardensAn emotional MS Dhoni got a grand welcome from the crowd at the Eden Gardens ahead of the KKR vs CSK clash on Wednesday, May 7. Dhoni played a lot of cricket in his younger days in Kolkata. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kkr-vs-csk-venkatesh-iyer-misses-due-to-injury-manish-pandey-in-as-replacement-2721158-2025-05-07",
      "headline": "KKR vs CSK: Venkatesh Iyer misses out due to injury, Manish Pandey in as replacementKolkata Knight Riders (KKR) all-rounder Venkatesh Iyer has been ruled out of his team's fixture against Chennai Super Kings (CSK) at Eden Gardens, Kolkata. Iyer hasn't had a memorable season with the bat after being sold for a whopping Rs 23.75 crore at the auction."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-tour-of-england-rohit-sharma-captaincy-tests-selectors-2721145-2025-05-07",
      "headline": "Rohit Sharma unlikely to lead India in England Tests, selectors to name new captainIndia tour of England: Rohit Sharma is unlikely to lead India in the five-Test series. The selectors are not sure if the senior batter will be picked for the tour, starting June 20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-women-score-tri-series-colombo-jemimah-deepti-2721130-2025-05-07",
      "headline": "India march into ODI tri-series final after Jemimah heroics sink South AfricaIndia advanced to the final of the ODI tri-series in Sri Lanka after beating South Africa in their final league game in Colombo on Wednesday. Jemimah Rodrigues shone with a stellar hundred. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-suryakumar-yadav-breaks-sachin-tendulkars-14-year-old-record-2721113-2025-05-07",
      "headline": "IPL 2025: Suryakumar Yadav breaks Sachin Tendulkar's 14-year-old recordMumbai Indians' batter Suryakumar Yadav broke legendary Sachin Tendulkar's 14-year-old record as he completed 500 runs for MI in the ongoing Indian Premier League 2025 (IPL 2025)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-dc-dharamshala-rescheduled-bcci-operation-sindhoor-2721099-2025-05-07",
      "headline": "IPL 2025: PBKS vs DC in Dharamshala in doubt, BCCI awaiting government clearanceThe Punjab Kings vs Delhi Capitals match in Dharamshala is in serious doubt as the BCCI awaits clearance from the government. The development comes in the aftermath of Operation Sindhoor. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravindra-jadejas-top-spot-under-threat-in-icc-test-all-rounders-rankings-2721073-2025-05-07",
      "headline": "Ravindra Jadeja's top spot under threat in ICC Test all rounders' rankingsIndia all-rounder Ravindra Jadeja's reign at the top spot in the ICC Men's Test all-rounders' rankings is under threat following Bangladesh's Mehidy Hasan Miraz rise to the second spot. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/sunil-chhetri-afc-asian-cup-qualifiers-india-probables-list-manolo-marquez-2721070-2025-05-07",
      "headline": "Sunil Chhetri named in India probables list for AFC Asian Cup qualifiers in JuneIndia coach Manolo Marquez has continued to show his faith in Sunil Chhetri as the veteran striker was included in the probables list for the AFC Asian Cup qualifiers in June. India will be playing Hong Kong China on June 10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-suryakumar-yadav-breaks-sachin-tendulkars-14-year-old-record-2721113-2025-05-07",
      "headline": "IPL 2025: Suryakumar Yadav breaks Sachin Tendulkar's 14-year-old recordMumbai Indians' batter Suryakumar Yadav broke legendary Sachin Tendulkar's 14-year-old record as he completed 500 runs for MI in the ongoing Indian Premier League 2025 (IPL 2025)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-dc-dharamshala-rescheduled-bcci-operation-sindhoor-2721099-2025-05-07",
      "headline": "IPL 2025: PBKS vs DC in Dharamshala in doubt, BCCI awaiting government clearanceThe Punjab Kings vs Delhi Capitals match in Dharamshala is in serious doubt as the BCCI awaits clearance from the government. The development comes in the aftermath of Operation Sindhoor. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravindra-jadejas-top-spot-under-threat-in-icc-test-all-rounders-rankings-2721073-2025-05-07",
      "headline": "Ravindra Jadeja's top spot under threat in ICC Test all rounders' rankingsIndia all-rounder Ravindra Jadeja's reign at the top spot in the ICC Men's Test all-rounders' rankings is under threat following Bangladesh's Mehidy Hasan Miraz rise to the second spot. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/sunil-chhetri-afc-asian-cup-qualifiers-india-probables-list-manolo-marquez-2721070-2025-05-07",
      "headline": "Sunil Chhetri named in India probables list for AFC Asian Cup qualifiers in JuneIndia coach Manolo Marquez has continued to show his faith in Sunil Chhetri as the veteran striker was included in the probables list for the AFC Asian Cup qualifiers in June. India will be playing Hong Kong China on June 10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-punjab-kings-vs-mumbai-indians-to-be-shifted-out-of-dharamsala-2721002-2025-05-07",
      "headline": "IPL 2025: PBKS vs MI match likely to be shifted out of DharamsalaThe Match 61 of the Indian Premier League 2025 (IPL 2025), scheduled to be played between Punjab Kings (PBKS) and Mumbai Indians (MI) is likely to be shifted following the closure of the Dharamsala airport."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/psg-vs-arsenal-champions-league-semifinal-live-streaming-predicted-line-up-2720967-2025-05-07",
      "headline": "PSG vs Arsenal, Champions League semifinal: Live streaming, predicted line-upArsenal will visit France to take on French champions Paris Saint Germain in the second leg of the UEFA Champions League semifinal in Paris. The winner of this tie will meet Inter Milan in the Champions League final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-jemimah-rodrigues-tri-series-century-guitar-celebration-2720964-2025-05-07",
      "headline": "IND v SA tri-series: Jemimah Rodrigues hits 2nd ODI hundred, joins elite listTri-series in Sri Lanka: Jemimah Rodrigues pulled off a guitar celebration after hitting her second ODI hundred in the match against South Africa in Colombo on May 7. She became the 7th Indian batter to hit more than a hundred in women's ODIs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-shubman-gill-gt-vs-mi-2720943-2025-05-07",
      "headline": "Ideal leader Shubman Gill thriving in IPL, says GT coach Parthiv PatelGujarat Titans assistant Parethiv Patel said that Shubman Gill is thriving in the leadership role in IPL 2025. After 11 matches, Shubman's GT are at the top of the table.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mumbai-indians-travel-disrupt-dharamsala-airport-closure-punjab-kingd-2720925-2025-05-07",
      "headline": "Dharamsala airport closure impacts Mumbai Indians' travel plansMumbai Indians' travel to Dharamsala for their IPL 2025 match against Punjab Kings has been delayed due to the closure of the local airport amid heightened security. The May 8 fixture between Delhi Capitals and Punjab Kings will go ahead as scheduled.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-schedule-continue-bcci-statement-india-pakistan-tension-2720883-2025-05-07",
      "headline": "IPL 2025 to continue as scheduled amid India-Pakistan tensions: SourcesThe Indian Premier League will continue as scheduled amid the escalating tension between India and Pakistan, an indian cricket board source said. 14 more matches, including the final, is set to be played in the next three weeks. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sachin-tendulkar-shikhar-dhawan-praise-india-operation-sindoor-2720871-2025-05-07",
      "headline": "Sachin Tendulkar, Shikhar Dhawan praise India's Operation SindoorSachin Tendulkar and Shikhar Dhawan showed strong support after Indian forces launched a coordinated attack on terrorist camps in Pakistan and Pakistan-Occupied Kashmir. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kkr-vs-csk-ipl-2025-preview-predicted-xi-team-news-and-kolkata-pitch-conditions-2720867-2025-05-07",
      "headline": "Inconsistent KKR eye late playoffs charge vs woeful ChennaiIPL 2025: Kolkata Knight Riders need to win all their games to make it to the playoffs this season. They face Chennai Super Kings at home, a team that has already been knocked out this season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mumbai-indians-travel-disrupt-dharamsala-airport-closure-punjab-kingd-2720925-2025-05-07",
      "headline": "Dharamsala airport closure impacts Mumbai Indians' travel plansMumbai Indians' travel to Dharamsala for their IPL 2025 match against Punjab Kings has been delayed due to the closure of the local airport amid heightened security. The May 8 fixture between Delhi Capitals and Punjab Kings will go ahead as scheduled.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-schedule-continue-bcci-statement-india-pakistan-tension-2720883-2025-05-07",
      "headline": "IPL 2025 to continue as scheduled amid India-Pakistan tensions: SourcesThe Indian Premier League will continue as scheduled amid the escalating tension between India and Pakistan, an indian cricket board source said. 14 more matches, including the final, is set to be played in the next three weeks. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sachin-tendulkar-shikhar-dhawan-praise-india-operation-sindoor-2720871-2025-05-07",
      "headline": "Sachin Tendulkar, Shikhar Dhawan praise India's Operation SindoorSachin Tendulkar and Shikhar Dhawan showed strong support after Indian forces launched a coordinated attack on terrorist camps in Pakistan and Pakistan-Occupied Kashmir. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kkr-vs-csk-ipl-2025-preview-predicted-xi-team-news-and-kolkata-pitch-conditions-2720867-2025-05-07",
      "headline": "Inconsistent KKR eye late playoffs charge vs woeful ChennaiIPL 2025: Kolkata Knight Riders need to win all their games to make it to the playoffs this season. They face Chennai Super Kings at home, a team that has already been knocked out this season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-playoffs-qualiffication-scenario-mumbai-indians-points-table-2720848-2025-05-07",
      "headline": "IPL playoffs qualification scenarios: Can Mi top table despite losing to GT?IPL 2025: Mumbai Indians can qualify for the playoffs despite losing their 12th match to Gujarat Titans on Tuesday. The five-time champions can even finish in the top two. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mi-vs-gt-hardik-pandya-ashish-nehra-fined-breaching-ipl-code-of-conduct-2720844-2025-05-07",
      "headline": "Hardik Pandya, Ashish Nehra fined for breaching IPL Code of Conduct in thrillerMumbai Indians captain Hardik Pandya was fined Rs. 24 lakh for his team's second slow over-rate offense of the season, while Gujarat Titans head coach Ashish Nehra was fined 25% of his match fees and handed a demerit point for conduct deemed \"contrary to the spirit of the game.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-playoffs-mumbai-indians-qualification-scenario-2720797-2025-05-07",
      "headline": "MI will treat every game as playoffs now: Mahela JayawardeneMumbai Indians lost to Gujarat Titans in a rain-affected game on Tuesday. The loss complicated Mumbai's  chances of qualifying for the IPL playoffs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mumbai-indians-must-win-both-games-destiny-in-ipl-2025-anil-kumble-2720784-2025-05-07",
      "headline": "Mumbai Indians must win both games to control their destiny in IPL 2025: KumbleFormer India captain and coach Anil Kumble has explained the qualification scenarios for both Mumbai Indians (MI) and Gujarat Titans (GT) after the rain-marred IPL 2025 thriller at the Wankhede."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-beat-mi-sunil-gavaskar-slam-hardik-pandya-playoff-spot-2720748-2025-05-07",
      "headline": "Hardik Pandya not bowling final over can cost MI place in playoff: Sunil GavaskarIndia great Sunil Gavaskar has slammed Mumbai Indians' captain Hardik Pandya for giving the final over to Deepak Chahar after GT secured a three-wicket win under the Duckworth-Lewis-Stern (DLS) method to go on top of the IPL points table."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/operation-sindoor-cricketers-reaction-twitter-instagram-india-vs-pakistan-terror-camps-2720749-2025-05-07",
      "headline": "Operation Sindoor: Gambhir welcomes India's strikes on Pakistan terror campsThe cricketing fraternity of India showed strong support after India conducted precision strikes in Pakistan and Pakistan-Occupied Kashmir at midnight on May 7. Operation Sindoor is estimated to have eliminated 80 terrorists through coordinated attacks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/barcelona-vs-inter-milan-champions-league-semi-final-lamine-yamal-referee-controversy-2720730-2025-05-07",
      "headline": "Hansi Flick fumes over refereeing decisions after Champions League exitBarcelona's Champions League journey ended after a dramatic semi-final defeat against Inter Milan. Controversial referee decisions sparked outrage amongst Barcelona fans including coach Hansi Flick."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mi-vs-gt-sunil-gavaskar-honours-shubman-gill-with-player-of-match-for-captaincy-2720721-2025-05-07",
      "headline": "MI vs GT: Sunil Gavaskar honours Shubman Gill with Player of the Match for captaincyIn a rain-affected thriller at Wankhede, Shubman Gill showcased maturity with the bat and sharp leadership on the field to steer Gujarat Titans to a narrow three-wicket DLS win over Mumbai Indians, ending their six-match winning streak.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-gt-hardik-pandya-reaction-no-balls-wankhede-mumbai-2720642-2025-05-07",
      "headline": "Hardik Pandya rues multiple no-balls in MI's loss to GT: A crime in T20sMI skipper Hardik Pandya rued the multiple no-balls his side bowled during their loss to GT at the Wankhede stadium on Tuesday, May 6. MI's winning streak was halted by GT, who moved to the top of the table. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/champions-league-inter-milan-vs-barcelona-semifinal-report-score-san-siro-2720671-2025-05-07",
      "headline": "Champions League: Inter Milan break Barcelona hearts in thriller, reach finalInter Milan reached the Champions League final after a dramatic 4-3 extra-time win over Barcelona, in the semi-final second leg at San Siro. Late goals from Francesco Acerbi and Davide Frattesi completed Inter's comeback on a night of high drama."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-gt-match-report-rain-effected-playoffs-hopes-mumbai-2720640-2025-05-07",
      "headline": "IPL 2025: GT win rain-affected thriller to hurt MI's playoff hopesIn a rain-curtailed thriller at Wankhede, Gujarat Titans edged past Mumbai Indians via DLS, snapping MI's winning streak. Despite GT's top-order brilliance, it was Rahul Tewatia and Gerald Coetzee who sealed the tense final-over win under pressure."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}