{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/term-insurance-policy-duration-30-40-years-waste-money-how-to-choose-financial-planning-personal-savings-2775908-2025-08-24",
      "headline": "The hidden catch in 40-year term insurance policies and how to choose betterBuying a 40-year term insurance policy is like paying rent for a house you'll never live in that long. It feels safe, but often it's money that could be better used elsewhere. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-federal-reserve-chair-jerome-powell-signals-possible-september-rate-cut-cites-rising-job-market-risks-2775428-2025-08-22",
      "headline": "US Fed chair signals possible September rate cut, cites rising job market risksUS Federal Reserve Chair Jerome Powell's comments open the door to a rate cut at the Fed's September 16-17 meeting, but also put heavy weight on jobs and inflation reports that will be received before then."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/schengen-visa-price-hike-europe-trip-plan-costly-rise-hike-upset-trip-budget-2775365-2025-08-22",
      "headline": "Planning Europe trip? Schengen visa hike may upset your trip budgetThe Schengen visa allows travellers to visit 29 European countries for up to 90 days within a 180-day period. Applicants must submit standard documents, including travel plans, insurance, and financial proof."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/avadhut-sathe-sebi-raid-pune-finfluencer-karjat-trading-academy-2775356-2025-08-22",
      "headline": "Sebi strikes at finfluencer Avadhut Sathe's Karjat Trading AcademyThe action followed complaints that penny stocks were being promoted during his training sessions, allegedly presented as classroom examples while encouraging students to invest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/which-bank-offers-higher-1-year-fd-see-rates-from-hdfc-icici-sbi-and-3-others-2775342-2025-08-22",
      "headline": "Which bank offers higher 1-year FD? See rates from HDFC, ICICI, SBI and 3 othersMost lenders usually announce similar interest rates on one-year deposits, making it seem as if there isn't much of a difference in where you invest. However, a closer look at the latest rates reveals small but meaningful variations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-694-points-lower-nifty-below-25000-asian-paints-down-2-percent-2775268-2025-08-22",
      "headline": "Sensex closes 694 points lower, Nifty below 25,000; Asian Paints down 2%The S&P BSE Sensex closed 694 points lower at 81.306.85 points, while the NSE Nifty50 declined by 213.65 points to end at 24,870.10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/this-investor-cut-his-rs-10-lakh-tax-bill-to-0-heres-the-trick-2775257-2025-08-22",
      "headline": "This investor cut his Rs 10 lakh tax bill to 0. Here's howMany taxpayers assume that once the financial year ends, their chance to save tax is gone.and Ramesh was no exception. But instead of rushing, he used a little-known route that brought his tax bill down to nothing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/upcoming-ipos-vikran-engineering-anlon-healthcare-market-listings-gmp-patel-vikram-solar-gem-shreeji-2775259-2025-08-22",
      "headline": "Dalal Street gears up for busy week with 5 market debuts, 2 IPOs in pipelineMangal Electrical Industries is set to debut on August 28 after finalising its allotment on August 25. Patel Retail, Vikram Solar, Gem Aromatics, and Shreeji Shipping Global will all list on August 26."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wealthy-asian-families-bet-big-on-crypto-report-2775211-2025-08-22",
      "headline": "Wealthy Asian families bet big on crypto: ReportThe growing interest comes as Bitcoin recently hit an all-time high of over $124,000. New rules, such as Hong Kong's stablecoin legislation and the United States' GENIUS Act, have further boosted confidence in the sector."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/money-based-gaming-ban-rocks-advertising-sports-sponsorships-whats-at-stake-2775202-2025-08-22",
      "headline": "Real-money gaming ban rocks advertising, sports sponsorships: What's at stake?The rise of money-based platforms created billions in advertising spend, now facing a sudden halt. This article examines how the ban on real-money gaming is reshaping India's advertising, sports sponsorships, and emerging e-sports opportunities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/cibil-credit-score-rating-how-to-improve-loans-emis-transparent-trans-union-personal-finance-2775191-2025-08-22",
      "headline": "Credit score confusion: Is CIBIL transparent enough in deciding your financial fate?The credit score by CIBIL can decide whether someone gets a car loan, a home loan, or even a credit card. Yet, very few actually know how CIBIL works or who controls it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-2024-25-comparing-deductions-under-old-and-new-tax-regime-2775132-2025-08-22",
      "headline": "ITR filing 2024–25: Comparing deductions under old and new tax regimeFiling your Income Tax Return for FY 2024–25? Before you decide on old or new tax regime, it's important to know how deductions differ. The right choice could help reduce your taxable income and overall tax burden."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kartik-aaryan-checks-off-bucket-list-attends-coldplays-london-concert-viral-video-2775909-2025-08-24",
      "headline": "Kartik Aaryan checks off bucket list as he attends Coldplay's London concert. WatchKartik Aryan's London trip just turned special after he attended the Coldplay concert. The actor shared a video from the grand event at Wembley Stadium and expressed his joy. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-team-backtracks-amid-confusion-over-actor-malaysia-meet-and-greet-event-coolie-2775905-2025-08-24",
      "headline": "Rajinikanth's team backtracks amid confusion over actor's meet and greet eventAfter Rajinikanth's team claimed that actor's Malaysia's meet and greet event as fake, they backtracked. This came after the organisers issued a statement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/mughal-e-azam-epic-clash-celebrating-indias-composite-culture-dilip-kumar-madhubala-2775610-2025-08-24",
      "headline": "Mughal-e-Azam: Epic clash celebrating India's composite cultureMughal-e-Azam remains an immortal cinematic masterpiece, blending epic father-son conflict, timeless romance, and iconic music with grand visuals that celebrate India's composite culture. Its powerful performances, unforgettable dialogues, and cultural resonance ensure its enduring legacy across generations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karan-johar-slams-podcasters-inviting-guests-disrespect-film-industr-lengthy-note-2775893-2025-08-24",
      "headline": "KJo slams podcasters inviting guests who disrespect film industry: Needs to stopKaran Johar shared a note criticising podcasters who, he said, invite guests to speak negatively about the 'hardworking' members of the film fraternity. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/emily-in-paris-assistant-director-diego-borella-dies-47-filming-italy-2775803-2025-08-23",
      "headline": "Emily in Paris assistant director dies at 47 while filming in ItalyDiego Borella, the Assistant Director of 'Emily in Paris', died on August 22, while working on the fifth season of the series in Venice, Italy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-mother-in-law-shows-off-dance-moves-fans-praise-her-confidence-2775782-2025-08-23",
      "headline": "SRK's mother-in-law shows-off dance moves, fans praise her confidence. WatchActor Shah Rukh Khan's mother-in-law was captured dancing with her son in a viral video. Fans says, now they understand where Gauri gets her confidence from."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-trial-2-trailer-kajol-jisshu-sengupta-tense-battle-takes-centre-stage-2775738-2025-08-23",
      "headline": "The Trial 2 trailer: Kajol and Jisshu Sengupta's marital battle takes centre stageActor Kajol returns with Season 2 of 'The Trial: Pyaar, Kanoon, Dhokha' on JioHotstar. The trailer teases more twists, courtroom clashes, and political intrigue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-bads-of-bollywood-lakshya-lalwani-sahher-bambba-chemistry-shines-in-badli-si-hawa-track-2775720-2025-08-23",
      "headline": "The Ba***ds of Bollywood: Lakshya, Sahher's chemistry shines in Badli Si Hawa trackThe first song from Aryan Khan's upcoming release 'The Ba***ds of Bollywood' is out. Titled 'Badli Si Hawa', the track highlights the chemistry between Lakshya and Sahher Bambba. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/daisy-shah-says-ex-partner-objected-to-her-working-with-male-co-stars-2775709-2025-08-23",
      "headline": "Daisy Shah says ex-partner objected to her working with male co-starsActor Daisy Shah recently spoke about having been in two relationships with toxic men. Here's what she shared."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-when-and-where-to-watch-salman-khan-show-confirmed-contestants-and-more-2775708-2025-08-23",
      "headline": "BB 19: When and where to watch Salman Khan show, confirmed contestants and moreWith just a day left for the grand premiere of Salman Khan-hosted 'Bigg Boss 19', fans are excited to know more about the show and the stars entering the show as contestants. Read to know more here.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-team-denies-malaysia-meet-and-greet-fake-unauthorised-2775685-2025-08-23",
      "headline": "Rajinikanth's team denies actor's ties with Malaysia meet and greet, calls it fakeActor Rajinikanth's team has dismissed reports of a meet and greet in Malaysia. In a statement on social media, they called it fake and unauthorised. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/k-town-3-0-mumbai-taemin-super-junior-de-yedam-debut-indian-kpop-festival-2775689-2025-08-23",
      "headline": "Taemin and D&E to perform in India for first time at K-Town 3.0Mumbai will host K-Town 3.0, a major Korean cultural festival, on November 1, 2025. The event marks significant K-pop debuts in India and highlights the rising Hallyu wave."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/shruti-haasan-reacts-to-unfair-tag-on-coolie-role-preethi-its-someone-elses-vision-lokesh-kanagaraj-rajinikanth-2775669-2025-08-23",
      "headline": "Shruti Haasan reacts to unfair tag on Coolie role: It's someone else's visionActor Shruti Haasan responded to a fan who asked if her role in Rajinikanth's 'Coolie' was unfair. The actor wrote how it was all about someone else's vision. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saira-banu-joins-x-on-81st-birthday-to-talk-about-life-memories-of-dilip-kumar-2775670-2025-08-23",
      "headline": "Saira Banu joins X on 81st birthday to talk about life, memories of Dilip saabVeteran actor Saira Banu celebrated her 81st birthday on August 23. Marking the occasion, she made her debut on X, and shared a heartfelt photograph with her late husband, Dilip Kumar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/akshay-kumar-saif-ali-khan-reunite-after-17-years-haiwaan-shoot-2775636-2025-08-23",
      "headline": "Khiladi Akshay, Anaari Saif reunite after 17 years as they start Haiwaan shootAfter 17 years, Akshay Kumar and Saif Ali Khan have come together once again for the upcoming film 'Haiwaan'. Helmed by Priyadarshan, the movie commenced shooting today in Kochi, Kerala.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karan-johar-praises-siddhant-chaturvedi-triptii-dimri-complex-roles-in-dhadak-2-thanks-censor-board-2775634-2025-08-23",
      "headline": "KJo praises Siddhant, Triptii's complex roles in Dhadak 2, thanks censor boardKaran Johar, in a lengthy note, gave a shout-out to the entire team of 'Dhadak 2', including leads Siddhant Chaturvedi and Triptii Dimri.  He even thanked the censor board for their guidance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/paradha-review-an-honest-non-preachy-film-that-lays-bare-everyday-patriarchy-2775612-2025-08-23",
      "headline": "Paradha review: An honest, non-preachy film that lays bare everyday patriarchyRelease Date:Fri Aug 22, 2025Paradha movie review: Director Praveen Kandregula's 'Paradha', starring Anupama Parameswaran, Darshana Rajendran and Sangeetha Krish, is a thoughtful film on patriarchy, women coming out of their shells and sisterhood. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/25-years-later-smriti-irani-amar-upadhyay-relive-kyunki-saas-bhi-kabhi-bahu-thi-scene-2775609-2025-08-23",
      "headline": "25 years later, Smriti Irani and Amar Upadhyay relive their iconic Kyunki sceneActor-politician Smriti Irani's scene from 'Kyunki Saas Bhi Kabhi Bahu Thi', in which Tulsi and Mihir accidentally collide, was a firm favourite among fans in the early 2000s."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/bollywood-swipes-right-on-love-again-saiyaara-metro-in-dino-param-sundari-sidharth-malhotra-trade-expert-metro-in-dino-2774604-2025-08-23",
      "headline": "Bollywood swipes right on love again: Films rediscover romance but for how long?With the latest romantic releases like 'Saiyaara', 'Metro In Dino', Bollywood is witnessing a fresh wave of romance on the big screen. Directors and actors agree that romance never truly disappeared-it just evolved with changing times."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/son-claims-in-up-dowry-murder-case-greater-noida-papa-killed-mummy-by-burning-her-with-lighter-2775870-2025-08-24",
      "headline": "Papa killed mummy by burning her with lighter, claims son in UP dowry death caseRecalling the horror, the boy claimed that his father and grandmother poured a substance on his mother, slapped her, and then set her ablaze."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rajasthan-flood-news-death-rain-alert-weather-kota-bundi-tonk-army-ndrf-2775892-2025-08-24",
      "headline": "2 dead, hundreds evacuated as rain, flood ravage Rajasthan; Army on groundSeveral areas in Rajasthan are facing flood-like conditions, leaving two dead, displacing hundreds, submerging villages, crippling connectivity, and prompting large-scale rescue operations."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/even-rahul-gandhis-colleagues-fear-his-rubbish-talk-may-haunt-congress-kiren-rijiju-2775900-2025-08-24",
      "headline": "Even Rahul Gandhi's colleagues fear his rubbish talk may haunt Congress: RijijuKiren Rijiju claimed that even Rahul Gandhi's colleagues fear he might end up speaking \"rubbish,\" which could later come back to haunt the party."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/dont-want-to-speak-bad-of-her-maxwell-hints-at-epstein-princess-diana-date-setup-glbs-2775868-2025-08-24",
      "headline": "Don't want to speak bad of her: Maxwell hints at Epstein–Princess Diana date setupGhislaine Maxwell claims Princess Diana may have been introduced to Jeffrey Epstein at a London event, though unsure if they met. The remark emerged amid renewed scrutiny over Epstein-related investigations and Trump ties.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/real-money-gaming-blanket-ban-real-promotion-regulation-of-online-gaming-bill-2025-employment-lakhs-revenue-2775531-2025-08-24",
      "headline": "Jobless overnight, but families to feed: The human cost of India's gaming banThe ban on real-money online gaming is upending real lives. Thousands of professionals are desperately looking for jobs as their companies hit the dead end. The sector also sustained people earning from games of skills, like millions in India do from the stock market. This is the untold story of how the government's blanket ban on real money gaming platforms has hit lakhs of people."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/after-washington-pentagon-planning-military-deployment-in-chicago-report-glbs-2775869-2025-08-24",
      "headline": "After Washington, Pentagon planning military deployment in Chicago: ReportThe Pentagon is planning a possible National Guard deployment to Chicago as Trump criticizes crime, homelessness, and immigration. Local leaders reject federal intervention and highlight declining crime rates and political motives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/is-bccis-shubman-gill-all-format-captaincy-plan-feasible-in-modern-era-2775728-2025-08-24",
      "headline": "3 formats, 1 captain: Is BCCI's Shubman Gill plan feasible in modern era?After including Shubman Gill in India's Asia Cup squad and reinstating him as the vice captain, the BCCI is planning to make him the all-format leader in future. However, is that idea feasible in modern day cricket?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/greater-noida-woman-nikki-set-ablaze-by-husband-vipin-and-in-laws-over-dowry-dies-2775798-2025-08-23",
      "headline": "UP woman killed over dowry; video shows her being dragged, beaten up, set ablazeThe victim's sister, married into the same family, alleged that on Thursday night, Nikki was beaten unconscious by her husband Vipin and then set on fire using an inflammable substance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/mughal-e-azam-epic-clash-celebrating-indias-composite-culture-dilip-kumar-madhubala-2775610-2025-08-24",
      "headline": "Mughal-e-Azam: Epic clash celebrating India's composite cultureMughal-e-Azam remains an immortal cinematic masterpiece, blending epic father-son conflict, timeless romance, and iconic music with grand visuals that celebrate India's composite culture. Its powerful performances, unforgettable dialogues, and cultural resonance ensure its enduring legacy across generations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/term-insurance-policy-duration-30-40-years-waste-money-how-to-choose-financial-planning-personal-savings-2775908-2025-08-24",
      "headline": "The hidden catch in 40-year term insurance policies and how to choose betterBuying a 40-year term insurance policy is like paying rent for a house you'll never live in that long. It feels safe, but often it's money that could be better used elsewhere. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2025-day-1-order-of-play-novak-djokovic-aryna-sabalenka-shelton-medvedev-2775891-2025-08-24",
      "headline": "US Open 2025: Novak Djokovic and Aryna Sabalenka headline opening dayNovak Djokovic, Aryna Sabalenka, and Emma Raducanu are among the star attractions on the opening day of the US Open. Djokovic begins his pursuit of a record-extending 25th Grand Slam singles title at the venue where he last lifted a major trophy — defeating Daniil Medvedev in the final two years ago to claim his 24th."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/drdo-conducts-maiden-flight-test-of-iadws-strengthening-indias-air-defence-shield-2775910-2025-08-24",
      "headline": "India strengthens air shield with first test of multi-layered defence systemThe Integrated Air Defence Weapon System is a multi-layered air defence system comprising entirely indigenous Quick Reaction Surface-to-Air Missiles, Advanced Very Short Range Air Defence System missiles, and a high-power laser-based Directed Energy Weapon. These systems are designed to form the integrated air defence shield Sudarshan Chakra, announced by PM Modi on Independence Day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/badminton-pbl-restart-bai-sanjay-mishra-interview-2775704-2025-08-24",
      "headline": "Shut down for 5 years, Premier Badminton League set for a comeback in new avatarThe Badminton Association of India is set to cut ties with the promoters of the Premier Badminton League. The BAI wants to start the competition on its own, within the next year."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/s-jaishankar-slams-us-for-getting-closer-to-pakistan-reminds-it-of-ladens-hideout-in-abbottabad-2775835-2025-08-23",
      "headline": "Osama bin Laden reminder: Jaishankar's dig at US, Pak for overlooking historyExternal Affairs Minister S Jaishankar was referring to the 2011 killing of Osama bin Laden, who orchestrated the 9/11 terror attacks, and said the military that Trump is trusting now was the one who sheltered the dreaded terrorist deep inside their house."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kiren-rijiju-recalls-modi-stand-arrested-leaders-removal-bill-2775830-2025-08-23",
      "headline": "No exception for PM: Kiren Rijiju recalls PM Modi's stand on arrested leaders billUnion Minister Kiren Rijiju said PM Narendra Modi had rejected granting any special protection to the prime minister in the newly introduced bill that sought the removal of ministers if they are arrested for 30 days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/indian-elite-school-fees-global-prices-local-salaries-2775820-2025-08-24",
      "headline": "Are Indian school fees the world's highest?From Delhi to Dubai, parents pay the same amount on school bills. But for Indians, the financial burden is far heavier and the returns often don't match the price tag."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/amit-shah-corrupt-neta-removal-bills-opposition-ministers-arrest-2775699-2025-08-23",
      "headline": "12 Opposition ministers arrested since 2014, most would've lost post under new billNo sitting ministers from the BJP or NDA were arrested in this period; 10 of the arrests were made by the CBI and the ED."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-516-22-08-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/chandrababu-naidu-gave-many-twists-and-turns-in-politics-india-blocs-veep-pick-2775821-2025-08-23",
      "headline": "Chandrababu Naidu gave many twists and turns in politics: INDIA bloc's Veep pickChandrababu Naidu's party has pledged support to the ruling bloc's vice presidential candidate. Sudershan Reddy, however, suggested that the Andhra Pradesh Chief Minister's history has \"given many twists and turns in politics\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/russia-captures-two-more-villages-in-ukraines-donetsk-amid-ongoing-conflict-glbs-2775862-2025-08-24",
      "headline": "Russia captures two more villages in Ukraine's Donetsk amid ongoing conflictRussian forces claim control of two more villages in Donetsk, as Ukraine reports retaking Zelenyi Hai near Dnipropetrovsk and ongoing operations to repel further advances along the eastern front."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-team-backtracks-amid-confusion-over-actor-malaysia-meet-and-greet-event-coolie-2775905-2025-08-24",
      "headline": "Rajinikanth's team backtracks amid confusion over actor's meet and greet eventAfter Rajinikanth's team claimed that actor's Malaysia's meet and greet event as fake, they backtracked. This came after the organisers issued a statement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/you-dont-like-it-you-dont-buy-jaishankars-jibe-at-us-over-russian-oil-purchase-glbs-2775860-2025-08-24",
      "headline": "You don't like it, you don't buy: Jaishankar hits out at US over Russian oil purchaseExternal Affairs Minister S Jaishankar defended India's oil trade and strategic autonomy amid US tariffs, rejecting mediation with Pakistan and criticising accusations of profiteering from Russian oil purchases."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/former-sri-lankan-president-wickremesinghe-shifted-to-icu-after-court-remand-glbs-2775867-2025-08-24",
      "headline": "Former Sri Lankan President Wickremesinghe shifted to ICU after court remandWickremesinghe, 76, was transferred to the main Magazine Remand Prison just before midnight on Friday, following an order from the Colombo Fort Magistrate's Court remanding him until August 26."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2025-mens-singles-preview-sinner-vs-alcaraz-djokovic-2775851-2025-08-24",
      "headline": "US Open 2025: Sincaraz to continue dominance or will the Djoker have a say?The US Open men's singles event is all set to be dominated by the rivalry between Jannik Sinner and Carlos Alcaraz. While the duo may be the favourites, the third spot remains open and a certain Novak Djokovic could still have a say in proceedings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kartik-aaryan-checks-off-bucket-list-attends-coldplays-london-concert-viral-video-2775909-2025-08-24",
      "headline": "Kartik Aaryan checks off bucket list as he attends Coldplay's London concert. WatchKartik Aryan's London trip just turned special after he attended the Coldplay concert. The actor shared a video from the grand event at Wembley Stadium and expressed his joy. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-team-backtracks-amid-confusion-over-actor-malaysia-meet-and-greet-event-coolie-2775905-2025-08-24",
      "headline": "Rajinikanth's team backtracks amid confusion over actor's meet and greet eventAfter Rajinikanth's team claimed that actor's Malaysia's meet and greet event as fake, they backtracked. This came after the organisers issued a statement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/mughal-e-azam-epic-clash-celebrating-indias-composite-culture-dilip-kumar-madhubala-2775610-2025-08-24",
      "headline": "Mughal-e-Azam: Epic clash celebrating India's composite cultureMughal-e-Azam remains an immortal cinematic masterpiece, blending epic father-son conflict, timeless romance, and iconic music with grand visuals that celebrate India's composite culture. Its powerful performances, unforgettable dialogues, and cultural resonance ensure its enduring legacy across generations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karan-johar-slams-podcasters-inviting-guests-disrespect-film-industr-lengthy-note-2775893-2025-08-24",
      "headline": "KJo slams podcasters inviting guests who disrespect film industry: Needs to stopKaran Johar shared a note criticising podcasters who, he said, invite guests to speak negatively about the 'hardworking' members of the film fraternity. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cpl-2025-tim-david-controversial-dismissal-mars-knight-riders-st-lucia-2775907-2025-08-24",
      "headline": "CPL: Tim David's controversial dismissal mars Knight Riders' win over St LuciaStar Australia batter Tim David was controversially dismissed during Match 10 of the Caribbean Premier League 2025 (CPL 2025) between Trinbago Knight Riders and Saint Lucia Kings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-t20-asia-cup-2025-spin-heavy-squad-rashid-khan-captain-2775906-2025-08-24",
      "headline": "Asia Cup: Rashid Khan to lead spin-heavy Afghanistan squad as Ghazanfar returnsA full-strength Afghanistan team is set to compete in the 2025 Asia Cup, following the announcement of their 17-member squad by the ACB on Sunday (August 24)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2025-novak-djokovic-time-rivals-grand-slam-feature-2775716-2025-08-24",
      "headline": "Novak Djokovic battles time, rivals: Can his US Open glory still be realistic?Novak Djokovic enters the 2025 US Open chasing a record 25th Grand Slam, battling not only Carlos Alcaraz and Jannik Sinner but also the inevitability of time at the age of 38. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ab-de-villiers-questions-shreyas-iyer-asia-cup-2025-omission-2775896-2025-08-24",
      "headline": "Shreyas Iyer's Asia Cup omission is weird: De Villiers hints at off-field factorsSouth African batting legend AB de Villiers has labelled Shreyas Iyer's omission from India's Asia Cup squad as \"weird\", hinting that the decision may have been shaped by considerations beyond just on-field form and performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2025-day-1-order-of-play-novak-djokovic-aryna-sabalenka-shelton-medvedev-2775891-2025-08-24",
      "headline": "US Open 2025: Novak Djokovic and Aryna Sabalenka headline opening dayNovak Djokovic, Aryna Sabalenka, and Emma Raducanu are among the star attractions on the opening day of the US Open. Djokovic begins his pursuit of a record-extending 25th Grand Slam singles title at the venue where he last lifted a major trophy — defeating Daniil Medvedev in the final two years ago to claim his 24th."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/inspired-by-cristiano-ronaldo-deus-brothers-padel-glory-2775719-2025-08-24",
      "headline": "Inspired by Ronaldo, the Deus Brothers power their pursuit of Padel gloryIn an exclusive interaction with India Today, the Deus brothers, Miguel and Nuno, spoke about how Cristiano Ronaldo is an inspiration for them and their journey as a team in the world of Padel. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sunil-gavaskar-statue-unveiled-wankhede-mca-sharad-pawar-cricket-museum-2775875-2025-08-24",
      "headline": "Sunil Gavaskar statue unveiled at Wankhede during MCA museum inaugurationLegendary cricketer Sunil Gavaskar was visibly moved as his statue was unveiled at Wankhede Stadium on Saturday, during the inauguration of the MCA Sharad Pawar Cricket Museum."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/cristiano-ronaldo-100-goals-al-nassr-saudi-super-cup-final-penalty-shootout-loss-2775871-2025-08-24",
      "headline": "Ronaldo scores 100th goal for Al-Nassr but loses Saudi Super Cup finalA heartbreaking scene was captured on camera as Al-Nassr's hopes of winning the Saudi Super Cup slipped away. In the viral video, Cristiano Ronaldo appears visibly devastated, murmuring to himself with a distant look."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2025-womens-singles-preview-aryna-sabalenka-iga-swiatek-2775795-2025-08-24",
      "headline": "Aryna Sabalenka favourite, but Swiatek, Gauff could rewrite predictionsThe 2025 US Open promises a thrilling showdown, with Aaryna Sabalenka aiming to defend her title against top contenders like Iga Swiatek, Coco Gauff, Jessica Pegula, and rising star Mirra Andreeva. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/badminton-pbl-restart-bai-sanjay-mishra-interview-2775704-2025-08-24",
      "headline": "Shut down for 5 years, Premier Badminton League set for a comeback in new avatarThe Badminton Association of India is set to cut ties with the promoters of the Premier Badminton League. The BAI wants to start the competition on its own, within the next year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/inspired-by-cristiano-ronaldo-deus-brothers-padel-glory-2775719-2025-08-24",
      "headline": "Inspired by Ronaldo, the Deus Brothers power their pursuit of Padel gloryIn an exclusive interaction with India Today, the Deus brothers, Miguel and Nuno, spoke about how Cristiano Ronaldo is an inspiration for them and their journey as a team in the world of Padel. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sunil-gavaskar-statue-unveiled-wankhede-mca-sharad-pawar-cricket-museum-2775875-2025-08-24",
      "headline": "Sunil Gavaskar statue unveiled at Wankhede during MCA museum inaugurationLegendary cricketer Sunil Gavaskar was visibly moved as his statue was unveiled at Wankhede Stadium on Saturday, during the inauguration of the MCA Sharad Pawar Cricket Museum."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/cristiano-ronaldo-100-goals-al-nassr-saudi-super-cup-final-penalty-shootout-loss-2775871-2025-08-24",
      "headline": "Ronaldo scores 100th goal for Al-Nassr but loses Saudi Super Cup finalA heartbreaking scene was captured on camera as Al-Nassr's hopes of winning the Saudi Super Cup slipped away. In the viral video, Cristiano Ronaldo appears visibly devastated, murmuring to himself with a distant look."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2025-womens-singles-preview-aryna-sabalenka-iga-swiatek-2775795-2025-08-24",
      "headline": "Aryna Sabalenka favourite, but Swiatek, Gauff could rewrite predictionsThe 2025 US Open promises a thrilling showdown, with Aaryna Sabalenka aiming to defend her title against top contenders like Iga Swiatek, Coco Gauff, Jessica Pegula, and rising star Mirra Andreeva. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/badminton-pbl-restart-bai-sanjay-mishra-interview-2775704-2025-08-24",
      "headline": "Shut down for 5 years, Premier Badminton League set for a comeback in new avatarThe Badminton Association of India is set to cut ties with the promoters of the Premier Badminton League. The BAI wants to start the competition on its own, within the next year."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}