{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/who-will-inherit-ratan-tatas-legacy-in-the-tata-group-2614817-2024-10-10",
      "headline": "Who will inherit Ratan Tata's legacy in the Tata Group?Ratan Tata, a towering icon of industry and philanthropy who died on Wednesday, leaves behind a significant legacy and an empty chair. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-q2-results-dividend-set-at-rs-10-per-share-payout-november-5-record-date-october-18-2614783-2024-10-10",
      "headline": "TCS Q2 results: Dividend set at Rs 10 per share. Check key datesTCS Q2 results: The company reported a 5% year-on-year (YoY) rise in net profit, amounting to Rs 11,909 crore, compared to Rs 11,342 crore in the corresponding quarter of the previous year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/ratan-tata-was-a-great-human-being-very-humble-narayana-murthy-2614774-2024-10-10",
      "headline": "Ratan Tata was a great human being, very humble: Narayana MurthyIn an exclusive interview with India Today TV, Infosys co-founder Narayana Murthy paid tribute to late industrialist, Ratan Tata. Murthy lauded Ratan Tata as a 'compassionate human being who transcended financial status and official power.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/ratan-tatas-legacy-as-humanitarian-bigger-than-as-industrialist-birla-group-chief-2614740-2024-10-10",
      "headline": "Ratan Tata's legacy as humanitarian bigger than as industrialist: Birla Group chiefIn an exclusive interview with India Today TV, Kumar Mangalam Birla, chairperson of the Aditya Birla Group, reflected on the life and legacy of Ratan Tata."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-q2-results-dividend-it-firm-consolidated-net-profit-up-5-percent-yoy-to-rs-11909-crore-2614736-2024-10-10",
      "headline": "TCS Q2 Results: IT firm's net profit up 5% YoY to Rs 11,909 crore The company's net profit reached Rs 11,909 crore, up from Rs 11,342 crore in the same period last year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-successor-at-tata-trusts-who-are-the-frontrunners-noel-venu-srinivasan-vijay-singh-2614721-2024-10-10",
      "headline": "Ratan Tata's successor at Tata Trusts: Who are the frontrunners?The trusts, particularly the Sir Dorabji Tata Trust and Sir Ratan Tata Trust, collectively hold 66% of Tata Sons, making them the company's primary shareholders."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-end-marginally-higher-banking-metal-stocks-shine-2614706-2024-10-10",
      "headline": "Sensex, Nifty end marginally higher; banking, metal stocks shine The S&P BSE Sensex added 144.31 points to close at 81,611.41, while the NSE Nifty50 gained 16.50 points to end at 24,998.45. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-family-tree-look-at-its-members-from-jamsetji-to-noel-tata-2614692-2024-10-10",
      "headline": "Ratan Tata family tree: Look at its members from Jamsetji to Noel TataRatan Tata was born on December 28, 1937, and belonged to one of India's most well-known business families."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-death-kumar-mangalam-birla-pays-tribute-lost-true-visionary-2614609-2024-10-10",
      "headline": "Kumar Mangalam Birla pays tribute to Ratan Tata: Lost true visionaryKumar Mangalam Birla, the Chairman of the Aditya Birla Group, expressed his sorrow and paid tribute to Ratan Tata, highlighting the long-standing relationship between their families and the impact Ratan Tata had on the nation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/star-health-confirms-data-breach-clears-ciso-of-wrongdoing-amid-hacker-claims-2614583-2024-10-10",
      "headline": "Star Health confirms data breach, clears CISO of wrongdoing amid claimsStar Health Insurance released a statement acknowledging the cyberattack. The company confirmed that it was a victim of a targeted malicious cyberattack, which led to unauthorised access to certain data."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-death-group-succession-plan-rs-3800-crore-empire-noel-tata-n-chandrasekaran-2614554-2024-10-10",
      "headline": "Ratan Tata dies: Who will lead Rs 30 lakh crore Tata Group?Ratan Tata's absence leaves a gap, and the question of succession is more important than ever, given that he had no children of his own"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-death-mumbai-tata-group-philanthropy-investments-education-technology-steel-2614512-2024-10-10",
      "headline": "Remembering Ratan Tata, a beacon of philanthropyRatan Tata death: Ratan Tata played a key role with his philanthropic efforts in various sectors, including healthcare, technology, disaster relief and social welfare. Here's how Ratan Tata made a profound impact through his philanthropy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-death-visionary-who-fuelled-indias-startup-revolution-paytm-ola-firstcry-upstox-2614508-2024-10-10",
      "headline": "Ratan Tata: The visionary who fuelled India's startup revolutionEven after his retirement, Ratan Tata continued to embody the spirit of entrepreneurship, emerging as a formidable investor and mentor to a multitude of startups across India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-q2-results-today-press-conference-doubtful-after-ratan-tatas-demise-2614473-2024-10-10",
      "headline": "TCS Q2 results today, press conference doubtful after Ratan Tata's demiseRatan Naval Tata, one of India's most influential industrialists and chairman emeritus of the Tata Group, passed away late Wednesday night at the age of 86."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-price-today-october-10-2024-precious-metals-record-hike-on-mcx-2614472-2024-10-10",
      "headline": "Gold, silver price today, October 10, 2024: Precious metals record hike on MCXGold Price Today October 10, 2024: Both gold and silver are trading on the higher side of the Multi Commodity Exchange (MCX) on Thursday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-higher-tata-shares-in-spotlight-after-ratan-tata-death-2614464-2024-10-10",
      "headline": "Sensex, Nifty open higher; Tata shares in spotlight after Ratan Tata's deathThe S&P BSE Sensex added 110.95 points to 81,578.05, while the NSE NIfty50 gained 19.80 points to 25,001.75. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/businessman-niranjan-hiranandani-ratan-tata-london-trip-pet-dog-industry-titan-dies-mumbai-2614460-2024-10-10",
      "headline": "When Ratan Tata cancelled London trip for his pet: Niranjan Hiranandani recountsRatan Tata death: Businessman Niranjan Hiranandani, who had invested in his friend Ratan Tata-backed Goodfellows, a companionship startup for senior citizens in 2022, recalled the veteran industrialist's down-to-earth nature."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-businessman-death-tata-group-legacy-tata-group-philanthropy-pm-modi-condoles-2614428-2024-10-10",
      "headline": "Ratan Tata: The titan who built a billion-dollar empire without chasing billionaire statusRatan Tata's legacy endures as a titan who built a billion-dollar empire while never appearing on any billionaire lists."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-death-condolences-pour-in-mukesh-ambani-adani-anand-mahindra-goenka-pm-modi-bid-farewell-2614417-2024-10-10",
      "headline": "Condolences pour in as India's business world bids farewell to Ratan TataThe former Tata Chairman had been undergoing treatment for a prolonged illness at Breach Candy Hospital in Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-death-passes-away-age-86-leader-who-took-tata-group-from-usd-5-billion-to-100-billion-2614413-2024-10-10",
      "headline": "Ratan Tata: Leader who took Tata Group from $5 billion to $100 billionRatan Tata took over as Chairman of Tata Sons in 1991, succeeding JRD Tata. At that time, the Tata Group was largely an Indian conglomerate with annual revenues of around $5 billion."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ratan-tata-accorded-state-funeral-maharashtra-chief-minister-eknath-shinde-2614425-2024-10-10",
      "headline": "Ratan Tata cremated with state honours, hundreds gather to say goodbyeRatan Tata funeral: The Maharashtra government has declared a day of mourning as a mark of respect for Ratan Tata. The legendary business leader and chairman emeritus of Tata Sons died on Wednesday at 86."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/200-kg-cocaine-worth-rs-2000-crore-seized-delhi-police-2614863-2024-10-10",
      "headline": "Cocaine worth Rs 2,000 crore, hidden in namkeen packets, seized in DelhiDelhi Police Special Cell busted a drug trafficking network, seizing 200 kg of cocaine worth Rs 2,000 crore from a Ramesh Nagar warehouse, linked to a previous seizure of 600 kg of drugs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/ratan-tata-dog-goa-pays-tribute-tata-group-mumbai-last-rites-2614944-2024-10-10",
      "headline": "Adopted from Goa, named after it: Ratan Tata's dog who sat beside his casketRatan Tata's loyal dog, Goa, paid his final respects beside the industrialist's Tricolour-draped casket, capturing the emotion of a bond. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-may-miss-opening-test-against-australia-reports-2614926-2024-10-10",
      "headline": "Rohit Sharma may miss first Test of Border Gavaskar Trophy in AustraliaRohit Sharma is likely to miss the opening Test of the Border Gavaskar Trophy 2024-25 Trophy against Australia, which is scheduled to take place in Perth from November 22. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/hamne-aapka-namak-khaya-hai-ratan-noble-tata-opinion-2614698-2024-10-10",
      "headline": "Untainted by scandal, untouched by hate: That's Ratan TataRatan Naval Tata did not succumb to the acrimonious politics often associated with public figures pawing for power and pelf."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ratan-tata-death-last-rites-narayana-murthy-learnt-lesson-in-compassionate-capitalism-2614842-2024-10-10",
      "headline": "When Narayana Murthy learnt lesson in compassionate capitalism from Ratan TataNarayana Murthy recalled an incident when he invited Ratan Tata to inaugurate an event in Karnataka's Hubli and how the former Tata Group chief's gestures taught him lessons in compassionate capitalism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/kate-middleton-first-public-engagement-chemotherapy-southport-killing-prince-william-2614914-2024-10-10",
      "headline": "Kate Middleton attends first public engagement since end of her chemotherapyKate Middleton, the Princess of Wales, made her first public engagement since completing her chemotherapy treatment, along with her husband Prince William, on a visit to Southport, where three children were killed in a knife attack in July."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ratan-tata-death-last-rites-state-funeral-parsi-rituals-in-mumbai-tata-group-zoroastrianism-beliefs-2614556-2024-10-10",
      "headline": "Ratan Tata's funeral held through Parsi ritualsRatan Tata funeral: Parsis do not cremate or bury their loved ones, unlike Hindus and Muslims, and they consider a human body as a gift of nature, which has to be returned."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/business-titan-philanthropist-ratan-tata-passed-away-october-9-mumbai-his-journey-india-today-magazine-covers-2614782-2024-10-10",
      "headline": "Ratan Tata treasure trove: His journey through India Today coversBusiness titan and philanthropist Ratan Naval Tata passed away on October 9. Ratan Tata was featured on the cover of India Today magazine six times. India Today, in its requiem, revisits the legendary journey through these cover stories."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-bangladesh-stafanie-taylor-nigar-sultana-joty-report-sharjah-2614953-2024-10-10",
      "headline": "West Indies near semis after thumping 8-wicket win vs Bangladesh Women's T20 World Cup 2024: West Indies beat Bangladesh by eight wickets in Sharjah and stayed in contention for a berth in the semi-final. Karishma Ramharack picked up four wickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/hurricane-milton-makes-landfall-in-us-causing-power-cuts-and-destroying-homes-2614775-2024-10-10",
      "headline": "Hurricane Milton fury hits Florida, 4 killed, millions left without powerThe storm arrived in Florida on Wednesday night, bringing along winds as fast as 205 kph. While the hurricane brought its share of chaos, it wasn't near a Category-5 hurricane that had threatened the state but went over the Gulf of Mexico. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-family-tree-look-at-its-members-from-jamsetji-to-noel-tata-2614692-2024-10-10",
      "headline": "Ratan Tata family tree: Look at its members from Jamsetji to Noel TataRatan Tata was born on December 28, 1937, and belonged to one of India's most well-known business families."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/jammu-and-kashmir-election-result-bjp-national-conference-alliance-omar-abdullah-on-pm-modi-article-370-statehood-2614198-2024-10-10",
      "headline": "Why Omar Abdullah is leaning towards PM ModiOmar Abdullah's relentless emotional campaign saw the National Conference (NC) win 42 seats and emerge as the biggest party in Jammu and Kashmir. Now, Omar is leaning towards the Modi-led Centre to run a smooth government. Can the reconciliatory tone also bridge a divide and forge ties?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/watch-goa-dog-adopted-by-ratan-tata-sits-beside-his-coffin-at-funeral-2614790-2024-10-10",
      "headline": "Video: Ratan Tata's dog Goa meets him for last time, rests next to his casketTata Sons Chairman Emeritus Ratan Tata's dog, Goa, which he had adopted, also paid homage to his master along with hundreds of people who came to pay their last respects to the industrialist and philanthropist in Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/south-korean-author-han-kang-2024-nobel-prize-in-literature-2614722-2024-10-10",
      "headline": "South Korean author Han Kang awarded the 2024 Nobel Prize in LiteratureThis prestigious accolade marks a significant moment for Asian literature on the global stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ratan-tata-death-personal-life-never-getting-married-simi-garewal-rendezvous-2614553-2024-10-10",
      "headline": "When Ratan Tata spoke on love, loss and lonelinessIn a rare appearance on friend Simi Garewal's talk show in 1997, the business tycoon opened up about never being married and admitted that he longed for a wife and family at times. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/vettaiyan-movie-review-rajinikanth-gets-rooted-script-tj-gnanavel-middling-drama-amitabh-bachchan-rana-daggubati-fahadh-faasil-2614602-2024-10-10",
      "headline": "Vettaiyan review: Rajinikanth gets a rooted script in Gnanavel's middling dramaReleased-Thu Oct 10, 2024Vettaiyan movie review: Director TJ Gnanavel's Vettaiyan, starring Rajinikanth, Amitabh Bachchan and Rana Daggubati, is a social commentary on extrajudicial killings. Good, solid moments get overshadowed by predictability. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/rafael-nadal-retirement-tennis-after-end-of-season-2614656-2024-10-10",
      "headline": "Tennis legend Rafael Nadal to retire after Davis Cup finals in NovemberRafael Nadal, one of the greatest tennis players in history, has announced his retirement, closing the chapter on a remarkable career that included 22 Grand Slam titles. The Spanish icon shared the news in an emotional video on social media, expressing heartfelt thanks for the support he received throughout his journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-death-group-succession-plan-rs-3800-crore-empire-noel-tata-n-chandrasekaran-2614554-2024-10-10",
      "headline": "Ratan Tata dies: Who will lead Rs 30 lakh crore Tata Group?Ratan Tata's absence leaves a gap, and the question of succession is more important than ever, given that he had no children of his own"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ratan-tata-reins-of-tata-group-jrd-tata-heart-attack-breach-candy-hospital-2614625-2024-10-10",
      "headline": "'You should take my place': When JRD Tata handed over firm's reins to Ratan TataRatan Tata death: In a 1997 interview with actor and talk show host Simi Garewal, Ratan Tata shared his insights on the lesser-known story of his takeover of Tata Sons, the holding company of the mammoth group."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/suits-shirts-only-luxury-he-allowed-himself-kumar-mangalam-birla-on-ratan-tata-2614723-2024-10-10",
      "headline": "Suits, shirts only luxury he allowed himself: Kumar Mangalam Birla on Ratan TataIn an exclusive interview with India Today TV, Kumar Mangalam Birla, chairperson of the Aditya Birla Group, paid tribute to the legendary Ratan Tata."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/ratan-tatas-legacy-revolutionising-cancer-care-in-india-one-hospital-at-a-time-2614789-2024-10-10",
      "headline": "How Ratan Tata quietly transformed cancer treatment for IndiansThe Tata Group's foray into healthcare began in 1941 with the establishment of the Tata Memorial Hospital in Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-successor-at-tata-trusts-who-are-the-frontrunners-noel-venu-srinivasan-vijay-singh-2614721-2024-10-10",
      "headline": "Ratan Tata's successor at Tata Trusts: Who are the frontrunners?The trusts, particularly the Sir Dorabji Tata Trust and Sir Ratan Tata Trust, collectively hold 66% of Tata Sons, making them the company's primary shareholders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/ratan-tata-was-a-great-human-being-very-humble-narayana-murthy-2614774-2024-10-10",
      "headline": "Ratan Tata was a great human being, very humble: Narayana MurthyIn an exclusive interview with India Today TV, Infosys co-founder Narayana Murthy paid tribute to late industrialist, Ratan Tata. Murthy lauded Ratan Tata as a 'compassionate human being who transcended financial status and official power.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/celebrity/story/rubina-dilaik-owns-ramp-walk-after-stumbling-fans-say-she-slayed-2614960-2024-10-10",
      "headline": "Rubina Dilaik owns ramp walk after stumbling, fans say, 'she slayed'  Actor Rubina Dilaik narrowly avoided a fall while walking the ramp as the showstopper for designer Archana Kochhar. Fans reacted to the viral video, praising her for her confidence and grace. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rajpal-yadav-remembers-ratan-tata-2614906-2024-10-10",
      "headline": "Rajpal Yadav reflects on Ratan Tata's legacy: No one can take his placeBollywood actor Rajpal Yadav mourned the death of Ratan Tata and expressed his grief. Speaking on October 10, the actor shared that the business tycoon had once hugged him and expressed admiration for him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/director-karthik-subbaraj-on-vettaiyan-rajinikanth-amitabh-bachchan-2614884-2024-10-10",
      "headline": "Director Karthik Subbaraj on Vettaiyan: Was a treat to watch Rajinikanth, Big BFilmmaker Karthik Subbaraj shared his thoughts on Rajinikanth's recently released film, Vettaiyan. Sharing a post on X, he praised the film's cast and crew. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/amitabh-bachchan-sharaabi-was-narrated-to-him-mid-air-kbc-16-2614881-2024-10-10",
      "headline": "Amitabh Bachchan shares Sharaabi was narrated to him mid-airAmitabh Bachchan revealed that his film Sharaabi was conceived mid-air. He shared the anecdote while hosting Kaun Banega Crorepati 16."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/samsung-issues-apology-for-lagging-innovation-vows-to-regain-competitive-edge-2614878-2024-10-10",
      "headline": "Samsung issues apology for lagging innovation, vows to regain competitive edgeSamsung Electronics has openly acknowledged its recent shortcomings in an official letter following the release of its Q3 2024 earnings guidance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/mozilla-firefox-users-beware-your-device-is-at-high-risk-and-here-is-how-you-can-fix-it-2614751-2024-10-10",
      "headline": "Mozilla Firefox users beware, your device is at high risk and here is how you can fix it  The Indian Computer Emergency Response Team has alerted Mozilla users about serious vulnerabilities that threaten device security. The government has asked these users to immediately update their software to mitigate risks posed by these flaws."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/oppo-find-x8-series-rumoured-to-feature-a-mediatek-dimensity-9400-with-ai-engine-2614696-2024-10-10",
      "headline": "Oppo Find X8 series rumoured to feature a MediaTek Dimensity 9400 with AI engine Oppo Find X8 is tipped to feature advanced AI features and a sleek design.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/features/story/openai-eyes-profit-may-restructure-itself-into-a-for-profit-entity-to-avoid-hostile-takeover-over-leaderships-2614707-2024-10-10",
      "headline": "OpenAI eyes profit, may restructure from non-profit to a for-profit entitySam Altman's OpenAI is reportedly planning to restructure the company into a for-profit entity. This has apparently been done so that the non-profit that currently looks over OpenAI can not do a \"hostile takeover\" over the leadership."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-bangladesh-stafanie-taylor-nigar-sultana-joty-report-sharjah-2614953-2024-10-10",
      "headline": "West Indies near semis after thumping 8-wicket win vs Bangladesh Women's T20 World Cup 2024: West Indies beat Bangladesh by eight wickets in Sharjah and stayed in contention for a berth in the semi-final. Karishma Ramharack picked up four wickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cameron-green-to-miss-border-gavaskar-trophy-2024-25-2614950-2024-10-10",
      "headline": "Cameron Green set to miss entire Border Gavaskar Trophy: ReportsAustralia all-rounder Cameron Green is likely to miss the entire Border Gavaskar Trophy 2024-25 as he's likely to fly to New Zealand to undergo a surgery for his back injury."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-harry-brook-joe-root-multan-test-2614923-2024-10-10",
      "headline": "Harry Brook 'lost for words' after 317 in Multan Test, credits Joe RootPAK vs ENG: Harry Brook was lost for words after he became the sixth English batter to score a triple hundred in Test cricket. The right-hander made 317 runs in Multan with 29 fours and three sixes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-may-miss-opening-test-against-australia-reports-2614926-2024-10-10",
      "headline": "Rohit Sharma may miss first Test of Border Gavaskar Trophy in AustraliaRohit Sharma is likely to miss the opening Test of the Border Gavaskar Trophy 2024-25 Trophy against Australia, which is scheduled to take place in Perth from November 22. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-on-rafael-nadals-retirement-shanghai-masters-2614920-2024-10-10",
      "headline": "Carlos Alcaraz reacts to Rafael Nadal's retirement: Tough to accept itWorld number two Tennis player Carlos Alcaraz gave his first reaction on the retirement of his idol Rafael Nadal from the game. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/arctic-open-lakshya-sen-knocked-out-in-round-of-16-2614887-2024-10-10",
      "headline": "Lakshya Sen knocked out in Round of 16, George loses to ChristieStar Indian shuttler Lakshya Sen was knocked out of the Arctic Open badminton tournament after a hard-fought match against Chou Tien Chen of Chinese Taipei in the pre-quarterfinals on Thursday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/golf/story/diksha-dagar-leads-home-challenge-in-indian-open-tamburlini-among-strong-contenders-2614885-2024-10-10",
      "headline": "Diksha Dagar leads home challenge in Indian Open, Tamburlini among strong contenders Diksha Dagar, who secured third place last year, and Gaurika Bishnoi, finished eighth. The three former champions in the field are Christine Wolf (2019), Camille Chevalier (2017) and Caroline Hedwall (2011)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/rafael-nadal-king-of-clay-roland-garros-records-never-matched-2614835-2024-10-10",
      "headline": "King of Clay: Why Rafael Nadal's French Open dominance might never be matchedRafael Nadal won 22 Grand Slam titles in his decorated career. 14 of them came at the Roland Garros - a love affair that symbolises one of the most dominant sporting achievements by an athlete. Beating Nadal on the red dirt of Paris was nearly impossible. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/joe-root-pak-vs-eng-1st-test-harry-brook-multan-heat-2614865-2024-10-10",
      "headline": "Joe Root reveals how previous Pakistan tour helped him bat in Multan's heatStar England batter Joe Root has revealed how the previous experience of batting in Pakistan came in handy during his record-breaking partnership with Harry Brook in the first Test in Multan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kapil-dev-pays-tribute-to-ratan-tata-2614853-2024-10-10",
      "headline": "Kapil Dev pays tribute to Ratan TataIndia's 1983 World Cup-winning captain Kapil Dev remembered iconic industrialist Ratan Tata for his humility and love for animals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/golf/story/diksha-dagar-leads-home-challenge-in-indian-open-tamburlini-among-strong-contenders-2614885-2024-10-10",
      "headline": "Diksha Dagar leads home challenge in Indian Open, Tamburlini among strong contenders Diksha Dagar, who secured third place last year, and Gaurika Bishnoi, finished eighth. The three former champions in the field are Christine Wolf (2019), Camille Chevalier (2017) and Caroline Hedwall (2011)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/rafael-nadal-king-of-clay-roland-garros-records-never-matched-2614835-2024-10-10",
      "headline": "King of Clay: Why Rafael Nadal's French Open dominance might never be matchedRafael Nadal won 22 Grand Slam titles in his decorated career. 14 of them came at the Roland Garros - a love affair that symbolises one of the most dominant sporting achievements by an athlete. Beating Nadal on the red dirt of Paris was nearly impossible. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/joe-root-pak-vs-eng-1st-test-harry-brook-multan-heat-2614865-2024-10-10",
      "headline": "Joe Root reveals how previous Pakistan tour helped him bat in Multan's heatStar England batter Joe Root has revealed how the previous experience of batting in Pakistan came in handy during his record-breaking partnership with Harry Brook in the first Test in Multan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kapil-dev-pays-tribute-to-ratan-tata-2614853-2024-10-10",
      "headline": "Kapil Dev pays tribute to Ratan TataIndia's 1983 World Cup-winning captain Kapil Dev remembered iconic industrialist Ratan Tata for his humility and love for animals."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-minute-silence-england-vs-greece-memory-george-baldock-2614831-2024-10-10",
      "headline": "UEFA to hold minute's silence before England vs Greece in memory of BaldockA minute's silence will be observed at Thursday's Nations League game between England and Greece in memory of George Baldock following the death of the Greek international, UEFA said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-harbhajan-singh-ipl-2025-ipl-auction-2025-2614830-2024-10-10",
      "headline": "Rohit Sharma going into IPL auction will be fascinating: Harbhajan SinghFormer India cricketer Harbhajan Singh has said that former MI skipper Rohit Sharma will make the IPL 2025 auction fascinating if he doesn't choose to stay with MI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-harry-brook-joe-root-multan-test-2614825-2024-10-10",
      "headline": "Harry Brook, Joe Root go on record-breaking spree in Multan TestPAK vs ENG: Joe Root and Harry Brook put England on the brink of victory in the opening Test against Pakistan in Multan. The duo made the Pakistan bowlers sweat on an excellent pitch to bat on and racked up records at will. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-multan-test-day-4-report-run-fest-2614822-2024-10-10",
      "headline": "Pakistan set for new low as innings defeat looms after England's 823Pakistan are staring at an innings defeat after England notched up their highest total in 86 years thanks to Harry Brook's triple century and Joe Root's double ton on the fourth day of the first Test.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-coco-gauf-rafael-nadal-cristiano-ronaldo-2614786-2024-10-10",
      "headline": "Rafael Nadal retires: How Tennis fraternity paid tribute to Spanish legendEntire sporting fraternity paid tribute to the Tennis Legend Rafael Nadal as he announced his retirement from the game. Nadal will play his last game in the Davis Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-captain-fatima-sana-father-death-2614776-2024-10-10",
      "headline": "Pakistan captain Fatima Sana to return home after father diesWomen's T20 World Cup 2024: Captain Fatima Sana is likely to miss Pakistan's next game against Australia as she is set to return home following the death of her father. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/rafael-nadal-retirement-cristiano-ronaldo-wishes-real-madrid-2614753-2024-10-10",
      "headline": "Cristiano Ronaldo wishes retiring Rafael Nadal: Honour to witness your journeyRafael Nadal retirement: Football legend Cristiano Ronaldo took to social media to pay his tribute to Rafael Nadal, who announced he would retire in November after the Davis Cup Finals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-pak-vs-eng-1st-test-multan-harry-brook-joe-root-2614745-2024-10-10",
      "headline": "Babar Azam trolled after twin failures vs England: 'Can't even score on highways'Babar Azam's twin failures in the first Test against England has drawn a strong reaction from fans on social media. Babar has gone 18 consecutive innings without a 50+ score in Tests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-coco-gauf-rafael-nadal-cristiano-ronaldo-2614786-2024-10-10",
      "headline": "Rafael Nadal retires: How Tennis fraternity paid tribute to Spanish legendEntire sporting fraternity paid tribute to the Tennis Legend Rafael Nadal as he announced his retirement from the game. Nadal will play his last game in the Davis Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-captain-fatima-sana-father-death-2614776-2024-10-10",
      "headline": "Pakistan captain Fatima Sana to return home after father diesWomen's T20 World Cup 2024: Captain Fatima Sana is likely to miss Pakistan's next game against Australia as she is set to return home following the death of her father. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/rafael-nadal-retirement-cristiano-ronaldo-wishes-real-madrid-2614753-2024-10-10",
      "headline": "Cristiano Ronaldo wishes retiring Rafael Nadal: Honour to witness your journeyRafael Nadal retirement: Football legend Cristiano Ronaldo took to social media to pay his tribute to Rafael Nadal, who announced he would retire in November after the Davis Cup Finals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-pak-vs-eng-1st-test-multan-harry-brook-joe-root-2614745-2024-10-10",
      "headline": "Babar Azam trolled after twin failures vs England: 'Can't even score on highways'Babar Azam's twin failures in the first Test against England has drawn a strong reaction from fans on social media. Babar has gone 18 consecutive innings without a 50+ score in Tests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/rafael-nadal-retires-king-of-clays-glorious-career-in-numbers-2614720-2024-10-10",
      "headline": "Rafael Nadal retires: King of Clay's glorious career in numbers Rafael Nadal said that he will retire from professional tennis after the Davis Cup knockout stage later this year, pulling the curtains down on his 23-year-long career. Nadal turned professional in 2001 and went on to win 22 Grand Slam singles titles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/roger-federer-on-retiring-rafael-nadal-i-hoped-this-day-would-never-come-2614702-2024-10-10",
      "headline": "I hoped this day would never come: Federer on retiring NadalRoger Federer heaped praise on Rafael Nadal after the latter announced the Davis Cup Finals later this year in November in Malaga will be his last at the professional level. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/rafael-nadal-retirement-statement-in-full-video-davis-cup-2614699-2024-10-10",
      "headline": "Rafael Nadal retirement statement in full: Leave with absolute peace of mindRafael Nadal has announced his retirement from tennis at the conclusion of the 2024 season on October 10, Thursday. Nadal will leave the sport at the end of the Davis Cup 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/rafael-nadals-retirement-sends-fans-into-breakdown-undefeatable-spirit-of-tennis-2614673-2024-10-10",
      "headline": "Rafael Nadal's retirement sends fans into breakdown: Undefeatable spirit of TennisLegendary Tennis Player Rafael Nadal announced his retirement from the game on October 10, 2024. Nadal will play his last game in the upcoming Davis Cup."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}