{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/us-federal-aviation-administration-faa-safety-alert-boeing-737-rudder-issue-2613724-2024-10-08",
      "headline": "US aviation agency issues safety alert over Boeing 737 rudder issueAlert comes after National Transportation Safety Board says foreign airlines could be using planes with rudder components that could pose safety risks\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-share-rally-18-percent-reason-more-upside-expert-view-analyst-review-2613469-2024-10-08",
      "headline": "Paytm shares rally 18% in last-hour surge: Is there more upside? Despite the rally in shares, Paytm's stock is still down 24.51% from its 52-week high of Rs 998.30, recorded on August 20, 2023."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-probe-ministry-of-road-transport-and-highways-to-investigate-complaints-bhavish-aggarwal-2613435-2024-10-08",
      "headline": "More trouble for Ola Electric, transport ministry to investigate complaintsThe complaints against Ola Electric have been growing in recent months, with issues ranging from service quality, customer support, to product reliability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-end-higher-led-by-auto-and-financial-paytm-shares-jump-16-percent-2613357-2024-10-08",
      "headline": "Sensex, Nifty end higher led by auto and financial; Paytm shares jump 16%The S&P BSE Sensex added 584.81 points to end at 81,634.81, while the NSE Nifty50 gained 217.40 points to close at 25,013.15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-motor-falls-4-percent-rekha-jhunjhunwala-potential-exit-from-multibagger-stock-2613322-2024-10-08",
      "headline": "Tata Group stock falls 4% as Jhunjhunwala eyes exit from multibaggerThe Jhunjhunwala family first invested in Tata Motors in the September 2020 quarter, when Rakesh Jhunjhunwala picked up 4 crore shares of the company"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-spicejet-shares-rise-9-percent-today-10-new-aircraft-by-end-of-november-expansion-fleet-2613259-2024-10-08",
      "headline": "Explained: Why SpiceJet shares jumped 9% todaySpiceJet recently raised Rs 3,000 crore through a qualified institutional placement (QIP). The airline is also set to receive an additional Rs 736 crore from a previous funding round, which will help support its growth plans."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/cognizant-discrimination-favoured-h-1b-holders-over-non-indian-workers-says-us-jury-report-2613225-2024-10-08",
      "headline": "Cognizant favoured H-1B holders over non-Indian workers, says US juryThis case dates back to 2017 when a class-action lawsuit was filed against the IT giant, accusing it of bias in its employment practices."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/crude-oil-prices-seen-to-stabilise-as-all-out-war-fears-recede-middle-east-iran-israel-conflict-2613194-2024-10-08",
      "headline": "Crude oil prices seem to stabilise as all-out war fears recedeTensions between Israel and Iran led to a 13 per cent spurt in Brent crude prices in the past seven days. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-reacts-to-china-stimulus-further-dip-in-sensex-nifty-goldman-sachs-analyst-review-2613186-2024-10-08",
      "headline": "Stock market reacts to China stimulus: Is there further dip in Sensex, Nifty?Despite some analysts hoping that foreign portfolio investment (FPI) outflows from India might reverse, further declines in Indian stocks cannot be dismissed, as per experts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-shares-fall-6-percent-after-ccpa-show-cause-notice-drops-46-percent-from-all-time-high-2613167-2024-10-08",
      "headline": "Ola Electric shares fall 6% after show cause notice; drops 46% from peakOla Electric has been given 15 days to respond to the notice and will provide the required documents within that time frame."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-flat-as-global-uncertainty-fuels-cautious-sentiment-2613156-2024-10-08",
      "headline": "Sensex, Nifty open flat as global uncertainty fuels cautious sentimentThe S&P BSE Sensex gained 321.03 points to 81,371.03, while the Nifty50 added 73.45 points to 24,869.20."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ola-electric-central-consumer-protection-authority-ev-consumer-complaints-2612988-2024-10-07",
      "headline": "Central panel's notice to Ola after surge in complaints against EVs: SourcesThe Central Consumer Protection Authority (CCPA) has taken cognisance of thousands of complaints and issued a show-cause notice to Ola Electric, sources said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-expectation-october-rate-cut-on-card-governor-shaktikanta-das-to-announce-soon-2612684-2024-10-07",
      "headline": "RBI MPC: Is rate cut on card? Shaktikanta Das to announce soonSpeculation has grown about the possibility of a rate cut or a shift in monetary policy, especially after the US Federal Reserve delivered an unexpected 50-basis-point cut in September 2024."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/zepto-new-hq-bengaluru-shifting-base-total-mall-sarjapur-by-february-cost-rs-3-4-crore-2612655-2024-10-07",
      "headline": "Zepto shifting its base to Total Mall in Sarjapur, Bengaluru: ReportZepto had earlier asked its 1,700-1,800 employees to move from its current base in Powai, Mumbai, to Bengaluru. However, the timeline was pushed back due to delays in finalising an appropriate location."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-close-in-red-despite-it-boost-global-factors-weigh-heavy-2612593-2024-10-07",
      "headline": "Sensex, Nifty close in red despite IT boost; global factors weigh heavyThe S&P BSE Sensex lost 638.45 points to end at 81,050, while the NSE Nifty50 was down 218.85 points to close at 24,795.75."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nbcc-india-shares-show-30-down-on-mobile-trading-apps-why-reason-explained-2612529-2024-10-07",
      "headline": "Explained: Why NBCC India shares are falling 30% on mobile trading appsThe company has performed well in recent times, with its shares increasing by 109% in 2024 and a massive 192% over the last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/meta-ceo-mark-zuckerberg-designs-minivan-for-wife-shows-off-his-his-and-hers-porsches-2612527-2024-10-07",
      "headline": "Mark Zuckerberg flaunts 'his and her' Porsches, designs minivan for wifeZuckerberg posted photos and videos of a Porsche 911 GT3 with a touring package for himself, and a customised Porsche Cayenne Turbo GT Minivan for Priscilla."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/rvnl-irfc-irco-shares-railway-stocks-fall-up-to-8-percent-check-here-2612489-2024-10-07",
      "headline": "RVNL, IRFC, IRCON: Railway stocks fall up to 8%. Check hereRailway stocks such as RVNL, IRFC, IRCON saw a decline on the stock exchanges on Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-price-today-october-7-2024-precious-metals-witness-dip-on-mcx-latest-rates-2612434-2024-10-07",
      "headline": "Gold, silver price today, October 7, 2024: Precious metals witness dip on MCXGold Price Today October 7, 2024: Both gold and silver are trading on the lower side of the Multi Commodity Exchange (MCX) on Monday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/why-ola-electric-share-fall-8-percent-today-ceo-bhavish-aggarwal-spat-kunal-kamra-social-media-2612429-2024-10-07",
      "headline": "Ola Electric shares tank 8% in early trade day after CEO's ugly spat with comicOla Electric shares have dropped 43% from its all-time high, and has seen a decline in five of the last six trading sessions."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/omar-abdullah-national-conference-congress-jammu-kashmir-poll-victory-morning-run-jinx-2613687-2024-10-08",
      "headline": "How Omar Abdullah broke his morning run jinx: Told myself I will never run if...Omar Abdullah went out for a run on Tuesday morning, even as his party was on edge awaiting the verdict of the people of Jammu and Kashmir. But, in an interview with India Today TV, Omar Abdullah candidly spoke about how he almost did not follow his routine – all due to the \"jinx\" of his morning run."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/hassan-nasrallah-likely-successors-killed-hezbollah-israel-benjamin-netanyahu-2613666-2024-10-08",
      "headline": "Hezbollah chief Nasrallah's likely successors killed: Israel's NetanyahuBenjamin Netanyahu stated that Israel has eliminated the potential successors of Hassan Nasrallah, the Hezbollah leader who was killed in a strike on Beirut less than two weeks ago. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/bjps-sunil-sangwan-ex-jailer-in-whose-tenure-ram-rahim-got-out-6-times-wins-2613632-2024-10-08",
      "headline": "BJP's Sunil Sangwan, ex-jailer in whose tenure Ram Rahim got out 6 times, winsSunil Sangwan defeated Congress's Manisha Sangwan by 1,957 votes in Haryana's Charkhi Dadri. His name appeared in the BJP's first list of 67 candidates on September 5.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/haryana-election-2024-result-congress-defeat-haryana-rahul-gandhi-impact-on-alliance-maharashtra-delhi-poll-india-alliance-arvind-kejriwal-2613633-2024-10-08",
      "headline": "Why the knives are out for Congress in INDIAThe twin election results on Tuesday brought back two sore points for the Congress. The party needed allies to climb to power in states, and it failed in straight fights with the BJP. This has been noticed by its alliance partners, and the knives are out."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/jalebi-trending-haryana-results-congress-rahul-gandhi-assembly-elections-deepinder-singh-hooda-2613275-2024-10-08",
      "headline": "Jalebi is trending, but it's not sweet news for Rahul GandhiJalebi started trending on Tuesday as the Haryana election results started coming in, and became clear that the Congress had failed to overthrow the BJP government. Congress leader Rahul Gandhi had made jalebi a poll issue, and the BJP took a sweet revenge on Tuesday. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/journalist-the-hindu-mahesh-langa-arrest-gst-fraud-case-ahmedabad-2613376-2024-10-08",
      "headline": "Gujarat: Journalist Mahesh Langa arrested in GST fraud case, Rs 20 lakh seizedThe arrest came after the crime branch raided 14 places in Ahmedabad, Junagadh, Surat, Kheda and Bhavnagar following a complaint by the Central GST department."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/haryana-assembly-election-result-congress-fight-kumari-selja-bhupinder-hooda-2613473-2024-10-08",
      "headline": "Haryana Congress fight out in open after loss, Kumari Selja targets HoodasA blame game began in the Congress on Tuesday after it failed in its bid to come back to power in Haryana after 10 years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/brij-bhushan-sharan-singh-bjp-mp-vinesh-phogat-julana-assembly-seat-haryana-election-2613568-2024-10-08",
      "headline": "Brij Bhushan on Vinesh Phogat's Haryana win: 'Power of my name helped her'Vinesh Phogat, who joined the Congress last month, won the Julana Assembly seat as she secured 65,080 votes, defeating her rival, BJP's Yogesh Kumar, by 6,105 votes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/will-you-put-a-photo-frame-in-your-fridge-the-fridgescaping-trend-says-you-must-2613266-2024-10-08",
      "headline": "Will you put a photo frame in your fridge? The fridgescaping trend says you mustThe obsession with decorating the outside of refrigerators has now shifted to the aesthetics of what goes inside. Fridgescaping has taken social media by storm, but is this trend truly practical?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/haryana-election-result-2024-hooda-family-bhupinder-deepinder-singh-reasons-od-congress-defeat-jat-formula-survival-future-2613386-2024-10-08",
      "headline": "Will mauled Hoodas look for Jat+ formula for survivalHaryana Election: The Congress was painted into a Jat party in Haryana, and it never refuted that. That helped consolidate non-Jat votes for the BJP. With the BJP performing well in Jat-dominated seats, the Hoodas need to think of a Jat+ formula to stay relevant in Haryana politics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/jammu-and-kashmir-assembly-polls-omar-abdullah-viral-2014-post-national-conference-congress-article-370-2613485-2024-10-08",
      "headline": "Omar Abdullah's 'I'll be back' post from 2014 is viral as he wins big in J&KOmar Abdullah, in a post on December 24, 2014, said he \"will be back\". The post went viral ten years later today, after the National Conference and Congress's alliance won the Jammu and Kashmir Assembly polls."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/us-elections-donald-trump-had-secret-calls-with-russia-vladimir-putin-after-leaving-office-2613628-2024-10-08",
      "headline": "Donald Trump had secret calls with Vladimir Putin after leaving office: ReportAccording to an upcoming book by veteran journalist Bob Woodward, titled 'War', Trump maintained contact with Putin while back home he continued to pressure Republicans into blocking aid to Ukraine. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/godfather-of-ai-has-a-stark-warning-after-winning-nobel-in-physics-2613360-2024-10-08",
      "headline": "Godfather of AI has a stark warning after winning Nobel in PhysicsDuring a conference call following the announcement of his award, Hinton expressed serious concerns about the rapid advancement of AI technology."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/haryana-election-results-2024-full-list-of-constituency-wise-winners-2613310-2024-10-08",
      "headline": "Haryana Election Results 2024: Full list of constituency wise winnersHaryana Election Winners List 2024: After the huge turn of events, here is the full list of constituency-wise winners for Haryana Election Results 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/jk-election-results-2024-full-list-of-constituency-wise-winners-2613333-2024-10-08",
      "headline": "J&K Election Results 2024: Full list of constituency wise winnersJ&K Election Winners List 2024: Here is the full list of constituency-wise winners for Haryana Election Results 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/india-bangladesh-ties-muhammad-yunus-sheikh-hasina-regime-change-2613581-2024-10-08",
      "headline": "India-Bangladesh ties must be very close, no alternative: Muhammad Yunus When asked for his comments on recent tensions in bilateral ties, Muhammad Yunus said the recent incidents in Bangladesh might have \"disheartened\" India and \"they were not pleased with the changes.\" He did not mention the incidents."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/triptii-dimri-recreate-kartik-aaryan-pyaar-ka-punchnama-monologue-female-version-2613352-2024-10-08",
      "headline": "Watch: When Triptii Dimri recreated Kartik Aaryan's Pyaar Ka Punchnama monologueTriptii Dimri had recreated Kartik Aaryan's Pyaar Ka Punchnama monologue eight years back. Triptii and Kartik will be sharing the screen in Bhool Bhulaiyaa 3."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/bjp-win-haryana-assembly-elections-results-vocal-of-local-rss-reasons-2613588-2024-10-08",
      "headline": "Vocal for local with RSS backing: BJP's 'gotcha' Haryana gameHow the BJP managed to hit it out of the park in Haryana has not sunk in yet for many. Confident of a Congress win in the Jatland, the obituary of a saffron hat-trick was written. The game changed on the final day with BJP taking home Haryana's political 'jalebi'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-probe-ministry-of-road-transport-and-highways-to-investigate-complaints-bhavish-aggarwal-2613435-2024-10-08",
      "headline": "More trouble for Ola Electric, transport ministry to investigate complaintsThe complaints against Ola Electric have been growing in recent months, with issues ranging from service quality, customer support, to product reliability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/haryana-assembly-election-results-bjp-sweep-urban-areas-gurgaon-faridabad-2613479-2024-10-08",
      "headline": "Haryana polls: IT hubs Gurgaon and Faridabad, urban seats see BJP sweepHaryana election result: Apart from Panchkula, which was won by the Congress, the BJP emerged victorious in other urban constituencies like Gurgaon, Faridabad, Ballabhgarh, Sonipat, Karnal and Badshahpur by huge margins."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mithun-chakraborty-1st-speech-after-dadasaheb-phalke-win-was-insulted-for-dark-skin-2613483-2024-10-08",
      "headline": "Mithun Chakraborty's speech after Dadasaheb Phalke win: Was insulted for dark skinActor Mithun Chakraborty, in his first speech after receiving the Dadasaheb Phalke Award, recalled his struggles as a dark-skinned actor. The 75-year-old actor was emotional and asked young actors to never stop dreaming. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/over-45-senior-doctors-resign-from-rg-kar-in-support-of-juniors-protest-2613321-2024-10-08",
      "headline": "Over 45 senior doctors resign from RG Kar in support of juniors' protestOver 45 senior doctors of RG Kar Medical College and Hospital have resigned, expressing solidarity with their junior colleagues who are protesting against the rape and murder of a trainee doctor in August this year."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/congress-trails-bjp-haryana-counting-votes-jairam-ramesh-pawan-khera-2613212-2024-10-08",
      "headline": "Irresponsible, unfounded: Election Commission on Congress's counting delay chargeHaryana Assembly Election Result: Congress General Secretary Jairam Ramesh claimed that there was delay in uploading of up-to-date trends for Haryana election results on the Election Commission website. However, the poll panel refuted the claim as \"irresponsible and unfounded\"."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/bengaluru-mahalakshmi-murder-accused-death-note-says-acted-in-self-defence-2613453-2024-10-08",
      "headline": "Man who chopped Bengaluru woman's body claims self-defence in death noteThe accused, in his death note, claimed that Mahalakshmi was planning to kill him and he murdered her in order to protect himself."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/disha-patani-vidya-balan-to-surveen-stars-dazzle-awards-show-2613711-2024-10-08",
      "headline": "Disha Patani, Vidya Balan to Surveen, stars dazzle at awards showBollywood celebrities like Vidya Balan, Surveen Chawla, Disha Patani and Kubbra Sait made a stylish appearance at a recent award show in Mumbai. Let's have a look."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-calls-samantha-hero-on-and-off-screen-sings-oo-antava-at-jigra-event-2613593-2024-10-08",
      "headline": "Alia Bhatt calls Samantha 'hero on and off-screen', sings Oo Antava at Jigra eventAt the Jigra Telugu pre-release event, Alia Bhatt praised Samantha Ruth Prabhu for her strength and talent, calling her a 'hero on and off-screen'. Alia even requested director Trivikram for a collaboration with Samantha in a future film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/alaya-f-to-star-in-kho-gaye-hum-kahan-2-2613567-2024-10-08",
      "headline": "Actor Alaya F to star in Kho Gaye Hum Kahan 2Actor Alaya F will be playing a pivotal role in Kho Gaye Hum Kahan's sequel. The original Netflix film starred Ananya Panday, Siddhant Chaturvedi and Adarsh Gourav. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/television/celebrity/story/malvi-malhotra-attacker-jailed-actor-reacts-exclusive-2613579-2024-10-08",
      "headline": "Actor Malvi Malhotra reacts as attacker gets jailed: Underwent mental traumaMalvi Malhotra, who played a significant role in the TV serial Udaan, was stabbed in 2020 for rejecting a marriage proposal. She found relief as her assailant was sentenced to three years in prison."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/motorola-moto-edge-50-pro-to-get-big-discount-during-flipkart-big-shopping-utsav-sale-2613523-2024-10-08",
      "headline": "Motorola Moto Edge 50 Pro to get big discount during Flipkart Big Shopping Utsav SaleFlipkart has just ended its Big Billion Days Sale and announced a new Big Shopping Utsav sale in India. The Motorola Moto Edge 50 Pro will be available at Rs 29,999 during the Flipkart sale. Keep reading to know more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/oneplus-13-to-get-big-upgrades-over-oneplus-12-new-reports-reveal-2613458-2024-10-08",
      "headline": "OnePlus 13 to get big upgrades over OnePlus 12, new reports reveal The OnePlus 13 is set to launch earlier than usual, with rumours of massive upgrades including increased RAM and a new Snapdragon chipset, causing excitement among fans. These changes could position it as one of the most powerful smartphones, breaking its traditional December release pattern."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/leaked-specifications-suggest-major-upgrades-for-vivo-x200-over-x100-2613443-2024-10-08",
      "headline": "Leaked specifications suggest major upgrades for Vivo X200 over X100Vivo is set to launch the X200 series on October 14 in China, featuring impressive camera technology and powerful batteries. The lineup will include three models, with the Pro Mini offering a robust 6.3-inch display and advanced photography capabilities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/godfather-of-ai-geoffrey-hinton-gets-physics-nobel-prize-as-ai-research-comes-into-spotlight-2613372-2024-10-08",
      "headline": "Godfather of AI Geoffrey Hinton gets Physics Nobel Prize as AI research comes into spotlightGodfather of AI Geoffrey Hinton gets the 2024 Nobel Prize in Physics for his foundational discoveries and inventions enabling machine learning with artificial neural networks."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-sri-lanka-smriti-mandhana-brushes-aside-nrr-concerns-2613729-2024-10-08",
      "headline": "Smriti Mandhana brushes aside NRR concerns ahead of Sri Lanka clashWomen's T20 World Cup: Vice-captain Smriti Mandhana fended off India's concern regarding their Net Run Rate before squaring off against Sri Lanka in the ongoing Women's T20 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/pooja-vastrakars-availability-not-known-yet-smriti-mandhana-ahead-of-ind-vs-sl-2613730-2024-10-08",
      "headline": "Pooja Vastrakar's availability not known yet: Smriti Mandhana ahead of IND vs SLWomen's T20 World Cup 2024: Smriti Mandhana in the pre-match press-conference informed that there is still no clarity over pacer Pooja Vastrakar's availability for the Group A clash against Sri Lanka. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/arctic-open-pv-sindhu-out-malvika-stuns-world-no23-yun-to-reach-pre-quarters-2613716-2024-10-08",
      "headline": "PV Sindhu out, Malvika stuns World No.23 Yun to reach pre-quartersArctic Open Super 500 tournament: Malvika Bansod defeated world No. 23 Sung Shuo Yun, advancing to the pre-quarterfinals. Meanwhile, PV Sindhu faced an early exit, and Aakarshi Kashyap moved to the next round."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-have-plans-for-indian-batters-says-chamari-ahead-of-crunch-t20-world-cup-clash-2613715-2024-10-08",
      "headline": "Sri Lanka have plans for Indian batters, says Chamari ahead of crunch T20 World Cup clashSri Lankan captain Chamari Athapaththu said that the team has plans for the Indian batters ahead of the all-important clash of Women's T20 World Cup 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/indian-super-league-oscar-bruzon-appointed-head-coach-of-east-bengal-2613698-2024-10-08",
      "headline": "Oscar Bruzon appointed head coach of East BengalSpanish football manager Oscar Bruzon has been appointed as the head coach of East Bengal FC, the club announced on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-shami-yet-to-attain-match-fitness-saha-returns-for-bengal-2613688-2024-10-08",
      "headline": "Mohammed Shami yet to attain match fitness, Saha returns for BengalStar Indian fast bowler Mohammed Shami is yet to regain full match fitness, remaining out of Bengal's squad for their opening Ranji Trophy fixtures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-beat-new-zealand-top-of-table-group-a-2613669-2024-10-08",
      "headline": "Australia go top of Group A with comprehensive win over New ZealandWomen's T20 World Cup: Australia went top of Group A with a comprehensive 60-run win over New Zealand. The Alyssa Healy-led side claimed the top spot in the Group A table with their 2nd consecutive win. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/border-gavaskar-trophy-india-leave-two-weeks-early-practice-games-india-a-2613667-2024-10-08",
      "headline": "Australia tour: India to leave 2 weeks early, play practice game against India ABorder-Gavaskar Trophy: Team India is likely to arrive in Australia two weeks before the first Test, starting November 22. India will take on India A in a practice game before the Perth Test and then face Prime Minister's XI in a two-day pink-ball game before the day-night Test in Adelaide. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/fit-again-harmanpreet-kaur-to-lead-india-against-sri-lanka-smriti-mandhana-2613662-2024-10-08",
      "headline": "Fit-again Harmanpreet Kaur to lead India against Sri Lanka: Smriti MandhanaIndia vice-captain Smriti Mandhana on Tuesday said skipper Harmanpreet Kaur will be leading the side against Sri Lanka in the Women's T20 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/centurion-salman-ali-reveals-bazballing-approach-can-take-on-spinners-anytime-2613596-2024-10-08",
      "headline": "Centurion Salman Ali reveals bazballing approach: Can take on spinners anytimeSalman Ali Agha revealed his bazballing approach during the Day 2 of the 1st Test between  Pakistan and England. The all-rounder notched up his 3rd Test hundred. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-2024-ind-vs-sl-live-streaming-when-and-where-to-watch-2613585-2024-10-08",
      "headline": "Women's T20 World Cup 2024, IND vs SL Live Streaming: When and where to watchWomen's T20 World Cup 2024: India will clash against Sri Lanka in an all-important Group A fixture on October 9. Find out all the live-streaming details of the contest. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-beat-new-zealand-top-of-table-group-a-2613669-2024-10-08",
      "headline": "Australia go top of Group A with comprehensive win over New ZealandWomen's T20 World Cup: Australia went top of Group A with a comprehensive 60-run win over New Zealand. The Alyssa Healy-led side claimed the top spot in the Group A table with their 2nd consecutive win. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/border-gavaskar-trophy-india-leave-two-weeks-early-practice-games-india-a-2613667-2024-10-08",
      "headline": "Australia tour: India to leave 2 weeks early, play practice game against India ABorder-Gavaskar Trophy: Team India is likely to arrive in Australia two weeks before the first Test, starting November 22. India will take on India A in a practice game before the Perth Test and then face Prime Minister's XI in a two-day pink-ball game before the day-night Test in Adelaide. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/fit-again-harmanpreet-kaur-to-lead-india-against-sri-lanka-smriti-mandhana-2613662-2024-10-08",
      "headline": "Fit-again Harmanpreet Kaur to lead India against Sri Lanka: Smriti MandhanaIndia vice-captain Smriti Mandhana on Tuesday said skipper Harmanpreet Kaur will be leading the side against Sri Lanka in the Women's T20 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/centurion-salman-ali-reveals-bazballing-approach-can-take-on-spinners-anytime-2613596-2024-10-08",
      "headline": "Centurion Salman Ali reveals bazballing approach: Can take on spinners anytimeSalman Ali Agha revealed his bazballing approach during the Day 2 of the 1st Test between  Pakistan and England. The all-rounder notched up his 3rd Test hundred. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-2024-ind-vs-sl-live-streaming-when-and-where-to-watch-2613585-2024-10-08",
      "headline": "Women's T20 World Cup 2024, IND vs SL Live Streaming: When and where to watchWomen's T20 World Cup 2024: India will clash against Sri Lanka in an all-important Group A fixture on October 9. Find out all the live-streaming details of the contest. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/border-gavaskar-trophy-india-vs-australia-2024-cheteshwar-pujara-miss-shane-watson-2613572-2024-10-08",
      "headline": "Cheteshwar Pujara's absence will not hurt India in Australia Tests: Shane WatsonIndia tour of Australia: Cheteshwar Pujara played a crucial role in India's historic Test series wins in Australia in 2018-19 and 2020-21, but the Asian giants won't feel his absence much, former all-rounder Shane Watson said. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-u19-vs-australia-u19-2nd-youth-test-day-2-report-chennai-2613565-2024-10-08",
      "headline": "2nd Youth Test: India ahead after Harvansh Pangalia hits hundred on Day 2India U19 vs Australia U19 second youth Test: Harvansh Singh Pangalia's century guided India U19 to a massive 492 runs. Australia trail by 350 runs, with India leading the series 1-0."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-multan-test-day-2-report-crawley-fifty-2613542-2024-10-08",
      "headline": "Zak Crawley fifty leads England's reply after Pakistan's 556 on Day 2Pakistan amassed 556 in their first innings, while England's restructured top order comfortably reached 96 for one by the end of a lively second day in the opening Test in Multan on Tuesday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-harry-maguire-injury-ruled-out-few-weeks-erik-ten-hag-2613547-2024-10-08",
      "headline": "Manchester United's Maguire confirms injury, ruled out for 'few weeks'Harry Maguire's knee injury, sustained against Aston Villa, adds to Manchester United's defensive woes, ruling him out for several weeks. His absence further compounds Erik ten Hag's struggles in an already underperforming season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/root-closes-in-on-another-sachin-tendulkar-record-with-1000-test-runs-in-2024-2613538-2024-10-08",
      "headline": "Root closes in on another Sachin Tendulkar record with 1000 Test runs in 2024Joe Root is closing in on another Sachin Tendulkar record as he completes 1000 runs in a single calender year for the 5th time, which the legendary Indian batter did six times in his career. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/india-to-host-world-pickleball-championship-series-in-november-2613516-2024-10-08",
      "headline": "India to host World Pickleball Championship series in NovemberThe All India Pickleball Association (AIPA) will host the World Pickleball Championship Series in Mumbai from November 12th to 17th, 2024. This event marks the first time the championship will be held in India, drawing international talent and attention."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-test-border-gavaskar-trophy-yashasvi-jaiswal-any-condition-brain-lara-2613518-2024-10-08",
      "headline": "Brian Lara backs Yashasvi Jaiswal to shine Down UnderWest Indies legend Brian Lara praised Yashasvi Jaiswal's consistency and predicted the young Indian batter would play a crucial role during India's upcoming Test series against Australia, despite his limited experience on challenging Australian pitches."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-harry-maguire-injury-ruled-out-few-weeks-erik-ten-hag-2613547-2024-10-08",
      "headline": "Manchester United's Maguire confirms injury, ruled out for 'few weeks'Harry Maguire's knee injury, sustained against Aston Villa, adds to Manchester United's defensive woes, ruling him out for several weeks. His absence further compounds Erik ten Hag's struggles in an already underperforming season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/root-closes-in-on-another-sachin-tendulkar-record-with-1000-test-runs-in-2024-2613538-2024-10-08",
      "headline": "Root closes in on another Sachin Tendulkar record with 1000 Test runs in 2024Joe Root is closing in on another Sachin Tendulkar record as he completes 1000 runs in a single calender year for the 5th time, which the legendary Indian batter did six times in his career. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/india-to-host-world-pickleball-championship-series-in-november-2613516-2024-10-08",
      "headline": "India to host World Pickleball Championship series in NovemberThe All India Pickleball Association (AIPA) will host the World Pickleball Championship Series in Mumbai from November 12th to 17th, 2024. This event marks the first time the championship will be held in India, drawing international talent and attention."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-test-border-gavaskar-trophy-yashasvi-jaiswal-any-condition-brain-lara-2613518-2024-10-08",
      "headline": "Brian Lara backs Yashasvi Jaiswal to shine Down UnderWest Indies legend Brian Lara praised Yashasvi Jaiswal's consistency and predicted the young Indian batter would play a crucial role during India's upcoming Test series against Australia, despite his limited experience on challenging Australian pitches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/steve-smith-should-continue-as-australia-opener-for-india-tests-shane-watson-2613492-2024-10-08",
      "headline": "Steve Smith should continue as Australia's opener for India Tests: Shane WatsonFormer all-rounder Shane Watson has confidence in Steve Smith's ability to excel as an opener despite recent form struggles. Watson also highlighted the resilience of Australia's fast bowlers ahead of the demanding Test series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-tip-toeing-chris-woakes-nearly-pulls-off-sensational-catch-in-multan-test-2613482-2024-10-08",
      "headline": "Watch: Tip-toeing Chris Woakes nearly pulls off sensational catch in Multan TestEngland seamer Chris Woakes nearly pulled off a sensational catch against Pakistan on Tuesday, October 8. Woakes, while tip-toeing at the boundary almost managed to dismiss Salman Agha on Day 2 of the 1st Test in Multan.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-england-salman-ali-agha-completes-1000-runs-with-his-3rd-test-ton-2613478-2024-10-08",
      "headline": "Pakistan vs England: Salman Ali Agha completes 1000 runs with his 3rd Test tonSalman Ali Agha scored his 3rd Test century and also completed 1000 Test runs during the 1st match between Pakistan and England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/arshdeep-singh-t20i-cricket-success-highs-and-lows-test-debut-chance-2613471-2024-10-08",
      "headline": "Arshdeep Singh finds right pace to enjoy flourishing India career in the fast laneSpeaking to the press in New Delhi ahead of the second T20I between India and Bangladesh, Arshdeep Singh said he has learnt the importance of staying in the present and riding the highs and lows of the sport. Arshdeep has evolved into one of the leading bowlers for India in T20Is with speculation about a potential place in the Test side "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}