{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-flat-adani-group-shares-gain-up-to-3-percent-in-early-trade-2641437-2024-11-28",
      "headline": "Sensex, Nifty open flat; Adani group shares gain up to 10% in early tradeThe S&P BSE Sensex lost 17.08 points to 80,217.00, while the NSE Nifty50 gained 8.05 points to 24,282.95. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/enviro-infra-engineers-listing-share-price-does-latest-gmp-signal-a-strong-market-debut-2641423-2024-11-28",
      "headline": "Enviro Infra Engineers listing: Does latest GMP signal a strong market debut? Enviro Infra Engineers listing: The initial public offering (IPO) of Enviro Infra Engineers saw strong investor interest through its 3-day bidding process as it was oversubscribed by 89.90 times. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-adani-group-shares-waaree-renewable-pcbl-vedanta-godrej-properties-2641402-2024-11-28",
      "headline": "Stocks to watch today: Adani, Waaree, PCBL, Vedanta, Godrej Properties Stocks to watch: In today's trade, shares of Adani Group, Waaree Renewable Technologies, Godrej Properties, Vedanta, and PCBL, among others, will be in focus due to various developments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/this-is-a-hatchet-job-mahesh-jethmalani-on-adanis-us-indictment-2641154-2024-11-27",
      "headline": "This is a hatchet job: Mahesh Jethmalani on Adani's US indictmentIn an exclusive interview with India Today TV, senior advocate and former BJP Rajya Sabha MP Mahesh Jatmalani defended Gautam Adani and called the US indictment a 'hatchet job'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-group-share-price-rally-clarification-us-bribery-charges-should-you-buy-avoid-stocks-2641085-2024-11-27",
      "headline": "Adani shares rally after clarification on US bribery charges. Is the worst over? Adani Power shares closed 20% higher at Rs 525.30, Adani Total Gas gained 19.76% to Rs 694.25, and Adani Enterprises rose 11.56% to Rs 2,398.35. These were the top gainers among all the listed Adani Group companies. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-end-higher-as-adani-group-stocks-rally-up-to-20-percent-2641039-2024-11-27",
      "headline": "Sensex, Nifty end higher as Adani stocks rally up to 20% The S&P BSE Sensex added 230.02 points to close at 80,234.08, while the NSE NIfty50 gained 82.20 points to end at 24,276.70."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdfc-life-insurance-faces-cyberattack-fraudsters-steal-customer-data-demand-extortion-2641013-2024-11-27",
      "headline": "HDFC Life faces cyberattack: Fraudsters steal customer data, demand extortionThe breach occurred between November 19 and November 21, 2024 and the cybercriminals managed to steal personal information about HDFC Life's customers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-share-price-jumps-18-percent-should-you-buy-now-or-wait-2640982-2024-11-27",
      "headline": "Ola Electric share price jumps 18%: Should you buy now or wait?The rally in Ola Electric shares followed the company's announcement of its new electric scooter lineup, which aims to make EVs more accessible across various segments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pan-20-project-uses-existing-old-pan-card-valid-need-to-upgrade-expert-views-2640953-2024-11-27",
      "headline": "PAN 2.0: Will existing PAN card remain valid or do you need to upgrade?PAN 2.0: With an investment of Rs 1,435 crore, the government aims to introduce advanced Digital PAN/TAN services as part of this e-governance reform."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-share-price-multibagger-returns-qip-should-you-buy-stock-2640932-2024-11-27",
      "headline": "Zomato shares up 131% this year: Should you buy multibagger stock?Zomato share price: On Wednesday, the stock added another 3%, reaching an intraday high of Rs 289.70, inching closer to its September peak of Rs 298.20."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-group-stocks-enterprise-green-energy-shares-gain-up-to-5-after-clarification-on-us-bribery-charge-2640859-2024-11-27",
      "headline": "Adani Group stocks gain up to 17% after clarification on US bribery chargeAdani Group stocks such as Adani Green Energy Ltd, Adani Power Ltd, Adani Energy Solutions Ltd, and Adani Enterprises Ltd gained as much as 10% after a fresh clarification on the US bribery charges. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-mobility-share-price-rises-sharply-new-range-of-electric-scooters-2640858-2024-11-27",
      "headline": "Explained: Ola Electric share price jumped 13% todayOla Electric Mobility share price opened at Rs 77.71 on the Bombay Stock Exchange (BSE), a 5% increase from the previous close of Rs 73.47, and touched a high of Rs 83.90, marking an increase of over 13%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ntpc-green-energy-share-price-stock-market-listing-should-you-hold-or-sell-2640846-2024-11-27",
      "headline": "NTPC Green Energy shares rise after listing. Should you hold or sell?NTPC Green Energy market listing: By 10:40 am, NTPC Green shares climbed further to Rs 120.80, signalling strong post-listing momentum. The upward movement in NTPC Green's share price defied expectations of a muted debut.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ntpc-green-energy-share-price-stocks-make-muted-debut-on-dalal-street-lists-at-3-percent-premium-2640834-2024-11-27",
      "headline": "NTPC Green Energy shares make muted debut on D-Street, lists at 3% premiumNTPC Green Energy listing: NTPC Green Energy shares opened at Rs 111.50 each on the NSE (National Stock Exchange), marking a 3.24% increase from the issue price of Rs 108."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/enviro-infra-engineers-ipo-allotment-online-step-by-step-guide-to-check-status-latest-gmp-2640828-2024-11-27",
      "headline": "Enviro Infra Engineers IPO allotment: Step-by-step guide to check statusEnviro Infra Engineers IPO allotment: Investors who have bid for the Enviro Infra Engineers IPO can check their allotment status through the online portals of the Bombay Stock Exchange (BSE) and Bigshare Services Pvt Ltd. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-flat-adani-green-energy-enterprises-shares-gain-2-percent-2640808-2024-11-27",
      "headline": "Sensex, Nifty open flat; Adani Green Energy shares gain 2%The S&P BSE Sensex was down 61.58 points to 79,942.48, while the NSE Nifty50 lost 13.55 points to 24,180.95 "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-green-energy-ola-electric-mm-ntpc-green-energy-stocks-to-watch-today-2640797-2024-11-27",
      "headline": "Adani Green Energy, Ola Electric, M&M, NTPC Green Energy: Stocks to watch todaySeveral stocks such as NTPC Green Energy, Adani Green Energy, Ola Electric are expected to be in focus today. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-green-clarification-no-bribery-charges-against-gautam-adani-nephew-in-us-indictment-2640796-2024-11-27",
      "headline": "No bribery charges against Gautam Adani, nephew in US indictment: Adani GreenGautam Adani Bribery Case: Adani Green Energy Ltd (AGEL) highlighted that the charges in the US Department of Justice (DOJ) indictment and the civil complaint by the US Securities and Exchange Commission (SEC) do not include allegations of bribery or corruption. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/warren-buffett-money-net-worth-children-donates-usd-12-billion-unveils-plans-for-his-wealth-after-death-2640786-2024-11-27",
      "headline": "Warren Buffett donates $1.1 billion, reveals wealth distribution plan after deathWarren Buffett: In his latest letter to Berkshire Hathaway shareholders, the 94-year-old provided a deeply personal reflection on life's unpredictability and shared detailed plans for the distribution of his wealth after his passing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/adani-stocks-drop-as-moodys-downgrades-outlook-for-7-entities-2640712-2024-11-26",
      "headline": "Adani stocks drop as Moody's downgrades outlook for 7 entitiesShares of Adani Group stocks dropped during Tuesday's session after Moody's downgraded the outlook for seven of its companies. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/maharashtra-chief-minister-suspense-mahayuti-delhi-meeting-devendra-fadnavis-eknath-shinde-ajit-pawar-bjp-sena-ncp-2641392-2024-11-28",
      "headline": "Mahayuti leaders' big Delhi meet today as suspense over chief minister continuesAs suspense over the next Maharashtra Chief Minister continues five days after the Mahayuti swept the Assembly polls, Devendra Fadnavis, Eknath Shinde and Ajit Pawar will meet Union Home Minister Amit Shah in Delhi today in an attempt to break the deadlock."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/jharkhand/story/jharkhand-butcher-kills-live-in-partner-chops-body-into-50-pieces-dog-finds-remains-2641434-2024-11-28",
      "headline": "Jharkhand butcher kills live-in partner, chops body into 50 piecesAccording to the police, Naresh Bhengra and Gangi Kumari had been in a live-in relationship for the past few years, but he got married to another woman in Khunti without informing Kumari. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/champions-trophy-india-vs-pakistan-pcb-chief-mohsin-naqvi-2641443-2024-11-28",
      "headline": "India not playing cricket in Pakistan is unacceptable: Mohsin NaqviPakistan Cricket Board chairman Mohsin Naqvi has said that India not wanting to play cricket in Pakistan is unacceptable. Naqvi has said that India should honour gesture when Pakistan went to play in India during the World Cup, despite political differences."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/mumbai/story/mumbai-air-india-pilot-found-dead-delhi-man-abetment-suicide-andheri-police-arrested-2641278-2024-11-27",
      "headline": "Pilot dies by suicide, family claims boyfriend insulted her over non-veg foodInitial investigations revealed that the Air India pilot, Srishti Tuli, 25, was being mentally harassed by Aditya Pandit, 27, and both argued at an event over consuming non-veg food."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/beauty/story/why-sunscreen-should-not-take-a-backseat-during-winter-2641093-2024-11-28",
      "headline": "Why your sunscreen should not take a backseat during winterEven though the sun may feel mild or remain hidden at times during winter, it doesn't mean UV rays are absent. In fact, this is the season to be extra cautious of UV A rays, experts say."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-jasprit-bumrah-rohit-sharma-ajinkya-rahane-border-gavaskar-trophy-ind-vs-aus-2636051-2024-11-28",
      "headline": "Like Rahane, like Bumrah: How inspiring stand-in captains breached Australian fortressesStar India fast bowler Jasprit Bumrah embraced the double responsibility during the first Test against Australia in Perth as India began the series on a winning note. Bumrah's captaincy was reminiscent of Ajinkya Rahane from the 2020-21 tour. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/jharkhand/story/hemant-soren-fourth-stint-as-jharkhand-chief-minister-oath-taking-ceremony-today-india-bloc-leaders-attend-2641390-2024-11-28",
      "headline": "Hemant Soren's fourth stint as Jharkhand Chief Minister, to take oath todayIn the recently-concluded Jharkhand Assembly polls, Hemant Soren retained his Barhait seat by defeating BJP candidate Gamliyel Hembrom by more than 39,790 votes. His JMM-led coalition secured a total of 56 seats in the 81-member Assembly."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/cyclone-fengal-update-deep-depression-tamil-nadu-puducherry-coast-when-landfall-2641407-2024-11-28",
      "headline": "Tami Nadu weather updates: Cyclone Fengal closes in, yellow alert in ChennaiSeveral districts of Tamil Nadu continue to receive heavy rainfall. Yellow alert issued in Chennai, orange alert in Kancheepuram, Chengalpattu, Villupuram and Cuddalore districts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/vicky-kaushal-chhaava-release-postponed-allu-arjun-pushpa-2-solo-release-2641397-2024-11-28",
      "headline": "Vicky Kaushal's Chhaava postponed to 2025, Pushpa 2 to have a solo releaseVicky Kaushal's Chhaava was slated to clash with Allu Arjun's Pushpa 2: The Rule in theatres. However, Chhaava has now backed out of the race and has been postponed to 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/priyanka-gandhi-vadra-rahul-gandhi-sonia-gandhi-oath-mp-lok-sabha-rajya-sabha-parliament-winter-session-wayanad-raebareli-2641433-2024-11-28",
      "headline": "Priyanka Gandhi's oath as MP today, to join Gandhis in ParliamentWith 52-year-old Priyanka Gandhi Vadra's entry into the Lok Sabha after her massive victory in Kerala's Wayanad, Parliament will see three members of the Gandhi family for the first time in decades."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-royal-challengers-bengaluru-face-backlash-over-launch-of-social-media-page-in-hindi-2641426-2024-11-28",
      "headline": "Royal Challengers Bengaluru face backlash over launch of X account in HindiRoyal Challengers Bengaluru have faced backlash from home fans and pro-Kannada activists for launching social media accounts in Hindi. Many have called out the RCB's move by alleging that the franchise is imposing Hindi down their throats."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/gujarat/story/iit-delhi-student-dies-3-injured-cave-in-incident-lothal-archaeological-site-gujarat-2641418-2024-11-28",
      "headline": "IIT Delhi student dies in cave-in incident at Gujarat archaeological siteThe incident took place on Wednesday when the research team was collecting soil samples at the archaeological site of Lothal, considered to be the centre of importance of the Indus Valley civilisation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nagarjuna-akhil-akkineni-zainab-ravdjee-wedding-2025-2641408-2024-11-28",
      "headline": "Nagarjuna: Akhil Akkineni, Zainab Ravdjee's wedding will happen in 2025Actor Nagarjuna recently announced the engagement of his younger son, Akhil Akkineni, and Zainab Ravdjee. In a recent interview, he revealed that their wedding will happen in 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/rajasthan-court-agrees-to-hear-plea-claiming-ajmer-sharif-dargah-as-shiv-temple-2641308-2024-11-27",
      "headline": "Rajasthan court agrees to hear plea claiming Ajmer Sharif Dargah as Shiv templeHindu Sena chief Vishnu Gupta, the plaintiff, has demanded that the Ajmer Sharif Dargah be declared as the \"Sankat Mochan Mahadev Temple\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indian-railways-blankets-are-washed-once-per-month-ashwini-vaishnaw-responds-in-parliament-lok-sabha-2641372-2024-11-28",
      "headline": "Do Railways clean train blankets after every journey? Ashwini Vaishnaw respondsRailway Minister Ashwini Vaishnaw said in Lok Sabha that blankets used on trains are washed at least once a month and an additional bedsheet is provided in the bedroll kit for its use as a blanket cover."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/udaipur-royal-family-dispute-row-over-city-palace-ends-with-rituals-amid-heavy-security-2641254-2024-11-27",
      "headline": "Udaipur royal rift: Row over City Palace ends with rituals amid heavy securityThe dispute within Udaipur's royal family, triggered by a clash over access to the City Palace, has been resolved after mediation, with Vishwaraj Singh Mewar performing royal rituals under heavy security."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-aus-bgt-virat-kohli-rahul-dravid-warns-australia-2641404-2024-11-28",
      "headline": "Virat Kohli will have a big series: Dravid warns AustraliaStar India batter Virat Kohli will have a big series in Australia, said Rahul Dravid ahead of the 2nd Test match at Adelaide. Dravid said that Kohli has been batting really well overseas and getting a hundred early against Australia will free him up."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/behind-violence-drama-at-mewar-dynasty-coronation-a-battle-royale-for-property-2641025-2024-11-27",
      "headline": "Behind violence, drama at Mewar dynasty coronation, a battle royale for propertyOn the opposing sides of the protracted dispute are BJP MLA Vishvaraj Singh, whose succession ceremony was held on November 25, and uncle Arvind Singh's family\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/ohio-governor-mike-dewine-signs-bill-restricting-bathroom-access-for-transgender-students-2641400-2024-11-28",
      "headline": "Ohio law restricts bathroom access for transgender students, sparks rowWhile 26 US states have now adopted laws restarting or banning gender-affirming care for transgender minors, at least 11 others have adopted laws, like Ohio's, barring transgender girls and women from girls' and women's bathrooms in public schools."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-selects-keith-kellogg-to-serve-as-special-envoy-role-in-ukraine-russia-war-2641386-2024-11-28",
      "headline": "Trump picks retired General Keith Kellogg to serve as his Ukraine envoyGeneral Keith Kellogg, who was the chief of staff for the White House National Security Council during Trump's 2017-2021 term and national security adviser to then-Vice President Mike Pence, will likely play a central role in attempting to resolve the conflict in his new position."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ananya-panday-admits-she-compromised-in-past-relationships-2641414-2024-11-28",
      "headline": "Ananya Panday admits she compromised in past relationships: You don't realise…Ananya Panday talked about love, loyalty, and red flags in relationships, revealing she once changed herself for a partner. She emphasised respect, listening, and support as key in relationships."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-2025-mega-auction-review-opinions-analysis-2641281-2024-11-27",
      "headline": "IPL 2025 mega auction review: Which team did the best business in Jeddah?IPL 2025 Mega Auction: In the third edition of the Democratic Review System, we try to give our take on who actually won the IPL 2025 Auction in Jeddah. All the 10 teams splashed cash during the 2-day event to fill their spots for the new season. Did Gujarat Titans secure the win or were there other teams who can claim they had the best auction?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/infant-skull-burnt-woman-skull-bones-missing-manipur-family-jiribam-violence-autopsy-report-2641299-2024-11-27",
      "headline": "Eyeballs missing, chopping wound, reveals autopsy of kidnapped Manipur infantThe latest autopsy report from Silchar Medical College and Hospital revealed that a 10-month-old boy named Laishram Lamnganba had both eyeballs missing from the sockets and his body in a state of thawing with a chopping wound and dislocation of the head."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/adani-group-us-bribery-indictment-case-top-lawyers-mahesh-jethmalani-manish-tewari-discuss-case-2641293-2024-11-27",
      "headline": "Politically motivated or scrutiny needed? What top lawyers said on Adani caseWhile advocate Mahesh Jethmalani dismissed the US indictment alleging Adani Group bribery as \"politically motivated\", Congress MP Manish Tewari called for parliamentary discussion, highlighting regulatory accountability concerns."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/jiah-khan-attempted-suicide-4-5-times-before-meeting-sooraj-pancholi-zarina-wahab-2641445-2024-11-28",
      "headline": "Jiah Khan attempted suicide 4–5 times before meeting Sooraj Pancholi: Zarina WahabActor Zarina Wahab, mother of Sooraj Pancholi, revealed Jiah Khan attempted suicide multiple times before meeting her son. She reflected on the 10-year ordeal, saying it deeply impacted Sooraj's career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/shahid-kapoor-pooja-hegde-deva-release-preponed-january-2641441-2024-11-28",
      "headline": "Shahid Kapoor's Deva to arrive early in January 2025Zee Studios and Roy Kapur Films have preponed the release of their much-awaited action thriller Deva, starring Shahid Kapoor and Pooja Hegde, to January 31, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/video/aishwarya-rai-returns-to-mumbai-after-dubai-event-2641428-2024-11-28",
      "headline": "Aishwarya Rai makes stylish return to Mumbai after shining at Dubai eventActor Aishwarya Rai was seen at the Mumbai airport on Thursday. The actor was recently in Dubai where she spoke about women's empowerment. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ananya-panday-admits-she-compromised-in-past-relationships-2641414-2024-11-28",
      "headline": "Ananya Panday admits she compromised in past relationships: You don't realise…Ananya Panday talked about love, loyalty, and red flags in relationships, revealing she once changed herself for a partner. She emphasised respect, listening, and support as key in relationships."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/kl-rahul-hopes-to-win-ipl-with-dc-wants-love-and-respect-parth-jindal-2641440-2024-11-28",
      "headline": "KL Rahul hopes to win IPL with DC, wants love and respect: Parth JindalDelhi Capitals co-owner Parth Jindal has said that KL Rahul told him that he wants to win the IPL with the franchise. Jindal said that KL Rahul wants love and respect from the management and the fans.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-royal-challengers-bengaluru-face-backlash-over-launch-of-social-media-page-in-hindi-2641426-2024-11-28",
      "headline": "Royal Challengers Bengaluru face backlash over launch of X account in HindiRoyal Challengers Bengaluru have faced backlash from home fans and pro-Kannada activists for launching social media accounts in Hindi. Many have called out the RCB's move by alleging that the franchise is imposing Hindi down their throats."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-aus-bgt-virat-kohli-rahul-dravid-warns-australia-2641404-2024-11-28",
      "headline": "Virat Kohli will have a big series: Dravid warns AustraliaStar India batter Virat Kohli will have a big series in Australia, said Rahul Dravid ahead of the 2nd Test match at Adelaide. Dravid said that Kohli has been batting really well overseas and getting a hundred early against Australia will free him up."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/new-zealand-sri-lanka-south-africa-india-wtc-final-2641036-2024-11-28",
      "headline": "India back in contention: 5 teams in home stretch of race to WTC FinalIndia, Australia, Sri Lanka, South Africa and New Zealand are fighting for two spots in the WTC 2023-25 final. India are the table-toppers after beating Australia by 295 runs in the Perth Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-jasprit-bumrah-rohit-sharma-ajinkya-rahane-border-gavaskar-trophy-ind-vs-aus-2636051-2024-11-28",
      "headline": "Like Rahane, like Bumrah: How inspiring stand-in captains breached Australian fortressesStar India fast bowler Jasprit Bumrah embraced the double responsibility during the first Test against Australia in Perth as India began the series on a winning note. Bumrah's captaincy was reminiscent of Ajinkya Rahane from the 2020-21 tour. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-laliga-barcelona-and-spains-lamine-yamal-wins-2024-golden-boy-award-2641364-2024-11-27",
      "headline": "LaLiga: Barcelona and Spain's Lamine Yamal wins 2024 Golden Boy awardBarcelona's Lamine Yamal wins the 2024 Golden Boy award after a historic year. The 17-year-old played a key role in Spain's Euro 2024 victory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-icc-champions-trophy-2025-bcci-pcb-icc-board-members-meeting-2641320-2024-11-27",
      "headline": "Champions Trophy 2025: What to expect from November 29 ICC Board meetingThe future of the ICC Champions Trophy 2025 is set to be decided during the ICC Board members meeting on November 29. Here are the key discussions likely to happen during the meeting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-world-championship-d-gukesh-ding-liren-game-three-analysis-2641306-2024-11-27",
      "headline": "Gukesh's comeback in World Chess Championship against Ding Liren isn't a surpriseGukesh's win against Ding Liren in the third game of the World Chess Championship continues the rich tradition where India's Grandmasters have never been bogged down despite an early setback."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-2025-mega-auction-review-opinions-analysis-2641281-2024-11-27",
      "headline": "IPL 2025 mega auction review: Which team did the best business in Jeddah?IPL 2025 Mega Auction: In the third edition of the Democratic Review System, we try to give our take on who actually won the IPL 2025 Auction in Jeddah. All the 10 teams splashed cash during the 2-day event to fill their spots for the new season. Did Gujarat Titans secure the win or were there other teams who can claim they had the best auction?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-rajat-patidar-madhya-pradesh-shreyas-iyer-mumbai-syed-mushtaq-ali-trophy-2024-25-2641273-2024-11-27",
      "headline": "SMAT 2024: Rajat Patidar, Shreyas Iyer set tounament ablaze with blistering knocksShreyas Iyer scored a breathtaking 71 (39) for Mumbai against Maharashtra in Syed Mushtaq Ali Trophy while Rajat Patidar scored 62 for Madhya Pradesh against Punjab."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-laliga-barcelona-and-spains-lamine-yamal-wins-2024-golden-boy-award-2641364-2024-11-27",
      "headline": "LaLiga: Barcelona and Spain's Lamine Yamal wins 2024 Golden Boy awardBarcelona's Lamine Yamal wins the 2024 Golden Boy award after a historic year. The 17-year-old played a key role in Spain's Euro 2024 victory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-icc-champions-trophy-2025-bcci-pcb-icc-board-members-meeting-2641320-2024-11-27",
      "headline": "Champions Trophy 2025: What to expect from November 29 ICC Board meetingThe future of the ICC Champions Trophy 2025 is set to be decided during the ICC Board members meeting on November 29. Here are the key discussions likely to happen during the meeting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-world-championship-d-gukesh-ding-liren-game-three-analysis-2641306-2024-11-27",
      "headline": "Gukesh's comeback in World Chess Championship against Ding Liren isn't a surpriseGukesh's win against Ding Liren in the third game of the World Chess Championship continues the rich tradition where India's Grandmasters have never been bogged down despite an early setback."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-2025-mega-auction-review-opinions-analysis-2641281-2024-11-27",
      "headline": "IPL 2025 mega auction review: Which team did the best business in Jeddah?IPL 2025 Mega Auction: In the third edition of the Democratic Review System, we try to give our take on who actually won the IPL 2025 Auction in Jeddah. All the 10 teams splashed cash during the 2-day event to fill their spots for the new season. Did Gujarat Titans secure the win or were there other teams who can claim they had the best auction?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-rajat-patidar-madhya-pradesh-shreyas-iyer-mumbai-syed-mushtaq-ali-trophy-2024-25-2641273-2024-11-27",
      "headline": "SMAT 2024: Rajat Patidar, Shreyas Iyer set tounament ablaze with blistering knocksShreyas Iyer scored a breathtaking 71 (39) for Mumbai against Maharashtra in Syed Mushtaq Ali Trophy while Rajat Patidar scored 62 for Madhya Pradesh against Punjab."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-2025-auction-liam-livingstone-royal-challengers-bengaluru-chinnaswamy-stadium-2641268-2024-11-27",
      "headline": "RCB new man Liam Livingstone feels Bengaluru will be better for him than PunjabRCB's new addition, Liam Livingstone, feels that the Chinnaswamy stadium will be better suited to him than the ground in Punjab. Livingstone was one of the main buys for RCB during the auction. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-baroda-vs-tamil-nadu-hardik-pandya-sixes-gurjapneet-singh-syed-mushtaq-ali-trophy-2641255-2024-11-27",
      "headline": "Watch: Hardik Pandya smashes CSK recruit Gurjapneet Singh for 4 sixes in an over Syed Mushtaq Ali Trophy 2024: Hardik Pandya's sensational knock of 69 (30 balls) helped Baroda beat Tamil Nadu in a Group B match in Indore on Wednesday, November 27. Hardik hit left-arm pacer Gurjapneet Singh for four sixes in an over. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-world-championship-d-gukesh-ding-liren-game-3-win-magnus-carlsen-example-2641240-2024-11-27",
      "headline": "D Gukesh cites Magnus Carlsen example after overcoming slow start with Game 3 winIndian grandmaster D Gukesh cited the example of Magnus Carlsen after he overcame the slow start he made to the World Chess Championship match against Ding Liren. Gukesh secured the win in Game 3 against Liren on November 27. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sa-vs-sl-1st-test-south-africa-vs-sri-lanka-lahiru-kumara-vishwa-fernando-asitha-fernando-2641238-2024-11-27",
      "headline": "SA vs SL, 1st Test: Rain saves Proteas after Sri Lanka seamers run riot on Day 1Sri Lanka left South Africa reeling at 80/4 on Day 1 of the first Test in Durban as Lahiru Kumara picked up two wickets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/syed-modi-international-pv-sindhu-lakshya-sen-storm-into-round-2-2641226-2024-11-27",
      "headline": "Syed Modi International: PV Sindhu, Lakshya Sen storm into Round 2Top Indian shuttlers PV Sindhu and Lakshya Sen have advanced to the second round of the Syed Modi International Super 300 tournament. Both players secured straight-game victories in their respective singles matches on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-travis-head-australia-camp-rift-rumours-2641195-2024-11-27",
      "headline": "Travis Head denies rift in Australia camp: Boys hung out together last nightTravis Head has denied claims of a rift within the Australia camp after their loss in the Perth Test to India. Speculations had come in after Josh Hazlewood's comments at the end of Day 3 of the match in Perth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-umran-malik-ipl-2025-mega-auction-kolkata-knight-riders-kkr-2641175-2024-11-27",
      "headline": "Fully fit Umran Malik eager to help KKR win their 2nd consecutive IPL trophyIndia;s young fast bowling sensation Umran Malik said that he's excited to help Kolkata Knight Riders (KKR) win their second consecutive IPL trophy after being bought by the franchise for INR 75 lakh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-world-championship-d-gukesh-vs-ding-lire-game-3-report-score-2641173-2024-11-27",
      "headline": "D Gukesh bounces back, wins Game 3 to level match against Ding LirenChess World Championship: Indian Grandmaster D Gukesh, playing with white pieces, won Game 3 on Wednesday.  Reigning champion Ding Liren lost on time after a mad scramble. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/syed-modi-international-pv-sindhu-lakshya-sen-storm-into-round-2-2641226-2024-11-27",
      "headline": "Syed Modi International: PV Sindhu, Lakshya Sen storm into Round 2Top Indian shuttlers PV Sindhu and Lakshya Sen have advanced to the second round of the Syed Modi International Super 300 tournament. Both players secured straight-game victories in their respective singles matches on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-travis-head-australia-camp-rift-rumours-2641195-2024-11-27",
      "headline": "Travis Head denies rift in Australia camp: Boys hung out together last nightTravis Head has denied claims of a rift within the Australia camp after their loss in the Perth Test to India. Speculations had come in after Josh Hazlewood's comments at the end of Day 3 of the match in Perth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-umran-malik-ipl-2025-mega-auction-kolkata-knight-riders-kkr-2641175-2024-11-27",
      "headline": "Fully fit Umran Malik eager to help KKR win their 2nd consecutive IPL trophyIndia;s young fast bowling sensation Umran Malik said that he's excited to help Kolkata Knight Riders (KKR) win their second consecutive IPL trophy after being bought by the franchise for INR 75 lakh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-world-championship-d-gukesh-vs-ding-lire-game-3-report-score-2641173-2024-11-27",
      "headline": "D Gukesh bounces back, wins Game 3 to level match against Ding LirenChess World Championship: Indian Grandmaster D Gukesh, playing with white pieces, won Game 3 on Wednesday.  Reigning champion Ding Liren lost on time after a mad scramble. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-indian-super-league-mumbai-city-fc-vs-punjab-fc-yoell-van-nieff-meets-angry-fans-video-2641143-2024-11-27",
      "headline": "Watch: Mumbai City player tries to pacify disgruntled fans after ISL match lossFollowing Mumbai City FC's 3-0 loss to Punjab, midfielder Yoell van Nieff engaged with fans post-match, urging them to support the team even in losses. The loss meant that Mumbai are currently 10th in the points table. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-yashasvi-jaiswal-perth-test-hundred-glenn-maxwell-border-gavaskar-trophy-australia-vs-india-2641132-2024-11-27",
      "headline": "Yashavi Jaiswal will get more than 40 Test hundreds: Glenn MaxwellStar Australia all rounder Glenn Maxwell has said that that young India opener Yashasvi Jaiswal will score over 40 centuries in his Test career."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/football-pep-guardiola-clarification-instagram-statement-nose-scratch-harm-2641120-2024-11-27",
      "headline": "Pep Guardiola clarifies 'want to hurt myself' comment with statement on InstagramManchester City manager Pep Guardiola said he did not intend to 'make light of a serious issue' when he made a bizarre comment about scratches on his face after their Champions League draw to Feyenoord on Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/faf-du-plessis-bids-goodbye-to-rcb-with-an-emotional-message-after-ipl-auction-2641100-2024-11-27",
      "headline": "Faf du Plessis bids goodbye to RCB with an emotional message after IPL auctionIPL 2025 mega auction: Faf du Plessis penned down an emotional note as he bid farewell to the Royal Challengers Bengaluru. The RCB franchise did not opt to RTM their former captain in auction after releasing him."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}