{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-317-points-higher-nifty-above-25100-hcltech-down-3-2756116-2025-07-15",
      "headline": "Sensex ends 317 points higher, Nifty above 25,100; HCLTech down 3%The S&P BSE Sensex added 317.45 points to end at 82,570.91, while the NSE Nifty50 was up 113.50 points to close at 25,195.80. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/should-you-subscribe-anthem-biosciences-ipo-listing-gains-gmp-allotment-date-review-2756093-2025-07-15",
      "headline": "Anthem Biosciences IPO fully booked: Should you subscribe? Check listing gainsThe IPO opened for subscription on July 14, aims to raise Rs 3,395 crore through a complete offer for sale (OFS) of 5.96 crore equity shares."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-rs-12-crore-did-not-make-this-man-happy-investment-advisor-explains-2756072-2025-07-15",
      "headline": "Why Rs 12 crore didn't make this man happy? Investment advisor explainsWhile money matters, it should never cost you your health, peace of mind, or precious family time. True wealth is living well, not just stacking numbers in a bank account, says an investment advisor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-zerodhas-nithin-kamath-wants-short-selling-made-easy-in-india-2756030-2025-07-15",
      "headline": "Why Zerodha's Nithin Kamath wants short selling made easy in IndiaIf someone wants to short a stock today, they mostly do it through futures or options. But there's a catch, there are only 224 stocks in India that have futures and options. So if a bad company is not on that list, no one can short it easily."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/theobroma-stake-sale-90-percent-chryscapital-accquisition-kainaz-messman-harchandrai-tina-messman-wykes-report-2755967-2025-07-15",
      "headline": "Theobroma to be sold, Rs 2,410-crore sweet deal baked by ChrysCapital: ReportFounded in 2004 by sisters Kainaz Messman Harchandrai and Tina Messman Wykes, Theobroma began with a single outlet at Cusrow Baug on Mumbai's Colaba Causeway. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/claiming-fake-itr-refunds-here-is-what-could-happen-2755957-2025-07-15",
      "headline": "Claiming fake ITR refunds? Here's what could happenTo give honest taxpayers a chance to fix their mistakes, the department had earlier asked people to revise their returns if they had claimed any wrong deductions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filing-itr-2-or-itr-3-check-these-common-mistakes-and-tips-to-avoid-them-2755920-2025-07-15",
      "headline": "Filing ITR-2 or ITR-3? Check these common mistakes and tips to avoid themUsing the Excel utility for ITR-2 or ITR-3 seems easy, but it's easy to get stuck if you're not careful. One wrong entry can throw your entire tax calculation off. Here's a handy guide to avoid common slip-ups."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/hcltech-share-price-it-stock-q1-results-down-4-percent-why-reason-guidance-2755904-2025-07-15",
      "headline": "Explained: Why HCLTech shares are down 4% todayOver the past few days, HCLTech has been under pressure. The stock has declined 7.9% in the last five trading sessions, 9.58% in the past month, and over 14.6% in the past six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-mumbai-showroom-opening-today-electric-cars-model-y-ev-suv-cost-in-india-rs-60-lakh-2755893-2025-07-15",
      "headline": "Tesla showroom now in Mumbai. Price list of Model Y EVs in India revealed  Live UpdatesThe Mumbai showroom will serve as Tesla's main display and customer experience centre, offering visitors a chance to view the vehicles up close and understand Tesla's technology."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-119-points-higher-nifty-above-25100-tata-motors-up-1-percent-2755865-2025-07-15",
      "headline": "Sensex opens 119 points higher, Nifty above 25,100; Tata Motors up 1%The S&P BSE Sensex was up 176.33 points to 82,429.79, while the NSE Nifty50 gained 63.50 points to 25,145.80 as of 9:29 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-model-y-price-india-rs-60-lakh-mumbai-showroom-2755864-2025-07-15",
      "headline": "Tesla's Model Y to debut in India at Rs 60 lakhIn comparison, the Model Y starts at $44,990 in the United States, 263,500 yuan in China, and 45,970 euros in Germany. This makes the Indian version one of the most expensive, mainly due to import duties and logistics costs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-trading-setup-sensex-nifty-july-15-nse-bse-inflation-global-trade-tariff-2755850-2025-07-15",
      "headline": "Sensex, Nifty today: Inflation drops, but will stock markets rise?Gift Nifty futures were trading at 25,166 points around 8:22 am, suggesting a possible higher start for Nifty50, which closed at 25,082.3 on Monday. This points to cautious optimism on Dalal Street after four straight sessions of losses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/smartworks-coworking-spaces-ipo-allotment-status-online-guide-check-gmp-listing-date-2755848-2025-07-15",
      "headline": "Smartworks Coworking Spaces IPO allotment: Online guide to see status. Check GMPInvestors who applied for the IPO can check their allotment status either through the BSE website or the registrar's platform, MUFG Intime India Private Limited (also known as Link Intime India Pvt Ltd)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-hits-record-123000-as-us-policy-hopes-boost-crypto-market-btc-price-all-time-high-2755608-2025-07-14",
      "headline": "Bitcoin hits record $123,000 as US policy hopes boost crypto marketBitcoin is up about 30% so far this year and its rise has lifted other coins too. Ether, the second-biggest token, climbed to a five-month high of $3,059. XRP and Solana also rose about 3% each."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/retail-inflation-hits-6-year-low-in-june-to-210-2755534-2025-07-14",
      "headline": "Retail inflation cools to 6-year low of 2.10% in JuneThis is the fifth month in a row that inflation has remained below the Reserve Bank of India's (RBI) medium-term target of 4%, and the eighth consecutive month it has stayed under the central bank's upper limit of 6%"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-247-points-lower-nifty-below-25100-eternal-zomato-up-3-percent-2755524-2025-07-14",
      "headline": "Sensex closes 247 points lower, Nifty below 25,100; Eternal up 3%The S&P BSE Sensex was down by 247.01 points to close at 82,253.46, while the NSE Nifty50 lost 67.55 points to end at 25,082.30."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ott-dark-pattern-50-percent-find-difficult-to-unsubscribe-local-circles-report-2755499-2025-07-14",
      "headline": "Trap, click, renew: How OTT apps make it hard to cancel subscriptionsAccording to data collected by community platform LocalCircles, 50% of respondents said they have frequently had difficulty cancelling subscriptions to digital services."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/edelweiss-mutual-fund-radhika-gupta-on-why-your-portfolio-should-be-yours-not-someone-else-suno-sabki-portfolio-apni-2755465-2025-07-14",
      "headline": "Edelweiss' Radhika Gupta on why your portfolio should be yours, not someone else'sBuilding your investment portfolio should match your own risk comfort, timeframe and goals. What works for your friend may not work for you, says MD and CEO of Edelweiss Mutual Fund, Radhika Gupta."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-your-tax-refund-may-be-delayed-this-year-2755425-2025-07-14",
      "headline": "Why your tax refund may be delayed this yearOne big reason for the delay is that the tax filing season began late this year. Normally, people can file their returns from April onwards. But this time, the Income Tax Department released the ITR utilities quite late."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-down-crash-sensex-nifty-decline-reason-why-bse-nse-top-losers-it-stocks-2755394-2025-07-14",
      "headline": "Sensex down 400 points: Why is stock market falling todayAs of 11:50 am, the S&P BSE Sensex was down by 388.85 points to 82,111.62, while the NSE Nifty50 lost 110.85 points to 25,039.00. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/only-67-percent-filed-itrs-coinswitch-co-founder-ashish-singhal-on-why-indians-delay-tax-filing-2755368-2025-07-14",
      "headline": "Only 6.7% filed ITRs: CoinSwitch co-founder on why Indians delay tax filingIndia has made big progress in digital tax filing over the years. There are new portals, better forms and more ways to pay taxes online. Yet, millions still wait till the last few days to get their documents in order."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/ola-electric-share-price-rise-5-percent-q1-results-store-close-profit-sales-number-2755365-2025-07-14",
      "headline": "Explained: Why Ola Electric shares gained 5% todayOla Electric share price: The stock touched an intraday high of Rs 43.60 before trading 5.45% higher at Rs 41.99 around 11:11 am, shortly after the electric two-wheeler maker announced its financial results for the first quarter of FY26."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-all-time-high-usd-120000-why-reasons-us-policy-latest-price-crypto-ether-2755326-2025-07-14",
      "headline": "Bitcoin zooms past $120,000 to reach all-time high. Here's whyThe world's largest cryptocurrency was last seen trading at $120,700.54, up 1.32%, as investor confidence remained strong ahead of important regulatory discussions in the United States."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-95-points-lower-nifty-below-25200-hcltech-up-1-percent-hul-down-2755305-2025-07-14",
      "headline": "Sensex, Nifty start week in red as IT stocks drag markets lower againThe S&P BSE Sensex lost 266.34 points to 82,234.13, while the NSE Nifty50 was down by 67.95 points to 25,081.90 as of 9:22 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/travel-food-services-market-debut-listing-today-latest-gmp-listing-gains-2755300-2025-07-14",
      "headline": "Travel Food Services to make market debut today; here's the latest GMPTravel Food Services listing: The grey market premium (GMP), which had dropped sharply in the past week, has seen a slight rise ahead of the listing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/jane-street-sebi-ban-over-deposit-rs-48435-crore-return-stock-market-trading-report-2755288-2025-07-14",
      "headline": "Jane Street deposits Rs 4,843.5 crore, set to return to Dalal Street: ReportIn its interim order, Sebi had accused Jane Street of using manipulative strategies in Indian stock markets. The regulator directed the firm to deposit alleged unlawful gains in an escrow account with a scheduled commercial bank in India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-claiming-your-pf-money-seems-so-difficult-provident-fund-epfo-problems-in-pf-withdrawal-2755045-2025-07-13",
      "headline": "Why claiming your PF money seems so difficultIt all starts with tiny mistakes. A spelling error in your name, a mismatch in your date of birth, or an old bank account number can be enough to freeze your claim."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-india-trade-deal-500-percent-tariff-donald-trump-russia-sanction-act-2025-2754768-2025-07-12",
      "headline": "Will India be hit with a 500% tariff? Here's what we knowIndia remains one of the few countries still in talks with the US at a time when the Trump administration is preparing to enforce steep new tariffs on imports from several nations starting August 1."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-drops-coming-soon-teaser-on-new-x-account-ahead-of-india-launch-2754573-2025-07-11",
      "headline": "Tesla drops 'coming soon' teaser on new X account ahead of India launchTesla is set to open its first Indian showroom in Mumbai's Bandra Kurla Complex on July 15. The Tesla India X account shared a \"coming soon\" post on Friday night."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musks-tesla-likely-to-begin-first-deliveries-in-india-from-august-report-2754454-2025-07-11",
      "headline": "Elon Musk's Tesla likely to begin first deliveries in India from August: ReportThis move comes at a key moment for Tesla. The carmaker has seen sales dip in other countries and is now turning to India, the world's third-largest car market, to reach new buyers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zerodha-founder-nithin-kamath-hits-back-at-dark-patterns-used-by-financial-apps-2754421-2025-07-11",
      "headline": "Zerodha's Nithin Kamath hits back at 'dark patterns' used by financial appsNithin Kamath says these tricks are designed to push people into taking actions that are not in their best interest, just so companies can make more money. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-ends-690-points-lower-nifty-settles-below-25200-tcs-falls-4-percent-hul-shares-gain-2754367-2025-07-11",
      "headline": "Sensex ends 690 points lower, Nifty settles below 25,200; TCS falls 4%The S&P BSE Sensex was down by 689.81 points to end at 82,500.47, while the NSE Nifty50 lost 205.40 points to close at 25,149.85. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-bank-licence-rbi-government-plan-likely-report-2754342-2025-07-11",
      "headline": "New banks coming soon? India eyes first permits since 2014, says reportThe government and central bank are said to be considering multiple steps to create more, larger and stronger banks that can support India's ambitious economic growth plans over the coming decades."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/got-rs-5-lakh-health-insurance-should-you-buy-a-top-up-or-higher-sum-insured-2754300-2025-07-11",
      "headline": "Got Rs 5 lakh health insurance? Should you buy a top-up or higher sum insuredWhen you file a claim, your base policy settles the expenses first. If the bill crosses that limit, the top-up steps in. Normally, your base plan pays up to its maximum, and then the top-up kicks in to handle the rest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-down-700-points-nifty-plunge-stock-market-crash-1-why-it-stocks-down-1-percent-hul-share-price-2754233-2025-07-11",
      "headline": "Sensex plunges 700 points: Why the stock market fell 1% today? The S&P BSE Sensex fell nearly 700 points to 82,509.59, while the NSE Nifty50 declined by nearly 200 points to 25,162.25 as of 12:21 pm. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-2-and-itr-3-excel-utilities-released-who-can-file-and-what-is-new-2754212-2025-07-11",
      "headline": "ITR-2 and ITR-3 excel utilities released: Who can file and what's new?ITR-2 is meant for individuals or Hindu Undivided Families (HUFs) who are not eligible to file ITR-1 (Sahaj). This form is meant for taxpayers who do not have any income from business or profession and do not earn any income like interest, salary, bonus, commission, etc. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-breaks-117000-mark-reaches-all-time-high-crypto-prices-ethereum-altcoins-rise-dogecoin-gain-2754173-2025-07-11",
      "headline": "Bitcoin breaks $117,000 mark, reaches all-time highAt the time of writing at 11.00 am, the world's largest cryptocurrency is trading at $117,863.18, climbing by 6.13% over the last 24 hours. Crypto experts believe if the supportive policies continue, digital coins could see even more new money coming in."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-showroom-experience-center-mumbai-opening-july-15-elon-musk-entry-india-2754155-2025-07-11",
      "headline": "Tesla drives into India: Mumbai to get first experience centre on July 15The space will allow visitors to explore Tesla's electric cars and related technologies, though test drives and deliveries may not be offered at this stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/tcs-share-price-fall-it-stocks-down-weak-q1-results-should-you-buy-expert-view-sensex-nifty-2754140-2025-07-11",
      "headline": "TCS falls 2% on Q1 results miss. Should you buy as IT stocks struggle?TCS share price: The IT giant has lost 2.74% over the past five days and declined 4.37% in the past month. Over a six-month period, the stock is down 22.63%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/hul-share-price-rise-4-percent-priya-nair-new-ceo-rohit-jawa-replacement-leadership-change-2754108-2025-07-11",
      "headline": "Explained: Why HUL shares rose 4% todayHUL shares were up 3.8%, trading at Rs 2,500 as of 9;25 am, compared to Thursday's closing price of Rs 2,409.05. The stock ended Thursday's session nearly 1% lower but has gained 3.58% in the past five days."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/shanaya-kapoor-heartbreak-shelved-debut-film-bollywood-journey-2755965-2025-07-15",
      "headline": "Shanaya Kapoor on first film getting shelved: Was my biggest love and heartbreakActor Shanaya Kapoor opens up on her first film getting shelved, calling it her biggest heartbreak. She shares how her parents' guidance helped her grow and succeed in Bollywood."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/heer-express-trailer-ashutosh-rana-mentors-divita-juneja-acting-debut-wholesome-family-drama-2756029-2025-07-15",
      "headline": "Heer Express trailer: Ashutosh Rana mentors a young chef in wholesome entertainerThe trailer for Umesh Shukla's 'Heer Express' released on Tuesday, July 15. The upcoming film marks the acting debut of Divita Juneja."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/b-saroja-devi-passes-away-aged-87-donates-eyes-to-narayana-nethralaya-2755976-2025-07-15",
      "headline": "Legendary South actor B Saroja Devi's eyes donated as per her wishesLegendary South Indian actor B Saroja Devi's eyes were donated after her death. The 87-year-old died due to age-related ailments, and her corneas will soon be transplanted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/fir-against-director-pa-ranjith-and-others-in-stuntman-rajus-death-case-2756038-2025-07-15",
      "headline": "FIR against director Pa Ranjith and others in stuntman Raju's death caseA case has been filed against director Pa Ranjith and others after stuntman Mohan Raj died on the set of 'Vettuvam'. The incident raises questions about safety and legal accountability in film production."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/archana-puran-singh-goes-house-hunting-in-dubai-says-shed-have-to-buy-a-helicopter-2756048-2025-07-15",
      "headline": "Archana Puran Singh goes house-hunting in Dubai, says she'd have to buy a helicopterActor Archana Puran Singh recently explored several residential properties in Dubai. She shared a video of her house-hunting experience with her family on YouTube. She was accompanied by her husband Parmeet Sethi and her sons. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/lokesh-kanagaraj-responds-to-sanjay-dutt-criticism-over-leo-role-2755936-2025-07-15",
      "headline": "Director Lokesh Kanagaraj reacts to Sanjay Dutt saying he was wasted in Leo'Coolie' director Lokesh Kanagaraj during an interview, reacted to Sanjay Dutt's recent 'He wasted me in Leo' comment that went viral. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dheeraj-kumar-dies-at-the-age-of-79-after-battling-pneumonia-2756015-2025-07-15",
      "headline": "Actor and producer Dheeraj Kumar dies at 79 after battling pneumoniaVeteran actor and producer Dheeraj Kumar died at 79 due to pneumonia after being on ventilator support at a Mumbai hospital."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/lokesh-kanagaraj-compares-aamir-khan-to-kamal-haasan-biggest-global-action-film-2755907-2025-07-15",
      "headline": "Lokesh Kanagaraj compares Aamir to Kamal Haasan, teases biggest global action filmDirector Lokesh Kanagaraj recently opened up on his plans for a global action film with actor Aamir Khan. He also spoke about the film's genre and the shooting schedule."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/stuntman-raju-insisted-on-doing-deadly-car-stunt-despite-warning-actor-vishal-2755956-2025-07-15",
      "headline": "Stuntman Raju insisted on doing deadly car stunt despite warning: Actor VishalActor Vishal said the late Tamil stuntman Raju was advised against performing the car stunt that led to his death on July 13. The actor emphasised that the stuntman insisted on doing it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rajkummar-rao-undergoes-intense-prep-for-saurav-ganguly-biopic-2755953-2025-07-15",
      "headline": "Rajkummar Rao undergoes intense prep for Saurav Ganguly's biopic, shares detailsRajkummar Rao has confirmed he will play Sourav Ganguly in the upcoming biopic, with filming to begin next year due to the intense preparation involved. The actor shared that he's training to bat left-handed and called it a huge responsibility to portray one of India's most iconic cricketers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pa-ranjith-mourns-stuntman-mohan-raj-devastating-death-shares-statement-2755947-2025-07-15",
      "headline": "Director Pa Ranjith, team mourn stuntman Mohan's devastating death, share statementStuntman Mohan Raj tragically died performing a car stunt for a film directed by Pa Ranjith, starring actor Arya. Condolences were expressed by actor Vishal and others in the film industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/jungkook-v-rm-instagram-live-bts-comeback-2026-tease-2755943-2025-07-15",
      "headline": "BTS members V, Jimin, Jungkook and RM host their most chaotic LIVE in yearsJungkook, V and RM surprised fans with a rare Instagram live session after years. After a brief IG live, they went live on Weverse where they were joined by Jimin. This hints at BTS's upcoming comeback album and rekindles excitement among the ARMY."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/four-years-later-review-shahana-show-redefines-indian-middle-class-trope-2755791-2025-07-15",
      "headline": "Four Years Later review: Shahana's series redefines Indian middle-class tropeRelease Date:Fri Jul 11, 2025Four Years Later review: 'Four Years Later', featuring Shahana Goswami and Akshay Ajit Singh is streaming on LionsgatePlay. The Australian-Indian show delves into the complexities of a young couple's marriage and personal aspirations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/jaws-at-50-the-definitive-inside-story-review-steven-spielbergs-shark-saga-still-has-bite-2755603-2025-07-15",
      "headline": "Jaws @ 50 The Definitive Story review: Steven Spielberg's shark saga still has biteRelease Date:Thu Jul 10, 2025The documentary 'Jaws @ 50: The Definitive Inside Story' dives into the legacy of Steven Spielberg's iconic shark thriller with rare footage and heartfelt insights, reminding us why 'Jaws' still makes waves."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/farah-khan-says-people-celebrated-tees-maar-khan-failure-2755863-2025-07-15",
      "headline": "Farah Khan says people celebrated Tees Maar Khan failure, felt they put her in placeFarah Khan shared that the failure of 'Tees Maar Khan' was met with open celebration by some in the film industry, with even former collaborators mocking her. Despite the backlash, she shared that the film has found popularity among Gen Z, who now consider it a cult favourite."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/travis-scott-adds-mumbai-show-delhi-sells-out-2755931-2025-07-15",
      "headline": "Travis Scott adds Mumbai concert to India tour after Delhi sells outRap star Travis Scott has announced another show in India, following the sell-out of his concert tickets for the Delhi show. Know more details here. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kriti-sanon-partner-kabir-bahia-cheer-team-india-lord-ground-india-england-test-2755879-2025-07-15",
      "headline": "Kriti Sanon and rumoured partner Kabir Bahia cheer for team India at Lord's groundActor Kriti Sanon recently joined her rumoured partner Kabir Bahia at the Lord's cricket ground for the India vs England test. Bahia shared his picture with Sanon on his Instagram story."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/prime-video-butterfly-trailer-daniel-dae-kim-spy-thriller-south-korea-august-2025-release-2755898-2025-07-15",
      "headline": "Butterfly trailer: Daniel Dae Kim's show blends global espionage with slick actionPrime Video has unveiled the official trailer for Butterfly, a spy thriller starring Daniel Dae Kim. The series explores global espionage and personal betrayal, set to premiere worldwide in August 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/harry-potter-series-in-production-dominic-mclaughlin-first-look-as-chosen-one-new-cast-details-out-2755882-2025-07-15",
      "headline": "Harry Potter series in production: Dominic McLaughlin, and new cast details outHBO kicks off production on the new Harry Potter series, revealing Dominic McLaughlin as the new Harry. Cast details, first look, and fan reactions inside."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/astronaut-shubhanshu-shukla-splashes-down-off-california-with-ax-4-crew-after-historic-space-mission-2756098-2025-07-15",
      "headline": "Welcome home, Shux. Shubhanshu Shukla returns after historic space voyageHis participation in this largely commercial and internationally collaborative mission is regarded as a major leap forward in India's human spaceflight journey and a stepping stone to the country's upcoming Gaganyaan mission."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/science/story/indias-shubhanshu-shukla-out-of-dragon-capsule-experiences-gravity-after-18-days-2756124-2025-07-15",
      "headline": "India's Shubhanshu Shukla out of Dragon capsule, experiences gravity after 18 daysIndia's Shubhanshu Shukla out of Dragon capsule, experiences gravity after 18 days"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/yemen-authorities-postpone-execution-of-indian-nurse-nimisha-priya-which-was-scheduled-for-july-16-sources-2756041-2025-07-15",
      "headline": "Kerala nurse Nimisha Priya's execution, set for tomorrow, postponed: SourcesYemeni authorities have postponed the execution of 36-year-old Kerala nurse Nimisha Priya, which was scheduled for tomorrow. She was sentenced to death in 2020 for the murder of a Yemeni national."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/teslas-india-debut-model-y-takes-centrestage-as-mumbai-showroom-opens-2755970-2025-07-15",
      "headline": "Tesla's India debut, Model Y takes centrestage as Mumbai showroom opens  Live UpdatesAmerican EV maker Tesla has opened its first showroom in India in Mumbai, and listed official pricing for two variants that are to be made available in India.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-us-trade-talks-dairy-agriculture-animal-feed-ban-milk-imports-religious-sensitivities-job-loss-2755700-2025-07-15",
      "headline": "Non-veg milk a red line in India-US trade talks. Here's whyAmid the India-US trade deal talks, Washington DC wants New Delhi to open its dairy market. But India insists on strict certification that ensures imported milk comes from cows not fed animal-based products like meat or blood. Rooted in religious and cultural sensitivities, India sees this as the \"non-negotiable red line\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/shubhanshu-shukla-return-from-space-station-to-earth-splashdown-live-updates-axiom-mission-4-timings-full-coverage-2755906-2025-07-15",
      "headline": "LIVE: Shubhanshu Shukla out of Dragon, experiences gravity after 18 daysThe SpaceX Dragon spacecraft carrying India's Shubhanshu Shukla and the multinational Ax-4 crew safely splashed down in the Pacific Ocean close to San Diego after undocking from the ISS a day before. Shukla's return marks a proud moment for India, as the nation celebrates its growing role in international space exploration. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/milestone-towards-gaganyaan-mission-pm-modi-welcomes-shubhanshu-shukla-as-he-returns-from-space-2756105-2025-07-15",
      "headline": "Milestone towards Gaganyaan mission: PM welcomes Shux as he returns from spaceIsro astronaut, Shubhanshu Shukla, returned after concluding an 18-day stay at the Space Station, along with his Axiom-4 crew. He splashed down near San Diego at approximately 3:01 pm IST, concluding the historic Axiom-4 (Ax-4) mission."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-modi-govts-4-rajya-sabha-picks-signal-shift-in-strategic-template-2755515-2025-07-14",
      "headline": "How Modi government's 4 Rajya Sabha picks signal shift in strategic templateThe Upper House of Parliament, often mocked as a place for defeated politicians or ageing notables, is being reimagined as an instrument of deep influence\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/prince-george-angry-face-at-wimbledon-final-viral-alcaraz-loses-to-sinner-2756036-2025-07-15",
      "headline": "Prince George's 'angry face' at Wimbledon final goes viral as Alcaraz loses to SinnerPrince George, seated with his family in the Royal Box, looked visibly unimpressed when Carlos Alcaraz lost the Wimbledon final to Jannik Sinner. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-rebukes-cartoonist-hemant-malviya-posts-pm-modi-rss-grants-interim-relief-2756094-2025-07-15",
      "headline": "Hadd hai! Kuch bhi keh loge: Supreme Court scolds cartoonist for PM, RSS postsThe Supreme Court, however, granted him interim protection from arrest to cartoonist Hemant Malviya. A case was registered against Malviya over derogatory cartoons targeting PM Modi and RSS."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-stays-life-sentence-bengaluru-murder-case-reformative-justice-2756103-2025-07-15",
      "headline": "Supreme Court sees 'wild romanticism' in fiance murder, pauses woman's life termThe Supreme Court stayed the life sentence of a woman convicted for plotting her fiance's murder with her boyfriend. The judgment identifies mental rebellion and societal pressures as key factors behind the crime."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bihar-sir-voter-list-revision-ground-zero-purnea-muzzafarpur-hajipur-deletions-aadhaar-confusion-2756009-2025-07-15",
      "headline": "At Ground Zero in Bihar, a common refrain: Voted in 2024, vanished in 2025In Bihar, the Special Intensive Revision (SIR) was initiated to update electoral rolls. However, India Today found that confusion and chaos reigns supreme on the ground. Individuals named in the 2024 rolls are being told they do not exist in the system."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/travel/story/worlds-biggest-edm-festival-tomorrowland-is-all-set-to-arrive-in-thailand-2755895-2025-07-15",
      "headline": "Tomorrowland, world's biggest EDM festival, is all set to arrive in ThailandOne of the most highly anticipated music festivals in the world, Tomorrowland is now coming to Asia for the first time ever. An immersive glimpse of the festival will take place in China in 2025 following a full-scale festival in Thailand. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/fir-against-director-pa-ranjith-and-others-in-stuntman-rajus-death-case-2756038-2025-07-15",
      "headline": "FIR against director Pa Ranjith and others in stuntman Raju's death caseA case has been filed against director Pa Ranjith and others after stuntman Mohan Raj died on the set of 'Vettuvam'. The incident raises questions about safety and legal accountability in film production."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-bans-solo-shia-pilgrimage-to-iraq-visa-illegal-overstay-iran-saudi-beggar-canada-2755990-2025-07-15",
      "headline": "Pakistan to ban Shias from travelling solo to IraqPakistan is set to bar solo travel by Shia pilgrims to Iraq, starting January 1, 2026, in an effort to curb visa overstays and illegal migration. The move comes after repeated concerns from Iraq, Iran, and other host countries, where Pakistani nationals have entered on valid visas but overstayed and engaged in illegal commercial activities."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/minor-accused-in-pune-porsche-crash-will-not-be-tried-as-adult-juvenile-justice-board-rejects-polices-plea-2756027-2025-07-15",
      "headline": "Minor accused in Pune Porsche crash will not be tried as adultThe Juvenile Justice Board has rejected the police's plea seeking to try the accused, who was a minor at the time of the accident, as an adult."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/no-time-to-be-a-child-inside-the-overloaded-lives-of-school-kids-2755988-2025-07-15",
      "headline": "No time to be a child: Inside the overloaded lives of school kidsAs schools stretch hours in the name of academic rigour, parents worry their children are running out of time to simply be kids."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/hyderabad/story/skeleton-found-in-locked-abandoned-house-near-nampally-hyderabad-man-died-years-ago-2755972-2025-07-15",
      "headline": "Boy's ball hunt leads to skeleton in locked house, death occurred 5 years agoA human skeleton was found inside a locked house near Nampally Market in Hyderabad. Police believe the death occurred at least four-five years ago and remained undetected for all these years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/devendra-fadnavis-tesla-india-entry-mumbai-showroom-innovation-sustainability-right-city-state-elon-musk-2756099-2025-07-15",
      "headline": "Right city, state: Devendra Fadnavis on Tesla's 1st India showroom in MumbaiMaharashtra Chief Minister Devendra Fadnavis praised Elon Musk's Tesla for choosing Mumbai to open its first showroom in India, saying the city stands for innovation and sustainability, similar to the automotive company. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/bombay-high-court-rahul-gandhi-veer-savarkar-remarks-petition-defamation-case-2756023-2025-07-15",
      "headline": "You know he will become PM? Court berates petitioner over Rahul Gandhi pleaThe petitioner, founder president of an organisation called Abhinav Bharat Congress, pointed out that Rahul Gandhi's 'immature and irresponsible' statements about Veer Savarkar were creating a lot of confusion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/kia-carens-clavis-ev-launched-in-india-price-starts-at-rs-1799-lakh-2755998-2025-07-15",
      "headline": "Kia Carens Clavis EV launched in India, price starts at Rs 17.99 lakhKia has launched the Carens Clavis EV in India, its first made-in-India EV. It is offered with two battery pack options: a 42kWh variant offering an ARAI-certified 404km range, and a larger 51.4kWh battery promising up to 490km (MIDC) on a single charge. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/udit-raj-merit-versus-reservation-dalit-representation-axiom-4-space-mission-2756046-2025-07-15",
      "headline": "Could have sent a Dalit person this time: Congress leader on Shux space missionCongress leader Udit Raj questions why a Dalit candidate was not selected for the Axiom-4 space mission. His remarks sparked social media backlash accusing him of politicising a scientific achievement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/two-spicejet-flyers-try-to-enter-cockpit-causing-flight-delay-offloaded-2755860-2025-07-15",
      "headline": "AC chala de: Video shows chaos on SpiceJet flight, 2 flyers try to enter cockpitA SpiceJet flight was delayed after two passengers attempted to forcefully enter the cockpit. They were later offloaded from the flight."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/theobroma-stake-sale-90-percent-chryscapital-accquisition-kainaz-messman-harchandrai-tina-messman-wykes-report-2755967-2025-07-15",
      "headline": "Theobroma to be sold, Rs 2,410-crore sweet deal baked by ChrysCapital: ReportFounded in 2004 by sisters Kainaz Messman Harchandrai and Tina Messman Wykes, Theobroma began with a single outlet at Cusrow Baug on Mumbai's Colaba Causeway. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/shanaya-kapoor-heartbreak-shelved-debut-film-bollywood-journey-2755965-2025-07-15",
      "headline": "Shanaya Kapoor on first film getting shelved: Was my biggest love and heartbreakActor Shanaya Kapoor opens up on her first film getting shelved, calling it her biggest heartbreak. She shares how her parents' guidance helped her grow and succeed in Bollywood."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/heer-express-trailer-ashutosh-rana-mentors-divita-juneja-acting-debut-wholesome-family-drama-2756029-2025-07-15",
      "headline": "Heer Express trailer: Ashutosh Rana mentors a young chef in wholesome entertainerThe trailer for Umesh Shukla's 'Heer Express' released on Tuesday, July 15. The upcoming film marks the acting debut of Divita Juneja."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/b-saroja-devi-passes-away-aged-87-donates-eyes-to-narayana-nethralaya-2755976-2025-07-15",
      "headline": "Legendary South actor B Saroja Devi's eyes donated as per her wishesLegendary South Indian actor B Saroja Devi's eyes were donated after her death. The 87-year-old died due to age-related ailments, and her corneas will soon be transplanted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/fir-against-director-pa-ranjith-and-others-in-stuntman-rajus-death-case-2756038-2025-07-15",
      "headline": "FIR against director Pa Ranjith and others in stuntman Raju's death caseA case has been filed against director Pa Ranjith and others after stuntman Mohan Raj died on the set of 'Vettuvam'. The incident raises questions about safety and legal accountability in film production."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/liam-dawson-shoaib-bashir-england-vs-india-manchester-test-2756122-2025-07-15",
      "headline": "Liam Dawson returns to Tests after 8 years to replace Shoaib BashirENG vs IND: Liam Dawson has replaced the injured Shoaib Bashir for the Manchester Test, scheduled to begin on July 23. On Monday, England took a 2-1 series lead after beating India by 22 runs. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhav-suryavanshi-archie-vaughan-beckhenam-youth-test-2756073-2025-07-15",
      "headline": "All-round Suryavanshi takes spotlight, Vaughan takes three in Youth TestIndia U19's Vaibhav Suryavanshi was back amongst the runs as he smashed a quickfire fifty while England U19's Archie Vaughan was the pick of the bowlers with three wickets on Day 3 of the Youth Test in Beckenham. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-womens-two-rankings-shafali-verma-top-10-batters-arundhati-2756100-2025-07-15",
      "headline": "ICC Women's T20I rankings: Shafali Verma returns to top 10 after England heroicsIndia opener Shafali Verma has returned to the top 10 in the ICC Women's T20I Batting Rankings, as per the latest update released on Tuesday. Shafali was the second-highest run-getter behind fellow opener Smriti Mandhana."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/james-anderson-wildcard-pick-manchester-originals-the-hundred-2024-2756085-2025-07-15",
      "headline": "Fast bowler James Anderson bags major T20 league contract at 42James Anderson has been selected by Manchester Originals as a wildcard for The Hundred 2025 season. Anderson retired from Test cricket, but the 42-year-old has been playing domestic cricket. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-lords-test-trott-reaction-anderson-tendulkar-trophy-2755975-2025-07-15",
      "headline": "Great for Test cricket: Jonathan Trott praises Lord's red-ball classicEngland vs India: Former England batsman Jonathan Trott has hailed the thrilling third Test in the Anderson-Tendulkar Trophy, saying it was great for red-ball cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-olympics-games-la-2028-dates-medal-matches-2755961-2025-07-15",
      "headline": "Cricket at LA Olympics to begin on July 12, medal matches on July 20 and 29Cricket's highly anticipated return to the Olympic Games at LA 2028 will begin on July 12, with medal matches scheduled for the 20th and 29th of the month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-jofra-archer-silences-keyboard-warriors-with-heroic-test-return-for-england-2755941-2025-07-15",
      "headline": "Jofra Archer silences keyboard warriors with heroic Test return for EnglandJofra Archer helped England seal a thrilling 22-run victory over India in the third Test — silencing the \"keyboard warriors\" who had written him off during his long absence from red-ball cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-alvaro-carreras-signing-sl-benfica-transfer-laliga-2755909-2025-07-15",
      "headline": "Real Madrid complete full-back Alvaro Carreras signing from SL BenficaReal Madrid have re-signed Alvaro Carreras from Benfica for €50 million, bringing the 22-year-old full-back back to his boyhood club as part of Xabi Alonso's defensive rebuild ahead of the new season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/roston-chase-reaction-west-indies-27-vs-australia-3rd-test-2755901-2025-07-15",
      "headline": "Heartbreaking, embarrassing: Chase after WI fold for 27 in shocking collapseWest Indies skipper Roston Chase has labelled his team's dramatic batting collapse against Australia in Jamaica as \"heartbreaking\" and \"embarrassing\", after they were dismissed for 27, one of the lowest scores in Test cricket history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mitchell-starc-fastest-five-wicket-haul-test-history-australia-sweep-west-indies-2755880-2025-07-15",
      "headline": "Mitchell Starc cherishes special week after historic spell in his 100th TestMitchell Starc starred in Australia's thumping win over the West Indies with a sensational six-wicket haul in the pink-ball Test. Celebrating his 100th Test, Starc became the fastest bowler to take a five-wicket haul in Test cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-ben-stokes-heart-soul-statistics-beyond-lords-test-2755868-2025-07-15",
      "headline": "Ben Stokes, England's heart and soul, is beyond the statsEngland captain Ben Stokes gave a jaw dropping performance in the Lord's Test match. Braving pain, Stokes bowled a total of 44 overs, in an effort that once again furthered his legacy as a true leader in world cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-jofra-archer-silences-keyboard-warriors-with-heroic-test-return-for-england-2755941-2025-07-15",
      "headline": "Jofra Archer silences keyboard warriors with heroic Test return for EnglandJofra Archer helped England seal a thrilling 22-run victory over India in the third Test — silencing the \"keyboard warriors\" who had written him off during his long absence from red-ball cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-alvaro-carreras-signing-sl-benfica-transfer-laliga-2755909-2025-07-15",
      "headline": "Real Madrid complete full-back Alvaro Carreras signing from SL BenficaReal Madrid have re-signed Alvaro Carreras from Benfica for €50 million, bringing the 22-year-old full-back back to his boyhood club as part of Xabi Alonso's defensive rebuild ahead of the new season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/roston-chase-reaction-west-indies-27-vs-australia-3rd-test-2755901-2025-07-15",
      "headline": "Heartbreaking, embarrassing: Chase after WI fold for 27 in shocking collapseWest Indies skipper Roston Chase has labelled his team's dramatic batting collapse against Australia in Jamaica as \"heartbreaking\" and \"embarrassing\", after they were dismissed for 27, one of the lowest scores in Test cricket history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mitchell-starc-fastest-five-wicket-haul-test-history-australia-sweep-west-indies-2755880-2025-07-15",
      "headline": "Mitchell Starc cherishes special week after historic spell in his 100th TestMitchell Starc starred in Australia's thumping win over the West Indies with a sensational six-wicket haul in the pink-ball Test. Celebrating his 100th Test, Starc became the fastest bowler to take a five-wicket haul in Test cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-ben-stokes-heart-soul-statistics-beyond-lords-test-2755868-2025-07-15",
      "headline": "Ben Stokes, England's heart and soul, is beyond the statsEngland captain Ben Stokes gave a jaw dropping performance in the Lord's Test match. Braving pain, Stokes bowled a total of 44 overs, in an effort that once again furthered his legacy as a true leader in world cricket."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}