{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-opens-flat-nifty-above-24950-eternal-adani-ports-among-top-gainers-2785464-2025-09-11",
      "headline": "Sensex, Nifty gain after flat opening amid US rate cut optimismThe S&P BSE Sensex gained over 100 points after a flat start, while the NSE Nifty50 briefly crossed the 25,000 mark."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/urban-company-dev-accelerator-shringar-house-of-mangalsutra-ipo-subscription-profit-gmp-today-2785445-2025-09-11",
      "headline": "3 IPOs in focus: Urban Company leads, but where's the bigger listing gain?Urban Company's was fully subscribed within a few hours, indicating high demand. Alongside Urban Company, two other IPOs, Dev Accelerator and Shringar House of Mangalsutra, are also open for bidding this week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/oracle-larry-ellison-surpasses-elon-musk-to-become-worlds-richest-person-2785281-2025-09-10",
      "headline": "Oracle's Larry Ellison surpasses Elon Musk to become world's richest personEllison's net worth jumped by an unprecedented $101 billion in a single day after Oracle Corp. delivered blowout quarterly results, sparking a record surge in its stock. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/from-20s-to-retirement-how-bonds-strengthen-your-finances-2785155-2025-09-10",
      "headline": "From 20s to retirement: How bonds strengthen your financesBonds don't grab headlines like stocks, but they quietly strengthen your finances across life stages. From building discipline in your 20s to ensuring stability in retirement, they remain a steady anchor for wealth creation. Here's how they work for you."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/india-crypto-regulation-document-government-no-plans-legal-report-2785132-2025-09-10",
      "headline": "Document shows India resisting complete crypto regulation: ReportWhile some countries like Japan and Australia are developing frameworks to regulate digital assets carefully, India remains cautious. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-extend-gains-on-us-trade-deal-hopes-and-fed-cut-buzz-2785124-2025-09-10",
      "headline": "Sensex, Nifty extend gains on US trade deal hopes and Fed rate cut buzzThe NSE Nifty 50 climbed 104.50 points to close at 24,973.10, while the BSE Sensex added 323.83 points, ending at 81,425.15. The Nifty has now gained for six straight sessions, with the Sensex rising in five of the last six trading days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/festive-season-stocks-that-you-should-add-to-your-portfolio-mahindra-nykaa-swiggy-maruti-dixon-2785106-2025-09-10",
      "headline": "Festive season stocks that you should add to your portfolioWith people ready to spend on home appliances, beauty products, lifestyle goods, and automobiles, investors are now looking for stocks that could benefit from this surge in demand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/is-your-credit-score-falling-here-is-how-to-fix-it-2785104-2025-09-10",
      "headline": "Is your credit score falling? Here's how to fix itHas your credit score recently taken a hit? You're not alone. Many people discover a drop only when applying for a loan or credit card. The good news is, most reasons are easy to fix with a few smart steps."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/fitch-rating-india-raises-outlook-economic-growth-7-percent-q2-performance-gst-reforms-rbi-rate-cut-2785047-2025-09-10",
      "headline": "Fitch raises India's growth forecast to 6.9% for FY26 on strong Q2 performanceThe revision comes after India's real GDP grew by 7.8% in the April–to-June quarter, surpassing expectations and marking an acceleration from the 7.4% growth seen in the previous three months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/delhi-high-court-asks-priya-kapur-to-list-sunjay-kapurs-assets-2784953-2025-09-10",
      "headline": "Delhi High Court asks Priya Kapur to list Sunjay Kapur's assetsThe legal dispute over the estate of the late businessman Sanjay Kapoor has reached the Delhi High Court. A suit has been filed by Karishma Kapoor's two children, who claim they are entitled to their father's personal assets as legal heirs. The High Court has registered the suit and will hear the matter on the 9th of October to decide on an interim stay. The children contend they have been informed they are not beneficiaries under Sanjay Kapoor's will, which they are now questioning and allege has been forged. In response, Priya Kapoor's counsel has told the court that the children \"have already been given 1900 crore worth of assets six days before the suit was even filed.\" The Delhi High Court has directed Priya Kapoor to file a list of all movable and immovable assets of Sanjay Kapoor known to her."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/this-crypto-exchange-eyes-3-billion-ipo-with-nasdaq-backing-2785006-2025-09-10",
      "headline": "This crypto exchange eyes $3 billion IPO with Nasdaq backingThe company, backed by the Winklevoss twins, plans to sell 16.67 million shares at a price between $24 and $26 each, up from its previous range of $17 to $19 per share. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-affordable-housing-demand-is-slowing-down-in-india-2784968-2025-09-10",
      "headline": "Why affordable housing demand is slowing down in IndiaAffordable housing was once the backbone of India's housing dream, offering budget-friendly options to urban families. But today, demand in this segment is slipping, as buyers increasingly feel these homes don't match their needs."
    }
  ],
  "entertainment": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tanishaa-mukerji-recalls-memory-loss-near-fatal-accident-debut-film-shoot-ssssshhh-2785457-2025-09-11",
      "headline": "Tanishaa Mukerji recalls memory loss after near-fatal accident on debut film shootActor Tanishaa Mukerji recalled her near-fatal accident on debut film 'Ssssshhh....' shoot. She revealed suffering from a concussion and memory loss. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/selena-gomez-wedding-plans-benny-blanco-reveals-her-ring-bearer-2785444-2025-09-11",
      "headline": "Selena Gomez blushes talking about wedding with Benny Blanco, reveals ring bearerActor Selena Gomez recently revealed details about her wedding plans with fiance Benny Blanco, teasing that the preparations were going well. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/manoj-bajpayee-jugnuma-premiere-viral-moment-with-anurag-kashyap-jaideep-ahllawat-vijay-varma-2785441-2025-09-11",
      "headline": "Manoj Bajpayee in splits as Jaideep, Anurag touch his feet at Jugnuma screeningActor Manoj Bajpayee found himself in a humorous situation at 'Jugnuma's' premiere. Jaideep Ahlawat, Anurag Kashyap, Vijay Varma and others playfully touched Bajpayee's feet and left him embarrassed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-battle-of-galwan-ladakh-shoot-colonel-b-santosh-babu-2785434-2025-09-11",
      "headline": "Salman Khan looks ripped in military uniform at Battle of Galwan shoot. See picA new picture of Salman Khan from the 'Battle of Galwan' shoot in Ladakh has emerged, showcasing his physical transformation for the role of Colonel B Santosh Babu. The film is directed by Apoorva Lakhia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sunita-ahuja-recalls-govinda-flirted-with-co-stars-only-sonali-bendre-was-spared-2785231-2025-09-10",
      "headline": "Sunita Ahuja recalls Govinda flirted with co-stars: Only Sonali Bendre was sparedSunita Ahuja appeared as a guest judge on 'Pati Patni Aur Panga' and shared fun insights about her actor-husband Govinda. She revealed Govinda flirted with many co-actors but never with Sonali Bendre, adding a nostalgic touch to the show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actor-mohini-was-forced-to-do-intimate-scene-in-kanmani-despite-discomfort-2785279-2025-09-10",
      "headline": "Actor Mohini says she was forced to do intimate scene in Kanmani despite discomfortActor Mohini revealed she was forced to perform intimate scenes in 'Kanmani' without her consent. She admitted that she was pressureised to shoot a swimsuit scene despite her discomfort."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/my-youth-review-song-joong-ki-returns-with-slow-burn-k-drama-not-for-everyone-2785291-2025-09-10",
      "headline": "My Youth review: Song Joong-ki returns with slow burn K-drama not for everyoneRelease Date:Fri Sep 05, 2025'My Youth' is a slow-burn romance K-drama starring Song Joong-ki and Chun Woo-hee. The series blends nostalgia with intimate storytelling, offering a soothing watch for romance fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/modern-family-star-eric-stonestreet-marries-his-longtime-partner-lindsay-schweitzer-2785270-2025-09-10",
      "headline": "Modern Family star Eric Stonestreet marries his longtime partner Lindsay SchweitzerEric Stonestreet, famed for his role in 'Modern Family', is married to his long-time girlfriend Lindsay Schweitzer in an intimate ceremony at their Kansas City home. The couple shared joyous moments on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/gauri-pradhan-reunites-former-actress-mayoori-kango-google-executive-2785262-2025-09-10",
      "headline": "Gauri Pradhan reunites with ex-actor friend, now industry head at Google IndiaGauri Pradhan recently met her long-time friend Mayoori Kango, now a Google India executive. Their reunion highlights Mayoori's journey from Bollywood to a successful corporate career, demonstrating significant transitions in her professional life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-congratulates-sivakarthikeyan-for-madharaasi-excellent-action-loved-it-2785250-2025-09-10",
      "headline": "Rajinikanth congratulates Sivakarthikeyan for Madharaasi: Excellent action, loved itTamil actor Sivakarthikeyan, whose latest film 'Madhaarasi' is currently running in theatres, shared the special message he got from his idol Rajinikanth on X. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anuparna-roy-venice-film-festival-win-indian-identity-palestine-comment-2785199-2025-09-10",
      "headline": "Director Anuparna Roy stands by Palestine remarks: Doesn't make me less IndianAnuparna Roy's debut film 'Songs of Forgotten Trees' won Best Director at the Venice Film Festival, marking a proud moment for Indian cinema. The young filmmaker shared her challenging journey and heartfelt gratitude towards the support from industry stalwarts like Anurag Kashyap and fellow Bollywood colleagues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/maheep-kapoor-bhavna-panday-bijuria-dance-karan-johar-varun-dhawan-janhvi-kapoor-2785208-2025-09-10",
      "headline": "Maheep, Bhavana say no to Bijuria dance, KJo turns to Varun-Janhvi for tipsFilmmaker Karan Johar shared a video of Maheep Kapoor and Bhavana Pandey declining to dance to 'Bijuria'. The request was made in an Instagram post termed 'reluctant nepo moms'. The post also referenced Varun Dhawan and Janhvi Kapoor for potential dance lessons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kunickaa-sadanand-son-ayaan-says-relationship-with-kumar-sanu-was-toxic-2785107-2025-09-10",
      "headline": "Kunickaa Sadanand's son Ayaan says her relationship with Kumar Sanu was very toxicActor Ayaan Lall opened up about his mother Kunickaa Sadanand's relationship with singer Kumar Sanu. He clarified the timeline and describes the relationship as toxic, shedding light on her post-divorce life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/demon-slayer-infinity-castle-a-beginners-guide-to-the-world-class-anime-hit-2785076-2025-09-10",
      "headline": "Demon Slayer Infinity Castle: A beginner's guide to the world-class anime hitWith 'Demon Slayer: Infinity Castle' releasing soon, fans in India can catch up by watching just a few key episodes instead of the entire series. The film has already set records with advance bookings and early morning screenings, promising an exciting experience for anime lovers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shehbaz-badesha-bigg-boss-19-entry-low-key-tv-nepotism-moment-2784940-2025-09-10",
      "headline": "Is Shehbaz Badesha's entry into Bigg Boss 19 a low-key TV nepotism moment?Shehbaz Badesha, brother of actor Shehnaaz Gill, is the first wild card contestant of 'Bigg Boss 19'. He made a brief appearance in the reality show's 13th season to support his sister. But does he deserve to be in this season?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aishwarya-rai-abhishek-bachchan-moves-court-protect-personality-rights-2785150-2025-09-10",
      "headline": "After Aishwarya, Abhishek Bachchan files plea on misuse of personality rightsAfter Aishwarya Rai, Abhishek Bachchan moved Delhi Court over personal rights protection.  He wants a ban on the unauthorised use of his images, name, voice, and performances. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kunickaa-sadanand-doodhwala-community-support-bigg-boss-19-controversy-2785010-2025-09-10",
      "headline": "Kunickaa gets support from 'doodhwala community', actor's son shares proofBigg Boss 19's Kunickaa Sadanand faced criticism inside the house but received unexpected support from the local 'doodhwala community.' Her son Ayaan Lall showcased this backing by sharing a video of milkmen rallying behind her."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/demon-slayer-infinity-castle-anime-film-30-crore-pre-sales-india-2785099-2025-09-10",
      "headline": "Demon Slayer: Infinity Castle and the rise of anime films in IndiaDemon Slayer: Infinity Castle is breaking box office records with over Rs 30 crore in advance bookings. This success signals a major shift as anime moves from niche to mainstream in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/varun-tej-lavanya-tripathi-welcome-a-baby-boy-2785123-2025-09-10",
      "headline": "Varun Tej-Lavanya Tripathi welcome baby boy, Chiranjeevi congratulates new parentsSouth actor couple Varun Tej and Lavanya Tripathi have announced the arrival of their first child, a baby boy. They announced pregnancy in May 2025. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/turning-point-usa-founder-charlie-kirk-shot-at-utah-valley-university-event-glbs-2785397-2025-09-11",
      "headline": "Trump ally Charlie Kirk shot dead on stage; door-to-door search for assassinCharlie Kirk, founder of Turning Point USA and staunch Trump ally, was shot dead at a Utah campus event. He was known for fiery Christian nationalist rhetoric and mobilising young conservatives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/surprising-shallow-ill-informed-india-slams-switzerlands-remarks-on-minorities-glbs-2785298-2025-09-10",
      "headline": "We can help you address racism: India schools Switzerland over minority remarkKshitij Tyagi's remarks came a day after Switzerland called on India to \"take effective measures to protect the minorities and uphold the rights to the freedom of expression and the freedom of the media.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/kamala-harris-calls-joe-biden-2024-re-election-bid-an-act-of-recklessness-glbs-2785401-2025-09-11",
      "headline": "Biden was driven by ego for 2024 re-election bid: Kamala Harris's bombshellIn her upcoming memoir 107 Days, former US Vice President Kamala Harris delivers her sharpest critique of Joe Biden, calling his 2024 re-election bid \"reckless\" and driven by ego rather than duty. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/charlie-kirk-shot-dead-moment-of-gun-attack-video-viral-screams-panic-utah-manhunt-shooter-2785458-2025-09-11",
      "headline": "Gunshot, screams, panic: Video captures moment Charlie Kirk was shot deadCharlie Kirk, founder of Turning Point USA, was answering a question about gun violence when a single gunshot rang out. As he abruptly slumped in his seat, chaos broke out."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-opium-capital-poppy-cultivation-balochistan-afghan-farmers-taliban-ban-2022-terror-funding-global-heroin-market-2785171-2025-09-11",
      "headline": "How Pakistan has become opium capital of the world with Afghan expertiseSprawling poppy fields in Pakistan's Balochistan have overtaken those in Afghanistan, which produced 80% of the world's opium. The Taliban's 2022 ban on poppy farming in Afghanistan pushed cultivators into Pakistan. With Afghan expertise and share-croppers, Pakistan has become the world's new opium hub."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/physiotherapists-not-doctors-cant-use-dr-prefix-governments-health-authority-2785380-2025-09-10",
      "headline": "Physiotherapists not doctors, can't use 'Dr' prefix: Government's health authorityThe Directorate General of Health Services said that physiotherapists are not trained as medical doctors and should not present themselves as such."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/oracle-larry-ellison-surpasses-elon-musk-to-become-worlds-richest-person-2785281-2025-09-10",
      "headline": "Oracle's Larry Ellison surpasses Elon Musk to become world's richest personEllison's net worth jumped by an unprecedented $101 billion in a single day after Oracle Corp. delivered blowout quarterly results, sparking a record surge in its stock. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/air-india-singapore-plane-passengers-deboard-faulty-air-conditioning-delhi-airport-2785438-2025-09-11",
      "headline": "Seated for 2 hours, passengers deplaned from Air India flight due to faulty ACThe Boeing 787-9 Dreamliner aircraft was scheduled to depart from Delhi at 11 pm on Wednesday night. The passengers were seated for almost two hours before being asked to deboard the plane."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/i-am-an-obesity-doctor-and-i-know-weight-loss-management-tricks-beyond-calories-gym-sleep-2785112-2025-09-11",
      "headline": "I'm an obesity doctor and here's my realistic, guilt-free guide to weight lossIn this DocYard column, renowned bariatric surgeon Dr. Muffazal Ladkawala explains the actual reason behind obesity and how small habits and the right mindset can help one manage weight amid a busy schedule."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-condemns-violation-of-brotherly-states-sovereignty-pm-tells-qatari-emir-slams-israeli-attack-on-doha-2785288-2025-09-10",
      "headline": "Violation of sovereignty: PM calls Qatar Emir, condemns Israeli strikes on DohaQatar is a key US ally and a mediator in the Gaza peace talks. The attack took place at a time when several Hamas leaders were in Doha to participate in the US-backed ceasefire talks. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/charlie-kirk-shot-dead-utah-campus-event-turning-point-usa-founder-2785433-2025-09-11",
      "headline": "Charlie Kirk: Proud dropout, political provocateur and Trump confidanteCharlie Kirk made his name sparring with college students in open-air debates on issues ranging from transgender rights to climate policy. Trump valued the popular podcaster as an adviser with a strong feel for the Republican youth base."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/new-iphone-is-here-and-it-is-time-again-for-the-holy-war-android-iphone-17-iphone-air-apple-google-pixel-2785192-2025-09-10",
      "headline": "iPhone 17 is here and it's time to discuss the great smartphone scamWhether you're Team Apple or Team Android, you're all suckers in this grand smartphone scam. These devices promise connection but deliver isolation: one notification at a time. So next time you pull out your precious gadget, remember: it's not a status symbol, it's a shiny leash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/is-motherhood-off-limits-for-women-facing-mental-health-problems-depression-anxiety-2785178-2025-09-11",
      "headline": "Is motherhood off-limits for women facing mental health issues?Is your mental health condition casting a major question mark over your desire to become a mother? Perhaps this article will help you come to a conclusion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/sunjay-kapur-estate-dispute-priya-kapur-karisma-kapoor-children-1900-crore-trust-2785348-2025-09-10",
      "headline": "Karisma Kapoor's children got Rs 1,900 crore: Late Sunjay Kapur's wife to courtThe late businessman Sunjay Kapur's widow Priya Kapur told the Delhi High Court that Karisma Kapoor's children had already received Rs 1,900 crore from a family trust before filing their inheritance suit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/nepal-gen-z-protest-army-chief-sigdel-hindu-king-prithvi-narayan-shah-portrait-monarchy-return-speculation-2784961-2025-09-10",
      "headline": "Hindu king's portrait behind Nepal Army chief. Is there a message?When Nepal Army chief, General Ashok Raj Sigdel, addressed a restless nation on Tuesday, it wasn't just his call for peace that was important. A portrait of King Prithvi Narayan Shah hung prominently behind him. Is there a message behind the image of the Hindu king, founder of Nepal's Shah dynasty?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/charlie-kirk-assassination-donald-trump-mourns-beloved-conservative-leader-2785426-2025-09-11",
      "headline": "Will find each and every one: Trump after close ally Charlie Kirk assassinatedUS President Donald Trump mourned Charlie Kirk's death, calling him a true patriot. Flags across the nation are ordered to half-mast in his honour. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-kuleep-yadav-artistry-uae-india-no-1-spinner-2785431-2025-09-11",
      "headline": "Never complains, always delivers: Kuldeep Yadav reminds why he's India's No.1 spinnerAsia Cup: After months on the sidelines, Kuldeep Yadav unleashed a flawless spin masterclass, leaving a clueless UAE in tatters and proving once again why he's India's deadliest spinner."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/nepal-gen-z-stir-toll-rises-to-30-sushila-karki-poised-to-head-interim-government-glbs-2785400-2025-09-11",
      "headline": "Nepal Gen Z stir toll rises to 30, Sushila Karki poised to head interim governmentNepal protests left 30 dead and over 1,000 injured. Gen Z backed ex-Chief Justice Sushila Karki to lead an interim government. Army enforced curfew, flights resumed, and global leaders urged restraint."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/prince-harry-and-king-charles-reunite-in-london-after-year-of-tensions-glbs-2785404-2025-09-11",
      "headline": "Prince Harry and King Charles reunite in London after year of tensions Prince Harry and King Charles III reunited for tea at Clarence House, their first meeting in over a year, sparking speculation about reconciliation amid strained ties, security disputes, and past family divisions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/94-gen-z-prefer-visual-first-workplaces-but-companies-lag-behind-study-2785235-2025-09-11",
      "headline": "94% Gen Z prefer visual-first workplaces, but companies lag behind: StudyGen Z professionals say 94% of their best work happens visually, yet only 22% of companies worldwide describe themselves as design-led, exposing a growing gap that slows productivity and weakens engagement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-battle-of-galwan-ladakh-shoot-colonel-b-santosh-babu-2785434-2025-09-11",
      "headline": "Salman Khan looks ripped in military uniform at Battle of Galwan shoot. See picA new picture of Salman Khan from the 'Battle of Galwan' shoot in Ladakh has emerged, showcasing his physical transformation for the role of Colonel B Santosh Babu. The film is directed by Apoorva Lakhia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/chinese-defence-minister-dong-jun-warns-us-against-attempts-to-deter-it-through-taiwan-2785289-2025-09-10",
      "headline": "Attempts to deter us will fail, warns China; US says it's not seeking regime changeThe Chinese and US defence officials discussed Taiwan, the South China Sea, and broader military ties at a time of heightened regional unease in South Asia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/nasa-says-perseverance-rover-discovered-potential-signs-of-life-on-mars-in-2024-2785303-2025-09-10",
      "headline": "Nasa says Perseverance Rover discovered potential signs of life on Mars in 2024Scientists say the sample contains potential biosignatures, substances or structures that might have a biological origin but require rigorous testing before any claims about life on Mars can be made."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-woman-places-newborn-in-refrigerator-goes-to-sleep-baby-safe-2785066-2025-09-10",
      "headline": "Woman puts baby in fridge; family blames 'evil forces,' doctor diagnoses psychosisThe incident took place last Friday when the woman, who had recently given birth to a baby boy, reportedly put the infant in the refrigerator and went to sleep."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-moves-family-greece-serbian-protests-political-tensions-2785413-2025-09-11",
      "headline": "Novak Djokovic shifts family to Greece as Serbian protests intensify: ReportsNovak Djokovic has quietly relocated his family to Greece amid growing political pressure in Serbia. This move follows his open support for student protests and signals increasing tensions with the Serbian government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-shivam-dube-gautam-gambhir-message-ind-vs-pak-2785453-2025-09-11",
      "headline": "Asia Cup 2025: Shivam Dube recalls Gautam Gambhir's message ahead of IND vs PAK clashAsia Cup 2025: Shivam Dube highlights Gautam Gambhir's philosophy that every game for India is a chance to do something miraculous. Despite criticism on the Asia Cup's competitiveness, the team remains focused on playing each match with pride."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-beat-england-by-14-runs-in-rain-affected-cardiff-t20i-brevis-shines-2785451-2025-09-11",
      "headline": "After huge SA20 auction, South Africa edge past England in rain-marred 1st T20ISouth Africa defeated England by 14 runs in a rain-affected first T20I at Cardiff on Wednesday. The win came just after the record-breaking SA20 auction where Dewald Brevis shattered records."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-vs-hong-kong-asia-cup-2024-group-b-clash-abu-dhabi-preview-2784980-2025-09-11",
      "headline": "Riding on hat-trick win, Bangladesh look for clinical start vs Hong KongBangladesh face Hong Kong in a crucial Asia Cup Group B clash in Abu Dhabi. Hong Kong will be looking to bounce back from their defeat to Afghanistan, while the Tigers aim for a winning start at the Sheikh Zayed Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-kuleep-yadav-artistry-uae-india-no-1-spinner-2785431-2025-09-11",
      "headline": "Never complains, always delivers: Kuldeep Yadav reminds why he's India's No.1 spinnerAsia Cup: After months on the sidelines, Kuldeep Yadav unleashed a flawless spin masterclass, leaving a clueless UAE in tatters and proving once again why he's India's deadliest spinner."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-kuldeep-yadav-aggressive-bowler-shane-warne-conversation-vs-uae-2785394-2025-09-11",
      "headline": "How Shane Warne's advice turned Kuldeep Yadav into an aggressive bowlerKuldeep Yadav's four-wicket burst against UAE was more than a comeback, it was a statement. Guided by Shane Warne's wisdom, the left-arm wrist-spinner showcased aggression, control, and the resilience of his reinvention."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/draymond-green-defends-sabonis-incident-lebron-james-nba-controversy-2784777-2025-09-11",
      "headline": "Draymond Green finally opens up about Sabonis' incident: Gotta get him backDraymond Green opened up about his controversial NBA incidents involving Domantas Sabonis and LeBron James. He stood by his actions, emphasising the circumstances and his need to defend himself on court."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-uae-asia-cup-shivam-dube-hardik-pandya-press-conference-2785391-2025-09-11",
      "headline": "Hardik Pandya is like my brother, I can't compare myself with him: Shivam DubeAsia Cup 2025: Shivam Dube made the most of his bowling opportunity, taking three wickets in two overs against the UAE on Wednesday. The all-rounder later spoke about the lessons he has gained while playing alongside Hardik Pandya in the T20I side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-beat-uae-suryakumar-yadav-reaction-pakistan-clash-2785350-2025-09-10",
      "headline": "Asia Cup: Suryakumar Yadav excited for Pakistan match after decimating UAEAfter hammering the UAE by nine wickets in their Asia Cup opener, India captain Suryakumar Yadav said that the Indian team was extremely excited about their next group clash against arch-rivals Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-vs-uae-kluldeep-yadav-does-not-mince-words-heroic-bowling-comeback-2785349-2025-09-10",
      "headline": "Kuldeep Yadav doesn't mince words on recent snubs after Asia Cup heroicsKuldeep Yadav bounced back in style after missing India's Test series in England, with a sensational sepll in India's Asia Cujp opener. His four-wicket haul against UAE underlined that he remains a key match-winner in the shortest format."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-kuldeep-yadav-aggressive-bowler-shane-warne-conversation-vs-uae-2785394-2025-09-11",
      "headline": "How Shane Warne's advice turned Kuldeep Yadav into an aggressive bowlerKuldeep Yadav's four-wicket burst against UAE was more than a comeback, it was a statement. Guided by Shane Warne's wisdom, the left-arm wrist-spinner showcased aggression, control, and the resilience of his reinvention."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/draymond-green-defends-sabonis-incident-lebron-james-nba-controversy-2784777-2025-09-11",
      "headline": "Draymond Green finally opens up about Sabonis' incident: Gotta get him backDraymond Green opened up about his controversial NBA incidents involving Domantas Sabonis and LeBron James. He stood by his actions, emphasising the circumstances and his need to defend himself on court."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-uae-asia-cup-shivam-dube-hardik-pandya-press-conference-2785391-2025-09-11",
      "headline": "Hardik Pandya is like my brother, I can't compare myself with him: Shivam DubeAsia Cup 2025: Shivam Dube made the most of his bowling opportunity, taking three wickets in two overs against the UAE on Wednesday. The all-rounder later spoke about the lessons he has gained while playing alongside Hardik Pandya in the T20I side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-beat-uae-suryakumar-yadav-reaction-pakistan-clash-2785350-2025-09-10",
      "headline": "Asia Cup: Suryakumar Yadav excited for Pakistan match after decimating UAEAfter hammering the UAE by nine wickets in their Asia Cup opener, India captain Suryakumar Yadav said that the Indian team was extremely excited about their next group clash against arch-rivals Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-vs-uae-kluldeep-yadav-does-not-mince-words-heroic-bowling-comeback-2785349-2025-09-10",
      "headline": "Kuldeep Yadav doesn't mince words on recent snubs after Asia Cup heroicsKuldeep Yadav bounced back in style after missing India's Test series in England, with a sensational sepll in India's Asia Cujp opener. His four-wicket haul against UAE underlined that he remains a key match-winner in the shortest format."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-fastest-t20-chase-58-runs-kuldeep-yadav-asia-cup-2025-uae-win-2785325-2025-09-10",
      "headline": "Asia Cup: Kuldeep Yadav, Shivam Dube bowl India to record-breaking win over UAEAsia Cup 2025: India began their campaign in Dubai with a thumping nine-wicket win over the UAE. By chasing 58 in just 4.3 overs, India registered their fastest chase in men's T20I cricket on Wednesday in Dubai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-suryakumar-withdraws-appeal-ind-vs-uae-spirit-of-cricket-2785313-2025-09-10",
      "headline": "Spirit of Cricket award for Suryakumar? India withdraw appeal vs UAE in Asia CupAsia Cup 2025: Suryakumar Yadav showed true sportsmanship by withdrawing an appeal against a UAE batter whose stumping came after a momentary distraction. India, meanwhile, were clinical with the ball, dismissing the hosts for just 57 in 13.1 overs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-vs-uae-playing-xi-sanju-samson-reaction-2785275-2025-09-10",
      "headline": "Sanju Samson fans delighted as captain Suryakumar keeps his promiseAsia Cup 2025: Ending weeks-long suspense, India included Sanju Samson in the playing XI despite bringing Shubman Gill back to the fold. Samson's fans were thrilled as the team management backed him on the big stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-shubman-gill-returns-india-vs-uae-asia-cup-toss-playing-xi-2785255-2025-09-10",
      "headline": "Sanju Samson retains spot despite Shubman Gill's inclusion in Asia Cup openerStar wicketkeeper Sanju Samson retained his spot in India's playing XI for the Asia Cup T20 opener against hosts UAE in Dubai on Thursday, even with vice-captain Shubman Gill returning to the side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-back-sanju-samson-harshit-rana-varun-chakaravarthy-2785214-2025-09-10",
      "headline": "From KKR to Team India: How Gautam Gambhir backs players when they themselves don'tGautam Gambhir's greatest strength as a coach lies beyond tactics — it's his unwavering faith in players. From Harshit Rana to Sanju Samson and Varun Chakravarthy, he backs them when they doubt themselves, turning belief into performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-tickets-sale-india-pakistan-package-dubai-abu-dhabi-2785194-2025-09-10",
      "headline": "Asia Cup 2025 Tickets Online: India vs Pakistan match booking and price guideTickets for Asia Cup 2025 are now available for purchase online and at stadium box offices. Fans can choose from various pricing tiers and special packages ahead of the September tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jofra-archer-icc-odi-ranking-third-career-best-south-africa-heroics-2785196-2025-09-10",
      "headline": "Jofra Archer rises to career-best ICC ODI rankings after South Africa heroicsJofra Archer's searing performance against South Africa has propelled him to a career-best No.3 in the ICC ODI Rankings, marking a milestone comeback as he eyes England's next assignment against New Zealand in October."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-back-sanju-samson-harshit-rana-varun-chakaravarthy-2785214-2025-09-10",
      "headline": "From KKR to Team India: How Gautam Gambhir backs players when they themselves don'tGautam Gambhir's greatest strength as a coach lies beyond tactics — it's his unwavering faith in players. From Harshit Rana to Sanju Samson and Varun Chakravarthy, he backs them when they doubt themselves, turning belief into performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-tickets-sale-india-pakistan-package-dubai-abu-dhabi-2785194-2025-09-10",
      "headline": "Asia Cup 2025 Tickets Online: India vs Pakistan match booking and price guideTickets for Asia Cup 2025 are now available for purchase online and at stadium box offices. Fans can choose from various pricing tiers and special packages ahead of the September tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jofra-archer-icc-odi-ranking-third-career-best-south-africa-heroics-2785196-2025-09-10",
      "headline": "Jofra Archer rises to career-best ICC ODI rankings after South Africa heroicsJofra Archer's searing performance against South Africa has propelled him to a career-best No.3 in the ICC ODI Rankings, marking a milestone comeback as he eyes England's next assignment against New Zealand in October."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/arshdeep-singh-icc-t20i-bowling-rankings-ravi-bishnoi-2785179-2025-09-10",
      "headline": "Arshdeep Singh moves up in ICC rankings for bowlers in T20IsIndian spinner Ravi Bishnoi and left-arm seamer Arshdeep Singh moved up to the sixth and 10th spots respectively in the latest ICC T20 rankings released on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-uae-live-score-asia-cup-group-a-match-today-updates-dubai-2785184-2025-09-10",
      "headline": "India vs UAE highlights: India hammer UAE to complete record winIndia (IND) vs United Arab Emirates (UAE) highlights: India made a strong statement, wrapping up the game in less than 2 hours. UAE struggled throughout, with only an opening stand of 26 giving them any hope. India completely dominated, finishing the match in just four and a half overs. Abhishek and Gill played brilliant shots. In the bowling, Kuldeep Yadav took four wickets, and Shivam Dube picked up three, as the UAE were bowled out for just 57 in Dubai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/pv-sindhu-early-exit-hong-kong-open-indian-men-advance-2785165-2025-09-10",
      "headline": "After World Championships high, PV Sindhu exits Hong Kong Open in first roundHong Kong Open 205: India's top-ranked women's singles star PV Sindhu exited the Super 500 tournament in the first round after losing to lower-ranked Line Christophersen. Lakshya Sen and HS Prannoy, however, progressed to the second round with contrasting wins on Wednesday, September 10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-platinum-blonde-hair-us-open-2025-win-2785136-2025-09-10",
      "headline": "After US Open disaster, Alcaraz breaks the internet with refreshing blonde lookCarlos Alcaraz's platinum blonde hairstyle is making waves after his US Open 2025 triumph. His confident new look reflects his bold personality as he reclaims the World No. 1 ranking."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-tickets-dubai-businessman-buys-employees-2785125-2025-09-10",
      "headline": "Dubai businessman buy 700 tickets, distributes for free to blue-collar workersAsia Cup is being hosted in the United Arab Emirates. A Dubai businessman has decided to sponsor tickets for 700 of his employees. Here's why."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-womens-world-cup-2025-squad-announced-chamari-athapaththu-leads-2785095-2025-09-10",
      "headline": "Chamari Athapaththu to lead Sri Lanka 15-member squad for Women's World CupSri Lanka has announced a strong 15-member squad for the Women's World Cup 2025. Chamari Athapaththu, their most experienced cricketer, will lead them in the upcoming mega event to start from September 30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chicago-bulls-re-sign-josh-giddey-after-breakout-season-2784766-2025-09-10",
      "headline": "Bulls re-sign Josh Giddey after record-breaking debut seasonChicago Bulls have re-signed guard Josh Giddey following his impressive debut season. This deal secures a rising star who matched historic NBA milestones and promises a bright future for the team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-womens-odi-third-match-moved-to-hobart-floodlight-delays-2785028-2025-09-10",
      "headline": "India vs Australia 3rd Women's ODI shifted to Hobart from MelbourneThe third women's ODI between India and Australia has been moved from Melbourne to Hobart due to floodlight installation delays. India will play three ODIs, three T20Is and one Test on the tour of Australia in 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-sanju-samson-bcci-video-shubman-gill-speculations-2785029-2025-09-10",
      "headline": "Asia Cup: BCCI's latest clip of Sanju Samson leaves fans scratching their heads amidst selection dramaFans were left scratching their head after a bizarre ending to their latest video showing Sanju Samson ahead of their Asia Cup 2025 opener against the UAE. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/e-sports/story/bgms-season-4-playoffs-top-eight-teams-qualify-semi-finals-2025-2784773-2025-09-10",
      "headline": "BGMS season 4 playoffs end with top eight teams in semi-finalsThe BGMS Season 4 playoffs concluded with the top eight teams advancing to the semi-finals. Intense matches are expected as seasoned teams compete for the championship title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-vs-pakistan-shaheen-afridi-form-2784983-2025-09-10",
      "headline": "Shaheen Afridi is back in his rhythm: Wasim AkramFormer cricketer Wasim Akram is excited to see Shaheen Shah Afridi in the Asia Cup. The star fast bowler is slowly gaining form after months of poor performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-2025-pat-cummins-comeback-plan-back-injury-concerns-2784985-2025-09-10",
      "headline": "Pat Cummins sets Ashes comeback plan amidst back injury concernsPat Cummins is aiming for a swift recovery from his lumbar bone stress injury to return in time for the home Ashes. Confident about Australia's bowling depth, the skipper is determined to push himself to be fit for the first Test against England in Perth.  \r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}