{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/luxury-real-estate-dlf-camellias-delhi-ncr-ultra-rich-property-celebrity-shikhar-dhawan-rishi-parti-2730692-2025-05-26",
      "headline": "The billionaire blueprint: Inside DLF's ultra-luxury playbookWelcome to the new epicentre of ultra-luxury in India, where DLF isn't just selling apartments, it is curating a billionaire lifestyle and cashing in on the growing trend of 'living life king-size'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-455-points-higher-nifty-settles-above-25000-eternal-tanks-5-2730715-2025-05-26",
      "headline": "Sensex ends 455 points higher, Nifty settles above 25,000; Eternal tanks 5%At the closing bell, the BSE Sensex was up 455.37 points to 82,176.45, while the NSE Nifty50 settled 148 points higher at 25,001.15. The broader markets also performed well during the session, extending the rally in mid-cap and small-cap stocks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/is-lta-exempt-under-the-new-tax-regime-what-you-should-know-2730656-2025-05-26",
      "headline": "Is LTA exempt under the New Tax Regime? What you should knowLeave Travel Allowance (LTA) is a common perk in many salary packages, yet with two tax regimes in place, people often ask if the exemption holds true in the new tax regime. Let's find out in this article."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/supreme-court-puts-bhushan-power-liquidation-on-hold-amid-jsw-review-plea-2730641-2025-05-26",
      "headline": "Supreme Court puts Bhushan Power liquidation on hold as JSW seeks reviewThis interim order effectively pauses the liquidation process of BSPL, offering JSW a window to pursue legal recourse and protect its investment interests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filing-itr-for-2025-here-is-why-you-must-verify-your-ais-and-form-26as-first-2730625-2025-05-26",
      "headline": "Filing ITR for 2025? Here's why you must verify your AIS and Form 26AS firstOne of the most important things you should do before filing your return is to check your Annual Information Statement (AIS) and Form 26AS. These documents contain details of your income and financial transactions during the year. If you forget to report something, you could end up receiving a notice from the tax department."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/radico-khaitan-launches-trikal-and-morpheus-premium-whiskies-2730624-2025-05-26",
      "headline": "Radico Khaitan launches TRIKĀL and Morpheus whiskiesWith the new launches, the company's goal is to dominate both the luxury and super-premium categories, building on the global success of its flagship Rampur Indian Single Malt."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-utilities-not-live-yet-will-the-e-filing-deadline-be-extended-2730597-2025-05-26",
      "headline": "ITR utilities not live yet: Will the e-filing deadline be extended?Many taxpayers are wondering if the delay in these filing tools means the return filing deadline will be pushed. But that's unlikely. The deadline for those who don't need to get their accounts audited remains July 31, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/belrise-industries-ipo-allotment-status-online-guide-check-latest-gmp-listing-date-2730551-2025-05-26",
      "headline": "Belrise Industries IPO allotment: Step-by-step guide to check statusThe IPO received a good response from all types of investors. By the end of the three-day bidding period on May 23, it was subscribed 43.14 times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/nibe-share-price-rise-5-percent-upper-circuit-why-reason-new-order-israel-2730514-2025-05-26",
      "headline": "Explained: Why NIBE share price surged 5% to hit upper circuit todayNIBE share price: The shares of NIBE Ltd surged 5% to hit the upper circuit. The stock has lost 4.43% in the last 5 days, but has gained 18.22% in the past month. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/aegis-vopak-terminals-ipo-open-bidding-subscribe-skip-details-expert-review-gmp-today-2730498-2025-05-26",
      "headline": "Aegis Vopak Terminals IPO: Subscribe or skip Rs 2,800 crore listing? Check GMPBefore the public issue opened, the company raised Rs 1,259.99 crore from 32 anchor investors. This money was raised at the upper end of the price band, which is Rs 235 per share."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/eternal-zomato-share-price-falling-today-global-index-msci-ftse-cut-weights-explained-2730494-2025-05-26",
      "headline": "Eternal shares tumble over 3% in early trade. Why is the stock falling?The Zomato stock was trading 3.17% lower on the NSE at 9:38 am, making it the only significant laggard among Nifty50 constituents during morning trade. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-gain-why-is-stock-market-rising-3-reasons-why-tariff-pause-4th-largest-economy-rbi-dividend-monsoon-2730489-2025-05-26",
      "headline": "Sensex gains 750 points: 3 reasons why stock market is rising todayStock market rally: Sensex surged over 700 points to 82,437.76 in early trade, while Nifty gained over 200 points to 25,063.65 as of 9:50 am."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/singer-demi-lovato-marries-jordan-jutes-in-la-wears-vivienne-westwood-corset-gown-2730770-2025-05-26",
      "headline": "Singer Demi Lovato marries Jordan Jutes in LA, wears Vivienne Westwood corset gownSinger and actor Demi Lovato on Sunday got married to her fiancé, Jordan Jutes Lutes, in California. The bride wore a custom Vivienne Westwood corset dress for the ceremony. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/celebrity/story/actor-chhavi-mittal-on-tahira-kashyaps-advice-during-cancer-diagnosis-gave-me-confidence-2730714-2025-05-26",
      "headline": "Actor Chhavi Mittal says Tahira Kashyap gave her 'confidence' during cancer battleActor Chhavi Mittal said that Tahira Kashyap was the first person she had a long conversation with during her breast cancer diagnosis. Chhavi shared how Tahira's advice gave her clarity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/sunny-leone-wraps-shoot-for-her-first-hollywood-film-leaked-photos-2730731-2025-05-26",
      "headline": "Sunny Leone wraps shoot for her first independent Hollywood film. See picsSunny Leone is set to make her debut in an independent Hollywood film, playing a United Nations peacekeeping soldier."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rakesh-roshan-switches-to-hulk-mode-at-75-with-heavy-workout-son-hrithik-roshan-goes-uff-watch-viral-video-2730739-2025-05-26",
      "headline": "Rakesh Roshan switches to Hulk mode at 75 with heavy workout, Hrithik commentsFilmmaker Rakesh Roshan shared an inspiring video on social media. The 'Krrish' director could be seen working out dedicatedly in a gym, trying to make the 'best' of every day. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/seventeen-releases-happy-burstday-album-on-10th-anniversary-with-solo-tracks-2730713-2025-05-26",
      "headline": "SEVENTEEN releases Happy Burstday album on 10th anniversary with solo tracksSEVENTEEN commemorated their 10th anniversary by releasing their fifth studio album, 'Happy Burstday'. The album highlights individual member projects and features global artists Pharrell Williams and Timbaland."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dacoit-glimpse-out-adivi-sesh-mrunal-thakurs-film-for-christmas-release-2730689-2025-05-26",
      "headline": "Dacoit glimpse out: Adivi Sesh-Mrunal Thakur's film for Christmas releaseThe makers of Adivi Sesh's much-awaited bilingual 'Dacoit' have unveiled a fiery glimpse video. The film is releasing on December 25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-expresses-admiration-for-fahadh-faasil-at-cannes-aavesham-is-my-favourite-2730682-2025-05-26",
      "headline": "Alia Bhatt expresses admiration for Fahadh Faasil: Aavesham is my favouriteAlia Bhatt, who made her debut at Cannes, recently expressed her admiration for Malayalam actor Fahadh Faasil and said that she would definitely be interested in working with him. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/actor-ishaan-khatter-on-feeling-safe-shooting-intimate-scenes-with-naughty-tabu-2730675-2025-05-26",
      "headline": "Ishaan Khatter on 'feeling safe' shooting intimate scenes with 'naughty' TabuActor Ishaan Khatter recently recalled her 'A Suitable Boy' days with co-star Tabu. The actor appreciated Tabu for being supportive while filming intense scenes. He will next be seen in Neeraj Ghaywan's 'Homebound.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-says-raha-has-transformed-her-emotionally-everyone-pain-affects-you-2730644-2025-05-26",
      "headline": "Alia Bhatt says Raha has transformed her emotionally: Everyone's pain affects youActor Alia Bhatt talked about motherhood bringing a whirlwind of changes in her. She mentioned feeling more empathetic and concerned about people's feelings, and looking at the world from a whole new perspective. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/retro-ott-release-when-and-where-to-watch-suriyas-gangster-drama-2730606-2025-05-26",
      "headline": "Retro OTT release: When and where to watch Suriya's gangster dramaSuriya and director Karthik Subbaraj's 'Retro' had a decent run at the box office. The film is all set to stream on an OTT platform later this week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/gurmeet-choudhary-debina-bonnerjee-hina-khan-rocky-jaiswal-colors-tv-pati-patni-aur-panga-2730632-2025-05-26",
      "headline": "Gurmeet-Debina, Hina-Rocky star in new show Pati, Patni Aur PangaColors TV is set to launch a new reality show, 'Pati, Patni Aur Panga', featuring popular celebrity couples. The show promises exciting challenges and a fresh take on couples competing together."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/yg-2025-blueprint-blackpink-treasure-baby-monster-new-rookies-unveiled-2730556-2025-05-26",
      "headline": "Blackpink headlines YG's 2025 Blueprint featuring Treasure, BabyMonsterYG's executive producer, Yang Hyun-suk unveiled a new plan to boost activities for artists like Blackpink, Baby Monster, and Treasure, while also accelerating the debut of new talents. He announced the upcoming projects of Blackpink and the release of their new album and world tour 'Deadline' following the teaser release on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prabhas-to-have-a-30-minute-extended-cameo-in-kannappa-reveals-vishnu-manchu-2730571-2025-05-26",
      "headline": "Prabhas to have a 30-minute extended cameo in Kannappa, reveals Vishnu ManchuTelugu actor Vishnu Manchu's upcoming fantasy film, 'Kannappa', has been generating buzz due to its star-studded cameo appearances, which include Prabhas, Mohanlal and Akshay Kumar. In a recent interview, Vishnu revealed more details about the film and these characters."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/woman-injured-as-theatre-ceiling-crashes-down-at-final-destination-screening-2730586-2025-05-26",
      "headline": "Final Destination turns real as Aregntina theatre ceiling collapses, injures womanFiamma Villaverde's 29th birthday ended up being a real-life 'Final Destination' when she got injured while watching the sixth instalment of the American horror franchise. The theatre ceiling in Argentina collapsed mid-screening."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/joju-george-kamal-haasan-oscar-thug-life-mani-ratnam-2730592-2025-05-26",
      "headline": "Kamal Haasan's praise is my Oscar, Mollywood co-workers hurt me: Actor Joju GeorgeActor Joju George was moved to tears when Kamal Haasan praised him at the 'Thug Life' audio launch. The actor shared the video on his Instagram and called Haasan's appreciation his Oscar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ajay-devgn-jackie-chan-teaser-karate-kid-legends-hindi-release-2730574-2025-05-26",
      "headline": "You fight, I dance: Jackie Chan tells Ajay Devgn as they promote Karate KidThe teaser of Ajay Devgn and Jackie Chan's conversation was unveiled ahead of Karate Kid: Legends release. The martial arts icon showed keen interest in doing a Bollywood film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/puzzled-sanjay-dutt-asks-karn-as-paps-mention-rasha-thadani-watch-viral-video-2730570-2025-05-26",
      "headline": "Puzzled Sanjay Dutt asks 'kaun' as paps mention Rasha Thadani. WatchActor Sanjay Dutt was asking the paparazzi to leave the place since it was raining when they informed him that they were waiting to click Rasha Thadani at the venue. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/typical-hindi-heroine-bipasha-basu-says-jism-changed-how-bollywood-saw-women-2730557-2025-05-26",
      "headline": "'Typical Hindi heroine' Bipasha Basu says Jism changed how Bollywood saw womenActor Bipasha Basu recalled how she was looked at as a 'typical Hindi film heroine' until 'Jism' happened, and changed the perception of Bollywood. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sidharth-malhotra-praises-gram-chikitsalay-and-calls-it-a-must-watch-2730503-2025-05-26",
      "headline": "Sidharth Malhotra praises Gram Chikitsalay, calls it a must watchBollywood actor Sidharth Malhotra is thoroughly impressed with Prime Video's 'Gram Chikitsalay'. The series features Amol Parashar and Vinay Pathak. It premiered on the OTT platform on May 9. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistan-was-informed-30-minutes-within-op-sindoor-launch-s-jaishankar-tells-mps-panel-2730712-2025-05-26",
      "headline": "Pak was told within 30 minutes of Op Sindoor launch, Jaishankar tells MPs panelIndia had informed Pakistan within 30 minutes of launching Operation Sindoor that only terror camps were being targeted, with a ceasefire following talks initiated by Islamabad, S Jaishankar told the Parliamentary Consultative Committee."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/heavy-rain-batters-mumbai-pune-monsoon-advances-high-alert-karnataka-2730461-2025-05-26",
      "headline": "Rain red alert in Mumbai, roads flooded, local trains and flights hit  Live UpdatesMumbai weather: Several low-lying areas, local trains and flight operations have been affected after heavy rain and thunderstorms lashed Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/they-are-in-cahoots-tej-prataps-estranged-wife-aishwarya-rejects-lalu-yadavs-action-against-him-as-poll-season-drama-2730774-2025-05-26",
      "headline": "They are in cahoots: Tej Pratap's estranged wife rejects Lalu Yadav's action against him as poll season dramaThey are in cahoots: Tej Pratap's estranged wife rejects Lalu Yadav's action against him as poll season drama"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/india-covid-new-subvariants-nb-1-8-1-lf-7-detection-mild-cases-booster-advice-2730543-2025-05-26",
      "headline": "New Covid-19 variants detected in India: Should you be worried?India has detected new Covid-19 subvariants NB.1.8.1 and LF.7 in Tamil Nadu and Gujarat. Experts say cases remain mild but advise boosters and caution for high-risk groups."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/luxury-real-estate-dlf-camellias-delhi-ncr-ultra-rich-property-celebrity-shikhar-dhawan-rishi-parti-2730692-2025-05-26",
      "headline": "The billionaire blueprint: Inside DLF's ultra-luxury playbookWelcome to the new epicentre of ultra-luxury in India, where DLF isn't just selling apartments, it is curating a billionaire lifestyle and cashing in on the growing trend of 'living life king-size'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-army-chief-gifts-pm-chinese-drill-photo-to-celebrate-own-strikes-against-india-2730549-2025-05-26",
      "headline": "Asim Munir passes off pic of Chinese drill as strike on India, gifts it to Pak PMThe photo was reportedly presented at a high-profile dinner hosted by Pakistan Field Marshal Asim Munir, Chief of Army Staff. It quickly became the subject of widespread mockery on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/environment/story/early-monsoon-surprises-india-is-it-due-to-climate-change-or-something-else-2730724-2025-05-26",
      "headline": "Early monsoon surprises India: Is climate change to be blamed?The onset and spread of the monsoon aren't driven by just a few isolated factors. Both natural climatic systems and human-induced (anthropogenic) changes—like global warming and climate change—play a role. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-increase-defence-budget-spending-armed-conflict-with-india-imf-cash-crunch-bailout-operation-sindoor-2730636-2025-05-26",
      "headline": "On debt bed, Pakistan to hike defence budget amid India's Op SindoorAmid mounting external debt, Pakistan is set to divert more funds towards the military, the real masters in Rawalpindi. This comes amid the shocks of Operation Sindoor delivered by India. Pakistan's plan to increase the defence budget, despite IMF warnings, reveals its focus on the military over economic recovery or public good."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/french-president-emmanuel-macron-wife-brigitte-smack-his-face-viral-video-2730701-2025-05-26",
      "headline": "Video: Did French President's wife smack his face? Here's what we knowA video of French President Emmanuel Macron arriving in Vietnam has gone viral. It shows his wife, Brigitte, seemingly smacking his face just as he stepped off an aeroplane."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/amazon-fashions-serve-store-offers-convenience-selection-and-value-to-gen-z-says-nikhil-sinha-director-amazon-fashion-2729633-2025-05-24",
      "headline": "Amazon Fashion's 'SERVE' Store Offers Convenience, Selection and Value to Gen Z, says Nikhil Sinha, Director, Amazon FashionIndia's first dedicated Gen Z fashion store democratizes style access across the country with 3X customer growth\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/satellite-images-warn-of-intensifying-rainfall-as-monsoon-swamps-mumbai-2730637-2025-05-26",
      "headline": "Satellite images warn of intensifying rainfall as monsoon swamps MumbaiThe India Meteorological Department (IMD) confirmed on May 26, that the Southwest Monsoon has further advanced into several key regions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mumbai-rain-weather-news-live-early-monsoon-thunderstorms-heavy-rain-imd-forecast-traffic-local-trains-waterlogging-2730541-2025-05-26",
      "headline": "Live: Venture out only if necessary, warns Maharashtra Minister amid red alertMumbai weather live update: Thunderstorms with lightning and gusty winds lashed Mumbai on Monday morning, disrupting suburban train services and slowing road traffic amid poor visibility, officials said. The India Meteorological Department (IMD) announced that the southwest monsoon has arrived in Maharashtra nearly ten days ahead of schedule — the earliest since 1990. Civic officials reported continuous rainfall since Sunday night, with some low-lying areas experiencing flooding. The IMD has forecast light to moderate rain in parts of the city over the next 24 hours. Stay with IndiaToday.in for live updates:"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/mumbai-rain-newly-inaugurated-underground-metro-station-in-worli-flooded-2730676-2025-05-26",
      "headline": "Video: Mumbai's brand-new underground metro station flooded in heavy rainOperational since May 10, the Acharya Atre Chowk underground metro station on Aqua Line 3 got submerged after incessant rain in Mumbai."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/no-foreign-wife-shopping-china-warns-against-marriage-scams-in-bangladesh-2730474-2025-05-26",
      "headline": "No 'foreign wife' shopping: China warns against marriage scams in BangladeshThe Chinese embassy in Bangladesh warned its citizens not to fall for deceptive \"cross-border dating\" content on short video platforms or seek out so-called \"foreign wives\" through informal networks or commercial matchmaking agencies,"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pakistan-spy-nia-crpf-personnel-delhi-spying-for-pakistan-2730652-2025-05-26",
      "headline": "CRPF personnel from Delhi arrested for spying for Pakistan since 2023A CRPF personnel, Moti Ram Jat, was arrested in Delhi for allegedly sharing classified national security information with Pakistan Intelligence Officers since 2023. \r\n\r\n\r\n\r\n\r\n\r\n4o\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/covid-19-cases-cross-delhi-kerala-mumbai-fresh-infections-2730577-2025-05-26",
      "headline": "India reports over 1,000 active Covid cases; spikes in Kerala, Maharashtra, DelhiDelhi has registered over 100 cases of Covid-19 with 99 cases recorded in the past week. 750 fresh infections have been reported in the last week in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/quick-vitals-app-noninvasive-blood-test-anemia-screening-india-no-needle-2730654-2025-05-26",
      "headline": "Inside India's first AI-driven blood test that doesn't require bloodA new app called Quick Vitals offers blood test results by scanning the face without needles. This innovation aims to improve early health screening, especially for anaemia in pregnant women and children, across India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/mumbai/story/mumbai-rain-breaks-107-year-record-may-rainfall-monsoon-earliest-arrival-25-years-2730640-2025-05-26",
      "headline": "Mumbai breaks 107-year record for May rain, monsoon's earliest arrival in 69 yearsMonsoon in Mumbai has made its earliest arrival in 69 years as rainfall breaks the 107-year record for May."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/tariff-fallout-check-the-companies-that-will-raise-prices-in-us-higher-prices-in-america-import-goods-2730576-2025-05-26",
      "headline": "Groceries, diapers, toilet paper get costlier as Trump tariffs punish AmericansFrom detergents and diapers to toilet paper and groceries, Americans are going to shell out more for everyday items because companies, including Procter & Gamble and Adidas, and retailers like Walmart have decided to pass on the impact of Trump's tariffs to American consumers. Here's a list of products that are likely to get costlier for consumers in the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/fact-check/story/fact-check-old-video-shashi-tharoor-bashing-donald-trump-parliamentary-delegation-us-2730730-2025-05-26",
      "headline": "Old video of Shashi Tharoor bashing Trump goes viral as his delegation visits USThis video is from September 2024, when the MP was speaking at the Jaipur Literature Festival in New York. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-rafael-nadal-son-tribute-novak-djokovic-2730709-2025-05-26",
      "headline": "Watch: Rafael Nadal's son plays with Big four after father's tributeRafael Nadal had a dream day in the presence of his son, wife and other family members after the French Open paid him an emotional tribute on Sunday, May 25. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jaipur-jail-inmates-hotel-outing-with-girlfriends-police-constables-among-arrested-2730747-2025-05-26",
      "headline": "Poha, drugs, girlfriends: Jaipur jail break scandal exposed, 13 arrestedA total of 13 people, including five constables, four inmates and four relatives, were arrested on Sunday after it came to the fore that the inmates had allegedly paid bribes to enjoy a few hours of freedom outside the jail. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/trumps-crazy-jab-at-putin-over-massive-ukraine-strikes-russia-calls-it-emotional-reaction-2730744-2025-05-26",
      "headline": "Trump's 'CRAZY' jab at Putin over strikes, Russia calls it 'emotional reaction'Trump posted the remark on Truth Social as sleeping Ukrainians woke to a third consecutive night of Russian aerial attacks, listening for hours to drones buzzing near their homes and eruptions of Ukrainian anti-aircraft fire."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/kerala/story/liberian-cargo-vessel-sinking-off-kollam-locals-advised-stay-away-from-washed-ashore-hazardous-chemical-carbide-containers-concerns-2730645-2025-05-26",
      "headline": "10 containers from sunken ship wash ashore Kerala coast, locals told to stay awayAuthorities in Kerala are urging locals to be cautious after a cargo ship carrying hazardous materials sank off Kochi coast. Now containers from the sunken vessel are washing ashore, prompting concerns about public safety and environmental risks."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gujarat-titans-tom-moody-gt-vs-csk-2730749-2025-05-26",
      "headline": "Gujarat Titans bowlers are losing form at the wrong time: Tom MoodyIPL 2025: Former all-rounder Tom Moody said that Gujarat Titans' bowlers haven't been able to bowl well in partnerships due to which they have lost form in recent matches. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-ipl-future-murali-karthik-virat-kohli-2730748-2025-05-26",
      "headline": "MS Dhoni IPL future: Murali Karthik uses Virat Kohli reference to discuss topicMurali Karthik said that while people still adore MS Dhoni, there comes a time when players need to step away from the sport. Karthik used the reference of Virat Kohli to make his case to Dhoni, whose future remains a mystery. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/bundesliga-erik-ten-hag-bayer-leverkusen-manchester-united-xabi-alonso-2730711-2025-05-26",
      "headline": "Former Manchester United boss Erik ten Hag becomes Bayer Leverkusen managerFormer Manchester United manager Erik ten Hag has replaced Xabi Alonso as the new boss of Bayer Leverkusen, the German club confirmed on Monday, May 26. Ten Hag has been out of work since being sacked by United last year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-rafael-nadal-son-tribute-novak-djokovic-2730709-2025-05-26",
      "headline": "Watch: Rafael Nadal's son plays with Big four after father's tributeRafael Nadal had a dream day in the presence of his son, wife and other family members after the French Open paid him an emotional tribute on Sunday, May 25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhishek-sharmas-father-thanks-yuvraj-singh-for-shaping-sons-career-2730705-2025-05-26",
      "headline": "Abhishek Sharma's father thanks Yuvraj Singh for shaping son's careerSunrisers Hyderabad (SRH) opening batter Abhishek Sharma's father Raj Kumar Sharma thanked Yuvraj Singh for shaping son's career. Abhishek had another good season in the IPL 2025 as he scored 439 runs from 13 innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-visits-kamakhya-temple-ahead-of-england-tour-2730643-2025-05-26",
      "headline": "Gambhir visits Kamakhya temple in Guwahati to seek blessings for England tourIndian cricket team head coach Gautam Gambhir visited Maa Kamakhya temple in Guwahati ahead of the upcoming tour of England. India are set to play five Tests against England beginning from June 20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-robin-uthappa-comments-on-ms-dhonis-ipl-future-2730620-2025-05-26",
      "headline": "Uthappa comments on Dhoni's IPL Future: His fire to win tournaments still burnsFormer India cricketer-turned commentator Robin Uthappa has shared his thoughts on MS Dhoni's future and said that the fire to win tournaments still burns bright in him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-gujarat-titans-chennai-super-kings-vikram-solanki-press-conference-2730605-2025-05-26",
      "headline": "GT must be better, no two ways around it: Vikram SolankiIPL 2025, GT vs CSK: Gujarat Titans Director of Cricket Vikram Solanki said that his team needs to play better cricket following the heavy 83-run defeat to the Chennai Super Kings on Sunday at the Narendra Modi Stadium in Ahmedabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/vidarbha-hockey-supreme-court-india-plea-2730598-2025-05-26",
      "headline": "Vidarbha's plea for associate membership at Indian Hockey rejectedThe Supreme Court has refused to hear Vidarbha Hockey Association's plea for recognition, citing rules allowing only one state association. It questioned Vidarbha's inaction after derecognition by Maharashtra Hockey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-pbks-vs-mi-will-jacks-full-pre-match-press-conference-2730585-2025-05-26",
      "headline": "I've been given lot of confidence in my bowling by captain and coach: Will JacksMumbai Indians (MI) all-rounder Will Jacks has thanked captain Hardik Pandya and head coach Mahela Jayawardene for instilling confidence in his bowling. Jacks has been handy with the ball in the ongoing IPL 2025 having scalped six wickets from seven innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-gt-vs-csk-sridharan-sriram-full-post-match-press-conference-2730575-2025-05-26",
      "headline": "Delighted to finish season on a winning note: CSK bowling coach after win vs GTChennai Super Kings (CSK) bowling coach Sridharan Sriram was delighted with his team finishing the season on a winning note. CSK beat Gujarat Titans by 83 runs in their last fixture in Ahmedabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-robin-uthappa-comments-on-ms-dhonis-ipl-future-2730620-2025-05-26",
      "headline": "Uthappa comments on Dhoni's IPL Future: His fire to win tournaments still burnsFormer India cricketer-turned commentator Robin Uthappa has shared his thoughts on MS Dhoni's future and said that the fire to win tournaments still burns bright in him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-gujarat-titans-chennai-super-kings-vikram-solanki-press-conference-2730605-2025-05-26",
      "headline": "GT must be better, no two ways around it: Vikram SolankiIPL 2025, GT vs CSK: Gujarat Titans Director of Cricket Vikram Solanki said that his team needs to play better cricket following the heavy 83-run defeat to the Chennai Super Kings on Sunday at the Narendra Modi Stadium in Ahmedabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/vidarbha-hockey-supreme-court-india-plea-2730598-2025-05-26",
      "headline": "Vidarbha's plea for associate membership at Indian Hockey rejectedThe Supreme Court has refused to hear Vidarbha Hockey Association's plea for recognition, citing rules allowing only one state association. It questioned Vidarbha's inaction after derecognition by Maharashtra Hockey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-pbks-vs-mi-will-jacks-full-pre-match-press-conference-2730585-2025-05-26",
      "headline": "I've been given lot of confidence in my bowling by captain and coach: Will JacksMumbai Indians (MI) all-rounder Will Jacks has thanked captain Hardik Pandya and head coach Mahela Jayawardene for instilling confidence in his bowling. Jacks has been handy with the ball in the ongoing IPL 2025 having scalped six wickets from seven innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-gt-vs-csk-sridharan-sriram-full-post-match-press-conference-2730575-2025-05-26",
      "headline": "Delighted to finish season on a winning note: CSK bowling coach after win vs GTChennai Super Kings (CSK) bowling coach Sridharan Sriram was delighted with his team finishing the season on a winning note. CSK beat Gujarat Titans by 83 runs in their last fixture in Ahmedabad. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}