{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdfc-bank-upi-services-unavailable-on-this-date-get-details-here-2675839-2025-02-06",
      "headline": "HDFC Bank UPI services unavailable on this date. Get details hereDuring the downtime, the UPI transactions on HDFC Bank's current and savings accounts and RuPay credit cards will be affected."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-board-approves-company-name-change-to-eternal-ltd-ceo-deepinder-goyal-2675789-2025-02-06",
      "headline": "Zomato board approves renaming company to Eternal Ltd: CEO Deepinder GoyalThe renaming announcement comes weeks after Zomato entered the BSE Sensex on December 23, which coincides with the 17th anniversary of its founding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/default-on-personal-loan-check-consequences-impact-on-credit-score-hefty-penalty-legal-notice-2675670-2025-02-06",
      "headline": "What if you default on personal loan? Check consequencesPersonal loan default consequences: Banks or lenders impose hefty penalties, or late fee charges in case of a missed EMI amount. They may even impose higher interest charges and additional charges for collection efforts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/want-to-redeem-credit-card-points-check-2-simple-ways-online-banking-customer-service-helpline-2675748-2025-02-06",
      "headline": "Want to redeem credit card points? Check these 2 simple ways How to redeem credit card points: The number of credit card points one earns depends on the type of card, whether basic or premium, and the amount spent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-fall-sharply-as-dalal-street-remains-edgy-ahead-of-rbis-rate-decision-2675724-2025-02-06",
      "headline": "Sensex, Nifty fall sharply as D-Street remains edgy ahead of RBI's rate decisionThe S&P BSE Sensex closed 213.12 points lower at 78,058.16 and the NSE Nifty50 settled 92.95 points lower at 23,603.35."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/old-income-tax-regime-maximum-deductions-savings-calculations-explained-2675707-2025-02-06",
      "headline": "How much can you save with maximum deductions under old income tax regime?Old tax regime: What if someone earning above Rs 12.75 lakh annually chooses the old regime and claims the maximum deductions? Will it result in tax savings? This article explores the key deductions available under the old income tax regime and the maximum amount one can claim."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/old-vs-new-tax-regime-which-one-should-you-choose-for-income-above-rs-12-lakh-2675644-2025-02-06",
      "headline": "Old vs New tax regime: Which one should you choose for income above Rs 12.75 lakh?Old vs New tax regime: What if you earn more than Rs 12.75 lakh? Should you pick the new tax regime for lower rates or stick to the old one for deductions?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-what-is-it-and-how-will-it-help-taxpayers-2675626-2025-02-06",
      "headline": "New Income Tax Bill: What is it and how will it help taxpayers?In order to make the Income Tax Act 1961 more concise and simpler, the government is introducing a new income tax bill. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/union-cabinet-likely-to-approve-new-income-tax-bill-tomorrow-2675611-2025-02-06",
      "headline": "Union Cabinet likely to approve new Income Tax Bill tomorrowThe Union Cabinet is expected to clear the new Income Tax Bill tomorrow, paving the way for its introduction in the Lok Sabha"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/swiggy-stock-price-today-falling-q3fy25-results-explained-2675613-2025-02-06",
      "headline": "Explained: Why Swiggy shares hit record low todaySwiggy shares dropped over 7% to hit a new 52-week low of Rs 387 on the Bombay Stock Exchange (BSE) in early trade. At around 11:37 am, Swiggy shares were down 4.16% lower at Rs 400.70."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-bets-on-pro-business-policies-in-budget-2025-here-are-the-key-takeaways-business-friendly-reforms-2675596-2025-02-06",
      "headline": "India bets on pro-business policies in Budget 2025. Here are the key takeawaysOne of the most significant initiatives announced is the establishment of a High-Level Committee for transformative reforms across sector regulations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-will-senior-citizens-benefit-from-increased-tds-limits-on-interest-and-rental-payments-2675587-2025-02-06",
      "headline": "How will senior citizens benefit from increased TDS limits?The tax reforms announced in Budget 2025 aim at lowering the compliance burden for elderly taxpayers, and giving them enhanced financial flexibility and security in their retirement years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-likely-to-be-approved-by-cabinet-tomorrow-check-key-details-2675593-2025-02-06",
      "headline": "New Income Tax Bill likely to be approved by Cabinet tomorrow. Check key details The new legislation, often referred to as the Direct Tax Code, is aimed at overhauling the existing tax structure, making it more streamlined and transparent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-policy-decision-repo-rate-cut-likely-first-time-in-5-years-25-bps-2675563-2025-02-06",
      "headline": "Will RBI cut key rates for 1st time in 5 years? 4 things you need to knowRBI MPC: There are expectations that the central bank's MPC will decide on cutting the key rates for the first time in 5 years by 25 basis points (BPS)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-sensex-nifty-flat-opening-investors-rbi-rate-decision-25-bps-cut-2675557-2025-02-06",
      "headline": "Sensex, Nifty fall after flat opening as investors await RBI rate decisionShare Market Today: The S&P BSE Sensex was down 151.58 points to 78,119.70 at 10:12 am, while the NSE Nifty50 traded 42.95 points lower at 23,696.30."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-accuses-kia-of-tax-evasion-in-vw-like-dispute-report-2675260-2025-02-05",
      "headline": "Government accuses Kia of tax evasion in VW-like dispute: ReportKia competes with Hyundai and Maruti Suzuki in the world's third-largest auto market, where it has a share of 6% of roughly 4 million units a year, and its Kia Seltos and Sonet SUVs are among the top sellers. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-sensex-nifty-end-lower-as-consumer-shares-fall-rupee-drops-2675234-2025-02-05",
      "headline": "Sensex, Nifty end lower as consumer stocks weigh; rupee dropsShare Market: The S&P BSE Sensex was down 312.53 points to 78,271.28 at the closing bell, while the NSE Nifty50 settled 42.95 points lower at 23,696.30."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/openai-sam-altman-meets-with-it-minister-ashwini-vaishnaw-to-discuss-india-ai-roadmap-2675222-2025-02-05",
      "headline": "OpenAI's Sam Altman meets with IT minister to discuss India's AI roadmapIn a post on X, Ashwini Vaishnaw said he had a \"super cool discussion\" with Altman on India's \"strategy of creating the entire AI stack - GPUs, model, and apps\" and that OpenAI was willing to collaborate on all three."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-regime-relief-capital-gains-tax-rs-12-lakh-does-it-apply-2675212-2025-02-05",
      "headline": "Will Rs 12 lakh income qualify for zero tax even with capital gains?The biggest announcement was that individuals earning up to Rs 12 lakh would not have to pay any tax. But does this still apply if you have additional income from capital gains? Here is all you need to know. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/quick-commerce-zepto-delivering-cars-now-skoda-kylaq-new-teaser-sparks-buzz-february-8-2675195-2025-02-05",
      "headline": "Zepto delivering cars now? Skoda's new teaser sparks buzzWhile the teaser does not confirm the exact details, it suggests that Skoda cars could soon be purchased through Zepto."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/triptii-dimri-begins-prep-for-parveen-babi-biopic-despite-not-signing-project-2675939-2025-02-06",
      "headline": "Exclusive: Triptii Dimri begins prep for Parveen Babi biopic, yet to sign projectIndia Today Digital has exclusively learnt that Triptii Dimri has begun preparing for her role as Parveen Babi in a biopic, even before officially signing the project. The series, directed by Shonali Bose, is yet to be announced."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/kanye-west-long-note-on-bianca-censori-invisible-dress-grammy-controversy-2675906-2025-02-06",
      "headline": "Kanye West on Bianca Censori's nude dress controversy: Wife is so brave and hotKanye West defends his wife Bianca Censori's controversial invisible dress at the Grammy 2025, sharing a long note on X."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/ram-kapoor-sets-the-record-straight-on-55-kg-weight-loss-no-ozempic-just-hard-work-2675851-2025-02-06",
      "headline": "Ram Kapoor on 55 kg weight loss: No Ozempic, just hard workRam Kapoor's 55 kg weight loss has sparked widespread speculation about the methods he used. However, Kapoor clarified on social media that his transformation was achieved through hard work and dedication, dismissing the use of shortcuts like Ozempic or surgery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kinda-pregnant-review-amy-schumers-comedy-netflix-film-barely-delivers-2675690-2025-02-06",
      "headline": "Kinda Pregnant review: Amy Schumer's comedy film barely deliversReleased-Wed Feb 05, 2025Amy Schumer returns with Kinda Pregnant, a comedy that struggles to hit the mark. Despite its premise of friendship and motherhood, it fails to offer fresh laughs or insights."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/justin-bieber-wife-hailey-step-out-for-a-date-amid-divorce-rumours-2675733-2025-02-06",
      "headline": "Justin Bieber, wife Hailey step out for a date amid divorce rumoursJustin and Hailey Bieber were seen enjoying a date night in New York City, countering recent divorce rumours. Despite reports of marital strain linked to Justin's legal anxieties, the couple appeared united."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/anuja-movie-review-hard-hitting-subject-compelling-watch-2675725-2025-02-06",
      "headline": "Anuja review: Raw performances, hard-hitting subject make it a compelling watchReleased-Thu Feb 06, 2025Anuja movie review: Oscar-nominated Anuja is a gripping short film on child labour and resilience. With stellar performances and a hard-hitting narrative, it is a must-watch on Netflix."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-night-agent-season-2-review-equal-parts-dramatic-and-delectably-exciting-netflix-series-2675638-2025-02-06",
      "headline": "The Night Agent Season 2 review: Equal parts dramatic and delectably excitingReleased-Thu Jan 23, 2025In The Night Agent Season 2 on Netflix, a spy recruited by the most secretive body of the FBI, gets entangled in the mysteries of state secrets and in-house traitors. Peter Sutherland is back to save his country from falling. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kadhalikka-neramillai-on-ott-when-where-to-watch-nithya-menen-ravi-mohan-film-2675609-2025-02-06",
      "headline": "Kadhalikka Neramillai on OTT: When and where to watch Nithya Menen, Ravi Mohan filmNithya Menen and Ravi Mohan's Kadhalikka Neramillai is reportedly gearing up for its OTT debut on Netflix. The film was earlier released in theatres during the Pongal festival."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mrs-review-sanya-malhotra-nishant-dahiya-kanwaljit-singh-zee5-film-2675594-2025-02-06",
      "headline": "Mrs review: Sanya Malhotra's film is an unsettling watch, for all the right reasonsReleased-Thu Feb 06, 2025ZEE5 film 'Mrs', starring Sanya Malhotra, explores the harsh realities that several women face in marriage. A Hindi adaptation of 'The Great Indian Kitchen', Mrs delves into themes of patriarchy and unfulfilled aspirations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/shiv-sena-mp-milind-deoras-woke-dig-at-grammys-for-not-honouring-zakir-hussain-2675559-2025-02-06",
      "headline": "Milind Deora's 'woke' dig at Grammys for not honouring tabla icon Zakir HussainShiv Sena leader and Member of Parliament Milind Deora took a dig at the Grammys for omitting Tabla maestro Zakir Hussain's name from their In Memoriam segment. Zakir Hussain, who died in December 2024, was a four-time Grammy winner. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/drake-kendrick-lamar-biggest-fight-rap-history-grammys-2025-2675551-2025-02-06",
      "headline": "Kendrick Lamar vs Drake: Did the Grammys settle the 'battle rap'?Rappers Kendrick Lamar and Drake's feud spans over a decade, with diss tracks, accusations, and a lawsuit. From collaborations to lyrical attacks, here's a full breakdown of their ongoing rap battle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/jisoo-of-blackpink-working-in-newtopia-gave-me-a-lot-of-confidence-2675539-2025-02-06",
      "headline": "Jisoo of BLACKPINK: Working in Newtopia gave me a lot of confidence The highly anticipated K-drama, Newtopia, featuring Park Jeong-min and BLACKPINK's Jisoo, debuts on February 7, 2025, blending a zombie apocalypse with a poignant love story. Jisoo opens up on her character and the differences between herself and Young-joo. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ed-sheeran-and-ar-rahman-perform-urvasi-urvasi-in-chennai-leave-fans-ecstatic-2675531-2025-02-06",
      "headline": "Ed Sheeran, AR Rahman perform Urvasi Urvasi in Chennai, fans ecstaticEd Sheeran's Chennai concert took an unforgettable turn when AR Rahman joined him on stage. The duo's surprise performance left the audience thrilled. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/aryan-khan-to-skip-the-bads-of-bollywood-promotions-2675386-2025-02-05",
      "headline": "Aryan Khan to skip The Bads of Bollywood promotions. How makers plan to compensateSuperstar Shah Rukh Khan's son, Aryan Khan, will not be a part of any promotional event for his debut series, the Netflix project, The Bads of Bollywood. The show is set to feature Bobby Deol, Mona Singh among others in pivotal roles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/one-piece-season-2-wraps-filming-netflix-shares-first-look-2675387-2025-02-05",
      "headline": "One Piece Season 2 filming wrapped. Netflix shares first look from the showNetflix has completed the filming of One Piece Season 2, and the main cast shared a celebratory image. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mrs-on-ott-when-and-where-to-watch-sanya-malhotra-hindi-remake-of-great-indian-kitchen-stmp-2675365-2025-02-05",
      "headline": "Mrs on OTT: When and where to watch Sanya Malhotra's filmSanya Malhotra's Mrs, the Hindi remake of The Great Indian Kitchen, will release on Zee5. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kapil-sharma-says-coldplay-wanted-to-appear-on-his-show-sent-his-team-a-mail-2675358-2025-02-05",
      "headline": "Kapil Sharma says Coldplay reached out to appear on his showKapil Sharma recently revealed that British band Coldplay expressed their desire to take part in his show. The band was in India as part of their Music of Spheres tour. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/aamir-ali-on-finding-love-again-staying-private-after-divorce-dating-ankita-kukreja-2675310-2025-02-05",
      "headline": "Aamir Ali opens up finding love again, staying private after divorceAamir Ali shared insights on finding love again after his divorce from Sanjeeda Shaikh. He talked about his emotional journey and staying private about his personal life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/celebrity-masterchef-review-farah-khan-tejasswi-prakash-2675267-2025-02-05",
      "headline": "Too many celebs spoil the broth: Why Celebrity MasterChef is not palatableWhile Celebrity MasterChef offers entertainment, it lacks the raw authenticity that made the original MasterChef format so compelling. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ed-sheeran-meets-ar-rahman-new-pic-sparks-collaboration-rumours-2675203-2025-02-05",
      "headline": "Ed Sheeran meets AR Rahman, sparks collaboration rumoursEd Sheeran and AR Rahman shared a picture together, sparking collaboration rumours. Fans are excited about the possibility of a joint musical project."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/illegal-indians-deported-from-us-what-happens-to-them-now-2675912-2025-02-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Illegal' Indians deported from US: What happens to them now?A US military C-17 transport aircraft carrying several Indians deported for illegal immigration landed in Amritsar on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/story/bjp-set-for-delhi-comeback-2-more-exit-polls-predict-comfortable-win-over-aap-2675905-2025-02-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "BJP set for Delhi comeback: 2 more exit polls predict comfortable win over AAPTwo more exit polls, on Thursday, predicted that the BJP will manage to break its 27-year jinx and return to power in Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-in-rajya-sabha-sabka-saath-sabka-vikas-beyond-imagination-of-congress-motion-of-thanks-president-address-rahul-gandhi-2675721-2025-02-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "PM Modi refers to ban on Dev Anand's films to blast Congress on EmergencyPrime Minister Narendra Modi, speaking in Rajya Sabha, underscored that while the BJP's model of development was 'nation first', for the Congress it was 'family first' - a reference to the Gandhis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-washington-plane-helicopter-crash-air-traffic-technology-2676007-2025-02-07?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump calls US plane crash that killed 67 'amazing', blames air traffic technologyPresident Donald Trump compared last week's fatal plane-helicopter collision near Washington to a golf driving range, calling it \"amazing.\" He criticised outdated air traffic control systems and shifting blame from diversity hiring to obsolete technology."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-deportee-panama-jungle-dunki-route-enter-united-states-illegally-2675671-2025-02-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Indian deportee's video from Panama jungle shows donkey route to enter USIn a video shared by the family, Akash is seen camping with several other illegal immigrants in the dense forests of Panama while en route to the US. The footage also shows women and children wading through a water body."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/sonu-sood-arrest-warrant-ludhiana-court-after-actor-skips-testimony-fraud-case-2675977-2025-02-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Arrest warrant against actor Sonu Sood after he skips testimony in fraud caseDespite repeated summons, Sonu Sood failed to respond, leading the court to issue an arrest warrant."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-eng-odi-nagpur-score-shubman-gill-shreyas-iyer-rohit-sharma-fail-2675898-2025-02-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rohit Sharma fails, but clinical India begin Champions Trophy prep in styleIndia vs England, 1st ODI: Rohit Sharma's return to ODI cricket ended in disappointment, but India had several positives in their four-wicket win in Nagpur on Thursday. Shubman Gill led India's successful chase of 249 after Ravindra Jadeja shone with the ball for the home team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-board-approves-company-name-change-to-eternal-ltd-ceo-deepinder-goyal-2675789-2025-02-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Zomato board approves renaming company to Eternal Ltd: CEO Deepinder GoyalThe renaming announcement comes weeks after Zomato entered the BSE Sensex on December 23, which coincides with the 17th anniversary of its founding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/loveyapa-movie-review-junaid-khan-wonderfully-elevates-a-well-intentioned-romantic-comedy-2675936-2025-02-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Loveyapa review: Junaid Khan wonderfully elevates a well-intentioned rom-comReleased-Fri Feb 07, 2025Director Advait Chandan's Loveyapa addresses the relevant problems of the generation - body-shaming, social media manipulation, gas-lighting, and deep-fakes. Junaid Khan makes an effortless big screen debut with the right story at the right time. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bengal-government-employee-amit-kumar-sarkar-stabs-colleagues-denying-leave-request-2675860-2025-02-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Denied leave, Bengal employee goes on stabbing spree, walks with bloodied knifeAccused Amit Kumar Sarkar was arrested after a traffic police official insisted he drop the knife and he surrendered."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/old-vs-new-tax-regime-which-one-should-you-choose-for-income-above-rs-12-lakh-2675644-2025-02-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Old vs New tax regime: Which one should you choose for income above Rs 12.75 lakh?Old vs New tax regime: What if you earn more than Rs 12.75 lakh? Should you pick the new tax regime for lower rates or stick to the old one for deductions?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-vs-england-match-highlights-report-shreyas-iyer-2675981-2025-02-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Who said what as Shreyas Iyer 2.0 strikes against short ball at NagpurShreyas Iyer's terrific knock set the base for India's win in the 1st ODI. After the match, Kevin Pietersen and Parthiv analysed Iyer's updated technique, which helped him face the short ball barrage from Jofra Archer and Saqib Mahmood.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-ban-dev-anand-films-doordarshan-dd-congress-emergency-freedom-of-speech-2675804-2025-02-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ban on Dev Anand films: What were the DD days that PM reminded Congress of?Prime Minister Narendra Modi, while attacking the Congress on its crackdown on freedom of speech and curbing rights, reminded it of the time when Dev Anand films were banned from Doordarshan (DD). He also spoke of how Balraj Sahni and Majrooh Sultanpuri were arrested in 1949. Here's how artists faced the might of governments during the Gandhi-Nehru regime."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/why-handcuffed-illegal-immigrants-alarmed-india-american-standard-practice-s-jaishankar-donald-trump-2675746-2025-02-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why Indians deported in handcuffs sparked outrage. Explaining law and loathingThe images of Indians being deported from the US in handcuffs and leg restraints sparked a huge uproar, even leading to disruptions in Parliament. This strong reaction to the deportation of illegal immigrants in restraints may stem from the differing practices regarding the use of handcuffs by law enforcement in the US and India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/nurse-uses-fevikwik-instead-of-stitches-for-childs-injury-faces-inquiry-in-haveri-karnataka-2675874-2025-02-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Karnataka nurse uses Fevikwik to seal child's face cut, faces inquiryA nurse at Primary Health Centre in Karnataka's Haveri district used superglue instead of sutures on a child's facial injury, sparking outrage and an official inquiry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/parliament-budget-session-updates-opposition-protests-deportation-illegal-indians-us-2675585-2025-02-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Use of restraint US SOP: Jaishankar as video of cuffed deported Indians emergesParliament Budget session: External Affairs Minister S Jaishankar, speaking in the Rajya Sabha, said India was engaging the US to ensure the deportees are not mistreated in any manner."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/rolls-royce-ghost-series-ii-launched-in-india-at-rs-895-crore-2675882-2025-02-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rolls-Royce Ghost Series II launched in India at Rs 8.95 croreThe top-spec Rolls-Royce Black Badge Ghost Series II is available for Rs 10.52 crore (ex-showroom)."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/raipur-accident-drunk-russian-woman-sits-on-drivers-lap-before-crash-3-injured-2675854-2025-02-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Raipur accident: Drunk Russian woman sits on driver's lap before crash, 3 injuredA Russian woman involved in an accident on Raipur's VIP Road created chaos at the scene before being arrested. A video of the incident has gone viral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/chinese-threat-in-indian-drones-2675751-2025-02-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Chinese threat in Indian dronesThe use of Chinese parts in drones supplied to the Indian Army is a big risk to national security by way of hacking of data, manipulation and systems failures during missions\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/latest-studies/story/fear-of-being-obsolete-fobo-how-indians-are-tackling-automation-anxiety-2675850-2025-02-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Fear of being obsolete (FOBO) is real: How Indians are tackling AI anxietyWith automation and AI changing jobs, many Indians fear becoming obsolete, as per a recent report. The best response to FOBO? Upskilling. Indian employees are turning to certifications and AI training to stay relevant in a shifting job market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/free-gaza-or-for-free-whats-got-the-real-estate-developer-in-trump-excited-netanyahu-explained-2675809-2025-02-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Free Gaza or Gaza for free? What's got the real estate developer in Trump excitedAfter calling Gaza a \"demolition site\" and a \"phenomenal location on the sea\", US President Donald Trump has now announced the US would take over the Gaza Strip and \"develop it\" as the \"Riviera of the Middle East\". Here, Trump's real estate developer instincts might be showing sharp, leaving the world shocked."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/how-to-stick-to-phone-free-february-challenge-and-reduce-screen-time-2675803-2025-02-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How to stick to Phone-Free February challenge, and reduce screen timeHow about going phone-free this February? Hold on, no need to give up just because of the title of this viral challenge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/bjp-trying-to-break-aap-offered-rs-15-crore-to-7-candidates-sanjay-singh-claims-2675737-2025-02-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "AAP alleges Op Lotus in Delhi: BJP elements offered Rs 15 crore to 7 of our MLAsWithout revealing the names of the candidates, Sanjay Singh said that seven of them received phone calls from the BJP, a day after the 70-member Delhi Legislative Assembly went to polls. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-gujarat-timed-panel-on-uniform-civil-code-now-2675736-2025-02-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why Gujarat timed panel on Uniform Civil Code nowAnnounced just before the February 16 municipal polls, the emotive and polarising issue gives BJP workers a strong campaign agenda beyond hyper-local issues\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sanam-teri-kasam-20000-tickets-pre-sale-day-1-harshvardhan-rane-mawra-hocane-2675956-2025-02-06",
      "headline": "Sanam Teri Kasam re-release: Over 20,000 tickets sold for Harshvardhan Rane film?Sanam Teri Kasam, the 2016 romantic drama, is set for a re-release on February 2. The film, which initially flopped, has reportedly already sold over 20,000 tickets during pre-sales."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/loveyapa-movie-review-junaid-khan-wonderfully-elevates-a-well-intentioned-romantic-comedy-2675936-2025-02-06",
      "headline": "Loveyapa review: Junaid Khan wonderfully elevates a well-intentioned rom-comReleased-Fri Feb 07, 2025Director Advait Chandan's Loveyapa addresses the relevant problems of the generation - body-shaming, social media manipulation, gas-lighting, and deep-fakes. Junaid Khan makes an effortless big screen debut with the right story at the right time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/video/priyanka-chopra-nick-jonas-ace-twinning-game-at-her-brothers-sangeet-2675942-2025-02-06",
      "headline": "Video: Priyanka Chopra, Nick Jonas ace twinning game at her brother's sangeetPriyanka Chopra and Nick Jonas arrived at her brother's sangeet in style. The couple posed for the paparazzi, looking stunning as they twinned in royal blue. They shared a smile as the paparazzi called Nick 'jiju'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/triptii-dimri-begins-prep-for-parveen-babi-biopic-despite-not-signing-project-2675939-2025-02-06",
      "headline": "Exclusive: Triptii Dimri begins prep for Parveen Babi biopic, yet to sign projectIndia Today Digital has exclusively learnt that Triptii Dimri has begun preparing for her role as Parveen Babi in a biopic, even before officially signing the project. The series, directed by Shonali Bose, is yet to be announced."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/cricket-india-vs-england-first-odi-harshit-rana-debut-press-conference-nagpur-2675987-2025-02-06",
      "headline": "Always mentally prepared to play for India anytime: Harshit Rana after debutIndia pacer Harshit Rana claimed that he is always ready to represent the national side when called upon after his ODI debut in Nagpur against England on Thursday, February 6. Harshit, after a shaky start, bounced back in his second spell to pick up 3 wickets to restrict England to just 248 and set up India's win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-vs-england-match-highlights-report-shreyas-iyer-2675981-2025-02-06",
      "headline": "Who said what as Shreyas Iyer 2.0 strikes against short ball at NagpurShreyas Iyer's terrific knock set the base for India's win in the 1st ODI. After the match, Kevin Pietersen and Parthiv analysed Iyer's updated technique, which helped him face the short ball barrage from Jofra Archer and Saqib Mahmood.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-1st-odi-harshit-rana-phil-salt-over-nagpur-press-conference-2675974-2025-02-06",
      "headline": "Harshit Rana shrugs off Nagpur horror over to Phil Salt: Part of the gameIndia pacer Harshit Rana shrugged off conceding 26 runs in an over to Phil Salt, saying that it is just part of the game at the end of the day. Despite the early setback, Harshit would produce a brilliant display in his second spell. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-vs-england-1st-odi-nagpur-shreyas-iyer-funny-story-rohit-sharma-phone-call-virat-kohli-2675927-2025-02-06",
      "headline": "Cut movie-night short: Shreyas reveals late call to replace Virat in 1st ODIIndia batter Shreyas Iyer revealed that he was originally not a part of the playing XI in the 1st ODI vs England. Iyer said that he received a late-night phone call from Rohit Sharma, asking him to be ready to play in place of Virat Kohli in Nagpur.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-first-odi-virat-kohli-injury-update-shubman-gill-nagpur-2675914-2025-02-06",
      "headline": "Virat Kohli injury update: Nothing to worry, he will play 2nd ODI, says Shubman GillShubman Gill has brushed aside any concerns about Virat Kohli's fitness and claimed that the star batter will definitely play the second ODI against England in Cuttack. Kohli suffered a knee injury, which ruled him out of the match in Nagpur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-eng-shubman-gill-lambi-race-ghoda-sanjay-manjrekar-nagpur-2675913-2025-02-06",
      "headline": "Shubman Gill 'lambi race ka ghoda', says Sanjay Manjrekar after Nagpur ODI heroicsIndia vs England, 1st ODI: Former India batter Sanjay Manjrekar heaped praise on Shubman Gill after the newly-appointed vice-captain hit a match-winning 87 in India's four-wicket win in Nagpur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-eng-odi-nagpur-score-shubman-gill-shreyas-iyer-rohit-sharma-fail-2675898-2025-02-06",
      "headline": "Rohit Sharma fails, but clinical India begin Champions Trophy prep in styleIndia vs England, 1st ODI: Rohit Sharma's return to ODI cricket ended in disappointment, but India had several positives in their four-wicket win in Nagpur on Thursday. Shubman Gill led India's successful chase of 249 after Ravindra Jadeja shone with the ball for the home team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-1st-odi-shubman-gill-vice-cpataincy-virat-kohli-spot-nagpur-2675897-2025-02-06",
      "headline": "IND vs ENG 1st ODI: Vice-captain Shubman Gill shines in Virat Kohli's No.3 spotShubman Gill stepped up to fill the void left by Virat Kohli in the Indian batting lineup as he scored a brilliant 87 against England in the Nagpur ODI. Vice-captain Gill anchored the run chase perfectly for India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ms-dhoni-no7-ranchi-residence-selfie-spot-helicopter-shot-2675880-2025-02-06",
      "headline": "No.7, helicopter shot: MS Dhoni's Ranchi residence becomes selfie spot for fansMS Dhoni's Ranchi residence has become a selfie spot for fans as the house now bears the iconic No.7 and the helicopter shot on its wall. Dhoni is all set for his return in the IPL. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/cricket-ms-dhoni-residence-ranchi-7-logo-helicopter-shot-fans-selfie-spot-2675879-2025-02-06",
      "headline": "Watch: MS Dhoni's Ranchi residence gets iconic No. 7, helicopter shot decor One of MS Dhoni's residences in Ranchi has gone through a makeover with No. 7 logo printed on the wall. A visual representation of Dhoni's iconic helicopter shot has also been designed on the wall of the house. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-wpl-2025-niki-prasad-delhi-capitals-welcome-jemimah-rodrigues-shafali-verma-2675846-2025-02-06",
      "headline": "Watch: U-19 World Cup winner Niki Prasad gets grand welcome from Delhi teammatesJemimah Rodrigues, Shafali Verma and the rest of the Delhi Capitals squad gave U-19 T20 World Cup winning captain Niki Prasad a grand welcome as she reached the team base ahead of the WPL 2025 campaign. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-eng-odi-nagpur-score-shubman-gill-shreyas-iyer-rohit-sharma-fail-2675898-2025-02-06",
      "headline": "Rohit Sharma fails, but clinical India begin Champions Trophy prep in styleIndia vs England, 1st ODI: Rohit Sharma's return to ODI cricket ended in disappointment, but India had several positives in their four-wicket win in Nagpur on Thursday. Shubman Gill led India's successful chase of 249 after Ravindra Jadeja shone with the ball for the home team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-1st-odi-shubman-gill-vice-cpataincy-virat-kohli-spot-nagpur-2675897-2025-02-06",
      "headline": "IND vs ENG 1st ODI: Vice-captain Shubman Gill shines in Virat Kohli's No.3 spotShubman Gill stepped up to fill the void left by Virat Kohli in the Indian batting lineup as he scored a brilliant 87 against England in the Nagpur ODI. Vice-captain Gill anchored the run chase perfectly for India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ms-dhoni-no7-ranchi-residence-selfie-spot-helicopter-shot-2675880-2025-02-06",
      "headline": "No.7, helicopter shot: MS Dhoni's Ranchi residence becomes selfie spot for fansMS Dhoni's Ranchi residence has become a selfie spot for fans as the house now bears the iconic No.7 and the helicopter shot on its wall. Dhoni is all set for his return in the IPL. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/cricket-ms-dhoni-residence-ranchi-7-logo-helicopter-shot-fans-selfie-spot-2675879-2025-02-06",
      "headline": "Watch: MS Dhoni's Ranchi residence gets iconic No. 7, helicopter shot decor One of MS Dhoni's residences in Ranchi has gone through a makeover with No. 7 logo printed on the wall. A visual representation of Dhoni's iconic helicopter shot has also been designed on the wall of the house. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-wpl-2025-niki-prasad-delhi-capitals-welcome-jemimah-rodrigues-shafali-verma-2675846-2025-02-06",
      "headline": "Watch: U-19 World Cup winner Niki Prasad gets grand welcome from Delhi teammatesJemimah Rodrigues, Shafali Verma and the rest of the Delhi Capitals squad gave U-19 T20 World Cup winning captain Niki Prasad a grand welcome as she reached the team base ahead of the WPL 2025 campaign. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sri-lanka-vs-australia-nathan-lyon-150-wickets-asia-first-spinner-2675838-2025-02-06",
      "headline": "Nathan Lyon becomes first non-Asian bowler to take 150 wickets in AsiaSri Lanka vs Australia: Off-spinner Nathan Lyon completed 150 wickets in Asia after dismantling the Sri Lankan batting unit with three wickets on Day 1 of the 2nd Test in Galle. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-first-odi-rohit-sharma-failure-trolled-nagpur-2675837-2025-02-06",
      "headline": "Please retire Rohit Sharma: Fans troll India captain after Nagpur ODI failureRohit Sharma was heavily trolled by fans on social media after his failure in the Nagpur ODI against England on Thursday, February 6. Rohit was dismissed for just 2 runs in the first ODI of the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-harshit-rana-debut-comeback-rohit-sharma-nagpur-2675788-2025-02-06",
      "headline": "How Rohit Sharma's advice helped Harshit Rana to bounce back in NagpurHarshit Rana revealed the advice he got from Rohit Sharma which helped him bounce back in the Nagpur ODI on Thursday, February 6. Harshit picked up 3 wickets in his ODI debut against England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-ravindra-jadeja-600-huge-milestone-fifth-bowler-james-anderson-2675785-2025-02-06",
      "headline": "Ravindra Jadeja breaks James Anderson's record, completes 600 wickets for IndiaIndia vs England, 1st ODI: Ravindra Jadeja completed 600 wickets in international cricket on Thursday. He took three wickets against England in the series opener in Nagpur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-1st-odi-mohammed-shami-comeback-nagpur-2675771-2025-02-06",
      "headline": "Shami tidy on ODI comeback, gives India confidence ahead of Champions TrophyIndia pacer Mohammed Shami dismissed Brydon Carse in the first One-Day International (ODI) in Nagpur for his first wicket in the format in 445 days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-rohit-sharma-yashasvi-jaiswal-inspiring-pep-talk-video-2675767-2025-02-06",
      "headline": "Watch: Rohit Sharma gives inspiring pep talk to debutant Yashasvi Jaiswal India vs England, 1st ODI: Captain Rohit Sharma spoke with the emotions of a doting mentor before he presented debutant Yashasvi Jaiswal his maiden one-day internationals cap in Nagpur on Thursday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-icc-player-of-the-month-awards-varun-chakravarthy-gongadi-trisha-2675761-2025-02-06",
      "headline": "Varun Chakravarthy, Gongadi Trisha nominated for ICC Player Of The Month awardsVarun Chakravarthy and Gongadi Trisha were nominated for the ICC men's and women's Player Of The Month awards for their incredible performances in January. Varun impressed against England in T20Is while Trisha was the star of the show for India in their U-19 Women's T20 World Cup triumph. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-first-odi-virat-kohli-fitness-test-video-nagpur-2675726-2025-02-06",
      "headline": "Watch: Virat Kohli tries his best in fitness test before missing Nagpur ODIInd vs Eng: Virat Kohli was seen trying his best to prove his fitness before the start of the Nagpur ODI on Thursday, February 6. Kohli was forced to miss the match against England due to a knee injury. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-1st-odi-mohammed-shami-comeback-nagpur-2675771-2025-02-06",
      "headline": "Shami tidy on ODI comeback, gives India confidence ahead of Champions TrophyIndia pacer Mohammed Shami dismissed Brydon Carse in the first One-Day International (ODI) in Nagpur for his first wicket in the format in 445 days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-rohit-sharma-yashasvi-jaiswal-inspiring-pep-talk-video-2675767-2025-02-06",
      "headline": "Watch: Rohit Sharma gives inspiring pep talk to debutant Yashasvi Jaiswal India vs England, 1st ODI: Captain Rohit Sharma spoke with the emotions of a doting mentor before he presented debutant Yashasvi Jaiswal his maiden one-day internationals cap in Nagpur on Thursday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-icc-player-of-the-month-awards-varun-chakravarthy-gongadi-trisha-2675761-2025-02-06",
      "headline": "Varun Chakravarthy, Gongadi Trisha nominated for ICC Player Of The Month awardsVarun Chakravarthy and Gongadi Trisha were nominated for the ICC men's and women's Player Of The Month awards for their incredible performances in January. Varun impressed against England in T20Is while Trisha was the star of the show for India in their U-19 Women's T20 World Cup triumph. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-first-odi-virat-kohli-fitness-test-video-nagpur-2675726-2025-02-06",
      "headline": "Watch: Virat Kohli tries his best in fitness test before missing Nagpur ODIInd vs Eng: Virat Kohli was seen trying his best to prove his fitness before the start of the Nagpur ODI on Thursday, February 6. Kohli was forced to miss the match against England due to a knee injury. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-lahore-gaddafi-stadium-is-ready-for-champions-trophy-pakistan-board-2675720-2025-02-06",
      "headline": "Lahore's Gaddafi stadium is ready for Champions Trophy: Pakistan Cricket BoardChampions Trophy 2025: The Gaddafi Stadium in Lahore is now ready to host international cricket after undergoing extensive renovations for the Champions Trophy, the Pakistan Cricket Board declared on Thursday.\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-eng-yashasvi-jaiswal-takes-jaw-dropping-catch-on-odi-debut-to-dismiss-ben-duckett-2675712-2025-02-06",
      "headline": "Watch: Yashasvi Jaiswal's jaw-dropping catch on ODI debut to dismiss DuckettIndia batter Yashasvi Jaiswal took a breathtaking catch on his ODI debut to dismiss Ben Duckett during the first match against England in Nagpur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-england-1st-odi-joe-root-fails-ravindra-jadeja-nagpur-2675699-2025-02-06",
      "headline": "IND vs ENG: Joe Root fails on ODI return, outfoxed by Ravindra Jadeja for 19Joe Root failed on his return to the ODI team for England as he was dismissed for 19 runs in the match in Nagpur against India. Ravindra Jadeja was able to trap Root in front of the stumps as England continued to falter in the 1st ODI after a strong start. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-zim-vs-ire-johnathan-campbell-captaincy-test-debut-rare-list-2675692-2025-02-06",
      "headline": "Zimbabwe legend's son Johnathan Campbell captains on Test debut, joins rare clubZIM vs IRE, only Test: Son of legendary Zimbabwe opener Alistair Campbell, Johnathan, became only the sixth cricketer in the last 50 years to lead his team on debut in Test cricket. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}