{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/two-foreign-funds-with-investment-in-adani-group-under-sebi-scanner-2727060-2025-05-19",
      "headline": "Two foreign funds with investment in Adani Group under Sebi scannerThe Adani Group and its 13 offshore investors have been facing an investigation by the Securities and Exchange Board of India (Sebi) since Hindenburg Research in 2023 alleged improper use of tax havens by the group, triggering a stock sell-off."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/indusind-bank-insider-trading-sebi-probe-six-officials-accounting-error-report-2727042-2025-05-19",
      "headline": "Six IndusInd Bank officials under Sebi scanner for insider trading: ReportThe Securities and Exchange Board of India (Sebi) is checking the timing of these trades to find out whether the share sales broke Sebi's rules or the bank's own internal code of conduct."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/byju-raveendran-promises-comeback-despite-big-setbacks-i-am-not-giving-up-2727035-2025-05-19",
      "headline": "Byju's Raveendran promises comeback despite big setbacks: 'I am not giving up'Byju Raveendran, the founder of the edtech company, Byju's, admitted that the company made some business mistakes during its rapid global expansion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/boycott-turkey-hits-fashion-online-shopping-e-commerce-myntra-ajio-stop-selling-turkish-labels-2727016-2025-05-19",
      "headline": "'Boycott Turkey' hits fashion: Myntra, Ajio stop selling these Turkish labelsThe two leading online fashion platforms have removed Turkish products after growing boycott calls over Turkey's support to Pakistan during the recent India-Pakistan military conflict."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-closes-271-points-lower-nifty-below-25000-eternal-zomato-falls-3-percent-2727011-2025-05-19",
      "headline": "Sensex closes 271 points lower, Nifty below 25,000, Eternal falls 3%The S&P BSE Sensex was down 271.17 points to end at 82,059.42, while the NSE Nifty50 lost 74.35 points to close at 24,945.45. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/high-salaries-may-not-last-forever-zoho-ceo-sridhar-vembu-warns-software-engineers-2726990-2025-05-19",
      "headline": "'High salaries may not last forever': Zoho's Sridhar Vembu warns software engineersSridhar Vembu explained that the upcoming changes in software development, especially with large language models (LLMs) and new tools powered by artificial intelligence (AI), might lead to many software jobs being lost."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/vodafone-idea-share-price-fall-drop-10-percent-why-reason-supreme-court-hearing-agr-dues-plea-rejected-2726952-2025-05-19",
      "headline": "Vodafone Idea shares drop 10%. Here's whyVodafone Idea share price: Over the last month, Vodafone Idea's stock has gone down by 16.73%. In the last year, it has fallen over 50%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/what-is-new-in-itr-forms-for-fy-2024-25-5-key-changes-you-must-know-2726940-2025-05-19",
      "headline": "What's new in ITR Forms for FY 2024-25? 5 key changes you must knowNow taxpayers need to clearly mention the specific TDS section under which tax was deducted from your income. This change applies to ITR forms 1, 2, 3 and 5. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/supreme-court-dismisses-vodafone-idea-airtel-plea-on-agr-interest-dues-2726933-2025-05-19",
      "headline": "Supreme Court dismisses Vodafone Idea, Airtel plea on AGR interest duesThe court dismissed the writ petitions filed by the telecom operators, calling the move \"shocking\" and stating that the petitions were \"misconceived.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/brent-crude-oil-price-usd-65-stocks-that-may-benefit-investors-share-market-2726911-2025-05-19",
      "headline": "Brent crude slips below $65: These stocks may benefit investorsBrent futures for July delivery were trading at $64.98 a barrel, down 0.66%. This is a steep fall from January, when prices were above $80 a barrel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/once-earning-rs-128-crore-metaverse-engineer-now-sidelined-by-ai-and-delivering-food-2726903-2025-05-19",
      "headline": "Once earning Rs 1.28 crore, metaverse engineer now sidelined by AI and delivering foodShawn Kay has worked in tech for 20 years. He was involved in virtual reality, web development and artificial intelligence. But after being laid off in April last year, things took a turn for the worse. The metaverse boom faded and jobs in that space dried up, especially with the sudden rise of AI tools like ChatGPT."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/dreaming-of-a-job-abroad-these-are-the-easiest-countries-to-get-a-work-visa-2726861-2025-05-19",
      "headline": "Dreaming of a job abroad? These are the easiest countries to get a work visaLatvia is the easiest country to get a skilled worker visa. It scored 7.64 out of 10 for ease of entry. The visa itself costs around 83 pounds and typically gets approved in ten working days, according to a study conducted by Remitly."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/billie-eilish-tour-2025-new-dates-austin-concerts-and-ticket-info-glbs-2727322-2025-05-20",
      "headline": "Billie Eilish Tour 2025: New dates, Austin concerts, and ticket infoBillie Eilish has added 23 new shows to her 2025 tour, including Austin, Texas. The expanded tour spans Japan and the US, and tickets will be available from May 22.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/dilbert-creator-scott-adams-diagnosed-with-same-prostate-cancer-as-joe-biden-glbs-2727317-2025-05-20",
      "headline": "'Dilbert' creator Scott Adams diagnosed with same prostate cancer as Joe Biden\"Dilbert\" creator Scott Adams announced he has advanced prostate cancer, similar to Joe Biden's. He expects to live only a few more months and continues updating fans despite constant pain.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/dawn-richard-testifies-diddy-threatened-her-after-witnessing-cassie-attack-glbs-2727310-2025-05-20",
      "headline": "Dawn Richard testifies Diddy threatened her after witnessing Cassie attackDawn Richard testified that Diddy threatened her after she saw him abuse Cassie. Cassie's ex-roommate also detailed alleged assaults, NDAs, and financial control in the ongoing federal trial.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-to-team-up-with-director-vivek-athreya-for-his-next-2727190-2025-05-19",
      "headline": "Rajinikanth to team up with director Vivek Athreya for his next: ReportTelugu director Vivek Athreya, known for 'Brochevarevarura' and 'Saripodhaa Sanivaaram,' is reportedly in talks with Superstar Rajinikanth for his next film, likely to be produced by Mythri Movie Makers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-fame-shilpa-shirodkar-tests-covid-19-positive-urges-fans-to-wear-masks-2727191-2025-05-19",
      "headline": "Bigg Boss fame Shilpa Shirodkar tests Covid-19 positive, urges fans to 'wear masks'Former Bigg Boss 18 contestant Shilpa Shirodkar has tested Covid-19 positive. She has urged her fans to follow adequate precautions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/naseeruddin-shah-recalls-working-3-shifts-a-day-just-for-money-no-worse-torture-2727180-2025-05-19",
      "headline": "Naseeruddin Shah recalls working '3 shifts a day' just for money: No worse tortureNaseeruddin Shah spoke about the struggles of doing multiple film shifts just for money and called it a painful experience. His wife, Ratna Pathak Shah, shared how she always gives her best, even in small roles, and admired Naseeruddin's deep dedication to his art."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-takes-train-ride-from-delhi-kolkata-in-rare-photos-shared-by-old-friend-2727093-2025-05-19",
      "headline": "SRK takes train ride from Delhi-Kolkata in rare photos shared by old friendActor Amar Talwar shared rare old photos of Shah Rukh Khan from their theatre days, showing the superstar during a train journey with friends before fame. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-royals-director-priyanka-ghose-responds-to-criticism-on-ishaan-khatter-bhumi-pednekar-chemistry-zeenat-aman-cameo-2727151-2025-05-19",
      "headline": "Ishaan-Bhumi's chemistry to Zeenat's cameo, The Royals director reacts to criticism'The Royals' director Priyanka Ghose responds to mixed reactions to the show's lead chemistry and cameo roles. She remains focused on her work while fans await news of a second season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/twinkle-khannas-lesson-to-pakistan-let-dhinchak-pooja-re-dub-abida-parveen-songs-2727145-2025-05-19",
      "headline": "Twinkle Khanna's lesson to Pakistan: Let Dhinchak Pooja re-dub Abida Parveen songsTwinkle Khanna reacted to Pakistani actors getting removed from posters of Bollywood songs. The actor-author suggested that Abida Parveen's songs get re-dubbed by Dhinchak Pooja."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dhanush-meets-tourist-family-director-abishan-jeevinth-says-he-knew-it-would-work-2726997-2025-05-19",
      "headline": "Dhanush meets Tourist Family director Abishan Jeevinth, says he knew it would workDebutant director Abishan Jeevinth has been receiving a lot of appreciation for his film 'Tourist Family', starring Sasikumar and Simran. The latest to join the list is 'Raayan' actor Dhanush. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nimrat-kaur-fewer-work-opportunities-in-films-people-thought-i-moved-to-los-angeles-2727131-2025-05-19",
      "headline": "Nimrat Kaur on fewer work opportunities in films: People thought I moved to USActor Nimrat Kaur reveals how industry assumptions about her moving abroad affected her career opportunities. She discusses her preference for quality roles and interest in exploring new genres like horror and action."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/no-new-films-in-andhra-telangana-as-exhibitors-announce-theatre-strike-from-june-1-2727077-2025-05-19",
      "headline": "No new films in Andhra, Telangana as exhibitors announce theatre strike from June 1Cinema exhibitors in Andhra Pradesh and Telangana have announced an indefinite shutdown of theatres from June 1, 2025. If the shutdown goes ahead, big June releases, including 'Hari Hara Veera Mallu' and 'Thug Life,' may be affected."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sharmila-tagore-in-cannes-with-daughter-saba-ahead-of-aranyer-din-ratri-screening-2727116-2025-05-19",
      "headline": "Sharmila Tagore in Cannes with daughter Saba ahead of Aranyer Din Ratri screeningVeteran actor Sharmila Tagore and daughter Saba Pataudi arrived at the 2025 Cannes Film Festival for the screening of Satyajit Ray's restored classic 'Aranyer Din Ratri'. The film, that will be showcased in the Cannes Classics section, highlights Ray's timeless storytelling and features an ensemble cast including Tagore, Simi Garewal, and Soumitra Chatterjee."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-jin-urges-fans-not-to-grab-his-hand-after-kiss-attempt-at-bts-festa-2727081-2025-05-19",
      "headline": "BTS Jin urges fans not to grab his hand after kiss controversy at BTS FestaDuring the fan event Hi-Seokjin, BTS member Jin asked ARMY not to grab his hand. He also set a condition for when fans should avoid taking pictures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/suniel-shetty-missing-not-part-of-border-2-son-ahan-shetty-sunny-deol-2725674-2025-05-19",
      "headline": "Suniel Shetty is missing not being part of Border 2: But my son Ahan is thereSuniel Shetty, who was part of the 1997 film 'Border,' talks about its sequel and his son Ahan Shetty being part of it. He also praises Varun Dhawan for taking care of his son on the set."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/adarsh-gourav-shanaya-kapoor-tu-yaa-main-to-begin-shooting-in-june-2727003-2025-05-19",
      "headline": "Adarsh Gourav and Shanaya Kapoor to begin Tu Yaa Main shooting in June. DetailsAdarsh Gourav and Shanaya Kapoor are set to begin shooting for their upcoming thriller 'Tu Yaa Main' in June. Directed by Bejoy Nambiar and produced by Aanand L Rai, the film will release on Valentine's Day 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/american-manhunt-review-riveting-documentary-about-hunt-for-laden-that-hits-home-2727036-2025-05-19",
      "headline": "American Manhunt review: Riveting documentary about hunt for Laden that hits homeReleased-Wed May 14, 2025The timing of the release of 'American Manhunt - Osama bin Laden' on Netflix India may be coincidental. However, that's what exactly makes it feel so personal. The three-part documentary humanises the entire operation - the facts we know, the minds we don't."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rupali-ganguly-slams-jyoti-malhotras-hatred-for-india-amid-espionage-allegations-2727028-2025-05-19",
      "headline": "Rupali Ganguly reacts to Jyoti Malhotra's arrest over 'spying for Pakistan'Rupali Ganguly slammed YouTuber Jyoti Malhotra, accused of spying for Pakistan, on social media. The actor called for stern action against those working against India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/kunal-kohli-calls-mission-impossible-8-yawn-fest-messed-up-greatest-franchises-ever-2726936-2025-05-19",
      "headline": "Mission Impossible 8 is yawn fest, messes up great franchise: Kunal KohliFilmmaker Kunal Kohli recently reviewed Tom Cruise's Mission Impossible:8. While expressing his disappointment with the new sequel, he called it a 'yawn fest'."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jyoti-malhotra-arrested-haryana-youtuber-vaisakhi-festival-pak-pilgrimage-espionage-2727189-2025-05-19",
      "headline": "From Vaisakhi in Pak to espionage: How Jyoti Malhotra became a security threatJyoti Malhotra, the Haryana-based YouTuber arrested on charges of espionage, first visited Pakistan in 2023 during the 324th Vaisakhi Festival. Her trip has come under the scanner by Indian intel agencies for allegedly aiding cross-border influence operations."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/no-us-role-ceasefire-nuclear-signalling-pakistan-foreign-secretary-vikram-misri-tells-parliament-panel-2727150-2025-05-19",
      "headline": "America had no role in working out cessation of hostilities, MPs panel toldForeign Secretary Vikram Misri told a parliamentary panel that the India-Pakistan ceasefire was strictly bilateral, dismissing US involvement and denying any nuclear signalling from Islamabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/putin-trump-call-russia-ukraine-war-us-zelenskyy-conflict-meeting-2727284-2025-05-19",
      "headline": "Russia ready to end Ukraine conflict: Putin after 2-hour call with TrumpRussian President Vladimir Putin said that he is ready to work with Ukraine to end the ongoing conflict. The announcement comes following a conversation with US President Donald Trump."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-srh-vs-lsg-match-report-lucknow-knocked-out-playoffs-rishabh-pant-2727290-2025-05-19",
      "headline": "SunRisers burst LSG's bubble, leave Pant's playoff dreams in tattersRishabh Pant's Lucknow Super Giants were knocked out of the IPL 2025 after a terrible show against SunRisers Hyderabad on Monday, May 19. Abhishek Sharma and Eshan Malinga combined to hand LSG a 6-wicket defeat at the Ekana Stadium in Lucknow.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/american-manhunt-review-riveting-documentary-about-hunt-for-laden-that-hits-home-2727036-2025-05-19",
      "headline": "American Manhunt review: Riveting documentary about hunt for Laden that hits homeReleased-Wed May 14, 2025The timing of the release of 'American Manhunt - Osama bin Laden' on Netflix India may be coincidental. However, that's what exactly makes it feel so personal. The three-part documentary humanises the entire operation - the facts we know, the minds we don't."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/delhi-high-court-celebi-aviation-security-clearance-revoked-turkey-india-pakistan-tensions-2727203-2025-05-19",
      "headline": "Better safe than sorry: High Court after Turkey-based company's clearance revokedIndia revoked the security clearance of Turkish-based firm Celebi Aviation in the interest of \"national security\" after Ankara sided with Pakistan and condemned India's strikes on the neighbouring country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/woman-army-officer-from-signals-takes-part-in-operation-sindoor-sets-example-for-son-2727021-2025-05-19",
      "headline": "Signals of strength: Meet woman officer who played backbone role during Op SindoorThe woman officer from the Signals regiment recalled her experiences from the conflict, during which she and her team handled communication amongst various branches of the army, not only on the ground, but also in the air. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-espionage-crackdown-pakistani-spies-isi-arrested-pahalgam-terror-attack-aftermath-2727078-2025-05-19",
      "headline": "From Jyoti Malhotra to Devender Singh: 11 'Pak spies' caught in India over 3 daysA YouTuber, security guard and an app developer were among the 11 people caught red-handed by the police for allegedly passing on sensitive information about India's national security and military to Pakistani operatives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/ranthambore-tigress-kankati-open-top-safari-vehicles-worth-the-risk-forest-tourism-maruti-suzuki-gypsy-2727104-2025-05-19",
      "headline": "Open-top safari vehicles: Are they worth the risk in forest tourism?While most vehicles used in forest safaris are open-top, this raises a critical question: do they leave tourists vulnerable, and is it a risk worth taking?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/an-architectural-trail-in-gujarat-2723608-2025-05-15",
      "headline": "An Architectural Trail in GujaratPress Release | Vadnagar has substantial remains of its ancient Buddhist heritage."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/mahatma-gandhi-assassination-nathuram-godse-birth-anniversary-2727076-2025-05-19",
      "headline": "How a one-eyed man foiled Nathuram Godse's plot to kill Mahatma GandhiNathuram Godse, born this day in 1910, originally planned to lob grenades at Mahatma Gandhi at a prayer meeting. His accomplices turned the conspiracy into a farce."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-rr-ms-dhoni-future-stephen-fleming-press-conference-2727207-2025-05-19",
      "headline": "MS Dhoni in IPL 2026? Coach Stephen Fleming tight-lipped about CSK great's futureIPL 2025: Chennai Super KIngs head coach Stephen Fleming was asked about MS Dhoni's future in the tournament ahead of their match against Rajasthan Royals in Delhi. Dhoni, 43, will lead CSK in their last two league games of the season. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/uk-news/story/indian-origin-professor-in-uk-loses-oci-status-anti-india-activities-nitasha-kaul-university-of-westminster-2726943-2025-05-19",
      "headline": "Indian-origin professor in UK loses OCI status over anti-India activitiesThe OCI status of UK-based Indian-origin academician Nitasha Kaul has been cancelled over \"anti-India activities\", driven by \"malice and complete disregard for facts or history\". The government notice was shared by Kaul, who was deported from Bengaluru airport last year within hours of her landing in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-pakistan-rhetoric-threatens-nuclear-non-attack-pact-with-india-2726963-2025-05-19",
      "headline": "How Pakistan rhetoric threatens nuclear non-attack pact with IndiaThe 1988 pact mandates India-Pakistan to desist from attacking each other's nuclear facilities and is one of the few confidence-building measures surviving decades of conflict"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/influencers-under-scanner-for-pakistan-links-jyoti-malhotra-priyanka-senapati-devinder-singh-dhillon-2727185-2025-05-19",
      "headline": "Followers, free trips, and easy visas: Influencers under scanner for Pakistan linksMore followers, free trips, easy visas — but at what cost?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/mumbai/story/mumbai-daughter-rape-murder-by-mother-boyfriend-toddler-dies-in-malvani-area-2727094-2025-05-19",
      "headline": "Mumbai minor raped, killed by her mother's partner as woman watches heinous actThe minor girl was raped by Farhan Shaikh in front of her mother, Reena Shaikh, in Mumbai's Malvani area. Both the accused are currently in police custody."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/photo/polar-bear-biopsies-arctic-pollution-research-2727080-2025-05-19",
      "headline": "Polar bears in peril — biopsies shed light on Arctic pollution crisisHigh above the icy expanse of Norway's Svalbard archipelago, a helicopter hovers, a tranquilliser dart is fired, and a polar bear collapses into the snow — not as a trophy, but as a test subject. In a groundbreaking mission, scientists are collecting fat biopsies from these apex predators to study how persistent industrial pollutants, like PFAS chemicals, are silently infiltrating the Arctic food chain."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/uttar-pradesh-woman-elopes-with-uncle-in-law-two-daughters-husband-announces-reward-2727118-2025-05-19",
      "headline": "UP woman elopes with husband's uncle, her two daughters, leaves son behindOn April 3, Jitendra Kumar, a taxi driver, returned home from Kanpur only to find that his wife had run away with his paternal uncle, taking their two daughters along."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-india-not-dharamshala-sri-lankan-national-plea-against-deportation-2727030-2025-05-19",
      "headline": "India not a dharamshala: Supreme Court junks Sri Lankan's plea against deportationThe petitioner, a Sri Lankan Tamil citizen, had sought protection from deportation, citing a threat to his life if he were to return to his home country. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/sindoor-ka-saudagar-congress-steps-up-attack-on-s-jaishankar-despite-fact-check-operation-sindoor-2726967-2025-05-19",
      "headline": "Sindoor ka saudagar: Congress steps up attack on S Jaishankar despite fact-checkRahul Gandhi once again reiterated his claims that India maintained silence over the loss of assets during Operation Sindoor, calling it a 'crime' to have informed Pakistan beforehand, while citing remarks made by S Jaishankar. Following his tweet, Congress leader Pawan Khera called BJP 'Sindoor ka saudagar' while playing Jaishankar's video byte."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-its-fewer-cheers-for-beer-in-karnataka-2726949-2025-05-19",
      "headline": "Why it's fewer cheers for beer in KarnatakaThe state's bid to mobilise resources has seen four excise duty hikes on beer in two years. A fuming industry fears it will choke sales"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/who-is-ali-khan-mahmudabad-arrest-operation-sindoor-ashoka-university-2726962-2025-05-19",
      "headline": "Who is Ali Khan Mahmudabad, Ashoka University professor held over Op Sindoor post?Ali Khan Mahmudabad, a historian and Ashoka University professor, was arrested over a social media post on Operation Sindoor. He comes from a royal lineage and has a rich academic and political background.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/haryana-youtuber-jyoti-malhotra-travel-with-jo-role-pakistan-spy-network-exposed-pro-pak-videos-bali-trip-2727122-2025-05-19",
      "headline": "From pro-Pak videos to Bali trip: Haryana YouTuber's role in 'spy network' exposedHaryana YouTuber Jyoti Malhotra who was arrested for aiding Pakistan's spy agency was assigned tasks including vlogging, intel sharing, and travelling with operatives. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/baloch-rebels-release-video-of-jaffar-express-hijacking-counter-pak-narrative-2727019-2025-05-19",
      "headline": "Baloch rebels release video of Jaffar Express hijack, counter Pak narrativeThe Baloch Liberation Army, a separatist group seeking Balochistan's secession from Pakistan, hijacked the Peshawar-bound Jaffar Express on March 11 after blowing up the railway tracks. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/uae-vs-bangladesh-2nd-t20i-historic-win-sharjah-score-2727316-2025-05-20",
      "headline": "UAE chase record 206 in Sharjah, beat Bangladesh for first time in T20I cricketUAE vs Bangladesh, 2nd T20I: The UAE pulled off their highest-ever T20I chase to beat Bangladesh for the first time in T20I cricket. Captain Muhammad Waseem led from the front with a blistering 82 in Sharjah. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-blames-unsettled-bowling-unit-after-early-exit-from-ipl-2025-2727303-2025-05-20",
      "headline": "Rishabh Pant blames unsettled bowling unit after early exit from IPL 2025Lucknow Super Giants (LSG) captain Rishabh Pant has blamed the team's unsettled bowling unit following their early exit from the Indian Premier League 2025 (IPL 2025). LSG got out of the playoffs race after a six-wicket loss against Sunrisers Hyderabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-srh-vs-lsg-match-report-lucknow-knocked-out-playoffs-rishabh-pant-2727290-2025-05-19",
      "headline": "SunRisers burst LSG's bubble, leave Pant's playoff dreams in tattersRishabh Pant's Lucknow Super Giants were knocked out of the IPL 2025 after a terrible show against SunRisers Hyderabad on Monday, May 19. Abhishek Sharma and Eshan Malinga combined to hand LSG a 6-wicket defeat at the Ekana Stadium in Lucknow.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-must-play-on-instinct-and-not-to-prove-a-point-aaron-finch-2727271-2025-05-19",
      "headline": "Out of form Rishabh Pant must play on instinct and not to prove a point: Aaron FinchFormer Australia cricketer Aaron Finch has said that Rishabh Pant has looked completely out of rhythm in the ongoing Indian Premier League 2025 (IPL 2025) and advised him to play on instincts instead of proving a point."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-srh-abhishek-sharma-digvesh-rathi-fight-video-2727267-2025-05-19",
      "headline": "Watch: Abhishek Sharma loses cool after Digvesh Rathi's signature send-offIPL 2025, LSG vs SRH: SunRisers Hyderabad opener Abhishek Sharma was involved in a tense face-off with Digvesh Rathi after the Lucknow Super Giants spinner gave him a send-off in his trademark style. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nicholas-pooran-leads-lucknow-super-giants-ipl-revival-after-crucial-mid-season-break-2727237-2025-05-19",
      "headline": "Disappointed Pooran ready to lead LSG's charge after much-needed breakNicholas Pooran said that he was ready to lead Lucknow Super Giants' charge after a much-needed IPL break. The team aims to regain momentum and secure a playoffs spot despite recent setbacks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harshal-patel-faster-than-lasith-malinga-to-150-wickets-in-ipl-history-2727242-2025-05-19",
      "headline": "Harshal Patel faster than Lasith Malinga to take 150 wickets in IPL historyIndia and Sunrisers Hyderabad (SRH) seamer Harhsal Patel became the fastest bowler to take 150 wickets in IPL history as he left Lasith Malinga and Yuzvendra Chahal behind in the list. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-srh-rishabh-pant-eshan-malinga-catch-2727243-2025-05-19",
      "headline": "LSG vs SRH: Eshan Malinga's stunning catch compounds Rishabh Pant's horror showIPL 2025: Rishabh Pant was dismissed for 7 in Lucknow Super Giant's match against SunRisers Hyderabad in Lucknow. Eshan Malinga took a stunning return catch to add to Pant's woes on Monday, May 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ishan-kishan-drops-cost-srh-against-lucknow-super-giants-ipl-2025-2727204-2025-05-19",
      "headline": "2 drops, 1 stumping missed: Fans call out Kishan's horror show vs LSGIshan Kishan dropped crucial catches during SRH's match against Lucknow Super Giants. His errors impacted the game and drew sharp criticism from fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-rr-ms-dhoni-future-stephen-fleming-press-conference-2727207-2025-05-19",
      "headline": "MS Dhoni in IPL 2026? Coach Stephen Fleming tight-lipped about CSK great's futureIPL 2025: Chennai Super KIngs head coach Stephen Fleming was asked about MS Dhoni's future in the tournament ahead of their match against Rajasthan Royals in Delhi. Dhoni, 43, will lead CSK in their last two league games of the season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/gary-lineker-steps-down-bbc-antisemitic-image-controversy-apology-2727186-2025-05-19",
      "headline": "Gary Lineker quits BBC after major social media controversyGary Lineker has stepped down from the BBC following backlash over a controversial social media post. His departure ends a significant broadcasting era."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harshal-patel-faster-than-lasith-malinga-to-150-wickets-in-ipl-history-2727242-2025-05-19",
      "headline": "Harshal Patel faster than Lasith Malinga to take 150 wickets in IPL historyIndia and Sunrisers Hyderabad (SRH) seamer Harhsal Patel became the fastest bowler to take 150 wickets in IPL history as he left Lasith Malinga and Yuzvendra Chahal behind in the list. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-srh-rishabh-pant-eshan-malinga-catch-2727243-2025-05-19",
      "headline": "LSG vs SRH: Eshan Malinga's stunning catch compounds Rishabh Pant's horror showIPL 2025: Rishabh Pant was dismissed for 7 in Lucknow Super Giant's match against SunRisers Hyderabad in Lucknow. Eshan Malinga took a stunning return catch to add to Pant's woes on Monday, May 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ishan-kishan-drops-cost-srh-against-lucknow-super-giants-ipl-2025-2727204-2025-05-19",
      "headline": "2 drops, 1 stumping missed: Fans call out Kishan's horror show vs LSGIshan Kishan dropped crucial catches during SRH's match against Lucknow Super Giants. His errors impacted the game and drew sharp criticism from fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-rr-ms-dhoni-future-stephen-fleming-press-conference-2727207-2025-05-19",
      "headline": "MS Dhoni in IPL 2026? Coach Stephen Fleming tight-lipped about CSK great's futureIPL 2025: Chennai Super KIngs head coach Stephen Fleming was asked about MS Dhoni's future in the tournament ahead of their match against Rajasthan Royals in Delhi. Dhoni, 43, will lead CSK in their last two league games of the season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/gary-lineker-steps-down-bbc-antisemitic-image-controversy-apology-2727186-2025-05-19",
      "headline": "Gary Lineker quits BBC after major social media controversyGary Lineker has stepped down from the BBC following backlash over a controversial social media post. His departure ends a significant broadcasting era."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}