{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-694-points-lower-nifty-below-25000-asian-paints-down-2-percent-2775268-2025-08-22",
      "headline": "Sensex closes 694 points lower, Nifty below 25,000; Asian Paints down 2%Sensex closes 694 points lower, Nifty below 25,000; Asian Paints down 2%"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/this-investor-cut-his-rs-10-lakh-tax-bill-to-0-heres-the-trick-2775257-2025-08-22",
      "headline": "This investor cut his Rs 10 lakh tax bill to 0. Here's howMany taxpayers assume that once the financial year ends, their chance to save tax is gone.and Ramesh was no exception. But instead of rushing, he used a little-known route that brought his tax bill down to nothing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/upcoming-ipos-vikran-engineering-anlon-healthcare-market-listings-gmp-patel-vikram-solar-gem-shreeji-2775259-2025-08-22",
      "headline": "Dalal Street gears up for busy week with 5 market debuts, 2 IPOs in pipelineMangal Electrical Industries is set to debut on August 28 after finalising its allotment on August 25. Patel Retail, Vikram Solar, Gem Aromatics, and Shreeji Shipping Global will all list on August 26."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wealthy-asian-families-bet-big-on-crypto-report-2775211-2025-08-22",
      "headline": "Wealthy Asian families bet big on crypto: ReportThe growing interest comes as Bitcoin recently hit an all-time high of over $124,000. New rules, such as Hong Kong's stablecoin legislation and the United States' GENIUS Act, have further boosted confidence in the sector."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/money-based-gaming-ban-rocks-advertising-sports-sponsorships-whats-at-stake-2775202-2025-08-22",
      "headline": "Real-money gaming ban rocks advertising, sports sponsorships: What's at stake?The rise of money-based platforms created billions in advertising spend, now facing a sudden halt. This article examines how the ban on real-money gaming is reshaping India's advertising, sports sponsorships, and emerging e-sports opportunities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/cibil-credit-score-rating-how-to-improve-loans-emis-transparent-trans-union-personal-finance-2775191-2025-08-22",
      "headline": "Credit score confusion: Is CIBIL transparent enough in deciding your financial fate?The credit score by CIBIL can decide whether someone gets a car loan, a home loan, or even a credit card. Yet, very few actually know how CIBIL works or who controls it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-2024-25-comparing-deductions-under-old-and-new-tax-regime-2775132-2025-08-22",
      "headline": "ITR filing 2024–25: Comparing deductions under old and new tax regimeFiling your Income Tax Return for FY 2024–25? Before you decide on old or new tax regime, it's important to know how deductions differ. The right choice could help reduce your taxable income and overall tax burden."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-middle-class-feels-stuck-between-taxes-and-emis-explains-ca-2775094-2025-08-22",
      "headline": "Why middle class feels stuck between taxes and EMIs, explains CAThe burden is not just about taxes. Price hikes on fuel, food, education, and healthcare hit the middle class the hardest. Unlike the rich, they cannot hedge against inflation with high-value assets. Unlike the poor, they don't receive government relief."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-falling-sensex-nifty-down-why-reason-fed-speech-jackson-hole-it-banking-shares-down-2775089-2025-08-22",
      "headline": "Sensex down 600 points: Why is stock market falling today?At closing bell, indices opened marginally lower but kept sliding as the day went on. Sensex and Nifty declined over half a percent. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/will-life-health-insurance-premiums-become-cheaper-with-zero-gst-proposal-2775076-2025-08-22",
      "headline": "Will life, health insurance premiums become cheaper with zero GST proposal?Will zero GST on life and health insurance truly make premiums cheaper or will input credit losses and policy design dilute the benefits for most customers? Read to know what experts have to say."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-down-90-points-nifty-above-25050-wipro-maruti-lead-gains-2775034-2025-08-22",
      "headline": "Sensex down 350 points, Nifty below 25,000; Wipro, HCLTech down 2%The S&P BSE Sensex was down by 380.59 points to 81,620.12, while the NSE Nifty50 declined 127.95 points to 24,956.25 as of 9:30 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mpl-zupee-suspend-paid-games-after-online-gaming-bill-clears-parliament-2775021-2025-08-22",
      "headline": "Dream11, MPL suspend money-based games after Online Gaming Bill clears ParliamentReal-money gaming faces a knockout blow as Dream11, MPL, and Zupee halt money-based online games. Dream11 is also likely to follow suit after sweeping ban."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/r-madhavan-sarita-sirji-celebrate-son-vedaant-birthday-dia-mirza-ronit-roy-raj-kundra-share-wishes-2775261-2025-08-22",
      "headline": "R Madhavan, wife celebrate son's 20th birthday, Rehna Hai co-star Dia sends wishesOn the occasion of their son Vedaant's birthday, actor R Madhavan's wife shared a series of throwback photos on social media. Several actors, including Dia Mirza and Ronit Roy, extended their wishes in the comment section of the post."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/nausheen-ali-sardar-sima-taparia-reject-matchmaking-religion-controversy-2775235-2025-08-22",
      "headline": "Sima Taparia rejects Nausheen Ali Sardar's matchmaking request over religionNausheen Ali Sardar revealed that matchmaker Sima Taparia refused to help her find a life partner due to her religion. The actor criticised Taparia's conservative views and questioned who defines the right match for her."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jr-ntr-reassess-future-choices-a-mixed-reviews-for-war-2-dragon-prashanth-neel-2775246-2025-08-22",
      "headline": "Jr NTR to reassess future choices after War 2's poor theatrical run | ExclusiveJr NTR is now rethinking his Bollywood journey following the underperformance of 'War 2'. The actor is now concentrating on Telugu cinema and a major pan-India project with director Prashanth Neel to strengthen his mass appeal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-contestants-amaal-malik-kunickaa-sadanand-gaurav-khanna-ashnoor-kaur-2775185-2025-08-22",
      "headline": "Bigg Boss 19 official confirmed contestants list revealed. Find out moreBigg Boss 19 has officially commenced shooting with 17 diverse contestants including actors, singers, influencers and comedians, hosted by Salman Khan. The season promises exciting twists with special entries like Mike Tyson and a mix of familiar and fresh faces from India and abroad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/krushna-abhishek-kiju-sharma-fight-great-indian-kapil-show-viral-video-suggests-so-2775232-2025-08-22",
      "headline": "Did Krushna Abhishek and Kiku Sharda fight on Kapil Show? Viral video suggests soA viral video of comedians Krushna Abhishek and Kiku Sharda getting into a heated argument has shocked fans. Neither of the duo has issued any statemnet on the spat. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/apoorva-mukhija-responds-ex-boyfriend-viral-cute-little-red-flag-song-cheating-allegations-2775200-2025-08-22",
      "headline": "Apoorva Mukhija responds to her ex's viral song: Truth always comes outInfluencer Apoorva Mukhija has reacted to cheating allegations by her ex-boyfriend, Utsav Dahiya. She commented on a reel of an influencer, stating that the truth always comes out. Meanwhile, Dahiya alleged that attempts are being made to hack into his social media account."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/shwetha-menon-leads-1st-film-body-meeting-as-president-prioritises-member-safety-2775215-2025-08-22",
      "headline": "Shwetha Menon leads 1st film body meeting as president, prioritises member safetyThe Association of Malayalam Movie Artistes (AMMA) held its first committee meeting post-elections in Kochi. President Shwetha Menon emphasised member safety and announced new committees. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-fans-ar-murugadoss-blames-everyone-sikandar-box-office-failure-2775199-2025-08-22",
      "headline": "Salman Khan fans say AR Murugadoss blames everyone but himself for Sikandar failureDirector AR Murugadoss recently opened up on facing difficulties during 'Sikandar' shoot with actor Salman Khan due to late call times. Fans criticised the director for blaming the actor for the film's failure, sparking a heated debate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/swara-bhasker-bio-update-dimple-yadav-confession-bisexuality-views-spark-buzz-2775129-2025-08-22",
      "headline": "Swara Bhaskar updates X bio after her Dimple Yadav confession sparks buzzActor Swara Bhasker modified her X bio to include 'girl crush advocate' on Friday. She also flaunted the update on her social media platform. This came after the actor shared her views on bisexuality and admitted to having a crush on Samajwadi Party MP Dimple Yadav. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanths-grandson-lingaa-composer-anirudh-ravichna-2775116-2025-08-22",
      "headline": "Rajinikanth's grandson, composer Anirudh turn bouncers for Thalaivar at event. ViralRajinikanth's grandson Lingaa and nephew Anirudh Ravichander, along with other bouncers, protected and escorted him to the car. The video is now going viral on social media"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vir-das-welcomes-top-courts-modified-order-for-sterilisation-return-of-stray-dogs-2775180-2025-08-22",
      "headline": "Vir Das welcomes top court's modified order for sterilisation, return of stray dogs Vir Das praised the Supreme Court for balancing safety with compassion in its modified order, and urged municipalities to act swiftly on feeding areas and training support."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ram-charan-chiranjeevi-70th-birthday-best-father-touches-feet-2775171-2025-08-22",
      "headline": "Ram Charan touches Chiranjeevi's feet, wishes best father on 70th birthday. WatchRam Charan touched his father Chiranjeevi's feet and fed him cake in the birthday celebration video that he shared on his Instagram page. He called Megastar the best father anyone could wish for."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kaun-banega-crorepati-17-big-b-flirts-with-contestant-keeps-her-lipstick-stained-handkerchief-2775168-2025-08-22",
      "headline": "KBC 17: Big B flirts with contestant, keeps her lipstick-stained handkerchiefIn the latest promo of 'Kaun Banega Crorepati 17', Amitabh Bachchan playfully interacted with a contestant. The veteran actor then took her handkerchief and kept it with him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/top-romantic-k-dramas-best-korean-love-stories-to-watch-online-netflix-prime-and-jiohotstar-why-hollywood-cant-keep-up-2773531-2025-08-22",
      "headline": "K-dramas have cracked the romance code and why Hollywood can't keep upK-dramas have perfected swoon-worthy romance with iconic scenes, umbrellas, rain kisses, piggybacks, and cherry blossoms. In this week's K-fix, we will discuss why their love stories hit differently.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-battle-of-galwan-shoot-ladakh-director-behind-the-scenes-glimpse-2775097-2025-08-22",
      "headline": "Salman Khan begins Battle of Galwan shoot in Ladakh, director shares glimpseActor Salman Khan has started shooting for his much-anticipated film 'Battle of Galwan' in Ladakh. A day after a behind-the-scenes photo went viral, director Aapoorva Lakhia shared updates on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/chiranjeevi-birthday-pawan-kalyan-allu-arjun-venkatesh-chandrababu-naidu-wishes-megastar-on-birthday-2775074-2025-08-22",
      "headline": "Chiranjeevi turns 70: Pawan Kalyan to Allu Arjun, celebs wish Megastar on birthdayMegastar Chiranjeevi is celebrating his 70th birthday today, August 22. His brother Pawan Kalyan, Allu Arjun and several others conveyed their wishes to the superstar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-soni-razdan-enjoy-beach-holiday-shaheen-bhatt-boyfriend-ishaan-mehra-2775061-2025-08-22",
      "headline": "Alia Bhatt, Soni Razdan enjoy beach holiday with Shaheen and her boyfriend. PicsShaheen Bhatt gave fans a glimpse of her beach getaway with sister Alia Bhatt on Instagram. The two were joined by their mother, Soni Razdan. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/lil-nas-x-arrested-hospitalised-after-roaming-streets-in-underwear-report-2775045-2025-08-22",
      "headline": "Rapper Lil Nas X arrested, hospitalised after roaming streets in underwear: ReportRapper Lil Nas X was arrested and hospitalised for a possible overdose after he was seen wandering Ventura Boulevard in Los Angeles in his underwear. A video of him walking on the streets at midnight has emerged online. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mammootty-brother-ibrahim-kutty-overwhelmed-overjoyed-fans-prayers-2775029-2025-08-22",
      "headline": "Mammootty's brother overjoyed with fans' prayers: Anxieties have subsidedMammootty's brother, Ibrahim Kutty, shared a heartfelt note on the actor's recovery. He was moved to see the whole world pray for Mammootty's recovery."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/what-are-you-doing-supreme-court-raps-political-parties-inaction-on-missing-bihar-voters-2775209-2025-08-22",
      "headline": "Top court says Aadhaar can be used for Bihar claims, raps parties on 'inaction'The Supreme Court's remarks came after the Election Commission said none of the major political parties in Bihar filed any objections over the draft electoral rolls."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/release-stray-dogs-after-sterilisation-aggressive-ones-to-be-kept-in-shelters-supreme-court-modifies-order-2775083-2025-08-22",
      "headline": "Release stray dogs after sterilisation: Supreme Court modifies its 'harsh' orderStray dogs verdict: The Supreme Court said stray dogs, which are picked up, must be released after immunisation, except those that are infected with rabies or exhibit aggressive behaviour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-narendra-modi-bihar-west-bengal-visit-inaugurates-infrastructure-projects-kolkata-metro-patna-gaya-2774997-2025-08-22",
      "headline": "No one can give orders from jail: PM's push for 'criminal netas' bill in BiharPM Modi asserted that \"no one can give orders from jail,\" as he targeted parties that, he claimed, treat Bihar's people merely as a vote bank while ignoring their aspirations, dignity and development."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/cctv-viral-tata-harrier-ev-accident-in-tamil-nadu-reportedly-claims-mans-life-tata-motors-issues-statement-2775226-2025-08-22",
      "headline": "Tata EV 'in Summon Mode' knocks man down, CCTV captures fatal accidentTata Motors expressed condolences after a tragic accident in Tamil Nadu's Tiruppur district, where a man named Senthil reportedly died in a Tata Harrier EV mishap. The SUV, reportedly in Summon Mode, rolled back outside his shop, fatally striking him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/donald-trump-trade-war-tariff-china-boston-tea-party-chinese-tea-east-india-company-american-independence-trump-2775123-2025-08-22",
      "headline": "It was a tax, that too on tea from China, that led to US independenceWith eye on China, President Trump has led the US into a tariff war. However, it was the issue of tax on a Chinese export, tea, that sparked the American Revolution, which ultimately led to the independence of the US from Britain. Yes, we are referring to the Boston Tea Party of 1773 when Chinese tea was dumped into the Atlantic Ocean."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-directs-ngos-dog-lovers-to-deposit-funds-for-stray-dog-welfare-2775198-2025-08-22",
      "headline": "Deposit Rs 2 lakh for stray dog welfare to appear in case: Top court to NGOsThe Supreme Court on Friday, in its modified order on stray dogs, said: \"Every individual dog lover and NGO intervening in the suo moto proceedings must deposit Rs 25,000 and Rs 2 lakh respectively, with the court's registry. Failure to comply will disqualify them from further participation in the case.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/hitting-trump-where-it-hurts-chinas-soybean-shift-to-brazil-strains-us-farmers-2775063-2025-08-22",
      "headline": "Hitting Trump where it hurts, China's soybean shift to Brazil strains US farmersAfter Russia and China rolled out the red carpet for Indian goods, another Brics nation, Brazil — which has also faced tariffs of up to 50% similar to those on India — is now replacing the US as Beijing's main soybean supplier, according to reports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-womens-world-cup-bengaluru-m-cinnaswamy-stadium-venue-change-2775219-2025-08-22",
      "headline": "Women's World Cup matches moved out of Bengaluru after stadium stampede fiascoICC Women's World Cup 2025: Five matches originally scheduled at M. Chinnaswamy Stadium in Bengaluru have been moved to DY Patil Stadium in Navi Mumbai. The ICC announced the venue change on Friday, August 22, after the Karnataka state cricket body failed to secure the necessary approvals following the stampede incident during RCB's victory celebrations in June."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/stray-dog-case-supreme-court-which-side-won-animal-lovers-shelters-debate-vaccinate-heres-more-2775195-2025-08-22",
      "headline": "Street dogs case: Who's emerged victorious after Supreme Court's verdict?In the street dog case, the Supreme Court's verdict sees elements of both sides of the stray dog arguments: strays will be sterilised and vaccinated, aggressive ones will be kept in shelters, and public feeding will be limited to designated areas. But which side really won the stray dog debate?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/why-did-students-in-bangladesh-turn-toward-fundamentalism-protests-2024-sheikh-hasina-yunus-mujib-islamist-2775093-2025-08-22",
      "headline": "Why did students in Bangladesh turn towards fundamentalism?How did Bangladesh's campuses come to be dominated by fundamentalist students by 2024? The situation was a stark reversal from the progressive activism of 1971. Decades of dynastic politics and the erosion of independent leadership due to a ban on campus elections were exploited by fundamentalists."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/us-tariffs-over-russian-oil-purchase-will-india-take-china-advice-on-bully-donald-trump-reciprocal-duty-america-2775213-2025-08-22",
      "headline": "Will India take China's advice on bully Trump?The Chinese envoy to India goaded New Delhi to take on US President Trump, saying \"silence only emboldens the bully\". While China threatened the US with reciprocal tariffs, India has taken a more nuanced diplomatic approach. Trade figures reveal why India isn't China. However, India is acting, but silently, with the belief that patience pays."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/pm-modi-inaugurates-asias-widest-six-lane-bridge-in-bihar-key-features-2775267-2025-08-22",
      "headline": "PM Modi inaugurates Asia's widest six-lane bridge in Bihar: Key featuresIndia's widest six-lane cable-stayed bridge over the Ganga is now open in Bihar, connecting North and South Bihar directly.\r\nThe Aunta-Simaria Bridge will save hours of travel time, boost trade, and mark a new era in regional development.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/will-cheaper-obesity-drugs-actually-make-india-healthier-2774833-2025-08-22",
      "headline": "Will cheaper obesity drugs actually make India healthier?This is but a fact that obesity drugs are only going to get more accessible for Indians post-March 2026. But whether they make us healthier depends on how we use them. If they become another over-the-counter fad, the country risks trading one public health crisis for another."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indians-used-gold-coins-nishka-harappan-rig-vedic-period-earliest-discovery-archaeologist-br-mani-delhi-national-museum-2774946-2025-08-22",
      "headline": "Indians used gold coins in Harappan, Rig Vedic period, 3,000 years before believedNew research by India's top archaeologist BR Mani reveals that the Harappans and Vedic people were using gold coins, known as Nishka. The coins were used as currency, trade assets, ritual offerings and status symbols, says Mani. This discovery pushes back the timeline of Indian gold coinage by nearly three millennia, which would reshape our understanding of the subcontinent's ancient economy and culture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/cibil-credit-score-rating-how-to-improve-loans-emis-transparent-trans-union-personal-finance-2775191-2025-08-22",
      "headline": "Credit score confusion: Is CIBIL transparent enough in deciding your financial fate?The credit score by CIBIL can decide whether someone gets a car loan, a home loan, or even a credit card. Yet, very few actually know how CIBIL works or who controls it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/as-modi-govt-tables-bills-to-prevent-rule-from-jail-why-opposition-smells-a-ploy-2774483-2025-08-21",
      "headline": "As Modi govt tables bills to prevent 'rule from jail', why Opposition smells a ployThe Modi government calls the three bills introduced by home minister Amit Shah as anti-corruption reform while critics allege executive overreach and political misuse"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/why-sponsors-bcci-fail-bankrupt-dream11-byju-2775237-2025-08-22",
      "headline": "The sponsorship jinx: Why brands on Team India's jersey turn to dust?Indian cricket team jersey sponsor Dream11 faced a major setback due to the Online Gaming Bill being passed in parliament. Interestingly, this makes 5th straight BCCI sponsor who has got into one or the other problem."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-rjd-plotting-to-hand-rights-to-illegals-pm-modi-demography-mission-push-2775210-2025-08-22",
      "headline": "Congress, RJD plotting to hand rights to illegals: PM's demography mission pushIn poll-bound Bihar, PM Modi accused the Congress and RJD of plotting to \"snatch away people's rights and give them to illegal immigrants\" to expand their vote banks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/days-after-assault-on-delhi-chief-minister-rekha-gupta-man-storms-her-event-shouts-slogans-detained-2775220-2025-08-22",
      "headline": "Days after assault, man storms Rekha Gupta's event, shouts slogans; detainedDays after an earlier assault, a man, Praveen Sharma, disrupted Delhi Chief Minister Rekha Gupta's event with slogans against MLA Arvinder Singh Lovely and was promptly detained. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-reveals-reason-behind-sudden-retirement-2775197-2025-08-22",
      "headline": "R Ashwin reveals reason behind retirement: Sitting out of the team got to meRavichandran Ashwin has finally broken the silence on his sudden international retirement from all forms of cricket in December 2024. The legendary spinner has cited non-selection on away tours and family commitments as reasons behind his decision not to play further cricket for India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/in-a-sholay-remake-who-will-be-thakur-gabbar-sherlock-holmes-irrfan-yash-pankaj-tripathi-hrithik-roshan-2774878-2025-08-22",
      "headline": "In a Sholay remake, who'd be Thakur and Gabbar: Sherlock Holmes finds outAt 221B, the hunt for Thakur and Gabbar begins, and the casting debate turns deadly serious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/suicide-prevention-helplines-in-india-crisis-lifelines-or-missed-calls-2774818-2025-08-22",
      "headline": "Suicide helplines in India: Lifelines or missed calls?Each unanswered helpline call is not just silence, it is a life teetering on the edge, left alone in its darkest hour. India's rising suicide numbers demand more than token helplines; they demand a system that listens, cares, and responds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/cdsco-health-alert-novo-nordisk-insulin-wegovy-theft-india-2775217-2025-08-22",
      "headline": "Novo Nordisk insulin and weight loss injections stolen in transit, alert issuedThe regulator in its health alert letter mentioned that these stolen drugs are rDNA injectables that require strict temperature control. Any mishandling or improper storage could affect product quality and endanger patient safety."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/ttd-chairman-br-naidu-legal-notice-sakshi-tv-newspaper-defamation-rs-10-crore-jagan-reddy-ysrcp-2775174-2025-08-22",
      "headline": "Tirumala temple board head sues Jagan Reddy's Sakshi TV for defamationTTD Board chairman and TV5 head, BR Naidu, alleges YSRCP chief Jagan Mohan Reddy-owned Sakshi TV and newspaper defamed him, demands Rs 10 crore in damages, warns of legal action and Ministry of Information intervention."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/r-madhavan-sarita-sirji-celebrate-son-vedaant-birthday-dia-mirza-ronit-roy-raj-kundra-share-wishes-2775261-2025-08-22",
      "headline": "R Madhavan, wife celebrate son's 20th birthday, Rehna Hai co-star Dia sends wishesOn the occasion of their son Vedaant's birthday, actor R Madhavan's wife shared a series of throwback photos on social media. Several actors, including Dia Mirza and Ronit Roy, extended their wishes in the comment section of the post."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/nausheen-ali-sardar-sima-taparia-reject-matchmaking-religion-controversy-2775235-2025-08-22",
      "headline": "Sima Taparia rejects Nausheen Ali Sardar's matchmaking request over religionNausheen Ali Sardar revealed that matchmaker Sima Taparia refused to help her find a life partner due to her religion. The actor criticised Taparia's conservative views and questioned who defines the right match for her."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jr-ntr-reassess-future-choices-a-mixed-reviews-for-war-2-dragon-prashanth-neel-2775246-2025-08-22",
      "headline": "Jr NTR to reassess future choices after War 2's poor theatrical run | ExclusiveJr NTR is now rethinking his Bollywood journey following the underperformance of 'War 2'. The actor is now concentrating on Telugu cinema and a major pan-India project with director Prashanth Neel to strengthen his mass appeal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/shwetha-menon-leads-1st-film-body-meeting-as-president-prioritises-member-safety-2775215-2025-08-22",
      "headline": "Shwetha Menon leads 1st film body meeting as president, prioritises member safetyThe Association of Malayalam Movie Artistes (AMMA) held its first committee meeting post-elections in Kochi. President Shwetha Menon emphasised member safety and announced new committees. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/why-sponsors-bcci-fail-bankrupt-dream11-byju-2775237-2025-08-22",
      "headline": "The sponsorship jinx: Why brands on Team India's jersey turn to dust?Indian cricket team jersey sponsor Dream11 faced a major setback due to the Online Gaming Bill being passed in parliament. Interestingly, this makes 5th straight BCCI sponsor who has got into one or the other problem."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/e-sports/story/esports-world-cup-team-falcons-claim-consecutive-club-titles-2775229-2025-08-22",
      "headline": "Esports World Cup: Team Falcons claim successive club titles in RiyadhTeam Falcons have clinched their second straight Esports World Cup Club Championship in Riyadh, solidifying their dominance across 18 titles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-womens-world-cup-bengaluru-m-cinnaswamy-stadium-venue-change-2775219-2025-08-22",
      "headline": "Women's World Cup matches moved out of Bengaluru after stadium stampede fiascoICC Women's World Cup 2025: Five matches originally scheduled at M. Chinnaswamy Stadium in Bengaluru have been moved to DY Patil Stadium in Navi Mumbai. The ICC announced the venue change on Friday, August 22, after the Karnataka state cricket body failed to secure the necessary approvals following the stampede incident during RCB's victory celebrations in June."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-reveals-reason-behind-sudden-retirement-2775197-2025-08-22",
      "headline": "R Ashwin reveals reason behind retirement: Sitting out of the team got to meRavichandran Ashwin has finally broken the silence on his sudden international retirement from all forms of cricket in December 2024. The legendary spinner has cited non-selection on away tours and family commitments as reasons behind his decision not to play further cricket for India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-sledging-virat-kohli-2014-backfired-joe-burns-2775176-2025-08-22",
      "headline": "Virat, you got to play some shots: Former Australia batter recalls sledging KohliFormer Australia batter Joe Burns revealed how sledging Virat Kohli in 2014 backfired for his team during the Melbourne Test of the Border-Gavaskar Trophy 2014-15."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-spinner-gouher-sultana-retires-from-all-forms-of-cricket-2775098-2025-08-22",
      "headline": "India left-arm spinner Gouher Sultana retires from all forms of cricketIndia left-arm spinner Gouher Sultana has announced her retirement from all forms of cricket. She represented India in 50 ODIs and 37 T20Is."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/government-asia-cup-india-vs-pakistan-cricket-2775100-2025-08-22",
      "headline": "Explained: Why government has given green signal to India vs Pakistan at Asia CupThe Indian government, in its latest diktat, has allowed sporting teams to play against Pakistan in multinational events. Why did the government make this move despite its dwindling relationship with its neighbour?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-replaces-selectors-pragyan-ojha-agarkar-tenure-extended-2026-2775085-2025-08-22",
      "headline": "Right after Asia Cup squad announcement, BCCI replaces 2 national selectorsBCCI is set to replace two senior national selectors from the men's committee just days after the announcement of India's Asia Cup squad. However, Ajit Agarkar is likely to remain as the chief selector till 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-asia-cup-pahalgam-attack-sindoor-2775017-2025-08-22",
      "headline": "India vs Pakistan sporting ties: 5 big questions after new government policyThe India-Pakistan match at the Asia Cup is likely to go ahead following the government's new policy on hosting and competing in sports involving Pakistan. But it raises serious questions: should international sporting credibility come before national interest and security?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rahul-dravid-recalls-r-ashwins-youtube-video-on-batting-against-spin-2775068-2025-08-22",
      "headline": "Dravid recalls Ashwin's video on batting against spin, jokes about backlashFormer India cricketer and head coach Rahul Dravid recalled Ravichandran Ashwin's YouTube video on playing spin in India from 2023 during the middle of the Border-Gavaskar Trophy against Australia. Ashwin had received backlash for his video after Australia won the third Test in Indore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/government-asia-cup-india-vs-pakistan-cricket-2775100-2025-08-22",
      "headline": "Explained: Why government has given green signal to India vs Pakistan at Asia CupThe Indian government, in its latest diktat, has allowed sporting teams to play against Pakistan in multinational events. Why did the government make this move despite its dwindling relationship with its neighbour?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-replaces-selectors-pragyan-ojha-agarkar-tenure-extended-2026-2775085-2025-08-22",
      "headline": "Right after Asia Cup squad announcement, BCCI replaces 2 national selectorsBCCI is set to replace two senior national selectors from the men's committee just days after the announcement of India's Asia Cup squad. However, Ajit Agarkar is likely to remain as the chief selector till 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-asia-cup-pahalgam-attack-sindoor-2775017-2025-08-22",
      "headline": "India vs Pakistan sporting ties: 5 big questions after new government policyThe India-Pakistan match at the Asia Cup is likely to go ahead following the government's new policy on hosting and competing in sports involving Pakistan. But it raises serious questions: should international sporting credibility come before national interest and security?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rahul-dravid-recalls-r-ashwins-youtube-video-on-batting-against-spin-2775068-2025-08-22",
      "headline": "Dravid recalls Ashwin's video on batting against spin, jokes about backlashFormer India cricketer and head coach Rahul Dravid recalled Ravichandran Ashwin's YouTube video on playing spin in India from 2023 during the middle of the Border-Gavaskar Trophy against Australia. Ashwin had received backlash for his video after Australia won the third Test in Indore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhishek-sharma-asia-cup-2025-2775062-2025-08-22",
      "headline": "Asia Cup 2025: Abhishek Sharma gears up for his biggest test yetAbhishek Sharma earned a spot in India's Asia Cup 2025 squad after a string of explosive T20I performances. Now, the young opener faces his toughest challenge yet — proving himself on the big stage."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/rinku-singh-up-t20-league-hundred-asia-cup-2775028-2025-08-22",
      "headline": "Rinku Singh finds form before Asia Cup, hits rapid hundred in UP T20 LeagueRinku Singh played a stunning unbeaten century to help Meerut Mavericks chase 168 runs in the UP T20 League. His heroic innings comes amid pressure over his Asia Cup selection and recent poor form."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-asia-cup-kerala-cricket-league-batting-position-2775013-2025-08-22",
      "headline": "Samson preparing for new Asia Cup role? Keeper slots at No.5 in local leagueSanju Samson moved down to the No. 5 position in the batting order in Kerala Cricket League. Is he preparing for a new role for the Asia Cup?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-asia-cup-squad-selection-ravi-bishnoi-2775007-2025-08-22",
      "headline": "Ravi Bishnoi: From India's trump card to T20I outsider. What went wrong?Ravi Bishnoi could not find a place in India's Asia Cup squad. An underwhelming IPL 2025, combined with Varun Chakravarthy's rapid rise has forced the former World No.1 T20I bowler to the sidelines of the Indian squad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/wwe-big-boss-undertaker-salman-khan-2775001-2025-08-22",
      "headline": "WWE's Undertaker set to join Salman Khan's Big Boss: ReportsWWE legend The Undertaker may join Salman Khan on Bigg Boss 19, if reports are to be believed. If the move goes through, it would create a groundbreaking crossover between wrestling and Bollywood."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/us-open/story/us-open-2025-mens-singles-womens-singles-draw-carlos-alcaraz-jannik-sinner-sabalenka-2774949-2025-08-21",
      "headline": "US Open 2025: Alcaraz handed tough draw despite avoiding Sinner's halfCarlos Alcaraz faces a challenging US Open 2025 path, with a potential semi-final clash against Novak Djokovic looming. The Spaniard must navigate a tough quarter packed with stars like Daniil Medvedev, Ben Shelton, and Casper Ruud to progress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pm-modi-online-gaming-bill-esports-real-money-games-2774932-2025-08-21",
      "headline": "Gaming Bill will save society from harmful effects of online money games: PM ModiPrime Minister Narendra Modi welcomed the new Online Gaming Bill, aimed at boosting esports and curbing online money games. The law introduces strict penalties to prevent addiction, fraud, and money laundering linked to such games."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rahul-dravid-rohit-sharma-captaincy-r-ashwin-youtube-kutty-stories-2774915-2025-08-21",
      "headline": "Rahul Dravid a fan of Rohit Sharma's captaincy: He deeply cared for the teamRahul Dravid praised Rohit Sharma's leadership, saying the India ODI captain had the ability to connect emotionally with players. Their partnership helped India win the 2024 T20 World Cup after an 11-year wait for an ICC trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/wwe-big-boss-undertaker-salman-khan-2775001-2025-08-22",
      "headline": "WWE's Undertaker set to join Salman Khan's Big Boss: ReportsWWE legend The Undertaker may join Salman Khan on Bigg Boss 19, if reports are to be believed. If the move goes through, it would create a groundbreaking crossover between wrestling and Bollywood."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/us-open/story/us-open-2025-mens-singles-womens-singles-draw-carlos-alcaraz-jannik-sinner-sabalenka-2774949-2025-08-21",
      "headline": "US Open 2025: Alcaraz handed tough draw despite avoiding Sinner's halfCarlos Alcaraz faces a challenging US Open 2025 path, with a potential semi-final clash against Novak Djokovic looming. The Spaniard must navigate a tough quarter packed with stars like Daniil Medvedev, Ben Shelton, and Casper Ruud to progress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pm-modi-online-gaming-bill-esports-real-money-games-2774932-2025-08-21",
      "headline": "Gaming Bill will save society from harmful effects of online money games: PM ModiPrime Minister Narendra Modi welcomed the new Online Gaming Bill, aimed at boosting esports and curbing online money games. The law introduces strict penalties to prevent addiction, fraud, and money laundering linked to such games."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rahul-dravid-rohit-sharma-captaincy-r-ashwin-youtube-kutty-stories-2774915-2025-08-21",
      "headline": "Rahul Dravid a fan of Rohit Sharma's captaincy: He deeply cared for the teamRahul Dravid praised Rohit Sharma's leadership, saying the India ODI captain had the ability to connect emotionally with players. Their partnership helped India win the 2024 T20 World Cup after an 11-year wait for an ICC trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aisa-cup-shreyas-iyer-snub-seletors-bcci-clear-communication-ajinkya-rahane-2774912-2025-08-21",
      "headline": "Shreyas Iyer should get clear communication: Rahane after Asia Cup snubAjinkya Rahane feels Shreyas Iyer must be deeply disappointed by his Asia Cup snub. He urged selectors to maintain transparent communication with Iyer, ensuring the batter stays motivated and remains a strong contender for future national team selections."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/bengal-footballers-denied-national-team-chances-aroop-biswas-aiff-2774903-2025-08-21",
      "headline": "Bengal footballers denied national team chances: Sports Minister's jibe at AIFFWest Bengal Sports Minister Aroop Biswas has accused national sports bodies of systemic bias, claiming Bengali athletes are overlooked despite merit. His remarks spark fresh debate over regional discrimination and transparency in Indian sports selections.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/boxing-federation-of-india-ajay-singh-president-elected-third-term-2774900-2025-08-21",
      "headline": "Ajay Singh re-elected as Boxing Federation president for third consecutive termAjay Singh secured a third straight term as Boxing Federation of India President, defeating Jaslal Pradhan 40-26 in delayed elections marred by legal disputes, with new office-bearers elected amid pending Delhi High Court proceedings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-sanju-samson-will-sit-out-shubman-gill-abhishek-sharma-open-ajinkya-rahane-2774897-2025-08-21",
      "headline": "Samson will sit out, Shubman Gill and Abhishek to open in Asia Cup: RahaneAjinkya Rahane believes Shubman Gill's return and vice-captaincy will likely push Sanju Samson out of India's Asia Cup Playing XI. He backed Gill and Abhishek Sharma as openers despite praising Samson's consistency and team-first attitude."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-elections-national-sports-governance-act-2025-new-committees-2774866-2025-08-21",
      "headline": "Government keen on having BCCI election as per National Sports Governance ActThe Government is keen on conducting the Indian cricket board elections under the newly passed National Sports Governance Act 2025. BCCI has been functioning under the recommendations of the Lodha Committee."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-nick-kyrgios-withdraws-mens-singles-injury-grand-slam-miss-2774865-2025-08-21",
      "headline": "Nick Kyrgios withdraws from US Open as his injury tale continuesNick Kyrgios' injury woes have struck again, ruling him out of the US Open for a third straight year. The Aussie star's stop-start career continues as fans wait for his long-promised comeback to finally materialise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/e-sports/story/online-gaming-bill-benefit-e-sports-mainstream-2774837-2025-08-21",
      "headline": "New Online Gaming Bill lifts Esports to mainstream sporting statusThe new Online Gaming Bill brings relief to millions of gamers and aspiring esports athletes in the country. There is now a clear differentiation between esports and Real Money Gaming and ambitious plans to promote and expand esports nationwide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cheteshwar-pujara-ranji-trophy-saurashtra-2774832-2025-08-21",
      "headline": "Cheteshwar Pujara available to play Ranji Trophy 2025-26 for Saurashtra: ReportSenior batter Cheteshwar Pujara has signalled his intent to play the upcoming Ranji Trophy season for Saurashtra. Pujara last featured in competitive cricket in February."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-england-squad-announcement-heather-knight-return-2774788-2025-08-21",
      "headline": "Heather Knight back as England name spin-heavy squad for 2025 Women's World CupEngland have named a spin-heavy squad for the 2025 Women's World Cup with Heather Knight returning from injury, Nat Sciver-Brunt leading for the first time, and Sarah Glenn and Danni Wyatt-Hodge also making comebacks for the subcontinental challenge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/durand-cup-diamond-harbour-fc-who-are-they-east-bengal-defeated-2774738-2025-08-21",
      "headline": "Who are Diamond Harbour FC? 3-year-old club aiming for Durand Cup gloryIn just three years, Diamond Harbour FC have surged from district football to the Durand Cup final, stunning East Bengal on debut and standing one win away from completing Indian football's most remarkable underdog story in recent times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/online-gaming-bill-2025-esports-ban-real-money-games-india-cricket-sponsorship-2774735-2025-08-21",
      "headline": "Online gaming bill: What does it mean for sports and sports enthusiasts?India's Online Gaming Bill 2025 boosts esports but bans real money games, gambling and betting. Here's all you need to know about the new bill that was passed in the Cabinet on Tuesday, August 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-pakistan-bilateral-ties-asia-cup-participation-sports-ministry-2774733-2025-08-21",
      "headline": "No bilaterals with Pak, says government; green light for Asia CupThe government on Thursday, August 21, said India will not engage in bilateral sporting ties with Pakistan. However, a Sports Ministry source confirmed that Indian men's cricket team will not be stopped from playing against Pakistan in the Asia Cup, starting September 9. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}