{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/advance-tax-alert-first-instalment-due-by-june-15-find-out-if-you-are-liable-2740396-2025-06-13",
      "headline": "Advance tax alert: First instalment due by June 15, find out if you are liableAdvance tax simply means paying your income tax in parts throughout the year, instead of waiting till the end. If your total tax due for the year is more than Rs 10,000, then you must pay it in advance in four instalments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/iran-israel-tensions-rise-why-india-should-worry-strait-of-hormuz-plays-a-vital-role-in-global-energy-supply-2740371-2025-06-13",
      "headline": "Iran-Israel tensions rise. Why India should worryThe escalating Iran-Israel conflict poses significant challenges for India, particularly concerning oil imports and economic stability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-settles-573-points-lower-nifty-below-24800-adani-ports-falls-3-percent-iran-israel-war-2740342-2025-06-13",
      "headline": "Sensex settles 573 points lower, Nifty below 24,800; Adani Ports falls 3%The S&P BSE Sensex was down by 573.38 points to end at 81,118.60, while the NSE Nifty50 lost 169.60 points to close at 24,718.60. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/gold-prices-surge-india-israel-iran-conflict-geopolitical-tensions-2740330-2025-06-13",
      "headline": "Gold prices rise sharply amid Israel-Iran tensions in IndiaThe rise in gold prices is being linked to worries over a possible wider conflict in the Middle East, which has made investors turn to gold as a safe place to park money. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/oswal-pumps-ipo-subscription-june-13-to-17-rs-1387-crore-issue-strong-brokerage-ratings-2740309-2025-06-13",
      "headline": "Oswal Pumps opens Rs 1,387 crore IPO with strong brokerage backingOswal Pumps targets Rs 1,387.34 crore from IPO. Experts recommend subscribing due to strong fundamentals. IPO open until June 17, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/air-india-crash-rattles-hotel-and-ticketing-stocks-as-investor-confidence-wavers-impact-on-indian-stock-market-2740247-2025-06-13",
      "headline": "Air India crash rattles hotel and ticketing stocks, as investor confidence waversOnline travel companies were among the most affected. Shares of Thomas Cook India fell by 2.39%, trading at Rs 160.03 as of June 13, 1PM. TBO Tek dropped 1.10% to Rs 1,287.40, while Mahindra Holidays slipped 1.47% to Rs 342.35."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/air-india-crash-in-ahmedabad-how-airline-insurance-works-and-why-premiums-may-rise-2740170-2025-06-13",
      "headline": "Air India crash: How airline insurance works and why premiums may riseIncidents like the recent Air India crash can result in a total loss, meaning the aircraft is beyond repair with no salvageable parts. In such cases, the losses can reach around $130 million, roughly $80 million for the plane and $30-50 million in liabilities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/air-india-insurance-cover-new-india-assurance-tata-aig-global-reinsurers-2740162-2025-06-13",
      "headline": "Who are the likely insurers for Air India plane crash?The plane involved in the crash was a Boeing 787-8 Dreamliner, one of the most modern aircraft used in commercial aviation. It was carrying 242 people, including 12 crew members. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/boeing-comeback-on-trial-after-air-india-dreamliner-crash-kills-241-2740174-2025-06-13",
      "headline": "Boeing's revival on trial after deadly Air India Dreamliner crash in AhmedabadThe fatal crash of Air India flight AI-171, a Boeing 787-8 Dreamliner, minutes after takeoff from Ahmedabad, has killed 241 people on board, reigniting serious doubts over Boeing's aircraft safety and corporate oversight."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/oil-stocks-fall-israel-iran-war-brent-crude-oil-price-rise-bpcl-ongc-ioc-asian-paints-2740141-2025-06-13",
      "headline": "Oil shock hits Dalal Street: BPCL, ONGC, IOC, other crude-sensitive stocks fallBrent crude oil futures jumped more than 9% to touch around $75.61 per barrel, reaching a multi-month high. The gain came after Israel said it had launched what it called \"preemptive strikes\" against Iran."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/rbi-steps-in-to-contain-fallout-of-oil-price-jump-on-rupee-2740112-2025-06-13",
      "headline": "RBI steps in to contain fallout of oil price jump on rupee: ReportThe Indian rupee dropped to 86.20 against the US dollar in early trade but later recovered to 86.04, helped by the central bank's likely intervention."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/aviation-stocks-fall-market-crash-spicejet-indigo-adani-enterprises-tata-group-shares-air-india-plane-crash-2740108-2025-06-13",
      "headline": "Aviation stocks tumble after Air India plane crash in AhmedabadSpiceJet's share price dropped 3.42% at the start of the trading session. InterGlobe Aviation Ltd, the company that runs IndiGo, also fell 4.83%, slipping to Rs 5,212 in early trade."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/atlee-on-plagiarism-amid-aa22xa6-dune-poster-row-earned-this-only-through-honesty-2741151-2025-06-15",
      "headline": "Atlee on plagiarism amid AA22xA6-Dune poster row: Earned this only through honestyDirector Atlee recently addressed the allegations about his films being copied from other works. The filmmaker also shared his vision for Allu Arjun and Deepika Padukone's 'AA22xA6'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rishab-shetty-and-crew-unhurt-after-boat-capsizes-during-kantara-chapter-1-shoot-2741120-2025-06-15",
      "headline": "Rishab Shetty and crew unhurt after boat capsizes during Kantara Chapter 1 shootA boat capsized during the shooting of actor-director Rishab Shetty's 'Kantara: Chapter 1' at Shivamogga's Mani reservoir. Shetty and the crew members escaped unharmed from the incident."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kushal-tandon-confirms-breakup-shivangi-joshi-now-deleted-post-2741070-2025-06-15",
      "headline": "Actor Kushal Tandon confirms breakup with Shivangi Joshi in now-deleted postActor Kushal Tandon confirmed his breakup with 'Barsaatein' co-star Shivangi Joshi in a now-deleted post. Tandon shared that the two had parted ways five months back.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anushka-sharma-fathers-day-post-letter-from-vamika-for-virat-kohli-2741061-2025-06-15",
      "headline": "Anushka Sharma's Father's Day post is a letter from Vamika to Virat KohliActor Anushka Sharma shared a special handwritten note by her daughter, Vamika, for Virat Kohli. The special letter has left fans in awe. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/unni-mukundan-confirms-marco-2-dropped-explains-reasons-negativity-2741048-2025-06-15",
      "headline": "Actor Unni Mukundan's Marco 2 dropped, actor says too much negativity'Marco' actor Unni Mukundan has dropped all plans to continue the film series. Citing 'negativity' around the project, the actor mentioned that he will not be a part of the sequel. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sardaar-ji-3-teaser-diljit-dosanjh-returns-ghost-hunter-in-hilarious-avatar-2740997-2025-06-15",
      "headline": "Sardaar Ji 3 teaser: Diljit Dosanjh returns as ghost hunter in hilarious avatarThe teaser of 'Sardaar Ji 3' starring Diljit Dosanjh and Neeru Bajwa is out. The film will release in theatres on June 27. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/pakeezah-a-poignant-reminder-of-meena-kumari-india-poetic-past-ashok-kumar-raaj-kumar-2740977-2025-06-15",
      "headline": "Pakeezah: A poignant reminder of Meena Kumari and India's poetic pastPakeezah (1972) is a nostalgic journey into a bygone India of thumris, shayari, and Nawabi grace. The film stars Meena Kumari as the eponymous lead, alongside Ashok Kumar and Raaj Kumar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/ankit-gupta-addresses-dating-rumours-priyanka-chahar-chaudhary-threatens-legal-action-2740968-2025-06-15",
      "headline": "Actor Ankit Gupta addresses dating rumours, threatens legal actionActor Ankit Gupta recently addressed his link-up rumours amid breakup with Priyanka Chahar Choudhary. Gupta even vowed to take legal action against those spreading defamatory content. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/housefull-5-box-office-akshay-kumar-comedy-holds-strong-in-theatres-2740960-2025-06-15",
      "headline": "Housefull 5 Box Office Day 9: Akshay Kumar's comedy holds strong in theatresAkshay Kumar's 'Housefull 5', which hit theatres on June 6, continues to perform well at the box office in its second week. The film has raked in an estimated Rs 142.25 crore in India so far. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/atlee-honorary-doctorate-from-sathyabama-university-gives-emotional-speech-allu-arjun-2740956-2025-06-15",
      "headline": "Atlee gets honorary doctorate from Sathyabama University, gives emotional speechDirector Atlee recently received an honorary doctorate from Sathyabama Institute of Science and Technology. He was recognised for his valuable contributions to Indian cinema. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kannappa-trailer-vishnu-manchu-akshay-kumar-prabhas-moahanlal-powerful-tale-of-devotion-kajal-aggarwal-2740945-2025-06-15",
      "headline": "'Kannappa' trailer: Vishnu Manchu, Akshay Kumar bring powerful tale of devotionThe trailer of 'Kannappa' starring Vishnu Manchu, Akshay Kumar, Prabhas, and Mohanlal is out. The film is slated to hit the big screen on June 27. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/anirudh-ravichander-quashes-wedding-reports-with-kavya-maran-stop-spreading-rumours-2740824-2025-06-14",
      "headline": "Anirudh Ravichander quashes wedding reports: Stop spreading rumoursComposer Anirudh Ravichander has finally addressed the speculations about his alleged wedding with Sunrisers Hyderabad (SRH) owner Kavya Maran. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dharmendra-suggested-big-b-for-sholay-convinced-ramesh-sippy-he-would-be-perfect-2740767-2025-06-14",
      "headline": "Dharmendra suggested Big B for Sholay, convinced Ramesh Sippy he'd be perfectVeteran actor Dharmendra opened up about recommending Amitabh Bachchan for the role of Jai in 'Sholay'. He reflected on Big B's impressive quality as a young actor in the 70s. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/diljit-dosanjh-imtiaz-ali-reunite-untitled-film-sharvari-vedang-raina-naseeruddin-shah-2740794-2025-06-14",
      "headline": "Diljit Dosanjh, Imtiaz Ali reunite for untitled film with Sharvari and Vedang RainaFilmmaker Imtiaz Ali is set to reunite with Diljit Dosanjh for their upcoming film. Set to begin filming in August 2025, this untitled film will hit theatres on Baisakhi 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-surprises-young-fans-at-florida-hospital-with-gifts-see-pics-2740776-2025-06-14",
      "headline": "Taylor Swift surprises young fans at Florida hospital with gifts. See picsTaylor Swift paid a surprise visit to a children's hospital in the US shortly after attending boyfriend Travis Kelce's Stanley Cup finals game.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/dakota-johnson-slams-hollywood-remakes-mess-materialist-2740734-2025-06-14",
      "headline": "Dakota Johnson slams Hollywood remakes, says its all a messActor Dakota Johnson recently criticised Hollywood's obsession with remakes. She reflected on the risk-averse nature of the entertainment industry, while highlighting the challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/video/jackson-wang-on-magic-man-2-love-and-trust-bond-with-rm-diljit-dosanjh-mm-india-tour-exclusive-2740753-2025-06-14",
      "headline": "Jackson Wang on Magic Man 2, Love and Trust, bond with RM, Diljit Dosanjh, MM India Tour | ExclusiveIn an exclusive interview with India Today's Bhavna Agarwal, global star Jackson Wang opens up about his upcoming album Magic Man 2, second visit to India, his collaboration with Diljit Dosanjh, the emotional and creative process behind it, and what turning 31 has meant for him. Jackson speaks candidly about navigating life without a label, how he still approaches trust with caution, and what vulnerability with fans truly looks like for him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/squid-game-3-trailer-lee-jung-jae-faces-his-toughest-opponents-in-epic-finale-2740693-2025-06-14",
      "headline": "Squid Game 3 trailer: Lee Jung-jae faces his toughest opponents in epic finaleThe new trailer for 'Squid Game Season 3' was released on June 14. The show featuring actor Lee Jung-jae is all set for its finale and will premiere on June 27 on Netflix. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/justin-bieber-heated-clash-with-paparazzi-viral-video-2740715-2025-06-14",
      "headline": "Who's paying you to provoke me? Justin Bieber in heated clash with paparazziSinger Justin Bieber got into a heated clash with the paparazzi outside the Soho House in Malibu. Bieber was protecting himself from the flashing cameras before delivering a firm and expletive-filled message to the photographers."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-vetoed-israels-plan-to-assassinate-irans-supreme-leader-ayatollah-ali-khamenei-reports-reuters-2741159-2025-06-15",
      "headline": "Trump vetoed Israel's plan to assassinate Iran's Supreme Leader: ReportAccording to the top officials, Israel informed the US of an opportunity to assassinate Iran's Supreme Leader but Trump vetoed the plan."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/irans-revolutionary-guards-intel-chief-killed-in-israeli-strike-netanyahu-glbs-2741215-2025-06-16",
      "headline": "Iran's revolutionary guards intel chief killed in Israeli strike: NetanyahuBrigadier General Mohammad Kazemi and his deputy Hassan Mohaqiq, top intelligence leaders of Iran's Revolutionary Guard, were killed in an Israeli airstrike in Tehran, confirmed by Prime Minister Netanyahu. This is part of Israel's intensified strikes to dismantle Iran's nuclear and missile programs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-in-cyprus-india-eu-committed-free-trade-agreement-by-year-end-2741219-2025-06-16",
      "headline": "India, EU committed to free trade agreement by year-end: PM Modi in CyprusPM Narendra Modi kicked off his Cyprus visit with a strong pitch for economic ties, highlighting India's digital rise. He said that India and the European Union are committed to a free trade agreement by the end of this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/amit-shah-meeting-over-census-in-india-caste-census-in-india-2741160-2025-06-15",
      "headline": "2027 Census official notification today, Amit Shah reviews preparationAccording to the Ministry of Home Affairs, the official gazette notification for conducting the Census will be published on June 16. This Census will mark the 16th national Census since its inception and the eighth since India's independence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/virat-kohli-ab-de-villiers-anushka-pregnancy-2741141-2025-06-15",
      "headline": "Why Virat Kohli did not speak to AB de Villiers for months? Legend revealsAB de Villiers revealed Virat Kohli stopped speaking to him after he leaked the news about Anushka being pregnant with the latter's second child."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-iran-conflict-latest-updates-several-killed-injured-in-israel-tehran-under-attack-operation-rising-lion-netanyahu-khomeini-2740933-2025-06-15",
      "headline": "Live: Israel destroys Iranian weapon production sitesIsrael continued its military strikes on Iran for a third straight day, targeting Tehran and other regions, killing 224 people, including Islamic Revolutionary Guard Corps (IRGC) intelligence chief Mohammed Kazemi and two generals. Israel's airspace and airports were shut down. Army chief Eyal Zamir vowed to intensify the attacks against what he called an \"existential threat\"."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/key-accused-punjab-influencer-kanchan-kumari-murder-case-fled-uae-hours-after-crime-2741224-2025-06-16",
      "headline": "Key accused in Punjab influencer murder case fled to UAE hours after crimeAmritpal Singh Mehron, the key accused in the murder of Punjab influencer Kanchan Kumari, fled to the UAE hours after the crime, police said. Two others were arrested, and a lookout circular was issued. Police now seek Mehron's deportation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/icc-test-rankings-wtc-final-australia-vs-south-africa-2741150-2025-06-15",
      "headline": "AUS remain at the top of ICC Test rankings despite WTC loss to SADespite losing the World Test Championship final to South Africa, Australia maintained their lead in the latest update of the ICC Test team rankings with the Proteas jumping up to second in the charts. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bathtub-swimming-pool-spacious-rooms-demolition-drive-gujarat-jamnagar-police-2741075-2025-06-15",
      "headline": "Bathtub, swimming pool found inside demolished illegal religious site in GujaratPolice in Gujarat's Jamnagar found a bathtub, a swimming room and spacious rooms during the demolition of an illegal religious site built in an area of about 11,000 square feet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/israel-iran-conflict-india-balances-ties-with-both-nations-carefully-2741214-2025-06-16",
      "headline": "Amid Israel-Iran conflict, India balances ties with both nations carefullyIndia balances strategic ties with both Israel and Iran amid rising tensions, focusing on diplomacy, defence interests, and regional stability while avoiding alignment with either side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/dont-watch-such-nonsense-sonam-told-woman-viewing-raja-raghuvanshi-case-reels-2741079-2025-06-15",
      "headline": "Don't watch such nonsense: Sonam told woman viewing Raja Raghuvanshi case reelsIn an interview with India Today TV, Ujala Yadav shared details of her brief encounter with Sonam Raghuvanshi on the night of June 8, just hours before her arrest in the Raja Raghuvanshi murder case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-says-peace-between-israel-and-iran-soon-even-as-tehran-fires-ballistic-missiles-at-tel-aviv-2741118-2025-06-15",
      "headline": "Just like I got India and Pak...: Trump says Israel, Iran will make dealRepeating his claim that he brokered the India-Pakistan ceasefire following their conflict, US President Donald Trump claimed there would be peace between Israel and Iran \"soon\" amid escalating hostilities between both Middle East nations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/pune/story/15-20-feared-swept-away-after-old-bridge-collapses-in-punes-talegaon-recuse-operation-underway-2741068-2025-06-15",
      "headline": "4 dead, 51 injured as old Pune bridge collapses amid rush to watch swelling riverPune bridge collapse: Four people were killed and 51 others were injured when a dilapidated bridge collapsed and fell into the Indrayani river amid heavy rain. Rescue operations were conducted by NDRF along with local administration and several were rescued from the river. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gary-kirsten-pakistan-coach-pcb-mike-hesson-2741028-2025-06-15",
      "headline": "Kirsten on quitting as PAK coach: Realised wasn't going to have much influenceGary Kirsten explained the reason behind his decision to quit as the Pakistan white-ball team coach. Kirsten also said he is ready to make a return only if there are no external influential noises. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/air-india-crash-victim-cousin-slams-influencers-for-exploiting-tragedy-2741134-2025-06-15",
      "headline": "Please stop: Plane crash victim's cousin slams influencers for exploiting tragedyKuldeep Bhatt, the cousin of Komi Vyas, who perished in the Air India crash along with her husband and their three children, spoke out against the \"mental trauma\" being inflicted upon his family and the families of the 270 other victims by irresponsible online content."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/donald-trump-warns-iran-full-strength-us-military-israel-2740978-2025-06-15",
      "headline": "If attacked, full strength of US forces will come down on you, Trump warns IranStating that the US had no role in Israel's overnight attacks on Iran, Trump claimed on his Truth Social platform that he could 'easily get a deal done between Iran and Israel and end this conflict,' even as Tehran cancelled the sixth round of nuclear talks with Washington DC, on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/uk-news/story/meet-blaise-metreweli-uks-first-woman-to-lead-mi6-spy-agency-glbs-2741218-2025-06-16",
      "headline": "Meet Blaise Metreweli, UK's first woman to lead MI6 spy agencyBlaise Metreweli has been appointed as the first woman to lead the UK's foreign intelligence service, MI6. A career with over two decades of experience, she will replace Richard Moore. Metreweli, currently heading MI6's technology division, says she is \"proud and honoured\" to take on the historic role."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/israeli-trekker-missing-10-days-himachal-pradesh-found-alive-with-fractured-leg-2741208-2025-06-15",
      "headline": "Israeli trekker, missing for 10 days in Himachal, found alive with fractured legAn Israeli trekker, identified as Samuel Vengrinovich, missing for 10 days in Himachal's Triund area, has been found alive in the forest with a fractured leg after surviving on grass and forest fruits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-eyes-travel-ban-expansion-targets-36-nations-including-bhutan-drc-egypt-glbs-2741211-2025-06-16",
      "headline": "US eyes travel ban expansion, targets 36 nations including Bhutan, DRC, EgyptThe Trump administration is considering adding 36 more countries to its travel ban list. An internal State Department memo gives these nations 60 days to meet security standards or face restrictions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/224-killed-since-israel-attacks-began-over-90-civilians-irans-health-ministry-glbs-2741217-2025-06-16",
      "headline": "224 killed since Israel attacks began, over 90% civilians: Iran's health ministryIran's health ministry says 224 people have been killed and 1,277 injured since Israeli strikes began Friday, with over 90% of the casualties being civilians. As airstrikes continue and missiles are exchanged, both nations warn civilians to avoid danger zones."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/uttarakhand-helicopter-crash-kedarnath-reasons-previous-incidents-kedarnath-2741052-2025-06-15",
      "headline": "Uttarakhand sees another chopper crash in 6 weeks. Why does it keep happeningSunday's helicopter crash in Uttarakhand's Gaurikund forest was the fifth such incident in the past six weeks in the state. Here's a list of previous such accidents in the hill state."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/gujarat-announces-1-day-state-mourning-tomorrow-for-ex-chief-minister-vijay-rupani-who-died-in-plane-crash-2741114-2025-06-15",
      "headline": "1-day state mourning in Gujarat today for Vijay Rupani who died in plane crashFormer Gujarat Chief Minister Vijay Rupani, who was killed in an Air India plane crash in Ahmedabad, will be cremated in Rajkot on Monday as the state government announced a one-day state mourning."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/manali-zipline-video-nagpur-girl-injured-belts-breaks-midway-gorge-hospitalised-2741043-2025-06-15",
      "headline": "Video: Nagpur girl critically injured as zipline belt breaks mid-air in ManaliDuring a ziplining activity in Manali, a 10-year-old girl from Nagpur fell nearly 30 feet into a gorge after the zipline cable she was strapped to suddenly snapped mid-air."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-us-continue-support-israel-against-iran-military-attacks-continue-3rd-day-glbs-2741220-2025-06-16",
      "headline": "Fight it out: Trump reaffirms US support for Israel but hopes for a deal with IranDonald Trump reaffirmed support for Israel amid conflict with Iran, saying he hopes for a ceasefire but added, \"sometimes they have to fight it out.\" Trump's comments came as the violence between Israel and Iran continues to escalate. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/gmr-rugby-premier-league-inaugural-season-kicks-off-thrilling-matches-ceremony-2741209-2025-06-15",
      "headline": "Rugby Premier League: Bengaluru-Delhi split points in opening dayThe inaugural season of the Rugby Premier League kicked off with exciting matches and a grand opening ceremony. The event brought together top players, celebrities, and dignitaries, signalling a new era for rugby in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/gennaro-gattuso-appointed-italy-head-coach-world-cup-qualification-2741206-2025-06-15",
      "headline": "Gennaro Gattuso replaces Luciano Spalletti as Italy national team coachGennaro Gattuso has been appointed head coach of the Italy national football team. His leadership comes at a crucial time as Italy aims to qualify for the 2026 FIFA World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/west-indies-vs-ireland-highest-t20i-team-totals-2741180-2025-06-15",
      "headline": "No Nicholas Pooran, no problem: West Indies slam 256 runs in T20I vs IrelandEvin Lewis and Shai Hope's brilliant partnership helped West Indies reach 256 against Ireland the 3rd T20I of their series. Windies would hope to move on from Nicholas Pooran, who recently called time on his international career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/icc-test-rankings-wtc-final-australia-vs-south-africa-2741150-2025-06-15",
      "headline": "AUS remain at the top of ICC Test rankings despite WTC loss to SADespite losing the World Test Championship final to South Africa, Australia maintained their lead in the latest update of the ICC Test team rankings with the Proteas jumping up to second in the charts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-fathers-day-note-hard-work-merit-cricket-2741154-2025-06-15",
      "headline": "Virat Kohli pens father's day note, reveals moment that changed his lifeVirat Kohli shared an emotional note remembering his late dad on Father's Day. He highlighted how his father's refusal of shortcuts shaped his approach to hard work and success."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-shubman-gill-captain-2741149-2025-06-15",
      "headline": "Shubman Gill's positivity is rubbing off on Indian team: Kuldeep YadavShubman Gill is set to captain India for the first time in Test cricket. Kuldeep Yadav revealed that his positivity is keeping the team upbeat ahead of the 5-match series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/shubman-gill-captain-kuldeep-yadav-press-conference-2741148-2025-06-15",
      "headline": "Rohit's apprentice prepared and ready for leadership role: Kuldeep YadavEngland vs India: Spinner Kuldeep Yadav has said that Shubman Gill is more than ready to take over the Indian team. Yadav has said that Shubman has been around Rohit Sharma and Virat Kohli for year and a half and has gained a lot of knowledge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/virat-kohli-ab-de-villiers-anushka-pregnancy-2741141-2025-06-15",
      "headline": "Why Virat Kohli did not speak to AB de Villiers for months? Legend revealsAB de Villiers revealed Virat Kohli stopped speaking to him after he leaked the news about Anushka being pregnant with the latter's second child."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wtc-final-johnson-starc-lyon-2741105-2025-06-15",
      "headline": "Johnson urges selectors to look beyond Starc, Lyon after WTC lossMitchell Johnson has urged the Australian selectors to explore their options beyond the star-studded bowling attack which has the likes of Pat Cummins, Mitchell Starc, Josh Hazlewood and Nathan Lyon. This comes after Australia were beaten by South Africa in the WTC final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/england-vs-india-test-series-vvs-laxman-gautam-gambhir-2741119-2025-06-15",
      "headline": "Laxman to lead India's preparations for 1st Test in Gambhir's absence: ReportVVS Laxman will reportedly be leading India's preparations for the England series in Gautam Gambhir's absence. The head coach is expected to rejoin the side ahead of the first Test in Headingley."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-australia-wtc-final-2741095-2025-06-15",
      "headline": "South Africa wins first World Test Championship title with Bavuma's heroic inningsSouth Africa cricket team sang an incredible tribute to their captain, Temba Bavuma, after the WTC Final win against Australia. The moment became viral on the internet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/shubman-gill-captain-kuldeep-yadav-press-conference-2741148-2025-06-15",
      "headline": "Rohit's apprentice prepared and ready for leadership role: Kuldeep YadavEngland vs India: Spinner Kuldeep Yadav has said that Shubman Gill is more than ready to take over the Indian team. Yadav has said that Shubman has been around Rohit Sharma and Virat Kohli for year and a half and has gained a lot of knowledge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/virat-kohli-ab-de-villiers-anushka-pregnancy-2741141-2025-06-15",
      "headline": "Why Virat Kohli did not speak to AB de Villiers for months? Legend revealsAB de Villiers revealed Virat Kohli stopped speaking to him after he leaked the news about Anushka being pregnant with the latter's second child."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wtc-final-johnson-starc-lyon-2741105-2025-06-15",
      "headline": "Johnson urges selectors to look beyond Starc, Lyon after WTC lossMitchell Johnson has urged the Australian selectors to explore their options beyond the star-studded bowling attack which has the likes of Pat Cummins, Mitchell Starc, Josh Hazlewood and Nathan Lyon. This comes after Australia were beaten by South Africa in the WTC final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/england-vs-india-test-series-vvs-laxman-gautam-gambhir-2741119-2025-06-15",
      "headline": "Laxman to lead India's preparations for 1st Test in Gambhir's absence: ReportVVS Laxman will reportedly be leading India's preparations for the England series in Gautam Gambhir's absence. The head coach is expected to rejoin the side ahead of the first Test in Headingley."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-australia-wtc-final-2741095-2025-06-15",
      "headline": "South Africa wins first World Test Championship title with Bavuma's heroic inningsSouth Africa cricket team sang an incredible tribute to their captain, Temba Bavuma, after the WTC Final win against Australia. The moment became viral on the internet."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}