{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-talks-from-april-23-tariffs-and-customs-negotiations-on-agenda-2711580-2025-04-19",
      "headline": "India-US trade talks from April 23, tariffs, customs negotiations on agenda: ReportThe Indian official team is visiting the US to give further impetus to the negotiations in the 90-day tariff pause window and discuss these terms of reference to iron out differences on certain issues."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ford-pauses-shipments-of-suvs-sports-cars-and-other-models-to-china-glbs-2711296-2025-04-19",
      "headline": "Ford pauses shipments of SUVs, sports cars and other models to ChinaFord has halted exports of key US-built vehicles to China amid rising tariffs and trade tensions, impacting a once-profitable segment of its business, WSJ reports. Engine shipments, however, continue. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/no-gst-on-upi-transactions-over-rs-2000-government-calls-claims-false-baseless-2711204-2025-04-18",
      "headline": "No GST on UPI transactions over Rs 2,000, government clarifiesUPI payments, especially those made to merchants, currently don't attract any extra charges like GST."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/icici-bank-cuts-fd-and-savings-rates-check-what-is-new-2711065-2025-04-18",
      "headline": "ICICI Bank cuts FD and savings rates. Check what's newIf you have a savings account with ICICI Bank, you'll now earn slightly less. For balances below Rs 50 lakh, the new interest rate is 2.75% per annum, down from 3%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-layoff-lets-go-of-240-new-recruits-offers-free-upskilling-report-2711006-2025-04-18",
      "headline": "Infosys lets go of 240 new recruits, offers free upskilling: ReportThe impacted employees joined the company in October 2024 as part of a training batch. The freshers were hired for two roles; System Engineers (SE) and Digital Specialist Engineers (DSE)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-china-tariff-war-nvidia-ceo-jensen-huang-keep-serving-chinese-firms-massive-ai-chip-export-loss-2710980-2025-04-18",
      "headline": "Nvidia to keep serving Chinese firms despite massive AI chip export lossHuang's statement comes at a time when the United States has tightened rules around exporting advanced chips to China. The restrictions, announced under the Donald Trump administration, are part of an ongoing trade war between the two countries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/want-to-change-your-tax-regime-while-filing-itr-heres-what-you-should-know-2710978-2025-04-18",
      "headline": "Want to change your tax regime while filing ITR? Here's what you should knowLet's say you had earlier chosen the old tax regime, but now the new regime appears more beneficial after reviewing your finances. Can you change it when filing your ITR? Let's find out here."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-denies-job-bias-against-us-employees-calls-allegations-misleading-report-2710927-2025-04-18",
      "headline": "TCS denies job bias against US employees, calls allegations 'misleading': ReportThe complaints have mostly come from workers in the US who are over 40 and not of non-South Asian ethnic backgrounds. They believe TCS chose them for layoffs during the tech industry slowdown, while keeping younger Indian workers on H-1B visas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gensol-fraud-blusmart-shuts-down-why-reasons-anmol-puneet-singh-jaggi-sebi-expose-2710898-2025-04-18",
      "headline": "How Jaggi brothers squandered borrowed money, killed BluSmartSebi's interim order exposed how the Jaggi brothers may have taken investors for a ride, not in an EV, but in a web of financial mismanagement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/can-you-open-two-ppf-accounts-check-details-2710891-2025-04-18",
      "headline": "Can you open two PPF accounts? Check detailsThe combined yearly deposit in both your PPF account and that of your child's account cannot go beyond Rs 1.5 lakh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-tariff-strategy-backfiring-weaker-us-dollar-explained-2710868-2025-04-18",
      "headline": "Trump started the tariff war. Now a weak dollar has him on the back footAs Trump's tariff strategy faces mounting challenges, a weakening dollar and rising inflation threaten to undermine his economic goals, forcing the US into a precarious position as global trade tensions escalate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/imf-backs-india-stance-on-tariffs-presses-us-china-on-fair-trade-2710848-2025-04-18",
      "headline": "IMF backs India's stance on tariffs, presses US-China on fair tradeAmid rising global tensions, the IMF sees India's moves on tariffs as a rare bright spot, urging the world's largest economies to rebuild trust and strengthen a fair trade system."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/life-insurance-claim-rejection-what-to-do-easy-steps-expert-view-2710841-2025-04-18",
      "headline": "Life insurance claim rejected? Here's how to get it correctGetting an insurance claim approved has become a nightmare nowadays. Nithin Kamath, in a post, also said that many avoid life insurance because policies as they are confusing and getting harder to understand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/good-friday-2025-stock-market-holiday-sensex-nifty-closed-no-trading-today-april-18-nse-bse-2710808-2025-04-18",
      "headline": "Good Friday 2025: Are Sensex and Nifty closed for trading today?This week has been a short one for stock market participants. The markets opened only for three days, from April 15 to April 17. They were shut on Monday, April 14, in observance of Dr. Baba Saheb Ambedkar Jayanti."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/thumbay-international-research-grant-awards-14-projects-at-gulf-medical-university-2710719-2025-04-17",
      "headline": "Thumbay International Research Grant awards 14 projects at Gulf Medical UniversityThe 14 selected projects, led by top researchers from institutions like Harvard Medical School, University of Arizona, and Regensburg University, were chosen for their exceptional quality and originality. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ruchir-sharma-on-trump-tariffs-global-and-indian-economy-impact-stock-markets-interview-2710697-2025-04-17",
      "headline": "Trump's tariffs could hurt US, but an opportunity for India: Ruchir SharmaRuchir Sharma believes India's emerging role in global trade could reshape its economic future, with a potential influx of investment as the US faces trade challenges and shifts in global capital flows."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/opting-for-new-tax-regime-check-out-these-5-benefits-2710601-2025-04-17",
      "headline": "Opting for new tax regime? Check out these 5 benefitsThe revisions introduced under the new tax regime aim to make the new regime easier, cut down on paperwork, and minimise the confusion many individuals experience in filing their returns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-q4-results-net-profit-revenue-final-dividend-rs-22-all-key-details-2710503-2025-04-17",
      "headline": "Infosys Q4 results: Profit drops 12%, final dividend set at Rs 22The IT major clocked revenue of Rs 40,925 crore for the March quarter, up 8% from Rs 37,923 crore a year ago. In constant currency terms, revenue grew 4.8% YoY but declined 3.5% sequentially."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ipo-missing-disappeared-2025-no-public-listing-last-2-months-stock-market-investor-sentiment-2710498-2025-04-17",
      "headline": "No public listing in 2 months: Where have IPOs disappeared?Just nine companies have listed on the mainboard till April this year, compared to 25 in the same period last year, and most didn't even leave a mark."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-ends-1500-points-higher-nifty-settles-above-23850-icici-bank-bajaj-finserv-gain-over-3-2710463-2025-04-17",
      "headline": "Sensex, Nifty rebound to end nearly 2% higher as banking stocks rallyThe S&P BSE Sensex ended 1508.91 higher at 78,553.20, while the NSE Nifty50 settled 414.45 points higher at 23,851.65. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sunscreen-faceoff-honasa-vs-hul-in-court-over-ad-claims-2710432-2025-04-17",
      "headline": "Sunscreen faceoff: Honasa vs HUL in court over ad claimsThe core of the argument is SPF, the sun protection factor which measures how well a sunscreen protects against harmful UV rays."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/flipkart-work-from-home-policy-ends-employees-asked-return-office-5-days-a-week-2710446-2025-04-17",
      "headline": "Flipkart ends WFH policy, asks all employees to work from office: ReportFlipkart had initially offered flexibility to employees during the pandemic. But over the past year, the company began rolling back the policy in phases—first calling senior executives back to office. Now, the mandate applies to all employees, regardless of role or function."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vijay-kedia-10-red-flags-spot-potential-scam-companies-gensol-fraud-blusmart-shuts-down-2710438-2025-04-17",
      "headline": "Vijay Kedia warns of 10 red flags to spot a potential scam amid Gensol fraudInvestor and market expert Vijay Kedia has warned that Gensol is not the only company with problems amid the findings by Sebi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/bengaluru-techie-compares-life-with-rs-25-lakh-in-india-vs-100k-dollars-in-us-2710353-2025-04-17",
      "headline": "Rs 25 lakh in India or $100K in US? Bengaluru techie weighs in on what's betterChoosing to stay in India means staying close to family, celebrating festivals, and living within a culture you know well, said the tech professional."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/phonepe-rolls-out-upi-circle-simplifies-payments-for-family-and-friends-2710392-2025-04-17",
      "headline": "PhonePe rolls out UPI Circle, simplifies payments for family and friendsUPI Circle is a feature by NPCI (National Payments Corporation of India) where a primary user gives permission to a secondary user to make payments from their UPI account, within set limits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-chief-tuhin-kanta-pandey-gensol-fraud-job-is-to-find-and-punish-them-2710390-2025-04-17",
      "headline": "Sebi's job is to find and punish them: Tuhin Kanta Pandey on Gensol fraudThe Securities and Exchange Board of India (Sebi) released an interim order on April 15, stating that Gensol Engineering's promoters, brothers Anmol and Puneet Singh Jaggi, had diverted company funds for personal use. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rally-today-sensex-700-points-nifty-gains-4-things-to-know-2710369-2025-04-17",
      "headline": "Surprise rally lights up Dalal Street, Sensex jumps 1,500 points. Here's whyShare market today: Despite a slight uptick in volatility, sentiment turned decisively positive as fears around global trade tensions began to fade. Broader market indices joined the rally, reflecting widespread optimism among investors."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/blusmart-shuts-operations-sebi-expose-gensol-fraud-anmol-puneet-singh-jaggi-2710342-2025-04-17",
      "headline": "End of the road for BluSmart as Sebi exposes Gensol fraudMany users across Delhi-NCR, Bengaluru, and Mumbai reported that they could no longer book rides through the BluSmart app. The company also sent a notification to users stating that bookings were being temporarily closed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-q4-results-expectations-fy26-outlook-dividend-net-profit-revenue-2710323-2025-04-17",
      "headline": "Infosys Q4 results today: All eyes on FY26 outlook, dividend detailsInfosys Q4FY25 results: As the second-largest software services exporter gears up to release its earnings, investors will be watching closely for guidance on FY26 revenue growth, margins, and management's take on business sentiment in key markets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gensol-engineering-shares-hit-5-percent-lower-circuit-for-2nd-straight-day-2710312-2025-04-17",
      "headline": "Gensol Engineering shares hit 5% lower circuit for 2nd straight dayGensol Engineering share price: The stock plunged 5% to Rs 117.50 on the Bombay Stock Exchange (BSE), hitting yet another all-time low."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nvidia-market-value-stock-crash-148-billion-dollars-gone-trump-china-curbs-explained-2710298-2025-04-17",
      "headline": "Explained: Why Nvidia's market value dropped $148 billion overnightNvidia shares were hit hard in the overnight trading session on Wall Street, falling nearly 7% and losing $148 billion in market value. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wipro-share-price-falls-5-percent-q4-results-weak-revenue-guidance-fy26-2710277-2025-04-17",
      "headline": "Wipro shares tank 6% in early trade despite strong Q4 earnings. Buy or sell?Wipro share price: At 9:20 am, Wipro shares were trading 5.33% lower at Rs 234.30 on the Bombay Stock Exchange. The decline came after the company reported its earnings post-market hours on Wednesday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-bell-sensex-opens-180-points-lower-nifty-below-23400-wipro-down-5-percent-2710274-2025-04-17",
      "headline": "Sensex loses over 300 points in early trade, Nifty below 23,400; Wipro down 5%The S&P BSE Sensex was down by 344.50 points to 76,700.24, while the NSE Nifty50 lost 119.70 points to 23,317.50 as of 9:30 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rio-tinto-partners-with-indian-firm-to-explore-low-carbon-aluminium-project-2710270-2025-04-17",
      "headline": "Rio Tinto partners with Indian firm to explore low-carbon aluminium projectThe potential development could see up to 1 million tonnes per annum (mtpa) of primary aluminium smelting and 2 mtpa of alumina production, both energized by renewable wind and solar power, supported by pumped hydro storage, the global miner said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-today-april-17-sensex-nifty-to-open-lower-why-it-stocks-q4-results-2710261-2025-04-17",
      "headline": "Stock market opening today: Sensex, Nifty likely to open lower. Here's whyDespite the weak outlook for Thursday's session, Sensex and Nifty have seen a strong upward trend in the last few days. In the past three sessions, Nifty50 has gone up by 4.6% while Sensex has gained 4.3%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-shares-in-news-april-17-wipro-gensol-tata-steel-bel-paytm-hero-motocorp-nse-bse-trading-2710251-2025-04-17",
      "headline": "Stocks to watch on April 17: Wipro, Gensol, Tata Steel, BEL, Paytm, Hero MotoCorpSeveral companies will announce their results for Q4 FY25 on Thursday. These include Infosys, HDFC Life Insurance Company, Jio Financial Services, HDFC Asset Management Company, Tata Elxsi, National Standard (India), and E2E Networks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-get-land-99-paise-andhra-pradesh-visakhapatnam-nara-lokesh-it-hub-growth-promotion-2710238-2025-04-17",
      "headline": "21 acres for just 99 paise: Big land allotment to TCS as Andhra bets big on techThe cabinet of Andhra Pradesh cleared the proposal on Tuesday, stating that the project is expected to bring in an investment of around Rs 1,370 crore and create nearly 12,000 jobs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/old-or-new-tax-regime-here-how-to-pick-the-right-one-before-filing-itr-2710023-2025-04-16",
      "headline": "Old or New Tax Regime: Here's how to pick the right one before filing ITRUnder the old tax regime, taxpayers can claim various deductions and exemptions, while the new tax regime does not offer much deductions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-how-is-tax-refund-calculated-and-when-will-you-get-it-2709945-2025-04-16",
      "headline": "ITR filing: How is tax refund calculated, and when will you get it?When you file your return, you declare your income, claim deductions, and report taxes already paid. The tax system compares your actual tax due with what you've already paid. If you've paid more, the extra amount is returned to you as a refund."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wipro-q4-results-net-profit-rises-26-percent-to-rs-3570-crore-revenue-beats-estimates-2709903-2025-04-16",
      "headline": "Wipro Q4 results: Net profit rises 26% to Rs 3,570 croreRevenue from operations saw a modest 1% year-on-year increase, reaching Rs 22,504 crore, compared to Rs 22,208 crore in Q4FY24."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/unni-mukundan-says-films-cant-be-blamed-for-drug-abuse-amid-shine-tom-chacko-row-2711548-2025-04-19",
      "headline": "Unni Mukundan says films can't be blamed for drug abuse amid Shine Tom Chacko rowAmid the arrest of Malayalam actor Shine Tom Chacko in a drugs case, fellow actor Unni Mukundan has come forward to defend the film industry. He argued that cinema alone should not be blamed for such incidents.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/resident-playbook-review-a-spin-off-that-honours-the-legacy-of-hospital-playlist-2711544-2025-04-19",
      "headline": "Resident Playbook review: A spin-off that honours the legacy of Hospital PlaylistReleased-Sat Apr 12, 2025'Resident Playbook' offers a gritty take on the medical drama genre, focusing on the challenges faced by young residents. With emotional depth and realistic portrayals, it stands as a compelling addition to the 'Hospital Playlist' universe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/khushboo-sundar-x-twitter-account-gets-hacked-alerts-fans-about-suspicious-activity-2711515-2025-04-19",
      "headline": "Khushboo Sundar alerts fans about suspicious activity after X account gets hackedActor and politician Khushboo Sundar's X account has been hacked. She shared an Instagram post to alert fans about any suspicious activity on her account."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bridgerton-nicola-coughlan-slams-jk-rowling-for-celebratory-post-over-trans-ruling-harry-potter-series-2711510-2025-04-19",
      "headline": "Bridgerton's Nicola Coughlan slams JK Rowling for celebratory post over trans rulingActor Nicola Coughlan on Friday shared a note in her Instagram stories, asking 'Harry Potter' writer JK Rowling to keep her 'Harry Potter lads', after the latter made a celebratory post following the Supreme Court's trans-woman ruling. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-visits-tirupati-temple-with-director-raj-nidimoru-2711481-2025-04-19",
      "headline": "Samantha visits Tirupati temple with director Raj NidimoruSamantha visited the Tirupati Balaji Temple along with filmmaker Raj Nidimoru on Saturday. Videos from their divine visit have surfaced on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/priyanka-chopra-mahesh-babu-latest-update-from-ss-rajamouli-ssmb29-has-boat-connection-2711477-2025-04-19",
      "headline": "Priyanka Chopra-Mahesh Babu's latest update from SSMB29 has 'boat' connectionPriyanka Chopra Jonas, Mahesh Babu and Prithviraj Sukumaran are all set to begin the next shoot schedule for SS Rajamouli's next mythology-based film. Here's the latest update from their shoot schedule. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kamal-haasan-recalls-being-judged-for-marrying-twice-as-brahmin-devotee-of-lord-ram-2711460-2025-04-19",
      "headline": "Kamal Haasan recalls being judged for marrying twice as Brahmin devotee of Lord RamDuring the promotions of Mani Ratnam's film 'Thug Life', actors Kamal Haasan, Trisha Krishnan, and Simbu shared their personal views on marriage. Kamal Haasan reflected on his past relationships and his stance on the institution of marriage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/phule-director-defends-film-amid-row-caste-discrimination-plagues-our-society-2711470-2025-04-19",
      "headline": "Caste discrimination plagues our society: Phule director defends film amid rowDirector Ananth Mahadevan spoke about objections raised against the portrayal of caste-discrimination in his film, 'Phule'. The filmmaker said India's fight against discrimination is far from over. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/malayalam-actor-shine-tom-chacko-arrested-in-drugs-case-2711468-2025-04-19",
      "headline": "Malayalam actor Shine Tom Chacko, arrested in drugs case, gets bailMalayalam actor Shine Tom Chacko has been arrested by Kerala police. He was charged under Sections 27 and 29 of the Narcotics Drugs and Psychotropic Substances (NDPS) Act. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jaat-director-gopichand-malineni-says-film-was-tweaked-before-backlash-no-filmmaker-wants-to-hurt-2711431-2025-04-19",
      "headline": "Jaat director says film was tweaked before backlash: No filmmaker wants to hurtJaat director Gopichand Malineni finally addressed the controversial church scene in the recently released film. An FIR was filed for allegedly hurting religious sentiments, leading to the scene's removal.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sonakshi-sinha-as-nikita-roy-in-brother-kussh-sinha-directorial-debut-2711429-2025-04-19",
      "headline": "Sonakshi Sinha as Nikita Roy in brother Kussh's directorial debutSonakshi Sinha is gearing up for her next film, 'Nikita' Roy, which also marks the directorial debut of her brother, Kussh Sinha.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/urvashi-rautela-says-she-was-worshipped-as-damdami-mai-reacts-to-temple-remark-2711415-2025-04-19",
      "headline": "Urvashi Rautela says she was worshipped as 'Damdami Mai', reacts to temple remarkUrvashi Rautela's team released an official statement demanding legal action against those who took her remark on the 'Urvashi Temple' out of context. The actor's team further agreed with her claim about being worshipped as 'Damdami Mai' at Delhi University. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/deepika-padukone-remembers-irrfan-announces-pikus-re-release-in-theatres-2711413-2025-04-19",
      "headline": "Deepika Padukone remembers Irrfan, announces Piku's re-release in theatresDeepika Padukone, Irrfan and Amitabh Bachchan's 'Piku' will re-release in theatres. The announcement was made by Deepika on April 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ginny-and-georgia-3-teaser-brianne-howey-antonia-gentry-more-drama-and-twists-2711385-2025-04-19",
      "headline": "Ginny & Georgia 3 teaser: The mother-daughter duo return with more drama and twistsThe much-anticipated third season of 'Ginny and Georgia' is set to release soon on Netflix. The new teaser, released on Friday, promises more drama and excitement.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/lyrics-titles-bollywood-plays-on-nostalgia-and-numerology-dharma-productions-subhash-ghai-swanand-kirkire-2711154-2025-04-19",
      "headline": "From lyrics to titles: How Bollywood plays on nostalgia and numerologyEver wondered why so many film titles sound like your favourite old songs? From catchy hooks to cosmic calculations, Bollywood filmmakers are increasingly turning to iconic lyrics as their film titles. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/kesari-2-the-untold-story-of-murder-of-history-of-jallianwala-bagh-2711375-2025-04-19",
      "headline": "Kesari 2: The untold story of murder of history of Jallianwala BaghIn 'Kesari 2', director Karan Singh Tyagi puts together characters from completely different episodes of history, and gets confused between Brigadier General Reginald Dyer and Lt. Governor Michael O'Dwyer, and cooks up a fictitious trial that never happened. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jaat-box-office-collection-day-9-detailed-report-sunny-deol-film-sees-minor-dip-due-to-akshay-kumar-kesari-2-2711356-2025-04-19",
      "headline": "Jaat box office Day 9: Sunny Deol's film sees minor dip due to Akshay's Kesari 2 'Jaat' faced a tough challenge from 'Kesari Chapter 2' at the box office on Friday. The Sunny Deol starrer could have performed better on its second Friday, also considering that it was a Good Friday holiday. However, it earned in the range of Rs 4 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/all-about-anurag-kashyap-alleged-casteist-remark-and-police-complaint-2711344-2025-04-19",
      "headline": "All about Anurag Kashyap's alleged casteist remark, and police complaintAnurag Kashyap has upset a section of people by allegedly making a casteist remark against Brahmins on social media while responding to a user. Now, a complaint has been filed against him with Mumbai Police seeking an FIR. Kashyap's apology on April 18 followed the complaint.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kesari-2-box-office-collection-day-1-detailed-report-akshay-kumar-film-off-to-decent-start-amid-positive-response-2711339-2025-04-19",
      "headline": "Kesari 2 box office Day 1: Akshay's film off to decent start amid positive responseAkshay Kumar and R Madhavan's 'Kesari Chapter 2' is expecting a weekend push amid a positive response from the audience after opening on a decent note at the box office.  "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjp-mp-nishikant-dubey-close-parliament-supreme-court-make-laws-waqft-act-hearing-2711570-2025-04-19",
      "headline": "Shut down Parliament if Supreme Court makes laws: BJP MP slams judiciaryBJP MP Nishikant Dubey on Saturday criticised the Supreme Court and said that if it wants to make laws, then there is no need for Parliament in the country."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/mamata-banerjee-open-letter-slams-bjp-rss-over-lies-bengal-riots-murshidabad-violence-waqf-protests-2711603-2025-04-19",
      "headline": "Basket of untruths: Mamata Banerjee slams BJP, RSS for 'lies' on Bengal riotsThe Trinamool Congress (TMC) chief said that the BJP and RSS are trying to use an unfortunate incident that has occurred as a result of provocation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rr-vs-lsg-vaibhav-suryavanshi-14-becomes-youngest-player-to-make-ipl-debut-2711534-2025-04-19",
      "headline": "RR vs LSG: Vaibhav Suryavanshi, 14, becomes youngest player to make IPL debutVaibhav Suryavanshi, 14, becomes the youngest player to make IPL debut. He replaces Rajasthan captain Sanju Samson, who was ruled out due to injury."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/vladimir-putin-declares-unilateral-easter-ceasefire-russia-ukraine-war-2711545-2025-04-19",
      "headline": "Putin declares Easter truce, halts Russian offensive in Ukraine till Sunday endPutin, however, instructed the chief of Russia's general staff to keep Russian troops on standby to repel any violations of the truce by Kyiv."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/dlf-camellias-the-luxe-address-gurugram-the-gensol-jaggi-brothers-had-to-have-2711363-2025-04-19",
      "headline": "The pull of prestige: Why everyone wants a piece of DLF CamelliasWhile the cynosure is, of course, the huge sum of money squandered by the Jaggi brothers, people can't help but pause for a moment and ask: what is it about this ultra-luxurious condominium, DLF Camellias, that sets a benchmark even for the crème de la crème of the country?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bengal-governor-cv-ananda-bose-visit-to-riot-hit-murshidabad-bizarre-barbaric-scene-exclusive-2711497-2025-04-19",
      "headline": "Bizarre, barbaric: Bengal Governor after visit to riot-hit MurshidabadGovernor CV Ananda Bose said that his visit to the violence-hit border district came after he got contradictory reports of what actually transpired on the ground."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maharashtra-raj-thackeray-uddhav-working-together-hindi-imposition-marathi-nep-2711464-2025-04-19",
      "headline": "Amid 'Hindi imposition' row, Uddhav and Raj Thackeray hint at burying hatchetThe row over the Maharashtra government's decision to make Hindi a mandatory third language seems to have united warring first cousins Uddhav and Raj Thackeray."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-dc-score-jos-buttler-ahmedabad-points-table-2711549-2025-04-19",
      "headline": "Jos Buttler battles cramps, Delhi bowlers as Gujarat reclaim top spotIPL 2025, GT vs DC: Jos Buttler's unbeaten 98 helped Gujarat Titans successfully chase 204 against Delhi Capitals on a hot Saturday afternoon in Ahmedabad. Gujarat returned to the top of the points table with a hat-trick of wins at home. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/why-indian-parents-are-torn-between-cbse-and-international-boards-2711033-2025-04-18",
      "headline": "Why Indian parents are torn between CBSE and international boardsIn the past ten years, India has witnessed a 300% growth in IB and Cambridge schools, particularly in urban areas. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-2025-pakistan-travel-india-hybrid-model-pcb-2711567-2025-04-19",
      "headline": "Pakistan won't travel to India for Women's World Cup 2025: PCB chiefPakistan Cricket Board chief Mohsin Naqvi said the Pakistan women's team will not travel to India for the 50-over World Cup, scheduled to be held from September 29 to October 26, 2025. Pakistan won all five matches in the qualifiers held in Lahore. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/boy-bihar-darbhanga-presumed-dead-found-alive-in-nepal-returns-home-70-days-2711435-2025-04-19",
      "headline": "Kidnapped, taken to Nepal, declared dead: Bihar boy found alive after 70 daysA minor from Darbhanga, previously declared dead and cremated, has returned home safely after 70 days, revealing a shocking case of mistaken identity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/justice-kurian-joseph-supreme-court-jagdeep-dhankhar-bills-president-article-142-2711500-2025-04-19",
      "headline": "Top court guardian of Constitution: Ex-judge on Vice President's judiciary remarkJustice Kurian Joseph, in an exclusive interview with India Today, asserted that the Supreme Court was correct to invoke Article 142 of the Constitution to pass the Tamil Nadu bills."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kamal-haasan-recalls-being-judged-for-marrying-twice-as-brahmin-devotee-of-lord-ram-2711460-2025-04-19",
      "headline": "Kamal Haasan recalls being judged for marrying twice as Brahmin devotee of Lord RamDuring the promotions of Mani Ratnam's film 'Thug Life', actors Kamal Haasan, Trisha Krishnan, and Simbu shared their personal views on marriage. Kamal Haasan reflected on his past relationships and his stance on the institution of marriage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-saudi-arabia-visit-april-22-23-defence-cooperation-on-agenda-2711487-2025-04-19",
      "headline": "PM Modi to visit Saudi Arabia on April 22-23, defence cooperation on agendaPM Modi to visit Saudi Arabia on April 22-23, defence cooperation on agenda: Government"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-slams-bangladesh-hindu-community-leader-kidnapped-killed-systematic-persecution-minorities-external-affairs-ministry-2711432-2025-04-19",
      "headline": "Systematic persecution: India slams Bangladesh over Hindu leader's killingTwo days after a prominent Hindu leader was kidnapped and brutally killed in northern Bangladesh, India urged the Muhammed Yunus-led interim government to protect all minorities, including Hindus, 'without inventing excuses or making distinctions.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-admin-lawyer-demand-letter-harvard-sent-mistake-2711496-2025-04-19",
      "headline": "Trump admin lawyer says 'demand' letter to Harvard sent by mistake: ReportJosh Gruenbaum, a top lawyer at the General Services Administration, called one of Harvard's attorneys and said that the letter to the university had not been authorised, as per a New York Times report."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/lyrics-titles-bollywood-plays-on-nostalgia-and-numerology-dharma-productions-subhash-ghai-swanand-kirkire-2711154-2025-04-19",
      "headline": "From lyrics to titles: How Bollywood plays on nostalgia and numerologyEver wondered why so many film titles sound like your favourite old songs? From catchy hooks to cosmic calculations, Bollywood filmmakers are increasingly turning to iconic lyrics as their film titles. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/trending/weekly-quiz-474-18-04-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/malayalam-actor-shine-tom-chacko-arrested-in-drugs-case-2711468-2025-04-19",
      "headline": "Malayalam actor Shine Tom Chacko, arrested in drugs case, gets bailMalayalam actor Shine Tom Chacko has been arrested by Kerala police. He was charged under Sections 27 and 29 of the Narcotics Drugs and Psychotropic Substances (NDPS) Act. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/anurag-kashyap-brahmin-remark-phule-movie-row-backlash-politicians-union-minister-2711410-2025-04-19",
      "headline": "'Abusing Brahmins....': Anurag Kashyap's apology does little to soothe mattersFilmmaker Anurag Kashyap has faced backlash over his controversial remarks against Brahmins amid a row over the upcoming film 'Phule'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/delhi-university-topper-says-marks-are-not-enough-for-internship-without-skills-viral-linkedin-post-2711362-2025-04-19",
      "headline": "50 certificates, 10 medals, no internship: Student's 'brutal truth' in viral postMarks may win you medals, but not always internships - at least that's what this Delhi University student learned the hard way. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/several-dead-dozens-feared-trapped-as-4-storey-building-collapses-mustafabad-delhi-2711315-2025-04-19",
      "headline": "11 dead in Delhi building collapse, Chief Minister Rekha Gupta orders probeAccording to the police, at least 14 people have been rescued so far. Rescue teams from the NDRF, firefighters, and Delhi Police have rushed to the spot. The police further said that they are probing the cause behind the building's collapse."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/indian-student-killed-stray-bullet-canada-hamilton-shooting-incident-2711352-2025-04-19",
      "headline": "Indian student, 21, killed by stray bullet in Canada, was 'innocent bystander'Hamilton Police said Harsimrat Randhawa was waiting at a bus stop when a stray bullet struck her during a shooting incident involving two vehicles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/home-minister-amit-shah-reveals-weight-loss-journey-urges-youth-exercise-on-world-liver-day-2711472-2025-04-19",
      "headline": "Free from medicines: Amit Shah reveals weight-loss journey on World Liver DayRecollecting his journey towards fitness, Home Minister Amit Shah said that all it took was for him to change his diet, increase the hours of sleep and daily exercise."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/churchill-brothers-i-league-champions-inter-kashi-cas-2711630-2025-04-20",
      "headline": "Churchill Brothers declared I-League champions, Inter Kashi vow to take CAS routeChurchill Brothers have been declared as the I-League champions and earn promotion to the Indian Super League after the AIFF Appeals Committee ruled against second-placed Inter Kashi. The runners-up of the I-League have now vowed to take the case to the Court of Arbitration for Sport inorder to challenge the decision. in order"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-lsg-avesh-khan-mitchell-starc-jaipur-2711627-2025-04-20",
      "headline": "Don't want to be Mitchell Starc, just be a good Avesh Khan: LSG bowler on RR heroicsAvesh Khan said that he wasn't trying to do what Mitchell Starc in the final over against RR after guiding LSG to a miraculous win on Saturday, April 19. Avesh defended 9 runs in the final over to guide Lucknow to the win. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-riyan-parag-rr-vs-lsg-jaipur-2711624-2025-04-19",
      "headline": "Should have finished the game: Parag blames himself after RR lose to LSGIPL 2025: Riyan Parag scored 39 runs off 26 balls, but Rajasthan Royals (RR) lost by two runs against the Lucknow Super Giants (LSG). With nine runs needed off the last over, RR failed to hold their nerves. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/lsg-vs-rr-match-report-ipl-2025-avesh-khan-vaibhav-suryavanshi-jaiswal-2711614-2025-04-19",
      "headline": "Rajasthan fumble straightforward chase, lose thriller vs LSGAvesh Khan stunned Rajasthan Royals in Saturday's match in Jaipur, handing them a an unlikely win by 2 runs in what turned out to be an absolute thriller. Avesh's final two overs in the match turned out to be the point of difference between the two sides.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-playoffs-bucks-vs-pacers-lillard-nears-return-from-calf-injury-glbs-2711605-2025-04-19",
      "headline": "NBA Playoffs: Bucks vs Pacers, Lillard nears return from calf injuryThe Milwaukee Bucks are expected to receive a massive boost in their ongoing playoff series against the Indiana Pacers. Star guard Damian Lillard is nearing a return to the squad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-lsg-vaibhav-suryavanshi-fans-reactions-debut-2711601-2025-04-19",
      "headline": "Future of India: Vaibhav Suryavanshi stuns IPL teams, fans with fearless 34IPL 2025, RR vs LSG: 14-year-old Vaibhav Suryavanshi earned from fans and the cricketing fraternity after scoring 34 runs off 20 balls against the Lucknow Super Giants at the Sawai Mansingh Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-mi-vs-csk-mitchell-santner-press-conference-mumbai-chennai-2711596-2025-04-19",
      "headline": "MI vs CSK: Lot of similarities between Mumbai and Chennai, says Mitchell SantnerMitchell Santner has said that there are a lot of similarities between Mumbai Indians and Chennai Super Kings ahead of the IPL El Clasico clash on Sunday, April 20. Santner has played for CSK and MI in the IPL. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-lsg-vaibhav-suryavanshi-shardul-thakur-2711577-2025-04-19",
      "headline": "Watch: 14-year-old Vaibhav hits first-ball six to announce himself on IPL debutIPL 2025, RR vs LSG: 14-year-old Vaibhav Suryavanshi smashed Shardul Thakur for a six over the covers to announce himself after becoming the youngest debutant in the history of the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-lsg-rishabh-pant-failure-trolled-jaipur-2711576-2025-04-19",
      "headline": "106 off 108: Fans troll Rishabh Pant after another failure in RR vs LSGRishabh Pant was trolled once again after the LSG skipper suffered another failure with the bat in the clash against RR. Pant was dismissed for 3 runs off 9 balls against the Royals as his poor run of form continued. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-2025-pakistan-travel-india-hybrid-model-pcb-2711567-2025-04-19",
      "headline": "Pakistan won't travel to India for Women's World Cup 2025: PCB chiefPakistan Cricket Board chief Mohsin Naqvi said the Pakistan women's team will not travel to India for the 50-over World Cup, scheduled to be held from September 29 to October 26, 2025. Pakistan won all five matches in the qualifiers held in Lahore. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-womens-odi-world-cup-qualifiers-qualification-net-run-rate-2711565-2025-04-19",
      "headline": "West Indies miss World Cup berth after falling 0.001 behind in Net Run RateWest Indies beat Thailand by six wickets on Saturday, but failed to qualify for the Women's ODI World Cup to be held in India later this year. Bangladesh and Pakistan are the two teams to have gone through to the mega event from the Qualifiers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-mi-vs-csk-mitchell-santner-press-conference-mumbai-chennai-2711596-2025-04-19",
      "headline": "MI vs CSK: Lot of similarities between Mumbai and Chennai, says Mitchell SantnerMitchell Santner has said that there are a lot of similarities between Mumbai Indians and Chennai Super Kings ahead of the IPL El Clasico clash on Sunday, April 20. Santner has played for CSK and MI in the IPL. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-lsg-vaibhav-suryavanshi-shardul-thakur-2711577-2025-04-19",
      "headline": "Watch: 14-year-old Vaibhav hits first-ball six to announce himself on IPL debutIPL 2025, RR vs LSG: 14-year-old Vaibhav Suryavanshi smashed Shardul Thakur for a six over the covers to announce himself after becoming the youngest debutant in the history of the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-lsg-rishabh-pant-failure-trolled-jaipur-2711576-2025-04-19",
      "headline": "106 off 108: Fans troll Rishabh Pant after another failure in RR vs LSGRishabh Pant was trolled once again after the LSG skipper suffered another failure with the bat in the clash against RR. Pant was dismissed for 3 runs off 9 balls against the Royals as his poor run of form continued. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-2025-pakistan-travel-india-hybrid-model-pcb-2711567-2025-04-19",
      "headline": "Pakistan won't travel to India for Women's World Cup 2025: PCB chiefPakistan Cricket Board chief Mohsin Naqvi said the Pakistan women's team will not travel to India for the 50-over World Cup, scheduled to be held from September 29 to October 26, 2025. Pakistan won all five matches in the qualifiers held in Lahore. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-womens-odi-world-cup-qualifiers-qualification-net-run-rate-2711565-2025-04-19",
      "headline": "West Indies miss World Cup berth after falling 0.001 behind in Net Run RateWest Indies beat Thailand by six wickets on Saturday, but failed to qualify for the Women's ODI World Cup to be held in India later this year. Bangladesh and Pakistan are the two teams to have gone through to the mega event from the Qualifiers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-dc-jos-buttler-8th-hundred-virat-kohli-2711563-2025-04-19",
      "headline": "GT vs DC: How Jos Buttler sacrificed record IPL hundred for Gujarat winJos Buttler revealed how he decided to sacrifice his 8th IPL hundred to get the win for GT against DC on Saturday, April 19. Buttler scored 97 off 53 balls as Rahul Tewatia hit the winning runs for his side. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-mi-vs-csk-ms-dhoni-jasprit-bumrah-interaction-mumbai-2711553-2025-04-19",
      "headline": "Watch: Dhoni, Bumrah keep MI-CSK rivalry aside, share fun conversationMS Dhoni and Jasprit Bumrah put aside the Mumbai Indians-Chennai Super Kings rivalry and engaged in a fun conversation ahead of the IPL El Clasico on Sunday, April 20. Bumrah shares a great bond with Dhoni. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-dc-score-jos-buttler-ahmedabad-points-table-2711549-2025-04-19",
      "headline": "Jos Buttler battles cramps, Delhi bowlers as Gujarat reclaim top spotIPL 2025, GT vs DC: Jos Buttler's unbeaten 98 helped Gujarat Titans successfully chase 204 against Delhi Capitals on a hot Saturday afternoon in Ahmedabad. Gujarat returned to the top of the points table with a hat-trick of wins at home. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rr-vs-lsg-vaibhav-suryavanshi-14-becomes-youngest-player-to-make-ipl-debut-2711534-2025-04-19",
      "headline": "RR vs LSG: Vaibhav Suryavanshi, 14, becomes youngest player to make IPL debutVaibhav Suryavanshi, 14, becomes the youngest player to make IPL debut. He replaces Rajasthan captain Sanju Samson, who was ruled out due to injury."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-cricket-academy-dubai-2711530-2025-04-19",
      "headline": "Smriti Mandhana launches academy in Dubai to nurture future starsIndian women's cricketer Smriti Mandhana has launched her academy in Dubai - City Cricket Academy by Smriti Mandhana - in collaboration with UK-based coach Don Bhagawati. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-lsg-sanju-samson-injury-riyan-parag-captain-jaipur-2711531-2025-04-19",
      "headline": "RR vs LSG: Riyan Parag to lead Rajasthan again, Sanju Samson out due to injuryIPL 2025, RR vs LSG: Riyan Parag will return to lead the Rajasthan Royals in their home game against Lucknow Super Giants on Saturday. Sanju Samson suffered a strain while batting in Rajasthan's game in Delhi on Wednesday. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/rashid-khan-ipl-2025-poor-form-2711528-2025-04-19",
      "headline": "From bad to worse: Rashid Khan's horror form continues in IPLRashid Khan's terrible form in the Indian Premier League continued as he ended up having yet another poor outing on Saturday, April 19. Rashid went wicketless and even wasted two reviews in the match against Delhi Capitals.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-live-score-rajasthan-royals-vs-lucknow-super-giants-updates-today-match-2711522-2025-04-19",
      "headline": "RR vs LSG Highlights: Avesh Khan the hero as Lucknow win by 2 runsIPL 2025, RR vs LSG Highlights: Avesh Khan is the hero for Lucknow as he defends 9 runs in the final over as LSG get another thrilling win to get back to winning ways. Rajasthan have lost their 4th game on the trot as they lose their second match in jaipur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-cricket-academy-dubai-2711530-2025-04-19",
      "headline": "Smriti Mandhana launches academy in Dubai to nurture future starsIndian women's cricketer Smriti Mandhana has launched her academy in Dubai - City Cricket Academy by Smriti Mandhana - in collaboration with UK-based coach Don Bhagawati. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-lsg-sanju-samson-injury-riyan-parag-captain-jaipur-2711531-2025-04-19",
      "headline": "RR vs LSG: Riyan Parag to lead Rajasthan again, Sanju Samson out due to injuryIPL 2025, RR vs LSG: Riyan Parag will return to lead the Rajasthan Royals in their home game against Lucknow Super Giants on Saturday. Sanju Samson suffered a strain while batting in Rajasthan's game in Delhi on Wednesday. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/rashid-khan-ipl-2025-poor-form-2711528-2025-04-19",
      "headline": "From bad to worse: Rashid Khan's horror form continues in IPLRashid Khan's terrible form in the Indian Premier League continued as he ended up having yet another poor outing on Saturday, April 19. Rashid went wicketless and even wasted two reviews in the match against Delhi Capitals.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-live-score-rajasthan-royals-vs-lucknow-super-giants-updates-today-match-2711522-2025-04-19",
      "headline": "RR vs LSG Highlights: Avesh Khan the hero as Lucknow win by 2 runsIPL 2025, RR vs LSG Highlights: Avesh Khan is the hero for Lucknow as he defends 9 runs in the final over as LSG get another thrilling win to get back to winning ways. Rajasthan have lost their 4th game on the trot as they lose their second match in jaipur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-dc-ahmedabad-heat-ishant-sharma-axar-patel-2711518-2025-04-19",
      "headline": "GT vs DC: Excessive heat in Ahmedabad takes toll on players, Axar, Ishant struggleThe Ahmedabad heat took a toll on the players during the GT vs DC game as Ishant Sharma and Axar Patel struggled during the first innings on Saturday, April 19. Ishant had to be taken off the field. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-dc-jos-buttler-vipraj-nigam-catch-2711516-2025-04-19",
      "headline": "Jos Buttler takes sensational catch to dismiss Vipraj Nigam after howlersIPL 2025, DC vs GT: Jos Buttler took a sharp reflex catch in the match against Delhi Capitals (DC), helping Prasidh Krishna dismiss Vipraj Nigam for a golden duck at the Narendra Modi Stadium in Ahmedabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-dc-kl-rahul-200-sixes-fastest-ms-dhoni-ab-de-villiers-2711499-2025-04-19",
      "headline": "KL Rahul faster than MS Dhoni, AB de Villiers to hit 200 sixes in IPLIPL 2025, GT vs DC: KL Rahul hit his 200th six in the Indian Premier League in his 129th innings in the tournament. Rahul has gotten to the milestone faster than the likes of MS Dhoni and Sanju Samson."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-abhishek-nayar-joins-kkr-sacked-india-coach-2711489-2025-04-19",
      "headline": "Abhishek Nayar joins KKR days after losing India assistant coach jobFormer India assistant coach Abhishek Nayar has joined IPL team KKR, just days after getting sacked from the national team. Abhishek has coached at KKR before as well."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/wrestlemania-41-match-card-livestreaming-details-las-vegas-all-you-need-to-know-2711488-2025-04-19",
      "headline": "WWE WrestleMania 41: All you need to know, match card, live streaming detailsWrestleMania 41 is all set to emanate from the Allegiant Stadium in Las Vegas, Nevada throughout two nights. Here's all you need to know about the Showcase of Immortals this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-dc-jake-fraser-mcgurk-dropped-hemang-badani-contrary-2711469-2025-04-19",
      "headline": "GT vs DC: Delhi drop Jake Fraser-McGurk a day after coach backs himIPL 2025, GT vs DC: Delhi Capitals dropped Jake Fraser-McGurk a day after head coach Hemang Badani backed the youngster despite his poor form. The Australian star has managed just 55 runs in six matches this season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-gt-vs-dc-kagiso-rabada-return-last-week-april-shubman-gill-confirms-2711467-2025-04-19",
      "headline": "Kagiso Rabada to return in the last week of April: GT captain Shubman GillShubman Gill confirmed Kagiso Rabada's return is expected by the end of April, as Gujarat Titans manage well without their ace pacer. GT's clash against Delhi Capitals saw the absence of Rabada continue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-pbks-pitch-bengaluru-sanjay-bangar-2711436-2025-04-19",
      "headline": "Bengaluru pitch the problem? Ex-coach highlights concerns for RCB in IPL 2025IPL 2025, RCB vs PBKS: Former batting coach Sanjay Bangar said RCB will be concerned about the nature of the pitches that have been on offer in Bengaluru. Traditionally batter-friendly pitches, the M Chinnaswamy Stadium pitch has helped bowlers more in the ongoing season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-lsg-match-preview-predicted-xi-pitch-report-weather-prediction-2711437-2025-04-19",
      "headline": "Dented Rajasthan face big Lucknow challenge featuring a Mayank Yadav returnRR vs LSG, IPL 2025 match preview: With their IPL 2025 campaigns heading in different directions, RR and LSG prepare for a crucial Saturday clash in Jaipur—where momentum for one and survival for the other will be on the line."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-rcb-vs-pbks-royal-challengers-bengaluru-pacer-josh-hazlewood-press-conference-2711426-2025-04-19",
      "headline": "RCB are slow learners: Hazlewood breaks down Chinnaswamy debacle after PBKS lossRoyal Challengers Bengaluru pacer Josh Hazlewood blamed his team's third consecutive home defeat on an unorthodox Chinnaswamy pitch and the batsmen's failure to apply what they had learned in prior matches.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-r-ashwin-youtube-show-ms-dhoni-panelist-shush-2711411-2025-04-19",
      "headline": "Shush: R Ashwin stops panelist from talking about MS Dhoni during YouTube showIPL 2025: After having promised not to review Chennai Super Kings matches in his YouTube show, R Ashwin was careful when a panellist on his show started talking about MS Dhoni's captaincy.  "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}