{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/amul-milk-price-hike-mother-dairy-two-rupees-per-litre-2717659-2025-04-30",
      "headline": "After Mother Dairy, Amul hikes milk prices by Rs 2 per litreAfter Mother Dairy, Amul has also hiked the prices of its milk up to 2rs per litre. The new prices will come into effect from tomorrow, i.e., May 1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/cash-is-king-says-mark-mobius-amid-trade-war-fears-backs-india-over-china-2717526-2025-04-30",
      "headline": "'Cash is king,' says Mark Mobius amid trade war fears, backs India over ChinaVeteran investor Mark Mobius believes that the uncertainty around the trade wars makes it risky to invest right now. However, he does see hope in countries like India, which he says could benefit as global supply chains shift away from China."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-closes-46-points-lower-nifty-below-24400-bajaj-twins-fall-5-percent-2717501-2025-04-30",
      "headline": "Sensex closes 46 points lower, Nifty below 24,400; Bajaj twins fall 5%The S&P BSE Sensex was down by 46.14 points to end at 80,242.24, while the NSE Nifty50 lost 1.75 points to close at 24,334.20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/gold-prices-today-fall-stock-market-investment-akshaya-tritiya-safe-haven-2717498-2025-04-30",
      "headline": "Can gold retain its glitter as Dalal Street gets back its glow?Just a week ago, gold was trading at record levels due to global uncertainty. Concerns over trade tensions, US tariffs, and geopolitical issues had pushed investors towards gold, a common choice during uncertain times. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/upcoming-ipos-public-listing-market-buzz-dalal-street-trading-lg-tata-zepto-reliance-hdfc-2717462-2025-04-30",
      "headline": "New wave of IPOs is coming. Is Dalal Street ready?Tata Capital, PhonePe, and Zepto are also said to be in the pipeline. Financial firms like HDB Financial Services and Hero FinCorp are planning to raise Rs 12,500 crore and Rs 3,668 crore, respectively. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/rakuten-to-invest-over-100-million-dollars-in-india-plans-to-boost-hiring-by-8-percent-2717447-2025-04-30",
      "headline": "Rakuten to invest over $100 million in India, plans to boost hiring by 8%Rakuten currently employs 4,000 people in India, 90% of whom are tech staff, and plans to recruit people who it considers \"power users\" of AI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rbi-raises-atm-charges-rs-23-from-may-1-know-the-details-here-2717434-2025-04-30",
      "headline": "RBI's raises ATM charges to Rs 23 from May 1: Know the details herePeople living in metro cities would get three free transactions per month, while those living in non-metro areas would get five free transactions per month. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indian-rupee-rallies-strongest-2025-level-foreign-inflows-dollar-sales-2717421-2025-04-30",
      "headline": "Rupee jumps to highest level in 2025. Check factors behind strong rallyThe Indian rupee reached its highest level of 2025, driven by foreign inflows and exporter dollar sales. Optimism over US-India trade talks and a weakening US dollar further supported the currency's rally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/if-we-look-closely-zoho-founder-and-ceo-sridhar-vembu-on-finding-rural-talent-2717362-2025-04-30",
      "headline": "'If we look closely...': Zoho's Sridhar Vembu on finding rural talentZoho's CEO, Sridhar Vembu, believes that India's path to development must include creating jobs and opportunities in smaller towns and villages."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/adani-group-stocks-trading-price-target-q4-results-brokerage-reports-2717352-2025-04-30",
      "headline": "5 Adani stocks get new targets after Q4 results: What should investors do?With Gautam Adani-led Adani Enterprises Ltd set to announce its earnings report soon, stock brokerages have already reviewed the performance of five listed companies from the group and shared fresh price targets and advice for investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/varun-beverages-q4-results-key-things-to-expect-from-pepsico-bottler-2717316-2025-04-30",
      "headline": "Varun Beverages Q4 net profit at Rs 726 crore; firm announces interim dividendThe company posted a net profit of Rs 726 crore, up 35% year-on-year, driven by higher volumes and peak-season demand. Revenue for the quarter came in at Rs 5,680 crore, a 29% jump YoY, slightly ahead of most analyst estimates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/vivad-se-vishwas-20-deadline-ends-today-last-call-to-settle-income-tax-disputes-2717298-2025-04-30",
      "headline": "Vivad Se Vishwas 2.0 deadline ends today: Last call to settle income tax disputesVivad Se Vishwas 2.0 is a dispute resolution scheme run by the Income Tax Department. It gives taxpayers a chance to settle ongoing tax-related cases by avoiding the prolonged litigation process and simply paying the disputed tax amount."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hania-aamir-mahira-khan-pak-actors-instagram-disabled-in-india-2717680-2025-04-30",
      "headline": "Many Pak actors' Instagram blocked in India, Hania Aamir among themOther Pakistani celebrities whose Instagram accounts have been disabled in India are Ali Zafar, Sanam Saeed, Bilal Abbas, Iqra Aziz, Imran Abbas and Sajal Aly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-opens-up-about-his-passion-for-acting-i-have-very-strong-work-ethics-2717592-2025-04-30",
      "headline": "Ajith opens up about his passion for acting: I have very strong work ethicsAjith Kumar, celebrated actor and racer, shared insights on his dual passions - acting and racing - in an exclusive interview. Recently awarded the Padma Bhushan, he reflected on his journey and future racing plans."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/janhvi-kapoor-criticises-jaipur-drunk-driving-accident-that-killed-teen-girl-2717658-2025-04-30",
      "headline": "Janhvi Kapoor fumes over Jaipur drunk-driving accident that killed 14-year-oldA tragic incident in Jaipur unfolded as a 14-year-old girl lost her life due to a drunk-driving accident, prompting actor Janhvi Kapoor to express her outrage on social media. The accident involved a car allegedly driven by an intoxicated woman."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/countdown-jensen-ackles-show-to-premiere-prime-video-on-june-25-2717642-2025-04-30",
      "headline": "Countdown: Jensen Ackles-led show to premiere on June 25Prime Video announces the premiere date for its new action series 'Countdown', created by Derek Haas. The show features a stellar cast including Jensen Ackles and Eric Dane, with a premiere set for June 25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/gram-chikitsalay-trailer-amol-parashar-vinay-pathak-tvf-panchayat-like-heartfelt-show-2717619-2025-04-30",
      "headline": "Gram Chikitsalay trailer: Amol Parashar is on lookout for patients in rural taleThe trailer of 'Gram Chikitsalay' introduces viewers to the challenges faced by Dr Prabhat, a city doctor, as he attempts to rejuvenate a neglected health centre in the village of Bhathkandi. With a talented cast, the series is set to premiere on Prime Video on May 9."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/who-was-costao-fernandes-nawazuddin-siddiqui-costao-brings-heroic-life-customs-officer-2717593-2025-04-30",
      "headline": "Who's Costao Fernandes? Nawazuddin brings heroic life of customs officer to screen'Costao' tells the true story of Tony da Costa Fernandes, a brave officer who took down smugglers and paid a heavy price for justice. Featuring Nawazuddin Siddiqui, the film covers the themes of courage, corruption, and honour. Here's all you need to know about the gutsy customs officer.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/influencer-ishita-mangal-slams-ranveer-singh-nitanshi-goel-sidharth-malhotra-celebs-for-disrespecting-designers-2717492-2025-04-30",
      "headline": "Influencer slams Ranveer Singh, Nitanshi Goel, and celebs for disrespecting designersInfluencer Ishita Mangal recently called out Bollywood actors for showing disrespect towards designers during fashion shows. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ground-zero-actor-emraan-hashmi-attack-on-ghazi-baba-most-crucial-counter-terror-attack-india-2717568-2025-04-30",
      "headline": "Exclusive: Emraan Hashmi revisits India's most crucial counter-terror attackActor Emraan Hashmi discusses his role in 'Ground Zero', highlighting its focus on one of the most crucial anti-terror operation in early 2000s Kashmir, a volatile period marked by significant terrorist activities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/met-gala-2025-shah-rukh-khan-kiara-advani-diljit-dosanjh-indian-fans-expect-this-year-isha-ambani-2717551-2025-04-30",
      "headline": "Met Gala 2025: What can Indian fans expect this yearMet Gala 2025 is just around the corner, and fans are quite excited about the same. With several prominent names from the Indian circuit, including Shah Rukh Khan, Kiara Advani, and more on the list, this year's fashionable event is shaping up to be a glamorous global affair.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/sheena-bajaj-expecting-first-child-with-husband-rohit-purohit-2717500-2025-04-30",
      "headline": "Best of Luck Nikki's Sheena Bajaj expecting first child with husband Rohit PurohitActor Sheena Bajaj is pregnant with her first child. The actor shared the news with her fans on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nani-telegana-representation-in-films-paradise-dasara-2717511-2025-04-30",
      "headline": "Actor Nani defends portrayal of Telangana people in Dasara | ExclusiveTelugu actor Nani addresses the portrayal of Telangana in films, promising a fresh perspective in his upcoming movie 'The Paradise'. In an interview, he defends his previous work while assuring a new narrative in his latest project."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vvan-force-of-the-forest-tamannaah-bhatia-joins-sidharth-malhotras-upcoming-folk-thriller-2717473-2025-04-30",
      "headline": "Vvan: Tamannaah Bhatia joins Sidharth Malhotra's upcoming folk thrillerTamannaah Bhatia is set to star alongside Sidharth Malhotra in the folk thriller 'Vvan-Force of the Forest.' A teaser showcasing her mysterious new avatar was released, coinciding with Chhath 2024 festivities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-hospitalised-minor-leg-injury-chennai-airport-after-padma-bhushan-2717445-2025-04-30",
      "headline": "Ajith Kumar hospitalised after minor leg injury in ChennaiActor Ajith Kumar has been hospitalised in Chennai after his return from New Delhi. The actor suffered a minor injury at the Chennai airport on Tuesday night."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/now-you-see-me-now-you-dont-trailer-jesse-eisenberg-returns-with-his-horsemen-isla-fisher-woody-harrelson-dave-franco-2717437-2025-04-30",
      "headline": "Now You See Me 3 trailer: Jesse Eisenberg returns with his Horsemen for another heistThe 'Now You See Me 3' trailer has been released, reuniting the original cast with some new additions. Fans are in for a thrilling ride as the Four Horsemen take on a new heist."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/emraan-hashmi-2717440-2025-04-30",
      "headline": "It's a high-risk profession: Emraan Hashmi on emotional toll of playing BSF jawanIn an exclusive interview with India Today, Emraan Hashmi shared his experience of preparing for the role of a BSF officer in 'Ground Zero'. The actor talked about the physical and emotional challenges he faced during the filming"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/costao-movie-review-nawazuddin-siddiqui-holds-half-baked-film-about-unsung-hero-2717439-2025-04-30",
      "headline": "Costao movie review: Nawazuddin Siddiqui holds half-baked film about unsung heroReleased-Wed Apr 30, 2025In 'Costao', Nawazuddin Siddiqui plays an honest customs officer who is caught in the web of power and politics and is robbed of eight years of life after being accused of murder. While the actor performs fabulously, the story doesn't hold on its own despite being inspired by a heroic real-life incident. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/mouni-roy-on-botched-surgery-claims-people-are-writing-rubbish-vicious-things-2717332-2025-04-30",
      "headline": "Mouni Roy on botched surgery claims: People are writing rubbish, vicious thingsActor Mouni Roy recently responded to trolls who accused her of having cosmetic surgery, saying she feels sorry for them.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/content-creator-misha-agrawal-suicide-sister-she-felt-worthless-when-followers-fell-2717324-2025-04-30",
      "headline": "Content creator Misha Agrawal died by suicide, reveals sisterContent creator Misha Agrawal died by suicide just before her 25th birthday, her sister revealed. She shared that Misha had been under immense pressure due to decline in her social media followers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/apoorva-mukhija-says-parents-lost-respect-in-a-second-i-put-them-through-that-2717320-2025-04-30",
      "headline": "Apoorva Mukhija says parents 'lost respect in a second': I put them through thatApoorva Mukhija became emotional in a promo for her interview with We Are Yuvaa, discussing the backlash from the India's Got Latent controversy. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-shuts-airspace-pakistan-aircraft-airlines-military-flights-blocked-entry-pahalgam-terror-attack-kashmir-2717715-2025-04-30",
      "headline": "India shuts airspace for Pak-run flights, military aircraft after Pahalgam attackIndia on Wednesday issued a notice restricting its airspace to all aircraft registered, operated, or leased by Pakistan, including commercial airlines and military flights."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pak-pm-seeks-us-help-urging-india-dial-down-pahalgam-attack-rhetoric-2717733-2025-04-30",
      "headline": "Pak PM seeks US's help in urging India to 'dial down Pahalgam attack rhetoric'Pakistan Prime Minister Shehbaz Sharif on Wednesday accused India of engaging in \"escalatory and provocative behaviour\" during a phone call with US Secretary of State Marco Rubio."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hania-aamir-mahira-khan-pak-actors-instagram-disabled-in-india-2717680-2025-04-30",
      "headline": "Many Pak actors' Instagram blocked in India, Hania Aamir among themOther Pakistani celebrities whose Instagram accounts have been disabled in India are Ali Zafar, Sanam Saeed, Bilal Abbas, Iqra Aziz, Imran Abbas and Sajal Aly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-pbks-chennai-playoffs-race-chahal-hatrick-shreyas-2717725-2025-04-30",
      "headline": "Hapless CSK first team out of playoffs race after home humbling by PBKSIPL 2025, CSK vs PBKS: Chennai Super Kings became the first team to be eliminated from the playoffs race. Despite posting 190 on the board, the five-time champions were hammered by Punjab Kings in a must-win game in Chennai on Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-diplomats-meet-afghanistan-taliban-kabul-takes-them-on-side-before-military-offensive-on-pakistan-2717428-2025-04-30",
      "headline": "India takes Taliban on its side, pushes Pak into corner after PahalgamAs Pakistan is scrambling to shield itself diplomatically and militarily, India has quietly reached out to Kabul, Islamabad's worst friend-turned-foe. With this smart tactical move, India further cornered Pakistan after the Pahalgam terror attack. The Taliban have condemned the dastardly terror attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/caste-census-to-be-included-in-national-census-announces-union-minister-ashwini-vaishnaw-2717516-2025-04-30",
      "headline": "Caste census to be included in population survey: Cabinet's big decisionWhile announcing the big Cabinet decision, Vaishnaw trained guns on the Congress, saying the party always opposed the caste census."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/fire-delhi-market-ina-tenders-rushed-casualties-2717700-2025-04-30",
      "headline": "Massive fire at Delhi's popular Dilli Haat, many shops likely damagedAt least 13 fire tenders were rushed to the spot after the fire department received a distress call at around 8:55 pm, officials said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistani-in-india-for-17-years-among-those-sent-back-had-aadhaar-voted-too-osama-pahalgam-heres-what-2717510-2025-04-30",
      "headline": "Voted, studied in India, says Pakistan's Osama, sent back after 17 yearsOf the around 900 Pakistanis sent back by India after the Pahalgam massacre, some are said to have been here for five decades. Osama, originally from the twin cities of Islamabad-Rawalpindi, said he was in India for 17 years and even voted in Indian elections."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/lashkar-chief-hafiz-saeed-residence-pakistan-posh-locality-lahore-pahalgam-terror-attack-2717464-2025-04-30",
      "headline": "How Hafiz Saeed's hideout is different from that of bin Laden, Masood AzharSatellite images and footage exclusively accessed by India Today show the expansive compound where Lashkar chief Hafiz Saeed resides is situated in a posh locality in Pakistan's second-largest city."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistani-senator-palwasha-zai-khan-brick-new-babri-mosque-in-ayodhya-2717589-2025-04-30",
      "headline": "First brick of Babri mosque in Ayodhya will be laid by Pak soldiers: SenatorA video of Senator Palwasha Khan's inflammatory speech in Pakistan's Upper House has gone viral amid tensions between the two countries over the Pahalgam terror attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-victim-shubham-dwivedi-wife-he-would-have-said-i-love-you-2717650-2025-04-30",
      "headline": "Everything ended in a second: Pahalgam attack victim's wife recounts horrorAishanya, wife of Kanpur resident Shubham Dwivedi who was killed in the Pahalgam terror attack, shared what really happened in the Baisaran meadow on April 22."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-blusmart-hard-brake-is-heartbreak-for-the-urban-indian-commuter-2717478-2025-04-30",
      "headline": "Why BluSmart hard-brake is heartbreak for the urban Indian commuterIts sudden exit leaves riders looking for clean and reliable cabs with fewer choices and poses sobering questions for our EV mobility policymakers"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/what-indias-booming-used-luxury-car-market-says-about-the-aspirational-class-2717581-2025-04-30",
      "headline": "What India's booming used luxury car market says about the aspirational classA report by GlobeNewswire states that the Indian used luxury car market size, aided by increasing disposable incomes, is projected to grow at a CAGR of 16.30% between 2024 and 2032. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhis-offer-caste-census-population-survey-government-big-decision-2717627-2025-04-30",
      "headline": "In welcoming caste census, Rahul Gandhi takes aim at 50% cap on reservationFollowing the government's decision to include the caste census in the next national census, Rahul Gandhi said that Prime Minister Narendra Modi-led government adopted the Congress party's vision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bilawal-bhutto-blood-will-flow-remark-it-just-articulation-peoples-feelings-pahalgam-attack-2717604-2025-04-30",
      "headline": "Just communicating people's feelings: Bilawal Bhutto on 'blood will flow' remarkBiwala Bhutto-Zardari had said \"either our water or their blood will flow through it\", after India suspended the 1960 Indus Waters Treaty. In an interview with the BBC, the former Pakistan Minister said he was only articulating what the people of Pakistan felt. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistan-cancels-all-flights-flying-to-and-from-pok-citing-security-reasons-2717583-2025-04-30",
      "headline": "Pakistan cancels all flights flying over PoK area, security reasons cited: ReportsPakistan International Airlines has cancelled all acrriers flying to and from Gilgit, Skardu and other northern areas in Pakistan-occupied Kashmir due to security reasons. This comes in the aftermath of rising tensions over Pahalgam terror attacks. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakisitan-panic-fear-bunker-hide-radar-system-pahalgam-terror-attacks-pm-modi-was-shehbaz-sharif-asim-munir-2717076-2025-04-30",
      "headline": "Pakistan turns panicistanIndia's display of resolve after the Pahalgam terror attacks in which 26 people were killed has spread panic among Pakistan's military and civilian authorities. The panic mode is on full display as Islamabad scurries officials to several world capitals, moves terrorists nourished by it into bunkers, pleads for a neutral probe and rushes forces to the border with India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/indian-students-visa-arrested-us-scamming-elderly-east-west-university-chicago-senior-citizen-2717603-2025-04-30",
      "headline": "Indian students held in US, duped elderly of gold as fake govt agentsTwo Indian students have been arrested for allegedly posing as government agents and extorting gold and money from an elderly individual. The duo, who studied at a private university in Chicago, also threatened the victim multiple times."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-warns-pakistan-ceasefire-violations-line-of-control-international-border-2717555-2025-04-30",
      "headline": "India warns Pakistan against ceasefire violations along LoC during talks over hotlineThe Director Generals of Military Operations of India and Pakistan had a hotline conversation on Tuesday to address unprovoked ceasefire violations by the Pakistan Army."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/interactive/immersive/history-of-terrorism-in-kashmir-part-3/???#google_vignette",
      "headline": "When Kashmir turned crimson with blood of PanditsIn part 3 of our series on the history of terror in Kashmir, we revisit the winter of 1989, when the blood of Kashmiris flowed through the Valley, leading to the biggest exodus in Independent India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/met-gala-2025-shah-rukh-khan-kiara-advani-diljit-dosanjh-indian-fans-expect-this-year-isha-ambani-2717551-2025-04-30",
      "headline": "Met Gala 2025: What can Indian fans expect this yearMet Gala 2025 is just around the corner, and fans are quite excited about the same. With several prominent names from the Indian circuit, including Shah Rukh Khan, Kiara Advani, and more on the list, this year's fashionable event is shaping up to be a glamorous global affair.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/chandrayaan-3/story/chandrayaan-3-makes-big-discovery-on-moons-shiv-shakti-point-2717566-2025-04-30",
      "headline": "Chandrayaan-3 makes big discovery on Moon's Shiv Shakti PointThe findings reinforce the Shiv Shakti Point's value as a site for sampling primitive mantle materials."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/india-today-tracks-hafiz-saeeds-safe-haven-in-lahore-2717350-2025-04-30",
      "headline": "Exclusive video of India's most wanted Hafiz Saeed's top-security Lahore hideoutIndia Today has accessed satellite pictures and videos that show how terror mastermind Hafeez Saeed is living a comfortable life in a upscale Lahore neighbourhood under tight security by the Pakistani government."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pakistan-mobilises-army-along-border-amid-indian-retaliation-fears-after-pahalgam-attack-2717517-2025-04-30",
      "headline": "Pakistan scrambles troops along border fearing military action by IndiaThis comes amid repeated ceasefire violations by the Pakistani Army along the Line of Control (LoC) and the international border in Jammu and Kashmir over the last six days."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-aaron-finch-wants-ms-dhoni-to-return-in-ipl-2026-2717741-2025-05-01",
      "headline": "Aaron Finch brushes off MS Dhoni's retirement talks, backs him to return in 2026Former Australia cricketer Aaron Finch has backed MS Dhoni to return for another season of the Indian Premier League after Chennai Super Kings (CSK) became the first team to get knocked out of IPL 2025, following four-wicket loss to Punjab Kings (PBKS)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-pbks-ms-dhoni-blames-fielding-more-catches-playoffs-race-2717736-2025-05-01",
      "headline": "MS Dhoni blames fielding lapses as CSK crash out of playoffs race after PBKS lossMS Dhoni admitted that Chennai Super Kings lacked sharpness in the field, and costly dropped catches combined with inconsistent batting proved decisive in their loss to PBKS — confirming their exit from IPL 2025 playoffs race."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-pbks-chennai-playoffs-race-chahal-hatrick-shreyas-2717725-2025-04-30",
      "headline": "Hapless CSK first team out of playoffs race after home humbling by PBKSIPL 2025, CSK vs PBKS: Chennai Super Kings became the first team to be eliminated from the playoffs race. Despite posting 190 on the board, the five-time champions were hammered by Punjab Kings in a must-win game in Chennai on Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-mi-sanju-samson-injury-will-not-rush-rahul-dravid-2717720-2025-04-30",
      "headline": "RR won't rush Sanju Samson's injury: Rahul Dravid on availability vs MIIPL 2025: Sanju Samson's fitness remains a major concern for Rajasthan Royals, as head coach Rahul Dravid confirms the team will not rush their captain's return, even with IPL 2025 playoff hopes hanging in the balance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-pbks-yuzvendra-chahal-meme-reason-hattrick-celebration-2717705-2025-04-30",
      "headline": "Yuzvendra Chahal reveals meme-inspired reason for hat-trick pose vs CSKIPL 2025: Yuzvendra Chahal drew inspiration from his own viral 2019 meme to celebrate a stunning second IPL hat-trick, which flipped the script for Punjab Kings in their high-stakes clash against Chennai Super Kings at Chepauk."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-pbks-sam-curran-fifty-celebration-highest-score-2717688-2025-04-30",
      "headline": "IPL 2025: Sam Curran hits CSK's top IPL 2025 score, celebrates in fiery styleSam Curran's powerful 88 gave CSK a fighting total and brief hope in a critical clash against Punjab Kings, but Yuzvendra Chahal's late hat-trick brought yet another late-innings collapse for the five-time champions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-yuzvendra-chahal-takes-second-ipl-hat-trick-2717684-2025-04-30",
      "headline": "CSK vs PBKS: Yuzvendra Chahal 3rd man to take multiple hat-tricks in IPL historyIndia and Punjab Kings' wrist spinner Yuzvendra Chahal took a hat trick against Chennai Super Kings (CSK) in Match 49 of the Indian Premier League 2025 (IPL 2025)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/looking-forward-to-coming-up-against-an-old-team-trent-boult-ahead-of-rr-clash-2717657-2025-04-30",
      "headline": "Looking forward to coming up against an old team: Trent Boult ahead of RR clashMumbai Indians (MI) fast bowler Trent Boult said that he's eagerly looking forward to playing against his old franchise Rajasthan Royals (RR) in the upcoming fixture. MI will take on RR in Match 50 of the Indian Premier League 2025 (IPL 2025) in Jaipur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-respond-to-rinku-singh-kuldeep-yadav-slap-controversy-2717637-2025-04-30",
      "headline": "IPL 2025: KKR respond to Rinku Singh, Kuldeep Yadav slap controversyKolkata Knight Riders (KKR) responded to Rinku Singh and Kuldeep Yadav slap controversy after the clip of the incident went viral and sparked strong reactions from the fans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-pbks-glenn-maxwell-ruled-out-fractured-finger-injury-2717625-2025-04-30",
      "headline": "IPL 2025: PBKS' Glenn Maxwell ruled out of CSK clash with fractured fingerGlenn Maxwell's injury setback added to Punjab Kings' troubles, as the Australian all-rounder misses the crucial CSK clash. Young Suryansh Shegde stepped in, while Dhoni's CSK stuck to their trusted playing XI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-csk-vs-pbks-retirement-question-danny-morrison-2717621-2025-04-30",
      "headline": "MS Dhoni stuns Danny Morrison with response to IPL retirement questionIPL 2025, CSK vs PBKS: MS Dhoni said he is not sure about his future in the Indian Premier League when he was asked by presented Danny Morrison if he would return to play next year.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-yuzvendra-chahal-takes-second-ipl-hat-trick-2717684-2025-04-30",
      "headline": "CSK vs PBKS: Yuzvendra Chahal 3rd man to take multiple hat-tricks in IPL historyIndia and Punjab Kings' wrist spinner Yuzvendra Chahal took a hat trick against Chennai Super Kings (CSK) in Match 49 of the Indian Premier League 2025 (IPL 2025)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/looking-forward-to-coming-up-against-an-old-team-trent-boult-ahead-of-rr-clash-2717657-2025-04-30",
      "headline": "Looking forward to coming up against an old team: Trent Boult ahead of RR clashMumbai Indians (MI) fast bowler Trent Boult said that he's eagerly looking forward to playing against his old franchise Rajasthan Royals (RR) in the upcoming fixture. MI will take on RR in Match 50 of the Indian Premier League 2025 (IPL 2025) in Jaipur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-respond-to-rinku-singh-kuldeep-yadav-slap-controversy-2717637-2025-04-30",
      "headline": "IPL 2025: KKR respond to Rinku Singh, Kuldeep Yadav slap controversyKolkata Knight Riders (KKR) responded to Rinku Singh and Kuldeep Yadav slap controversy after the clip of the incident went viral and sparked strong reactions from the fans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-pbks-glenn-maxwell-ruled-out-fractured-finger-injury-2717625-2025-04-30",
      "headline": "IPL 2025: PBKS' Glenn Maxwell ruled out of CSK clash with fractured fingerGlenn Maxwell's injury setback added to Punjab Kings' troubles, as the Australian all-rounder misses the crucial CSK clash. Young Suryansh Shegde stepped in, while Dhoni's CSK stuck to their trusted playing XI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-csk-vs-pbks-retirement-question-danny-morrison-2717621-2025-04-30",
      "headline": "MS Dhoni stuns Danny Morrison with response to IPL retirement questionIPL 2025, CSK vs PBKS: MS Dhoni said he is not sure about his future in the Indian Premier League when he was asked by presented Danny Morrison if he would return to play next year.  "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}