{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/theobroma-sold-chryscapital-buyer-two-sisters-how-it-started-mumbai-bakery-cafe-cake-brownie-2756217-2025-07-15",
      "headline": "The Theobroma story: How 2 sisters turned a cafe into 225-store pan-India chainPrivate equity firm ChrysCapital has struck a sweet deal to acquire a 90% stake in Theobroma Foods for Rs 2,410 crore. The bakery chain, started by two sisters in Mumbai, has grown into a 225-store brand loved for its brownies and cakes. Read on to know more about the Mumbai-based bakery chain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mtnl-misses-rs-8585-crore-payments-owes-7-public-sector-banks-2756159-2025-07-15",
      "headline": "MTNL misses Rs 8,585 crore payments, owes 7 public sector banksIn a filing on Tuesday, MTNL confirmed that it has defaulted on both principal and interest payments to a group of lenders, which include some of India's biggest state-owned banks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-317-points-higher-nifty-above-25100-hcltech-down-3-2756116-2025-07-15",
      "headline": "Sensex ends 317 points higher, Nifty above 25,100; HCLTech down 3%The S&P BSE Sensex added 317.45 points to end at 82,570.91, while the NSE Nifty50 was up 113.50 points to close at 25,195.80. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/should-you-subscribe-anthem-biosciences-ipo-listing-gains-gmp-allotment-date-review-2756093-2025-07-15",
      "headline": "Anthem Biosciences IPO fully booked: Should you subscribe? Check listing gainsThe IPO opened for subscription on July 14, aims to raise Rs 3,395 crore through a complete offer for sale (OFS) of 5.96 crore equity shares."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-rs-12-crore-did-not-make-this-man-happy-investment-advisor-explains-2756072-2025-07-15",
      "headline": "Why Rs 12 crore didn't make this man happy? Investment advisor explainsWhile money matters, it should never cost you your health, peace of mind, or precious family time. True wealth is living well, not just stacking numbers in a bank account, says an investment advisor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-zerodhas-nithin-kamath-wants-short-selling-made-easy-in-india-2756030-2025-07-15",
      "headline": "Why Zerodha's Nithin Kamath wants short selling made easy in IndiaIf someone wants to short a stock today, they mostly do it through futures or options. But there's a catch, there are only 224 stocks in India that have futures and options. So if a bad company is not on that list, no one can short it easily."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/theobroma-stake-sale-90-percent-chryscapital-accquisition-kainaz-messman-harchandrai-tina-messman-wykes-report-2755967-2025-07-15",
      "headline": "Theobroma to be sold, Rs 2,410-crore sweet deal baked by ChrysCapital: ReportFounded in 2004 by sisters Kainaz Messman Harchandrai and Tina Messman Wykes, Theobroma began with a single outlet at Cusrow Baug on Mumbai's Colaba Causeway. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/claiming-fake-itr-refunds-here-is-what-could-happen-2755957-2025-07-15",
      "headline": "Claiming fake ITR refunds? Here's what could happenTo give honest taxpayers a chance to fix their mistakes, the department had earlier asked people to revise their returns if they had claimed any wrong deductions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filing-itr-2-or-itr-3-check-these-common-mistakes-and-tips-to-avoid-them-2755920-2025-07-15",
      "headline": "Filing ITR-2 or ITR-3? Check these common mistakes and tips to avoid themUsing the Excel utility for ITR-2 or ITR-3 seems easy, but it's easy to get stuck if you're not careful. One wrong entry can throw your entire tax calculation off. Here's a handy guide to avoid common slip-ups."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/hcltech-share-price-it-stock-q1-results-down-4-percent-why-reason-guidance-2755904-2025-07-15",
      "headline": "Explained: Why HCLTech shares are down 4% todayOver the past few days, HCLTech has been under pressure. The stock has declined 7.9% in the last five trading sessions, 9.58% in the past month, and over 14.6% in the past six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-mumbai-showroom-opening-today-electric-cars-model-y-ev-suv-cost-in-india-rs-60-lakh-2755893-2025-07-15",
      "headline": "Tesla showroom now in Mumbai. Price list of Model Y EVs in India revealed Live UpdatesThe Mumbai showroom will serve as Tesla's main display and customer experience centre, offering visitors a chance to view the vehicles up close and understand Tesla's technology."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-119-points-higher-nifty-above-25100-tata-motors-up-1-percent-2755865-2025-07-15",
      "headline": "Sensex opens 119 points higher, Nifty above 25,100; Tata Motors up 1%The S&P BSE Sensex was up 176.33 points to 82,429.79, while the NSE Nifty50 gained 63.50 points to 25,145.80 as of 9:29 am. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/toronto-rapper-stabbed-in-london-hours-after-attending-drakes-uk-tour-show-glbs-2756360-2025-07-16",
      "headline": "Toronto rapper stabbed in London hours after attending Drake's UK tour showToronto rapper Top5, recently cleared of murder charges, was stabbed in North London after attending a Drake concert. Police say his injuries are not life-threatening; no arrests have been made.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kathy-bates-makes-emmy-history-with-matlock-drama-nomination-glbs-2756350-2025-07-16",
      "headline": "Kathy Bates makes Emmy history with 'Matlock' drama nominationNoah Wyle and Adam Scott earned their first Best Actor Emmy nominations. Kathy Bates made history with Matlock. The Emmy Awards will air live on September 14 from Los Angeles.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kiara-advani-sidharth-malhotra-blessed-with-baby-girl-2756276-2025-07-15",
      "headline": "Kiara Advani-Sidharth Malhotra welcome a baby girlKiara Advani and Sidharth Malhotra welcomed their first child today. The couple was blessed with a baby girl. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/2025-emmy-nominations-severance-leads-27-followed-the-penguin-the-white-lotus-2756297-2025-07-15",
      "headline": "Emmy nominations 2025: Severance leads with 27, followed by Penguin, White LotusThe 2025 Emmy nominations have been announced. Adam Scott-starrer 'Severance' leads with 27 nominations, followed by 'The Penguin' with 24 and 'The White Lotus' and 'The Studio' with 23 each."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/do-bigha-zamin-4k-restoration-venice-film-festival-2025-bimal-roy-2756232-2025-07-15",
      "headline": "Bimal Roy's Do Bigha Zamin to be screened in 4K at Venice Film Festival 2025The Venice Film Festival 2025 will screen a restored 4K version of Bimal Roy's 'Do Bigha Zamin'. This screening is significant as it highlights the film's impact on Indian cinema and the restoration effort."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dominic-mclaughlin-meet-hbo-harry-potter-actor-2756110-2025-07-15",
      "headline": "Dominic McLaughlin: Meet the actor behind HBO's Harry PotterProduction has officially commenced on HBO's Harry Potter television series. HBO revealed the first glimpse of young Harry, portrayed by Dominic McLaughlin. Here's all you need to know about him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/emmy-awards-2025-nominations-reality-and-talk-show-categories-announced-ahead-of-full-list-2756236-2025-07-15",
      "headline": "Emmys 2025 nominations: Reality, talk show categories announced ahead of full listThe nominations for two categories of the 2025 Emmy Awards have been unveiled, with CBS Mornings making the official announcement. Take a look at the nominations below."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/netflix-mandala-murders-trailer-vaani-kapoor-mythological-crime-thriller-yrf-2756228-2025-07-15",
      "headline": "Mandala Murders trailer: Vaani Kapoor as detective is up against crime and sorceryActor Vaani Kapoor plays investigating officer Rea Thomas in Yash Raj Films' mythological-crime-thriller—'Mandala Murders'. The upcoming Netflix show blends crime investigation with mystical elements."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/su-from-so-trailer-released-supernatural-comedy-mangaluru-village-2756213-2025-07-15",
      "headline": "Su From So trailer: Raj B Shetty's supernatural comedy promises a laugh riot'Su From So' is a Kannada supernatural comedy drama film written and directed by JP Thuminad, who also stars in the film featuring several known faces from films like 'Kantara' and 'Sapta Sagaradaache Ello'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/prime-video-rangeen-vineet-kumar-singh-comedy-series-premiere-july-25-love-betrayal-2756141-2025-07-15",
      "headline": "Rangeen first look: Vineet Kumar Singh's new show to explore love and betrayalPrime Video announced the release of its upcoming comedy-drama series-'Rangeen', featuring Vineet Kumar Singh and Rajshri Deshpande. The show is backed by Kabir Khan and Rajan Kapoor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/producer-naga-vamsi-confirms-jr-ntr-has-full-role-in-war-2-not-a-cameo-2756196-2025-07-15",
      "headline": "Producer Naga Vamsi confirms Jr NTR has full role in War 2, not a cameoProducer Naga Vamsi clarified fan speculation about Jr NTR's screen time in 'War 2', confirming the actor has a full-length role alongside Hrithik Roshan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/best-bts-albums-ranked-map-of-the-soul-be-love-yourself-jungkook-v-2756174-2025-07-15",
      "headline": "The best BTS albums of all time, rankedAs BTS memebers Jin, SUGA, J-Hope, RM, Jimin, V, and Jungkook gear up for a historic comeback, now is the perfect time to relive the music that built their legacy. Here are BTS albums ranked. Read more to see if your favourite pick made the list.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/aap-jaisa-koi-exposes-patriarchy-of-permission-because-who-are-you-to-allow-me-2756164-2025-07-15",
      "headline": "Aap Jaisa Koi exposes patriarchy of permission because who are you to allow me?In that one question, 'Aap Jaisa Koi' cuts through the soft-spoken patriarchy that hides behind smiles, affection, and so-called respect. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ap-dhillon-and-tara-sutaria-set-to-collaborate-for-thodi-si-daaru-song-watch-teaser-2756006-2025-07-15",
      "headline": "AP Dhillon and Tara Sutaria set to collaborate for Thodi Si Daaru song. Watch teaserPunjabi singer AP Dhillon and actor Tara Sutaria will be seen in the upcoming song 'Thodi Si Daaru'. Fans expressed excitement on the song's teaser, which was released on social media on Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/vikrant-massey-exits-don-3-new-antagonist-casting-underway-report-2756068-2025-07-15",
      "headline": "Vikrant Massey exits Don 3, makers begin search for new villain: ReportActor Vikrant Massey has reportedly exited the much-anticipated film 'Don 3.' He was playing the role of an antagonist. Aditya Roy Kapur and Vijay Deverakonda are likely in talks with the makers for replacement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/announcement-of-jr-ntr-trivikram-film-to-be-bigger-than-ramayana-producer-2756061-2025-07-15",
      "headline": "Announcement of Jr NTR–Trivikram film to be bigger than Ramayana: ProducerAs fans await updates on Jr NTR and Trivikram's mythological film, producer Naga Vamsi reveals that the announcement is being planned on a scale grander than the recently unveiled 'Ramayana' glimpse."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/paatal-lok-panchayat-aasif-khan-heart-attack-recovery-kokilaben-hospital-mumbai-health-update-2756151-2025-07-15",
      "headline": "Panchayat's Aasif Khan suffers heart attack, shares hospital picActor Aasif Khan suffered a heart attack and was admitted to Kokilaben Hospital Mumbai. The actor shared a heartfelt message on social media after his recovery.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/singer-arijit-singh-directorial-debut-pan-india-jungle-adventure-film-2756123-2025-07-15",
      "headline": "Arijit Singh turns director, to direct pan-India jungle adventure filmSinger Arijit Singh will be directing a jungle adventure film. The casting and pre-production work for the pan-Indian film is underway. Singh has also written the film. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/beyonce-unreleased-music-stolen-from-car-atlanta-cowboy-carter-tour-2756055-2025-07-15",
      "headline": "Unreleased Beyonce songs stolen from car during Atlanta Cowboy Carter tourPop star Beyonce's unreleased music was stolen from her choreographer and dancer's car. The incident happened 48 hours before her Atlanta concert."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/zelenskyy-shouldnt-target-moscow-trump-takes-u-turn-over-deep-strike-claim-glbs-2756343-2025-07-16",
      "headline": "Zelenskyy shouldn't target Moscow: Trump takes U-turn over deep strike claimTrump has also been putting pressure on Russia to end its war on Ukraine and issued a warning to Putin, threatening \"severe\" tariffs if a ceasefire is not reached within the next 50 days.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-india-to-restore-some-international-flights-paused-after-ahmedabad-crash-from-august-1-2756271-2025-07-15",
      "headline": "Air India to restore some international flights, paused after crash, from August 1Air India had paused flight operations following the June 12 plane crash in Ahmedabad, killing 260 people. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/congress-rahul-gandhi-jaishankar-xi-jinping-meeting-china-pakistan-operation-sindoor-2756146-2025-07-15",
      "headline": "He's running a full-blown circus: Rahul Gandhi slams S Jaishankar after Xi meetThe Congress took aim at S Jaishankar over his meeting with Xi Jinping, pointing out how China provided iron-clad support to Pakistan during Operation Sindoor."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/college-student-alleges-rape-by-lecturers-and-their-friend-in-bengaluru-three-arrested-2756051-2025-07-15",
      "headline": "Student raped by 2 lecturers, their friend in Bengaluru; blackmailed with videoThree men, including two lecturers at a private college in Moodabidri, Dakshina Kannada district, were arrested in Bengaluru for allegedly raping a student multiple times separately. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/classroom-kerala-backbenchers-schools-sthanarthi-sreekuttan-try-new-sitting-format-tamil-nadu-kerala-punjab-2756131-2025-07-15",
      "headline": "Classrooms without backbenchers: With new sitting format, schools stand outSchools in Kerala, Tamil Nadu, West Bengal, and Punjab have begun removing the concept of backbenchers by rearranging classrooms into U, or semicircular, seating. The shift was inspired by a scene in a Malayalam movie, Sthanarthi Sreekuttan, where a student suggests equal seating for better inclusion."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/nato-chief-warns-india-china-brazil-of-100-secondary-sanctions-over-russia-trade-glbs-2756349-2025-07-16",
      "headline": "100% secondary sanctions for Russia trade: Nato warns India, China, BrazilMark Rutte warned the leaders of China, India, and Brazil that if they continued trading with Russia and buying its oil and gas, he would impose 100 percent secondary sanctions. He urged leaders to call Russian President Vladimir Putin in order to push him to seriously join peace talks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/shubhanshu-shukla-news-return-reentry-water-vs-land-splashdown-analysis-spacex-dragon-rakesh-sharma-2756189-2025-07-15",
      "headline": "Why Shux splashed down in the sea, but Rakesh Sharma touched down on landSplashdowns during the re-entry of astronauts from space may seem like the obvious choice for a gentle return to Earth. But the decision between water and landings goes far deeper than just comfort. This is why Group Captain Shubhanshu Shukla splashed down while Wing Commander Rakesh Sharma landed on terra firma 41 years ago."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/was-air-india-crash-mechanical-accidental-or-faqs-answered-2756089-2025-07-15",
      "headline": "Was Air India crash mechanical, accidental or…? FAQs answeredThe preliminary crash probe report has raised critical questions around how fuel supply to the engines got cut off. INDIA TODAY looks at the scenarios\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/astronaut-shubhanshu-shukla-splashes-down-off-california-with-ax-4-crew-after-historic-space-mission-2756098-2025-07-15",
      "headline": "Welcome home, Shux! Indian astronaut returns after record-setting space missionHis participation in this largely commercial and internationally collaborative mission is regarded as a major leap forward in India's human spaceflight journey and a stepping stone to the country's upcoming Gaganyaan mission."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/reconsider-travel-to-iran-indian-embassy-sounds-alarm-amid-escalating-middle-east-conflict-glbs-2756357-2025-07-16",
      "headline": "Reconsider travel to Iran: Indian embassy sounds alarm amid escalating conflictIn a statement, the embassy cited \"security-related developments over the past several weeks\" and advised citizens to \"carefully consider the evolving situation before undertaking non-essential travel to Iran.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/india-urges-dhaka-to-reconsider-satyajit-rays-home-demolition-offers-repair-help-2756273-2025-07-15",
      "headline": "India urges Dhaka to reconsider Satyajit Ray's home demolition, offers repair helpThe house was built by Satyajit Ray's grandfather, Upendra Kishore Ray Chowdhury, who was also the father of celebrated poet Sukumar Ray. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kiara-advani-sidharth-malhotra-blessed-with-baby-girl-2756276-2025-07-15",
      "headline": "Kiara Advani-Sidharth Malhotra welcome a baby girlKiara Advani and Sidharth Malhotra welcomed their first child today. The couple was blessed with a baby girl. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/aap-jaisa-koi-exposes-patriarchy-of-permission-because-who-are-you-to-allow-me-2756164-2025-07-15",
      "headline": "Aap Jaisa Koi exposes patriarchy of permission because who are you to allow me?In that one question, 'Aap Jaisa Koi' cuts through the soft-spoken patriarchy that hides behind smiles, affection, and so-called respect. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-federal-judge-blocks-trump-admin-from-using-travel-ban-to-bar-refugees-glbs-2756351-2025-07-16",
      "headline": "US judge blocks Trump admin from using travel ban to bar refugeesA US judge ruled Trump's travel ban can't block approved refugees, citing legal protections for asylum seekers. Refugee processing must resume for those previously cleared but denied entry."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/kerala/story/kollam-woman-toddler-daughter-dowry-abuse-murder-suicide-case-against-husband-family-2755884-2025-07-15",
      "headline": "Head shaved, tortured for dowry: Kerala woman in UAE kills baby, dies by suicideFollowing the death of a woman and her infant daughter in Sharjah, police in Kollam, Kerala, have registered a case against her husband, and his father and sister. The FIR, based on the complaint by the woman's mother, alleges domestic abuse and dowry harassment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-shubman-gill-virat-kohli-obsession-lords-test-2756225-2025-07-15",
      "headline": "Aggression not for everyone: Gill needs his own voice, not mimic KohliENG vs IND: Is Shubman Gill unintentionally trying to do what Virat Kohli does? Since his appointment as Test skipper, some of his actions have been eerily similar to the former captain, and this could be a possible concern in the long run. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/comparisons/story/tesla-model-y-vs-kia-ev6-vs-hyundai-ioniq-5-range-price-performance-compared-2756166-2025-07-15",
      "headline": "Tesla Model Y vs Kia EV6 vs Hyundai Ioniq 5 vs BYD Sealion 7 comparedTesla has launched the Model Y in India, entering a competitive premium EV segment alongside rivals like the Kia EV6, Hyundai Ioniq 5, and BYD Sealion 7. Here's how they compare.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/white-house-briefly-locked-down-by-secret-service-over-thrown-object-scare-glbs-2756358-2025-07-16",
      "headline": "White House briefly locked down by Secret Service over thrown object scareThe US Secret Service locked down the White House North Lawn after an unidentified object, possibly a phone, was thrown over the fence, halting press activities and prompting heightened security.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/beyond-wrinkles-how-to-spot-lesser-known-signs-of-skin-ageing-2755493-2025-07-14",
      "headline": "Beyond Wrinkles: How to spot lesser-known signs of skin ageingDr Deepak Jakhar, director and consultant dermatologist, Dermosphere Clinic, New Delhi, explains the early signs.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/why-donald-trump-not-releasing-jeffrey-epstein-files-us-politics-obama-democrats-maga-ghislaine-maxwell-pam-bondi-elon-musk-2756040-2025-07-15",
      "headline": "Why Trump is withholding Epstein files he promised to releaseUS President Donald Trump promised to release the Epstein files during his campaign. It is reported that papers related to financier and child sex offender Jeffrey Epstein would nail the high and mighty in the US. Tesla boss Elon Musk attacked Trump for reneging on his promise. So why exactly isn't Trump releasing the Epstein files?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/vikrant-massey-exits-don-3-new-antagonist-casting-underway-report-2756068-2025-07-15",
      "headline": "Vikrant Massey exits Don 3, makers begin search for new villain: ReportActor Vikrant Massey has reportedly exited the much-anticipated film 'Don 3.' He was playing the role of an antagonist. Aditya Roy Kapur and Vijay Deverakonda are likely in talks with the makers for replacement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-pushkar-dhami-ordered-operation-kaalnemi-during-kanwar-yatra-2755951-2025-07-15",
      "headline": "Why Pushkar Dhami ordered 'Operation Kaalnemi' during Kanwar YatraWhile the aim is to act against religious imposters, the pattern of special measures during the yatra suggests a recurring anxiety about 'outsiders' within the larger religious space\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/prada-team-visits-kolhapur-meet-local-artisans-after-kolhapuri-sandals-row-2756336-2025-07-16",
      "headline": "Prada team visits Kolhapur, meets local artisans after Kolhapuri sandals rowThe visit comes after Prada faced criticism for allegedly showcasing Kolhapuri-style sandals in its Spring/Summer 2026 menswear show in Milan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/apple-signs-500-million-rare-earth-deal-with-pentagon-backed-mp-materials-glbs-2756355-2025-07-16",
      "headline": "Apple signs $500 million rare Earth deal With Pentagon-backed MP MaterialsApple has signed a $500 million deal with MP Materials for China-free rare earth magnets, strengthening US supply chains after Chinese export curbs and boosting Pentagon-backed MP's market position.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/toronto-rapper-stabbed-in-london-hours-after-attending-drakes-uk-tour-show-glbs-2756360-2025-07-16",
      "headline": "Toronto rapper stabbed in London hours after attending Drake's UK tour showToronto rapper Top5, recently cleared of murder charges, was stabbed in North London after attending a Drake concert. Police say his injuries are not life-threatening; no arrests have been made.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kiara-advani-sidharth-malhotra-blessed-with-baby-girl-2756276-2025-07-15",
      "headline": "Kiara Advani-Sidharth Malhotra welcome a baby girlKiara Advani and Sidharth Malhotra welcomed their first child today. The couple was blessed with a baby girl. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/do-bigha-zamin-4k-restoration-venice-film-festival-2025-bimal-roy-2756232-2025-07-15",
      "headline": "Bimal Roy's Do Bigha Zamin to be screened in 4K at Venice Film Festival 2025The Venice Film Festival 2025 will screen a restored 4K version of Bimal Roy's 'Do Bigha Zamin'. This screening is significant as it highlights the film's impact on Indian cinema and the restoration effort."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/emmy-awards-2025-nominations-reality-and-talk-show-categories-announced-ahead-of-full-list-2756236-2025-07-15",
      "headline": "Emmys 2025 nominations: Reality, talk show categories announced ahead of full listThe nominations for two categories of the 2025 Emmy Awards have been unveiled, with CBS Mornings making the official announcement. Take a look at the nominations below."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harmanpreet-kaur-shree-charani-england-women-vs-india-women-2756306-2025-07-15",
      "headline": "She has been outstanding: Harmanpreet impressed with 20-year-old DC spinnerENG-W vs IND-W: Harmanpreet Kaur heaped praise on left-arm spinner Shree Charani, who took 10 wickets in the T20Is on English soil and won the Player of the Series award. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/kevin-de-bruyne-napoli-unretire-diego-maradona-10-kit-2756301-2025-07-15",
      "headline": "De Bruyne to inherit Maradona's No.10? Napoli training photos suggest yesNapoli could unretire Diego Maradona's No.10 kit to give to Kevin de Bruyne. The Belgian was seen wearing a No.10 training kit ahead of their pre-season games. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sourav-ganguly-india-lords-test-england-vs-india-2756295-2025-07-15",
      "headline": "India should have chased 193: Ganguly disappointed after Lord's Test defeatENG vs IND: Former captain Sourav Ganguly was disappointed after India lost the Lord's Test by 22 runs, failing to chase down 193. Ravindra Jadeja's unbeaten 61 wasn't enough for India to taste victory on Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-jofra-archer-ashes-2025-tour-england-vs-australia-november-2025-2756287-2025-07-15",
      "headline": "Archer eyes Ashes 2025 tour: Will do everything to be on the plane in NovemberJofra Archer has made his intentions clear. He aims to be fit and cleared to compete without any hassles for the upcoming Ashes tour, later this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yash-dayal-sexual-exploitation-fir-allahabad-high-court-stays-arrest-2756261-2025-07-15",
      "headline": "Court stays arrest of cricketer Yash Dayal in alleged sexual exploitation caseAn FIR was registered on July 6 at the Indirapuram police station in Ghaziabad district under Section 69 of the BNS. Yash Dayal has been accused of sexually exploiting a woman on the pretext of marriage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/watch-bumrah-pant-and-gill-chat-with-idris-elba-at-king-charles-london-home-2756256-2025-07-15",
      "headline": "Watch: Bumrah, Pant and Gill chat with Idris Elba at King Charles' homeDuring the meeting with King Charles at his London home, some of the Indian cricketers got the chance to meet popular English actor, Idris Elba. The group were seen having a chat talking about the sport. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-jasprit-bumrah-workload-management-anil-kumble-2756255-2025-07-15",
      "headline": "Bumrah gets new workload management advice: Play last 2 Tests in England, rest laterEngland vs India: Jasprit Bumrah was initially scheduled to play only three of the five Tests in the Anderson–Tendulkar Trophy. However, with India trailing 1–2 after the Lord's thriller, former captain Anil Kumble has suggested that the pace spearhead should play the final two matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-shubman-gill-virat-kohli-obsession-lords-test-2756225-2025-07-15",
      "headline": "Aggression not for everyone: Gill needs his own voice, not mimic KohliENG vs IND: Is Shubman Gill unintentionally trying to do what Virat Kohli does? Since his appointment as Test skipper, some of his actions have been eerily similar to the former captain, and this could be a possible concern in the long run. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/27-all-out-cricket-west-indies-emergency-meeting-lara-lloyd-viv-richards-2756233-2025-07-15",
      "headline": "27 all-out triggers panic: West Indies board calls legends for crisis talksCricket West Indies (CWI) have hit the panic button as they have called for an emergency review meeting after the nightmare pink-ball Test in Jamaica where Australia ran riot to end the game in just two and a half days. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/watch-indian-cricket-teams-meet-king-charles-iii-in-london-day-after-lords-test-2756192-2025-07-15",
      "headline": "Watch: Indian cricket teams meet King Charles III in London day after Lord's TestKing Charles II met the Indian men's and women's teams at St James's Palace in London on Tuesday. The men's team lost the Lord's Test by 22 runs, while the women's team will take part in a three-match ODI series following their 3-2 triumph in the ODI series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-king-charles-shubman-gill-mohammed-siraj-lords-test-wicket-2756172-2025-07-15",
      "headline": "Unfortunate: How King Charles reacted to Mohammed Siraj's Lord's Test dismissalIndia captain Shubman Gill and vice-captain Rishabh Pant met King Charles III on Tuesday. The King praised India's spirited fight and spoke about Mohammed Siraj's dismissal in the Lord's Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-jasprit-bumrah-workload-management-anil-kumble-2756255-2025-07-15",
      "headline": "Bumrah gets new workload management advice: Play last 2 Tests in England, rest laterEngland vs India: Jasprit Bumrah was initially scheduled to play only three of the five Tests in the Anderson–Tendulkar Trophy. However, with India trailing 1–2 after the Lord's thriller, former captain Anil Kumble has suggested that the pace spearhead should play the final two matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-shubman-gill-virat-kohli-obsession-lords-test-2756225-2025-07-15",
      "headline": "Aggression not for everyone: Gill needs his own voice, not mimic KohliENG vs IND: Is Shubman Gill unintentionally trying to do what Virat Kohli does? Since his appointment as Test skipper, some of his actions have been eerily similar to the former captain, and this could be a possible concern in the long run. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/27-all-out-cricket-west-indies-emergency-meeting-lara-lloyd-viv-richards-2756233-2025-07-15",
      "headline": "27 all-out triggers panic: West Indies board calls legends for crisis talksCricket West Indies (CWI) have hit the panic button as they have called for an emergency review meeting after the nightmare pink-ball Test in Jamaica where Australia ran riot to end the game in just two and a half days. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/watch-indian-cricket-teams-meet-king-charles-iii-in-london-day-after-lords-test-2756192-2025-07-15",
      "headline": "Watch: Indian cricket teams meet King Charles III in London day after Lord's TestKing Charles II met the Indian men's and women's teams at St James's Palace in London on Tuesday. The men's team lost the Lord's Test by 22 runs, while the women's team will take part in a three-match ODI series following their 3-2 triumph in the ODI series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-king-charles-shubman-gill-mohammed-siraj-lords-test-wicket-2756172-2025-07-15",
      "headline": "Unfortunate: How King Charles reacted to Mohammed Siraj's Lord's Test dismissalIndia captain Shubman Gill and vice-captain Rishabh Pant met King Charles III on Tuesday. The King praised India's spirited fight and spoke about Mohammed Siraj's dismissal in the Lord's Test. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}