{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-p-b-balaji-jaguar-land-rover-new-ceo-2766412-2025-08-05",
      "headline": "Who is P B Balaji, Jaguar Land Rover's new CEO?The decision was confirmed in a stock exchange filing on August 4, 2025. Balaji's appointment marks a major shift, as he moves from a financial leadership role to the driver's seat of one of the world's most recognised car brands."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-today-investors-worried-trump-tariff-threat-sensex-nifty-fall-today-2766386-2025-08-05",
      "headline": "Sensex tumbles 400 points: Why is the stock market falling today?The S&P BSE Sensex was down 394.03 points to 80,614.50 at around 9:59 am, while the NSE Nifty50 fell 121.90 points to 24,600.85. Broader markets also mirrored the nervousness on Dalal Street, with mid- and small-cap indices under pressure.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/insurance-regulator-irdai-fines-policybazaar-multiple-violations-key-details-2766375-2025-08-05",
      "headline": "Why insurance regulator fined Policybazaar Rs 5 crore? All you need to knowThe IRDAI noted that various insurance products were promoted as \"top\" or \"best\" in a manner that appeared biased and lacked substantiation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-over-100-points-nifty-below-24700-indusind-bank-gains-2-2766359-2025-08-05",
      "headline": "Sensex, Nifty fall after Trump's fresh tariff threat over Russian oil importsThe S&P BSE Sensex fell 156.96 points to 80,861.76 around 9:23 am, while the NSE Nifty50 fell 30.80 points to trade at 24,691.95. Most of the broader market indices also mirror the weak sentiments on Dalal Street."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-ethanol-blended-petrol-clarification-safe-for-old-new-vehicles-2766355-2025-08-05",
      "headline": "Government's big remark as ethanol-blended petrol gets car owners fumingIn a post on X (formerly Twitter), the ministry responded to recent media reports questioning whether E20 fuel could damage older vehicles or degrade the driving experience. Citing multiple studies and expert assessments, it stated that E20 is both safe and beneficial."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/anil-ambani-ed-summons-delhi-loan-fraud-case-reliance-group-pmla-2766344-2025-08-05",
      "headline": "Anil Ambani at ED office for questioning in multiple fraud casesThe summons against Anil Ambani followed a massive crackdown by the ED last month, during which the agency searched 35 premises linked to some top executives of the Reliance Group. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/thousands-boeing-fighter-jet-workers-strike-after-rejecting-contract-offer-glbs-2766297-2025-08-05",
      "headline": "Thousands of Boeing fighter jet workers go on strike after rejecting contract offerOver 3,200 workers have walked off the job in what marks their first strike in nearly 30 years. The affected workers, primarily based in the St. Louis region, are responsible for assembling and maintaining military aircraft, including the F-15 fighter jet and various missile systems. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/after-mumbai-tesla-to-open-showroom-in-delhis-aerocity-on-august-11-2766180-2025-08-04",
      "headline": "After Mumbai, Tesla to open showroom in Delhi's Aerocity on August 11The Delhi showroom will be opened at Worldmark 3 in Aerocity for customers. Like the Mumbai showroom, this showroom is also expected to serve as a display and customer experience centre, offering visitors a chance to view the vehicles up close and understand Tesla's technology."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-brand-loyalty-rate-dropped-after-elon-musk-backed-donald-trump-as-us-president-2766155-2025-08-04",
      "headline": "Tesla's brand loyalty took a hit after Musk backed Trump as US President: ReportThe data shows Tesla's customer loyalty peaked in June 2024, when 73% of Tesla-owning households in the market for a new car bought another Tesla, according to an S&P analysis of vehicle-registration data in all 50 states."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sanjay-kapurs-mother-says-his-death-could-be-part-of-coordinated-transnational-conspiracy-seeks-uk-probe-2766105-2025-08-04",
      "headline": "Sunjay Kapur's death: Mother alleges foul play, transnational conspiracy in letterSunjay Kapur passed away on June 12 while playing polo at the Duke's Ground of the Old Guards Polo Club in Surrey, UK. His death was officially described as a heart attack. However, his mother Rani now claims there may be more to the story."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-to-activate-uan-via-umang-app-epfo-makes-aadhaar-face-authentication-mandatory-from-august-7-2766068-2025-08-04",
      "headline": "How to activate UAN via UMANG app to access EPFO servicesEPFO now requires everyone to activate their UAN through the UMANG app using Aadhaar-based face authentication to access provident fund services."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-offers-elon-musk-29-billion-deal-to-stay-onboard-2766070-2025-08-04",
      "headline": "Tesla offers Elon Musk $29 billion deal to stay onboardIn 2018, Tesla had promised Musk a huge $50 billion pay package if he hit certain performance goals. But earlier this year, a court in Delaware cancelled that deal, saying the company's board didn't do a fair job protecting shareholders when they approved it."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/ella-mccay-trailer-politician-emma-mackey-juggles-between-work-and-life-2766398-2025-08-05",
      "headline": "Ella McCay trailer: Politician Emma Mackey juggles between work and lifeThe trailer and poster for 'Ella McCay' featuring Hollywood actor Emma Mackey released on Tuesday. The film is directed by James L Brooks and will be released in theatres on December 12. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/malayalam-actor-shanawas-dies-at-71-after-prolonged-illness-2766406-2025-08-05",
      "headline": "Malayalam actor Shanawas, son of Prem Nazir, dies at 71Veteran actor Shanawas, son of Prem Nazir, died at the age of 71. He starred in over 50 films, including 'Mazhanilavu' and 'China Town' among others."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahavtar-narsimha-box-office-collection-day-11-detailed-report-india-top-animated-film-smashes-rs-100-crore-2766413-2025-08-05",
      "headline": "Mahavatar Narsimha box office Day 11: India's top animated film smashes Rs 100 crore'Mahavatar Narsimha' has emerged as the first choice for the Indian audience at the box office. The film has already entered the Rs 100 crore club, becoming India's biggest animated film, as the second week looks promising. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-celebrates-33-years-in-tamil-cinema-shalini-ajith-2766380-2025-08-05",
      "headline": "Shalini is a proud wife as Ajith Kumar celebrates 33 years in cinema. See picFormer actor Shalini shared a special photo with her actor-husband Ajith Kumar expressing joy at his achievements. Recently, he completed 33 years in cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/john-abraham-learns-farsi-hebrew-for-tehran-film-cultural-roots-2766378-2025-08-05",
      "headline": "Exclusive: John Abraham learnt Farsi and Hebrew for Tehran, shares emotional linkJohn Abraham embraced his Iranian heritage by learning Farsi and Hebrew for his film 'Tehran'. The movie highlights cross-cultural unity and streams on ZEE5 from August 14."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/exclusive-ahn-hyo-seop-on-kpop-demon-hunters-jinus-sacrifice-jungkooks-reaction-2766358-2025-08-05",
      "headline": "Exclusive: Ahn Hyo-seop on KPop Demon Hunters, Jinu's sacrifice, Jungkook's reactionKPop Demon Hunters, a record-breaking animated musical on Netflix, brings to life Jinu, a demon idol voiced by Ahn Hyo-seop in his first voice acting role. In an exclusive chat, the actor-singer breaks down his process and why he feels Jinu's sacrifice is the most Jinu thing he could do. He also mentioned why he wants to visit India someday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/telugu-producer-council-non-union-professionals-workers-strike-2766352-2025-08-05",
      "headline": "Telugu producer's council calls for non-union professionals amid workers' strikeThe Telugu Film Industry Employees' Federation initiated a strike on August 4, demanding a 30 per cent hike in fees for workers. A day later, the Telugu Film Chamber of Commerce called for non-union professionals to work with them upon agreeing to pay."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shehnaaz-gill-admitted-to-hospital-actor-karan-veer-mehra-seeks-prayers-from-fans-2766357-2025-08-05",
      "headline": "Actor Shehnaaz Gill hospitalised, Bigg Boss fame Karan Veer Mehra visits herActor Shehnaaz Gill has been hospitalised due to a sudden health scare, with reports suggesting low blood pressure. Fellow actor Karan Veer Mehra visited her and shared a video urging fans to pray for her speedy recovery. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/lady-gaga-to-release-new-track-dead-dance-for-netflixs-wednesday-2-2766349-2025-08-05",
      "headline": "Lady Gaga to release new track Dead Dance for Netflix's Wednesday 2Lady Gaga is set to contribute a new track for Netflix's 'Wednesday Season 2'. The song has been titled 'Dead Dance'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/katy-perry-halts-detroit-concert-mid-song-to-help-fainting-fan-wins-hearts-2766340-2025-08-05",
      "headline": "Katy Perry's fan faints on stage mid-show, singer halts concert to assist herAt her Detroit concert, Katy Perry showed true compassion by pausing her performance when a fan collapsed. Called McKenna, the fan was then assisted by paramedics. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/why-a-female-led-ullozhukkus-national-award-win-feels-personal-2766077-2025-08-05",
      "headline": "Why female-led Ullozhukku's National Award win feels personalUllozhukku challenges traditional portrayals of women in Indian cinema by showcasing complex female characters and their bonds. The film won Best Malayalam Film and Best Supporting Actress at the 71st National Film Awards, receiving critical acclaim for its direction and performances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/hansika-motwani-sohael-khaturiya-divorce-rumours-instagram-deletion-marriage-troubles-2766331-2025-08-05",
      "headline": "Hansika deletes wedding video, Insta posts with husband, sparks divorce rumoursActor Hansika Motwani deleted posts, including her wedding video with Sohael Khaturiya, from Instagram. Speculations about their divorce after this action. The couple had a widely-publicised wedding in December 2022."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/urvashi-aadujeevitham-snub-national-awards-empuraan-controversy-2766316-2025-08-05",
      "headline": "We know it's because of Empuraan: Urvashi on National Award snub of AadujeevithamActor Urvashi, who received Best Supporting Actress for 'Ullozhukku' at the 71st National Awards, questioned why Prithviraj and director Blesssy's 'Aadujeevitham' was ignored.  She also stated that she needs to speak up for younger generation of artistes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/zakir-khan-meets-bts-in-korea-fails-to-recognise-kpop-boy-band-2766052-2025-08-05",
      "headline": "Zakir Khan recalls not recognising BTS band members in Korea: Was totally unawareComedian Zakir Khan recently shared a funny story about meeting BTS in Korea without recognising them. He confessed to realising the popularity of the K-Pop icons much later. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vivek-agnihotri-defends-sandeep-reddy-vanga-toxic-masculinity-animal-kabir-singh-2766177-2025-08-04",
      "headline": "Vivek Agnihotri says Sandeep Reddy Vanga is his alter ego: He is showing the truthDirector Vivek Agnihotri defended 'Animal' director Sandeep Reddy Vanga's storytelling approach. He claimed that Vanga is criticised because of jealousy over his success rather than his content."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/adivi-sesh-emraan-hashmi-g2-release-date-poster-2766170-2025-08-04",
      "headline": "Adivi Sesh, Emraan Hashmi's G2 gets a release date. See new posterActor Emraan Hashmi, Adivi Sesh, and Wamiqa Gabbi's much-anticipated spy thriller 'G2' gets a release date. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-compares-lokesh-kanagaraj-to-ss-rajamouli-at-coolie-event-2766165-2025-08-04",
      "headline": "Rajinikanth compares Lokesh Kanagaraj to SS Rajamouli at Coolie eventRajinikanth praised Lokesh Kanagaraj at the Telugu pre-release event of 'Coolie'. He compared him to SS Rajamouli ahead of 'Coolie's release on August 14."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-collaborates-sanjay-leela-bhansali-love-and-war-reports-untrue-ram-leela-vicky-kaushal-alia-bhatt-ranbir-kapoor-2766163-2025-08-04",
      "headline": "Priyanka Chopra to team up with Bhansali for Love & War? Here's what we knowPriyanka Chopra is rumoured to be a part of Sanjay Leela Bhansali's 'Love & War'. However, as per an industry source, the reports are untrue. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/stranger-things-seasson-5-twist-revealed-2766126-2025-08-04",
      "headline": "Stranger Things Seasson 5 twist revealed, setting up wildest cold open yetNetflix is set to release the highly anticipated fifth season of 'Stranger Things' in three instalments. The makers dropped a major hint about the new seaosn. \r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-us-trump-tariffs-penalty-threat-russian-oil-purchase-pakistan-ceasefire-op-sindoor-strong-response-hypocrisy-2766403-2025-08-05",
      "headline": "Enough: India hits back at US after Russian oil threats, truce liesIf Donald Trump expected India to roll over, the message from South Block is loud and clear: India decides its interests, not Washington."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/disruption-our-democratic-right-mallikarjun-kharge-vs-rajya-sabha-chair-over-cisf-personnel-in-house-claim-2766436-2025-08-05",
      "headline": "You or Amit Shah? Congress chief's 'who's running House' barb for Rajya Sabha chair  Live UpdatesDisruption our democratic right: Mallikarjun Kharge vs Rajya Sabha chair over 'CISF personnel in House' claim"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/exhibit-a-on-us-lies-hypocrisy-over-india-and-russian-oil-2766317-2025-08-05",
      "headline": "Exhibit A of US lies, hypocrisy over India and Russian oilAs Donald Trump threatens India over Russian oil trade, a video of former US Ambassador Eric Garcetti admitting that the US encouraged India to buy Russian oil to keep global prices in check is now widely circulating."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-ethanol-blended-petrol-clarification-safe-for-old-new-vehicles-2766355-2025-08-05",
      "headline": "Government's big remark as ethanol-blended petrol has car owners fumingIn a post on X (formerly Twitter), the ministry responded to recent media reports questioning whether E20 fuel could damage older vehicles or degrade the driving experience. Citing multiple studies and expert assessments, it stated that E20 is both safe and beneficial."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-win-gautam-gambhir-red-ball-coach-record-2766351-2025-08-05",
      "headline": "Spirited India level England series, but Gambhir's Test reign must end nowIndia's Oval win was a testament to their grit and tenacity — but it came in spite of their head coach, not because of him. Individual brilliance papered over deep tactical flaws and inconsistent selections throughout the series. With just 3 wins in their last 13 Tests, Gautam Gambhir's tenure as Test coach should end sooner rather than later."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/amit-shah-article-370-anniversary-advani-longest-union-home-minister-jammu-and-kashmir-big-day-achievements-2766113-2025-08-05",
      "headline": "Why this August 5 is a big day for Amit ShahBJP leader Amit Shah became India's longest-serving Home Minister on August 5, the day on which Article 370 was revoked, by surpassing the record of party veteran LK Advani. Shah played a key role in Art 370 revocation, which Advani had championed. Other than 370, curbing Naxal violence and spearheading the passage of the CAA are among the highlights of Shah's stint."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/anil-ambani-ed-summons-delhi-loan-fraud-case-reliance-group-pmla-2766344-2025-08-05",
      "headline": "Anil Ambani at ED office for questioning in multiple fraud casesThe summons against Anil Ambani followed a massive crackdown by the ED last month, during which the agency searched 35 premises linked to some top executives of the Reliance Group. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-backs-sydney-sweeny-amid-jeans-advertisment-row-bashses-taylor-swift-woke-brand-jaguar-2766431-2025-08-05",
      "headline": "HOTTEST ad: Trump backs 'Republican' Sydney Sweeney amid jeans advert rowPresident Trump, in a Truth Social post, praised actor Sydney Sweeney's American Eagle ad as the 'hottest' and claimed pop singer Taylor Swift was \"no longer hot\", criticising celebrities and brands he called 'woke'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-win-gautam-gambhir-celebrations-indian-dressing-room-2766337-2025-08-05",
      "headline": "Absolute Scenes! Gambhir leads wild dressing room celebrations after Oval winAn emotional Gautam Gambhir led the way with the celebrations inside the dressing room as India clinched a memorable win at the Oval against England. India were able to level the series with the win on Monday, August 4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/flipkart-freedom-sale-tablets-get-their-biggest-price-drop-of-the-year-2764360-2025-07-31",
      "headline": "Flipkart Freedom Sale: Tablets Get Their Biggest Price Drop of the YearFor buyers looking to invest in a new device, this could be the best chance before the festive season arrives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-modis-swadeshi-call-gives-indias-economic-nationalism-a-new-voice-2765880-2025-08-04",
      "headline": "How Modi's 'swadeshi' call gives India's economic nationalism a new voiceThe Varanasi pitch looks timed to Donald Trump's new tariff threat. Yet, to become policy, Modi's 'swadeshi' must avoid the trappings of India's 'conservative' industrialism"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/india-us-trump-threat-tariff-russia-oil-trade-bjp-leader-baijayant-jay-panda-henry-kissinger-2766350-2025-08-05",
      "headline": "To be a friend...: BJP leader invokes Henry Kissinger amid Trump's tariff threatsAs India navigates through Donald Trump's threat over its oil trade with Russia, BJP leader Baijayant Panda invoked Henry Kissinger's quote to highlight the evolving diplomatic situation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/sleepwalking-sleep-talking-causes-triggers-risks-safety-tips-2766414-2025-08-05",
      "headline": "Understanding sleepwalking and sleep talking causes and safety tipsSleepwalking and sleep talking affect millions, especially children, with common triggers identified. Experts urge awareness of risks and recommend safety measures to prevent harm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/gpt-5-launch-roundup-all-you-need-to-know-about-next-big-chatgpt-update-2766434-2025-08-05",
      "headline": "GPT-5 launch roundup: All you need to know about next big ChatGPT updateOpenAI is expected to launch GPT-5 this month. The new LLM is said to be the company's most advanced AI model yet, likely combining multimodal capabilities, faster performance, and autonomous task execution."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/donald-trump-us-threat-russian-oil-bjp-government-pm-modi-jairam-ramesh-congress-2766405-2025-08-05",
      "headline": "Dost, dost na raha: Congress mocks Modi-Trump 'special bond' amid tariff threatCongress slammed the BJP government's foreign policy, questioning the Modi-Trump \"special bond\" and alleging it has harmed India amid fresh tensions over Trump's warning on Russian oil purchases."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/urvashi-aadujeevitham-snub-national-awards-empuraan-controversy-2766316-2025-08-05",
      "headline": "We know it's because of Empuraan: Urvashi on National Award snub of AadujeevithamActor Urvashi, who received Best Supporting Actress for 'Ullozhukku' at the 71st National Awards, questioned why Prithviraj and director Blesssy's 'Aadujeevitham' was ignored.  She also stated that she needs to speak up for younger generation of artistes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/why-a-female-led-ullozhukkus-national-award-win-feels-personal-2766077-2025-08-05",
      "headline": "Why female-led Ullozhukku's National Award win feels personalUllozhukku challenges traditional portrayals of women in Indian cinema by showcasing complex female characters and their bonds. The film won Best Malayalam Film and Best Supporting Actress at the 71st National Film Awards, receiving critical acclaim for its direction and performances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/parliament-monsoon-session-live-modi-felicitated-op-sindoor-lok-sabha-rajya-sabha-bihar-sir-2766365-2025-08-05",
      "headline": "Live: Both Houses adjourned amid Opposition uproar minutes after resumptionParliament Monsoon Session 2025 Live: Prime Minister Narendra Modi will be felicitated by MPs of the BJP-led National Democratic Alliance (NDA) on Tuesday for the successful execution of Operation Sindoor, during a key meeting of the NDA Parliamentary Party. The meeting, scheduled for 9.30 am, will mark the first such gathering of the alliance after the military operation. Women MPs have been specially requested to occupy the front row at the venue. Prime Minister Modi is also expected to address the MPs on the government's upcoming Tiranga Yatra and outline the NDA's political strategy to counter the opposition in the ongoing Monsoon Session. The NDA meet is taking place amid a largely stalled Parliament session, disrupted by opposition protests over the Election Commission's Special Intensive Revision (SIR) of the Bihar electoral rolls. Aside from a two-day debate on the Pahalgam attack and Operation Sindoor, little legislative business has been transacted. Stay tuned to IndiaToday.in for the latest updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-mohammed-siraj-bhai-jasprit-bumrah-shadow-2766278-2025-08-05",
      "headline": "The Siraj bhai series: Out of Bumrah's shadow, ruling India's heartsIndia vs England: Across five punishing Tests, Mohammed Siraj bowled his heart out, emerging as India's new bowling leader. In a series shaped by pressure and fatigue, he reminded us what playing for the country still means, even in an era of changing priorities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-name-in-epstein-files-fbi-pam-bondi-no-public-disclosure-2766341-2025-08-05",
      "headline": "Trump's name blacked out in Epstein files after FBI review: ReportFBI agents were instructed to flag any reference to Trump while combing through the Epstein files in March, Bloomberg reported citing sources. Trump's name was blacked out by investigators as it constituted an \"unwarranted invasion of privacy\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/why-mahjong-is-beating-screen-time-2766018-2025-08-05",
      "headline": "Why Mahjong is beating screen timeA centuries-old Chinese tile game is turning into the new favourite amongst all age groups. People are putting down their screens and coming together for a fun Mahjong session."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/dehumanising-unfortunate-kalyan-banerjee-slams-mahua-moitra-pig-jibe-2766154-2025-08-04",
      "headline": "After Mahua Moitra's 'pig' jibe, Kalyan Banerjee's furious post and a resignationTrinamool Congress MP Kalyan Banerjee responded to Mahua Moitra's statement where she referred to him as \"pig\", calling them dehumanising and unfortunate. He also resigned as the party chief whip in Lok Sabha."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/punjab-village-bans-love-marriages-without-family-consent-sparks-row-2766304-2025-08-05",
      "headline": "Punjab village bans love marriages without family consent, sparks rowThe resolution, passed unanimously on July 31, prohibits couples who marry without the approval of their families from residing in the village or nearby areas. It also warns of punitive action against any villagers who support or shelter such couples."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-first-village-digital-nomads-welcome-work-from-home-techie-sikkim-yakten-travellers-wfh-homestay-himachal-2766082-2025-08-05",
      "headline": "Want to work remotely? First village for WFH in Himalayas is ready for youThe small village of Yakten in Sikkim's Pakyong district has been declared India's first Digital Nomad Village under the Nomad Sikkim initiative. The pilot project aims to attract remote workers from India and abroad while creating year‑round income for local homestay owners. This is how Yakten is welcoming the techies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/ella-mccay-trailer-politician-emma-mackey-juggles-between-work-and-life-2766398-2025-08-05",
      "headline": "Ella McCay trailer: Politician Emma Mackey juggles between work and lifeThe trailer and poster for 'Ella McCay' featuring Hollywood actor Emma Mackey released on Tuesday. The film is directed by James L Brooks and will be released in theatres on December 12. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/malayalam-actor-shanawas-dies-at-71-after-prolonged-illness-2766406-2025-08-05",
      "headline": "Malayalam actor Shanawas, son of Prem Nazir, dies at 71Veteran actor Shanawas, son of Prem Nazir, died at the age of 71. He starred in over 50 films, including 'Mazhanilavu' and 'China Town' among others."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahavtar-narsimha-box-office-collection-day-11-detailed-report-india-top-animated-film-smashes-rs-100-crore-2766413-2025-08-05",
      "headline": "Mahavatar Narsimha box office Day 11: India's top animated film smashes Rs 100 crore'Mahavatar Narsimha' has emerged as the first choice for the Indian audience at the box office. The film has already entered the Rs 100 crore club, becoming India's biggest animated film, as the second week looks promising. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-celebrates-33-years-in-tamil-cinema-shalini-ajith-2766380-2025-08-05",
      "headline": "Shalini is a proud wife as Ajith Kumar celebrates 33 years in cinema. See picFormer actor Shalini shared a special photo with her actor-husband Ajith Kumar expressing joy at his achievements. Recently, he completed 33 years in cinema."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-sunil-gavaskar-dance-oval-test-win-watch-video-2766442-2025-08-05",
      "headline": "Watch: Sunil Gavaksar hits special dance after India's trilling Oval Test winSunil Gavaskar celebrated India's dramatic Oval Test win in style, dancing and singing \"Meri Desh Ki Dharti\" alongside Cheteshwar Pujara and others, after India pulled off a thrilling six-run victory to level the series 2-2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-ben-stokes-oval-test-ashes-australia-2766425-2025-08-05",
      "headline": "After India series draw, Ben Stokes eager to get to Australia for AshesAfter the intense and closely-fought series against India, England captain Ben Stokes said that he is eager to head to Australia for the Ashes series. Stokes' England were held to a 2-2 draw by India after the visitors won the Oval Test. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-mohammed-sirajs-brother-reveals-secret-behind-long-spells-2766418-2025-08-05",
      "headline": "No junk food, only discipline: Siraj's brother reveals secret behind long spellsIndia fast bowler Mohammed Siraj's brother, Mohammed Ismail, revealed the secret behind his ability to bowl long spells tirelessly in Test cricket after his match-winning performance against England at the Oval."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-mohammed-siraj-respect-shubman-gill-oval-test-2766390-2025-08-05",
      "headline": "Respect for Siraj would not have changed if India lost Oval Test: Shubman GillShubman Gill hailed Mohammed Siraj's match-winning impact at The Oval, emphasising that his respect within the team would have remained unchanged, regardless of the result, thanks to his consistent efforts and leadership with the ball over years.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-mohammed-siraj-jasprit-bumrah-oval-test-win-2766389-2025-08-05",
      "headline": "I believe in Jassi Bhai and myself: Siraj says he missed Bumrah during Oval winMohammed Siraj said that he missed the presence of Jasprit Bumrah during the Oval Test win. Siraj stepped up in Bumrah's absence and picked up nine wickets during the match to help India secure a memorable win. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-mohammed-siraj-oval-test-win-shane-warne-nasser-hussain-2766366-2025-08-05",
      "headline": "Mr. Angry Siraj a bit like Shane Warne: Nasser Hussain on India's Oval heroFormer England captain Nasser Hussain compared Mohammed Siraj to the legendary spinner Shane Warne in terms of being a competitor after India's thrilling Oval Test win. Siraj picked up 9 wickets in total in the Oval Test win. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-win-gautam-gambhir-red-ball-coach-record-2766351-2025-08-05",
      "headline": "Spirited India level England series, but Gambhir's Test reign must end nowIndia's Oval win was a testament to their grit and tenacity — but it came in spite of their head coach, not because of him. Individual brilliance papered over deep tactical flaws and inconsistent selections throughout the series. With just 3 wins in their last 13 Tests, Gautam Gambhir's tenure as Test coach should end sooner rather than later."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-win-gautam-gambhir-celebrations-indian-dressing-room-2766337-2025-08-05",
      "headline": "Absolute Scenes! Gambhir leads wild dressing room celebrations after Oval winAn emotional Gautam Gambhir led the way with the celebrations inside the dressing room as India clinched a memorable win at the Oval against England. India were able to level the series with the win on Monday, August 4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-test-series-virat-rohit-absence-rahul-gill-jadeja-batting-core-2766319-2025-08-05",
      "headline": "Giants exit, heirs rise: India's NextGen batting stars hold the fort in EnglandIn the absence of Rohit Sharma and Virat Kohli, it was Shubman Gill's authority, KL Rahul's elegance, Ravindra Jadeja's determination, Rishabh Pant's swagger, Yashasvi Jaiswal's promise, and Washington Sundar's grit that carried India forward in England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-mohammed-siraj-bhai-jasprit-bumrah-shadow-2766278-2025-08-05",
      "headline": "The Siraj bhai series: Out of Bumrah's shadow, ruling India's heartsIndia vs England: Across five punishing Tests, Mohammed Siraj bowled his heart out, emerging as India's new bowling leader. In a series shaped by pressure and fatigue, he reminded us what playing for the country still means, even in an era of changing priorities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-v-eng-test-series-sunil-gavaskar-mohammed-siraj-bumrah-workload-2766267-2025-08-04",
      "headline": "Wipe out the word workload from Indian cricket's dictionary: Sunil GavaskarLegendary Sunil Gavaskar has called to wipe out the word workload from the dictionary of Indian cricket. Speaking on India Today, Gavaskar took the example of brave heart Mohammed Siraj, whose spirited spell on the final day of 5th Test helped India level the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-win-gautam-gambhir-red-ball-coach-record-2766351-2025-08-05",
      "headline": "Spirited India level England series, but Gambhir's Test reign must end nowIndia's Oval win was a testament to their grit and tenacity — but it came in spite of their head coach, not because of him. Individual brilliance papered over deep tactical flaws and inconsistent selections throughout the series. With just 3 wins in their last 13 Tests, Gautam Gambhir's tenure as Test coach should end sooner rather than later."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-win-gautam-gambhir-celebrations-indian-dressing-room-2766337-2025-08-05",
      "headline": "Absolute Scenes! Gambhir leads wild dressing room celebrations after Oval winAn emotional Gautam Gambhir led the way with the celebrations inside the dressing room as India clinched a memorable win at the Oval against England. India were able to level the series with the win on Monday, August 4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-test-series-virat-rohit-absence-rahul-gill-jadeja-batting-core-2766319-2025-08-05",
      "headline": "Giants exit, heirs rise: India's NextGen batting stars hold the fort in EnglandIn the absence of Rohit Sharma and Virat Kohli, it was Shubman Gill's authority, KL Rahul's elegance, Ravindra Jadeja's determination, Rishabh Pant's swagger, Yashasvi Jaiswal's promise, and Washington Sundar's grit that carried India forward in England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-mohammed-siraj-bhai-jasprit-bumrah-shadow-2766278-2025-08-05",
      "headline": "The Siraj bhai series: Out of Bumrah's shadow, ruling India's heartsIndia vs England: Across five punishing Tests, Mohammed Siraj bowled his heart out, emerging as India's new bowling leader. In a series shaped by pressure and fatigue, he reminded us what playing for the country still means, even in an era of changing priorities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-v-eng-test-series-sunil-gavaskar-mohammed-siraj-bumrah-workload-2766267-2025-08-04",
      "headline": "Wipe out the word workload from Indian cricket's dictionary: Sunil GavaskarLegendary Sunil Gavaskar has called to wipe out the word workload from the dictionary of Indian cricket. Speaking on India Today, Gavaskar took the example of brave heart Mohammed Siraj, whose spirited spell on the final day of 5th Test helped India level the series."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}