{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/india-silent-debt-crisis-easy-loans-bnpl-apps-emi-burden-expert-panel-report-2849529-2026-01-10",
      "headline": "Drowning in debt: How easy loans are turning into an EMI nightmare for IndiansMonth after month, salaries go to EMIs, essentials shrink, and families realise that what once felt temporary has become the new normal. Read on to understand how this silent debt crisis is unfolding within Indian households."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sip-investments-hit-record-high-in-december-2025-amfi-2849472-2026-01-09",
      "headline": "SIP investments hit record high in December 2025: AMFIThe latest data from the Association of Mutual Funds in India (AMFI) for December 2025 shows steady participation from retail investors, record SIP contributions and sustained interest in equity and hybrid schemes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-it-possible-for-the-us-to-put-a-price-tag-on-greenland-2849404-2026-01-09",
      "headline": "Is it possible for the US to put a price tag on Greenland?In 1946, the US offered to buy the vast, mineral-rich Arctic island from Denmark for $100 million, an offer that was rejected back then."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/will-your-pf-keep-earning-interest-after-you-have-left-job-2849324-2026-01-09",
      "headline": "Will your PF keep earning interest after you have left job?Changing jobs is common today, but doubts around Provident Fund savings still linger. Many employees worry that their PF stops growing once they leave a job. The truth, however, is very different and often misunderstood."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/union-budget-2026-income-tax-relief-expectations-middle-class-2849334-2026-01-09",
      "headline": "Tax relief on the cards? What to expect from Budget 2026Changes to tax slabs, a higher exemption limit and a continued push towards the new tax regime helped reduce the tax burden for many families and eased pressure on households in budget 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-600-points-lower-nifty-below-25700-ntpc-down-2-percent-2849312-2026-01-09",
      "headline": "Sensex closes 605 points lower, Nifty below 25,700; NTPC down 2%The S&P BSE Sensex tanked 604.72 points to close at 83,576.24, while the NSE Nifty50 lost 193.55 points to end at 25,683.30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-silver-rates-today-india-global-turmoil-investors-safe-haven-demand-mcx-2849288-2026-01-09",
      "headline": "Gold, silver rates today: What should investors know amid global turmoilGold prices in India moved higher across all major purity levels on January 9. The price of 24K gold stood at Rs 13,871 per gram, up by Rs 71 from the previous session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/govt-ducks-imfs-c-grade-criticism-in-stunning-rti-stonewall-no-answers-no-fixes-2849264-2026-01-09",
      "headline": "Govt ducks IMF's 'C' grade criticism in stunning RTI stonewall: No answers, no fixesOn the estimation of GDP and Gross Value Added (GVA) for the unorganised sector, MoSPI said it follows methodologies outlined in official documents released in 2012 and 2015, both available in the public domain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/budget-2026-hoping-for-a-tax-makeover-why-you-might-be-disappointed-this-year-2849244-2026-01-09",
      "headline": "Budget 2026: Hoping for a tax makeover? Why you might be disappointed this yearHoping Budget 2026 will finally bring sweeping tax changes? Experts suggest this may not be the year for big announcements or dramatic relief."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/bharat-coking-coal-bccl-ipo-fully-subscribed-day-1-gmp-latest-2849238-2026-01-09",
      "headline": "Bharat Coking Coal IPO fully booked on Day 1. Should you subscribe?BCCL IPO: The allotment is expected to be finalised on January 14, 2026. Shares are proposed to list on the BSE and NSE on January 16, 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-sector-rotation-what-truly-shapes-returns-in-indian-equity-markets-2849221-2026-01-09",
      "headline": "Is sector rotation the real driver of returns in Indian equity markets?Sector rotation in its simplest form is the reaction of the market to shifts in the economic environment. The various sectors are enjoyed at various stages of the cycle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-crash-bloodbath-on-dalal-street-sensex-down-700-points-explained-2849218-2026-01-09",
      "headline": "Sensex falls over 600 points: What's behind the bloodbath on Dalal Street?Around 12:46 pm, the BSE Sensex was down 634.91 points to 83,546.05, while the NSE Nifty50 fell 188.80 points to 25,688.05. Most of the broader market indices also tumbled, reflecting the volatility on Dalal Street."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/still-not-received-your-income-tax-refund-in-2026-here-is-why-it-is-taking-time-2849156-2026-01-09",
      "headline": "Still not received your income tax refund in 2026? Here's why it's taking timeWaiting endlessly for your tax refund can be stressful. If your FY 2024–25 income tax refund has not arrived yet in 2026, there are several common reasons behind the delay."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-crash-sensex-nifty-tumble-what-next-for-dalal-street-investors-2849163-2026-01-09",
      "headline": "Trump's 500% tariff threat rattles Dalal Street. What should investors do now?Around 11:55 am, the Sensex was down nearly 450 points, while the NSE Nifty 50 had tumbled over 130 points, pushing the benchmark indices deeper into the red after a bruising week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/budget-2026-why-insurance-sector-needs-more-than-an-fdi-reset-2849098-2026-01-09",
      "headline": "Budget 2026: Why insurance sector needs more than an FDI boostWith FDI reforms in place, Budget 2026 must prioritise affordability, trust and protection-led incentives to close India's insurance gap and turn reform momentum into real coverage for citizens."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/mutual-fund-inflows-december-2025-equity-mf-drop-amfi-data-2849130-2026-01-09",
      "headline": "Mutual fund inflows cool off in December, down 6% to Rs 28,054 croreData released by the Association of Mutual Funds in India, or AMFI, showed that inflows into equity mutual funds fell 6% in December to Rs 28,054 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/bhel-share-price-rises-over-4-percent-why-bhel-stock-is-gaining-today-new-order-bcgcl-2849092-2026-01-09",
      "headline": "BHEL share price jumps over 4%. Why is the stock rising today?BHEL shares were trading at Rs 282.40, up Rs 10.10 or 3.71% as of 10:10 AM. The stock had closed at Rs 272.30 in the last session. It opened higher at Rs 279.10 and moved up further during the day.. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-gains-over-200-points-nifty-above-25900-bel-it-metal-up-2849062-2026-01-09",
      "headline": "Sensex gains over 200 points, Nifty above 25,900; BEL up 2%The S&P BSE Sensex was down by 35.21 points to 84,145.75, while the NSE Nifty50 lost 19.80 points to 25,857.50 as of 9:28 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-today-will-stock-market-fall-again-us-tariff-concerns-trading-setup-nse-bse-2849049-2026-01-09",
      "headline": "Sensex, Nifty trade setup: Will stock market fall again today?Both Sensex and Nifty have seen steady losses over the past four sessions. Nifty has fallen 1.7% during this period, while Sensex is down 1.8%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/bharat-coking-coal-bccl-ipo-opens-review-good-bad-gmp-falls-should-you-subscribe-price-band-details-2849045-2026-01-09",
      "headline": "Bharat Coking Coal IPO opens for bidding, but GMP falls. Should you apply?BCCL IPO: The allotment is expected to be finalised on January 14, 2026. Shares are proposed to be listed on the BSE and NSE, with a tentative listing date of January 16, 2026."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-diplomat-season-4-confirmed-new-episodes-expected-to-release-in-late-2026-2849740-2026-01-10",
      "headline": "The Diplomat Season 4 confirmed, new episodes expected to release in late 2026 'The Diplomat' season four was confirmed in Netflix's 2026 slate. The series is expected to release in late 2026, with production set to begin in July."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/oromeo-first-glimpse-shahid-kapoor-steps-into-a-brutal-vengeance-driven-tale-2849716-2026-01-10",
      "headline": "O'Romeo teaser: Shahid Kapoor steps into a brutal, vengeance-driven tale Shahid Kapoor surprised fans with the first glimpse of his upcoming film 'O'Romeo'. The film directed by Vishal Bharadwaj, will release in theatres on February 13. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-nick-jonas-candid-moments-fan-engagement-upcoming-projects-2849686-2026-01-10",
      "headline": "Priyanka Chopra's sweet video of Nick Jonas proves what healthy flirting is. Watch Priyanka Chopra's latest video featuring Nick Jonas at a swimming pool has drawn attention from fans, highlighting the couple's love. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/stebin-ben-nupur-sanon-wedding-celebrations-udaipur-haldi-sangeet-2849672-2026-01-10",
      "headline": "Kriti Sanon joins friends for a fun dance at Nupur-Stebin's sangeet. Watch The wedding celebrations of actor Nupur Sanon and singer Stebin Ben in Udaipur featured vibrant haldi and sangeet ceremonies. Several videos from the pre-wedding festivities have emerged online. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/why-most-hindi-films-struggle-to-crack-south-market-despite-ongoing-pan-india-boom-2848199-2026-01-10",
      "headline": "Why most Hindi films struggle to crack South market despite ongoing pan-India boom Even as most South films rake it in at the pan-India box office regularly, Bollywood continues to struggle in southern markets that remain deeply rooted and self-sufficient with regional language content."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/matt-damon-ben-affleck-go-candid-on-money-stunts-and-life-beyond-acting-watch-2849666-2026-01-10",
      "headline": "Matt Damon, Ben Affleck go candid on money, stunts and life beyond acting. Watch Actors Matt Damon and Ben Affleck recently sat down for a conversation where they got candid about their lives beyond acting, stunts and more. The two will be seen sharing screen space in 'The Rip.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/annadurai-mgr-jayalalithaa-to-vijay-tamil-saga-of-film-to-politics-continues-2849277-2026-01-10",
      "headline": "Annadurai, MGR, Jayalalithaa to Vijay: Tamil saga of film to politics continues With Jana Nayagan censor controversy, Vijay's entry into politics is back in the news. The actor is only the latest to mark Tamil Nadu's unique cinema-politics connection, which influences the state's leadership dynamics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prabhas-the-raja-saab-box-office-collection-rs-54-crore-opening-day-telugu-response-2849647-2026-01-10",
      "headline": "The Raja Saab box office Day 1: Prabhas delivers strong opening with Rs 54.15 crore Prabhas's latest film, the horror comedy 'The Raja Saab', began its box office run on a grand note, collecting Rs 54.15 crore across all markets on its first day. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/sivakarthikeyan-reacts-25-cuts-cbfc-parasakthi-sudha-kongara-prasad-2849641-2026-01-10",
      "headline": "Sivakarthikeyan reacts to 25 cuts in Parasakthi: We didn't have time to negotiate Actor Sivakarthikeyan recently addressed his film 'Parasakthi' being cleared for release with 25 cuts by the censor board. In an exclusive interview, he commented on the ongoing controversy, explaining that the changes do not affect the film's storyline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/south-indian-cinema-2026-comeback-vijay-prabhas-yash-ram-charan-2848713-2026-01-10",
      "headline": "Will 2026 be South's strike-back year after the Dhurandhar storm? South Indian cinema looks set for a strong comeback in 2026 with major stars returning. The resurgence is being seen as a response to Dhurandhar's dominance and a fresh bid to reshape pan-India cinema dynamics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/black-mirror-to-return-for-season-8-confirms-creator-charlie-brooker-2849581-2026-01-09",
      "headline": "Black Mirror to return for season 8, confirms creator Charlie Brooker Black Mirror creator Charlie Brooker has announced that the series will return for an eighth season on Netflix. He said the show will be \"more 'Black Mirror' than ever.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sanjay-khan-recalls-hrithik-roshan-sussanne-separation-before-actor-birthday-graceful-2849563-2026-01-09",
      "headline": "Graceful: Sanjay Khan recalls Hrithik-Sussanne's separation, before actor's birthday Ahead of Hrithik Roshan's 52nd birthday, Sussanne Khan's father, Sanjay Khan, has spoken about the amicable nature of Hrithik and Sussanne's separation. In an early birthday post, he highlighted the continued respect and warmth within their family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/brooklyn-beckham-sends-legal-notice-to-david-beckham-victoria-beckham-amid-family-rift-report-2849532-2026-01-09",
      "headline": "Brooklyn Beckham sends legal notice to David, Victoria amid family rift: Report Brooklyn Beckham has reportedly sent a legal notice to his parents, David and Victoria Beckham. The notice restricts them from tagging him in social media posts. The development comes after a series of strained interactions between Brooklyn, his wife Nicola Peltz, and his family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ram-gopal-varma-calls-censor-board-outdated-after-madras-high-court-stay-in-jana-nayagan-row-2849527-2026-01-09",
      "headline": "RGV calls censor board outdated after Madras High Court stay on Jana Nayagan Filmmaker Ram Gopal Varma has called the Censor Board outdated amid the ongoing Jana Nayagan certification row. His comments come as the Madras High Court temporarily halted the film's U/A certificate. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/kate-winslet-hints-at-mare-of-easttown-season-2-filming-likely-in-2027-2849508-2026-01-09",
      "headline": "Kate Winslet hints at Mare of Easttown 2, filming likely in 2027 Kate Winslet has confirmed that serious discussions are underway for a second season of HBO's acclaimed series Mare of Easttown. There is a strong possibility that production will begin in 2027."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/geetu-mohandas-defends-yash-toxic-teaser-talks-about-female-pleasure-and-consent-2849457-2026-01-09",
      "headline": "Geetu Mohandas defends Toxic teaser, talks about female pleasure and consent Director Geetu Mohandas has addressed public criticism following the release of the teaser for Toxic: A Fairy Tale for Grown-Ups. Her response came after viewers raised concerns about the portrayal of a female character in the teaser."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/not-scared-of-dhurandhar-2-or-toxic-mukesh-bhatt-on-emraan-hashmi-awarapan-2-delay-2849479-2026-01-09",
      "headline": "Not scared of Dhurandhar 2 or Toxic: Mukesh Bhatt on Emraan Hashmi Awarapan 2 delay Awarapan 2 has been delayed after Emraan Hashmi's on-set injury. Producer Mukesh Bhatt has cleared the air on the delay and denied rumours about avoiding box office competition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/fans-mob-amitabh-bachchan-in-surat-videos-spark-concern-online-2849453-2026-01-09",
      "headline": "Fans mob Amitabh Bachchan in Surat, video sparks online conern Veteran actor Amitabh Bachchan was surrounded by a large crowd during his arrival in Surat for the Indian Street Premier League Season 3. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anupam-kher-celebrates-tanvi-the-greats-entry-in-oscars-2026-race-2849458-2026-01-09",
      "headline": "Anupam Kher celebrates Tanvi The Great's entry in Oscars 2026 race Anupam Kher celebrated Tanvi The Great entering the Oscars 2026 race, calling it a major milestone for the team. The film's global recognition comes alongside its successful 100-day run in theatres."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-protests-women-light-cigarettes-burn-khamenei-photos-viral-2849736-2026-01-10",
      "headline": "Why Iranian women are lighting cigarettes from burning Khamenei photosIranian women seem to have ignited a new protest trend, lighting cigarettes from burning photos of Supreme Leader Ayatollah Ali Khamenei amid the bloody unrest that has gripped the Middle Eastern nation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/trump-greenland-threat-denmark-shoot-first-military-strength-us-comparison-2849691-2026-01-10",
      "headline": "Denmark says we'll shoot first if US invades Greenland. But with what?Denmark has warned that its troops were under standing orders to 'shoot first and ask questions later' if Greenland is attacked by the US. But can the Danish army take on the might of the US in case of a military invasion or a Venezuela-like operation?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/maharashtra/story/devendra-fadnavis-eknath-shinde-former-maharashtra-dgp-sanjay-pande-plotted-to-frame-2016-ulc-scam-case-report-rashmi-shukla-report-2849684-2026-01-10",
      "headline": "Ex-Maharashtra DGP plotted to frame Fadnavis, Shinde in ULC scam, claims reportA special investigation report submitted by outgoing Maharashtra DGP Rashmi Shukla to the state Home Department revealed that former DGP Sanjay Pande plotted to frame Devendra Fadnavis and Eknath Shinde in the 2016 ULC scam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/afghanistan-noor-ahmed-noor-first-diplomat-india-post-taliban-takeover-2849714-2026-01-10",
      "headline": "Who is Noor Ahmed Noor, Afghanistan's 1st envoy in India after Taliban takeover?The move signals renewed engagement between India and Afghanistan, especially in humanitarian and health cooperation.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/photo-essay/the-dogs-are-watching-us-333-10-01-2026",
      "headline": "The dogs are watching usIn three consecutive days of hearing as to whether streets must be cleared of stray dogs and if they must be sent away to shelters, Supreme Court observed much and lawyers argued a lot. The result: a slew of quotable quotes for both dog-loving and dog-baiting humans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/apache-helicopters-cost-drone-threats-limit-india-attack-helicopter-acquisitions-2849594-2026-01-10",
      "headline": "Why India didn't buy more ApachesHigh cost and questionable relevance in today's drone-infested battlefields have put paid to further acquisitions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-exposed-pakistans-failures-forced-constitutional-changes-chief-of-defence-staff-general-anil-chauhan-2849676-2026-01-10",
      "headline": "Op Sindoor exposed Pak failures, forced it to change Constitution: Defence chiefGeneral Anil Chauhan highlighted Pakistan's hurried constitutional amendments as a response to failures during Operation Sindoor, signalling significant changes in their defence structure. He emphasised India's focus on evolving joint command systems to enhance operational readiness and strategic flexibility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/story/uttar-pradesh-special-intensive-revision-sir-2026-draft-list-voter-name-deletions-bjp-meeting-scrambles-prevent-vote-losses-booth-level-reports-yogi-adityanath-form-6-campaign-2849632-2026-01-10",
      "headline": "BJP scrambles to prevent losses as SIR leads to huge voter name deletions in UPAfter extensive voter name deletions in Uttar Pradesh, especially in urban regions, the BJP central leadership has set the party into a high-alert operational mode, assigning workers and leaders to focus entirely on voter enrolment and recovery efforts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bangladesh-pakistan-dhaka-karachi-direct-flight-india-overflight-permission-1978-agreement-biman-bangladesh-2849536-2026-01-10",
      "headline": "Can Biman Bangladesh avoid long detour to reach Karachi? India has the keyFollowing growing bonhomie between Pakistan and Bangladesh, direct flights between Dhaka and Karachi are set to resume from January 29, after over a decade. Since India and Pakistan have banned each other's aircraft from their respective airspaces, would New Delhi allow the Dhaka-Karachi air service to operate over its territory, amid strained India-Bangladesh ties?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/municipal-corporation/story/bmc-polls-marathi-asmita-language-poll-plank-falls-flat-for-gen-z-of-mumbai-civic-body-elections-mns-shiv-sena-ubt-mahayuti-2848647-2026-01-10",
      "headline": "BMC polls: Marathi language poll plank falls flat for Gen Z-ers of MumbaiThe longstanding issue of Marathi Asmita is hot again ahead of the BMC polls, but Mumbai's Gen Z is tuning it out. For the city's youngest voters, potholes, waste management, and breathable air are bigger than language politics. With youth forming nearly a quarter of the BMC electorate, civic issues might decide who governs India's richest municipal body."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/us-ready-to-sell-venezuelan-oil-to-india-under-washington-controlled-framework-2849608-2026-01-10",
      "headline": "US ready to sell Venezuelan oil to India under Washington-controlled frameworkThe White House says it is ready to allow India to buy Venezuelan oil under a US-controlled system, signalling a possible reopening of supplies amid India's growing energy demand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/nasa-announces-astronauts-will-be-evacuated-from-international-space-station-january-14-medical-issue-2849710-2026-01-10",
      "headline": "Nasa confirms when it will evacuate astronauts from space due to medical emergencyThe four-person crew set to return includes NASA astronauts Zena Cardman and Mike Fincke, Japan Aerospace Exploration Agency (JAXA) astronaut Kimiya Yui, and Roscosmos cosmonaut Oleg Platonov."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-vadodara-fan-frenzy-ind-vs-nz-private-life-london-privacy-concerns-2849659-2026-01-10",
      "headline": "Fame vs freedom: Stop questioning why Virat Kohli chooses to stay in LondonVirat Kohli's overwhelming reception in Vadodara once again highlighted the suffocating reality of fame in India, where admiration often spills into boundary-less frenzy. While fans question his decision to live in London, such incidents explain his desire for privacy, normalcy, and freedom from constant public scrutiny."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/najmul-hossain-shanto-slams-najmul-islam-tamim-iqbal-india-agent-comment-bcci-vs-bcb-2849719-2026-01-10",
      "headline": "BCCI and Bangladesh cricket stand-off affecting us mentally: Najmul Hossain ShantoBangladesh Test captain Najmul Hossain Shanto has criticised the BCB director M Najmul Islam for calling Tamim Iqbal 'India's agent'. Shanto also revealed that the ongoing dispute over security concerns for the T20 World Cup in India is affecting players' morale ahead of the tournament."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/aimim-president-asaduddin-owaisi-hopeful-of-hijab-clad-woman-as-pm-says-ambedkars-constitution-allows-this-2849742-2026-01-10",
      "headline": "Owaisi hopeful of hijab-clad woman as PM: Ambedkar's Constitution allows thisAIMIM president Asaduddin Owaisi emphasises the inclusive nature of India's Constitution, dreaming of a hijab-clad daughter becoming Prime Minister. He contrasts India's secular values with Pakistan's religious restrictions while campaigning in Maharashtra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-protest-news-live-ayatollah-ali-khamenei-return-of-reza-pahlavi-shah-popularity-challenges-trump-us-stance-2849309-2026-01-10",
      "headline": "Can crown prince Reza Pahlavi return to Iran?Chants of \"Pahlavi will return\" are echoing in Iran amid the nationwide protests against Ayatollah Ali Khamenei. Exiled Iranian crown prince, Reza Pahlavi, has emerged as the most recognisable face of the protest. But can the Shah's son move from being just a nostalgic symbol to a real force? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/south-indian-cinema-2026-comeback-vijay-prabhas-yash-ram-charan-2848713-2026-01-10",
      "headline": "Will 2026 be South's strike-back year after the Dhurandhar storm?South Indian cinema looks set for a strong comeback in 2026 with major stars returning. The resurgence is being seen as a response to Dhurandhar's dominance and a fresh bid to reshape pan-India cinema dynamics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/news/weekly-quiz-559-09-01-2026",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-temperature-today-lowest-42-degrees-cold-wave-flights-delayed-fog-igi-airport-2849655-2026-01-10",
      "headline": "Delhi hits season's coldest morning at 4.2 degrees, dense fog disrupts flightsDelhi experienced its coldest January morning with temperatures dropping to 4.2 degrees Celsius, accompanied by dense fog disrupting daily life and aviation. Meanwhile, southern states brace for heavy rainfall and squally winds, highlighting contrasting weather patterns across India.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/india-silent-debt-crisis-easy-loans-bnpl-apps-emi-burden-expert-panel-report-2849529-2026-01-10",
      "headline": "Drowning in debt: How easy loans are turning into an EMI nightmare for IndiansMonth after month, salaries go to EMIs, essentials shrink, and families realise that what once felt temporary has become the new normal. Read on to understand how this silent debt crisis is unfolding within Indian households."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/why-most-hindi-films-struggle-to-crack-south-market-despite-ongoing-pan-india-boom-2848199-2026-01-10",
      "headline": "Why most Hindi films struggle to crack South market despite ongoing pan-India boomEven as most South films rake it in at the pan-India box office regularly, Bollywood continues to struggle in southern markets that remain deeply rooted and self-sufficient with regional language content."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sunil-gavaskar-gifts-jemimah-rodrigues-bat-shaped-guitar-womens-premier-league-2849618-2026-01-10",
      "headline": "Sunil Gavaskar gifts Jemimah bat-shaped guitar, joins her for promised duetSunil Gavaskar surprised Jemimah Rodrigues with a customised bat-shaped guitar in Mumbai. The cricket great fulfilled a promise he made during India's Women's World Cup campaign by sitting down with her for a jamming session on the eve of the Women's Premier League opener."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/supriya-sule-ajit-pawar-shares-dais-for-first-time-since-2023-ncp-split-release-pune-civic-poll-manifesto-2849715-2026-01-10",
      "headline": "Supriya Sule shares dais with Ajit Pawar for 1st time since NCP splitIn a rare political development, estranged cousins Supriya Sule and Ajit Pawar have come together on a public platform ahead of crucial civic elections in Maharashtra. This unexpected alliance signals a tactical move despite their ongoing rivalry at the state level."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/study-abroad/story/indian-exports-students-brain-drain-but-not-a-global-study-destination-2849388-2026-01-09",
      "headline": "Millions leave India to study abroad. But almost none come here to studyIndia is among the world's largest exporters of students, but attracts less than 1% of global inbound learners in return. A NITI Aayog report flips the study-abroad obsession to expose India's failure as a global education destination, and shows why the imbalance hurts prestige, economy and long-term talent goals. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-silent-on-bangladesh-t20-world-cup-security-issues-devajit-saikia-2849741-2026-01-10",
      "headline": "BCCI remains silent on Bangladesh World Cup controversy: Not our domain to talk about BCCI remains tight-lipped amid Bangladesh's refusal to play T20 World Cup matches in India. The two cricketing boards are at loggerheads as Bangladesh has called for venue changes ahead of the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/najmul-hossain-shanto-slams-najmul-islam-tamim-iqbal-india-agent-comment-bcci-vs-bcb-2849719-2026-01-10",
      "headline": "BCCI and Bangladesh cricket stand-off affecting us mentally: Najmul Hossain Shanto Bangladesh Test captain Najmul Hossain Shanto has criticised the BCB director M Najmul Islam for calling Tamim Iqbal 'India's agent'. Shanto also revealed that the ongoing dispute over security concerns for the T20 World Cup in India is affecting players' morale ahead of the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-yuvraj-singh-nets-training-batting-tips-viral-video-t20-world-cup-2849721-2026-01-10",
      "headline": "Yuvraj Singh's new student? Sanju Samson takes batting tips from India legend A viral nets video has reignited buzz around Sanju Samson's T20 World Cup role. With Yuvraj Singh seen offering guidance, the India batter's push to cement his place at the top order has gained fresh momentum."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2026-mumbai-indians-vs-delhi-capitals-preview-jemimah-rodrigues-harmanpreet-kaur-2849690-2026-01-10",
      "headline": "WPL 2026: Delhi Capitals begin Jemimah era against battered Mumbai Indians Delhi Capitals start their Women's Premier League 2026 (WPL 2026) campaign against defending champions Mumbai Indians. DC will be led by a new captain this season in Jemimah Rodrigues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-stamp-authority-ind-vs-nz-odi-series-2026-tough-start-india-captain-2849473-2026-01-10",
      "headline": "Shubman Gill out to stamp his authority in 2026 after tough start as India captain Shubman Gill enters 2026 under scrutiny after a demanding first year as India captain. A T20 World Cup snub and leadership lessons now shape a phase where form, clarity and authority matter more than promise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/kylian-mbappe-real-madrid-vs-fc-barcelona-el-clasico-spanish-super-cup-lands-saudi-arabia-2849677-2026-01-10",
      "headline": "Kylian Mbappe lands in Saudi Arabia ahead of El Clasico Super Cup final vs Barcelona Kylian Mbappe's arrival in Saudi Arabia has lifted excitement ahead of El Clásico. With Real Madrid reaching the Super Cup final, all eyes are now on the French star's fitness and possible return."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/womens-hil-final-sg-pipers-vs-bengal-tigers-preview-2849568-2026-01-10",
      "headline": "Women's Hockey India League final: SG Pipers hope to end Bengal Tigers jinx A new champion is all set to be crowned in the Women's Hockey India League as SG Pipers square off against the Shrachi Bengal Tigers in Ranchi on Saturday, January 10. The top teams delivered tight contests earlier on in the season. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/badminton/story/malaysia-open-pv-sindhu-semi-final-loss-vs-wang-zhi-yi-world-number-2-heartbreak-2849664-2026-01-10",
      "headline": "PV Sindhu's Malaysia Open run ends in semi-final loss to world No. 2 Wang Zhi Yi PV Sindhu's encouraging return ended in disappointment at the Malaysia Open. Despite strong leads in both games, the Indian star faltered at key moments, falling to world No. 2 Wang Zhi Yi in the semis.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-vadodara-fan-frenzy-ind-vs-nz-private-life-london-privacy-concerns-2849659-2026-01-10",
      "headline": "Fame vs freedom: Stop questioning why Virat Kohli chooses to stay in London Virat Kohli's overwhelming reception in Vadodara once again highlighted the suffocating reality of fame in India, where admiration often spills into boundary-less frenzy. While fans question his decision to live in London, such incidents explain his desire for privacy, normalcy, and freedom from constant public scrutiny."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyer-nearly-bitten-by-fans-dog-ahead-of-odi-comeback-india-new-zealand-2849652-2026-01-10",
      "headline": "Shreyas Iyer nearly bitten by fan's dog ahead of ODI return against New Zealand Shreyas Iyer almost got bitten by a fan's dog at the airport just before his ODI return. Iyer was out of action for two months due to a spleen injury he suffered in Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lamisha-musonda-chelsea-days-to-live-heartbreaking-message-social-media-lukaku-2849656-2026-01-10",
      "headline": "Former Chelsea player reveals he has only days to live in heartbreaking message Lamisha Musonda shared a heartbreaking message revealing a critical health battle. The former Belgian footballer said he may have only days left, prompting an outpouring of support from across the football world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/atletico-madrid-statement-diego-simeone-vs-vinicius-jr-spat-real-madrid-super-cup-2849631-2026-01-10",
      "headline": "Atletico Madrid break silence on Simeone–Vinicius spat, urge focus on feud build-upAtletico Madrid have backed Diego Simeone after his touchline spat with Vinicius Jr. The club questioned the narrative around the incident, urging focus on the provocation rather than the reaction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/malaysia-open-live-score-pv-sindhu-semi-final-wang-zhi-yi-badminton-kuala-lumpur-2849626-2026-01-10",
      "headline": "Malaysia Open Highlights: PV Sindhu's brilliant run ends after semi-final loss to WangMalaysia Open Highlights: PV Sindhu's spirited run at the Malaysia Open ends with a semi-final loss to China's Wang Zhi Yi by 16-21, 15-21, and ruins her route to a first tour final since 2024, but not without a fight."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-virat-kohli-mimics-arshdeep-singh-rohit-sharma-laughs-watch-video-2849623-2026-01-10",
      "headline": "Watch: Virat Kohli mimics Arshdeep Singh in training, Rohit Sharma enjoys banterIND vs NZ: Virat Kohli set the tone for India's New Zealand series build-up with humour. The senior batter was seen mimicking Arshdeep Singh's run-up in nets, as Rohit Sharma enjoyed the light-hearted moment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sunil-gavaskar-gifts-jemimah-rodrigues-bat-shaped-guitar-womens-premier-league-2849618-2026-01-10",
      "headline": "Sunil Gavaskar gifts Jemimah bat-shaped guitar, joins her for promised duetSunil Gavaskar surprised Jemimah Rodrigues with a customised bat-shaped guitar in Mumbai. The cricket great fulfilled a promise he made during India's Women's World Cup campaign by sitting down with her for a jamming session on the eve of the Women's Premier League opener."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/up-warriorz-vs-gujarat-giants-preview-predicted-xi-pitch-weather-report-match-prediction-2849511-2026-01-10",
      "headline": "WPL 2026: UP Warriorz look for fresh start under Lanning-Nayar regime vs GujaratWPL 2026, UPW vs GG preview: It's a new era for UP Warriorz and Gujarat Giants as they aim to gain early momentum in the Women's Premier League 2026. With Abhishek Nayar and Meg Lanning at the helm, can the Warriorz get off to a great start or will the Giants make a statement win?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/brendon-mccullum-defends-england-players-noosa-trip-harry-brook-incident-2849584-2026-01-10",
      "headline": "McCullum responds to Brook revelation, Noosa trip: Half of team doesn't drinkBrendon McCullum has defended the England players following the Harry Brook nightclub controversy and the controversial Noosa trip during the Ashes 2025-26 series. England lost the series 1-4 in Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nadine-de-klerk-harmanpreet-kaur-rcb-chase-mumbai-indians-wpl-opener-2849601-2026-01-10",
      "headline": "Harmanpreet Kaur rues Nadine de Klerk drop catches after MI implode vs RCBWPL 2026, MI vs RCB: Harmanpreet Kaur said that dropped catches didn't help the Mumbai Indians as the two-time champions faced a three-wicket defeat in the opening game on Friday against Royal Challengers Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2026-match-nadine-de-klerk-rcb-win-opener-dy-patil-stadium-navi-mumbai-2849602-2026-01-10",
      "headline": "Nadine de Klerk cashed in when it mattered as RCB win thrilling WPL 2026 openerNadine de Klerk cashed in on her day with four wickets and a match-winning fifty as RCB pulled off a thrilling late heist against Mumbai Indians in the WPL 2026 opener."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nihal-sarin-tata-steel-chess-rapid-title-grandfather-death-2849600-2026-01-09",
      "headline": "Emotional Nihal Sarin wins Tata Chess rapid title a day after grandfather's deathYoung grandmaster Nihal Sarin overcame grief to win the Tata Steel Chess Rapid title on Friday, January 9. Sarin lost his grandfather, who was his guru in chess on the eve of the final day of the Rapid round. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nadine-de-klerk-last-ball-win-rcb-mumbai-indians-wpl-2026-2849583-2026-01-09",
      "headline": "Clutch Nadine de Klerk stuns MI as RCB snatch win from jaws of defeat in WPL openerWPL 2026, MI vs RCB: Nadine de Klerk pulled off a stupendous all-round effort as Royal Challengers Bengaluru beat Mumbai Indians by three wickets in the opening game on Friday in Navi Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/richa-ghosh-fiery-reply-alyssa-healy-india-australia-womens-test-2023-2849572-2026-01-09",
      "headline": "Jemimah recalls how Richa Ghosh sledged back Australia: Mummy told me to hit a fourIndian batter Jemimah Rodrigues recalled how Richa Ghosh cheekily shut down an Alyssa Healy sledge during the 2023 Women's Test against Australia at the Wankhede Stadium in Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-2026-lauren-bell-rcb-debut-vs-mi-fans-reaction-2849559-2026-01-09",
      "headline": "Lady Hazlewood! Lauren Bell praised by RCB fans after stunning spell vs MI in WPL openerRCB fans hailed Lauren Bell as lady Josh Hazlewood after the English pacer stunned Mumbai Indians with her fine spell in the WPL 2026 opener on Friday, January 9. Bell was bought by RCB during the auction and made her WPL debut. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-smiling-mini-doppelganger-vadodara-viral-social-media-2849531-2026-01-09",
      "headline": "Virat Kohli can't stop smiling after meeting mini doppelganger, moment goes viralVirat Kohli shared a light moment during an India training session in Vadodara after meeting a young fan who closely resembled him. The photo quickly went viral as fans compared the child to Kohli's childhood pictures ahead of the New Zealand ODI series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/brendon-mccullum-on-replacement-england-coach-ashes-defeat-in-australia-2849504-2026-01-09",
      "headline": "After Ashes debacle, McCullum admits he could be replaced as England coachFollowing England's 4-1 Ashes series loss to Australia, Brendon McCullum admitted there could be \"someone better\" suited to be head coach if he is not \"able to steer the ship.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-will-young-india-vs-new-zealand-odi-series-2849475-2026-01-09",
      "headline": "Virat, Rohit are incredible: Young explains Indian duo's influence on NZ campIndia vs New Zealand: Ahead of the three-match ODI series, Will Young admitted it was no surprise to see Virat Kohli and Rohit Sharma back at their best, explaining how the Indian stars inspire the Blackcaps camp."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/malaysia-open-pv-sindhu-semfinal-wang-zhi-yi-long-term-goal-2849431-2026-01-09",
      "headline": "Back in semis of Super 1000 after 5 years, PV Sindhu focused on one day at a timePV Sindhu has made a strong return to competitive badminton by reaching the Malaysia Open semi-finals after a four-month injury break. Her focus remains on fitness and mental strength as she eyes the Los Angeles Olympics 2027 and plans to play for a few more years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/travis-head-ashes-centuries-golf-putt-aus-vs-eng-2849391-2026-01-09",
      "headline": "24 hours after Ashes win, Head steals show with remarkable putt at Blitz golfJust 24 hours after securing the Ashes trophy, Travis Head showed off his skills on the golf course, hitting a remarkable putt. Head was the highest run-getter in the Ashes this time and scored three hundreds. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/michael-atherton-poor-preparation-england-ashes-4-1-loss-calls-cook-assistant-coach-2849372-2026-01-09",
      "headline": "Ashes debacle in Australia will haunt England for years: Michael AthertonFormer England captain Michael Atherton believes England will be \"haunted\" for years by their latest Ashes failure in Australia, after being thoroughly outplayed in the five-match series. The Ben Stokes-led side endured a disappointing tour, eventually losing the contest 1-4 as Australia dominated across conditions to retain the urn."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mi-vs-rcb-live-score-wpl-2026-mumbai-indians-vs-royal-challengers-bengaluru-womens-match-2849366-2026-01-09",
      "headline": "WPL 2025 Highlights: Nadine de Klerk pulls comeback as RCB win by 3 wicketsMumbai Indians Women (MI) vs Royal Challengers Bengaluru Women (RCB) Highlights: Nadine de Klerk pulled off one of the biggest comebacks for the ages as her fifty led RCB to a comeback win from a very improbable situation in the opening fixture of the WPL season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kevin-pietersen-andy-flower-england-coach-ashes-2025-26-2849364-2026-01-09",
      "headline": "Pietersen recommends IPL-winning coach to replace McCullum: He gets Test cricketKevin Pietersen recommended England to bring back a former coach to replace Brendon McCullum as Test coach following their poor performance in the Ashes 2025-26. England lost the series 1-4. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}