{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jiohotstar-website-delhi-developer-sells-domain-uae-jainam-jeevika-dubai-kids-2623668-2024-10-26",
      "headline": "Twist in JioHotstar drama, Dubai siblings claim they bought domain from developerThe JioHotstar.com controversy has taken a new turn as the Delhi developer, who bought the domain much to the annoyance of Reliance Industries, seems to have sold it to two Dubai-based children -- Jainam and Jivika."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/itr-filing-deadline-corporate-taxpayers-extended-november-15-2623581-2024-10-26",
      "headline": "ITR filing deadline for corporate taxpayers extended till November 15ITR filing deadline: The extension applies to taxpayers covered under sub-Section (1) of Section 139 of the Income-tax Act, 1961."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/waaree-energies-ipo-latest-gmp-dips-stock-market-debut-listing-expectations-investors-2623572-2024-10-26",
      "headline": "Waaree Energies IPO: GMP drops before listing; should investors worry?Waaree Energies listing expectations: With the company set to debut on October 28, Waaree Energies' GMP currently stands around Rs 1,320, reflecting a potential listing premium of 88% over the IPO issue price."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/rs-220-crore-bank-fraud-case-ed-raids-pharma-company-sharon-bio-medicine-limited-2623480-2024-10-26",
      "headline": "ED raids in Mumbai, Haryana against pharma company in Rs 220-crore fraud caseDuring the search operations in Mumbai and Haryana's Yamunanagar, movable assets including bank funds, Demat accounts valued at Rs 14.53 crore were seized or frozen."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/afcons-infrastructure-ipo-day-1-check-latest-subscription-gmp-expected-listing-gains-2623281-2024-10-25",
      "headline": "Afcons Infrastructure IPO Day 1: Check latest subscription, GMP Afcons Infrastructure's IPO aims to raise Rs 5,430 crore and consists of a fresh issue of 2.7 crore shares, totalling Rs 1,250 crore, and an offer for sale of 9.03 crore shares, amounting to Rs 4,180 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-downturn-sensex-nifty-dalal-street-losing-streak-foreign-investor-exodus-dull-q2-earnings-2623206-2024-10-25",
      "headline": "Sensex, Nifty continue losing streak amid ongoing FII exodus, dull Q2 earnings At the closing bell, the Sensex was down 662.87 points at 79,402.29, while the NSE Nifty50 settled 189.55 points lower at 24,209.85. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/waaree-energies-ipo-listing-view-will-it-double-your-money-gmp-here-what-experts-say-2623194-2024-10-25",
      "headline": "Waaree Energies IPO: Will it double your investment? Here's what experts sayWaaree Energies IPO attracted significant interest from investors and was subscribed 79.44 times by the end of the bidding process on October 23, 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-dips-800-points-investors-traders-volatile-market-strategy-2623124-2024-10-25",
      "headline": "Sensex falls 800 points: Should investors buy the dip or hold back?Stock market bloodbath: This year's pre-Diwali period has been especially challenging for benchmark indices, with the Sensex and Nifty heading toward their steepest October decline since the Covid-driven crash in 2020."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-rs-10000-crore-will-tito-shantanu-naidu-who-gets-what-2623105-2024-10-25",
      "headline": "Ratan Tata's estate worth Rs 10,000 crore: Who gets what in his will Ratan Tata died on October 9 in Mumbai and left a Rs 10,000 crore will, which includes provisions for his near and dear ones. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dixon-technologies-shares-fall-over-9-percent-after-rally-short-lived-hit-record-high-should-you-buy-2623056-2024-10-25",
      "headline": "Explained: Why Dixon Technologies share price tumbled over 9% after early rallyThe company's stock reached a peak of Rs 15,999.95, rising by 6.21% after releasing impressive Q2 earnings on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/afcons-infrastructure-ipo-opens-for-bidding-subscribe-skip-good-bad-latest-gmp-review-2623022-2024-10-25",
      "headline": "Afcons Infrastructure IPO opens for bidding: Should you subscribe or skip? Afcons Infrastructure's IPO consists of a fresh issue of 2.7 crore shares, totalling Rs 1,250.00 crore, and an offer for sale of 9.03 crore shares, amounting to Rs 4,180.00 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/waaree-energies-ipo-check-latest-gmp-stock-market-debut-date-and-expected-listing-gains-2623028-2024-10-25",
      "headline": "Waaree Energies IPO: Check GMP, allotment details, listing date and expected gainsWaaree Energies IPO: With allotments finalised on October 24, the public issue is expected to have a bumper listing on October 28."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nvidia-is-vidya-mukesh-ambani-twist-on-chipmaker-name-delights-ceo-jensen-huang-ai-summit-2622986-2024-10-25",
      "headline": "Nvidia is Vidya: Mukesh Ambani's twist on chipmaker's name delights Jensen HuangMukesh Ambani, Chairman of Reliance Industries explained that in Indian culture, knowledge (Vidya) is believed to attract wealth, symbolised by Goddess Lakshmi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-is-stock-market-falling-key-reasons-behind-decline-foreign-investors-fiis-volatility-overvaluation-2622987-2024-10-25",
      "headline": "Sensex drops below 80,000 as market slide continues. What's behind the dip? Sensex plunges below 80,000. What's fueling the sharp decline? Check the key factors behind the distress on Dalal Street. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indusind-bank-share-price-declines-18-percent-q2-net-profit-tumbles-buy-hold-sell-brokerage-views-2622974-2024-10-25",
      "headline": "IndusInd Bank share price dips 18% after Q2 results. Should you buy, sell or hold?In the second quarter, IndusInd Bank's net profit plunged 39% year-on-year to Rs 1,325 crore, falling significantly short of what the market had expected. In comparison, the profit stood at Rs 2,181.47 crore in the same quarter a year ago."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-sensex-nifty-volatility-itc-indusind-bank-share-price-q2-results-2622971-2024-10-25",
      "headline": "Sensex, Nifty continue slide amid volatility; IndusInd Bank tumbles 15%The S&P BSE Sensex was down 370.19 points to 79,694.97 at 10:02 am, while the NSE Nifty50 declined 141 points to trade at 24,258.40."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-price-today-october-25-2024-precious-metals-witness-dip-on-mcx-latest-rates-2622961-2024-10-25",
      "headline": "Gold, silver price today, October 25, 2024: Precious metals witness dip on MCXGold Price Today October 25, 2024: Both gold and silver are trading on the lower side of the Multi Commodity Exchange (MCX) on Friday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-canada-tensions-hit-trade-leaving-business-owners-in-a-bind-2622688-2024-10-24",
      "headline": "India-Canada tensions hit trade, leaving business owners in a bindTotal trade between both nations since 2021, was at roughly $6 billion, increased to $9 billion in 2022, but dropped to $8 billion in 2023 as per data from the consulate general of India on commerce."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-mukesh-ambani-nvidia-jensen-huang-partner-to-build-large-scale-ai-infrastructure-in-india-2622561-2024-10-24",
      "headline": "Reliance, Nvidia partner to build large-scale AI infrastructure in IndiaThe partnership will see Reliance deploying Nvidia's latest GB 200 supercomputer technology to build a massive AI infrastructure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/waaree-energies-ipo-listing-date-expectations-double-investors-wealth-listing-over-rs-3000-latest-gmp-2622558-2024-10-24",
      "headline": "Waaree Energies IPO to double investors wealth? Here is what we knowWith the latest grey market premium (GMP) suggesting a sharp increase, Waaree Energies IPO is expected to deliver substantial returns to investors."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bandra-stampede-injured-passengers-festive-hometown-travel-railway-minister-mumbai-2624053-2024-10-27",
      "headline": "Festive rush, unreserved seats: How stampede broke out at Bandra TerminusThe stampede occurred after scores of passengers heading to their hometowns tried to board a moving Gorakhpur-bound unreserved train at the Bandra Terminus. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/actor-vijay-rally-tamilaga-vettri-kazhagam-tvk-conference-villupuram-tamil-nadu-2624073-2024-10-27",
      "headline": "Actor Vijay reveals party's goals: Tamil in courts, removing GovernorAt his maiden political rally in Villupuram, actor Vijay announced his party's ideology and goals, including promotion of Tamil as the administrative language in courts and removing the post of the Governor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-iran-attack-supreme-leader-khamenei-irna-hezbollah-lebanon-hamas-gaza-2624059-2024-10-27",
      "headline": "Israel's attack should neither be downplayed nor exaggerated, says Iran's KhameneiIran's Supreme leader Ayatollah Ali Khamenei said Iran's power should be demonstrated to Israel, adding that the way to do so should be \"determined by the officials and that which is in the best interest of the people and the country should take place\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/watch-odisha-man-carries-woman-to-ambulance-amid-heavy-rain-after-cyclone-dana-2624044-2024-10-27",
      "headline": "Video: Ambulance worker carries patient for 2 km amid heavy rain after Cyclone DanaAn ambulance worker carried a patient for 2 km amid heavy rains following Cyclone Dana in Odisha's Kendrapara district. Odisha Disaster Management Minister Suresh Pujari said that 35.95 lakh people in the state have been impacted by the cyclone, which hit the state on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/priyanka-gandhi-affidavit-why-the-bjp-is-crying-foul-over-priyanka-gandhis-assets-2623724-2024-10-26",
      "headline": "Why the BJP is crying foul over Priyanka Gandhi's assetsThe BJP's allegations of discrepancies in their declared assets show how controversies around spouse Robert Vadra still cast a shadow on Priyanka's electoral ambitions"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/uttar-pradesh-rss-supports-yogi-adityanath-slogan-2623988-2024-10-27",
      "headline": "RSS endorses Yogi Adityanath's 'batenge toh katenge' sloganAs the Uttar Pradesh Assembly elections approach, the RSS General Secretary has supported Chief Minister Yogi Adityanath's 'Batenge toh katenge' (if we are divided, we will be cut) slogan, and said that Hindu unity played a role in societal welfare and cautioning against divisive tactics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/donald-trump-google-ceo-sundar-pichai-praised-mcdonalds-visit-kamal-harris-2624025-2024-10-27",
      "headline": "Trump claims Google CEO Sundar Pichai praised his McDonald's visitAfter he worked for 15 minutes at a McDonald's outlet in Pennsylvania, former US President Donald Trump revealed that Sundar Pichai called him to commend his appearance at the outlet."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/video/video-people-continue-boarding-train-as-injured-man-lies-on-platform-after-stampede-2624029-2024-10-27",
      "headline": "Video: People continue boarding train as injured man lies on platform after stampedeOne video showed a man with blood oozing out of his wounds, while another injured passenger lay next to him. Shockingly, several people were seen boarding the compartment even as an injured person lay near them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/self-imposed-ban-cracker-fireworks-diwali-celebrations-debate-noise-air-pollution-smog-winter-season-pets-dogs-2623269-2024-10-27",
      "headline": "Has a self-imposed ban come in the way of a cracker of a Diwali?Bursting of crackers is a Diwali tradition. However, more people might now be consciously choosing to avoid fireworks. Multiple factors could be behind this change of attitude to a tradition that has been an integral part of Diwali celebrations for generations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/elevating-your-career-with-iim-kozhikodes-advanced-operations-analytics-and-supply-chain-management-programme-2621116-2024-10-22",
      "headline": "Elevating Your Career with IIM Kozhikode's Advanced Operations Analytics and Supply Chain Management ProgrammeElevate your career with IIM Kozhikode's comprehensive programme, designed to equip professionals with the latest tools and strategies in operations management and data analytics. Gain hands-on experience through live sessions, capstone projects, and industry-relevant assignments, while accessing the prestigious IIMK Executive Alumni network. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-will-learn-shastri-reacts-to-historic-series-loss-vs-new-zealand-2624026-2024-10-27",
      "headline": "Gautam Gambhir will learn: Shastri reacts to historic series loss vs New ZealandFormer India head coach Ravi Shastri has come in support of Gautam Gambhir after their historic Test series loss against New Zealand. Shastri has asked the fans to give Gambhir more time.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kanpur-woman-killed-by-gym-trainer-body-found-near-dm-compund-they-were-in-a-relationship-2623850-2024-10-27",
      "headline": "Kanpur woman murdered by gym trainer, body found buried in VIP areaKanpur News: According to the police, the woman was in a relationship with her gym trainer and was upset with his engagement with another woman. An argument ensued between them during which the gym trainer punched the woman, following which she fainted.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/german-company-billy-boy-launches-digital-condom-app-what-is-it-and-how-it-works-2624036-2024-10-27",
      "headline": "German company launches 'digital condom' app. Here is how it worksGerman sexual health brand Billy Boy launched an app, Camdom, coined as the \"digital condom.\" Read on to know what it is and how it works. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/uk-news/story/prince-william-on-price-harry-king-charles-uk-royal-family-tensions-2624017-2024-10-27",
      "headline": "Prince William mentions brother Harry amid family feud: My mother took me...Prince William opens up about a life-changing childhood visit to a homeless shelter with his brother, Prince Harry, guided by their late mother, Princess Diana, in his new documentary."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/maharashtra/story/mumbai-bandra-stampede-aaditya-thackeray-railway-minister-ashwini-vaishnaw-2623943-2024-10-27",
      "headline": "Aaditya Thackeray slams 'reel minister' Ashwini Vaishnaw over Bandra stampedeShiv Sena (UBT) leader Aaditya Thackeray strongly slammed Railway Minister Ashwini Vaishnaw over the recent stampede incident at Bandra Terminus, questioning the minister's capability to ensure railway safety."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammad-rizwan-first-message-new-captain-pakistan-cricket-team-2624054-2024-10-27",
      "headline": "Not a king, but captain: Mohammad Rizwan's first message to Pakistan teamMohammad Rizwan, the newly-appointed Pakistan white-ball captain, promises to prioritise team unity and dismisses any claims of groupism. He emphasises serving his teammates rather than ruling over them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/mysterious-green-spots-mars-raises-new-theory-life-red-planet-2624049-2024-10-27",
      "headline": "Mysterious green spots on Mars raises hopes of life on Red PlanetPerseverance rover used an abrading tool on a red rock outcrop named \"Wallace Butte,\" creating a 5-cm diameter patch that unveiled a stunning spectrum of colours: white, black, and a distinctive drab-green."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-business-sports-politics-entertainment-427-25-10-2024",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/millennial-india-is-finding-love-on-linkedin-and-work-on-bumble-2622331-2024-10-27",
      "headline": "Millennial India is finding love on LinkedIn and work on BumbleA recent study shows that 61 per cent of people aged 35 to 40 found their dates on LinkedIn. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-test-series-whitewash-2623933-2024-10-27",
      "headline": "When was the last time India got whitewashed in a home Test series? IND vs NZ: After losing the first two Tests in Bengaluru and Pune, India are in danger of getting whitewashed in their series against Tom Latham's New Zealand. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/kathak-flamenco-dance-duet-viral-video-stunning-indian-spanish-performance-2623942-2024-10-27",
      "headline": "Artists perform Kathak and Flamenco dance duet in viral video. Internet is hookedA video of a duet of India's Kathak and Spain's Flamenco dance forms has charmed the internet. Scroll down to watch the video. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-hamas-war-cia-mossad-chiefs-qatar-pm-gaza-ceasefire-hostage-talks-2624046-2024-10-27",
      "headline": "CIA, Mossad chiefs to meet Qatar PM for Gaza ceasefire, hostage talks: ReportThe purpose of the meeting is to secure a short-term ceasefire in Gaza between Israel and Hamas, with hopes of paving the way for a lasting agreement, the official stated."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/techie-sets-up-temporary-firecracker-shop-ahead-of-diwali-viral-x-post-internet-reacts-2624007-2024-10-27",
      "headline": "Techie sets up 'temporary' firecracker shop ahead of Diwali, Internet reactsIn a post on X, a techie shared two photographs of his \"temporary\" firecracker shop that he had set up in his hometown ahead of Diwali."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/diljit-dosanjh-wraps-indian-flag-performs-in-delhi-dil-luminati-india-tour-jawaharlal-nehru-stadium-2623836-2024-10-27",
      "headline": "Pics: Diljit Dosanjh waves Tricolour as he performs in Delhi, fans cheerSinger Diljit Dosanjh enthralled fans in Delhi with his performance on Day 1 of his Dil-Luminati India Tour. Several pictures and videos from the concert have gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/vikrant-massey-and-shanaya-kapoor-to-star-in-aankhon-ki-gustaakhiyan-2624079-2024-10-27",
      "headline": "Actors Vikrant Massey and Shanaya Kapoor to star in Aankhon Ki GustaakhiyanActor Vikrant Massey will soon be seen sharing screen space with actor Sanjay Kapoor's daughter, Shanaya Kapoor. They will be appearing together in the romantic drama, Aankhon Ki Gustaakhiyan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/r-madhavan-and-shalini-reunite-fans-demand-alaipayuthey-2-2624061-2024-10-27",
      "headline": "Actors R Madhavan and Shalini reunite, fans demand Alaipayuthey 2Actors R Madhavan and Shalini recently reunited for a sweet photo session. Shalini Ajith Kumar later shared photos on social media. The pair had shared screen space in Mani Ratnam's beloved film, Alaipayuthey. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jani-master-reunites-with-family-after-bail-truth-will-prevail-2624039-2024-10-27",
      "headline": "Choreographer Jani Master reunites with family after bail: Truth will prevailChoreographer Jani Master recently shared an emotional video after getting interim bail. He was accused of sexually assaulting a minor and was charged under the Protection Of Children from Sexual Offences (POCSO) Act. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/photo/shilpa-shetty-raj-kundra-bipasha-basu-karan-singh-grover-vijay-varma-ramesh-taurani-diwali-bash-2624021-2024-10-27",
      "headline": "Pics: Shilpa-Raj, Bipasha-Karan, celebs at Ramesh Taurani's Diwali bashProducer Ramesh Taurani's Diwali bash was a star-studded affair. Take a look at the actor who graced the party. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/fakhar-zaman-is-the-only-impact-player-pakistan-have-amir-slams-contract-snub-2624087-2024-10-27",
      "headline": "Fakhar is the only impact player Pakistan have: Amir slams contract snubPakistan pacer Mohammad Amir was not happy with batter Fakhar Zaman getting snubbed from the central contract. Amir, in a tweet, said that Fakhar was the only impact player that Pakistan had in their ODI side.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ajinkya-rahane-virat-kohli-border-gavaskar-trophy-india-vs-australia-2624085-2024-10-27",
      "headline": "Ajinkya Rahane recalls his favourite partnership with Virat KohliFormer India vice-captain Ajinkya Rahane named his favourite partnership with star India batter Virat Kohli in a recent conversation. Kohli and Rahane have the fifth highest runs as Test partners in Indian cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-vs-barcelona-inaki-pena-hansi-flick-confidence-last-season-el-clasico-2624083-2024-10-27",
      "headline": "Flick made us believe in ourselves: Barcelona's Pena after El Clasico winBarcelona's goalkeeper Iñaki Peña credited Hansi Flick's coaching for transforming the team's mindset, crucial in their 4-0 La Liga win over Real Madrid. With this victory, Barcelona strengthened their lead, showing remarkable cohesion under Flick's guidance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/msk-prasad-cheteshwar-pujara-border-gavaskar-trophy-2024-25-2624066-2024-10-27",
      "headline": "India need Cheteshwar Pujara's experience and solidity in Australia: MSK PrasadFormer India chief selector MSK Prasad has said that India requires Cheteshwar Pujara's experience and solidity in the upcoming five-match Test series against Australia."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/fakhar-zaman-removed-from-contract-over-tweets-fitness-concerns-mohsin-naqvi-2624055-2024-10-27",
      "headline": "Fakhar Zaman cannot go tweeting around on selection calls: Mohsin NaqviA Pakistan national team player cannot go tweeting around on calls made by the selection committee, said Mohsin Naqvi on the matter of Fakhar Zaman getting dropped from the central contract. Seen as one of Pakistan's main players even weeks back, the left-hander was axed from the central contract on October 27, Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammad-rizwan-first-message-new-captain-pakistan-cricket-team-2624054-2024-10-27",
      "headline": "Not a king, but captain: Mohammad Rizwan's first message to Pakistan teamMohammad Rizwan, the newly-appointed Pakistan white-ball captain, promises to prioritise team unity and dismisses any claims of groupism. He emphasises serving his teammates rather than ruling over them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/radha-yadav-takes-back-to-back-stunning-catches-vs-new-zealand-in-2nd-odi-2624042-2024-10-27",
      "headline": "Watch: Radha Yadav takes back-to-back jaw-dropping catches vs New ZealandIndia spinner Radha Yadav took back to back stunning catches vs New Zealand during the second ODI of the three-match series in Ahmedabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-odi-t20i-team-new-captain-babar-azam-mohsin-naqvi-mohammad-rizwan-2624045-2024-10-27",
      "headline": "No one from Pakistan board forced Babar Azam to step down as captain: NaqviPakistan Cricket Board chairman Mohsin Naqvi said that no one from the board forced Babar Azam to relinquish the captaincy of the Pakistan side. Speaking at the press conference on Sunday, October 27, Naqvi unveiled Mohammad Rizwan as the captain of the white-ball team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammad-rizwan-odi-t20i-captain-replaces-babar-azam-salman-ali-agah-zimbabwe-tour-2624038-2024-10-27",
      "headline": "Rizwan replaces Babar Azam as Pakistan ODI, T20I captainMohammad Rizwan has been appointed Pakistan's new ODI and T20I captain, taking over from Babar Azam after a series of disappointing World Cup performances. PCB Chairman Mohsin Naqvi announced Rizwan as the new skipper, while Slaman Ali Agah was named the vice-captain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/indian-super-league-mumbai-city-fc-vs-odisha-fc-bipin-singh-exclusive-aim-for-top-2624031-2024-10-27",
      "headline": "Mumbai City always aim for the top: Bipin Singh ahead of Odisha clashMumbai City FC's Bipin Singh remains optimistic about a season turnaround despite a rough start. The defending ISL champions aim to climb the rankings and regain form as they prepare for a crucial match against Odisha FC."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-will-learn-shastri-reacts-to-historic-series-loss-vs-new-zealand-2624026-2024-10-27",
      "headline": "Gautam Gambhir will learn: Shastri reacts to historic series loss vs New ZealandFormer India head coach Ravi Shastri has come in support of Gautam Gambhir after their historic Test series loss against New Zealand. Shastri has asked the fans to give Gambhir more time.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/radha-yadav-takes-back-to-back-stunning-catches-vs-new-zealand-in-2nd-odi-2624042-2024-10-27",
      "headline": "Watch: Radha Yadav takes back-to-back jaw-dropping catches vs New ZealandIndia spinner Radha Yadav took back to back stunning catches vs New Zealand during the second ODI of the three-match series in Ahmedabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-odi-t20i-team-new-captain-babar-azam-mohsin-naqvi-mohammad-rizwan-2624045-2024-10-27",
      "headline": "No one from Pakistan board forced Babar Azam to step down as captain: NaqviPakistan Cricket Board chairman Mohsin Naqvi said that no one from the board forced Babar Azam to relinquish the captaincy of the Pakistan side. Speaking at the press conference on Sunday, October 27, Naqvi unveiled Mohammad Rizwan as the captain of the white-ball team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammad-rizwan-odi-t20i-captain-replaces-babar-azam-salman-ali-agah-zimbabwe-tour-2624038-2024-10-27",
      "headline": "Rizwan replaces Babar Azam as Pakistan ODI, T20I captainMohammad Rizwan has been appointed Pakistan's new ODI and T20I captain, taking over from Babar Azam after a series of disappointing World Cup performances. PCB Chairman Mohsin Naqvi announced Rizwan as the new skipper, while Slaman Ali Agah was named the vice-captain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/indian-super-league-mumbai-city-fc-vs-odisha-fc-bipin-singh-exclusive-aim-for-top-2624031-2024-10-27",
      "headline": "Mumbai City always aim for the top: Bipin Singh ahead of Odisha clashMumbai City FC's Bipin Singh remains optimistic about a season turnaround despite a rough start. The defending ISL champions aim to climb the rankings and regain form as they prepare for a crucial match against Odisha FC."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-will-learn-shastri-reacts-to-historic-series-loss-vs-new-zealand-2624026-2024-10-27",
      "headline": "Gautam Gambhir will learn: Shastri reacts to historic series loss vs New ZealandFormer India head coach Ravi Shastri has come in support of Gautam Gambhir after their historic Test series loss against New Zealand. Shastri has asked the fans to give Gambhir more time.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-launch-investigation-into-reported-racist-insult-at-lamine-yamal-2624024-2024-10-27",
      "headline": "Real Madrid launch investigation into reported racist insult at Lamine YamalReal Madrid has launched an investiagtion into the reported racist insults directed at Barcelona players, including Lamine Yamal during the El Clasico on Ocotber 26, Saturday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ahmed-shehzad-ind-vs-nz-new-zealand-beat-india-2624013-2024-10-27",
      "headline": "Ahmed Shehzad's dissects India's loss vs New Zealand: Kagaz ke sher ghar me dherFormer Pakistan cricketer Ahmed Shehzad has come down heavily on India after they lost their first Test series at home against New Zealand. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/border-gavaskar-trophy-india-vs-australia-mohammed-shami-misses-out-andrew-mcdonald-2624008-2024-10-27",
      "headline": "Mohammed Shami big loss for India, won't underestimate reserves: Australia coachAustralia coach Andrew McDonald has claimed that Mohammed Shami will be a big loss for India during the Border-Gavaskar Trophy in November. Shami was the big omission from the India squad for the series down under. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/wwe-crown-jewel-2024-bronson-reed-exclusive-cody-rhodes-feud-wrestlemania-41-2623989-2024-10-27",
      "headline": "Cody Rhodes feud, WWE WrestleMania 41 main card: Bronson Reed on 2025 goalsIn an exclusive interaction with Indiatoday.in, WWE's Bronson Reed revealed his goals for 2025 with a match in the main card of WrestleMania 41 and a feud with Undisputed Champion Cody Rhodes at the top of the wishlist. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/fakhar-zaman-babar-azam-pakistan-cricket-board-central-contract-2024-25-2623985-2024-10-27",
      "headline": "Fakhar Zaman loses Pakistan central contract after defending Babar AzamStar Pakistan batter Fakhar Zaman has been removed from the list of centrally contract players for the season 2024-25 after openly criticising PCB for resting Babar Azam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shan-masood-shaheen-shah-afridi-pakistan-central-contracts-2623979-2024-10-27",
      "headline": "Masood promoted in Pakistan central contracts, Shaheen demoted Pakistan have announced their central contracts for the men's team for the 2024-25 season. Babar Azam and Mohammad Rizwan are the ones in Category A while Shaheen Shah Afridi dropped to Category B. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-pune-test-sanjay-manjrekar-rohit-sharma-gautam-gambhir-2623976-2024-10-27",
      "headline": "IND vs NZ: Sanjay Manjrekar advises Rohit Sharma to come out of 'T20 thinking' Former India cricketer Sanjay Manjrekar has advised Rohit Sharma to come out of 'T20 thinking' after series loss against New Zealand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/manika-batras-historic-wtt-champions-run-ends-in-quarterfinals-2623965-2024-10-27",
      "headline": "Manika Batra's historic WTT Champions run ends in quarterfinalsManika Batra's remarkable journey at the WTT Champions in Montpellier ended with a quarterfinal loss to China's Qian Tianyi. Despite the defeat, Batra set a new benchmark for Indian table tennis, becoming the first Indian to reach the quarterfinals of this elite event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/fakhar-zaman-babar-azam-pakistan-cricket-board-central-contract-2024-25-2623985-2024-10-27",
      "headline": "Fakhar Zaman loses Pakistan central contract after defending Babar AzamStar Pakistan batter Fakhar Zaman has been removed from the list of centrally contract players for the season 2024-25 after openly criticising PCB for resting Babar Azam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shan-masood-shaheen-shah-afridi-pakistan-central-contracts-2623979-2024-10-27",
      "headline": "Masood promoted in Pakistan central contracts, Shaheen demoted Pakistan have announced their central contracts for the men's team for the 2024-25 season. Babar Azam and Mohammad Rizwan are the ones in Category A while Shaheen Shah Afridi dropped to Category B. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-nz-pune-test-sanjay-manjrekar-rohit-sharma-gautam-gambhir-2623976-2024-10-27",
      "headline": "IND vs NZ: Sanjay Manjrekar advises Rohit Sharma to come out of 'T20 thinking' Former India cricketer Sanjay Manjrekar has advised Rohit Sharma to come out of 'T20 thinking' after series loss against New Zealand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/manika-batras-historic-wtt-champions-run-ends-in-quarterfinals-2623965-2024-10-27",
      "headline": "Manika Batra's historic WTT Champions run ends in quarterfinalsManika Batra's remarkable journey at the WTT Champions in Montpellier ended with a quarterfinal loss to China's Qian Tianyi. Despite the defeat, Batra set a new benchmark for Indian table tennis, becoming the first Indian to reach the quarterfinals of this elite event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-pakistan-squads-australia-pakistan-odi-t20i-squads-2623962-2024-10-27",
      "headline": "Babar Azam rested for Zimbabwe tour, available for Australia series Babar Azam, Shaheen Shah Afridi and Naseem Shah will take part in the ODI and T20I series in Australia, but have been rested from the limited-overs series in Zimbabwe. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harmanpreet-kaur-india-women-vs-new-zealan-women-priya-mishra-amelia-kerr-2623960-2024-10-27",
      "headline": "Harmanpreet Kaur returns for second ODI vs New Zealand, Priya Mishra makes debutIndia women's cricket team captain Harmanpreet Kaur has marked her return to the side for the second ODI against New Zealand after missing the series opener due to a niggle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/border-gavaskar-trophy-india-vs-australia-david-warner-retirement-u-turn-andrew-mcdonald-2623944-2024-10-27",
      "headline": "David Warner's retirement U-turn for India series: Australia coach reactsAustralia coach Andrew McDonald dismisses the idea of David Warner returning for the upcoming Border-Gavaskar Trophy against India. Warner has shown interest in playing, but McDonald emphasizes no discussions have occurred."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}