{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/necktie-nomics-can-the-rbi-governor-tie-colour-predict-rate-moves-2752135-2025-07-07",
      "headline": "Necktie Nomics: Can the RBI Governor's tie colour predict rate moves?An SBI report looked at the ties worn by the RBI Governor during Monetary Policy Committee (MPC) meetings. Instead of only watching inflation numbers or GDP data, they turned their attention to the shades of silk draped around the Governor's neck."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-trump-tariff-trade-sensex-ends-flat-nifty-below-25500-hul-gains-3-2752040-2025-07-07",
      "headline": "Sensex ends flat, Nifty below 25,500; HUL gains 3%The S&P BSE Sensex closed 9.61 points higher at 83,442.50, while the NSE Nifty remained flat to end below 25,500."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gccs-global-capability-centres-push-indias-office-leasing-to-new-heights-report-2751996-2025-07-07",
      "headline": "GCCs push India's office leasing to new heights: ReportGCCs are no longer coming to India just for cheaper costs. They now see India as a strong base for talent, innovation and large modern offices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sebi-increase-watch-derivative-trading-sanjay-malhotra-jane-street-ban-fo-stock-market-news-2751986-2025-07-07",
      "headline": "Sebi to intensify watch on derivatives trading after Jane Street episodeIndia is currently the world's largest equity derivatives market. According to the Futures Industry Association, it accounted for nearly 60% of the derivatives contracts traded globally in April."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/emis-hurt-india-middle-class-more-than-inflation-says-financial-expert-2751948-2025-07-07",
      "headline": "EMIs hurt India's middle class more than inflation, says financial expertToday, almost everything is available on easy monthly instalments, from a new phone to flight tickets, even groceries. What was once a helpful option has now turned into a lifestyle. However, this is silently eating into people's income, leaving little room for savings or emergencies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filing-itr-for-the-first-time-7-common-errors-new-taxpayers-must-avoid-2751883-2025-07-07",
      "headline": "Filing ITR for the first time? 7 common errors new taxpayers must avoidFiling your ITR is not enough. You must verify it too. If you forget, the tax department treats it as if you never filed it at all. You can e-verify using Aadhaar OTP, net banking, or by sending a signed physical copy. Without verification, your return stays incomplete."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/house-rent-above-rs-50000-heres-the-tds-rule-you-need-to-know-2751860-2025-07-07",
      "headline": "House rent above Rs 50,000? Here's the TDS rule you need to knowFor tenants living in high-rent homes, the line between a routine payment and a tax lapse can be thinner than it seems, and ignoring it can invite penalties that quickly snowball."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/hul-share-price-hindustan-unilever-q1-results-brokerage-views-ubs-nuvama-should-you-buy-2751850-2025-07-07",
      "headline": "HUL shares gain 2% today. Should you buy the FMCG stock?HUL share price: The stock has gained 3.67% in the last five trading sessions. However, when looking at a longer time frame, the stock is still down 7.97% over the past year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/lost-rs-18-lakh-in-6-months-financial-advisor-abhishek-walia-warning-on-online-betting-2751836-2025-07-07",
      "headline": "Lost Rs 18 lakh in 6 months: Financial advisor's warning on online bettingWhat begins as casual fun can spiral into secrecy, debt, and broken trust. A financial advisor warns that, without strong regulation, betting apps are fast becoming one of India's biggest financial threats."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tariffs-steel-auto-aluminium-interim-trade-deal-us-trump-deadline-commerce-2751832-2025-07-07",
      "headline": "Tariffs on steel, auto unlikely in interim trade deal with US: Government sourcesWith the US to soon notify countries of higher tariffs by July 9, with new rates effective August 1, sectoral levies on steel, auto and aluminium are unlikely in the India-US interim trade deal, government sources said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-100-points-lower-nifty-below-25500-hul-up-1-percent-2751812-2025-07-07",
      "headline": "Sensex opens 100 points lower, Nifty below 25,500; HUL up 2%The S&P BSE Sensex was down by 65.28 points to 83,367.61, while the NSE Nifty50 lost 16.45 points to 25,444.55 as of 9:50 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-tariff-us-trade-letters-india-deal-global-trade-what-to-expect-stock-market-2751802-2025-07-07",
      "headline": "Trump reveals tariff letter plan with a twist: Here's what's coming nextTrump also said that any country supporting what he called the 'Anti-American policies' of the BRICS group will face an additional 10% tariff."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/smriti-irani-returns-tulsi-kyunki-saas-bhi-kabhi-bahu-thi-reboot-official-announcement-statement-2752121-2025-07-07",
      "headline": "Smriti Irani announces her return to Kyunki, vows to boost India's creative industrySmriti Irani announced her return as Tulsi Virani in the 'Kyunki Saas Bhi Kabhi Bahu Thi' reboot, highlighting the show's impact on her life and its contribution to Indian television. She released a detailed statement expressing her joy and a promise of creativity. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sara-arjun-career-chiryaan-vikram-daughter-deiva-thirumagal-ranveer-singh-pair-dhurandhar-2752072-2025-07-07",
      "headline": "Who is Sara Arjun, 20-year-old romancing Ranveer Singh in Dhurandhar?20-year-old Sara Arjun has been trending on social media ever since 'Dhurandhar' first look was released on Ranveer Singh's 40th birthday, July 6. Amid debate about the 20-year age-gap between the two, here's all you need to know about actor Sara Arjun. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kajol-nervous-acting-with-mother-tanuja-shares-surreal-experience-2752068-2025-07-07",
      "headline": "Exclusive: Kajol says working with mother Tanuja made her shiverKajol revealed she shivered while shooting with her mother Tanuja, describing the experience as surreal. The duo were shooting for the film, Toonpur Ka Superrhero."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anurag-kashyap-daughter-aaliyah-re-marries-shane-gregoire-beautiful-pics-khushi-kapoor-reacts-2752066-2025-07-07",
      "headline": "Anurag Kashyap's daughter Aaliyah re-marries Shane Gregoire, Khushi Kapoor reactsInfluencer Aaliyah Kashyap and Shane Gregoire got married again in a Christian ceremony on Monday. Aaliyah, who is the daughter of director Anurag Kashyap, shared photos from the ceremony on Instagram. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/dakota-johnson-direct-first-feature-film-autistic-actor-vanessa-burghardt-2751970-2025-07-07",
      "headline": "Dakota Johnson on directing her first feature film: It's really close to my heartActor Dakota Johnson recently opened up about directing her first feature film. The film is based on a script by Vanessa Burghardt, an actor with a neurodivergent condition, and her co-star from 'Cha Cha Real Smooth'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-premiere-date-contestants-lineup-hosts-name-when-and-where-to-watch-salman-khan-show-2752060-2025-07-07",
      "headline": "Bigg Boss 19 premieres soon: Lineup, hosts, when and where to watch Salman's showIt seems like the team of 'Bigg Boss 19' is planning to get a new hosting team along with Salman Khan. Karan Johar, Farah Khan, and Anil Kapoor are potential successors. The show is anticipated to start sooner than you expect. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/adivi-sesh-calls-dacoit-sholay-of-2025-praises-mrunal-thakur-life-coach-2752047-2025-07-07",
      "headline": "Exclusive: Adivi Sesh calls Dacoit the Sholay of 2025, praises co-star Mrunal ThakurAdivi Sesh is all set to surprise audiences with his next, 'Dacoit'. The film, which also features Mrunal Thakur and Anurag Kashyap, promises an emotional neo-Western experience hitting theatres on December 25, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/zayn-malik-hints-at-facing-racism-during-one-direction-days-in-new-song-fuchsia-sea-2752016-2025-07-07",
      "headline": "Zayn Malik hints at facing racism during One Direction days in new songZayn Malik recently shared the lyrics of his upcoming song, 'Fuchsia Sea', on social media. The song suggests that he experienced racial discrimination during his One Direction days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/youtuber-purav-jha-responds-as-jasmin-bhasin-calls-apoorva-mukhija-ill-mannered-2751942-2025-07-07",
      "headline": "YouTuber Purav Jha responds to Jasmin Bhasin calling Apoorva Mukhija ill-manneredYouTuber Purav Jha stood by his friend and 'The Traitors' co-star Apoorva Mukhija, aka Rebel Kid, in a recent interview. He highlighted that Apoorva's bold personality is appreciated by her audience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/panchayat-season-5-confirmed-for-2026-season-4-breaks-franchise-records-2752007-2025-07-07",
      "headline": "Panchayat Season 5 confirmed for 2026 after Season 4 breaks franchise recordsThe new season of TVF's 'Panchayat' has been renewed for 2026. After the success of season 4, the Prime Video series has confirmed season 5 of the comedy-drama series.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/smriti-irani-first-official-look-from-kyunkii-saas-bhi-kabhi-bahu-thi-is-pure-nostalgia-see-pic-2752017-2025-07-07",
      "headline": "Smriti Irani's first official look from Kyunki Saas Bhi... reboot is pure nostalgiaActor Smriti Irani reprises her iconic character - Tulsi Virani - in the new season of the popular show 'Kyunki Saas Bhi Kabhi Bahu Thi.' The actor's first-look from the show is now out and being circulated on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/apoorva-mukhija-on-india-got-latent-controversy-grateful-2751849-2025-07-07",
      "headline": "Grateful that it happened to me: Apoorva Mukhija on India's Got Latent controversySocial media influencer Apoorva Mukhija expressed gratitude for 'India's Got Latent' row. She reflected on how the controversy led to personal growth and detachment from online negativity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/james-gunn-discusses-themes-of-humanity-in-david-corenswet-superman-says-its-about-an-immigrant-2751991-2025-07-07",
      "headline": "James Gunn says Superman is an immigrant story, may not resonate with allThe upcoming film 'Superman', directed by James Gunn, is portrayed as a tale of America through the eyes of an immigrant seeking hope and purpose. It delves into themes of basic human kindness, morality, and politics, highlighting the contrasting beliefs between Superman and Lois Lane."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/zareen-khan-shares-fangirl-moment-with-katrina-kaif-in-an-old-video-2751983-2025-07-07",
      "headline": "Zareen Khan shares fangirl moment with Katrina Kaif in an old video. WatchZareen Khan shared a throwback video of her taking Katrina Kaif's autograph at the 'Race' (2008) premiere, calling it a true fangirl moment. She recalled how she never imagined being part of the film industry back then."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/why-rashmika-mandanna-first-kodava-actor-claim-upset-her-own-community-2751981-2025-07-07",
      "headline": "Why Rashmika Mandanna's 'first Kodava actor' claim has angered her communityActor Rashmika Mandanna, in a recent interview, called herself the first Kodava actor. Her claim has angered the artistes who had entered the film industry before her.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ishaan-khatter-changed-17-homes-by-age-16-calls-it-bombays-struggling-lifestyle-2751890-2025-07-07",
      "headline": "Ishaan Khatter changed 17 homes by age 16, calls it Bombay's struggling lifestyleActor Ishaan Khatter talked about his modest upbringing in a recent interview. He shared that he had to live in 17 different homes by the time he turned 16, citing what he called a 'Bombay struggling lifestyle'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/andrew-garfield-monica-barbaro-twin-in-white-confirm-relationship-at-wimbledon-2025-2751920-2025-07-07",
      "headline": "Andrew Garfield-Monica Barbaro twin in white, confirm relationship at Wimbledon 2025Actor Andrew Garfield and his girlfriend, Monica Barbaro, were twinning in white at Wimbledon 2025 while sharing sweet PDA moments. The couple were rumoured to be dating since earlier this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/imtiaz-ali-mother-75th-birthday-bash-in-pahalgam-2751960-2025-07-07",
      "headline": "Filmmaker Imtiaz Ali celebrates his mother's 75th birthday in PahalgamFilmmaker Imtiaz Ali celebrated his mother's 75th birthday in Pahalgam, sharing moments from the celebration on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/gurmeet-choudhary-honoured-with-bihar-gaurav-award-says-forever-a-proud-bihari-2751947-2025-07-07",
      "headline": "Gurmeet Choudhary honoured with Bihar Gaurav Award, says forever a proud BihariActor Gurmeet Choudhary was honoured with the Bihar Gaurav Award by Chirag Paswan and Governor Arif Mohammed Khan for his contributions to entertainment. Calling it a proud moment, the actor shared photos from the event and said that Biharis are known by their actions, not words."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/china-objects-to-pm-modis-birthday-wishes-to-dalai-lama-on-90th-milestone-china-fumes-as-pm-modi-greets-dalai-lama-on-90th-birthday-warns-india-on-tibet-stance-2752142-2025-07-07",
      "headline": "China fumes as PM greets Dalai Lama on 90th birthday, warns India on Tibet stanceChinese Foreign Ministry spokesperson Mao Ning told reporters that the country's position on Tibet is consistent and well-known. Mao further stated that the Dalai Lama is a political exile and alleged that he has been involved in efforts to separate Xizang -- also known as Tibet outside China -- under the guise of religion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tahawwur-rana-revelations-nia-custody-mumbai-terror-attacks-26-11-pakistan-connection-2751903-2025-07-07",
      "headline": "Tahawwur Rana was in Mumbai to oversee 26/11 attack, interrogation revealsDuring questioning by the Mumbai Crime Branch in NIA custody, Tahawwur Rana confirmed his presence in Mumbai during the 26/11 attacks and that it was part of the terrorists' plan, sources told India Today TV."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjp-mp-nishikant-dubey-dares-raj-thackeray-uddhav-thackeray-assault-people-in-north-indian-states-2752077-2025-07-07",
      "headline": "Patak-patak ke maarenge: BJP MP dares Thackerays to assault people in UP, BiharThe BJP Godda MP said if Raj and Uddhav Thackeray have the guts they should try and assault people who speak Urdu, Tamil or Telugu in Maharashtra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/mumbai/story/mumbai-politicians-drunk-son-rams-into-influencers-car-abuses-her-on-camera-2752022-2025-07-07",
      "headline": "Video: Drunk, semi-naked son of Mumbai politician abuses influencer on cameraA Maharashtra politician's son was filmed verbally abusing a social media influencer who confronted him for ramming into her car. In the video, the politician's son appears half-naked and seems to be under the influence of alcohol."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/why-sexual-desire-discrepancy-in-relationships-is-more-common-than-you-think-2751984-2025-07-07",
      "headline": "We match in everything…except sexThey laugh together, parent well, plan their future, but there is one aspect that keeps them distant - their sex life. Welcome to the quietly simmering struggle of sexual desire discrepancy, a dynamic more couples experience than admit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/no-charity-owaisi-on-kiren-rijijus-indian-minorities-benefit-more-remark-2752132-2025-07-07",
      "headline": "Indian Muslims hostages, not citizens: Owaisi on Kiren Rijiju's minorities remarkAsaduddin Owaisi and Kiren Rijiju were locked in a high-voltage war of words over Muslim rights and their present situation in India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/zohran-mamdani-faces-scrutiny-2015-tweets-al-qaida-terrorist-al-awlaki-us-cleric-fbi-barack-obama-911-victims-2751962-2025-07-07",
      "headline": "Mamdani's 2015 post on al-Qaida terrorist returns to haunt himNew York City's Democratic mayoral candidate Zohran Mamdani is under fire after his old tweets from 2015 resurfaced, criticising the FBI's surveillance on an al-Qaida terrorist, Anwar al-Awlaki. Critics, including 9/11 victims' families and government officials, are accusing Mamdani of undermining US' counterterrorism efforts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-day-8-live-score-updates-novak-djokovic-jannik-sinner-iga-swiatek-2752056-2025-07-07",
      "headline": "Wimbledon Live Updates, Day 8: Djokovic loses first set, Cilic battles onWimbledon 2025 Day 8 Live Updates: Novak Djokovic has had a horrendous start against Alex de Minaur. Meanwhile Maren Cilic remains in the hunt after winning his first set point."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/smriti-irani-first-official-look-from-kyunkii-saas-bhi-kabhi-bahu-thi-is-pure-nostalgia-see-pic-2752017-2025-07-07",
      "headline": "Smriti Irani's first official look from Kyunki Saas Bhi... reboot is pure nostalgiaActor Smriti Irani reprises her iconic character - Tulsi Virani - in the new season of the popular show 'Kyunki Saas Bhi Kabhi Bahu Thi.' The actor's first-look from the show is now out and being circulated on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kangana-ranaut-no-cabinet-remark-himachal-pradesh-cloudburst-mandi-visit-2751969-2025-07-07",
      "headline": "MP Kangana Ranaut defends 'I don't have funds' remark on Himachal flood reliefAfter her 'no cabinet post' remark while seeking disaster relief for rain-hit Himachal Pradesh, BJP MP Kangana Ranaut remained firm on her statement, saying it was not controversial and a way of expression."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/special-intensive-revision-sir-electoral-rolls-bihar-citizenship-verification-election-commission-opposition-rjd-congress-2750969-2025-07-07",
      "headline": "Voter rolls revision is legal, moral and essential. So, what's the problem?An intensive vetting of electoral rolls is a must to ensure that only Indian citizens get to decide on the country's politics and policy. If the Election Commission (EC) is mandated to conduct a special intensive revision (SIR) of voter lists, why is there such opposition to the exercise in Bihar from political parties?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/who-is-akash-deep-sister-akhand-jyoti-singh-exclusive-england-vs-india-2751909-2025-07-07",
      "headline": "Don't worry about me, do well for India: Akash Deep's sister amid cancer battleIndia pacer Akash Deep delivered a remarkable 10-wicket haul at Edgbaston and dedicated it to his sister battling cancer. In an exclusive interview with Aajtak, Akash Deep's sister reacted to her brother's viral interview and her own cancer treatment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/prada-crocs-birkenstock-shoemakers-legal-battles-kolhapuri-chappal-2752163-2025-07-07",
      "headline": "Prada, Crocs, now Birkenstock: Why these shoemakers are in the newsPrada, Crocs and Birkenstock are in the news in India over legal rows and cultural backlash — from counterfeits and copyright battles to criticism over using Kolhapuri chappals designs."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ghaziabad-woman-beats-elderly-mother-in-law-cctv-video-viral-uttar-pradesh-2751762-2025-07-07",
      "headline": "Video: Elderly woman dragged, beaten by daughter-in-law, her mother in GhaziabadAn elderly woman was dragged and thrashed by her daughter-in-law and her mother in Ghaziabad. A case was registered after CCTV footage came to light."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/asim-munir-pakistan-kargil-hero-karnal-sher-khan-india-letter-bajwa-nishan-e-haider-disowned-body-first-2751972-2025-07-07",
      "headline": "Munir hails Pak Kargil War hero, but a letter from India revealed his bravery firstAs Pakistan Army Chief Asim Munir, along with the top military brass, paid tribute to Kargil War hero, Captain Karnal Sher Khan, on his 26th martyrdom anniversary, it's worth remembering that it was an Indian Brigadier's letter that first ensured Khan's bravery didn't go unrecognised. Pakistan had initially disowned Sher Khan and refused to claim his body from Indian soil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/we-oppose-tariffs-being-used-as-tool-to-coerce-others-china-on-trumps-fresh-threat-to-brics-nations-2751957-2025-07-07",
      "headline": "Brics not seeking confrontation: China calls Trump's tariff threat coercion toolThe Chinese foreign ministry said that the use of tariffs benefits no one and opposed the idea of using tariffs as a tool to coerce others."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/necktie-nomics-can-the-rbi-governor-tie-colour-predict-rate-moves-2752135-2025-07-07",
      "headline": "Necktie Nomics: Can the RBI Governor's tie colour predict rate moves?An SBI report looked at the ties worn by the RBI Governor during Monetary Policy Committee (MPC) meetings. Instead of only watching inflation numbers or GDP data, they turned their attention to the shades of silk draped around the Governor's neck."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/doha-man-slams-air-india-asking-80-year-old-wheelchair-bound-mother-to-deboard-via-stairs-at-delhi-airport-2752137-2025-07-07",
      "headline": "Man slams Air India for asking wheelchair-bound mother, 80, to deboard via stairsIn a now-viral post on X, a Doha-based man alleged that Air India asked his 80-year-old wheelchair-bound mother to deboard a flight in Delhi using stairs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/inside-the-teenage-vaping-crisis-lungs-hearts-and-minds-at-risk-smoking-schools-hookah-2752108-2025-07-07",
      "headline": "Inside the teenage vaping crisis: Lungs, hearts, and minds at riskFrom inflamed lungs and stressed hearts to rewired young brains, the health fallout of vaping is no longer speculation. It's here, and it's real"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/lingayat-seer-supports-dk-shivakumar-for-karnataka-chief-minister-says-congress-must-honour-pact-dk-says-high-command-will-decide-2752042-2025-07-07",
      "headline": "Everybody has desires: DK Shivakumar on Karnataka seer's leadership pact remarkA top Lingayat Panchamasali seer in Karnataka backed DK Shivakumar for Chief Minister and urged Congress to honour their leadership pact. Shivakumar, however, said decisions rest with the high command. Dinesh Gundu Rao questioned the seer's political comments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/kerala-woman-forest-officer-rescues-15-foot-king-cobra-6-minutes-daring-snake-video-viral-2752087-2025-07-07",
      "headline": "Kerala woman forest officer rescues 15-foot King Cobra in 6 minutes. Watch videoGS Roshni, a forest officer with around eight years of experience in handling snakes, was calm enough as she wrangled the massive reptile - her first king cobra rescue – within six minutes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/brics-summit-2025-xi-jinping-absence-speculations-power-shift-chinese-president-military-purge-2751294-2025-07-07",
      "headline": "Where is Xi Jinping amid China's military purge?Chinese President Xi Jinping's absence from public view, appearing only twice in videos in over a month, amid a military purge and economic challenges, has fuelled speculation of a power shift in the Chinese Communist Party. With former President Hu Jintao's allies reportedly gaining influence, Xi's absence from the Brics summit has raised questions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indore-woman-harassed-beef-religion-conversion-begusarai-love-jihad-facebook-2751758-2025-07-07",
      "headline": "Forced to eat beef, convert religion: Indore woman accuses husband of 'love jihad'A woman from Indore alleged mental and physical harassment by her husband in Bihar over her refusal to eat beef and convert her religion. She approached police seeking to return home, while the husband denied all allegations.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sara-arjun-career-chiryaan-vikram-daughter-deiva-thirumagal-ranveer-singh-pair-dhurandhar-2752072-2025-07-07",
      "headline": "Who is Sara Arjun, 20-year-old romancing Ranveer Singh in Dhurandhar?20-year-old Sara Arjun has been trending on social media ever since 'Dhurandhar' first look was released on Ranveer Singh's 40th birthday, July 6. Amid debate about the 20-year age-gap between the two, here's all you need to know about actor Sara Arjun. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sara-arjun-career-chiryaan-vikram-daughter-deiva-thirumagal-ranveer-singh-pair-dhurandhar-2752072-2025-07-07",
      "headline": "Who is Sara Arjun, 20-year-old romancing Ranveer Singh in Dhurandhar?20-year-old Sara Arjun has been trending on social media ever since 'Dhurandhar' first look was released on Ranveer Singh's 40th birthday, July 6. Amid debate about the 20-year age-gap between the two, here's all you need to know about actor Sara Arjun. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kajol-nervous-acting-with-mother-tanuja-shares-surreal-experience-2752068-2025-07-07",
      "headline": "Exclusive: Kajol says working with mother Tanuja made her shiverKajol revealed she shivered while shooting with her mother Tanuja, describing the experience as surreal. The duo were shooting for the film, Toonpur Ka Superrhero."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anurag-kashyap-daughter-aaliyah-re-marries-shane-gregoire-beautiful-pics-khushi-kapoor-reacts-2752066-2025-07-07",
      "headline": "Anurag Kashyap's daughter Aaliyah re-marries Shane Gregoire, Khushi Kapoor reactsInfluencer Aaliyah Kashyap and Shane Gregoire got married again in a Christian ceremony on Monday. Aaliyah, who is the daughter of director Anurag Kashyap, shared photos from the ceremony on Instagram. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/dakota-johnson-direct-first-feature-film-autistic-actor-vanessa-burghardt-2751970-2025-07-07",
      "headline": "Dakota Johnson on directing her first feature film: It's really close to my heartActor Dakota Johnson recently opened up about directing her first feature film. The film is based on a script by Vanessa Burghardt, an actor with a neurodivergent condition, and her co-star from 'Cha Cha Real Smooth'."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sa-vs-zim-2nd-test-wiaan-mulder-367-brian-lara-record-2752136-2025-07-07",
      "headline": "Why did Wiaan Mulder declare on 367, 33 runs short of Brian Lara's Test record?South Africa vs Zimbabwe, 2nd Test: Wiaan Mulder declared when batting on 367 on Day 2 of the second Test against Zimbabwe in Bulawayo. The stand-in captain had the opportunity to break Brian Lara's all-time record, but chose against it. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-brendon-mccullum-on-englands-loss-at-edgbaston-2752126-2025-07-07",
      "headline": "We ran second for 5 days: McCullum reflects on crucial toss errorEngland head coach Brendon McCullum admitted that they were left chasing India for the majority of the second Test at Edgbaston in Birmingham after their blunder at the toss."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/prithvi-shaw-joins-maharashtra-cricket-team-2025-26-season-2752107-2025-07-07",
      "headline": "Prithvi Shaw explains move to Maharashtra after parting ways with MumbaiPrithvi Shaw has moved from Mumbai to Maharashtra for the upcoming domestic season. The out-of-favour India opener hopes the move will rejuvenate his career. Shaw last played for India in 2021. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-day-8-live-score-updates-novak-djokovic-jannik-sinner-iga-swiatek-2752056-2025-07-07",
      "headline": "Wimbledon Live Updates, Day 8: Djokovic loses first set, Cilic battles onWimbledon 2025 Day 8 Live Updates: Novak Djokovic has had a horrendous start against Alex de Minaur. Meanwhile Maren Cilic remains in the hunt after winning his first set point."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wiian-mulder-second-fastest-triple-hundred-south-africa-test-cricket-zimbabwe-2752027-2025-07-07",
      "headline": "Wiian Mulder hits 2nd fastest triple hundred in Test cricket historyWiian Mulder became the first ever captain to score a triple hundred in Test cricket. His 297-ball innings is the second fastest, just behind Virender Sehwag's record."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/f1-british-grand-prix-report-verstappen-piastri-penalty-2751955-2025-07-07",
      "headline": "F1: Oscar Piastri brake-checks himself out of victory in British Grand PrixLando Norris claimed a dramatic win at Silverstone after Oscar Piastri brake-checked himself into a second place finish at the British Grand Prix. Nico Hulkenberg secured his first-ever podium in a rain-hit, chaotic race."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pat-cummins-backs-sam-konstas-west-indies-vs-australia-2751933-2025-07-07",
      "headline": "Pat Cummins backs Sam Konstas despite inconsistent Test formAustralian captain Pat Cummins has backed young batter Sam Konstas despite his inconsistent Test performances. Cummins highlights the importance of patience and faith in emerging players during challenging phases."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/who-is-akash-deep-sister-akhand-jyoti-singh-exclusive-england-vs-india-2751909-2025-07-07",
      "headline": "Don't worry about me, do well for India: Akash Deep's sister amid cancer battleIndia pacer Akash Deep delivered a remarkable 10-wicket haul at Edgbaston and dedicated it to his sister battling cancer. In an exclusive interview with Aajtak, Akash Deep's sister reacted to her brother's viral interview and her own cancer treatment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-shubman-gill-test-captaincy-batting-record-edgbaston-test-2751885-2025-07-07",
      "headline": "Shubman Gill 2.0: How Edgbaston Test marked the rise of a potential India greatENG vs IND: Shubman Gill didn't have a great record outside the subcontinent, but the young India captain has put his best foot forward in the ongoing England tour, scoring runs in heaps and guiding India to a 336-run win at Edgbaston. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-appoints-sanjog-gupta-as-chief-executive-officer-2751872-2025-07-07",
      "headline": "ICC appoints Sanjog Gupta as Chief Executive OfficerThe International Cricket Council (ICC) has appointed Sanjog Gupta as its new chief executive officer (CEO). He will assume office on July 7, 2025, becoming the seventh CEO in the history of the ICC."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/f1-british-grand-prix-report-verstappen-piastri-penalty-2751955-2025-07-07",
      "headline": "F1: Oscar Piastri brake-checks himself out of victory in British Grand PrixLando Norris claimed a dramatic win at Silverstone after Oscar Piastri brake-checked himself into a second place finish at the British Grand Prix. Nico Hulkenberg secured his first-ever podium in a rain-hit, chaotic race."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pat-cummins-backs-sam-konstas-west-indies-vs-australia-2751933-2025-07-07",
      "headline": "Pat Cummins backs Sam Konstas despite inconsistent Test formAustralian captain Pat Cummins has backed young batter Sam Konstas despite his inconsistent Test performances. Cummins highlights the importance of patience and faith in emerging players during challenging phases."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/who-is-akash-deep-sister-akhand-jyoti-singh-exclusive-england-vs-india-2751909-2025-07-07",
      "headline": "Don't worry about me, do well for India: Akash Deep's sister amid cancer battleIndia pacer Akash Deep delivered a remarkable 10-wicket haul at Edgbaston and dedicated it to his sister battling cancer. In an exclusive interview with Aajtak, Akash Deep's sister reacted to her brother's viral interview and her own cancer treatment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-shubman-gill-test-captaincy-batting-record-edgbaston-test-2751885-2025-07-07",
      "headline": "Shubman Gill 2.0: How Edgbaston Test marked the rise of a potential India greatENG vs IND: Shubman Gill didn't have a great record outside the subcontinent, but the young India captain has put his best foot forward in the ongoing England tour, scoring runs in heaps and guiding India to a 336-run win at Edgbaston. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-appoints-sanjog-gupta-as-chief-executive-officer-2751872-2025-07-07",
      "headline": "ICC appoints Sanjog Gupta as Chief Executive OfficerThe International Cricket Council (ICC) has appointed Sanjog Gupta as its new chief executive officer (CEO). He will assume office on July 7, 2025, becoming the seventh CEO in the history of the ICC."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}