{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-samsung-mobiles-apple-iphone-tariffs-india-manufacturing-2729791-2025-05-24",
      "headline": "Trump targets Samsung after tax threat to Apple for India shift: Wouldn't be fairThe US President warned that Samsung, and not only Apple, would face a 25% import tax if its phones were not manufactured in America."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-proposes-50-tariff-on-eu-goods-from-june-1-2729562-2025-05-23",
      "headline": "Trump proposes 50% tariff on EU goods from June 1Trump criticised the EU for maintaining restrictive trade practices, levying high taxes, and taking legal action against US companies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-declares-rs-268-lakh-crore-dividend-to-support-government-fiscal-goals-2729528-2025-05-23",
      "headline": "RBI to pay Rs 2.69 lakh crore to government as dividend for FY25The RBI has approved a large dividend of Rs 2.69 lakh crore for the financial year 2025, which is higher than Rs 2.1 lakh crore given last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/not-india-or-anyplace-else-trump-warns-apple-of-25-tariff-if-iphones-not-manufactured-in-us-2729506-2025-05-23",
      "headline": "Not India or anyplace else: Trump's 25% tariff warning if iPhones not made in USDonald Trump's statement on levying 25% tariff on iPhones has caused Apple shares to fall by 2.5% in premarket trading, and US stock futures also slipped. However, it's still unclear whether Trump actually has the legal power to impose a tariff on one specific company."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/ipo-revival-primary-market-upcoming-public-listings-should-investors-put-money-leela-hotel-lg-ril-2729465-2025-05-23",
      "headline": "Fresh IPOs likely to flood Dalal Street: Time to ride the wave?Four IPOs are lined up to open in the last week of May. These include Scoda Tubes, Prostarm Info Systems, Leela Hotels (Schloss Bangalore Limited), and Aegis Vopak Terminals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rs-10-crore-for-child-education-edelweiss-ceo-and-md-radhika-gupta-maths-and-message-2729440-2025-05-23",
      "headline": "Rs 10 crore for child's education? Edelweiss' Radhika Gupta's maths and messageRadhika Gupta explained that the current cost of a full higher education in the US is around Rs 2.5 crore. Now, if you consider average inflation of 5% and currency depreciation of 4% every year, the value of that education will go up a lot over the next 16 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-closes-769-points-higher-nifty-above-24800-eternal-ends-with-3-percent-gain-fmcg-it-banking-2729441-2025-05-23",
      "headline": "Sensex, Nifty close higher over US-China trade hopes despite FII outflow fearsThe S&P BSE Sensex added 769.09 points to close at 81,721.08, while the NSE Nifty50 gained 243.45 points to end at 24,853.15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/microsoft-google-and-more-cut-over-61000-jobs-in-2025-here-is-why-2729361-2025-05-23",
      "headline": "Microsoft, Google and more cut over 61,000 jobs in 2025: Here's why?One of the biggest cuts came from Microsoft, which let go of 6,000 employees, its largest round of job losses since 2023. Nearly 2,000 of these were in Washington state alone. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/reliance-power-rpower-share-price-rise-18-percent-why-reason-should-you-buy-2729360-2025-05-23",
      "headline": "Reliance Power Ltd share price rises over 18%. Should you buy?Reliance Power has gained 20.77% in the last month, 51.98% over the last six months, and 99.13% over the past year. Over the last five years, it has gone up by a massive 2,820.56%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-plans-to-let-us-other-foreign-firms-bid-for-government-contracts-report-2729355-2025-05-23",
      "headline": "India plans to let US, other foreign firms bid for government contracts: ReportContracts worth over $50 billion, primarily issued by federal agencies, could soon be accessible to US companies as part of a broader effort to strike a limited trade agreement with Washington by early July."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/bajaj-auto-acquisition-to-take-over-ktm-800-million-euro-deal-financial-trouble-2729351-2025-05-23",
      "headline": "Bajaj Auto to take over KTM with massive €800 million dealThe move is aimed at helping KTM recover from financial trouble and marks a major step forward for Bajaj, which has been a minority investor in KTM since 2007."
    }
  ],
  "entertainment": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/justin-bieber-apologises-to-wife-hailey-for-mean-message-after-her-magazine-cover-2729787-2025-05-24",
      "headline": "Justin Bieber apologises to Hailey for 'mean' dig after she features on Vogue coverSinger Justin Bieber apologised to his wife Hailey Bieber for his 'mean' remarks after she appeared on the latest edition of a magazine cover. The singer has now edited his caption after facing backlash. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-sparkles-in-giorgio-armani-bejewelled-dress-at-cannes-dont-miss-the-bold-headpiece-2729771-2025-05-24",
      "headline": "Alia Bhatt sparkles in bejewelled dress at Cannes. Don't miss the bold headpieceActor Alia Bhatt sparkled like a diamond in her second appearance at Cannes. The actor wore a bejewelled dress and left fans swooning over her looks. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/muthina-haara-a-patriotic-tale-of-a-soldier-his-family-their-pride-and-pain-2728222-2025-05-24",
      "headline": "Muthina Haara: A patriotic tale of Kodava soldier, his family, pride and pain'Muthina Haara' is a 1990 Kannada war drama film directed by three-time National Award winner Rajendra Singh Babu, starring Dr Vishnuvardhan and Suhasini Maniratnam in the lead. From pride and patriotism to mental trauma and the repercussions of war, this film depicts both sides of the coin and remains a timeless classic. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/the-wheel-of-time-cancelled-heres-why-it-wont-get-season-4-glbs-2729740-2025-05-24",
      "headline": "Why The Wheel of Time won't return for Season 4Prime Video has canceled The Wheel of Time after three seasons due to declining viewership. The fantasy series, based on Robert Jordan's novels, concludes with a legacy of ambitious storytelling.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-brings-vintage-drama-to-cannes-film-festival-debut-in-peach-outfit-2729678-2025-05-23",
      "headline": "Alia Bhatt brings vintage drama to Cannes debut in peach outfitAlia Bhatt made a stunning red carpet debut in a gorgeous ensemble at the Cannes Film Festival. Pictures of the actor from the red carpet have gone viral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/actor-dipika-kakar-back-home-from-hospital-shoaib-asks-fans-to-keep-her-in-prayers-2729616-2025-05-23",
      "headline": "Actor Dipika Kakar back home from hospital, Shoaib asks fans to keep her in prayersActor Dipika Kakar's husband Shoaib Ibrahim shared her health update with her fans after the delay in tumour resection surgery. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/salman-khan-trains-in-low-oxygen-conditioning-for-war-drama-on-galwan-valley-clash-2729589-2025-05-23",
      "headline": "Salman Khan trains in low-oxygen condition for war-drama on Galwan valley clashActor Salman Khan, known for his rigorous fitness regime, is busy training in low-oxygen conditioning for his upcoming war drama. The film is based on the 2020 Galwan valley clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ayan-mukerji-shares-war-2-bts-pics-hrithik-roshan-jr-ntr-and-kiara-advani-bring-drama-depth-star-power-2729592-2025-05-23",
      "headline": "Ayan Mukerji shares War 2 BTS pics: Hrithik, Jr NTR bring drama, depth, star powerDirector Ayan Mukerji shared behind-the-scenes photos and a heartfelt note ahead of 'War 2' release, highlighting the film's emotional depth and star-studded cast. The action-thriller, part of the YRF Spy Universe, is set to hit theatres on August 14."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/suriya-is-all-praise-for-tourist-family-meets-director-abishan-jeevinth-2729593-2025-05-23",
      "headline": "Suriya is all praise for Tourist Family, meets director Abishan JeevinthAfter Dhanush and Rajinikanth, Suriya is all praise for the Tamil film 'Tourist Family'. Debutant director Abishan Jeevinth shared pictures with the actor and expressed admiration for him. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sidharth-janhvis-param-sundari-teaser-leaked-online-creates-buzz-ahead-of-release-2729560-2025-05-23",
      "headline": "Sidharth-Janhvi's Param Sundari teaser leaked online, creates buzz ahead of releaseThe teaser for 'Param Sundari', starring Sidharth Malhotra and Janhvi Kapoor, was leaked online after being shown in theatres with 'Bhool Chuk Maaf'. Fans are loving the chemistry, visuals, and Sonu Nigam's vocals. The film is slated to release on July 25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/suniel-shetty-supports-aamir-khan-amid-sitaare-zameen-par-row-2729534-2025-05-23",
      "headline": "Don't judge the past: Suniel Shetty has Aamir Khan's back amid Sitaare Zameen Par rowActor Suniel Shetty recently reacted to boycott calls for Aamir Khan's 'Sitaaare Zameen Par.' The actor said that people should not judge the past.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/reviews/story/kesari-veer-review-weak-plot-poor-cgi-suniel-shetty-sooraj-pancholi-chhaava-knockoff-2729545-2025-05-23",
      "headline": "Kesari Veer review: Suniel Shetty is the only spark in this Chhaava knockoffReleased-Fri May 23, 2025Kesari Veer movie review: Kesari Veer, despite its grand scale and star cast, fails to deliver a compelling historical drama. The film's poor execution and weak CGI undermine its potential impact."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/feminism-in-k-dramas-a-growing-voice-or-still-a-whisper-2728815-2025-05-23",
      "headline": "Feminism in K-dramas: A growing voice or still a whisper?K-dramas have evolved from portraying passive, love-struck heroines to celebrating strong, independent women who define themselves beyond romance. The leading ladies in the Korean dramas reflect a more empowered and complex vision of feminism today, moving far beyond the stereotypes of the past."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/the-devil-wears-prada-sequel-eyes-may-2026-release-report-2729556-2025-05-23",
      "headline": "The Devil Wears Prada sequel eyes May 2026 release: ReportThe sequel to Meryl Streep and Anne Hathaway's 'The Devil Wears Prada' will be released in May 2026. The cast is yet to be confirmed. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/suniel-shetty-slams-bollywood-as-son-ahan-shetty-faced-fallout-after-choosing-border-2-2729520-2025-05-23",
      "headline": "Suniel Shetty claims son Ahan was targeted for saying yes to Border 2Actor Suniel Shetty revealed his son Ahan Shetty faced industry backlash and lost roles for choosing 'Border 2'. He warned to expose those behind the alleged sabotage. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kartik-aaryan-new-look-for-tu-meri-main-tera-main-tera-tu-meri-stuns-fans-2729530-2025-05-23",
      "headline": "Kartik Aaryan's new look for Tu Meri Main… stuns fans: Happy to see your faceKartik Aaryan has debuted his new look for his upcoming rom-com 'Tu Meri Main Tera, Main Tera Tu Meri' with Karan Johar's Dharma Productions. The film will hit theatres in February 2026. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mumbai-police-regulate-salman-khan-galaxy-apartment-visitor-entry-trespassing-2729524-2025-05-23",
      "headline": "After 2 trespassers caught, cops to regulate visitor entry at Salman Khan's houseMumbai Police plan to regulate entry at Salman Khan's Galaxy Apartments due to repeated trespassing and threats from the Lawrence Bishnoi gang. Enhanced security measures are being considered to safeguard the actor.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sooraj-chamkega-salman-khan-cheers-to-sooraj-pancholi-big-screen-comeback-2729386-2025-05-23",
      "headline": "Sooraj chamkega: Salman Khan cheers on Sooraj Pancholi's big screen comebackActor Sooraj Pancholi is set to make his comeback with Kesari Veer, in which he plays a brave Rajput warrior. Salman Khan showed his support with a heartfelt Instagram post, cheering Sooraj's return to the big screen."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/photo/taarak-mehta-ka-ooltah-chashmah-deepti-sadhwani-cannes-comeback-sitara-2729453-2025-05-23",
      "headline": "Deepti Sadhwani makes stylish Cannes comeback with film Sitara'Taarak Mehta Ka Ooltah Chashmah' fame Deepti Sadhwani attended the Cannes Film Festival in a black outfit. This is the second time that the actor has returned to the event. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/monsoon-to-arrive-in-kerala-within-24-hours-earliest-onset-in-state-in-16-years-2729793-2025-05-24",
      "headline": "Monsoon to arrive in Kerala within 24 hours, earliest onset in state in 16 yearsThis year's monsoon onset in Kerala is set to be the earliest in the last 16 years. The last time the monsoon arrived this early in the state was in 2009 and 2001."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indus-water-treaty-suspension-reasons-india-un-security-council-cross-border-terrorism-energy-dam-safety-2729767-2025-05-24",
      "headline": "Pak's decades of terror, Pahalgam last straw: India on Indus treaty move at UNIn addition to repeated cross-border terrorism, factors such as energy requirements and dam safety led to India's decision to place the Indus Waters Treaty with Pakistan in abeyance, India told the United Nations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-samsung-mobiles-apple-iphone-tariffs-india-manufacturing-2729791-2025-05-24",
      "headline": "Trump targets Samsung after tax threat to Apple for India shift: Wouldn't be fairThe US President warned that Samsung, and not only Apple, would face a 25% import tax if its phones were not manufactured in America."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kunwar-vijay-shah-apologises-remarks-on-colonel-sofiya-qureshi-says-was-a-linguistic-error-2729629-2025-05-23",
      "headline": "Linguistic error: Madhya Pradesh Minister on remarks against Col Sofiya QureshiThe Madhya Pradesh Minister had said that the Prime Minister had sent a \"sister from the same community\" as those in Pakistan to avenge the April 22 terror attack in Pahalgam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indias-probable-test-squad-for-england-tour-shubman-gill-rishabh-pant-2729758-2025-05-24",
      "headline": "How India's NextGen Test squad will look like: The England tour probablesIndia are set to announce their squad for the 5-match Test tour of England on Saturday, May 23. Head coach Gautam Gambhir and national selector Ajit Agarkar will hold a press conference in Mumbai, which will give fans clarity on who are set to be earmarked for the future of Indian Test cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shashi-tharoor-delegation-heads-us-will-not-be-silenced-by-terrorism-2729751-2025-05-24",
      "headline": "Will not be silenced by terrorism: Shashi Tharoor as his delegation heads to USCongress MP Shashi Tharoor-led all-party parliamentary delegation as part of Operation Sindoor outreach left on Friday night to five countries, including the United States, Panama, Guyana, Brazil and Colombia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/harvard-university-trump-foreign-student-enrolment-ban-raghav-chadha-aap-mp-2729786-2025-05-24",
      "headline": "In Harvard T-shirt, Raghav Chadha's blunt message amid row: Wear my coloursAAP MP and Harvard alumnus Raghav Chadha called for safeguarding academic freedom and global collaboration of the university, as he criticised US President Donald Trump's move to bar the university from enroling international students. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indigo-delhi-srinagar-flight-turbulence-altitude-drop-2729706-2025-05-23",
      "headline": "Data shows IndiGo flight's dangerous altitude loss during turbulenceIndiGo's Delhi-Srinagar flight suffered a sharp 3,875-feet drop in just over a minute due to severe turbulence during a hailstorm, with both Indian and Pakistani airspace diversion requests denied."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-sparkles-in-giorgio-armani-bejewelled-dress-at-cannes-dont-miss-the-bold-headpiece-2729771-2025-05-24",
      "headline": "Alia Bhatt sparkles in bejewelled dress at Cannes. Don't miss the bold headpieceActor Alia Bhatt sparkled like a diamond in her second appearance at Cannes. The actor wore a bejewelled dress and left fans swooning over her looks. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/news-menu-india-pakistan-operation-sindoor-pm-modi-rahul-gandhi-indigo-poonch-bangladesh-muhammad-yunus-england-test-captain-2729752-2025-05-24",
      "headline": "News Menu, May 24: PM's NITI Aayog meet; India caption for England test seriesPrime Minister Modi will chair a NITI Aayog meeting, will head to Bihar later today; Congress leader Rahul Gandhi will be in Poonch; more on the India-Pak airspace standoff, and what's next for Bangladesh's Muhammad Yunus -- all this and more in India Today's news menu today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/lieutenant-shashank-tiwari-martyrdom-sikkim-scouts-regiment-indian-army-2729517-2025-05-23",
      "headline": "Army officer, 23, drowns after he jumps into stream trying to save colleagueLieutenant Shashank Tiwari, commissioned just six months ago, lost his life in the line of duty in Sikkim while rescuing an Agniveer. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/opinion/story/kannada-controversy-sonu-nigam-sbi-branch-manager-language-row-opinion-2729553-2025-05-23",
      "headline": "In defence of Sonu Nigam, SBI official and all 'anti-Kannada' peopleSonu Nigam compared being heckled to sing in Kannada to the Pahalgam terror attack. Then an SBI official declared she would \"never speak Kannada\". The two separate controversies about the language have something crucial missing: the full context that reveals a story about intent and circumstances."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/reddit-rejection-email-calls-job-seeker-robot-sparks-viral-debate-2729790-2025-05-24",
      "headline": "Techie rejected for 'sounding robotic', Internet picks up on the ironyIn a now-viral post on Reddit, a techie shared his job rejection email after being turned down for a role because he \"sounded like a robot\"."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/national-herald-case-dk-shivakumar-donated-money-newspaper-ed-chargesheet-gandhis-karnataka-2729733-2025-05-24",
      "headline": "Donated Rs 25 lakh to National Herald, nothing wrong with it: DK ShivakumarAmid reports of his name being figured in an ED chargesheet in the National Herald case, Karnataka Deputy Chief Minister DK Shivakumar said he and his brother donated Rs 25 lakh to the Congress-run newspaper, adding there was nothing wrong with it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/sri-sri-ravi-shankar-offers-a-way-to-cope-with-war-induced-anxiety-2729462-2025-05-24",
      "headline": "Sri Sri Ravi Shankar offers a way to cope with war-induced anxietyThe emotional toll of a war-like situation can be overwhelming, but Gurudev Sri Sri Ravi Shankar offers a path to cope."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-gang-rape-accused-who-got-heroes-welcome-after-bail-arrested-again-2729694-2025-05-23",
      "headline": "Karnataka gang rape accused who got heroes' welcome after bail arrested againThe Hangal Police, who took the accused into custody, said that they violated bail conditions by conducting a celebratory roadshow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indias-next-test-captain-is-shubman-gill-ready-for-the-big-job-2729783-2025-05-24",
      "headline": "India's next Test captain: Is Shubman Gill ready for the big job?India stands at the cusp of a major Test transition, with Rohit Sharma and Virat Kohli stepping away. If Shubman Gill is indeed the chosen one, the question looms: is he ready for the toughest job in cricket?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/trending/weekly-quiz-486-23-05-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-muhammad-yunus-no-qurbani-eid-slaughter-order-kolkata-consulate-gets-envoy-shabab-bin-ahmed-punished-2729536-2025-05-23",
      "headline": "No-qurbani order at Kolkata consulate gets envoy punished by Yunus govtThe interim government of Bangladesh, led by Chief Adviser Muhammad Yunus, has cancelled diplomat Shabab bin Ahmed's posting to the consulate at Kolkata after he banned animal sacrifices on Eid sacrifices. Ahmed argued that diplomats \"need to respect the customs of the host country\". His ban triggered a controversy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-news-pahalgam-attack-ceasefire-indus-water-treaty-water-flow-dam-flushing-satellite-photo-2729373-2025-05-23",
      "headline": "One month since Indus Waters Treaty suspension: What satellite images revealSince India suspended the Indus Waters Treaty after the April 22 Pahalgam terror attack, satellite and flow data show India has intensified dam flushing operations, causing fluctuating water flows into Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/india-paklistan-war-1965-field-marshall-km-cariappa-snubbed-pak-dictator-ayub-khan-field-marshal-offer-2729382-2025-05-23",
      "headline": "Not my son, he's prisoner of war: When Gen Cariappa snubbed Pak dictator's offerDuring the 1965 India-Pakistan War, Flight Lieutenant KC Cariappa's plane was shot down, and he was held captive by the Pakistani army. His father, General KM Cariappa (later a Field Marshal), turned down an offer from Pakistan's military dictator Field Marshal Ayub Khan, who served under him earlier, to release his son. This story from 70 years ago also highlights the contrast between the two Field Marshals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/to-preach-after-killing-civilians-targeting-places-of-worship-grossly-hypocritical-india-slams-pak-at-unsc-2729698-2025-05-23",
      "headline": "Makes no distinction between terrorists, civilians: India shreds Pak at UNIndia slammed Pakistan at the UN Security Council, accusing it of hypocrisy for commenting on civilian protection despite cross-border terror links. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-ncr-rain-thunderstorm-likely-alert-winds-70-kmph-2729759-2025-05-24",
      "headline": "Rain, thunderstorm likely in Delhi-NCR today, alert for winds up to 70 kmphThe areas likely to witness light showers include Dwarka, Palam, IGI Airport, Vasant Vihar, Vasant Kunj, Mehrauli, Chhattarpur, IGNOU, Ayanagar, and Deramandi in South Delhi."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/us-judge-blocks-trump-administration-from-revoking-harvard-enrollment-of-foreign-students-2729634-2025-05-23",
      "headline": "Judge blocks Trump administration from banning foreign students at HarvardIn a complaint filed in Boston federal court, Harvard University called US President Donald Trump-led administration's move to revoke its ability to enrol international students a \"blatant violation\" of the Constitution and other laws."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-rcb-vs-srh-simon-helmot-full-post-match-press-conference-2729803-2025-05-24",
      "headline": "We'll always be aggressive and positive: SRH assistant coach after win vs RCBSunrisers Hyderabad (SRH) assistant coach Simon Helmot said that their team will always look to be positive and aggressive following a 42-run win against Royal Challengers Bengaluru (RCB). SRH registered their fifth win of the season as Ishan Kishan starred with an unbeaten 94* (48). "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-rcb-vs-srh-philip-salt-full-post-match-press-conference-2729801-2025-05-24",
      "headline": "Not worried about table position, we're just looking at next game: RCB's Phil SaltRoyal Challengers Bengaluru (RCB) opening batter Philip Salt said that the team is only looking forward to the next game and isn't thinking too much about where they'd finish on the points table."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-simon-helmot-ishan-kishans-mature-innings-vs-rcb-2729792-2025-05-24",
      "headline": "SRH Assistant coach delighted with Ishan Kishan's 'mature' innings vs RCBSunrisers Hyderabad (SRH) assistant coach Simon Helmot was full of praise for Ishan Kishan following his match-winning innings of 94* (48) vs Royal Challengers Bengaluru (RCB). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indias-next-test-captain-is-shubman-gill-ready-for-the-big-job-2729783-2025-05-24",
      "headline": "India's next Test captain: Is Shubman Gill ready for the big job?India stands at the cusp of a major Test transition, with Rohit Sharma and Virat Kohli stepping away. If Shubman Gill is indeed the chosen one, the question looms: is he ready for the toughest job in cricket?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-srh-philip-salt-on-rcbs-loss-vs-srh-2729774-2025-05-24",
      "headline": "Better to lose now than in an eliminator game: RCB's Philip Salt on loss vs SRHRoyal Challengers Bengaluru (RCB) opening batter Philip Salt brushed aside any concerns for his team following their 42-run loss against Sunrisers Hyderabad (SRH), saying that it's better to lose now than in the playoffs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-test-squad-announcement-for-england-live-updates-new-india-test-captain-who-will-replace-rohit-sharma-virat-kohli-2729764-2025-05-24",
      "headline": "India Test Squad Announcement For England Live: Will Pant emerge as new captain?India Test Squad For England Tour 2025 Live Updates: The Indian Test squad for the England tour is expected to be out soon. It remains to be seen who will be announced as the next Test captain of the team after the retirement of captain Rohit Sharma. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indias-probable-test-squad-for-england-tour-shubman-gill-rishabh-pant-2729758-2025-05-24",
      "headline": "How India's NextGen Test squad will look like: The England tour probablesIndia are set to announce their squad for the 5-match Test tour of England on Saturday, May 23. Head coach Gautam Gambhir and national selector Ajit Agarkar will hold a press conference in Mumbai, which will give fans clarity on who are set to be earmarked for the future of Indian Test cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-tom-moody-on-ishan-kishans-innings-vs-rcb-2729754-2025-05-24",
      "headline": "Kishan's knock vs RCB will make sure that he gets retained by SRH: MoodyIshan Kishan played a fantastic knock of 94* against RCB on Friday. Tom Moody believes that the innings would has helped Kishan to retain his position at SRH next season"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-top-two-qualification-chances-for-gt-rcb-pbks-mi-2729726-2025-05-24",
      "headline": "IPL 2025 playoffs race explained: One game to go, can RCB avoid familiar fate?RCB remain on 17 points after losing their penultimate league game to SRH and their net run rate took a huge hit, forcing them down to third place below GT and PBKS. Here are the top two qualification scenarios for all four teams.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-srh-jitesh-sharma-reaction-playoffs-hopes-2729721-2025-05-24",
      "headline": "RCB's defeat to SRH before playoffs a wake-up call: Jitesh SharmaIPL 2025: Royal Challengers Bengaluru suffered a major setback after losing to SunRisers Hyderabad by 42 runs in Lucknow. The defeat drops RCB to third place, complicating their hopes for a top-two finish in IPL 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-zimbabwe-only-test-day-2-report-2729718-2025-05-24",
      "headline": "England set for big win after forcing Zimbabwe to follow onEngland are nearing another heavy win in the one-off Test at Trent Bridge after enforcing the follow-on against Zimbabwe to take a commanding lead of 270 runs by stumps on Day 2. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indias-probable-test-squad-for-england-tour-shubman-gill-rishabh-pant-2729758-2025-05-24",
      "headline": "How India's NextGen Test squad will look like: The England tour probablesIndia are set to announce their squad for the 5-match Test tour of England on Saturday, May 23. Head coach Gautam Gambhir and national selector Ajit Agarkar will hold a press conference in Mumbai, which will give fans clarity on who are set to be earmarked for the future of Indian Test cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-tom-moody-on-ishan-kishans-innings-vs-rcb-2729754-2025-05-24",
      "headline": "Kishan's knock vs RCB will make sure that he gets retained by SRH: MoodyIshan Kishan played a fantastic knock of 94* against RCB on Friday. Tom Moody believes that the innings would has helped Kishan to retain his position at SRH next season"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-top-two-qualification-chances-for-gt-rcb-pbks-mi-2729726-2025-05-24",
      "headline": "IPL 2025 playoffs race explained: One game to go, can RCB avoid familiar fate?RCB remain on 17 points after losing their penultimate league game to SRH and their net run rate took a huge hit, forcing them down to third place below GT and PBKS. Here are the top two qualification scenarios for all four teams.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-srh-jitesh-sharma-reaction-playoffs-hopes-2729721-2025-05-24",
      "headline": "RCB's defeat to SRH before playoffs a wake-up call: Jitesh SharmaIPL 2025: Royal Challengers Bengaluru suffered a major setback after losing to SunRisers Hyderabad by 42 runs in Lucknow. The defeat drops RCB to third place, complicating their hopes for a top-two finish in IPL 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-zimbabwe-only-test-day-2-report-2729718-2025-05-24",
      "headline": "England set for big win after forcing Zimbabwe to follow onEngland are nearing another heavy win in the one-off Test at Trent Bridge after enforcing the follow-on against Zimbabwe to take a commanding lead of 270 runs by stumps on Day 2. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}