{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-growth-lies-in-its-heartland-adani-enterprises-pranav-adani-2743714-2025-06-20",
      "headline": "India's growth lies in its heartland: Adani Enterprises Director Pranav AdaniThe remarks came as part of a broader statement of intent from the newly launched Chintan Research Foundation, which Adani said would focus on three critical areas: climate change, trade, and geopolitics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-1046-points-higher-nifty-above-25100-airtel-jumps-3-percent-2743705-2025-06-20",
      "headline": "Sensex ends 1,046 points higher, Nifty above 25,100; Bharti Airtel jumps 3%The S&P BSE Sensex jumped 1,046.30 points to end at 82,408.17, while the NSE Nifty50 added 319.50 points to close at 25,112.40. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-lifestyle-inflation-fuelling-debt-among-indias-middle-class-2743647-2025-06-20",
      "headline": "Is lifestyle inflation fuelling debt among India's middle class?Lifestyle inflation is no longer a silent threat. It is reshaping how India's middle class earns, spends and saves. It fuels debt, shrinks buffers and puts long-term financial goals at risk."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/early-retirement-age-40-savings-needed-corpus-inflation-fire-trend-financial-independence-2743639-2025-06-20",
      "headline": "Planning to retire at 40? Here's what it really takesThe idea of retiring at 40 sounds almost rebellious. Stop working just when most people are hitting their career peak, and live the rest of your life on your own terms. No bosses, no Monday blues, no waiting for the weekend. But can you do it? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/financial-clarity-money-management-wealth-mindset-abhishek-walia-2743570-2025-06-20",
      "headline": "CA explains how Rs 80,000 per month income can beat Rs 2 lakhThe CA's insights suggest that intentional financial management is key to wealth building. A clear financial purpose can transform how resources are allocated, leading to sustainable growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/rbi-eases-infrastructure-financing-norms-sensex-nifty-rise-2743540-2025-06-20",
      "headline": "Sensex jumps over 1,100 points: Why is the stock market rising today?The primary catalyst for this rally was the RBI's announcement concerning infrastructure financing. The central bank has implemented new norms that relax provisioning requirements for under-construction infrastructure projects."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/power-finance-corporation-share-price-rise-jumps-6-percent-today-reason-why-rbi-update-project-finance-2743503-2025-06-20",
      "headline": "Power Finance Corporation share price jumps 6% today. Here's whyWhile PFC has faced some pressure in recent months, with its stock falling 9.14% in the last six months and 14.44% over the past year, Friday's gain marks a strong rebound following the regulatory update."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-228-points-higher-nifty-above-24800-nestle-gains-1-percent-2743481-2025-06-20",
      "headline": "Sensex opens 228 points higher, Nifty above 24,800; Nestle gains 1%The S&P BSE Sensex was up 160.43 points to 81,522.30, while the NSE Nifty50 gained 36.45 points to 24,829.70 as of 9:23 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-open-lower-geopolitical-tensions-market-volatility-2743468-2025-06-20",
      "headline": "Sensex, Nifty opening: Will stock market open higher? Check key levelsAs of 8:00 am, Gift Nifty futures were trading at 24,800. This suggests that the Nifty50 may open near its previous closing level of 24,793.25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-june-20-oswal-pumps-biocon-united-spirits-sai-life-sciences-nestle-india-2743464-2025-06-20",
      "headline": "Stocks to watch today: Oswal Pumps, Biocon, United Spirits, Sai Life SciencesShares of Nestle India could be in focus after the company announced that its Board of Directors will meet on June 26. They will consider a proposal to issue bonus shares."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indian-funds-swiss-banks-triple-banking-routes-see-sharpest-surge-2743425-2025-06-20",
      "headline": "Indian funds in Swiss banks triple, banking routes see sharpest surgeIndian funds in Swiss banks surged over threefold to CHF 3.5 billion (Rs 37,600 crore) in 2024, mainly due to a massive rise in holdings through financial institutions and banking channels. However, customer deposits rose by just 11%, making up only one-tenth of the total funds, which remain under tax scrutiny despite regular data sharing with Indian authorities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hardeep-singh-puri-oil-prices-israel-iran-conflict-situation-under-control-interview-2743301-2025-06-19",
      "headline": "Oil prices stable, situation not alarming: Union Minister amid Middle East tensionsUnion Petroleum Minister Hardeep Singh Puri allayed concerns about a spike in oil prices amid the Israel-Iran conflict, saying the situation was manageable and energy rates were under control."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/maltis-schedule-is-crazy-priyanka-chopra-on-school-and-her-travel-to-india-2743702-2025-06-20",
      "headline": "Maltie's schedule is crazier: Priyanka Chopra on daughter's school lifePriyanka Chopra recently opened up about her daughter Malti's school routine and how she juggles parenting while traveling for her professional commitments in India.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/johnny-depp-visited-madrid-children-hospital-as-jack-sparrow-melts-internet-2743713-2025-06-20",
      "headline": "Johnny Depp surprises children as Captain Jack Sparrow in Madrid hospitalJohnny Depp returned to his iconic role as Captain Jack Sparrow to visit terminally ill children at a hospital in Madrid. The actor's selfless act has won hearts worldwide, showcasing his kindness beyond the screen."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sudhanshu-pandey-on-apoorva-mukhija-disrespecting-ashish-vidyarthi-is-this-gen-z-2743621-2025-06-20",
      "headline": "Is this Gen Z: Sudhanshu Pandey on Apoorva Mukhija disrespecting Ashish VidyarthiActor Sudhanshu Pandey called out Apoorva Mukhija for disrespecting Ashish Vidyarthi on 'The Traitors'. He mentioned the lack of respect among the younger generation towards elders. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dhanush-watch-kuberaa-son-lingaa-director-sekhar-kammula-chennai-theatre-2743706-2025-06-20",
      "headline": "Emotional Dhanush watches Kuberaa with director Sekhar Kammula in Chennai. WatchDhanush, his son Lingaa, father Kasthuri Raja and director Sekhar Kammula watched 'Kuberaa' in Chennai. The actor turned emotional as fans cheered for him.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diana-penty-12-year-relationship-with-boyfriend-harsh-sagar-2743654-2025-06-20",
      "headline": "In my head I am married: Diana Penty on 12-year relationship with Harsh SagarActor Diana Penty recently opened up about her relationship with Harsh Sagar. She confessed that they have been committed for over 12 years, and she considers herself 'married in her head.' "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/kuberaa-movie-review-dhanush-nagarjuna-compelling-premise-conventional-ending-sekhar-kammula-2743667-2025-06-20",
      "headline": "Kuberaa review: Compelling premise meets conventional end in Dhanush's filmReleased-Fri Jun 20, 2025Kuberaa movie review: Director Sekhar Kammula's 'Kuberaa', starring Dhanush, Nagarjuna and Jim Sarbh, is an intriguing story about power, money and justice. The crime drama grabs your attention right from the get-go, only to have a conventional ending. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/tejasswi-prakash-on-not-working-with-boyfriend-karan-kundrra-were-too-expensive-2743646-2025-06-20",
      "headline": "Tejasswi Prakash on not working with boyfriend Karan Kundrra: We're too expensiveActor Tejasswi Prakash said that she and her actor-boyfriend Karan Kundrra are 'too expensive' together, which is why they haven't worked on a project yet. The couple met on the sets of Bigg Boss 15 and fell in love."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/drake-loses-8-million-dollar-in-sports-gambling-2743563-2025-06-20",
      "headline": "Drake loses $8 million in sports gambling: Hope I can post a big winRapper Drake, an active sports gambler, recently revealed that he lost $8 million in a single month. The rap superstar had earlier placed a $750,000 bet on Royal Challengers Bangalore in this year's Indian Premier League final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/madhoo-shah-on-deepika-padukones-exit-from-spirit-2743631-2025-06-20",
      "headline": "Actor Madhoo on Deepika's exit from Spirit: Would've stayed if she really wanted itActor Madhoo Shah reacted to Deepika Padukone's exit from Sandeep Reddy Vanga's 'Spirit'. She said it was her personal choice and not something to debate about. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/suchitra-krishnamoorthi-apologises-fake-post-ahmedabad-air-india-plane-crash-survivor-2743606-2025-06-20",
      "headline": "Suchitra Krishnamoorthi apologises for fake post on Ahmedabad plane crash survivorActor Suchitra Krishnamoorthi faced backlash for questioning the survival story of Vishwas Kumar Ramesh, the lone survivor of the Ahmedabad plane crash. She later deleted the post and issued a public apology, admitting she had shared unverified information."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/ram-kapoor-reacts-to-rumoured-rift-with-ekta-kapoor-2743579-2025-06-20",
      "headline": "Ram Kapoor reacts to rumoured rift with Ekta Kapoor: She can say what she wantsRam Kapoor has addressed rumours of a fallout with Ekta Kapoor. He chose gratitude over conflict and called her the one who believed in him when no one else did. He also clarified that his wife Gautami's post was light-hearted and all in good fun."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anupam-kher-in-shock-as-robert-de-niro-attends-tanvi-the-great-premiere-in-new-york-2743635-2025-06-20",
      "headline": "Anupam Kher in shock as Robert De Niro attends Tanvi The Great premiere in New YorkActor Anupam Kher was over the moon after Hollywood legend Robert De Niro attended the New York premiere of his film 'Tanvi The Great'. Kher described the moment as one of the biggest highlights of his career.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ram-charan-upasana-konidela-daughter-klin-kaara-meets-namesake-tigress-on-2nd-birthday-2743597-2025-06-20",
      "headline": "Ram Charan-Upasana's daughter Klin Kaara meets her namesake tigress on 2nd birthdayActor Ram Charan and Upasana Konidela's daughter Klin Kaara celebrated her second birthday in a thoughtful manner on Friday. To mark the occasion, Klin met her namesake Tiger at Hyderabad zoo for the first time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/reema-lagoo-ex-husband-vivek-lagoo-dies-daughter-mrunmaeyee-lagoo-pays-tribute-2743625-2025-06-20",
      "headline": "Reema Lagoo's ex-husband Vivek Lagoo dies at 75, daughter Mrunmaeyee pays tributeVeteran actor Reema Lagoo's ex-husband, Vivek Lagoo, died on June 19 at 75. Their daughter, Mrunmaeyee, mourned his death with a post on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/miley-cyrus-joins-beyonce-for-surprise-ii-most-wanted-duet-in-paris-fans-react-2743607-2025-06-20",
      "headline": "Miley Cyrus joins Beyonce for surprise II Most Wanted duet in Paris, fans reactIn a spectacular surprise at her Cowboy Carter tour in Paris, Beyoncé brought out Miley Cyrus for their first live performance of the Grammy-winning duet 'II Most Wanted'. The heartfelt moment was celebrated by fans across. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/suriya-rj-balaji-titled-karuppu-first-poster-out-2743593-2025-06-20",
      "headline": "Suriya's film with RJ Balaji is titled Karuppu. First poster outActor Suriya's upcoming film with director RJ Balaji is now titled 'Karuppu'. Makers announced the name with the first-look poster. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/vir-das-returns-with-fool-volume-netflix-special-to-premiere-in-july-2743553-2025-06-20",
      "headline": "Vir Das returns With Fool Volume: Netflix special to premiere in JulyActor-comedian Vir Das is all set to return to his forte with the upcoming standup show 'Fool Volume'. Netflix India announced the streaming date of the new series featuring Das on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shikhar-pahariya-gaze-at-janhvi-kapoor-stealing-food-is-all-kinds-of-adorable-2743583-2025-06-20",
      "headline": "Shikhar Pahariya's gaze at Janhvi Kapoor stealing food is all kinds of adorableJanhvi Kapoor is enjoying a fun-filled getaway in London with her boyfriend, Shikhar Pahariya, and sister, Khushi Kapoor. A video from their holiday is going viral, capturing the couple looking smitten and absolutely adorable together.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/deepti-sadhwani-beauty-standards-in-south-they-dont-want-skinny-actors-2743221-2025-06-20",
      "headline": "Actor Deepti Sadhwani on beauty standards in South: They don't want skinny actorsActor Deepti Sadhwani recently spoke about the beauty standards in the industry and how it is different from the South cinema. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/iran-opens-airspace-to-allow-indian-evacuation-around-1000-nationals-to-land-in-delhi-tonight-2743770-2025-06-20",
      "headline": "Iran reopens skies for Indian evacuation, 1,000 nationals to land in Delhi tonightIran, which has closed its airspace amid ongoing cross-border strikes with Israel, has opened the same to allow evacuations of Indian nationals. With this, around 1000 Indian nationals are expected to arrive in New Delhi tonight."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modis-jibe-at-rjd-congress-in-poll-bound-bihar-parivar-ka-saath-parivar-ka-vikas-2743640-2025-06-20",
      "headline": "Nurturers of mafia raj, gunda raj: PM's all-out attack on RJD-Congress in BiharIn his fifth visit to the state in the past five months, PM Modi appealed to the public to vote out those who brought 'jungle raj' to Bihar and looted the state."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/kerala/story/kpcc-chief-sunny-joseph-says-shashi-tharoor-on-star-campaigner-list-for-nilambur-bypoll-after-wasnt-invited-revelation-2743566-2025-06-20",
      "headline": "Shashi Tharoor a no-show: Kerala Congress rejects 'not invited to campaign' claimKerala Pradesh Congress Committee chief Sunny Joseph said Shashi Tharoor was included in the party's star campaigner list for the Nilambur bypoll and blamed his absence on other commitments abroad. This comes a day after Tharoor claimed he wasn't invited to campaign. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-live-cricket-score-1st-test-day-1-leeds-updates-2743615-2025-06-20",
      "headline": "1st Test Day 1 LIVE: Yashasvi Jaiswal, KL Rahul dominate 1st sessionEngland (ENG) vs India (IND), 1st Test Day 1 Live Score and Updates from Leeds: Indian openers Yashasvi Jaiswal and KL Rahul are off to a great start in Leeds after England won the toss and opted to bowl. Rahul has shown good discipline, leaving anything outside off, while Jaiswal has looked positive at the other end, picking up a few early boundaries. The duo has added 50 runs for the first wicket and are looking in great rhythm.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/khamenei-fatwa-against-nukes-rouhani-iran-sell-lie-israel-attacks-iraq-war-2003-what-happened-history-nuclear-weapons-2743381-2025-06-20",
      "headline": "Khamenei's fatwa against nukes: Did Iran sell a lie to the world?More than two decades ago, Hassan Rouhani, a top Iranian negotiator, told global powers that Iran's Supreme Leader, Ayatollah Ali Khamenei, had issued a fatwa against nuclear weapons. Rouhani later admitted that the idea came to him during the 2004 talks. Amid the Israel-Iran conflict over nukes, a look at if the fatwa exists or is a bid at deception."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/lalu-yadav-dig-pm-modi-visit-bihar-rjd-congress-attack-bjp-bihar-elections-2743766-2025-06-20",
      "headline": "Rain of lies, hail of false promises: Lalu Yadav's weather forecast on PM's visitRJD chief Lalu Yadav on Friday took a dig at Prime Minister Narendra Modi, who is in Bihar, humorously making a reference to weather, saying there was a \"heavy rain of lies\" and a \"hail of false promises\" in the state."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/omar-abdullah-jammu-and-kashmir-water-proposed-canal-punjab-indus-water-system-divert-pakistan-2743699-2025-06-20",
      "headline": "Did they give us water? Omar Abdullah rejects canal idea to divert water to PunjabSpeaking about India reportedly constructing a canal to divert excess water from three western rivers of the Indus system in J&K to Haryana, Punjab and Rajasthan, Chief Minister Omar Abdullah cited the 45-year-old Shahpur Kandi barrage dispute with Punjab and asked, \"Did they give us water?\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-india-pune-delhi-flight-bird-hit-cancelled-eight-others-grounded-operational-reasons-2743716-2025-06-20",
      "headline": "9 Air India flights cancelled today, one grounded after bird hit en route PuneAir India cancelled nine flights, including one from Delhi to Pune due to a bird hit, and eight others due to enhanced maintenance and operational reasons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/early-retirement-age-40-savings-needed-corpus-inflation-fire-trend-financial-independence-2743639-2025-06-20",
      "headline": "Planning to retire at 40? Here's what it really takesThe idea of retiring at 40 sounds almost rebellious. Stop working just when most people are hitting their career peak, and live the rest of your life on your own terms. No bosses, no Monday blues, no waiting for the weekend. But can you do it? "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/congress-mla-br-patil-alleges-bribes-in-rajiv-gandhi-housing-corporation-house-allotments-warns-of-government-shake-up-in-leaked-audio-2743539-2025-06-20",
      "headline": "Government will shake: Karnataka MLA on housing scheme corruption in leaked audioKarnataka Congress MLA BR Patil, in a leaked audio clip, can be heard accusing officials of taking bribes for allotting houses under the Rajiv Gandhi Housing Corporation. He warned that details exposed could shake the government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/rbi-eases-infrastructure-financing-norms-sensex-nifty-rise-2743540-2025-06-20",
      "headline": "Sensex jumps over 1,100 points: Why is the stock market rising today?The primary catalyst for this rally was the RBI's announcement concerning infrastructure financing. The central bank has implemented new norms that relax provisioning requirements for under-construction infrastructure projects."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-test-england-india-black-armbands-minute-silence-tribute-air-india-crash-ahmedabad-2743698-2025-06-20",
      "headline": "India, England players wear black armbands, mourn Air India crash victims in LeedsENG vs IND, 1st Test: England and India players were seen wearing black armbands during the Headingley Test. Both teams also observed a minute's silence as a mark of respect to those who lost their lives in the Air India plane crash in Ahmedabad earlier in June. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/sitaare-zameen-par-movie-review-aamir-khan-film-is-a-warm-hug-laughter-pill-for-soul-2743490-2025-06-20",
      "headline": "Sitaare Zameen Par review: Aamir Khan's film is a warm hug, laughter pill for soulReleased-Fri Jun 20, 2025Sitaare Zameen Par movie review: With 'Sitaare Zameen Par', Aamir Khan doesn't just return to the screens, he returns you to yourself, one heartfelt laugh at a time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uddhav-thackeray-dare-come-kill-me-foundation-day-eknath-shinde-devendra-fadnavis-2743589-2025-06-20",
      "headline": "Come, kill me, Uddhav Thackeray dares rivals. Shinde Sena says already finishedUddhav Thackeray, speaking at an event on the 59th foundation day of the Shiv Sena, accused the Eknath Shinde camp of attempting to destroy the 'Thackeray brand'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/16-billion-passwords-allegedly-leaked-in-massive-data-breach-experts-warn-no-service-is-safe-2743486-2025-06-20",
      "headline": "16 billion passwords allegedly leaked in massive data breachA massive data breach has exposed over 16 billion passwords online, making it one of the biggest security leaks in internet history. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/indian-american-professor-rajeshwari-iyer-slammed-linking-ahmedabad-air-india-ai171-crash-reservation-policy-2743637-2025-06-20",
      "headline": "Indian-American professor blames reservation for Air India crash, faces backlashAn Indian-American professor sparked outrage after she linked the recent Air India crash in Ahmedabad to reservation policy in India. Sharing a snippet of a job ad for air traffic controllers, she criticised the quota for certain castes. Many condemned her for the casteist and insensitive post."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sherlock-holmes-virat-kohli-2743326-2025-06-20",
      "headline": "Gavaskar, Sachin, Dravid or Kohli: Who's India's best? Sherlock Holmes investigatesCricket meets mystery in this puzzle for the ages. Virat Kohli has just retired from Test cricket and touched off a debate on who's the best Test batter ever from the short list of Gavaskar, Tendulkar, Dravid and Kohli. It's a debate wrapped inside a mystery that has layers and layers of facts, data and emotions. So, the writer summons the Sherlok Holmes inside him to crack Open the case of the #FabFourDebate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-iran-war-us-donald-trump-two-week-deadline-deceive-tehran-attack-diplomacy-2743520-2025-06-20",
      "headline": "Ploy to trick Iran or diplomatic move? Behind Trump's 2-week war deadlineIran-Israel Conflict: Unpredictable as he is, Donald Trump's move has sparked speculation if the deadline was a carefully thought-out ploy to hoodwink Iran and get it to let its guard down or genuinely give diplomacy a chance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sai-sudharsan-india-test-debut-headingley-england-series-pujara-2743672-2025-06-20",
      "headline": "Sudharsan makes Test debut, joins Virat Kohli and Sourav Ganguly in unique listENG vs IND: Young top-order batter Sai Sudharsan was rewarded for his outstanding IPL form as he became the latest Indian cricketer to make his Test debut in the series opener against England.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-iran-war-updates-tehran-under-attack-operation-rising-lion-tel-aviv-missile-attack-donald-trump-ceasefire-nuclear-deal-2742822-2025-06-19",
      "headline": "Live: Israel vows to intensify attacks after Iranian missile hits hospitalIsrael-Iran Conflict Live Updates: Israel and Iran continued to launch several missiles at each other as their conflict stretched into its eighth day. Israel claims it conducted overnight airstrikes in Tehran, targeting missile production sites and Iran's alleged nuclear weapons research headquarters. The attack comes as Iran appoints a new intelligence chief for the Revolutionary Guards following the killing of his predecessor in a strike last week, according to state media. Meanwhile, the White House said Trump will decide within two weeks on possible US military action against Iran, indicating that diplomacy remains an option for now. Follow indiatoday.in for live updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/kuberaa-movie-review-dhanush-nagarjuna-compelling-premise-conventional-ending-sekhar-kammula-2743667-2025-06-20",
      "headline": "Kuberaa review: Compelling premise meets conventional end in Dhanush's filmReleased-Fri Jun 20, 2025Kuberaa movie review: Director Sekhar Kammula's 'Kuberaa', starring Dhanush, Nagarjuna and Jim Sarbh, is an intriguing story about power, money and justice. The crime drama grabs your attention right from the get-go, only to have a conventional ending. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-lifestyle-inflation-fuelling-debt-among-indias-middle-class-2743647-2025-06-20",
      "headline": "Is lifestyle inflation fuelling debt among India's middle class?Lifestyle inflation is no longer a silent threat. It is reshaping how India's middle class earns, spends and saves. It fuels debt, shrinks buffers and puts long-term financial goals at risk."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/garlic-onions-body-odour-urine-smell-sulfur-compounds-2743665-2025-06-20",
      "headline": "Why your pee (and sweat) smells like onions and garlic: Science behind the stinkGarlic and onions cause distinctive odours in breath, sweat, and urine due to sulfur compounds. These natural body smells vary with genetics and can be reduced by hydration and cooking."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/hal-to-manufacture-launch-isro-developed-sslv-technology-trasfer-to-begin-2743659-2025-06-20",
      "headline": "HAL wins contract to manufacture and launch Isro-developed SSLVThe SSLV, developed by Isro, is designed to provide cost-effective, on-demand launches for satellites weighing up to 500 kg into low Earth orbit. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-fans-question-ipl-favouritism-as-abhimanyu-easwaran-gets-ignored-2743710-2025-06-20",
      "headline": "ENG vs IND: Fans question IPL favouritism as Abhimanyu Easwaran gets overlookedAbhimanyu Easwaran was once again overlooked for the first Test against England at Headingley, Leeds as India handed a debut to Sai Sudharsan. Easwaran has been plundering runs in domestic cricket for a number of years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-test-england-india-black-armbands-minute-silence-tribute-air-india-crash-ahmedabad-2743698-2025-06-20",
      "headline": "India, England players wear black armbands, mourn Air India crash victims in LeedsENG vs IND, 1st Test: England and India players were seen wearing black armbands during the Headingley Test. Both teams also observed a minute's silence as a mark of respect to those who lost their lives in the Air India plane crash in Ahmedabad earlier in June. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-karun-nair-test-leeds-comeback-2743688-2025-06-20",
      "headline": "Karun Nair back in Test side after 3006 days as cricket gives him another chanceEngland vs India: Karun Nair returned to the Test XI for the first time since March 2017. The 33-year-old was named in the XI for the first Test of the five-match series in England. B Sai Sudharsan made his Test debut for India on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sai-sudharsan-india-test-debut-headingley-england-series-pujara-2743672-2025-06-20",
      "headline": "Sudharsan makes Test debut, joins Virat Kohli and Sourav Ganguly in unique listENG vs IND: Young top-order batter Sai Sudharsan was rewarded for his outstanding IPL form as he became the latest Indian cricketer to make his Test debut in the series opener against England.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-live-cricket-score-1st-test-day-1-leeds-updates-2743615-2025-06-20",
      "headline": "1st Test Day 1 LIVE: Yashasvi Jaiswal, KL Rahul off to cautious startEngland (ENG) vs India (IND), 1st Test Day 1 Live Score and Updates from Leeds: Indian openers Yashasvi Jaiswal and KL Rahul are off to a cautious start in Leeds after England won the toss and opted to bowl. Rahul has shown good discipline, leaving anything outside off, while Jaiswal has looked positive at the other end, picking up a few early boundaries.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/no-karun-nair-ajinkya-rahane-snub-england-india-probable-squad-for-headingley-test-2743603-2025-06-20",
      "headline": "No Karun Nair: Ajinkya Rahane's big call in India playing XI for England TestENG vs IND: In a rather surprising move, Ajinkya Rahane chose to leave Karun Nair out of his probable playing XI, opting instead for Dhruv Jurel to take his place in the first Test against England at Headingley.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/paris-diamond-league-neeraj-chopra-preview-competitors-2743610-2025-06-20",
      "headline": "After breaking 90m jinx, Neeraj Chopra eyes first win of 2025Paris Diamond League: After ending the 90-metre curse, Neeraj Chopra will be looking to secure his first title of the season when he steps onto the field for the Paris Diamond League. Neeraj will be up against a strong field that features the likes of Julian Weber, Anderson Peters among other stars. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dwayne-bravo-appointed-head-coach-trinbago-knight-riders-cpl-2025-2743559-2025-06-20",
      "headline": "Trinbago Knight Riders appoint Dwayne Bravo as new head coachDwayne Bravo has been appointed head coach of the Trinbago Knight Riders for the 2025 Caribbean Premier League season, marking a new chapter as TKR aims to clinch a fifth CPL title under his leadership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/sai-sudharsan-abhimanyu-easwaran-selected-for-india-england-tour-2743138-2025-06-20",
      "headline": "Sudharsan or Easwaran: Ex-cricketers back experience over potentialFormer cricketers Mohammed Kaif and WV Raman have backed experienced domestic stalwart Abhimanyu Easwaran to start in the upcoming Test series in England, citing his consistent performances over the years in domestic cricket as a stronger case for selection compared to the promise shown by someone like Sai Sudharsan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/karun-nair-ready-for-test-comeback-in-england-tour-2743543-2025-06-20",
      "headline": "Life has come full circle: Karun Nair ready for Test comeback in England seriesA matured and improved Karun Nair will look to make use of the learnings from his grind in the domestic setup as he aims to impress in the upcoming Test series against England. He reflected on how he was dropped from the side and ended up making a comeback in England, the place where he was last with the Test team in 2018."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/no-karun-nair-ajinkya-rahane-snub-england-india-probable-squad-for-headingley-test-2743603-2025-06-20",
      "headline": "No Karun Nair: Ajinkya Rahane's big call in India playing XI for England TestENG vs IND: In a rather surprising move, Ajinkya Rahane chose to leave Karun Nair out of his probable playing XI, opting instead for Dhruv Jurel to take his place in the first Test against England at Headingley.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/paris-diamond-league-neeraj-chopra-preview-competitors-2743610-2025-06-20",
      "headline": "After breaking 90m jinx, Neeraj Chopra eyes first win of 2025Paris Diamond League: After ending the 90-metre curse, Neeraj Chopra will be looking to secure his first title of the season when he steps onto the field for the Paris Diamond League. Neeraj will be up against a strong field that features the likes of Julian Weber, Anderson Peters among other stars. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dwayne-bravo-appointed-head-coach-trinbago-knight-riders-cpl-2025-2743559-2025-06-20",
      "headline": "Trinbago Knight Riders appoint Dwayne Bravo as new head coachDwayne Bravo has been appointed head coach of the Trinbago Knight Riders for the 2025 Caribbean Premier League season, marking a new chapter as TKR aims to clinch a fifth CPL title under his leadership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/sai-sudharsan-abhimanyu-easwaran-selected-for-india-england-tour-2743138-2025-06-20",
      "headline": "Sudharsan or Easwaran: Ex-cricketers back experience over potentialFormer cricketers Mohammed Kaif and WV Raman have backed experienced domestic stalwart Abhimanyu Easwaran to start in the upcoming Test series in England, citing his consistent performances over the years in domestic cricket as a stronger case for selection compared to the promise shown by someone like Sai Sudharsan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/karun-nair-ready-for-test-comeback-in-england-tour-2743543-2025-06-20",
      "headline": "Life has come full circle: Karun Nair ready for Test comeback in England seriesA matured and improved Karun Nair will look to make use of the learnings from his grind in the domestic setup as he aims to impress in the upcoming Test series against England. He reflected on how he was dropped from the side and ended up making a comeback in England, the place where he was last with the Test team in 2018."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}