{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indigo-parent-tax-penalty-order-income-tax-department-airline-contest-frivolous-directive-2701324-2025-03-30",
      "headline": "IndiGo gets Rs 944 crore tax penalty, calls it erroneous and frivolousBudget carrier IndiGo's parent company said it had received a Rs 944 crore tax penalty order from the Income Tax Department. The company plans to challenge the order legally and called it \"frivolous and erroneous\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/top-gainers-losers-stock-market-sensex-nifty-nse-bse-shares-it-auto-trump-tariff-2700664-2025-03-28",
      "headline": "Sensex, Nifty closing: Top stocks that gained and lost on BSE, NSEIT and auto sector stocks dragged the market down. The fall in IT and auto stocks is linked to concerns over US reciprocal tariffs, which are set to come into effect on April 2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/thailand-stock-exchange-halts-trading-after-earthquake-hits-myanmar-2700603-2025-03-28",
      "headline": "Thailand stock exchange halts trading after earthquake hits MyanmarFollowing tremors from the Myanmar earthquake, the Stock Exchange of Thailand suspended all trading for the Friday afternoon session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/da-hiked-by-2-percent-how-much-salary-will-central-government-employees-get-2700579-2025-03-28",
      "headline": "DA hiked by 2%: Here's how much central government employees will earn nowWith the 2% hike, DA has now risen from 53% to 55%. Pensioners will also experience a similar increase in their Dearness Relief (DR)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-ends-191-points-lower-nifty-settles-above-23500-it-stocks-tumble-2700566-2025-03-28",
      "headline": "Sensex, Nifty end FY25 on a weak note as Trump tariffs weigh on Dalal StreetThe S&P BSE Sensex lost 191.51 points to close at 77,414.92, while the NSE Nifty50 was down 72.60 points to end at 23,519.35.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tracking-india-billionaire-growth-from-2014-to-2025-massive-surge-hurun-rich-list-2025-key-data-explained-2700554-2025-03-28",
      "headline": "How India saw a billionaire boom in just 10 yearsIndia's billionaire club isn't just growing—it's thriving. A decade ago, cracking this list was a rare feat. Now, it's happening faster than ever. Even with market swings and economic headwinds, the country keeps adding new names to its billionaire ranks."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/cabinet-approves-da-hike-salary-government-employees-2700544-2025-03-28",
      "headline": "Salary boost for central government employees, DA hiked by 2%With this revision, DA will rise from 53% to 55%, offering a salary boost to employees. The last DA increase took place in July 2024, when it was raised from 50% to 53%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/missed-tax-deducted-at-source-tds-on-rent-here-is-what-tax-department-is-doing-2700536-2025-03-28",
      "headline": "Missed TDS on rent? Here's what tax department is doingThe law requires tenants to deduct TDS at 2% on rent above Rs 50,000 per month, in case the landlord is a resident Indian. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-bilateral-talk-offers-to-lower-us-farm-tariffs-strengthen-trade-ties-diary-report-2700508-2025-03-28",
      "headline": "India offers to lower US farm tariffs, looks to strengthen trade ties: ReportIndia-US trade talk: The government has proposed reducing import duties on several US agricultural products, including almonds, walnuts, cranberries, pistachios, and lentils. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-falling-on-march-28-3-things-explained-for-retail-investors-2700495-2025-03-28",
      "headline": "Why is stock market falling today? 3 things investors need to knowThe S&P BSE Sensex was down 339.66 points to 77,266.77 at 1:13 pm and the NSE Nifty50 traded 100.45 points lower to trade at 23,491.50. Here are three important points retail investors need to know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hurun-global-rich-list-india-billionaire-more-money-saudi-arabia-gdp-mukesh-ambani-adani-roshni-nadar-2700490-2025-03-28",
      "headline": "India's billionaires have wealth bigger than Saudi Arabia's GDP. Check detailsIndia's billionaires now have a combined wealth that exceeds the entire economy of Saudi Arabia. India ranks third globally in the number of billionaires, behind the United States and China."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/health-insurance-claim-rejected-5-common-mistakes-to-avoid-2700418-2025-03-28",
      "headline": "Health insurance rejected? Here are 5 things you need to knowUnderstanding why health insurance claims are rejected is important as it will help you avoid unnecessary stress or financial burden during medical emergencies."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/screen-idol-richard-chamberlain-dies-at-90-2701390-2025-03-30",
      "headline": "Screen idol Richard Chamberlain dies at 90American actor Richard Chamberlain, known for his shows such as Shogun and Dr Kildare, has died. He was 90. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/salman-khan-sikandar-box-office-performance-might-be-impacted-film-leaked-2701372-2025-03-30",
      "headline": "Salman Khan's Sikandar box office performance might be impacted. Here's whySuperstar Salman Khan's Sikandar's box office performance might be severely impacted in the days to come. Already, trade experts are predicting only a Rs 30 crore opening. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sikandar-box-office-day-1-prediction-salman-khan-film-rs-30-crore-2701340-2025-03-30",
      "headline": "Sikandar box office Day 1 prediction: Salman film to open around Rs 30 crore-markSikandar box office Day 1 prediction: Superstar Salman Khan's latest release, Sikandar, is gearing up for a grand opening. According to trade reports, Sikandar might make somewhere around Rs 25-30 crore on its opening day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vidyut-jammwal-supports-kunal-kamra-kamaal-r-khan-2701326-2025-03-30",
      "headline": "Actor Vidyut Jammwal supports Kunal Kamra, asks why no one questions Kamaal R KhanActor Vidyut Jammwal has seemingly extended his support to comedian Kunal Kamra in his latest social media post. He also asked why no one ever questions actor Kamaal R Khan's statements that often target women and the country itself. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aishwarya-rai-abhishek-bachchan-aaradhya-viral-pics-cousins-wedding-2701327-2025-03-30",
      "headline": "Aishwarya Rai, Abhishek Bachchan, and Aaradhya's viral pics from cousin's weddingA photo of Aishwarya Rai enjoying her cousin's wedding with her husband-actor Abhishek Bachchan and daughter Aaradhya has gone viral. \r\n\r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/empuraan-box-office-mohanlal-film-inches-close-rs-50-crore-mark-2701319-2025-03-30",
      "headline": "Empuraan box office Day 3: Mohanlal's film inches close to Rs 50 crore markPrithviraj Sukumaran's third directorial, L2: Empuraan, witnessed a slight rise in domestic earnings on Saturday. The film released in theatres on March 27."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/pm-narendra-modi-big-shoutout-to-rapper-hanumankind-for-run-it-up-2701314-2025-03-30",
      "headline": "PM Modi's big shoutout to rapper Hanumankind for his song Run it UpPrime Minister Narendra Modi has congratulated Indian-origin rapper Hanumankind for his latest song, Run it Up. The PM shared his congratulatory wishes to the artiste during his Mann Ki Baat address. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-gets-grand-welcome-in-jaipur-2701302-2025-03-30",
      "headline": "From regal forts to peacocks: Priyanka Chopra gets grand welcome in JaipurPriyanka Chopra reached Jaipur for her professional commitments. The actor shared a bunch of pictures from her stay on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mobland-review-tom-hardy-pierce-brosnan-2701188-2025-03-30",
      "headline": "MobLand review: A gritty crime drama with a stellar castReleased-Mon Mar 31, 2025MobLand delves into the violent world of two crime families in London. With a stellar cast, this series offers gripping drama and intense power dynamics. Read on and find out if it suits your taste."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-apologises-over-riot-references-in-empuraan-2701275-2025-03-30",
      "headline": "Mohanlal says Gujarat riot themes to be removed from Empuraan: Regret mental painActor Mohanlal has apologised over riot references in his film L2: Empuraan. The Malayalam star released a statement on social media on Sunday amid the ongoing row. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/sikandar-review-ode-to-salman-khan-stardom-rashmika-mandanna-2701267-2025-03-30",
      "headline": "Sikandar review: An ode to Salman Khan's stardom that's devoid of funReleased-Sun Mar 30, 2025Salman Khan-starrer Sikandar has released with a bang, with the promise of entertaining Khan's die-hard fans. Directed by AR Murugadoss, the film also stars Rashmika Mandanna. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kerala-chief-minister-pinarayi-vijayan-watches-empuraan-amid-row-over-its-themes-2701264-2025-03-30",
      "headline": "Kerala Chief Minister watches Empuraan: Freedom of expression must be protectedKerala Chief Minister Pinarayi Vijayan recently watched Prithviraj's L2: Empuraan and shared his take on social media. The film has been caught in the middle of a controversy over its allusion to the Gujarat riots. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sikandar-x-reviews-salman-khan-entry-say-goosebumps-guaranteed-rashmika-mandanna-2701239-2025-03-30",
      "headline": "Sikandar X reviews: Fans praise Salman Khan's entry, say 'goosebumps guaranteed' Live Updates Salman Khan's much-awaited movie Sikandar has finally been released in theatres today, March 30. Fans showered their love on the film and praised Salman's return to the big screen. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/salman-khan-sikandar-leaked-online-hours-before-theatrical-release-2701223-2025-03-30",
      "headline": "Salman Khan's Sikandar leaked online hours before theatrical releaseSalman Khan's Sikandar was leaked online hours before its release on March 30. The movie was available on various pirated sites. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vishnu-manchu-akshay-kumar-prabhas-kannappa-release-postponed-vfx-2701206-2025-03-30",
      "headline": "Vishnu Manchu, Akshay Kumar's Kannappa release postponedVishnu Manchu's upcoming film, Kannappa, has been delayed. The actor shared a statement on social media and addressed the reason behind the delay. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/jewel-thief-jaideep-ahlawat-nikita-dutta-heist-to-win-hearts-2701194-2025-03-30",
      "headline": "Jewel Thief stars Jaideep Ahlawat, Nikita Dutta on a heist to win hearts. WatchJaideep Ahlawat and his Jewel Thief co-star Nikita Dutta won hearts with their adorable video on the song 'Price Tag'. Their upcoming film is slated to release on Netflix on April 25. \r\n\r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/neha-kakkar-melbourne-event-organisers-deny-claim-of-mismanagement-2701132-2025-03-29",
      "headline": "Neha Kakkar's Melbourne event organisers deny claim of mismanagement: We're in debtSinger Neha Kakkar's Melbourne concert organisers have denied her claims of mismanagement and said that in fact after the event, they are the ones in debt.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prithviraj-empuraan-to-have-17-cuts-after-row-over-riot-depiction-2701066-2025-03-29",
      "headline": "17 cuts in Mohanlal's Empuraan after row over Gujarat riots depiction: SourcesPrithviraj Sukumaran's directorial, Empuraan, will have 17 cuts in the film after protests erupted online over the film's indirect depiction of the Gujarat riots. It is reported that the edited version will be screened from April 2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sonu-nigam-visits-lk-advani-and-his-daughter-calls-them-extended-family-2701100-2025-03-29",
      "headline": "Sonu Nigam visits LK Advani and his daughter, calls them his 'extended family'Singer Sonu Nigam recently visited the residence of veteran BJP leader LK Advani in New Delhi. The artiste shared a post highlighting the same on his social media handle. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-threatens-iran-with-bombing-secondary-tariffs-over-nuclear-agreement-2701404-2025-03-30#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Make deal or there will be bombing: Trump threatens Iran over nuclear agreementUS President Donald Trump issued a warning to Iran if they failed to reach an agreement with Washington over nuclear program."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shashi-tharoor-modi-government-bjp-vaccine-maitri-health-diplomacy-pm-congress-2701416-2025-03-30#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Shashi Tharoor praises vaccine diplomacy: India enhanced its soft powerCongress MP Shashi Tharoor praised the Centre's decision to implement India's Vaccine Maitri initiative during the Covid-19 pandemic, aimed at sending vaccines to several countries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-says-hes-considering-ways-to-serve-3rd-term-i-am-not-joking-2701460-2025-03-31#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump says he's considering ways to serve 3rd term: I am not jokingUS President Donald Trump has again suggested he may seek a third term, asserting in a televised interview that he is \"not joking\" about the possibility, despite constitutional restrictions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-csk-match-report-highlights-hasaranga-ms-dhoni-jadeja-nitish-rana-2701454-2025-03-30#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Nitish Rana, Hasaranga stun CSK in Guwahati as RR open account in IPL 2025IPL 2025: Rajasthan Royals clinched their first win of the season by defeating Chennai Super Kings on Sunday, March 30. Chennai failed to chase down a target of over 180 runs once again. Wanindu Hasaranga and Nitish Rana starred for RR after poor starts to their respective seasons.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/roblox-and-adolescence-video-games-bring-devil-into-childs-room-netflix-roblox-fortnite-addiction-know-more-2700709-2025-03-30#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Roblox and Adolescence: How video games bring the devil into a child's roomNetflix's Adolescence has sparked discussions about the impact of social media on teens and early teens. Beyond social media, many children immerse themselves in online video games — a world that parents are largely unfamiliar with. Platforms like Roblox and Fortnite expose young players to strangers. There are chances of cyberbullying and exposure to adult content. Here's all about the dark world and how to keep children safe."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/landslide-himachal-pradesh-kullu-deaths-injuries-2701380-2025-03-30#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "6 dead, several injured after landslide in Himachal Pradesh's KulluSix people were killed in a landslide in Himachal Pradesh's Kullu after a tree fell on them along with debris. Emergency and rescue personnel were at the site, taking stock of the situation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/noida/story/noida-lamborghni-crash-man-rams-luxury-car-into-labourers-detained-hospital-2701412-2025-03-30#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Did anyone die, Lamborghini driver asks after ramming into 2 labourers in NoidaA man rammed his Lamborghini into two labourers in Noida Sector 94, seriously injuring them before asking locals whether somebody had died during a confrontation with them. Police detained the accused and confiscated the vehicle."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/donald-trump-vladimir-putin-tariffs-oil-ukraine-russia-war-nbc-interview-us-2701436-2025-03-30#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Pissed off' Trump threatens up to 50% tariff to pressure Putin on Ukraine dealUS President Donald Trump threatened to impose up to a 50 per cent tariff on Russian oil if Moscow was unable to make a deal with Kyiv to stop the three-year-old war in Ukraine."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/sikandar-review-ode-to-salman-khan-stardom-rashmika-mandanna-2701267-2025-03-30#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sikandar review: An ode to Salman Khan's stardom that's devoid of funReleased-Sun Mar 30, 2025Salman Khan-starrer Sikandar has released with a bang, with the promise of entertaining Khan's die-hard fans. Directed by AR Murugadoss, the film also stars Rashmika Mandanna. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-apologises-over-riot-references-in-empuraan-2701275-2025-03-30#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Mohanlal says Gujarat riot themes to be removed from Empuraan: Regret mental painActor Mohanlal has apologised over riot references in his film L2: Empuraan. The Malayalam star released a statement on social media on Sunday amid the ongoing row. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bengaluru-guwahati-express-train-derails-odisha-cuttack-casualties-injuries-reported-rescue-ops-2701329-2025-03-30#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "1 dead after 11 coaches of Guwahati-bound express train derail in OdishaOne person died and eight others, including two from Assam, were injured after 11 coaches of the Bengaluru-Kamakhya Express derailed in Odisha's Cuttack. Restoration work on the affected stretch was underway on war footing."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/national-investigation-agency-arrests-travel-agent-sending-people-us-donkey-route-2701434-2025-03-30#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Travel agent arrested for sending Indians to US via donkey route amidThe anti-terror agency arrested the accused, Gagandeep Singh alias Goldie, from New Delhi. The complaint was filed by a resident of Punjab's Tarn Taran."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/myanmar-earthquake-death-toll-injured-rescue-operation-thiland-tremors-2701250-2025-03-30#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Myanmar quake: Rescuers race against time, aftershocks keep survivors on edgeRescue operations in Myanmar are currently concentrated in Mandalay, the country's second-largest city, and the capital, Naypyitaw."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-srh-score-mitchell-starc-faf-du-plessis-vizag-2701387-2025-03-30#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Mitchell Starc haunts SRH once again as DC flaunt title aspirationsIPL 2025, DC vs SRH: Delhi Capitals came up with an all-round performance to hammer SunRIsers Hyderabad by 7 wickets in Vizag on Sunday, March 30. Mitchell Starc's five-wicket haul and Faf du Plessis's quick-fire 50 helped SRH win with four overs to spare, chasing 164 without breaking a sweat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indigo-parent-tax-penalty-order-income-tax-department-airline-contest-frivolous-directive-2701324-2025-03-30#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "IndiGo gets Rs 944 crore tax penalty, calls it erroneous and frivolousBudget carrier IndiGo's parent company said it had received a Rs 944 crore tax penalty order from the Income Tax Department. The company plans to challenge the order legally and called it \"frivolous and erroneous\"."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/salman-khan-sikandar-box-office-performance-might-be-impacted-film-leaked-2701372-2025-03-30#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Salman Khan's Sikandar box office performance might be impacted. Here's whySuperstar Salman Khan's Sikandar's box office performance might be severely impacted in the days to come. Already, trade experts are predicting only a Rs 30 crore opening. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/princess-of-wales-kate-middleton-mother-day-message-nature-2701392-2025-03-30#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kate Middleton's Mother's Day message is all about Mother Nature: Our sanctuaryKate Middleton, Princess of Wales, marked Mother's Day by sharing how nature has been her \"sanctuary\" over the past year. She highlighted its importance in a video message, reflecting on her recovery and gradual return to public life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/trending/weekly-quiz-468-28-03-2025#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/indian-origin-ceo-shooting-attack-miscreant-shot-at-twice-san-francisco-hotel-2701358-2025-03-30#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Indian-origin CEO alleges shooting near San Francisco hotel: Regret not taking UberAn Indian-origin CEO has claimed that miscreants chased him and shot at him twice at his San Francisco hotel. In a post on X, he detailed the attack and said he had never experienced such an attack in 30 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/elon-musk-step-down-doge-quit-trump-administration-us-tesla-protests-2701210-2025-03-30#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Is Elon Musk planning to quit DOGE amid Tesla crisis? Here's what he saidElon Musk is planning to step down from the Department of Government Efficiency by late May, citing progress in deficit reduction, as Tesla faces protests, stock declines, and legal challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/prime-minister-narendra-modi-leaves-handwritten-note-at-nagpurs-rss-smruti-mandir-2701227-2025-03-30#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "PM Modi's handwritten note at Nagpur's RSS Smruti Mandir: This place inspires usPM Modi, in his handwritten note, paid tribute to Keshav Baliram Hedgewar and other revered leaders of the Rashtriya Swayamsevak Sangh (RSS)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-sunrisers-blackmail-hyderabad-cricket-association-free-tickets-letter-2701378-2025-03-30#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "SRH threaten to leave Hyderabad over blackmail for free IPL tickets: ReportIPL 2025: SunRisers Hyderabad have reportedly threatened to move their home base from Hyderabad after alleging blackmail from Hyderabad Cricket Association over free tickets. A VIP box was locked after SRH refused to give out extra complementary passes during their home game against Lucknow Super Giants on March 27. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ruturaj-gaikwad-rr-vs-csk-defeat-2701459-2025-03-31",
      "headline": "CSK not pro-active enough? Gaikwad calls for improvement after defeat vs RRIPL 2025, RR vs CSK: Ruturaj Gaikwad said that the Chennai Super Kings were not proactive enough after losing to the Rajasthan Royals on Sunday where they failed to chase down 183 at the Barsapara Stadium in Guwahati."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-number-7-batting-position-rr-vs-csk-2701458-2025-03-30",
      "headline": "IPL 2025: MS Dhoni walks in at No.7, but fails to fire for CSK vs RRMS Dhoni's promotion to number 7 wasn't enough as Chennai Super Kings suffered their second consecutive defeat, falling short of the 183-run target against Rajasthan Royals despite a valiant effort from their skipper."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-csk-match-report-highlights-hasaranga-ms-dhoni-jadeja-nitish-rana-2701454-2025-03-30",
      "headline": "Nitish Rana, Hasaranga stun CSK in Guwahati as RR open account in IPL 2025IPL 2025: Rajasthan Royals clinched their first win of the season by defeating Chennai Super Kings on Sunday, March 30. Chennai failed to chase down a target of over 180 runs once again. Wanindu Hasaranga and Nitish Rana starred for RR after poor starts to their respective seasons.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-riyan-parag-jake-fraser-mcgurk-vijay-shankar-rr-vs-csk-2701450-2025-03-30",
      "headline": "Riyan Parag, Fraser-McGurk, Vijay Shankar grab sensational catchesIPL 2025: Riyan Parag took a brilliant catch to send Shivam Dube packing in the match between CSK and RR. Earlier in the day, Delhi Capitals' Jake Fraser-McGurk pulled off a stupendous catch as well. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/barcelona-vs-girona-match-report-robert-lewandowski-2701441-2025-03-30",
      "headline": "20 games, 0 losses: Barcelona hammer Girona 4-1 to continue dream run in 2025FC Barcelona thrashed Girona 4-1 on Sunday to continue their dream run in 2025. Barcelona have played a total of 20 matches so far in 2025 and have not lost a single one of them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-csk-jofra-archer-rachin-ravindra-wicket-2701437-2025-03-30",
      "headline": "After 699 days, Jofra Archer ends wait for IPL wicket with fiery overIPL 2025, RR vs CSK: Jofra Archer breathed fire in his first two overs when he also got the wicket of the in-form Rachin Ravindra in Rajasthan's clash against Chennai on Sunday at the Barsapara Stadium in Guwahati. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-srh-abhishek-porel-press-kl-rahul-axar-patel-captaincy-2701429-2025-03-30",
      "headline": "DC vs SRH: How big brother KL Rahul helped Abhishek Porel forget costly dropIPL 2025, DC vs SRH: Abhishek Porel dropped SunRisers Hyderabad's Aniket Verma on 6 in Vzag on Sunday. The debutant went on to hit 74 off 41 deliveries in their loss to Delhi Capitals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-csk-r-ashwin-ms-dhoni-stumping-nitish-rana-vieo-2701418-2025-03-30",
      "headline": "Watch: R Ashwin and MS Dhoni recreate old magic to outfox rampaging Nitish RanaIPL 2025, RR vs CSK: MS Dhoni and R Ashwin recreated a bit of old magic to stop Nitish Rana's rampage in Guwahati. The Rajasthan Royals star missed a well-deserved hundred after he was out stumped by Dhoni on Sunday, March 30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-vs-mi-chandrkant-pandit-pitch-controversy-home-advantage-2701417-2025-03-30",
      "headline": "KKR coach responds to pitch controversy: We expect some home advantageIPL 2025: Chandrakant Pandit downplayed pitch controversy, asserting KKR's readiness to adapt to any conditions while expecting fair home advantage like other IPL teams. KKR take on Mumbai Indians on March 31, as they look to build some winning momentum."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-srh-mitchell-starc-five-wickets-2701408-2025-03-30",
      "headline": "Starc drops fast bowler's ego, runs through SRH to close perfect Vizag chapterMitchell Starc ran through the SRH batting order on Sunday, March 29. After picking his maiden 5-wicket haul in T20s, Starc said that he has had to snub his fast bowler's ego in the recent past."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-csk-playing-xi-big-changes-deepak-hooda-vijay-shankar-2701393-2025-03-30",
      "headline": "IPL 2025: CSK make big changes vs RR after disastrous loss to RCBDesperate to recover from their loss to Royal Challengers Bengaluru, Chennai  Super Kings made two big changes to their playing XI against an unchanged Rajasthan Royals for their Guwahati clash on March 30.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-srh-abhishek-porel-press-kl-rahul-axar-patel-captaincy-2701429-2025-03-30",
      "headline": "DC vs SRH: How big brother KL Rahul helped Abhishek Porel forget costly dropIPL 2025, DC vs SRH: Abhishek Porel dropped SunRisers Hyderabad's Aniket Verma on 6 in Vzag on Sunday. The debutant went on to hit 74 off 41 deliveries in their loss to Delhi Capitals. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-csk-r-ashwin-ms-dhoni-stumping-nitish-rana-vieo-2701418-2025-03-30",
      "headline": "Watch: R Ashwin and MS Dhoni recreate old magic to outfox rampaging Nitish RanaIPL 2025, RR vs CSK: MS Dhoni and R Ashwin recreated a bit of old magic to stop Nitish Rana's rampage in Guwahati. The Rajasthan Royals star missed a well-deserved hundred after he was out stumped by Dhoni on Sunday, March 30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kkr-vs-mi-chandrkant-pandit-pitch-controversy-home-advantage-2701417-2025-03-30",
      "headline": "KKR coach responds to pitch controversy: We expect some home advantageIPL 2025: Chandrakant Pandit downplayed pitch controversy, asserting KKR's readiness to adapt to any conditions while expecting fair home advantage like other IPL teams. KKR take on Mumbai Indians on March 31, as they look to build some winning momentum."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-srh-mitchell-starc-five-wickets-2701408-2025-03-30",
      "headline": "Starc drops fast bowler's ego, runs through SRH to close perfect Vizag chapterMitchell Starc ran through the SRH batting order on Sunday, March 29. After picking his maiden 5-wicket haul in T20s, Starc said that he has had to snub his fast bowler's ego in the recent past."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-csk-playing-xi-big-changes-deepak-hooda-vijay-shankar-2701393-2025-03-30",
      "headline": "IPL 2025: CSK make big changes vs RR after disastrous loss to RCBDesperate to recover from their loss to Royal Challengers Bengaluru, Chennai  Super Kings made two big changes to their playing XI against an unchanged Rajasthan Royals for their Guwahati clash on March 30.\r\n\r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}