{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/fuel-price-cut-unlikely-as-middle-east-tensions-drive-crude-oil-surge-report-2611414-2024-10-04",
      "headline": "Fuel price cut unlikely as Middle East tensions drive crude oil surge: ReportThe conflict in the Middle East has pushed oil prices higher, with Brent crude oil prices increasing significantly, affecting global supply."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-job-data-labour-department-bureau-of-labour-statistics-nonfarm-payrolls-september-2611391-2024-10-04",
      "headline": " US adds more jobs in September; unemployment falls to 4.1%Average hourly earnings grew by 0.4% in September, slightly lower than the 0.5% increase seen in August."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-nifty-worst-week-since-june-2022-china-iran-israel-middle-east-conflict-2611372-2024-10-04",
      "headline": " Sensex crashes over 4,000 points this week, investors lose Rs 16 lakh crore The combined market capitalisation of companies listed on the Bombay Stock Exchange (BSE) has shrunk to Rs 461.26 lakh crore, marking a loss of Rs 15.9 lakh crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hadiram-stake-sale-valuation-usd-11-billion-singapore-state-investment-temasek-report-2611316-2024-10-04",
      "headline": "Temasek eyes a bite of Haldiram's at valuation of $11 billion: ReportThe discussions with Temasek come at a time when Haldiram's is exploring its growth potential and could pave the way for an initial public offering (IPO). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hyundai-ipo-valuation-19-billion-dollars-india-biggest-public-offering-2611233-2024-10-04",
      "headline": "Hyundai seeks $19 billion valuation for its mega India IPO, says reportHyundai is expected to file updated documents with India's market regulator, the Securities and Exchange Board of India (Sebi), possibly as soon as Monday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-end-lower-middle-east-tensions-oil-price-worries-spook-markets-2611232-2024-10-04",
      "headline": "Sensex, Nifty tank as Middle East tensions, oil price worries spook marketsThe S&P BSE Sensex lost 808.65 points to close at 81,688.45, while the NSE Nifty50 was down 200.25 points to end at 25,049.85."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-are-gold-prices-high-increasing-middle-east-iran-israel-conflict-safe-haven-2611216-2024-10-04",
      "headline": " Explained: Why are gold prices on the riseGold futures, maturing on December 5, 2024, were priced at Rs 76,468 per 10 grams after gaining Rs 224, or 0.29%, from the previous close of Rs 76,244. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-services-sector-growth-hits-10-month-low-in-september-2611118-2024-10-04",
      "headline": "India's services sector growth hits 10-month low in SeptemberThe HSBC final India Services purchasing managers' index, compiled by S&P Global, fell to 57.7 in September from a five-month high of 60.9 in August and was below a preliminary estimate of 58.9."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nirmala-sitharaman-india-per-capita-income-rise-2000-dollars-5-years-kautilya-economic-conclave-2611092-2024-10-04",
      "headline": "India's per capita income to surge by $2,000 in 5 years, says Nirmala SitharamanFinance Minister Nirmala Sitharaman highlighted that India is well on track to double its per capita income within a few years, largely driven by economic and structural reforms implemented over the past decade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-update-sensex-rises-800-points-nifty-gains-it-bank-shares-rebound-2611088-2024-10-04",
      "headline": "Sensex surges 800 points as IT, bank stocks power market reboundHigh-weightage Nifty IT led the sectoral indices, rising 1.8%, fuelled by strong performances in Infosys and Tech Mahindra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-motors-share-price-gains-2-percent-today-auto-stock-rally-what-next-gain-loss-buy-sell-2611077-2024-10-04",
      "headline": "Tata Motors shares rise 2% today. Will the auto stock's rally continue?Over the past year, Tata Motors has gained 54.05%, and over three years, it has surged by over 170%. The stock's beta over the past year is roughly 1, indicating average volatility during that period."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/apple-iphone-16-pro-models-made-in-india-new-stores-bengaluru-pune-delhi-mumbai-2611064-2024-10-04",
      "headline": "Apple deepens India foothold with new stores, local production of all iPhonesApple is planning to expand its retail presence in India with more flagship Apple stores in key cities as it aims to create more direct customer interactions and experiences. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/diffusion-engineers-listing-share-price-12-percent-premium-hold-sell-book-profit-expert-view-2611035-2024-10-04",
      "headline": "Diffusion Engineers shares list at 12% premium: Hold or book profit? Diffusion Engineers listing: The shares listed at Rs 188 on the Bombay Stock Exchange (BSE), marking an 11.90% rise over the issue price of Rs 168."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-price-today-october-4-2024-precious-metals-record-hike-on-mcx-2611027-2024-10-04",
      "headline": "Gold, silver price today, October 4, 2024: Precious metals record hike on MCXGold Price Today October 4, 2024: Both gold and silver are trading on the higher side of the Multi Commodity Exchange (MCX) on Friday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/reliance-power-share-price-5-percent-lower-circuit-today-board-approval-fccbs-2611026-2024-10-04",
      "headline": "Explained: Why Reliance Power shares hit 5% lower circuit todayDespite Friday's drop, Reliance Power shares have surged 64% in a month, gaining 112.82% year-to-date and 171.70% annually.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdfc-bank-q2-update-loan-deposit-gross-advances-casa-ldr-2611016-2024-10-04",
      "headline": "HDFC Bank shares Q2 update, says deposit growth outpaces loansHDFC Bank Q2 update: The bank's gross advances, or loans sanctioned and disbursed, rose by 1.3% to Rs 25.19 lakh crore in the quarter ending September, following a slight 0.8% decline in the previous quarter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ratan-tata-5-percent-stake-sale-upstox-23000-percent-returns-on-investment-2611004-2024-10-04",
      "headline": "Ratan Tata sells 5% stake in Upstox. The gains will surprise you Despite this partial sale, Ratan Tata still holds 95% of his original stake in the company."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/diffusion-engineers-listing-share-price-rs-188-bse-misses-expected-listing-gain-2611001-2024-10-04",
      "headline": "Diffusion Engineers shares list at 12% premium, misses expectationsDiffusion Engineers shares listing: The shares of Diffusion Engineers Limited opened at Rs 188 on the Bombay Stock Exchange (BSE) marking a premium of 11.90% over its issue price of Rs 168."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mark-zuckerberg-overtakes-jeff-bezos-as-worlds-second-richest-person-2610993-2024-10-04",
      "headline": "Mark Zuckerberg overtakes Jeff Bezos as world's second-richest person The dramatic rise in Mark Zuckerberg's fortune has been fuelled by a 23% increase in Meta's stock price since its better-than-expected Q2 results.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-bell-sensex-nifty-middle-east-conflict-iran-israel-war-2610988-2024-10-04",
      "headline": "Sensex falls 200 points, Nifty dips on Middle East conflict concernsThe S&P BSE Sensex was down 183.91 points at 82,306.09 at 9:46 am, while the NSE Nifty50 fell 52.25 points to 25,188.05."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-lebanon-attack-beirut-hezbollah-gaza-war-palestine-hamas-netanyahu-latest-2611623-2024-10-05",
      "headline": "Israel targets north Lebanon, kills Hamas leader in fresh airstrikes  Live UpdatesIsraeli airstrikes targeting Hezbollah intensified in Lebanon, with blasts reported in Beirut and near the airport, as the offensive also expanded to northern Lebanon."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/protests-west-bengal-south-24-parganas-district-body-of-girl-canal-locals-say-police-inaction-2611640-2024-10-05",
      "headline": "Huge protests after Bengal girl's body found in canal, family alleges rapeThe girl's family alleged that they were harassed by the police when they went to file a complaint. A video showed a group of people marching towards a police station in protest. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/haryana-assembly-elections-voting-bjp-congress-nayab-saini-vinesh-phogat-aap-jjp-2611578-2024-10-05",
      "headline": "Brisk voting in Haryana in BJP vs Congress contest, over 35% turnout till 1 pm  Live UpdatesOver 2 crore voters cast their ballots in Haryana Assembly elections today in a fierce contest between the BJP and Congress, as both parties vie for control of the state. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/video/ground-report-hezbollah-hideout-in-beirut-reduced-to-rubble-in-israeli-strike-2611664-2024-10-05",
      "headline": "Ground report: Hezbollah hideout in Beirut reduced to rubble in Israeli strikeOver 25 Hezbollah fighters died in Israeli airstrikes in Dahiyeh district in the southern part of Beirut on Friday evening. India Today TV's Ashraf Wani, showed visuals of a building which was completely destroyed in the Israeli attacks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/revisiting-the-lost-glory-of-90s-indi-pop-magic-2611390-2024-10-05",
      "headline": "How the bustling beats of 90s' Indi-pop faded awayThe 90s era was a transformative period for Indian music, with Indi-pop emerging as a unique fusion of Indian and Western sounds, captivating audiences and creating a cultural wave. Though it faced a decline due to various factors, the genre is seeing a hopeful revival as modern artistes experiment with its essence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/video/watch-bjp-mp-naveen-jindal-arrives-on-horse-to-cast-vote-in-haryana-2611694-2024-10-05",
      "headline": "Watch: BJP's Naveen Jindal arrives at polling booth on horse to cast voteBJP MP Naveen Jindal went to a polling station in Kurukshetra in Haryana to cast his vote for the Assembly elections on Saturday on a horse. The Haryana elections are being held in a single phase on October 5 to elect 90 legislators in the state."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/kashmiri-separatist-yasin-malik-gandhian-resistance-given-up-armed-struggle-uapa-tribunal-2611677-2024-10-05",
      "headline": "Gave up arms, I'm a Gandhian now: Separatist Yasin Malik to tribunalSeparatist leader Yasin Malik told a UAPA tribunal that he's given up armed struggle and adopted a \"Gandhian way of resistance\" to promote a \"united, independent Kashmir\"."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/amethi-murder-shooting-teacher-family-accused-extramarital-affair-victim-wife-police-probe-2611630-2024-10-05",
      "headline": "Amethi murders fallout of accused's affair with victim's wife: PoliceAccording to police, the accused, Chandan Verma, confessed to having an affair with the victim's wife, Poonam, for the past 1.5 years. However, the relationship had recently soured."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/inside-bigg-boss-18-house-turkish-hammam-bathroom-to-cave-and-fort-like-interiors-2611665-2024-10-05",
      "headline": "Inside Bigg Boss 18 house: Turkish hammam bathroom to cave and fort-like interiorsBigg Boss 18 is scheduled to premiere this Sunday. In anticipation of the launch, the show's producers released a video showcasing the grand house with its one-of-a-kind theme and interior design."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/israel-hit-iran-nuclear-facilities-first-worry-about-rest-later-former-us-president-donald-trump-2611609-2024-10-05",
      "headline": "Israel should hit Iran's nuclear sites first, worry about rest later: TrumpDonald Trump's remark came after US President Joe Biden said that an \"all-out war\" in the Middle East was unlikely and should be avoided. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/unsure-israel-stalling-mideast-peace-deal-influence-us-elections-joe-biden-2611686-2024-10-05",
      "headline": "Unsure if Israel is stalling Mideast peace deal to influence US elections: BidenJoe Biden claimed that no other nation in the world has helped Israel more than the US. He said that the US was going to protect Israel. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/programme/india-first/video/watch-india-today-reports-from-war-fronts-in-lebanon-israel-2611567-2024-10-04",
      "headline": "Watch: From Lebanon to Israel, India Today reports from frontlines of conflictIn this episode of India First, watch India Today's Gaurav Sawant and Ashraf Wani's ground reports from conflict zones in Israel and Lebanon as tensions escalate in West Asia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/hockey-india-league-pr-sreejesh-exclusive-delhi-sg-pipers-mentor-director-2611637-2024-10-05",
      "headline": "A New Goal: PR Sreejesh times his transition from player to mentor perfectly Hockey India League: Speaking to IndiaToday.in, legendary hockey player PR Sreejesh opened up about resisting the urge to play again and transitioning into the role of a mentor for the new HIL franchise, Delhi SG Pipers. Sreejesh is confident that the HIL, returning after seven years, will do wonders for Indian hockey. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/school-girls-harrased-molested-bike-borne-men-up-deoria-cctv-2611649-2024-10-05",
      "headline": "Girls cycling back home from school molested by 4 bike-borne men in UPTwo Class 8 girls were harassed in broad daylight by four bike-borne men in Deoria, Uttar Pradesh, while returning home from school. The incident was captured on CCTV. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jammu-and-kashmir-encounter-infiltration-india-pakistan-border-kupwara-2611648-2024-10-05",
      "headline": "2 terrorists killed in encounter in J&K's Kupwara, Army finds war-like storesSecurity forces killed two terrorists during an infiltration attempt along the Line of Control in Kupwara district of Jammu and Kashmir. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/harmanpreet-kaur-run-out-amelia-kerr-india-new-zealand-rules-dead-ball-2611463-2024-10-04",
      "headline": "Dead-ball rule explained: Harmanpreet unhappy over run-out callWomen's T20 World Cup 2024: Skipper Harmanpreet Kaur and the Indian cricketers were left fuming after the umpires did not give a run-out ruling in their favour in the match against New Zealand on Friday in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/mood-swings-pcos-hormonal-imbalance-what-magnesium-deficiency-does-to-a-womans-body-2611381-2024-10-05",
      "headline": "What magnesium deficiency does to a woman's bodyIn women, magnesium supports hormonal balance, bone health and heart function. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-politics-entertainment-sports-business-424-04-10-2024",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-drug-racket-links-spread-dubai-uae-london-uk-kingpin-tushar-goyal-aide-virendra-basoya-2611584-2024-10-05",
      "headline": "Dubai, London links uncovered in Rs 5,000-crore drug bust in DelhiPolice are now investigating Virendra Basoya, suspected of running a massive drug syndicate from Dubai, after his name came up while questioning the prime accused in the Delhi drug bust case."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/maharashtra-road-rage-drunk-car-driver-rams-into-bike-killing-woman-daughter-2611593-2024-10-05",
      "headline": "Maharashtra road rage: Drunk driver runs over family on bike after spat, 2 deadFive people were arrested for intentionally hitting a family of four on a bike with their car in Maharashtra's Latur on Saturday. A woman and her six-year-old daughter were killed on the spot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-dj-alan-walker-concert-bengaluru-2611624-2024-10-05",
      "headline": "Alia Bhatt makes special appearance at DJ Alan Walker's concert in BengaluruAlia Bhatt attended DJ Alan Walker's concert in Bengaluru on October 4. She promoted her upcoming film Jigra. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/parents-note-instagram-wants-no-blame-for-anything-wrong-with-your-teens-account-2611159-2024-10-05",
      "headline": "Parents, note: Instagram wants no blame for your teen's accountMeta has just rolled out a new teen account, claiming they're 'reimagining their apps for teens'. But experts? Well, they're not entirely sold on this latest feature just yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rg-kar-hospital-junior-doctors-strike-protest-hunger-strike-sit-in-demonstration-2611635-2024-10-05",
      "headline": "RG Kar hospital junior doctors end strike, plan for hunger protestJunior doctors at RG Kar hospital in Kolkata have decided to end the strike while they have planned to continue their protest through sit-in demonstrations and hunger strike."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/andhra-pradesh-chief-minister-chandrababu-naidu-silk-robes-tirumala-temple-2611604-2024-10-05",
      "headline": "Chandrababu Naidu offers silk robes at Tirumala temple amid laddu rowAndhra Pradesh Chief Minister Chandrababu Naidu visited the Lord Venkateswara Temple in Tirumala on Friday, marking the first day of the annual Brahmotsavams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/diljit-dosanjh-hania-aamir-badshah-on-stage-during-london-concert-2611732-2024-10-05",
      "headline": "Pakistani actor Hania Aamir, Badshah join Diljit Dosanjh on stage in LondonPakistani actor Hania Aamir and Indian rapper Badshah were both in attendance at Diljit Dosanjh's concert in London on October 4. In a widely shared video, Diljit can be seen performing on stage alongside both Hania and Badshah at various points during the concert. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/celebrity/story/tv-actor-asha-negi-shares-her-casting-couch-experience-he-tried-to-brainwash-me-2611711-2024-10-05",
      "headline": "TV actor Asha Negi shares her casting couch experience: He tried to brainwash meTelevision actor Asha Negi shared a disturbing casting couch encounter from her early career days. She reflected on the manipulative tactics used by a coordinator and her resolve not to compromise."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajendra-prasad-daughter-gayatri-dies-heart-attack-nanijr-ntr-pay-tribute-2611685-2024-10-05",
      "headline": "Telugu actor Rajendra Prasad's daughter dies at 38. Nani, Jr NTR pay tributeVeteran Telugu actor Rajendra Prasad's daughter died of cardiac arrest on October 5. Actors Nani, Jr NTR and others paid heartfelt tributes on social media. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jr-ntr-on-devara-2-will-take-some-time-to-etch-part-two-into-something-bigger-2611687-2024-10-05",
      "headline": "Jr NTR on Devara 2: Will take some time to etch part two into something biggerTelugu star Jr NTR shared insights into the making of Devara's sequel, emphasising a thoughtful approach to surpass the first film's success. He said that the sequel will be 'something bigger, better'."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-united-jim-ratcliffe-erik-ten-hag-sacking-talks-snub-2611736-2024-10-05",
      "headline": "Manchester United's Jim Ratcliffe snubs Ten Hag axing talks: Not my callManchester United co-owner Jim Ratcliffe dodged questions about Erik ten Hag's future amid the club's ongoing struggles, fueling speculation about the Dutch manager's job security following United's poor start to the season across all competitions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-tour-of-sri-lanka-squad-pooran-russell-hetmyer-absence-2611733-2024-10-05",
      "headline": "West Indies tour of Sri Lanka: Pooran, Russell and Hetmyer opt out of T20I seriesWest Indies tour of Australia: West Indies will be without some of their senior players, including Andre Russell and Shimron Hetmyer. The tourists will play three T20Is and as many ODIs in the island nation from October 13 to 26. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-t20i-gwalior-head-to-head-preview-live-streaming-all-you-need-to-know-2611716-2024-10-05",
      "headline": "IND vs BAN, 1st T20I Live streaming: All you need to knowIndia's youthful T20I squad, led by Suryakumar Yadav, prepares to maintain their winning momentum against Bangladesh in a three-match series starting October 6, with fresh talents and experienced players aiming for continued dominance in Gwalior."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/nations-league-italian-legend-paolo-maldinis-son-daniel-earns-maiden-call-up-2611709-2024-10-05",
      "headline": "Italian legend Paolo Maldini's son Daniel earns maiden call upItaly coach Luciano Spalletti has named AC Milan defender Matteo Gabbia and Monza forward Daniel Maldini in a 23-man squad for their upcoming Nations League fixtures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/shanghai-masters-carlos-alcaraz-winning-start-juncheng-shang-gesture-2611704-2024-10-05",
      "headline": "Shanghai Masters: Alcaraz off to winning start, touched by opponent's gestureAt the Shanghai Masters 2024, World No. 3 Carlos Alcaraz secured a commanding victory against local favorite Juncheng Shang, winning 6-2, 6-2 on Saturday. After the match, Alcaraz said he was moved by Shang's admiration for him.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-sri-lanka-live-streaming-when-and-where-to-watch-womens-t20-world-cup-match-2611705-2024-10-05",
      "headline": "AUS vs SL live streaming: When and where to watch Women's T20 World Cup matchAustralia vs Sri Lanka: The Australian women's team will begin their campaign on Saturday, October 5. Here's everything you need to know about when and where the defending champions begin their campaign."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-new-zealand-ameilia-kerr-run-out-dead-ball-rule-sophie-devine-2611682-2024-10-05",
      "headline": "New Zealand captain Sophie Devine reacts to controversial run-out call New Zealand captain Sophie Devine, who inspired them to a big win over India in their Women's T20 World Cup opener, feels the run-out controversy surrounding Amelia Kerr may have \"stalled\" India's game flow, but she stressed the importance of respecting umpires' judgement. India found themselves amid an umpiring controversy against the Kiwis here on Friday, a match they lost by 58 runs.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rinku-singh-tattoo-gods-plan-details-yash-dayal-sixes-india-vs-bangladesh-2611679-2024-10-05",
      "headline": "Watch: India star Rinku Singh reveals stunning details of his 'God's Plan' tattoo India vs Bangladesh: Speaking ahead of the three-match T20I series, star batter Rinku Singh revealed stunning details of his new tattoo. Rinku explained how his new tattoo symbolises the iconic five sixes he hit against Yash Dayal in an IPL 2023 match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-run-out-t20-world-cup-2611680-2024-10-05",
      "headline": "Run-out incident probably broke India's momentum: Sophie DevineNew Zealand captain Sophie Devine felt that India lost their momentum after the run-out incident involving Amelia Kerr. In the 14th over, the umpires ruled it a dead ball after Kerr was run-out trying to sneak in a second run.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-tough-loss-fielding-coaching-award-dressing-room-2611657-2024-10-05",
      "headline": "India will bounce back: Fielding coach Munish Bali lifts spirits after tough lossIndia vs New Zealand, Women's T20 World Cup: Fielding coach Munish Bali tried to lift the morale in the Indian dressing room after the Asian giants lost their opening match by 58 runs. Jemimah Rodrigues won the best fielder medal on Friday, October 4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-border-gavaskar-trophy-rishabh-pant-sledging-2611652-2024-10-05",
      "headline": "Rishabh Pant: Australia players unanimously name 'best sledger' from Indian teamAhead of the Border Gavaskar Trophy Australia stars revealed that Rishabh Pant was the biggest sledger from the Indian team. In a hilarious video, Travis Head, Marnus Labuschange and Usman Khawaja called Pant a very funny man.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-new-zealand-ameilia-kerr-run-out-dead-ball-rule-sophie-devine-2611682-2024-10-05",
      "headline": "New Zealand captain Sophie Devine reacts to controversial run-out call New Zealand captain Sophie Devine, who inspired them to a big win over India in their Women's T20 World Cup opener, feels the run-out controversy surrounding Amelia Kerr may have \"stalled\" India's game flow, but she stressed the importance of respecting umpires' judgement. India found themselves amid an umpiring controversy against the Kiwis here on Friday, a match they lost by 58 runs.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rinku-singh-tattoo-gods-plan-details-yash-dayal-sixes-india-vs-bangladesh-2611679-2024-10-05",
      "headline": "Watch: India star Rinku Singh reveals stunning details of his 'God's Plan' tattoo India vs Bangladesh: Speaking ahead of the three-match T20I series, star batter Rinku Singh revealed stunning details of his new tattoo. Rinku explained how his new tattoo symbolises the iconic five sixes he hit against Yash Dayal in an IPL 2023 match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-run-out-t20-world-cup-2611680-2024-10-05",
      "headline": "Run-out incident probably broke India's momentum: Sophie DevineNew Zealand captain Sophie Devine felt that India lost their momentum after the run-out incident involving Amelia Kerr. In the 14th over, the umpires ruled it a dead ball after Kerr was run-out trying to sneak in a second run.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-tough-loss-fielding-coaching-award-dressing-room-2611657-2024-10-05",
      "headline": "India will bounce back: Fielding coach Munish Bali lifts spirits after tough lossIndia vs New Zealand, Women's T20 World Cup: Fielding coach Munish Bali tried to lift the morale in the Indian dressing room after the Asian giants lost their opening match by 58 runs. Jemimah Rodrigues won the best fielder medal on Friday, October 4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-border-gavaskar-trophy-rishabh-pant-sledging-2611652-2024-10-05",
      "headline": "Rishabh Pant: Australia players unanimously name 'best sledger' from Indian teamAhead of the Border Gavaskar Trophy Australia stars revealed that Rishabh Pant was the biggest sledger from the Indian team. In a hilarious video, Travis Head, Marnus Labuschange and Usman Khawaja called Pant a very funny man.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/hockey-india-league-pr-sreejesh-exclusive-delhi-sg-pipers-mentor-director-2611637-2024-10-05",
      "headline": "A New Goal: PR Sreejesh times his transition from player to mentor perfectly Hockey India League: Speaking to IndiaToday.in, legendary hockey player PR Sreejesh opened up about resisting the urge to play again and transitioning into the role of a mentor for the new HIL franchise, Delhi SG Pipers. Sreejesh is confident that the HIL, returning after seven years, will do wonders for Indian hockey. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-failed-to-make-the-most-of-their-opportunities-vs-nz-jemimah-rodrigues-2611628-2024-10-05",
      "headline": "India failed to make the most of their opportunities vs NZ: Jemimah RodriguesIndia were beaten in their T20 World Cup opener by New Zealand. India batter Jemimah Rodrigues rued making the most of their opportunities in the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/hockey-india-league-new-edition-pr-sreejesh-hil-2611626-2024-10-05",
      "headline": "Hockey India League 2.0: A glorious return with a historic first for womenThe Hockey India League is making a return after 7 long years. Hockey India seem to be cautious with their approach and have decided not to repeat the mistakes of their past and also rolled out the new Women's Hockey India League. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-t20-world-cup-india-vs-new-zealand-highlights-jemimah-rodrigues-2611621-2024-10-05",
      "headline": "India would like to forget T20 World Cup match vs New Zealand: JemimahIndia batter Rodrigues said that the team would like to forget their T20 World Cup opener against New Zealand. A jittery India failed to chase down 161 in their first match, and ended up losing by 58 runs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/video/small-steps-lead-to-big-goals-manu-bhaker-after-voting-for-first-time-2611618-2024-10-05",
      "headline": "Small steps lead to big goals: Manu Bhaker after voting for first timeParis Olympics double medallist Manu Bhaker cast her vote for the first time in the ongoing Haryana elections."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-ireland-2nd-odi-temba-bavuma-2611614-2024-10-05",
      "headline": "Temba Bavuma proud of team's mature performance after 174-run win vs IrelandSouth Africa captain Temba Bavuma was proud of his team's clinical and mature performance in the 2nd ODI match vs Ireland. South Africa beat Ireland by 174 runs, courtesy of Tristan Stubbs incredible hundred.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/haryana-assembly-elections-manu-bhaker-2611612-2024-10-05",
      "headline": "Manu Bhaker votes for first time, sends powerful message to youthParis Olympics double medallist Manu Bhaker cast her vote for the first time in the ongoing Haryana elections. Bhaker sent a powerful message to the youth urging them to vote for the future of the country.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hasrat-gill-virat-kohli-ellyse-perry-exclusive-interview-2611447-2024-10-05",
      "headline": "Idolising Virat Kohli, Ellyse Perry, Hasrat Gill fulfils father's dreamsHasrat Gill, at the age of 18, has taken rapid strides in her career. Born in Amritsar, Punjab, Hasrat will play for the Melbourne Stars in the Women's BBL, alongside Deepti Sharma, Yastika Bhatia. In an interview with IndiaToday.in, Hasrat spoke about her journey and fandom for Virat Kohli, Ellyse Perry, Meg Lanning and others.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/video/small-steps-lead-to-big-goals-manu-bhaker-after-voting-for-first-time-2611618-2024-10-05",
      "headline": "Small steps lead to big goals: Manu Bhaker after voting for first timeParis Olympics double medallist Manu Bhaker cast her vote for the first time in the ongoing Haryana elections."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-ireland-2nd-odi-temba-bavuma-2611614-2024-10-05",
      "headline": "Temba Bavuma proud of team's mature performance after 174-run win vs IrelandSouth Africa captain Temba Bavuma was proud of his team's clinical and mature performance in the 2nd ODI match vs Ireland. South Africa beat Ireland by 174 runs, courtesy of Tristan Stubbs incredible hundred.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/haryana-assembly-elections-manu-bhaker-2611612-2024-10-05",
      "headline": "Manu Bhaker votes for first time, sends powerful message to youthParis Olympics double medallist Manu Bhaker cast her vote for the first time in the ongoing Haryana elections. Bhaker sent a powerful message to the youth urging them to vote for the future of the country.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hasrat-gill-virat-kohli-ellyse-perry-exclusive-interview-2611447-2024-10-05",
      "headline": "Idolising Virat Kohli, Ellyse Perry, Hasrat Gill fulfils father's dreamsHasrat Gill, at the age of 18, has taken rapid strides in her career. Born in Amritsar, Punjab, Hasrat will play for the Melbourne Stars in the Women's BBL, alongside Deepti Sharma, Yastika Bhatia. In an interview with IndiaToday.in, Hasrat spoke about her journey and fandom for Virat Kohli, Ellyse Perry, Meg Lanning and others.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-jemimah-rodrigues-on-controversial-run-out-call-2611583-2024-10-05",
      "headline": "India respect umpire's decision but it was harsh: Jemimah on controversial callT20 World Cup: India's star batter Jemimah Rodrigues addressed the controversial run-out decision during the team's opening match against New Zealand in the Women's T20 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sophie-devine-india-vs-new-zealand-womens-t20-world-cup-2024-2611580-2024-10-04",
      "headline": "Sophie Devine 'extremely proud' of her team comprehensive win over IndiaNew Zealand captain Sophie Devine revealed that she was extremely proud of her team following a clinical win over India in the opening game of the Women's T20 World Cup 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/heather-knight-happy-with-polished-england-before-bangladesh-clash-2611502-2024-10-04",
      "headline": "Heather Knight happy with 'polished' England before Bangladesh clashWomen's T20 World Cup 2024: Heather Knight said that she is happy with the progress England have made since crashing out of the mega event back in 2023. Knight and Co. will start their campaign on Saturday against Bangladesh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-beat-india-harmanpreet-kaur-reaction-opening-loss-2611577-2024-10-04",
      "headline": "Harmanpreet dejected after India's heavy loss to New ZealandWomen's T20 World Cup: Captain Harmanpreet Kaur was dejected after India's campaign in the ICC tournament started with a heavy 58-run loss against New Zealand in Dubai on Saturday."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}