{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-q2-gdp-growth-slows-lowest-in-six-quarters-2642308-2024-11-29",
      "headline": "India's Q2 GDP slows to 5.4%, hits 18-month low on weak consumptionThe weaker-than-expected GDP growth raises concerns about the sustainability of economic recovery, particularly as key sectors like manufacturing and mining face challenges. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rally-sensex-nifty-closing-bell-q2-gdp-data-in-focus-2642284-2024-11-29",
      "headline": "Sensex, Nifty end higher as heavyweight stocks gain; Q2 GDP data in focusThe S&P BSE Sensex was up 759.05 points to 79,802.79 at the closing bell, while the NSE Nifty50 rose 216.95 points to 24,131.10. Both the indices had declined roughly 1.5% yesterday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pan-2-project-faqs-who-can-apply-qr-code-security-other-key-details-2642232-2024-11-29",
      "headline": "PAN 2.0 FAQs: Who can apply, QR code feature, and other key detailsPAN 2.0 is a government initiative combining PAN and TAN systems with a QR code for secure and quick identity verification, simplifying taxpayer registration and promoting a tech-driven tax ecosystem."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rebound-today-sensex-700-points-nifty-gains-key-factors-bull-run-dalal-street-2642204-2024-11-29",
      "headline": "Sensex surges 800 points: Key factors behind bull run on Dalal StreetStock market today: Sensex and Nifty regained their footing, driven by improved investor sentiment and stock-specific action. Read on to find out the key reasons behind today's rebound on Dalal Street."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/enviro-infra-ipo-stock-market-listing-should-you-hold-for-long-term-or-book-profit-now-2642133-2024-11-29",
      "headline": "Enviro Infra makes solid market debut: Should you hold or book profit?Enviro Infra IPO listing: Shares of Enviro Infra Engineers have dipped slightly following their strong listing, prompting investors to weigh whether to hold onto their shares or book profits."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-group-stocks-gain-sharply-stock-market-key-factors-why-2642119-2024-11-29",
      "headline": "Adani Green, Adani Energy Solutions: Why these Adani Group stocks are gainingAdani Green Energy led the surge, rising 14.64% to hit Rs 1,247.55. Adani Energy Solutions followed, reaching a day's high of Rs 825.85. Most other Adani Group stocks also registered gains in early trade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/enviro-infra-engineers-stock-market-listing-49-percent-premium-ipo-price-2642108-2024-11-29",
      "headline": "Enviro Infra shares make strong debut, list at 49% premium over IPO priceEnviro Infra Engineers listing: The shares opened at Rs 220 on the NSE, marking a 48.64% jump from the IPO price of Rs 148. On the BSE, the stock listed at Rs 218, reflecting a 47.29% premium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-sensex-jumps-700-points-nifty-rises-adani-stocks-gain-2642097-2024-11-29",
      "headline": "Sensex rallies 700 points, Nifty above 24,000; Adani stocks surgeThe S&P BSE Sensex surged 663 points to reach 79,702.09 by 10:33 am, while the NSE Nifty50 climbed 154.60 points to trade at 24,084.95."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-drops-1200-points-nifty-falls-it-stocks-us-inflation-data-interest-rate-cut-2641678-2024-11-28",
      "headline": "Sensex crashes 1,200 points, Nifty falls below 24,000; IT stocks tumbleAt the closing bell, the S&P BSE Sensex ended 1190.34 points lower at 79,043.74, while the NSE Nifty50 fell 360.75 to settle below 24,000."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/renewable-energy-stocks-could-make-you-greener-ntpc-suzlon-jsw-adani-5-reasons-why-market-tips-2641640-2024-11-28",
      "headline": "Renewable energy stocks could make your portfolio green. 5 reasons whyWith the global shift towards clean energy, renewable energy stocks have proven to be rewarding for many, delivering strong returns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/infosys-ltim-hcltech-tcs-information-technology-stocks-sensex-nifty-2641611-2024-11-28",
      "headline": "Infosys, LTIM, HCLTech, TCS: Why IT stocks are tumbling todayInfosys led the decline with a 3% drop, while Tech Mahindra and LTIMindtree were down by 2.5%. HCLTech, MPhasis, and TCS also recorded losses exceeding 2%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/grain-to-glass-how-this-firm-pernod-ricard-india-distillery-blending-sustainability-india-alcohol-industry-2641594-2024-11-28",
      "headline": "How this firm is blending sustainability in India's alcohol industryThe company's innovative approach, dubbed 'Grain to Glass', is transforming how businesses can contribute to environmental and social development."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ntpc-green-energy-share-price-jump-today-shajapur-solar-project-exchange-filing-2641576-2024-11-28",
      "headline": "Explained: Why newly-listed NTPC Green Energy shares gained 5% todayNTPC Green Energy share price: The latest surge follows NTPC Green Energy's announcement regarding the commercial operation of the first phase of its Shajapur Solar Project in Madhya Pradesh."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/suraksha-diagnostic-ipo-opens-tomorrow-details-check-price-band-issue-size-latest-gmp-2641573-2024-11-28",
      "headline": "Suraksha Diagnostic IPO opens tomorrow: Check price band, issue size, GMPSuraksha Diagnostic IPO: The IPO will open for bidding on Friday and is expected to list on the stock exchanges on December 6, 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-share-price-rally-rise-above-rs-90-citi-target-is-it-time-to-buy-2641559-2024-11-28",
      "headline": "Ola Electric shares continue positive rally, rise above Rs 90. Time to buy?Ola Electric share price: With this, the stock has gained over 35% in the last five sessions and has surpassed the Rs 90 target set by Citi on November 26."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/sensex-falls-nearly-800-points-nifty-declines-4-factors-behind-stock-market-weakness-today-2641503-2024-11-28",
      "headline": "Bloodbath on Dalal Street: 4 reasons why Sensex plunged 1,200 points todayAt the closing bell, the S&P BSE Sensex was down 1190.34 points at 79,043.74, while the NSE Nifty50 fell 360.75 points to 23,914.15."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/lic-share-price-today-report-buying-half-of-manipalcigna-health-insurance-2641479-2024-11-28",
      "headline": "Explained: Why LIC share price gained nearly 4% in early trade  LIC Stock Price: LIC share price gained nearly 4% in early trade despite a sharp drop in the benchmark stock market indices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/spicejet-share-price-rises-after-aircastle-drops-insolvency-case-2641478-2024-11-28",
      "headline": "SpiceJet share price rises after Aircastle drops insolvency caseIn September, SpiceJet announced the resolution of a $23.39 million dispute with Aircastle (Ireland) Designated Activity Company and Wilmington Trust SP Services (Dublin) Limited."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-total-gas-share-price-jumps-early-trade-broad-based-recovery-key-factors-behind-rally-2641472-2024-11-28",
      "headline": "Adani Total Gas share price jumps 16% in early trade. What's driving the rally?Adani Total Gas share price: The stock touched an intraday high of Rs 823.30 before settling at Rs 787, up 13.36% at 10:51 am."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-group-stocks-energy-solutions-enterprise-green-energy-shares-gain-up-to-10-percent-2641448-2024-11-28",
      "headline": "Adani group stocks extend winning streak, rally up to 12% todayAdani Group stocks such as Adani Green Energy Ltd, Adani Power Ltd, Adani Energy Solutions Ltd, and Adani Enterprises Ltd gained as much as 12% after the recent clarification on the US bribery charges."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-q2-gdp-growth-slows-lowest-in-six-quarters-2642308-2024-11-29",
      "headline": "India's Q2 GDP slows to 5.4%, hits 18-month low on weak consumptionThe weaker-than-expected GDP growth raises concerns about the sustainability of economic recovery, particularly as key sectors like manufacturing and mining face challenges. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-champions-trophy-icc-meeting-continue-november-30-pakistan-hybrid-model-2642346-2024-11-29",
      "headline": "No consensus at ICC meeting, Pakistan firm on Champions Trophy stance: SourcesChampions Trophy: No consensus was reached between the parties in a brief meeting of the ICC Board on Friday. Pakistan remained firm on its stance to not host the tournament in a hybrid model. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maharashtra-chief-minister-suspense-government-formation-eknath-shinde-leaves-mahayuti-meeting-ncp-shiv-sena-bjp-2642217-2024-11-29",
      "headline": "Twist in Maharashtra story as Eknath Shinde decamps, Mahayuti meet called offA meeting of Mahayuti leaders to finalise Maharashtra's government formation was called off on Friday after caretaker Chief Minister Eknath Shinde unexpectedly left for his village in Satara district."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-temples-attacked-chittagong-hindus-flee-locality-2642353-2024-11-29",
      "headline": "Hindus flee Bangladesh locality after temples attacked, cops turn blind eyeThe incident happened while a march was being held in Chittagong demanding a ban on Iskcon. Several shops were also targeted after Friday prayers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/food/story/sorry-instagram-your-viral-golden-milk-latte-is-just-indias-og-haldi-doodh-2642200-2024-11-29",
      "headline": "Sorry, Instagram. Your viral golden milk latte is just India's OG haldi doodhSocial media is buzzing about the golden milk latte and its many health benefits, but all its star ingredients have been staples in your kitchen all along."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-arrest-warrant-gautam-adani-group-us-indictment-bribery-row-2642312-2024-11-29",
      "headline": "Received no request from US: India on 'arrest warrant' for Gautam AdaniThe Ministry of External Affairs (MEA), in an official statement, said that the government has no role in the legal proceedings involving Adani-linked entities in the United States. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/kerala-native-arrested-for-murder-of-assam-vlogger-maya-gogoi-in-bengaluru-2642323-2024-11-29",
      "headline": "Man accused of stabbing Assam vlogger to death in Bengaluru arrestedBengaluru Police arrest Kerala native Aarav Hanoy, accused of killing Assam vlogger Maya Gogoi. Her body was found in an Indira Nagar apartment with fatal injuries, following signs of premeditated murder.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/what-trais-new-traceability-guidelines-mean-for-otps-starting-december-1-2642096-2024-11-29",
      "headline": "Delay in OTPs after December 1 due to new traceability rules? TRAI respondsStarting December 1, 2024, the Telecom Regulatory Authority of India (TRAI) will implement its new traceability guidelines to strengthen consumer protection against spam and fraudulent messages. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/waqf-board-amendment-bill-system-india-history-muhammad-ghori-gift-2-villages-flourish-sultanate-mughal-2642178-2024-11-29",
      "headline": "Waqf land in India grew from 2 villages gifted by invader Ghori to 9.4 lakh acreWaqf Boards, collectively, are among the top land-owners in India. The first recorded instance of Waqf in India was the gift of two villages in Multan by invader Muhammad Ghori. It was, in fact, Ghori's victory in the Battle of Tarain that established sultans on the throne of Delhi, who institutionalised and oversaw the growth of Waqf."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bangladesh-hindus-minorities-violence-iskcon-monk-mea-briefing-2642302-2024-11-29",
      "headline": "Not media exaggeration: India on surge in attacks against Bangladeshi HindusMEA spokesperson Randhir Jaiswal called upon the Muhammad Yunus-led interim government in Bangladesh to live up to its responsibility of protecting all minorities."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/boy-kidnapped-31-years-ago-taken-to-rajasthan-jaisalmer-reunites-family-ghaziabad-2642314-2024-11-29",
      "headline": "Kidnapped as a child 31 years ago, man reunites with family in GhaziabadA man was reunited with his family after being separated from them for 31 years, thanks to a missing complaint lodged by the police. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/the-dei-debate-as-us-corporate-walmart-ford-harley-davidson-toyota-roll-it-back-a-reality-check-in-india-2641779-2024-11-29",
      "headline": "What is DEI, why many US corporate giants dropped it and what it means in IndiaMany companies that previously pledged allegiance to DEI are now quietly rolling back their commitments. So, what is the reason behind it and do Indian professionals in the US need to worry?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-ruth-prabhu-father-dies-actor-shares-emotional-post-2642322-2024-11-29",
      "headline": "Samantha's father dies, actor shares emotional postActor Samantha's father died on November 29. The actor shared an emotional post on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/apple-airpods-hearing-aid-heartstrings-ad-social-media-reactions-anti-woke-pro-family-trump-viral-video-2642049-2024-11-29",
      "headline": "Apple's AirPods Pro 2 ad goes viral, X users say 'no more woke, family is back'Titled 'Heartstrings', the ad depicts a man who struggles with hearing loss and the impact it has on his family life. The campaign has garnered positive reactions on social media, with some interpreting it as a response to broader cultural and political shifts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maharashtra-congress-stand-evm-rahul-gandhi-kharge-skepticism-counter-by-p-chidambaram-karthi-2642233-2024-11-29",
      "headline": "As Congress cries EVM fraud, Congress leaders counter itAlleging EVM manipulation in the Maharashtra Assembly election, Congress President Mallikarjun Kharge proposed switching back to paper ballots. However, the Congress line of EVM fraud is being countered by party leaders themselves, and an internal survey that revealed in October how the Congress-led MVA was in for a rout."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/major-rule-changes-from-december-1-2024-key-impacts-on-households-and-finances-2642103-2024-11-29",
      "headline": "Major rule changes from December 1: Key impacts on households and financesNew rules, new costs: What do December 1 changes mean for your wallet?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/elon-musk-donald-trump-thanksgiving-dinner-at-mar-a-lago-barron-melania-trump-x-video-2642299-2024-11-29",
      "headline": "Watch: Elon Musk, Trump enjoy Thanksgiving dinner at Mar-a-Lago, groove to 'YMCA'During a jam-packed evening, both Musk and Trump could be spotted having a blast dancing to the tune of 'YMCA,' while netizens are busy highlighting Barron and Melania's expressions, indicating their energy wearing off compared to the other two at the table. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pushpa-2-mumbai-event-allu-arjun-rashmika-mandanna-sukumar-fahadh-faasil-2642167-2024-11-29",
      "headline": "Allu Arjun thanks fans for making Pushpa a phenomenonPushpa 2 Mumbai event live updates: The makers of Allu Arjun-led film gear up for release with a nationwide promotional tour. The film, also starring Rashmika Mandanna and Fahadh Faasil, releases on December 5. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/prithvi-shaw-could-not-handle-money-his-example-should-be-studied-pravin-amre-2642360-2024-11-29",
      "headline": "Prithvi Shaw could not handle money, his example should be studied: AmrePrithvi Shaw was not able to handle the fame and money that comes with the Indian Premier League, said former Delhi Capitals assistant coach Praveen Amre. Shaw was unsold in the 2025 edition of the IPL auction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/champions-trophy-india-pakistan-tejashwi-yadav-pm-modi-biryani-2642210-2024-11-29",
      "headline": "Tejashwi Yadav says cricket team should go to Pak: If PM can have biryani...Tejashwi Yadav, a former cricketer himself, asked if PM Modi could visit Pakistan, then why can't the team go across the border for the Champions Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/bikes/story/a-japanese-major-has-entered-indias-ev-space-it-is-not-suzuki-toyota-or-nissan-2642331-2024-11-29",
      "headline": "A Japanese major has finally entered India's EV spaceThis two-wheeler manufacturer recently introduced two new electric scooters in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/jasprit-bumrah-aus-vs-ind-damien-fleming-decodes-genius-bowling-action-2642265-2024-11-29",
      "headline": "Jasprit Bumrah is the Terminator: Ex-Aussie pacer decodes India star's geniusFormer Australia pacer Damien Fleming said Jasprit Bumrah's incredible range and his ability to execute a variety of deliveries set him apart from the rest. In a brilliant analysis, Fleming explained the various aspects of Bumrah's delivery routine. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bangladesh-hindus-temples-attacked-mohandas-pai-indian-american-vinod-khosla-2642084-2024-11-29",
      "headline": "Genocide of Hindus by your friend: Mohandas Pai jabs businessman for backing YunusMohandas Pai's remark was to an August 7 post by Vinod Khosla in which the businessman expressed enthusiasm on Muhammad Yunus being chosen to lead the interim government in Bangladesh."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/maharashtra-shivshahi-bus-accident-gondia-deaths-injured-bike-2642256-2024-11-29",
      "headline": "9 killed as bus trying to avoid hitting bike overturns in MaharashtraNine people were killed, and several others were seriously injured when a Maharashtra State Road Transport Corporation bus overturned while trying to avoid a collision with a bike in Gondia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/bigg-boss-18-day-52-avinash-mishra-loses-calm-over-eisha-singh-over-ration-task-2642362-2024-11-29",
      "headline": "BB 18 Day 52: Avinash Mishra loses calm with Eisha Singh over ration task  Alice Kaushik reacts to viral cuddling pic with Avinash: Sad how people make...In a dramatic twist on Bigg Boss 18, newly appointed Time God, Eisha Singh, clashed verbally with Avinash Mishra. After Shilpa Shirodkar gave the title to Singh, a heated argument ensued between the two over the ration task."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kalki-koechlin-on-life-after-divorce-with-anurag-kashyap-nobody-would-rent-me-a-house-2642333-2024-11-29",
      "headline": "Kalki Koechlin on life after divorce: Nobody would rent me a houseKalki Koechlin opened up about the challenges she faced after her divorce from Anurag Kashyap, particularly finding housing. The actor also said how she has maintained a cordial relationship with her ex-husband."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dibakar-banerjee-on-netflix-shelving-tees-i-went-through-depression-2642339-2024-11-29",
      "headline": "Director  Dibakar Banerjee on Netflix shelving Tees: Went through anger, depressionFilmmaker Dibakar Banerjee's Tees, shelved by Netflix after years of delays, premiered at a film festival recently. The streamer's decision took a toll on Banerjee's emotional health. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-ruth-prabhu-father-dies-actor-shares-emotional-post-2642322-2024-11-29",
      "headline": "Samantha's father dies, actor shares emotional postActor Samantha's father died on November 29. The actor shared an emotional post on social media. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/faf-du-plessis-fall-abu-dhabi-t10-league-watch-viral-video-saves-ball-ball-suplex-2642363-2024-11-29",
      "headline": "Watch: Du Plessis takes big fall in Abu Dhabi T10 league, saves ball boyFaf du Plessis narrowly avoided injury in the Abu Dhabi T10 League after vaulting over boundary boards to dodge a ball boy during a tense moment in Morrisville Samp Army's clash against Delhi Bulls, showcasing his quick thinking and professionalism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-syed-mushtaq-ali-trophy-delhi-manipur-11-bowlers-t20-match-2642364-2024-11-29",
      "headline": "Delhi become first team in T20 history to use 11 bowlers Syed Mushtaq Ali Trophy: Delhi made T20 history on Friday after using all their 11 bowling options in their clash against Manipur at the iconic Wankhede Stadium in Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/prithvi-shaw-could-not-handle-money-his-example-should-be-studied-pravin-amre-2642360-2024-11-29",
      "headline": "Prithvi Shaw could not handle money, his example should be studied: AmrePrithvi Shaw was not able to handle the fame and money that comes with the Indian Premier League, said former Delhi Capitals assistant coach Praveen Amre. Shaw was unsold in the 2025 edition of the IPL auction."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/syed-mustaq-ali-trophy-shardul-thakur-most-expensive-over-ipl-auction-snub-unsold-2642350-2024-11-29",
      "headline": "After IPL snub, Shardul registers most expensive over in SMAT historyShardul Thakur endured a torrid time against Kerala in the Syed Mushtaq Ali Trophy, conceding 69 runs in four overs, just days after going unsold in the IPL mega auction, raising concerns about his form and future prospects."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-champions-trophy-icc-meeting-continue-november-30-pakistan-hybrid-model-2642346-2024-11-29",
      "headline": "No consensus at ICC meeting, Pakistan firm on Champions Trophy stance: SourcesChampions Trophy: No consensus was reached between the parties in a brief meeting of the ICC Board on Friday. Pakistan remained firm on its stance to not host the tournament in a hybrid model. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/badminton-syed-modi-international-pv-sindhu-pv-sindhu-2642342-2024-11-29",
      "headline": "Sindhu, Lakshya storm into Syed Modi International semi-finals Syed Modi International: PV Sindhu and Lakshya Sen stormed into the semi-finals of the Super 300 badminton tournament after beating Dai Wang and Meiraba Luwang Maisnam in the quarters. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-shubman-gill-thumb-injury-2642307-2024-11-29",
      "headline": "Shubman Gill 'happy' with injury recovery, geared for Adelaide TestAUS vs IND: After missing the series opener at the Perth Stadium, Shubman Gill returned to the nets on Friday and sounded positive about his injury recovery from the Adelaide Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-icc-champions-trophy-bard-meeting-live-udpates-bcci-pcb-hybrid-model-2642301-2024-11-29",
      "headline": "ICC Champions Trophy meeting Highlights: Pakistan stay firm on no hybrid modelICC Board meets to decide Champions Trophy fate Highlights: The International Cricket Council's Board has concluded for today. The meeting is expected to continue over the next few days. Reports suggest that Pakistan stay firm on its stance that the tournament will not take place in a hybrid model."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/wpl-2025-auction-to-be-held-in-bengaluru-on-december-15-2642279-2024-11-29",
      "headline": "WPL 2025 auction to be held in Bengaluru on December 15The BCCI is set to hold the Women's Premier League auction on December 15. The event is set to be held in Bengaluru. The teams have up to 19 slots to fill in the auction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/jasprit-bumrah-aus-vs-ind-damien-fleming-decodes-genius-bowling-action-2642265-2024-11-29",
      "headline": "Jasprit Bumrah is the Terminator: Ex-Aussie pacer decodes India star's geniusFormer Australia pacer Damien Fleming said Jasprit Bumrah's incredible range and his ability to execute a variety of deliveries set him apart from the rest. In a brilliant analysis, Fleming explained the various aspects of Bumrah's delivery routine. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-viswanathan-anands-popularity-in-singapore-leaves-kevin-goh-wei-ming-awe-2642252-2024-11-29",
      "headline": "Rock star Viswanathan Anand's popularity in Singapore leaves local great in aweChess legend Viswanathan Anand's presence at the closing ceremony of the National Age Group Championships left Singapore's chess community awe-struck, with fans and participants erupting in excitement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-shubman-gill-thumb-injury-2642307-2024-11-29",
      "headline": "Shubman Gill 'happy' with injury recovery, geared for Adelaide TestAUS vs IND: After missing the series opener at the Perth Stadium, Shubman Gill returned to the nets on Friday and sounded positive about his injury recovery from the Adelaide Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-icc-champions-trophy-bard-meeting-live-udpates-bcci-pcb-hybrid-model-2642301-2024-11-29",
      "headline": "ICC Champions Trophy meeting Highlights: Pakistan stay firm on no hybrid modelICC Board meets to decide Champions Trophy fate Highlights: The International Cricket Council's Board has concluded for today. The meeting is expected to continue over the next few days. Reports suggest that Pakistan stay firm on its stance that the tournament will not take place in a hybrid model."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/wpl-2025-auction-to-be-held-in-bengaluru-on-december-15-2642279-2024-11-29",
      "headline": "WPL 2025 auction to be held in Bengaluru on December 15The BCCI is set to hold the Women's Premier League auction on December 15. The event is set to be held in Bengaluru. The teams have up to 19 slots to fill in the auction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/jasprit-bumrah-aus-vs-ind-damien-fleming-decodes-genius-bowling-action-2642265-2024-11-29",
      "headline": "Jasprit Bumrah is the Terminator: Ex-Aussie pacer decodes India star's geniusFormer Australia pacer Damien Fleming said Jasprit Bumrah's incredible range and his ability to execute a variety of deliveries set him apart from the rest. In a brilliant analysis, Fleming explained the various aspects of Bumrah's delivery routine. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-viswanathan-anands-popularity-in-singapore-leaves-kevin-goh-wei-ming-awe-2642252-2024-11-29",
      "headline": "Rock star Viswanathan Anand's popularity in Singapore leaves local great in aweChess legend Viswanathan Anand's presence at the closing ceremony of the National Age Group Championships left Singapore's chess community awe-struck, with fans and participants erupting in excitement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ind-vs-aus-bgt-steve-smith-marnus-labuschagne-can-learn-from-virat-kohli-ponting-2642235-2024-11-29",
      "headline": "Smith, Labuschagne can learn from Virat Kohli: PontingAustralia batters Steve Smith and Marnus Labuschagne can learn from Virat Kohli, said Ricky Ponting ahead of the Pink Ball Test match in Adelaide. Ponting told ICC that the only way to do well in Test cricket is by trusting your game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/watch-glenn-phllips-jaw-dropping-superman-catch-in-1st-test-vs-england-2642229-2024-11-29",
      "headline": "Watch: Glenn Phllips' jaw-dropping 'Superman catch' in 1st Test vs EnglandNew Zealand all-rounder Glenn Phillips added to his repertoire of sensational catches on Friday, November 29. Standing at point, Phillips put out a Superman dive to dismiss Ollie Pope.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-champions-trophy-rajeev-shukla-bcci-players-safety-pakistan-2642219-2024-11-29",
      "headline": "Players safety our top priority, says BCCI vice-president Rajeev ShuklaBCCI vice-president Rajeev Shukla, speaking to reporters in New Delhi, said players' safety is of the utmost importance, reiterating the Indian government's stance to not permit the Indian team to travel to Pakistan for next year's Champions Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/the-best-fifa-football-awards-2024-full-list-of-candidates-nominees-2642221-2024-11-29",
      "headline": "No Ronaldo but Messi nominated for Men's Award, Rodri vs Vinicius continuesFIFA has announced the nominees for 'The Best' Football Awards 2024, celebrating the year's top players in women's and men's football at club and national levels. Ballon d'Or winner Rodri and Argentina great Lionel Messi are amongst the nominees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-shubman-gill-pink-ball-test-abhishek-nayar-canberra-2642191-2024-11-29",
      "headline": "Is Shubman Gill ready for pink-ball Test? Abhishek Nayar provides injury updateAustralia vs India: Assistant coach Abhishek Nayar, speaking to the press in Canberra, said India will assess Shubman Gill's readiness before taking a call on his availability for the warm-up match, starting on Saturday. Gill is recovering from a thumb fracture he suffered in Perth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ravichandran-ashwin-ravindra-jadeja-indian-playing-xi-abhishek-nayar-2642187-2024-11-29",
      "headline": "Did Perth Test snub hurt Ashwin and Jadeja? Abhishek Nayar explainsRavindra Jadeja and Ravichandran Ashwin did not feel hurt after getting snubbed from the Perth Test match, said Abhishek Nayar. Nayar said that both seniors were positive in their outlook and understood the decisions that the management had made."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-gautam-gambhir-to-join-india-squad-adelaide-test-assistant-coach-2642186-2024-11-29",
      "headline": "Gautam Gambhir will be back before Adelaide Test vs Australia: Assistant coachAssistant coach Abhishek Nayar said head coach Gautam Gambhir will rejoin the Indian squad in Adelaide before the second Test against Australia, scheduled to begin on December 6."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-shubman-gill-pink-ball-test-abhishek-nayar-canberra-2642191-2024-11-29",
      "headline": "Is Shubman Gill ready for pink-ball Test? Abhishek Nayar provides injury updateAustralia vs India: Assistant coach Abhishek Nayar, speaking to the press in Canberra, said India will assess Shubman Gill's readiness before taking a call on his availability for the warm-up match, starting on Saturday. Gill is recovering from a thumb fracture he suffered in Perth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ravichandran-ashwin-ravindra-jadeja-indian-playing-xi-abhishek-nayar-2642187-2024-11-29",
      "headline": "Did Perth Test snub hurt Ashwin and Jadeja? Abhishek Nayar explainsRavindra Jadeja and Ravichandran Ashwin did not feel hurt after getting snubbed from the Perth Test match, said Abhishek Nayar. Nayar said that both seniors were positive in their outlook and understood the decisions that the management had made."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-aus-vs-ind-gautam-gambhir-to-join-india-squad-adelaide-test-assistant-coach-2642186-2024-11-29",
      "headline": "Gautam Gambhir will be back before Adelaide Test vs Australia: Assistant coachAssistant coach Abhishek Nayar said head coach Gautam Gambhir will rejoin the Indian squad in Adelaide before the second Test against Australia, scheduled to begin on December 6."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/video/ind-vs-aus-abhishek-nayar-addresses-press-ahead-of-indias-pink-ball-warm-up-in-canberra-2642185-2024-11-29",
      "headline": "Abhishek Nayar addresses press ahead of India's pink-ball warm-up in CanberraIndia assistant coach Abhishek Nayar addressed the media in Canberra on Friday, 29 November. Abhishek Nayar spoke about Shubman Gill's fitness and Gautam Gambhir's availability ahead of the tour game vs Prime Minister's XI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-bgt-ricky-ponting-predicts-australia-playing-xi-adelaide-test-india-2642153-2024-11-29",
      "headline": "Australia batters need aggressive mindset to counter Indian bowling: PontingBorder-Gavaskar Trophy: Ricky Ponting has shared his ideal playing XI for Australia's second Test against India and offered insights on the strategy his former team should adapt to level the Border-Gavaskar Trophy series.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/triathlete-taylor-knibb-asks-cameraman-not-to-film-her-heres-why-2642120-2024-11-29",
      "headline": "Triathlete Taylor Knibb asks cameraman not to film her. Here's why.Taylor Knibb, the 26-year-old American triathlete asked the cameraman to not film at a certain angle. Knibb made the request after soiling her pants during her event in Dubai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-new-zealand-vs-england-1st-test-day-2-report-brook-hundred-root-duck-2642118-2024-11-29",
      "headline": "Brook hundred rallies England, New Zealand rue dreadful catching on Day 2Wellington Test: Harry Brook scored a stunning hundred to revive England in the first Test in Christchurch on Friday, guiding the visitors to 319 for 5 at stumps, just 29 runs shy of New Zealand's total of 348."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}