{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/government-probes-dark-pattern-after-man-exposes-extra-fees-on-cash-on-delivery-2797655-2025-10-04",
      "headline": "Government probes dark pattern after man exposes extra fees on cash-on-deliveryThe Department of Consumer Affairs has launched an investigation into e-commerce sites charging additional fees on cash-on-delivery payments. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/agent-body-protest-gst-reform-zero-insurance-distribution-input-tax-credit-prashant-mhatre-2797322-2025-10-03",
      "headline": "Agents' body questions GST cut, says move undermines insurance distributionPrashant Mhatre, All India President of the General Insurance Agents Federation Integrated (GIAFI), has sounded an alarm, saying the decision risks weakening the role of agents, brokers, and advisors who are central to India's insurance reach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/planning-a-personal-loan-do-not-make-these-5-errors-2795807-2025-10-03",
      "headline": "Planning a personal loan? Don't make these 5 errorsWhile personal loans can be a handy financial tool, they come with risks if mismanaged. Avoid these five common errors to keep your finances safe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/chennai-firm-wintrack-customs-official-bribery-corruption-charge-import-export-sector-cripple-2797228-2025-10-03",
      "headline": "Wintrack vs Chennai Customs is a sorry tale of grease of doing business in IndiaChennai-based logistics company Wintrack has ceased Indian operations, alleging repeated bribery demands and harassment by Chennai Customs, exposing the ugly truth that at Indian Customs integrity is the real contraband.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/delhi-government-may-revise-circle-rates-public-feedback-invited-2797279-2025-10-03",
      "headline": "Delhi government may revise circle rates, public feedback invitedThe Delhi government is considering a revision of circle rates across the city and has called on the public to share their views before any changes are finalised."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/health-insurance-trap-to-watch-2025-room-rent-caps-deductibles-co-pays-save-money-2797278-2025-10-03",
      "headline": "Health insurance in 2025: Key traps that could drain your pocketClauses such as room rent caps, deductibles, and co-pay options are often buried deep in policy documents but can have a massive influence on the claim process."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-end-higher-metal-stocks-gain-tata-steel-2797261-2025-10-03",
      "headline": "Sensex, Nifty recover losses to end higher fuelled by gains in metal stocksThe S&P BSE Sensex added 223.86 points to close at 81,207.17, while the NSE Nifty50 gained 57.95 points to end at 24,894.25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/63-of-households-aware-yet-only-95-invest-in-markets-sebi-survey-shows-2797218-2025-10-03",
      "headline": "63% of households aware, yet only 9.5% invest in markets, Sebi survey showsDespite growing awareness about investing in the markets, the latest Sebi survey shows that only a small fraction of households, i.e., just 9.5%, are actively investing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/looking-for-high-returns-this-small-savings-scheme-beats-ppf-and-nsc-2797178-2025-10-03",
      "headline": "Looking for high returns? This small savings scheme beats PPF and NSCMany investors assume PPF or NSC offer the best returns, but the scheme leads the pack with the highest interest among small savings schemes. Have a look."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/chennai-customs-wintrack-bribe-ask-legal-case-law-help-corruption-business-protection-expert-view-2797188-2025-10-03",
      "headline": "Wintrack vs Chennai Customs: If forced to bribe, can companies fight legally?The Finance Ministry has already ordered an official probe, but the matter has also raised a wider debate: if businesses are forced to pay bribes to get their consignments cleared, do they have the law on their side?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/will-zerodha-end-its-zero-brokerage-model-for-equity-delivery-trades-nithin-kamath-2797133-2025-10-03",
      "headline": "Will Zerodha end its zero-brokerage model for equity delivery trades?Zerodha, long known for offering free equity delivery trades, could soon charge for delivery trades for the first time, signalling a major shift for investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nirmala-sitharaman-opens-kautilya-economic-conclave-seeks-stronger-role-for-india-2797042-2025-10-03",
      "headline": "India can't be passive spectator: Nirmala Sitharaman talks tough amid US tariffsUnion Finance Minister Nirmala Sitharaman opened the Kautilya Economic Conclave 2025 in New Delhi, urging India to play a more active role in shaping global decisions amid growing economic and geopolitical uncertainty."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-turns-heartbreak-into-happily-ever-after-from-glitch-wish-list-2797658-2025-10-04",
      "headline": "Taylor Swift turns heartbreak into happily ever after from Glitch to Wi$h Li$t From 'Glitch' to 'Wi$h Li$t', Taylor Swift turns heartbreak into a fairytale in 'The Life of a Showgirl', marking her most romantic era yet.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sandhya-shantaram-dies-age-of-94-2797661-2025-10-04",
      "headline": "Veteran actor Sandhya Shantaram dies at 94 Veteran actor Sandhya Shantaram has passed away at the age of 94. She was known for her roles in films like 'Jhanak Jhanak Payal Baaje', 'Do Aankhen Barah Haath', 'Navrang', and the Marathi film 'Pinjara'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/karnataka-state-awards-rakshit-shetty-archana-jois-win-top-honours-2797619-2025-10-04",
      "headline": "Karnataka State Awards: Rakshit Shetty, Archana Jois win big The Karnataka State Awards were announced recently, honouring the best talent for their contribution to cinema. Take a look at the complete list of winners. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-update-amaal-mallik-furious-after-physical-fight-abhishek-bajaj-ashnoor-2797636-2025-10-04",
      "headline": "Bigg Boss 19 ep 41: Amaal Mallik furious after physical fight with Abhishek Bajaj Amaal Mallik and Abhishek Bajaj got into a heated argument after Amaal referred to Ashnoor Kaur as Bhokti hai during her caretaker stint. The clash intensified with Amaal issuing aggressive threats and challenging the makers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/pooja-shah-kbc-17-therapy-challenges-cerebral-palsy-epilepsy-2797633-2025-10-04",
      "headline": "KBC 17: Amitabh Bachchan promises support to contestant's son with special needs Contestant Pooja Shah wins Rs 12,50,000 on 'Kaun Banega Crorepati' 17 for her son's future. Amitabh Bachchan promises to assist in finding better treatment options."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kangana-ranaut-returns-showstopper-raabta-bridal-jewellery-praises-pm-modi-hollywood-debut-2797616-2025-10-04",
      "headline": "Kangana Ranaut praises PM Modi's style, calls him the perfect showstopper Actor Kangana Ranaut walked as the showstopper for Raabta by Rahul's bridal jewellery showcase in Delhi. She commended Prime Minister Modi's sense of style, highlighting his leadership and calling him the perfect showstopper. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/blake-lively-supports-taylor-swift-lawsuit-friendship-rift-justin-baldoni-2797597-2025-10-04",
      "headline": "Blake Lively shows support for Taylor Swift's new album amid rumours of rift Actor Blake Lively liked Taylor Swift's post about her new album amid reports of a strained friendship. Their relationship reportedly became strained after Lively's lawsuit involving Justin Baldoni."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/aryan-khan-netflix-the-bands-of-bollywood-bollywood-satire-debate-2797587-2025-10-04",
      "headline": "Sunil Pal slams Aryan Khan's Netflix show for mocking Bollywood Aryan Khan's directorial debut 'The Ba***ds of Bollywood' draws criticism from comedian Sunil Pal. He objects to Khan's critique of the industry that made his father, Shah Rukh Khan, a star."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/what-sean-diddy-combs-said-in-tearful-remarks-before-sentencing-four-years-prison-2797582-2025-10-04",
      "headline": "I lost my self-respect: What Diddy said in tearful remarks before sentencing Rapper Sean 'Diddy' Combs, in his tearful remarks before the sentencing, apologised for his mistakes and said how he had lost self-respect.  He has been sentenced to 4 years and 2 months for arranging drug-fueled sexual encounters. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/steve-review-cillian-murphy-shines-raw-tale-compassion-chaos-2797519-2025-10-04",
      "headline": "Steve review: Cillian Murphy shines in a raw tale of compassion and chaosRelease Date:Fri Oct 03, 2025 Steve review: Director Tim Mielants crafts a quietly devastating portrait of empathy and resilience in this raw drama, featuring Cillian Murphy as a headteacher holding on to hope while his world unravels. Is the Netflix drama worth your time? Here is our review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nick-jonas-unties-priyanka-chopra-hair-in-adorable-clip-from-gala-night-photo-dump-2797571-2025-10-04",
      "headline": "Nick Jonas unties Priyanka's hair in adorable clip from gala night photo dump Priyanka Chopra shared an adorable video of her husband Nick Jonas, helping her untie her hair after attending a gala night. In a heartfelt note, she thanked Jonas for being so supportive. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/are-ott-platforms-really-a-safe-place-to-launch-newcomers-and-debutants-2797213-2025-10-04",
      "headline": "Are OTT platforms really a safe place to launch newcomers and debutants? OTT platforms have emerged as a safe and effective launchpad for newcomers, providing global reach, creative freedom, and a chance to build skills without box office pressure. They allow fresh talent to experiment, gain visibility, and connect with audiences in a low-risk environment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepika-padukone-ranbir-kapoor-share-a-warm-hug-at-airport-watch-2797557-2025-10-04",
      "headline": "Deepika and Ranbir hug at airport, fans speculate Yeh Jawaani Hai Deewani 2: Watch Fans have been screaming in excitement ever since they saw Deepika Padukone and Ranbir Kapoor together at the airport. A video of the two greeting each other with a hug has emerged online. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kantara-chapter-1-box-office-day-2-rishab-shetty-film-enters-rs-100-crore-club-2797545-2025-10-04",
      "headline": "Kantara Chapter 1 box office Day 2: Rishab Shetty's film enters Rs 100 crore-club 'Kantara Chapter 1' set a new pan-India benchmark, raking in nearly Rs 90 crore worldwide on its first day and crossing Rs 106 crore in net collections within just two days. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sunny-sanskari-ki-tulsi-kumari-box-office-varun-dhawan-janhvi-kapoor-rom-com-faces-kantara-chapter-1-clash-2797537-2025-10-04",
      "headline": "Sunny Sanskari box office Day 2: Varun, Janhvi rom-com faces Kantara Chapter 1 clash Varun Dhawan's 'Sunny Sanskari Ki Tulsi Kumari' earned Rs 9.25 crore on Day 1 and Rs 5.25 crore on Day 2, bringing its total to Rs 14.50 crore. However, the rom-com struggled against Rishab Shetty's 'Kantara: Chapter 1'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actors-vijay-deverakonda-and-rashmika-mandanna-get-engaged-wedding-set-for-february-2026-2797479-2025-10-03",
      "headline": "Vijay Deverakonda, Rashmika Mandanna are engaged, wedding in February: Reports Actors Vijay Deverakonda and Rashmika Mandanna got engaged in a private ceremony attended only by family members, according to reports. Their wedding is reportedly set for February 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ram-gopal-varma-praises-kantara-chapter-1-says-all-filmmakers-should-feel-ashamed-2797432-2025-10-03",
      "headline": "Ram Gopal Varma praises Kantara: Chapter 1, says all filmmakers should feel ashamed Actor-director Rishab Shetty's Kantara Chapter 1, a prequel to the 2022 hit, released in theatres on October 2. Ram Gopal Varma praised the film for its sound design, production quality and \"unimaginable efforts.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/srk-national-award-win-for-jawan-predicted-by-atlee-recalls-sanya-malhotra-2797387-2025-10-03",
      "headline": "SRK's National Award win for Jawan was predicted by Atlee, recalls Sanya Malhotra Actor Sanya Malhotra recently stated that director Atlee predicted Shah Rukh Khan's National Award win during 'Jawan' shoot. The film also featured Deepika Padukone, Nayanthara, Vijay Sethupathi and others in key roles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/diljit-dosanjh-hindi-rebel-song-kantara-chapter-1-rishab-shetty-collaboration-2797390-2025-10-03",
      "headline": "Rishab Shetty wanted Diljit Dosanjh for Kantara but hilariously forgot his name Actor-director Rishab Shetty spoke about his experience of working with Diljit Dosanjh. Their collaboration on the 'Rebel' song marks a significant collaboration on 'Kantara Chapter 1'. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-odi-captain-rohit-sharma-india-squad-australia-tour-selection-2797642-2025-10-04",
      "headline": "Shubman Gill replaces Rohit Sharma as India's ODI captain Live updatesIndia tour of Australia: Shubman Gill has replaced Rohit Sharma as the new ODI captain. The call was taken during Saturday's selection meeting, convened by chairman of selectors Ajit Agarkar, in Ahmedabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-odi-squad-shubman-gill-captain-rohit-sharma-virat-kohli-2797657-2025-10-04",
      "headline": "Ro-Ko back: Rohit Sharma and Virat Kohli return as India name ODI squadIndia tour of Australia: Rohit Sharma and Virat Kohli were named in India's 15-man squad for the three-match series, starting October 19. Shubman Gill replaced Rohit as the new captain of the one-day international side. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/russian-airstrike-hits-train-in-ukraines-sumy-casualties-feared-says-regional-governor-news-agency-reuters-2797664-2025-10-04",
      "headline": "Russian airstrike hits Kyiv-bound train in Ukraine, casualties fearedA Russian airstrike targeted a Kyiv-bound passenger train heading for Kyiv in Ukraine's northern Sumy region, causing casualties among passengers. No figures of the casualties were given till now."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-citizens-worry-gillette-razor-soap-shampoo-shortages-procter-gamble-exit-2797615-2025-10-04",
      "headline": "Pakistanis worry about their grooming game as Gillette maker shuts shopP&G Pakistan: With consumer goods giant P&G shutting shop, several Pakistanis have gone into a meltdown, worrying about shortages of their favourite Gillette razor and Head and Shoulders shampoo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-marxism-south-america-tour-che-guevara-motorcycle-diaries-socialism-congress-politics-lula-de-silva-2797414-2025-10-04",
      "headline": "Rahul Gandhi's Motorcycle Diaries and socialism, Bihar to BrazilCongress leader Rahul Gandhi, who of late took a bit of a Left-turn, is on a South America tour spanning Colombia, Brazil, Peru, and Chile. All these countries are led by Left-of-Centre Socialist governments. Barring Brazil, the other three countries featured in Marxist revolutionary Ernesto \"Che\" Guevara's The Motorcycle Diaries. Rahul has also referred to motorcycles during the tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-strikes-gaza-killed-trump-middle-east-peace-plan-hamas-bombings-2797638-2025-10-04",
      "headline": "Israel strikes kill 6 in Gaza hours after Trump calls for end to bombardmentIsrael's latest airstrikes killed six in Gaza, hours after Donald Trump urged an end to the bombardment and announced Hamas' readiness for peace. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/government-probes-dark-pattern-after-man-exposes-extra-fees-on-cash-on-delivery-2797655-2025-10-04",
      "headline": "Government probes dark pattern after man exposes extra fees on cash-on-deliveryThe Department of Consumer Affairs has launched an investigation into e-commerce sites charging additional fees on cash-on-delivery payments. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/madhya-pradesh/story/sale-of-coldrif-cough-syrup-banned-across-madhya-pradesh-after-9-children-die-chief-minister-mohan-yadav-promises-strict-action-2797610-2025-10-04",
      "headline": "Madhya Pradesh bans Coldrif cough syrup sale, tests confirm presence of toxinsThe Madhya Pradesh government has banned the sale and distribution of Coldrif cough syrup after laboratory tests found the medicine to be \"substandard and adulterated,\" containing 48.6% Diethylene Glycol, a toxic chemical that can cause severe harm or even death."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyer-vice-captain-bcci-shubman-gill-deputy-australia-odi-series-2797662-2025-10-04",
      "headline": "Shreyas Iyer named vice-captain, becomes Shubman Gill's deputy in ODI teamShreyas Iyer has made a massive rise in the Indian ODI setup as he was promoted as vice-captain for the upcoming Australia tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/learn-how-adobe-express-is-making-graphic-design-fun-in-classrooms-2792611-2025-09-24",
      "headline": "Learn How Adobe Express Is Making Graphic Design Fun In ClassroomsThe Adobe Express app is available on any smart device or desktop computer."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/zubeen-gargs-bandmate-claims-singers-manager-fest-organiser-poisoned-him-2797543-2025-10-04",
      "headline": "Manager, fest organiser poisoned Zubeen Garg: Bandmate's damning claimZubeen Garg's bandmate Shekhar Jyoti Goswami said the singer's manager behaved suspiciously prior to his death. Garg died under mysterious circumstances in Singapore on September 19 while swimming."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/former-pakistan-cricketer-danish-kaneria-indian-citizenship-caa-discrimination-2797622-2025-10-04",
      "headline": "India my matrubhumi: Ex-Pak cricketer Danish Kaneria's big claim on citizenshipDanish Kaneria, a Hindu, rejected speculation that his recent positive remarks on India's internal affairs were driven by a motive to seek Indian citizenship."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/nigel-farage-reform-uk-shakes-british-politics-with-hardline-migration-stance-2797594-2025-10-04",
      "headline": "Fringe to frontline: How Farage is forcing Britain's migration debateNigel Farage's Reform UK has shaken Britain's political landscape, forcing major parties to toughen their migration stance as his far-right movement gains momentum and reshapes debates on nationalism and immigration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/meet-judge-arun-subramanian-who-sentenced-sean-diddy-combs-to-50-months-in-jail-glbs-2797521-2025-10-04",
      "headline": "Meet Arun Subramanian, Indian-American judge who sentenced Diddy to 4 years in jailJudge Arun Subramanian, the first South Asian on Manhattan's federal bench, sentenced Sean \"Diddy\" Combs, earning recognition for his calm authority, immigrant-rooted journey, and balanced, reform-minded approach to justice."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/indians-abroad/story/singapore-indian-tourists-jailed-for-5-years-for-robbing-assaulting-sex-workers-2797656-2025-10-04",
      "headline": "2 Indians jailed for 5 years for robbing, assaulting sex workers in SingaporeTwo Indian nationals, Arokkiasamy Dyson and Rajendran, were sentenced in Singapore to five years, one month imprisonment and 12 cane strokes each for assaulting sex workers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/how-to-go-on-a-relationship-detox-without-hurting-your-partner-2797241-2025-10-04",
      "headline": "How to go on a relationship detox without hurting your partnerTaking a relationship detox can strengthen your bond, but telling your partner this need without hurting their feelings can be tricky."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/mudumal-menhirs-indias-3500-year-old-sky-clocks-and-celestial-markers-2797668-2025-10-04",
      "headline": "Ancient astronomy in India: How Mudumal menhirs tracked seasons 3,500 years agoThe Mudumal megalithic menhirs in Telangana, dating back 3,500–4,000 years, served as astronomical markers. A part of India's Tentative List of UNESCO World Heritage Sites, they reveal how Bronze Age communities observed the sky, tracked the sun, and used seasonal calendars, showing sophisticated ancient Indian knowledge applied to astronomy, rituals, and navigation long before modern instruments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-530-03-10-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-1st-test-score-ahmedabad-ravindra-jadeja-mohammed-siraj-2797659-2025-10-04",
      "headline": "Epic mismatch: Ruthless India rout sorry West Indies in just 2-and-a-half daysIndia (IND) vs West Indies (WI), 1st Test: India hammered West Indies by an innings and 140 runs, wrapping up the match in fewer than eight sessions. Ravindra Jadeja's all-round brilliance, Mohammed Siraj's fiery pace, and commanding centuries from KL Rahul and Dhruv Jurel powered India to a dominant victory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/american-man-flaunts-5-year-india-visa-praises-pm-modi-in-viral-post-2797637-2025-10-04",
      "headline": "American man flaunts 5-year India visa, praises PM Modi in viral postIn a now-viral post on X, an American man showed off his five-year Indian visa while praising Prime Minister Narendra Modi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/are-ott-platforms-really-a-safe-place-to-launch-newcomers-and-debutants-2797213-2025-10-04",
      "headline": "Are OTT platforms really a safe place to launch newcomers and debutants?OTT platforms have emerged as a safe and effective launchpad for newcomers, providing global reach, creative freedom, and a chance to build skills without box office pressure. They allow fresh talent to experiment, gain visibility, and connect with audiences in a low-risk environment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actors-vijay-deverakonda-and-rashmika-mandanna-get-engaged-wedding-set-for-february-2026-2797479-2025-10-03",
      "headline": "Vijay Deverakonda, Rashmika Mandanna are engaged, wedding in February: ReportsActors Vijay Deverakonda and Rashmika Mandanna got engaged in a private ceremony attended only by family members, according to reports. Their wedding is reportedly set for February 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/karnataka-state-awards-rakshit-shetty-archana-jois-win-top-honours-2797619-2025-10-04",
      "headline": "Karnataka State Awards: Rakshit Shetty, Archana Jois win bigThe Karnataka State Awards were announced recently, honouring the best talent for their contribution to cinema. Take a look at the complete list of winners. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/16-year-old-muslim-girl-to-perform-kathakali-as-krishna-in-kerala-kalamandalam-2797581-2025-10-04",
      "headline": "Sabri, 16, Kerala Kalamandalam's first Muslim Kathakali artist, to portray KrishnaBreaking barriers, Sabri will become the first Muslim girl to perform at Kerala Kalamandalam. With family support, she will take the stage in Krishna vesham alongside her peers."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-odi-series-ravindra-jadeja-snub-tactical-decision-ajit-agarkar-2797676-2025-10-04",
      "headline": "Ravindra Jadeja's ODI future in doubt? Ajit Agarkar explains Australia tour snub Ravindra Jadeja will miss India's three-match ODI series in Australia, but his exclusion is strategic rather than form-related. Ajit Agarkar reassured fans that Jadeja remains central to India's ODI plans, with 2027 World Cup in mind."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-praises-indias-spin-options-innings-win-west-indies-2797671-2025-10-04",
      "headline": "Shubman Gill reacts to happy headache of managing quality spinners IND vs WI: Shubman Gill lauded India's world-class spinners after their innings-and-140-run win over the West Indies, calling it a happy headache to manage so much talent.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-t20i-squad-vs-australia-2025-hardik-pandya-injury-jasprit-bumrah-2797665-2025-10-04",
      "headline": "No Hardik Pandya as Asia Cup champions India name T20I squad for Australia tour Hardik Pandya misses out on making it to the squad for the T20I series against Australia as India retained most of the players from their squad that won the Asia Cup. Jasprit Bumrah retains his spot and Nitish Kumar Reddy and Washington Sundar are included in the side. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyer-vice-captain-bcci-shubman-gill-deputy-australia-odi-series-2797662-2025-10-04",
      "headline": "Shreyas Iyer named vice-captain, becomes Shubman Gill's deputy in ODI team Shreyas Iyer has made a massive rise in the Indian ODI setup as he was promoted as vice-captain for the upcoming Australia tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-1st-test-score-ahmedabad-ravindra-jadeja-mohammed-siraj-2797659-2025-10-04",
      "headline": "Epic mismatch: Ruthless India rout sorry West Indies in just 2-and-a-half days India (IND) vs West Indies (WI), 1st Test: India hammered West Indies by an innings and 140 runs, wrapping up the match in fewer than eight sessions. Ravindra Jadeja's all-round brilliance, Mohammed Siraj's fiery pace, and commanding centuries from KL Rahul and Dhruv Jurel powered India to a dominant victory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-odi-squad-shubman-gill-captain-rohit-sharma-virat-kohli-2797657-2025-10-04",
      "headline": "Ro-Ko back: Rohit Sharma and Virat Kohli return as India name ODI squad India tour of Australia: Rohit Sharma and Virat Kohli were named in India's 15-man squad for the three-match series, starting October 19. Shubman Gill replaced Rohit as the new captain of the one-day international side. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-replaced-odi-captain-shubman-gill-bcci-australia-tour-2797644-2025-10-04",
      "headline": "Just disrespect: Rohit Sharma fans livid as Shubman Gill takes over as ODI captain Rohit Sharma has been replaced as India's ODI captain ahead of the Australia tour. Fans have reacted with anger and disappointment over the decision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-odi-captain-rohit-sharma-india-squad-australia-tour-selection-2797642-2025-10-04",
      "headline": "Shubman Gill replaces Rohit Sharma as India's ODI captain Live updates India tour of Australia: Shubman Gill has replaced Rohit Sharma as the new ODI captain. The call was taken during Saturday's selection meeting, convened by chairman of selectors Ajit Agarkar, in Ahmedabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-trophy-mohsin-naqvi-mohammad-yousuf-india-vs-pakistan-2797626-2025-10-04",
      "headline": "After vile SKY remark, ex-Pak star says Naqvi right in denying India Asia Cup Asia Cup 2025: Former Pakistan cricketer Mohammad Yousuf has defended Mohsin Naqvi, saying the Pakistan Cricket Board chief was right to withhold the Asia Cup trophy from India. Yousuf had made a vile remark about India captain Suryakumar Yadav last month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/former-pakistan-cricketer-danish-kaneria-indian-citizenship-caa-discrimination-2797622-2025-10-04",
      "headline": "India my matrubhumi: Ex-Pak cricketer Danish Kaneria's big claim on citizenship Danish Kaneria, a Hindu, rejected speculation that his recent positive remarks on India's internal affairs were driven by a motive to seek Indian citizenship."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/usain-bolt-sunil-chhetri-mumbai-5-vs-5-football-exhibition-match-2797617-2025-10-04",
      "headline": "Usain Bolt x Sunil Chhetri: Sports icons link up for exhibition match in Mumbai Usain Bolt and Sunil Chhetri shared the pitch in a thrilling 5-vs-5 football match in Mumbai. The event celebrated Indian football culture and brought global and local stars together, ending in a 5-2 victory for Bengaluru FC."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-replaced-odi-captain-shubman-gill-bcci-australia-tour-2797644-2025-10-04",
      "headline": "Just disrespect: Rohit Sharma fans livid as Shubman Gill takes over as ODI captain Rohit Sharma has been replaced as India's ODI captain ahead of the Australia tour. Fans have reacted with anger and disappointment over the decision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-odi-captain-rohit-sharma-india-squad-australia-tour-selection-2797642-2025-10-04",
      "headline": "Shubman Gill replaces Rohit Sharma as India's ODI captain Live updates India tour of Australia: Shubman Gill has replaced Rohit Sharma as the new ODI captain. The call was taken during Saturday's selection meeting, convened by chairman of selectors Ajit Agarkar, in Ahmedabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-trophy-mohsin-naqvi-mohammad-yousuf-india-vs-pakistan-2797626-2025-10-04",
      "headline": "After vile SKY remark, ex-Pak star says Naqvi right in denying India Asia Cup Asia Cup 2025: Former Pakistan cricketer Mohammad Yousuf has defended Mohsin Naqvi, saying the Pakistan Cricket Board chief was right to withhold the Asia Cup trophy from India. Yousuf had made a vile remark about India captain Suryakumar Yadav last month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/former-pakistan-cricketer-danish-kaneria-indian-citizenship-caa-discrimination-2797622-2025-10-04",
      "headline": "India my matrubhumi: Ex-Pak cricketer Danish Kaneria's big claim on citizenship Danish Kaneria, a Hindu, rejected speculation that his recent positive remarks on India's internal affairs were driven by a motive to seek Indian citizenship."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/usain-bolt-sunil-chhetri-mumbai-5-vs-5-football-exhibition-match-2797617-2025-10-04",
      "headline": "Usain Bolt x Sunil Chhetri: Sports icons link up for exhibition match in Mumbai Usain Bolt and Sunil Chhetri shared the pitch in a thrilling 5-vs-5 football match in Mumbai. The event celebrated Indian football culture and brought global and local stars together, ending in a 5-2 victory for Bengaluru FC."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}