{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jyotiraditya-scindia-on-elon-musk-starlink-licence-approval-after-security-compliance-india-telecom-sector-2632408-2024-11-12",
      "headline": "Jyotiraditya Scindia on Musk's Starlink licence: Approval after security complianceTesla CEO Elon Musk, the world's richest man, has been eyeing entry to the Indian telecom sector with Starlink."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-down-over-800-points-investors-losses-bse-market-capitalisation-2632317-2024-11-12",
      "headline": "Sensex tumbles over 800 points. Here's how much money investors lostAnalysts attributed the selloff to continued foreign investor outflows and disappointing quarterly earnings, particularly in banking and auto sectors. Foreign institutional investors (FIIs) reportedly offloaded Rs 2,306 crore worth of Indian equities, extending their selling spree."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/swiggy-ipo-stock-market-listing-employee-benefits-crorepatis-2632304-2024-11-12",
      "headline": "Swiggy IPO listing: Around 500 employees likely to become crorepatisSwiggy's IPO stock market listing: The grey market premium (GMP) of Rs 2 ahead of Wednesday's debut indicates only a marginal gain of 0.51% above the issue price. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/retail-inflation-rises-to-621-in-october-2632249-2024-11-12",
      "headline": "Retail inflation at a 14-month high, rises to 6.21% in OctoberThe inflation rate currently stands at 6.68% in rural areas, surpassing the urban inflation rate, which is recorded at 5.62%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-down-900-points-nifty-below-24000-key-factors-behind-stock-market-bloodbath-2632213-2024-11-12",
      "headline": "Sensex tanks 820 points, Nifty tumbles: 4 factors behind stock market bloodbathAfter opening in green, the S&P BSE Sensex reversed course, dragged down by banking, financial services, and auto stocks. The Nifty50, too, faced a broad-based decline, with nearly all sectoral indices closing in the red except for Nifty Realty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/blackbuck-ipo-10-things-to-know-subscription-status-gmp-price-band-key-details-good-bad-review-2632212-2024-11-12",
      "headline": "Zinka Logistics Solutions IPO: 10 things to know before subscribingZinka Logistics Solution Limited, established in April 2015, operates a digital platform called the BlackBuck app tailored for truck operators."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-update-sensex-down-over-600-points-nifty-falls-200-afternoon-session-auto-bank-stocks-decline-2632167-2024-11-12",
      "headline": "Sensex, Nifty fall for fourth consecutive day; key reasons behind the slumpThe S&P BSE Sensex lost 659.08 points to 78,837.07, while the NSE Nifty50 was down 205.35 points to 23,935.95"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-price-today-will-it-reach-usd-100000-donald-trump-us-election-2632108-2024-11-12",
      "headline": "Bitcoin's comeback: Will it cross the $100,000 mark soon?Donald Trump's win has injected fresh optimism among crypto advocates, as he has previously championed a supportive regulatory framework for digital assets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tv-todays-cfo-yatender-kumar-tyagi-wins-silver-award-from-safa-for-best-presented-annual-report-in-financial-reporting-2632100-2024-11-12",
      "headline": "TV Today's CFO wins Silver Award from SAFA for Best Presented Annual Report in Financial reportingPresented by the South Asian Federation of Accountants (SAFA), this award recognises TV Today's excellence in financial transparency within the Service Sector."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/swiggy-ipo-listing-date-latest-gmp-indicate-ahead-of-market-debut-share-price-2632095-2024-11-12",
      "headline": "Swiggy IPO listing: What does latest GMP indicate ahead of market debut? Bengaluru-based Swiggy opened for subscription with a price band of Rs 371 to Rs 390, aiming to raise Rs 11,327 crore through the Initial Public Offering (IPO). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/niva-bupa-health-insurance-ipo-allotment-online-step-by-step-guide-to-check-status-latest-gmp-2632068-2024-11-12",
      "headline": "Niva Bupa Health Insurance IPO allotment: Step-by-step guide to check statusNiva Bupa Health Insurance IPO allotment: Investors who have bid for the IPO can check their allotment status online. They can log in to either the BSE website or the website of Kfin Technologies Limited, the registrar for the issue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-price-today-nears-90000-dollars-strong-rally-will-it-continue-donald-trump-stance-2632047-2024-11-12",
      "headline": "Bitcoin price nears $90,000. What's behind the rally and will it continue? The recent rally in Bitcoin, now nearing $90,000, comes on the back of Donald Trump's pro-crypto stance following his recent election victory in the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hindalco-shares-gain-over-2-percent-after-beating-estimates-in-q2-report-should-you-buy-sell-or-hold-2632019-2024-11-12",
      "headline": "Hindalco shares gain 2% after beating estimates in Q2 report: Should you buy? Hindalco shares: Hindalco reported a 123% year-on-year (YoY) rise in standalone net profit, amounting to Rs 1,891 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-sensex-nifty-inflation-data-hindalco-share-price-today-2632016-2024-11-12",
      "headline": "Sensex, Nifty rise ahead of inflation data; Hindalco gains after Q2 resultsThe S&P BSE Sensex was up 148.85 points to 79,645 at 10:26 am, while the NSE Nifty was up 46.75 points to 24,188.05."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sagility-india-share-maret-listing-decent-debut-premium-over-ipo-price-2632007-2024-11-12",
      "headline": "Sagility India shares list at 3.5% premium over IPO priceSagility India share market listing: The stock listed with a modest premium, drawing mixed views on valuation but strong demand from investors across segments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-price-today-november-12-2024-precious-metals-record-hike-on-mcx-2631995-2024-11-12",
      "headline": "Gold, silver price today, November 12, 2024: Precious metals record hike on MCXGold Price Today November 12, 2024: Both gold and silver are trading on the higher side of the Multi Commodity Exchange (MCX) on Tuesday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-donald-trump-us-elections-win-dollars-market-2631958-2024-11-12",
      "headline": "Bitcoin crosses $89,000 as Trump vows to make US 'crypto capital of the planet'Leading cryptocurrency bitcoin pushed to a new all-time high of $89,637 (approx Rs 75 lakh) on Tuesday. Trump has vowed to make the United States \"the crypto capital of the planet\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/niva-bupa-health-insurance-ipo-day-3-check-latest-subscription-gmp-2631713-2024-11-11",
      "headline": "Niva Bupa Health Insurance IPO Day 3: Check latest subscription, GMPNiva Bupa Health Insurance IPO: The public issue has seen moderate interest and allotment for the Niva Bupa Health Insurance IPO is likely to be finalised on Tuesday, November 12, 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/should-you-buy-lic-shares-after-q2-results-expert-view-what-brokerages-say-2631680-2024-11-11",
      "headline": "Should you buy LIC shares after Q2 results? Here's what brokerages suggestLIC reported a 4% year-on-year (YoY) decline in standalone net profit, amounting to Rs 7,621 crore for the quarter ending September 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-close-flat-amid-volatile-trading-asian-paints-down-8-percent-2631639-2024-11-11",
      "headline": "Sensex, Nifty close flat amid volatile trading; Asian Paints down 8%The S&P BSE Sensex added 9.83 points to close at 79,496.15, while the NSE Nifty50 was down 6.90 points to end at 24,141.30. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/maharashtra-assembly-elections-nitin-gadkaris-chopper-checked-poll-officials-amid-shiv-sena-ubt-uddhav-thackeray-bag-row-2632487-2024-11-13",
      "headline": "Nitin Gadkari's chopper checked by poll officials amid Uddhav Thackeray bag rowUnion Minister and BJP leader Nitin Gadkari's helicopter was checked after Shiv Sena (UBT) chief Uddhav Thackeray accused poll officials of checking his bags on multiple occasions in an attempt to target the Opposition. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/manipur-violence-members-meitei-community-dead-missing-amid-shutdown-several-parts-attack-armed-kuki-militants-2632455-2024-11-12",
      "headline": "2 men found dead, 6 of family missing day after militants killed in ManipurTwo elderly men were found burned to death, and six civilians, including three women and three minors, are missing. Police have initiated a search to trace them. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/story/bjp-kerala-palakkad-assembly-bypoll-c-krishnakumar-candidate-2632451-2024-11-12",
      "headline": "Could BJP infighting in Kerala dash its Palakkad bypoll win hopes?For the BJP, the Palakkad by-election is crucial as it is the most promising seat that will help it gain a foothold in the state. However, differences within the party could play spoilsport. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-hush-money-case-proceedings-paused-new-york-us-polls-2632441-2024-11-12",
      "headline": "Trump's hush money case proceedings paused days after his US poll winIn May, a New York jury found Donald Trump guilty of all 34 charges in a scheme to illegally influence the 2016 election through a hush money payment to adult actor Stormy Daniels. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/bangladesh-sheikh-mujibibur-rahman-portrait-removal-mahfuz-alam-bangabhaban-bnp-criticism-protests-2632255-2024-11-12",
      "headline": "Yunus government gives in to students, removes Mujib photo The portrait of Sheikh Mujibur Rahman, Bangladesh's founder, was removed from the Bangladesh President's office. This came after criticism and pressure from student leaders who agitated against ousted PM Sheikh Hasina. Is the Yunus government giving in to students' demands?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/man-arrested-for-farming-marijuana-in-greater-noida-flat-selling-it-on-dark-web-2632336-2024-11-12",
      "headline": "Cannabis nursery, 50 pots: Greater Noida man's high-tech setup inside flat bustedDuring the raid, police seized marijuana worth several lakhs of rupees and arrested the accused. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/mithun-chakraborty-jharkhand-assembly-election-rally-bjp-dhanbad-wallet-stolen-appeal-for-return-2632499-2024-11-13",
      "headline": "Mithun Chakraborty's wallet stolen at BJP rally, organisers appeal for its returnVideos from the rally show that there was inadequate security there due to which several people climbed on the stage to click pictures with Mithun Chakraborty. During this time, Chakraborty's wallet was stolen."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/kerala/story/kerala-ias-officer-n-prashanth-k-gopalakrishnan-suspended-collector-bro-social-media-2632242-2024-11-12",
      "headline": "'Collector Bro' suspended: What led to action against popular Kerala IAS officerN Prasanth IAS aka Collector Bro, known for his active social media presence and impactful social initiatives, was suspended for publicly posting 'derogatory remarks' against a senior IAS officer. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/toxic-levels-of-lead-found-in-turmeric-haldi-sold-in-india-nepal-pakistan-study-2632218-2024-11-12",
      "headline": "Haldi in your food contains high levels of lead, new study revealsA recent study reveals alarming levels of lead in turmeric sold in India, Nepal, and Pakistan, with some samples far exceeding the safe limit set by India's FSSAI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/harnessing-the-power-of-data-iim-kozhikodes-professional-certificate-programme-in-advanced-data-analytics-for-managers-2631624-2024-11-11",
      "headline": "Harnessing the Power of Data: IIM Kozhikode's Professional Certificate Programme in Advanced Data Analytics for ManagersEmpowering Managers with Data-Driven Insights for Strategic Decision-Making"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/yogi-adityanath-mallikarjun-kharge-hyderabad-nizam-razakar-village-family-2632298-2024-11-12",
      "headline": "Razakars burned down your family: Adityanath's reminder to Congress chiefYogi Adityanath recounted Mallikarjun Kharge's childhood tragedy during the political unrest in Hyderabad before its integration into India. The Chief Minister said Nizam's Razakars burned down Kharge's village in 1948."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mathura-oil-refinery-blast-injured-critical-deaths-uttar-pradesh-iocl-explosion-2632474-2024-11-12",
      "headline": "8 injured, three critical in major explosion at Indian Oil plant in UP's MathuraTwo workers were injured with 50 per cent burns, another two with 40 per cent burns and the remaining four with burns covering 20 per cent of their bodies. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/science/story/delhi-winter-delay-why-its-so-warm-in-november-2632275-2024-11-12",
      "headline": "Why is Delhi winter delayed and when will it arrive?The IMD's recent two-week forecast has dimmed hopes for a quick drop in temperatures. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/apple-watch-series-10-a-timely-masterpiece-2632238-2024-11-12",
      "headline": "Apple Watch Series 10: A timely masterpiece?At Rs 59,900, the Apple Watch Series 10 doesn't shatter the mould, but it certainly refines what's already excellent\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-china-one-round-of-patrolling-complete-line-of-actual-control-lac-border-breakthrough-disengagement-2632418-2024-11-12",
      "headline": "India, China complete one round of patrolling along LAC following border truceThe first round of patrolling was conducted by India and China following successful disengagement in the friction areas in October. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/lufthansa-flight-to-frankfurt-hit-by-severe-turbulence-11-passengers-injured-2632420-2024-11-12",
      "headline": "Lufthansa flight to Frankfurt hit by severe turbulence, 11 passengers injuredThe injured received medical treatment immediately after the aircraft landed safely at its planned destination on Tuesday at 10.53 am (0953 GMT). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/donald-trump-appointments-tim-waltz-marco-rubio-tom-homan-immigration-elise-stefanik-anti-china-india-2631749-2024-11-12",
      "headline": "Trump's early picks show steely resolve, should cheer IndiaPresident-elect Donald Trump is swiftly assembling his White House team. The early picks show Trump's intent to walk the talk on immigration and national security. The selection of Mike Waltz and Tom Homan should especially cheer India. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/zhuhai-china-hit-and-run-sports-car-accident-dead-injured-2632278-2024-11-12",
      "headline": "35 killed in China after car drives into group of people outside sports centreChinese Police have arrested a 62-year-old man who allegedly ran his car into pedestrians outside the sports centre in Zhuhai city which killed around 35 people and injured over 40."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/600-elephants-dead-since-2019-where-odisha-bengal-may-be-erring-2632065-2024-11-12",
      "headline": "600 elephants dead since 2019, where Odisha, Bengal may be erringExperts say states that register loss of lives every year due to human-elephant conflict must work together and look at land zonation to make coexistence possible\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/breathing-teddies-are-the-new-sleep-hack-on-instagram-do-they-really-work-2632125-2024-11-12",
      "headline": "'Breathing teddies' are the new sleep hack on Instagram. Do they really work?Breathing and weighted teddies are making waves on social media, becoming the latest and trendiest solutions to tackle sleep anxiety and insomnia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/delhi-woman-scare-people-children-with-halloween-makeup-viral-video-divides-internet-2632439-2024-11-12",
      "headline": "Delhi woman tries to scare people with Halloween makeup. Viral video divides InternetShaifali Nagpal, a makeup artist based in Paschim Vihar, posted a video of her Halloween stunt that has garnered over seven million views so far on Instagram. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/who-is-indias-most-powerful-bureaucrat-2631737-2024-11-11",
      "headline": "Who is India's most powerful bureaucrat?The influence they wield is unique, but with it comes accountability to preserve constitutional and democratic integrity. The top 10 who form the backbone of India's governance\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/visualstories/science/inside-sunita-williams-extended-mission-what-shes-doing-beyond-earth-186209-12-11-2024",
      "headline": "Inside Sunita Williams' extended mission: What she's doing in spaceSunita Williams, along with fellow astronaut Barry \"Butch\" Wilmore, has been on an extended mission aboard the International Space Station."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/centre-menstrual-hygiene-policy-for-school-going-girls-supreme-court-union-health-ministry-2631952-2024-11-12",
      "headline": "Menstrual policy for schoolgirls approved, Centre tells Supreme CourtThe Centre referred to a top court order of April 10, 2023, and said the Union Ministry of the Health and Family Welfare framed the policy over menstrual hygiene of female school children which was approved by the minister concerned on November 2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ridhi-dogra-abir-gulaal-fawad-khan-checked-authorities-pakistan-2632478-2024-11-12",
      "headline": "Ridhi Dogra checked with authorities before signing Abir Gulaal with Fawad KhanRidhi Dogra shared her thoughts on working with Fawad Khan in the upcoming film Abir Gulaal. She said that she checked with authorities if it was allowed to work with a person of that specific nationality."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/britney-spears-reunites-18-year-old-son-jayden-james-federline-2632448-2024-11-12",
      "headline": "Singer Britney Spears reunites with 18-year-old son Jayden: ReportBritney Spears has reportedly reunited with her 18-year-old son, Jayden James Federline, after years of estrangement. However, her ex-husband Kevin Federline is unaware of this reunion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/khushi-kapoor-public-scrutiny-her-dating-life-let-work-be-the-priority-vedang-raina-2632417-2024-11-12",
      "headline": "Khushi Kapoor on public scrutiny of her dating life: Let work be the priorityDuring a recent interview with Harper's Bazaar India, Khushi Kapoor opened up about the public's curiosity regarding her dating life, amidst speculation of her dating fellow actor Vedang Raina. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nagarjuna-poster-kubera-dhanush-rashmika-mandanna-2632406-2024-11-12",
      "headline": "Pic: Nagarjuna's 'strikingly cool' character poster from Kubera outNagarjuna Akkineni's character poster from the much-anticipated film Kubera has been released ahead of the film's first glimpse on November 15.  Directed by Sekhar Kammula, the film is set to be a grand cinematic experience with a star-studded cast."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/rahul-dravid-school-girls-cricket-beaten-viral-reaction-rajasthan-royals-2632466-2024-11-12",
      "headline": "Watch: Rahul Dravid's priceless reaction after facing young girl's fiery deliveryRajasthan Royals head coach Rahul Dravid faced pace bowling from a set of young girls after an interschool competition, organised by the IPL franchise. Dravid's reactions to some unplayable deliveries have gone viral on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-south-africa-vs-india-3rd-t20i-predicted-xi-abhishek-sharma-2632484-2024-11-12",
      "headline": "South Africa vs India, 3rd T20I Predicted XI: Will India drop Abhishek Sharma?SA vs IND: Pressure is on Abhishek Sharma going into the third T20I as the left-handed batter has struggled to find his feet in T20Is, barring his century against Zimbabwe in July. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-auction-kl-rahul-interview-rcb-return-captaincy-lsg-exit-2632480-2024-11-12",
      "headline": "KL Rahul open to RCB return, says captaincy not a dealbreaker after LSG exitIPL 2025: Speaking ahead of the mega auction, KL Rahul said he is looking forward to playing for a franchise where is loved and cared for. Rahul opened up about his exit from Lucknow Super Giants and gave a pitch to potential buyers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-pakistan-mohammad-rizwan-odi-series-2632479-2024-11-12",
      "headline": "Pakistan must strive to win big titles, show their potential: RizwanAUS vs PAK: Skipper Mohammad Rizwan said that he's focussed on winning the T20I series against Australia after Pakistan came up trumps in the three-match ODI series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-magnus-carlsen-meets-anish-sarkar-3-year-old-tata-steel-kolkata-2632461-2024-11-12",
      "headline": "Magnus Carlsen meets 3-year-old prodigy Anish Sarkar: 'Amazing to see his level'Legendary Magnus Carlsen praised three-year-old Anish Sarkar, who became the youngest-rated player in the history of chess. Carlsen had a piece of advice for the toddler, who has taken the world by storm with his love for the sport. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-nathan-lyon-ravi-ashwin-paul-adams-2632454-2024-11-12",
      "headline": "Lyon is a more complete bowler than Ashwin: Former South Africa spinner AUS vs IND: Former South Africa spinner Paul Adams said that Nathan Lyon is a more complete bowler than Ravi Ashwin. Both Ashwin and Lyon will go head-to-head in the upcoming Border-Gavaskar Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-vs-australia-bgt-no-warm-up-matches-rohit-sharma-virat-kohli-sanjay-manjrekar-2632443-2024-11-12",
      "headline": "Rohit, Virat would have loved to play warm-up games: ManjrekarFormer India cricketer Sanjay Manjrekar believes that Rohit Sharma and Virat Kohli would have loved to play warm-up games in Australia. Manjrekar says that with the kind of form and confidence India are going into the tour, they probably needed the matches to get into groove.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-cricket-munaf-patel-delhi-capitals-bowling-coach-new-support-staff-2632436-2024-11-12",
      "headline": "World Cup winner Munaf Patel appointed Delhi Capitals bowling coach IPL 2025: Former India fast bowler Munaf Patel joined a revamped Delhi Capitals coaching staff. The World Cup-winner will work with newly-appointed head coach Hemang Badani and Director of Cricket Venugopal Rao. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/sa-vs-ind-3rd-t20i-arshdeep-singh-pre-match-press-conference-suryakumar-yadav-2632431-2024-11-12",
      "headline": "Arshdeep reveals success mantra, batting dreams and learnings from SuryakumarIndia pacer Arshdeep Singh explained that how he keeping things simple has resulted in success. Speaking at the pre-match press conference, ahead of the Centurion T20I, Arshdeep also spoke about his learnings from Suryakumar Yadav."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-marco-jansen-centurion-t20i-south-africa-vs-india-2632429-2024-11-12",
      "headline": "Jansen braces for Indian spin challenge in 'bouncy' Centurion SA vs IND: Marco Jansen said that the South African batters need to work on playing spin-bowling when they face India in the third T20I on Wednesday at the SuperSport Park in Centurion. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/south-africa-vs-india-cricket-arshdeep-singh-success-mantra-batting-death-bowling-bumrah-2632410-2024-11-12",
      "headline": "Uncluttered Arshdeep Singh opens up about death-bowling, love for pinch-hittingSouth Africa vs India: Arshdeep Singh opened up about what has brought him so much success in the nascent stages of his international career. The left-arm pacer opened up about his death-bowling mantra and his desire to become a better batter in T20Is. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/india-vs-australia-bgt-no-warm-up-matches-rohit-sharma-virat-kohli-sanjay-manjrekar-2632443-2024-11-12",
      "headline": "Rohit, Virat would have loved to play warm-up games: ManjrekarFormer India cricketer Sanjay Manjrekar believes that Rohit Sharma and Virat Kohli would have loved to play warm-up games in Australia. Manjrekar says that with the kind of form and confidence India are going into the tour, they probably needed the matches to get into groove.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-cricket-munaf-patel-delhi-capitals-bowling-coach-new-support-staff-2632436-2024-11-12",
      "headline": "World Cup winner Munaf Patel appointed Delhi Capitals bowling coach IPL 2025: Former India fast bowler Munaf Patel joined a revamped Delhi Capitals coaching staff. The World Cup-winner will work with newly-appointed head coach Hemang Badani and Director of Cricket Venugopal Rao. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/sa-vs-ind-3rd-t20i-arshdeep-singh-pre-match-press-conference-suryakumar-yadav-2632431-2024-11-12",
      "headline": "Arshdeep reveals success mantra, batting dreams and learnings from SuryakumarIndia pacer Arshdeep Singh explained that how he keeping things simple has resulted in success. Speaking at the pre-match press conference, ahead of the Centurion T20I, Arshdeep also spoke about his learnings from Suryakumar Yadav."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-marco-jansen-centurion-t20i-south-africa-vs-india-2632429-2024-11-12",
      "headline": "Jansen braces for Indian spin challenge in 'bouncy' Centurion SA vs IND: Marco Jansen said that the South African batters need to work on playing spin-bowling when they face India in the third T20I on Wednesday at the SuperSport Park in Centurion. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/south-africa-vs-india-cricket-arshdeep-singh-success-mantra-batting-death-bowling-bumrah-2632410-2024-11-12",
      "headline": "Uncluttered Arshdeep Singh opens up about death-bowling, love for pinch-hittingSouth Africa vs India: Arshdeep Singh opened up about what has brought him so much success in the nascent stages of his international career. The left-arm pacer opened up about his death-bowling mantra and his desire to become a better batter in T20Is. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/mike-tyson-vs-jake-paul-when-and-where-to-watch-much-anticipated-fight-live-streaming-details-2632390-2024-11-12",
      "headline": "Mike Tyson vs Jake Paul: All you need to knowMike Tyson and Jake Paul are set to clash in the boxing ring on November 16. Here's everything you need to know about the much-anticipated fight, which will be exclusively streamed on Netflix.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/senior-womens-t20-trophy-mumbai-bengal-final-2632380-2024-11-12",
      "headline": "Mumbai beat Bengal to successfully defend Senior Women's T20 Trophy title Humaira Kaazi's Mumbai defeated Bengal by 10 wickets at the Wankhede Stadium in Mumbai to successfully defend their title in the Senior Women's T20 Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-mohammed-shami-injury-update-comeback-bengal-ranji-trophy-2632381-2024-11-12",
      "headline": "Mohammed Shami back with 'same passion and energy': 360 days is a long timeIndia pacer Mohammed Shami is set to be back in action after nearly a year's hiatus. The pacer took to social media and said that he is returning back with same energy and passion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-vs-new-zealand-wanindu-hasaranga-ruled-out-hamstring-injury-2632362-2024-11-12",
      "headline": "Hasaranga ruled out of New Zealand ODIs with hamstring injury SL vs NZ: Wanindu Hasaranga has been ruled out of the ODI series against New Zealand with a hamstring injury that he sustained in the second T20I on Sunday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-brad-haddin-yashasvi-jaiswal-aaron-finch-rishabh-pant-alex-carey-2632319-2024-11-12",
      "headline": "Yashasvi Jaiswal can't stand up to Australian quicks: Brad HaddinFormer Australia cricketer Brad Haddin feels India's Yashasvi Jaiswal can't stand against Australian fast bowlers. Jaiswal has been India's best batter in 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/exclusive-interview-pankaj-advani-snooker-billiards-india-2632314-2024-11-12",
      "headline": "With 28th world title, Pankaj Advani focusses on 'visibility' of snooker in IndiaIn an exclusive interview with India Today's sister channel, Sports Today, Pankaj Advani spoke about popular billiards and snooker in India. Advani recently won his 28th world title at the IBSF World Billiards Championship. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-deepak-chahar-ipl-auction-csk-2632300-2024-11-12",
      "headline": "Deepak Chahar confident of returning to CSK: They will bid for me againDeepak Chahar was released by CSK ahead of the 2025 mega-auction. However, the player is confident that Chennai will bid for him on November 24 and 25.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-champions-trophy-pakistan-cricket-board-writes-letter-icc-no-hybrid-model-2632294-2024-11-12",
      "headline": "Pakistan seeks clarity over India's refusal to travel, says no to hybrid modelChampions Trophy 2025: Pakistan Cricket Board has written to the International Cricket Council, demanding clarity over India's refusal to travel to Pakistan. The PCB, in a statement, said it received communication from the ICC regarding the BCCI's stance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-brad-haddin-yashasvi-jaiswal-aaron-finch-rishabh-pant-alex-carey-2632319-2024-11-12",
      "headline": "Yashasvi Jaiswal can't stand up to Australian quicks: Brad HaddinFormer Australia cricketer Brad Haddin feels India's Yashasvi Jaiswal can't stand against Australian fast bowlers. Jaiswal has been India's best batter in 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/exclusive-interview-pankaj-advani-snooker-billiards-india-2632314-2024-11-12",
      "headline": "With 28th world title, Pankaj Advani focusses on 'visibility' of snooker in IndiaIn an exclusive interview with India Today's sister channel, Sports Today, Pankaj Advani spoke about popular billiards and snooker in India. Advani recently won his 28th world title at the IBSF World Billiards Championship. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-deepak-chahar-ipl-auction-csk-2632300-2024-11-12",
      "headline": "Deepak Chahar confident of returning to CSK: They will bid for me againDeepak Chahar was released by CSK ahead of the 2025 mega-auction. However, the player is confident that Chennai will bid for him on November 24 and 25.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-champions-trophy-pakistan-cricket-board-writes-letter-icc-no-hybrid-model-2632294-2024-11-12",
      "headline": "Pakistan seeks clarity over India's refusal to travel, says no to hybrid modelChampions Trophy 2025: Pakistan Cricket Board has written to the International Cricket Council, demanding clarity over India's refusal to travel to Pakistan. The PCB, in a statement, said it received communication from the ICC regarding the BCCI's stance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-kl-rahul-gautam-gamhir-australia-vs-india-border-gavaskar-trophy-2024-25-2632285-2024-11-12",
      "headline": "Watch: KL Rahul sweats hard in Perth nets after Gautam Gambhir's backingStar India batter KL Rahul was seen in sweating hard in the practice nets in Perth ahead of the five-match Test series against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-south-africa-neil-mckenzie-test-series-2632280-2024-11-12",
      "headline": "Sri Lanka appoint Neil McKenzie as consultant before South Africa TestsFormer South African batter Neil McKenzie has joined Sri Lanka as a consultant ahead of the two-match Test series against the Proteas, starting November 25. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-2632236-2024-11-12",
      "headline": "Virat and Rohit will dazzle with their bats in Australia: Chetan SharmaFormer India cricketer and chief selector Chetan Sharma has backed Virat Kohli and Rohit Sharma to find form in upcoming Test series against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/leh-paralympics-2028-high-performance-centre-2632222-2024-11-12",
      "headline": "High performance training for para-athletes set to open in LehThe world's first high-altitude Para Sports Centre is set to be established in Leh. The institute will focus on training para-athletes for international competitions, including the 2028 Paralympics."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}