{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/finance-minister-mis-selling-is-an-offence-rbi-insurance-guidelines-warns-banks-2873250-2026-02-24",
      "headline": "You cannot afford to mis-sell, Finance Minister Nirmala Sitharaman warns banksFinance Minister Nirmala Sitharaman said banks cannot treat mis-selling as routine business and called it an offence. Her remarks come as the Reserve Bank of India is preparing to issue guidance aimed at curbing mis-selling practices by banks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/idfc-first-bank-says-rs-590-crore-fraud-due-to-staff-collusion-2873108-2026-02-23",
      "headline": "IDFC First Bank says Rs 590 crore fraud due to staff collusionThe issue first came to light when a Haryana government department asked the bank to close its account and transfer funds. During this process, the bank noticed a mismatch between its records and the department's figures. This led to a wider internal review. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-to-refund-rs-1000-or-less-in-inactive-accounts-who-is-eligible-2873071-2026-02-23",
      "headline": "EPFO to refund Rs 1,000 or less in inactive accounts: Who is eligible?At present, there are around 31 lakh inoperative EPFO accounts. Out of these, nearly six lakh accounts have Rs 1,000 or less deposited."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/will-ai-impact-your-appraisals-this-year-heres-how-much-you-can-expect-2873033-2026-02-23",
      "headline": "Will AI impact your appraisals this year? Here's how much you can expectArtificial intelligence is playing a growing role in shaping compensation models. Around 50 to 60% of large organisations now use data analytics when planning salaries and bonuses. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-end-after-strong-rally-but-it-stocks-limit-gains-2872953-2026-02-23",
      "headline": "Sensex, Nifty end after strong rally, but IT stocks limit gainsThe S&P BSE Sensex gained 479.95 points to end at 83,290.81, while the NSE Nifty50 added 141.75 points to close at 25,713.00."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/claiming-hra-for-rent-to-family-what-draft-tax-rules-may-change-2872936-2026-02-23",
      "headline": "Claiming HRA for rent to family? What draft tax rules may changeMany salaried employees claim HRA for rent paid to family members. While the practice remains allowed, proposed tax rules may bring an extra layer of scrutiny. Here's what could change."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/rising-gold-silver-prices-india-should-you-worry-fm-nirmala-sitharaman-rbi-governor-response-2872913-2026-02-23",
      "headline": "Should India be concerned about the rise in gold and silver prices?The Finance Minister said gold has always been a favoured investment for Indian households. Demand often rises during festival seasons such as Akshaya Tritiya and other auspicious occasions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/gurugram-surpasses-mumbai-in-rs-10-crore-plus-home-sales-in-2025-2872890-2026-02-23",
      "headline": "Big housing boost for Gurugram, overtakes Mumbai in 2025 ultra luxury salesGurugram appears to be at the centre of India's ultra-luxury housing story, and the momentum suggests that demand for high-value homes is far from slowing down."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/real-estate/story/rera-india-supreme-court-criticism-homebuyer-protection-enforcement-gap-real-estate-regulatory-body-2872866-2026-02-23",
      "headline": "Has RERA lost its bite? What homebuyers need to knowThe Supreme Court has come down hard on real estate regulatory authorities (RERA), saying they should be abolished as they appear to favour builders and have failed to protect homebuyers, which is their intended purpose."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-a-fake-itr-refund-message-led-to-a-rs-15-lakh-loss-2872863-2026-02-23",
      "headline": "How a fake ITR refund message led to a Rs 1.5 lakh lossIt started with a simple message about a pending tax refund. Within minutes, a taxpayer had lost Rs 1.5 lakh. The case reveals how scammers are exploiting refund anxiety."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/retirement-in-india-idea-corpus-inflation-omniscience-capital-study-2872864-2026-02-23",
      "headline": "Are you saving enough for retirement? Why the Rs 1 crore target is outdatedMany Indians underestimate how fast expenses rise after 60 and how long their savings must last. A new study analyses how inflation, longevity and market risks reshape the real retirement corpus you need."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/selling-your-gold-or-silver-mutual-fund-read-this-before-you-pay-tax-2872817-2026-02-23",
      "headline": "Selling your gold or silver mutual fund? Read this before you pay taxThinking of selling your gold or silver fund after the recent price rise? Before you click that sell button, have a closer look at the tax rules. Even a small timing mistake can change your tax bill significantly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/health-insurance-moratorium-period-5-years-irdai-non-disclosure-claims-rule-2872800-2026-02-23",
      "headline": "Completed 60 months of continuous cover? Your insurer may not deny your claimThe Insurance Regulatory Authority and Development Authority of India (IRDAI) has passed a historic reform cutting the moratorium period from eight years to five years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/companies/story/idfc-first-bank-rs-590-crore-fraud-haryana-government-accounts-inside-details-2872780-2026-02-23",
      "headline": "How a routine account request revealed a Rs 590-crore fraud at IDFC First BankWhat began as a simple balance check has now expanded into a Rs 590-crore reconciliation exercise, a regulatory disclosure, multiple internal meetings at the highest levels of the bank, and a sharp selloff in the lender's stock. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/idfc-first-bank-share-price-crash-frausd-disclosure-check-key-details-2872751-2026-02-23",
      "headline": "IDFC First Bank shares crash nearly 20% after Rs 590 crore fraudIDFC Bank share price hit a lower circuit shortly after the opening bell, a clear sign of the anxiety that swept through the market. Read on to find out more about the suspected fraud. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/upl-share-price-crash-today-why-is-the-stock-falling-explained-2872734-2026-02-23",
      "headline": "UPL share price tumbles 12%: Why is the stock falling today?The stock was down around 12%, sliding toward mid-Rs 600 levels on the Bombay Stock Exchange after the market opened, underscoring fresh concerns on Dalal Street about the path ahead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/why-is-stock-market-rising-today-sensex-nifty-up-nse-bse-rally-reason-us-tariff-cancel-2872724-2026-02-23",
      "headline": "Sensex jumps 500 points: Why is stock market rising today?The S&P BSE Sensex was up 630.25 points to 83,444.96, while the NSE Nifty50 gained 190.55 points to 25,761.80 as of 9:39 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-jumps-400-points-nifty-above-25650-axis-bank-gains-2-perecnt-trump-tariff-down-2872707-2026-02-23",
      "headline": "Sensex, Nifty cheers as US Supreme Court turns down Trump tariffsThe S&P BSE Sensex was up 630.25 points to 83,444.96, while the NSE Nifty50 gained 190.55 points to 25,761.80 as of 9:39 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/clean-max-enviro-energy-vs-shree-ram-twistex-ipo-where-to-invest-gmp-comparison-2872706-2026-02-23",
      "headline": "Clean Max Enviro Energy vs Shree Ram Twistex IPO: Where to invest? Check GMPFor investors looking at listing gains, the grey market premium trend offers an early signal. But the two IPOs are very different in size, structure and current sentiment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-opening-stock-market-today-us-trump-tariff-higher-rally-fii-oil-rupee-nse-bse-trading-setup-2872705-2026-02-23",
      "headline": "Sensex, Nifty today: Why stock market is likely to open higher and rallyGift Nifty futures were trading at 25,744.5 at 7:51 am. This points to the benchmark Nifty50 opening above Friday's close of 25,571.25. The Sensex had also ended last week with modest gains."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/chris-hemsworths-children-dont-find-thor-cool-actor-reveals-why-2873245-2026-02-23",
      "headline": "Chris Hemsworth's children don't find Thor cool: Actor reveals why Chris Hemsworth revealed that his children are unimpressed by his global stardom and even his role as Thor. The actor shared that while they once found it \"cool,\" they quickly lost interest when they realised he couldn't actually fly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/filmmaker-rob-reiner-son-nick-pleads-not-guilty-in-parents-fatal-stabbing-case-2873233-2026-02-23",
      "headline": "Filmmaker Rob Reiner's son pleads not guilty in parents' fatal stabbing case Nick Reiner has been held without bail since his arrest hours after Rob Reiner and his wife Michele were found dead on December 14 at their home in the upscale Brentwood section of Los Angeles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/keerthy-suresh-spends-memorable-evening-with-rekha-and-rani-mukerji-shares-pics-2873220-2026-02-23",
      "headline": "Keerthy Suresh spends memorable evening with Rekha and Rani Mukerji, shares pics Keerthy Suresh shared glimpses from a memorable evening with Rani Mukerji and Rekha, delighting fans with stylish moments from the star-studded meet-up."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/tim-burton-welcomes-winona-ryder-to-wednesday-season-3-she-fits-right-in-2873125-2026-02-23",
      "headline": "Tim Burton welcomes Winona Ryder to Wednesday Season 3: She fits right in Winona Ryder will play a guest role in Wednesday Season 3. She will be reuniting with her Beetlejuice Beetlejuice co-star Jenna Ortega in the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/zakir-khan-shares-real-reason-for-stand-up-break-no-major-health-issues-2873165-2026-02-23",
      "headline": "Zakir Khan shares real reason for stand-up break: No major health issues Zakir Khan has clarified that his break from stand-up comedy is not due to any serious health issue but to focus on writing projects and personal priorities. The comedian reassured fans that he is doing well and plans to step back from live shows for a few years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-rashmikas-udaipur-wedding-haldi-mehndi-and-sangeet-details-out-2873135-2026-02-23",
      "headline": "Rashmika-Vijay's Udaipur wedding: Haldi, mehndi and sangeet details out Rashmika Mandanna and Vijay Deverakonda are set to begin their wedding festivities in Udaipur on February 24, with an intimate mehndi ceremony. The celebrations at ITC Mementos will continue with haldi and sangeet sessions on February 25, culminating in their highly anticipated wedding on February 26."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/subedaar-trailer-out-anil-kapoor-takes-on-illegal-sand-mining-nexus-2873131-2026-02-23",
      "headline": "Subedaar trailer: Anil Kapoor takes on illegal sand mining nexus The trailer of Subedaar, starring Anil Kapoor, introduces a story set against illegal sand mining in India's heartland. Directed by Suresh Triveni, the film will premiere on Prime Video on March 5."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/toxic-fairytale-for-grown-ups-akshay-oberoi-sudev-nair-spice-up-yashs-action-world-posters-2873127-2026-02-23",
      "headline": "Toxic: Akshay Oberoi, Sudev Nair spice up Yash's action world. Check posters The makers of Yash's upcoming film Toxic: A Fairytale for Grown-Ups, have introduced two new additions to its powerful world. Akshay Oberoi and Sudev Nair are all set to play pivotal roles in the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranveer-allahbadia-john-abraham-and-sonu-nigam-called-after-latent-controversy-2873083-2026-02-23",
      "headline": "Ranveer Allahbadia: John Abraham and Sonu Nigam called after Latent controversy Ranveer Allahbadia claimed that John Abraham and many other celebrities supported him during the India's Got Latent controversy. He opened up to Farah Khan on how his career was affected during the low phase."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/triptii-dimri-birthday-celebration-bollywood-rumours-sam-merchant-2873076-2026-02-23",
      "headline": "Triptii Dimri's birthday: Cakes, candles and close moments with Sam Merchant Triptii Dimri celebrated her birthday in Mumbai with close friends and rumoured boyfriend Sam Merchant. Several pictures of the two have emerged online. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/one-battle-after-another-on-ott-when-and-where-to-watch-leonardo-dicaprios-film-2873029-2026-02-23",
      "headline": "One Battle After Another on OTT: When and where to watch Leonardo DiCaprio's film Acclaimed political action thriller One Battle After Another, directed by Paul Thomas Anderson and starring Leonardo DiCaprio, is set for its digital debut. The film's OTT release follows major wins at BAFTA 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/composer-prateek-rajagopal-on-bollywood-debut-with-tu-yaa-main-and-hollywood-dream-2873078-2026-02-23",
      "headline": "Composer Prateek Rajagopal on Bollywood debut with Tu Yaa Main and Hollywood dream After spending six years in the US, composer Prateek Rajagopal has started his journey in Indian cinema with Bejoy Nambiar's Tu Yaa Main. In an interview with India Today, he spoke about his friendship with Nambiar, Hollywood dream and why success in showbiz requires patience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/ranveer-singh-goes-to-karnataka-high-court-seeks-scrapping-of-case-against-him-for-kantaras-daiva-mimicry-2873058-2026-02-23",
      "headline": "Ranveer Singh goes to Karnataka High Court to scrap Kantara 'Daiva' mimicry case Ranveer Singh approached the Karnataka High Court, seeking to scrap the case against him for mimicking Kantara's Daiva."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/farhan-akhtar-on-playing-pandit-ravi-shankar-in-the-beatles-biopic-who-isnt-a-fan-2872981-2026-02-23",
      "headline": "Farhan Akhtar on playing Pandit Ravi Shankar in The Beatles biopic: Who isn't a fan Farhan Akhtar opened up about playing Pandit Ravi Shankar in The Beatles biopic. He also spoke about being excited over his first-time collaboration with director Sam Mendes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijays-jana-nayagan-release-delayed-certification-issues-june-2026-2872974-2026-02-23",
      "headline": "Is Vijay's Jana Nayagan eyeing June release amid censor delay? Here's what we know Vijay's Jana Nayagan faces further delay due to pending CBFC certification. The film's makers now target a new release date, coinciding with Vijay's birthday and the Muharram holiday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/manipuri-film-boong-wins-bafta-best-children-family-film-pm-modi-congratulates-2873041-2026-02-23",
      "headline": "Moment of immense joy for Manipur: PM Modi on Boong's BAFTA victory Prime Minister Modi congratulated the team of Manipuri film Boong on its historic BAFTA win, celebrating it as a proud moment for Manipur and Indian cinema. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bafta-award-boong-manipuri-regional-cinema-childrens-films-india-2872948-2026-02-23",
      "headline": "Shekhar Kapur: Boong better than main BAFTA winners, need to push Indian awards Lakshmipriya Devi's Boong received the Best Children's and Family Film honour at the BAFTA Awards. Filmmaker Shekhar Kapur voiced strong support for the film and highlighted its distinction among this year's winners."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/suriya-47-tamil-action-comedy-eccentric-police-team-nazriya-nazim-2873004-2026-02-23",
      "headline": "Aavesham director Jithu Madhavan says project with Suriya is a proper Tamil film Director Jithu Madhavan, widely known for the Malayalam hit Aavesham, confirms Suriya 47 as a proper Tamil action-comedy about an eccentric police team. The film balances humour with serious drama about crime fighting, he said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/farah-khan-google-giggle-moments-with-sundar-pichai-2873025-2026-02-23",
      "headline": "Farah Khan's Google Giggle moment with Sundar Pichai: Kunder meets Sunder Farah Khan met Google CEO Sundar Pichai during a special interaction hosted by YouTube India and later shared cheerful moments from the meeting on social media. She described it as a 'Google giggle' moment. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-ambulance-with-7-onboard-delhi-crashes-near-ranchi-in-jharkhand-was-en-route-to-delhi-2873217-2026-02-23",
      "headline": "1 killed as air ambulance with 7 on board crashes after takeoff from RanchiAn air ambulance flying from Ranchi to Delhi crashed in Jharkhand's Chatra district on Monday evening after losing contact with Air Traffic Controller at 7:34 pm. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/how-mexico-took-down-drug-lord-el-mencho-with-help-of-his-girlfriend-cjng-violence-glbs-2873218-2026-02-23",
      "headline": "How Mexico took down drug lord El Mencho with help of his girlfriendMexico's Defence Minister Ricardo Trevilla said investigators identified a trusted associate linked to one of Oseguera's partners and followed her movements to a rural compound. After she left, officials concluded the cartel leader remained inside under heavy guard and moved quickly to launch an operation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-threats-armed-intruder-shot-dead-mar-a-lago-florida-glbs-2873249-2026-02-24",
      "headline": "Don't know how long I'll be around: Trump after armed man shot dead at Mar-a-LagoAfter an armed intruder was killed breaching Mar-a-Lago security, Donald Trump said he does not know how long he will be around. Investigators identified the suspect as 21-year-old Austin Tucker Martin of North Carolina, who forced entry into the Florida resort before agents opened fire."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/lucknow/story/lucknow-son-shoots-father-exam-pressure-body-hidden-in-drum-murder-case-uttar-pradesh-2873170-2026-02-23",
      "headline": "Angry over NEET pressure, son guns down father in Lucknow, dismembers bodyA 19-year-old BCom student allegedly shot his father dead in Lucknow after repeated pressure to prepare for NEET, dismembered the body, and hid parts inside a drum at their home.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/indians-in-ireland-racial-attack-online-irish-food-bank-report-2873090-2026-02-23",
      "headline": "How a photo triggered racist tirade against Indians in IrelandAn Irish media report about a university turning away students from food bank due to rising demand has triggered racial attacks against Indians. An Irish social media user accused Indians of \"looting\" services."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/uk-news/story/lord-peter-mandelson-former-uk-envoy-to-us-arrested-on-suspicion-of-misconduct-after-epstein-revelations-2873219-2026-02-23",
      "headline": "After Andrew, UK ex-envoy arrested on suspicion of misconduct amid Epstein probeThe arrest of Peter Mandelson marks a significant development in the ongoing investigation into ties with Jeffrey Epstein. This case has sent ripples across British politics, involving high-profile figures including Prince Andrew."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-west-indies-crush-zimbabwe-india-in-trouble-hetmyer-record-fifty-2873212-2026-02-23",
      "headline": "T20 World Cup: West Indies add to India's woes with thumping win over ZimbabweWest Indies secured a commanding 107-run victory over Zimbabwe in their Super 8 T20 World Cup match at Mumbai. The victory has intensified the pressure on India, who face a challenging path ahead in the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-villa-gang-rape-case-accuses-extortion-woman-sexual-assault-police-valentines-day-party-2872995-2026-02-23",
      "headline": "She wanted sugar daddy: Bengaluru gang-rape accused alleges extortionPolice are probing competing claims in the Bengaluru villa case after an accused alleged an extortion attempt, while the woman has accused two men of gang-raping her during a Valentine's Day party. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/mexican-drug-lord-el-chapo-forbes-list-why-mexico-famous-drugs-drug-war-narcotics-location-china-connection-2872907-2026-02-23",
      "headline": "How Mexican drug lord El Chapo, the Shorty, made it to Forbes listThere is mayhem in Mexico after the killing of drug cartel chief El Mencho, which shows the immense power organised crime has in the country. One kingpin, Joaquin 'El Chapo' Guzman, even made it to Forbes' rankings. But how did Mexico become a cartel stronghold? What role did its geography and China play?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/winter-storm-us-northeast-flight-cancellations-heavy-snow-travel-restrictions-blizzard-warnings-glbs-2873248-2026-02-24",
      "headline": "Blizzard warnings, travel bans in effect as massive storm grounds 10,000 US flightsAir travel across the region was severely disrupted. More than 10,000 flights were cancelled, as airlines pre-emptively grounded aircraft ahead of the storm's peak. Monday alone accounted for over 5,000 cancellations, with more than 1,300 already scrapped for Tuesday as carriers prepared a cautious return to service."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shikhar-dhawan-slams-false-narratives-about-personal-life-after-second-marriage-2873240-2026-02-23",
      "headline": "Shikhar Dhawan slams false narratives about personal life after second marriageShikhar Dhawan has slammed people for circulating false statements about his personal life after his second marriage. Dhawan recently married his girlfriend Sophie Shine in a private ceremony."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ajit-pawar-plane-crash-controversy-ncp-mlc-amol-mitkari-set-off-controversy-as-he-links-ajit-pawar-plane-crash-to-rajiv-gandhi-assassination-2873230-2026-02-23",
      "headline": "Was pilot a suicide bomber? NCP MLC's Ajit Pawar crash claim sparks rowA political controversy has erupted in Maharashtra following allegations of a possible conspiracy behind a plane crash linked to Ajit Pawar. The issue has sparked heated debates and demands for transparency from investigating agencies across the state."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-rashmikas-udaipur-wedding-haldi-mehndi-and-sangeet-details-out-2873135-2026-02-23",
      "headline": "Rashmika-Vijay's Udaipur wedding: Haldi, mehndi and sangeet details outRashmika Mandanna and Vijay Deverakonda are set to begin their wedding festivities in Udaipur on February 24, with an intimate mehndi ceremony. The celebrations at ITC Mementos will continue with haldi and sangeet sessions on February 25, culminating in their highly anticipated wedding on February 26."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/supreme-court-gave-licence-to-terrible-things-donald-trump-on-tariff-ruling-glbs-2873089-2026-02-23",
      "headline": "Trump rants against Supreme Court's 'dumb' tariff ruling: Gave me more powersThe Supreme Court ruled 6–3 that Trump exceeded his authority by imposing broad tariffs under the International Emergency Economic Powers Act (IEEPA), a 1977 law designed for national security emergencies rather than general trade policy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/every-paisa-will-be-returned-nayab-saini-vows-action-against-any-official-involved-in-rs-590-crore-idfc-fraud-2873099-2026-02-23",
      "headline": "Every paisa will be returned: Haryana CM vows action in Rs 590-crore IDFC fraudA major financial scandal has surfaced involving a suspected Rs 590 crore fraud in Haryana government accounts at a private bank. The Chief Minister assures strict action and full recovery of public funds as investigations proceed.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/story/tamil-nadu-assembly-elections-dmk-seat-sharing-talks-congress-45-seats-mk-stalin-bjp-aiadmk-2873214-2026-02-23",
      "headline": "Deadlock continues in Tamil Nadu as Congress demands 45 seats, DMK yet to acceptSeat-sharing talks in Tamil Nadu remained inconclusive after the Congress sought 45 seats from DMK, with both parties continuing negotiations ahead of the 2026 Assembly elections. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/5-bullets-in-iit-bombay-hostel-security-breach-raises-campus-safety-concerns-at-premier-institutions-2872745-2026-02-23",
      "headline": "5 bullets in IIT hostel, one big question: Are India's top institutes truly safe?A major security breach at IIT Bombay's Powai campus has raised fresh concerns after a 23-year-old man was arrested for storing live 7.65 mm cartridges inside a hostel room. The incident highlights serious lapses in identity verification, campus access control, and surveillance systems at one of India's premier educational institutions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/uk-news/story/reform-uk-party-nigel-farage-founder-zia-yusuf-british-ice-illegal-immigration-288k-deportations-every-year-2873136-2026-02-23",
      "headline": "UK is invaded: Nigel Farage's anti-immigration party vows British version of ICEThe Nigel Farage-led Reform UK party unveiled its hardline immigration policy, vowing to set up a British version of the US' ICE agency. Party leader, Zia Yusuf, who was born to migrant parents, said they would deport up to 2,88,000 immigrants per year if elected to power."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rajagopalachari-bust-replaces-lutyens-rashtrapati-bhavan-decolonisation-push-british-architect-great-grandson-reacts-2873138-2026-02-23",
      "headline": "Lutyens bust out, Rajaji in at Rashtrapati Bhavan; architect's descendant reactsPM Modi said placing Rajagopalachari's bust where Lutyens' once stood was \"an important act of mental decolonisation\". The move, however, drew a note of regret from Lutyens' great-grandson."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/indians-in-the-us-news-atharva-shailesh-sathawane-fraudseter-elderly-victims-6-million-2872972-2026-02-23",
      "headline": "They come to steal: US radical right spews hate as Indian gets 18 years in jailAn Indian national, Atharva Shailesh Sathawane, was in January sentenced to 18 years in prison in the US for defrauding senior citizens. Nearly a month later, his case has been taken up by MAGA commenters to rail against foreign immigration and Indians in the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/india-today-daily-why-does-people-on-earth-dont-notice-the-rotation-planet-gravity-motion-observe-pendulum-show-2871581-2026-02-23",
      "headline": "Earth rotates at 1,670 km per hour, so why don't we feel it?We examine why the Earth's constant spin goes completely unnoticed by the people living on it. We think about it and then forget."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/t20-wc-why-indias-loss-to-south-africa-could-be-a-blessing-disguised-in-bruises-2872994-2026-02-23",
      "headline": "T20 WC: Why India's loss to South Africa could be a blessing disguised in bruisesFor India, the task now is to sift through the wreckage, rebuild momentum and remember that even champions must, occasionally, be humbled\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/rain-and-thunder-likely-in-several-states-on-tuesday-low-pressure-system-weakens-2873149-2026-02-23",
      "headline": "Rain and thunder likely in several states on Tuesday, fog over PunjabOn Tuesday, isolated to scattered light to moderate rainfall with thunderstorms and gusty winds is expected over Madhya Pradesh, Vidarbha and Chhattisgarh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/reducing-cutoff-does-not-affect-competence-government-to-supreme-court-amid-row-over-neet-pg-negative-scorers-2873096-2026-02-23",
      "headline": "Low cutoff doesn't imply incompetence: Government defends move amid NEET PG rowThe Health Ministry has defended the sharp reduction in NEET PG qualifying percentile, telling the Supreme Court that it \"does not certify incompetence.\" Citing over 9,600 vacant AIQ seats, including in government colleges, the Centre said MBBS qualification ensures competence and patient safety concerns are misplaced."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-women-odi-series-against-australia-world-champions-alyssa-healy-2873098-2026-02-24",
      "headline": "World champions India Women resume ODI duties in Alyssa Healy's farewell festival INDW vs AUSW: Harmanpreet Kaur's India will be taking the field for the first time as the world champions when they meet Australia in the first ODI on Tuesday in Brisbane. Alyssa Healy is also set to play in her last white-ball series for the Aussies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shikhar-dhawan-slams-false-narratives-about-personal-life-after-second-marriage-2873240-2026-02-23",
      "headline": "Shikhar Dhawan slams false narratives about personal life after second marriage Shikhar Dhawan has slammed people for circulating false statements about his personal life after his second marriage. Dhawan recently married his girlfriend Sophie Shine in a private ceremony."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-west-indies-crush-zimbabwe-india-in-trouble-hetmyer-record-fifty-2873212-2026-02-23",
      "headline": "T20 World Cup: West Indies add to India's woes with thumping win over Zimbabwe West Indies secured a commanding 107-run victory over Zimbabwe in their Super 8 T20 World Cup match at Mumbai. The victory has intensified the pressure on India, who face a challenging path ahead in the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-womens-cricket-rashid-khan-support-exile-challenges-2873183-2026-02-23",
      "headline": "How Rashid Khan lent his helping hand for Afghanistan women's team Firooza Amiri has revealed how Rashid Khan supported the Afghanistan women's team. Recently, Rashid also spoke in their favour during a press conference at the ICC Men's T20 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/england-vs-pakistan-t20-world-cup-liam-dawson-press-conference-2873155-2026-02-23",
      "headline": "England in a good place despite not being at their best: Liam Dawson before Pakistan clash T20 World Cup 2026, ENG vs PAK: Speaking to the reporters before the match against Pakistan on Tuesday, Liam Dawson said that England can play much better cricket, but are in good shape after their win against Sri Lanka. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-suspends-gianluca-prestianni-racist-abuse-vinicius-junior-champions-league-2873152-2026-02-23",
      "headline": "UEFA suspends Benfica's Prestianni for 2nd leg tie with Madrid over alleged racism UEFA has provisionally suspended Benfica's Gianluca Prestianni for Wednesday's Champions League match against Real Madrid following the alleged racist incident involving Vinicius Junior in last week's first leg."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/sahibzada-farhan-england-vs-pakistan-t20-world-cup-super-8-press-conference-2873151-2026-02-23",
      "headline": "Pakistan will give England a tough time in Super 8s: Sahibzada Farhan T20 World Cup 2026, ENG vs PAK: Speaking to the reporters, Sahibzada Farhan said that Pakistan are not bothered about their winless run against England in the history of the tournament. Pakistan have lost all three matches against the Brits in the competition. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-india-vs-south-africa-sitanshu-kotak-axar-patel-selection-2873132-2026-02-23",
      "headline": "Suryakumar and Gambhir explained Sundar's selection for SA clash to Axar: Kotak T20 World Cup: Batting coach Sitanshu Kotak said that India captain Suryakumar Yadav and head coach Gautam Gambhir spoke to Axar Patel before the Super Eight match against South Africa"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-final-karnataka-jammu-kashmir-live-streaming-2873134-2026-02-23",
      "headline": "Ranji Trophy Final, Karnataka vs Jammu and Kashmir: When and where to watch Ranji Trophy Final: Karnataka and Jammu and Kashmir are all set to lock horns in the grand finale, starting Tuesday, February 24 at the KSCA Rajnagar Stadium in Hubballi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-t20-world-cup-england-vs-pakistan-liam-dawson-presser-usman-tariq-2873121-2026-02-23",
      "headline": "England wary of Pakistan as a unit, not only spinner Usman Tariq: Liam Dawson England spinner Liam Dawson insisted his side will not be distracted by the growing hype around Pakistan's mystery spinner Usman Tariq ahead of their crucial T20 World Cup Super 8 clash in Pallekele."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sahibzada-farhan-reaction-ipl-owned-hundred-teams-pakistan-players-2873101-2026-02-23",
      "headline": "Sahibzada reacts to reports of IPL-owned Hundred teams snubbing Pakistani players Pakistani batter Sahibzada Farhan brushed aside questions related to speculation that players from his country could be ignored by at least four Indian-owned franchises in The Hundred auction, saying the matter was beyond their control."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-zimbabwe-live-score-super-8s-t20-world-cup-mumbai-2873063-2026-02-23",
      "headline": "ZIM vs WI Super 8 Highlights: West Indies hammer Zimbabwe by 107 runs in MumbaiZimbabwe (ZIM) vs West Indies (WI), T20 World Cup Super 8 Highlights: West Indies beat Zimbabwe by 107 runs at the Wankhede Stadium in Mumbai after Gudakesh Motie picked up four wickets and Shimron Hetmyer played a stupendous knock. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-cricket-tour-south-africa-2026-sandpapergate-return-smith-newlands-tests-2873035-2026-02-23",
      "headline": "Australia return for Tests in South Africa, 8 years after SandpapergateAustralia are set to tour South Africa for an ODI and Test series in September and October later this year. The Aussies have not played a series in South Africa since the infamous Sandpapergate scandal in 2018."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-final-jammu-and-kashmir-vs-karnataka-preview-predicted-xi-pitch-report-2873034-2026-02-23",
      "headline": "Jammu and Kashmir eye historic title, Karnataka target ninth crownRanji Trophy Final: Jammu and Kashmir will need to pull off a giant-sized miracle against eight-time champions Karnataka if they are to win their first-ever title over the next five days, starting Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-dragged-india-along-the-ground-insulted-them-saqlain-mushtaq-t20-world-cup-2873018-2026-02-23",
      "headline": "SA dragged India along the ground and insulted them: Former Pakistan cricketerSouth Africa handed India their first T20 World Cup defeat after 12 wins with a 76-run victory. The loss has raised questions over India's batting strategy and tournament prospects."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-daryl-mitchell-banks-on-india-second-favourite-tag-for-semi-final-push-2872921-2026-02-23",
      "headline": "New Zealand's Mitchell banks on India's '2nd favourite' tag for semi-final pushNew Zealand all-rounder Daryl Mitchell said his side was ready to embrace their tag as Indian cricket fans' \"second favourite team\" as they attempt to steer through a demanding Super Eight group and return to the semi-finals of the T20 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/vaishnavi-adkar-itf-w100-bengaluru-final-wta-top-500-breakthrough-2872949-2026-02-23",
      "headline": "Who is Vaishnavi Adkar? Pune star becomes India's No.2 with dream run in BengaluruVaishnavi Adkar had a remarkable run at the ITF Women's W100 Open in Bengaluru, finishing as the runner-up. The 21-year-old also rose to become India's No. 2 ranked player following this impressive performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-t20-world-cup-suryakumar-yadav-problems-analysis-2872893-2026-02-23",
      "headline": "South Africa expose India's real problem: Accelerators without Kohli-type engineT20 World Cup: Surya Kumar Yadav smiled at a presser. South Africa had the last laugh. India's World Cup campaign is exposing a structural flaw no amount of aggression can hide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-cupcake-ad-deleted-india-vs-south-africa-next-ad-prediction-2872895-2026-02-23",
      "headline": "Cupcake ad deleted, ego eaten: What is Star Sports serving next?T20 World Cup 2026: When the Cupcake promo disappeared after India's humbling defeat to South Africa in Ahmedabad, it symbolised more than embarrassment. The 'cupcake gate' has exposed how arrogance, hype, and disrespect have overtaken thoughtful storytelling in cricket broadcasting."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zimbabwe-vs-west-indies-super-8-preview-t20-world-cup-mumbai-2872882-2026-02-23",
      "headline": "ZIM vs WI, Super 8 preview: India watch closely as confident sides clash in MumbaiT20 World Cup 2026, West Indies vs Zimbabwe Super 8 preview: Two-time champions West Indies will look to continue their resurgent run when they face an inspired Zimbabwe side that stunned Sri Lanka and Australia last week. India, who suffered a 76-run defeat to South Africa on Sunday, will also keep a close eye on this contest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zimbabwe-captain-sikandar-raza-confident-icc-t20-world-cup-super-eights-2872869-2026-02-23",
      "headline": "Zimbabwe not worried about lack of experience in India: Raza sends Super 8 warningZimbabwe captain Sikandar Raza dismissed concerns about his team's limited recent T20I experience in India, expressing confidence that they possess the belief and capability to produce a \"top performance\" in the Super Eights of the ICC Men's T20 World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-daren-sammy-praises-zimbabwe-motivation-super-8s-performance-2872843-2026-02-23",
      "headline": "Who said Zimbabwe was not supposed to be here? Sammy reacts to Super 8 pre-seedingWest Indies head coach Daren Sammy on Sunday said Zimbabwe may have drawn extra motivation from being clubbed with higher-seeded sides Sri Lanka and Australia in Group B."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-cricket-board-pakistan-players-shadow-ban-the-hundred-indian-franchises-warning-2872842-2026-02-23",
      "headline": "ECB warns Indian-owned The Hundred teams over shadow-ban on Pakistan playersEngland Cricket Board has issued a reminder to The Hundred franchises of their obligations under anti-discrimination regulations, while reports keep emerging of Indian-owned franchises ignoring Pakistan players in the upcoming auction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ind-vs-sa-t20-world-cup-david-miller-varun-chakravarthy-plans-super-8-press-conference-ahmedabad-2872834-2026-02-23",
      "headline": "South Africa were prepared for India's Varun Chakravarthy threat: David MillerT20 World Cup: South Africa batter David Miller explained how the Proteas did their homework about facing India's spin threat Varun Chakravarthy in the Super 8 clash in Ahmedabad, which ended up paying big dividends for the side in their dominant win om Sunday. Miller voiced pride on South Africa's overall brilliance shown against the defending champions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ind-vs-sa-africa-t20-world-cup-axar-patel-snub-super-8-ryan-ten-doeschate-coach-clarifies-press-conference-2872808-2026-02-23",
      "headline": "India coach clarifies controversial Axar Patel snub after losing to South AfricaT20 World Cup: India assistant coach Ryan ten Doeschate said the Axar Patel snub was a tactical call based on match-ups and the need for extra batting depth. He insisted the decision was not a reflection of Axar's value or leadership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-super-8-mohammad-amir-abhishek-sharma-slogger-t20-world-cup-2872791-2026-02-23",
      "headline": "Mohammad Amir clarifies slogger remark, sends message to Abhishek SharmaT20 World Cup 2026: Pakistan fast bowler Mohammad Amir acknowledged that many were upset when he called Abhishek Sharma a slogger. The left-arm pacer also sent a public message to the out-of-form India opener, who struggled during India's defeat to South Africa in a Super 8 match on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-t20-world-cup-axar-patel-snub-ashwin-slams-super-8-loss-ahmedabad-2872790-2026-02-23",
      "headline": "How can you forget what Axar has done? Ashwin slams vice-captain's snub after SA lossT20 World Cup: Ravichandran Ashwin criticised India's decision to bench Axar Patel in the Super 8 defeat to South Africa. The former spinner said stability, not overthinking match-ups, wins ICC tournaments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-sa-t20-world-cup-super-8-ahmedabad-chase-virat-kohli-miss-2872755-2026-02-23",
      "headline": "Missed Virat Kohli? When India went searching for 300 in a 188-run chaseIND vs SA, T20 World Cup Super 8: This wasn't about Virat Kohli's absence. It was about India's absence of game awareness, as poor decisions, rigid tactics, and reckless batting turned a manageable chase into humiliation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-t20-world-cup-cupcake-ad-taken-off-ahmedabad-loss-super-8-2872733-2026-02-23",
      "headline": "T20 World Cup: Cringe cupcake ad taken off after India lose to South AfricaT20 World Cup: A pre-match cupcake ad mocking South Africa resurfaced after India's 76-run loss in Ahmedabad. The defeat not only dented pride but also left India's semi-final hopes hanging by Net Run Rate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-t20-world-cup-tilak-varma-disappointed-sunil-gavaskar-batting-approach-ahmedabad-2872702-2026-02-23",
      "headline": "Tilak Varma disappointed me: Sunil Gavaskar slams batter's approach in SA lossT20 World Cup: Sunil Gavaskar questioned Tilak Varma's shot selection after India's heavy Super 8 defeat to South Africa. The former captain felt the chase required patience, not early risk-taking."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-david-miller-t20-world-cup-they-are-beatable-post-match-press-confernece-ahmedabad-loss-2872683-2026-02-23",
      "headline": "Showed that India is beatable: David Miller proud of South Africa's Super 8 winT20 World Cup: David Miller said South Africa proved India are beatable after their 76-run Super 8 win in Ahmedabad. The Proteas veteran credited discipline, experience and sticking to simple plans for the statement victory."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}