{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mygate-founder-abhishek-kumar-work-as-guard-why-rs-1600-crore-valuation-iit-iim-graduate-2756521-2025-07-16",
      "headline": "Why this IITian took up a guard's job to build Mygate, valued at Rs 1,600 croreMyGate has raised a total of $83.3 million across eight rounds. Its latest funding was in April 2023, a Series B round worth $3.29 million, putting its valuation at Rs 1,670 crore, according to Tracxn."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-model-y-in-india-elon-musk-key-challenges-what-next-for-ev-maker-2756518-2025-07-16",
      "headline": "Tesla is finally in India. But can it go the distance?Tesla's India debut is a big milestone, but long-term success will depend on how well the company adapts to India's unique mix of pricing realities, policy expectations, and market dynamics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/are-private-school-fees-draining-indian-middle-class-ca-shares-eye-opening-figures-2756494-2025-07-16",
      "headline": "Are private school fees draining India's middle class? CA shares eye-opening figuresWith fees climbing each year, parents are feeling the pinch more than ever. Maybe now is the right moment to pause, think, and ask ourselves, are we getting real value for this cost? Can we secure our kids' future without spending a fortune on fees? asks a Delhi-based CA."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/ssy-scheme-how-your-daughter-can-get-rs-71-lakh-at-21-sukanya-samriddhi-yojana-government-scheme-2756448-2025-07-16",
      "headline": "SSY scheme: How your daughter can get Rs 71 lakh at 21It is a small savings scheme backed by the government, which offers high interest rates, tax benefits under Section 80C, and tax-free returns on maturity. Over 4.1 crore accounts have been opened so far under this scheme."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/hdfc-bank-share-holders-good-news-soon-bonus-issue-special-interim-dividend-2756447-2025-07-16",
      "headline": "Good news soon for HDFC Bank shareholders? Here's all you need to knowHDFC Bank shares have delivered a 24% gain over the past year, with a year-to-date rise of nearly 13%. The stock has climbed more than 21% over the last six months, posting gains of 7% over the past three months and 4% in the previous month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/ashok-leyland-share-price-bonus-issue-not-down-50-percent-down-2756443-2025-07-16",
      "headline": "Did Ashok Leyland shares fall over 50% today? Details hereThe steep drop is the result of the company's 1:1 bonus issue, which came into effect on Wednesday. When a stock goes \"ex-bonus,\" its price adjusts to reflect the additional shares being issued. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-69-points-lower-nifty-below-25200-hdfc-bank-up-1-percent-2756420-2025-07-16",
      "headline": "Sensex opens 69 points lower, Nifty below 25,200; HDFC Bank up 1%The S&P BSE Sensex was down by 197.64 points to 82,373.27, while the NSE Nifty50 lost 61.80 points to 25,134.00 as of 9:28 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/anthem-biosciences-ipo-day-3-last-day-bidding-today-latest-subscription-gmp-listing-allotment-2756419-2025-07-16",
      "headline": "Anthem Biosciences IPO to close for bidding: Check latest subscription, GMPThis IPO is entirely an offer for sale (OFS) of 5.96 crore equity shares by existing shareholders. The company itself will not receive any money from this offer. The price band has been set at Rs 570 per share."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-revamp-pmo-clearance-changes-report-cess-rationalisation-meeting-august-2756402-2025-07-16",
      "headline": "Big GST changes ahead? Centre signals green light, says reportThe Prime Minister's Office (PMO) has given an in-principle nod to a revamp of the GST structure, paving the way for possible reforms in the upcoming GST Council meeting scheduled for August."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/theobroma-sold-chryscapital-buyer-two-sisters-how-it-started-mumbai-bakery-cafe-cake-brownie-2756217-2025-07-15",
      "headline": "The Theobroma story: How 2 sisters turned a cafe into 225-store pan-India chainPrivate equity firm ChrysCapital has struck a sweet deal to acquire a 90% stake in Theobroma Foods for Rs 2,410 crore. The bakery chain, started by two sisters in Mumbai, has grown into a 225-store brand loved for its brownies and cakes. Read on to know more about the Mumbai-based bakery chain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mtnl-misses-rs-8585-crore-payments-owes-7-public-sector-banks-2756159-2025-07-15",
      "headline": "MTNL misses Rs 8,585 crore payments, owes 7 public sector banksIn a filing on Tuesday, MTNL confirmed that it has defaulted on both principal and interest payments to a group of lenders, which include some of India's biggest state-owned banks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-317-points-higher-nifty-above-25100-hcltech-down-3-2756116-2025-07-15",
      "headline": "Sensex ends 317 points higher, Nifty above 25,100; HCLTech down 3%The S&P BSE Sensex added 317.45 points to end at 82,570.91, while the NSE Nifty50 was up 113.50 points to close at 25,195.80. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/nitesh-tiwari-ramayana-aims-to-redefine-world-perception-of-india-producer-namit-malhotra-2756524-2025-07-16",
      "headline": "Ramayana aims to redefine world's perception of India: Producer Namit MalhotraProducer Namit Malhotra discussed his vision for Nitesh Tiwari's 'Ramayana'. Malhotra said he wanted to centre Indian culture internationally, and decided to change Western perception of India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/lewis-hamilton-dior-collection-bts-jimin-instagram-2756519-2025-07-16",
      "headline": "Lewis Hamilton shares Jimin's Dior look, fans call it best crossover momentFormula 1 legend Lewis Hamilton shared a photo of BTS' Jimin dressed in an outfit from his Dior collection. The post sent fans into a frenzy online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kamal-haasan-meets-rajinikanth-mp-rajya-sabha-oath-taking-ceremony-2756528-2025-07-16",
      "headline": "Kamal Haasan meets friend Rajinikanth ahead of Rajya Sabha oath taking ceremonyActor-politician Kamal Haasan met his dear friend Rajinikanth at his Chennai home on Wednesday. This meeting comes days ahead of the 'Thug Life' actor's oath-taking ceremony as a Rajya Sabha member."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/manisha-koirala-gets-honorary-doctorate-from-university-of-bradford-2756493-2025-07-16",
      "headline": "Manisha Koirala gets honorary doctorate from University of Bradford, shares videoManisha Koirala was awarded an honorary doctorate by the University of Bradford. She also paid an emotional tribute to her late grandmother, whom she called her 'first teacher.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/selena-gomez-to-marry-benny-blanco-in-september-ceremony-report-2756474-2025-07-16",
      "headline": "Selena Gomez to marry Benny Blanco in September ceremony: ReportSinger Selena Gomez and her boyfriend Benny Blanco are reportedly planning a September wedding in Montecito, California. The wedding invitations have been sent out to their close friends and family. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/archana-puran-singh-and-family-fall-victim-to-online-scam-during-dubai-trip-2756472-2025-07-16",
      "headline": "Archana Puran Singh and family fall victim to online scam during Dubai tripArchana Puran Singh shared in her vlog that she and her family were scammed while booking indoor skydiving tickets in Dubai through a fake website. Despite paying a hefty amount, no reservation was found, leaving the family shocked and disappointed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actor-ram-pothineni-debuts-as-lyricist-with-andhra-king-taluka-2756495-2025-07-16",
      "headline": "Actor Ram Pothineni debuts as lyricist with Andhra King TalukaTelugu actor Ram Pothineni is making his debut as a lyricist by penning the first single for his upcoming movie 'Andhra King Taluka'. With music by Anirudh Ravichander, the song will release on July 18, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-casual-walk-chennai-before-coolie-release-photo-goes-viral-2756482-2025-07-16",
      "headline": "Rajinikanth takes morning stroll in Chennai before Coolie release, pic goes viralSuperstar Rajinikanth was seen going on a casual morning walk in Chennai. A photo of the actor is now going viral on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sidharth-malhotra-kiara-advani-announce-birth-of-baby-girl-our-world-has-changed-2756457-2025-07-16",
      "headline": "Sidharth-Kiara announce birth of baby girl in sweet post: Our world forever changedKiara Advani and Sidharth Malhotra became parents to a baby girl. On Wednesday morning, the couple shared the good news with the world, and expressed just how excited and happy they felt. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mohit-suri-backs-sandeep-reddy-vanga-says-we-make-his-films-controversial-2756454-2025-07-16",
      "headline": "Mohit Suri backs Sandeep Reddy Vanga, says we make his films controversialFilmmaker Mohit Suri has come out in support of 'Animal' director Sandeep Reddy Vanga, calling himself a fan and defending his storytelling style. He said the controversies around Vanga's films are often audience-created."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/martin-scorsese-emmy-acting-nomination-the-studio-apple-tv-comedy-2756424-2025-07-16",
      "headline": "Emotional Martin Scorsese shares joy of first Emmy nod with daughter FrancescaDirector Martin Scorsese received his first Emmy nomination for acting in the comedy series - 'The Studio'. His daughter Francesca Scorsese shared a heartfelt moment reflecting on the veteran's reaction to the new milestone."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/director-mohit-suri-on-not-returning-for-aashiqui-3-2756434-2025-07-16",
      "headline": "They don't want to employ me: Director Mohit Suri on not returning for Aashiqui 3Director Mohit Suri shared he hasn't been approached to direct 'Aashiqui 3', despite expressing interest in reuniting with the original lead pair. He cited creative challenges and industry decisions as reasons behind his absence from the sequel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-and-twinkle-khanna-enjoy-cricket-date-at-lords-cricket-ground-london-2756416-2025-07-16",
      "headline": "Akshay Kumar and Twinkle Khanna enjoy cricket date at Lord's, shares photosAkshay Kumar and Twinkle Khanna made a stylish appearance at Lord's Cricket Ground during the India vs England Test match. Twinkle shared a few glimpses with her humorous take on the sport. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/emmy-nominations-2025-squid-game-patrick-schwarzenegger-snubbed-2756423-2025-07-16",
      "headline": "2025 Emmy nominations: Squid Game, Patrick Schwarzenegger among major snubsThe 77th Primetime Emmy nominations have been announced with popular shows like 'Squid Game' Season 2 and Renée Zellweger's TV-movie portrayal notably missing from the list. Fans expressed their disappointment as some major performances and shows were overlooked in this year's race."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/bajrangi-bhaijaan-2-director-kabir-khan-confirms-talks-with-salman-khan-2756408-2025-07-16",
      "headline": "Salman Khan's Bajrangi Bhaijaan 2 in works? Director confirms talks with actorDirector Kabir Khan has confirmed that he and Salman Khan are in talks for 'Bajrangi Bhaijaan 2', but they are waiting for the right story before moving forward. The director emphasised that the sequel would only be made to honour the original's legacy, not just for box office success."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/karnataka-cinema-ticket-price-cap-rs-200-regional-films-2756406-2025-07-16",
      "headline": "Karnataka brings back Rs 200 cap for regional cinema in multiplexesKarnataka has re-introduced a Rs 200 cap on cinema ticket prices. This move could encourage audiences to visit theatres, potentially increasing attendance amidst past resistance from multiplexes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ravi-teja-father-rajagopal-raju-dies-at-90-2756397-2025-07-16",
      "headline": "Telugu actor Ravi Teja's father dies at 90Telugu actor Ravi Teja's father, Rajagopal Raju, died at the age of 90 on Tuesday. More details on the funeral and cremation are awaited."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/abhishek-bachchan-shoutout-to-amitabh-bachchan-2756392-2025-07-16",
      "headline": "Boss is back: Abhishek's shoutout to father Amitabh Bachchan with new KBC promoAbhishek Bachchan gave a special shoutout to his father, Amitabh Bachchan, by sharing the latest promo of Kaun Banega Crorepati. The new season premieres on August 11 on Sony Entertainment Television and SonyLIV."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nysa-devgn-viral-dance-ajay-devgn-son-of-sardaar-2-orry-mrunal-thakur-2756383-2025-07-16",
      "headline": "Nysa-Orry mimic Ajay Devgn's viral 'Pehla Tu' step, fans call it best video everNysa Devgn recreated her father Ajay Devgn's viral dance move from 'Son of Sardaar 2' with Orhan Awatramani aka Orry. Internet users were taken by surprise seeing Nysa's effortless charm."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/massive-protest-outside-odisha-assembly-over-students-self-immolation-police-use-tear-gas-water-cannons-2756480-2025-07-16",
      "headline": "Tear gas, water cannon as protest rocks Odisha over student's self-immolationA massive protest took place outside Odisha Assembly on Wednesday morning over the female student's self-immolation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/millions-dead-aadhaar-still-active-rti-finds-only-115-crore-cards-deactivated-2756437-2025-07-16",
      "headline": "Millions dead, Aadhaar still active: RTI finds only 1.15 crore cards deactivatedDespite over 83 lakh deaths recorded annually, UIDAI's cumbersome, certificate-dependent process has led to less than 10% of estimated deaths, resulting in Aadhaar deactivation, raising risks of misuse."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-writes-to-pm-modi-jammu-kashmir-statehood-bill-parliament-session-2756540-2025-07-16",
      "headline": "Rahul Gandhi writes to PM, requests J&K statehood bill in Monsoon sessionRahul Gandhi writes to PM, requests J&K statehood bill in Monsoon session"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/sunil-chhetri-isl-uncertain-future-statement-bengaluru-fc-indian-football-2756537-2025-07-16",
      "headline": "Sunil Chhetri's first reaction over ISL's uncertain future: Very concerningSunil Chhetri urged calm and unity across Indian football as uncertainty looms over the ISL's future, expressing faith in the AIFF and FSDL to find a solution that protects the sport's growth and stability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-india-boeing-787-ahmedabad-crash-demand-cockpit-video-recorders-debate-safety-vs-privacy-2756086-2025-07-16",
      "headline": "Why no cameras in cockpits? Air India crash sparks debate, demandThe fuel-switch report in the Air India Boeing 787 crash probe has sparked a demand for a cockpit video recorder. The NTSB of the US that probes air crashes has for years batted for one. If cockpit voice recorders are part of the black boxes of planes, what has kept cockpit video recorders, which would aid air crash investigations, from being installed?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/odisha-balasore-student-sexual-harassment-self-immolation-complaint-committee-report-2756484-2025-07-16",
      "headline": "Not a child to understand what favour I need, Odisha professor 'told' studentThe internal complaint committee had advised the professor, accused of sexually harassing the student who died after setting herself on fire, to modify his behaviour and teaching methods."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/nato-chief-warns-india-china-brazil-of-100-secondary-sanctions-over-russia-trade-glbs-2756349-2025-07-16",
      "headline": "If you're Prime Minister of India and...: Nato's warning over buying Russian oilMark Rutte warned the leaders of China, India, and Brazil that if they continued trading with Russia and buying its oil and gas, he would impose 100 per cent secondary sanctions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/kota-how-indias-coaching-capital-collapsed-2756180-2025-07-15",
      "headline": "Kota: How India's coaching capital collapsedThe government is now intent on an education that promotes critical thinking rather than the rote learning coaching institutes foster\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/samosa-jalebi-and-a-side-of-perspective-not-every-treat-needs-a-warning-label-health-ministry-food-fssai-2756532-2025-07-16",
      "headline": "Samosa, Jalebi and a side of perspective: Not every treat needs a warning labelAs the Health Ministry opts for gentle 'oil and sugar' advisory boards over harsh labels, perhaps the real question isn't whether Indian treats are the problem but what we're conveniently ignoring on our globalised plates"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/30-year-old-nri-arrested-in-hit-and-run-death-of-legendary-marathoner-fauja-singh-in-punjab-2756384-2025-07-16",
      "headline": "NRI arrested in hit-and-run death of legendary marathoner Fauja SinghDuring police questioning, NRI Amritpal Singh Dhillon revealed that he was returning from Mukerian after selling his phone when his vehicle struck 114-year-old athlete Fauja Singh near Bias Pind."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-lords-test-day-5-siraj-bowled-bashir-analysis-luck-2756387-2025-07-16",
      "headline": "The ball that bowled Siraj in Lord's Test: A freak delivery and pure bad luckEngland vs India: In a surreal final twist at Lord's, Mohammed Siraj was bowled by a delivery from Shoaib Bashir that spun off the pitch, the bat, and then the pitch again - a freak dismissal that defied cricketing logic. Siraj's gritty 30-ball stay ended when he was bowled as England went on to win a thriller by 22 runs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-model-y-in-india-elon-musk-key-challenges-what-next-for-ev-maker-2756518-2025-07-16",
      "headline": "Tesla is finally in India. But can it go the distance?Tesla's India debut is a big milestone, but long-term success will depend on how well the company adapts to India's unique mix of pricing realities, policy expectations, and market dynamics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sidharth-malhotra-kiara-advani-announce-birth-of-baby-girl-our-world-has-changed-2756457-2025-07-16",
      "headline": "Sidharth-Kiara announce birth of baby girl in sweet post: Our world forever changedKiara Advani and Sidharth Malhotra became parents to a baby girl. On Wednesday morning, the couple shared the good news with the world, and expressed just how excited and happy they felt. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/chief-of-defence-staff-anil-chauhan-operation-sindoor-pakistan-drones-intact-indigenous-weapons-2756504-2025-07-16",
      "headline": "Some Pak drones were found intact during Op Sindoor: Chief of Defence StaffAnil Chauhan, Chief of Defence Staff, said on Wednesday that some of the drones shot by Pakistan towards India during the four-day conflict after Operation Sindoor were found intact, implying that they may have not even functioned."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/odisha-student-self-immolation-case-father-conspiracy-balasore-college-death-2756501-2025-07-16",
      "headline": "She was killed: Odisha student's father alleges conspiracy behind self-immolationA 20-year-old Odisha student died after setting herself on fire on campus, accusing her professor of sexual harassment. Her father has called it murder, alleging she was forced to end her life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/was-air-india-crash-mechanical-accidental-or-faqs-answered-2756089-2025-07-15",
      "headline": "Was Air India crash mechanical, accidental or…? FAQs answeredThe preliminary crash probe report has raised critical questions around how fuel supply to the engines got cut off. INDIA TODAY looks at the scenarios\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/i-listen-to-music-every-day-while-working-music-productivity-side-effects-of-earbuds-2754428-2025-07-16",
      "headline": "I can't work without my earphones, but is it harming my ears?Earbuds and earphones have become a workday essential, and going a day without them feels almost impossible. But wearing them for long hours, snugly tucked into our ears, could be quietly setting the stage for an infection."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/were-getting-access-trump-says-india-trade-deal-is-near-glbs-2756361-2025-07-16",
      "headline": "What Trump said on trade talks with India as August 1 deadline loomsUS President Donald Trump updated on America's ongoing trade talks with India, showing hope and confidence, ahead of August 1, when his steep tariffs will come into effect."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/video/what-india-gained-from-shubhanshu-shuklas-historic-space-mission-2756465-2025-07-16",
      "headline": "What India gained from Shubhanshu Shukla's historic space missionShubhanshu Shukla has made history as the first Indian to live and work aboard the International Space Station and only the second Indian to travel into space, following Rakesh Sharma's 1984 mission."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maharashtra-minister-nitesh-rane-marathi-madrasas-azaan-language-row-controversy-2756451-2025-07-16",
      "headline": "Maharashtra minister calls for Marathi in madrasas: All one gets there is a gunAmid a simmering language row in Maharashtra, Nitesh Rane emphasised that Marathi should be taught in madrasas so that 'real education happens there'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bengaluru-auto-driver-helps-complete-reddit-user-solo-date-kind-act-returned-keys-indiranagar-church-street-2756458-2025-07-16",
      "headline": "Bengaluru auto driver's kind act helps complete Reddit user's perfect solo dateThe Reddit post titled \"A day out in Bengaluru on a Monday\" chronicled the experience of a user who has been living in the city for around three years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-revamp-pmo-clearance-changes-report-cess-rationalisation-meeting-august-2756402-2025-07-16",
      "headline": "Big GST changes ahead? Centre signals green light, says reportThe Prime Minister's Office (PMO) has given an in-principle nod to a revamp of the GST structure, paving the way for possible reforms in the upcoming GST Council meeting scheduled for August."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/prada-team-visits-kolhapur-meet-local-artisans-after-kolhapuri-sandals-row-2756336-2025-07-16",
      "headline": "Prada team visits Kolhapur, meets local artisans after Kolhapuri sandals rowThe visit comes after Prada faced criticism for allegedly showcasing Kolhapuri-style sandals in its Spring/Summer 2026 menswear show in Milan."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/history-sheeter-murdered-outside-bangalore-home-former-minister-byrathi-basavaraj-named-accused-2756439-2025-07-16",
      "headline": "Man with criminal record murdered in Bengaluru, FIR names BJP MLA as accusedA 40-year-old history-sheeter was killed near his home in Bengaluru. An FIR names former Karnataka Minister and BJP MLA Byrathi Basavaraj as an accused in the murder case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/nitesh-tiwari-ramayana-aims-to-redefine-world-perception-of-india-producer-namit-malhotra-2756524-2025-07-16",
      "headline": "Ramayana aims to redefine world's perception of India: Producer Namit MalhotraProducer Namit Malhotra discussed his vision for Nitesh Tiwari's 'Ramayana'. Malhotra said he wanted to centre Indian culture internationally, and decided to change Western perception of India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kamal-haasan-meets-rajinikanth-mp-rajya-sabha-oath-taking-ceremony-2756528-2025-07-16",
      "headline": "Kamal Haasan meets friend Rajinikanth ahead of Rajya Sabha oath taking ceremonyActor-politician Kamal Haasan met his longtime friend and actor Rajinikanth at the latter's Chennai home on Wednesday. The meeting happened days ahead of Haasan's oath-taking ceremony as a Rajya Sabha member."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/manisha-koirala-gets-honorary-doctorate-from-university-of-bradford-2756493-2025-07-16",
      "headline": "Manisha Koirala gets honorary doctorate from University of Bradford, shares videoManisha Koirala was awarded an honorary doctorate by the University of Bradford. She also paid an emotional tribute to her late grandmother, whom she called her 'first teacher.'"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/archana-puran-singh-and-family-fall-victim-to-online-scam-during-dubai-trip-2756472-2025-07-16",
      "headline": "Archana Puran Singh and family fall victim to online scam during Dubai tripArchana Puran Singh shared in her vlog that she and her family were scammed while booking indoor skydiving tickets in Dubai through a fake website. Despite paying a hefty amount, no reservation was found, leaving the family shocked and disappointed."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/sunil-chhetri-isl-uncertain-future-statement-bengaluru-fc-indian-football-2756537-2025-07-16",
      "headline": "Sunil Chhetri's first reaction over ISL's uncertain future: Very concerningSunil Chhetri urged calm and unity across Indian football as uncertainty looms over the ISL's future, expressing faith in the AIFF and FSDL to find a solution that protects the sport's growth and stability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-docked-two-wtc-points-slow-over-rate-lords-test-2756513-2025-07-16",
      "headline": "England penalised two WTC points for slow overrate in Lord's Test against IndiaEngland have been docked two ICC World Test Championship points for a slow over rate in the Lord's Test against India. This penalty has pushed England down to third place, affecting their championship hopes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/pv-sindhu-early-exit-japan-open-2025-lakshya-sen-satwik-chirag-win-2756506-2025-07-16",
      "headline": "Japan Open 2025: PV Sindhu crashes out in opening roundPV Sindhu's struggles continued as the two-time Olympic medallist crashed out in the first round of the Japan Open 2025 Super 750 tournament. In contrast, Lakshya Sen and the men's doubles pair of Satwiksairaj Rankireddy and Chirag Shetty registered commanding straight-game victories to advance to the second round."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/stuart-macgill-cocaine-conviction-anxiety-family-impact-cricket-coaching-2756492-2025-07-16",
      "headline": "Stuart MacGill breaks silence on life after cocaine case: Worried for my kidsFormer Australian spinner Stuart MacGill has opened up about the toll of his legal troubles on his life and family. He reveals how anxiety and isolation have affected him and his children while he tries to rebuild through cricket coaching."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/satwik-chirag-lakshya-sen-badminton-japan-open-second-round-2756478-2025-07-16",
      "headline": "Satwik-Chirag, Lakshya Sen cruise into second round of Japan Open 2025India's campaign at the Japan Open 2025 began on a high note, with Satwik-Chirag and Lakshya Sen cruising into the second round after impressive straight-game wins in their respective men's doubles and singles matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rocky-flintoff-andrew-flintoff-the-hundred-wilcard-northern-superchargers-2756468-2025-07-16",
      "headline": "Andrew Flintoff drafts son Rocky as wilcard for Northern SuperchargersAndrew Flintoff's 17-year-old son Rocky has joined his dad's team, Northern Superchargers, as a wildcard pick for The Hundred 2025 — just days after scoring a century against India U-19 in a Youth ODI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zak-crawley-poor-form-boycott-calls-dropping-ahead-of-ashes-2756445-2025-07-16",
      "headline": "Crawley has learned nothing in 57 Tests: Boycott wants England to drop openerFormer England cricketer Geoffrey Boycott has called for Zak Crawley to be dropped after a series of disappointing performances. After a steady 65 in the first Test at Headingley, Crawley has struggled to maintain form, managing only 19, 0, 18, and 22 in his subsequent innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-ravi-shastri-missed-chances-lords-test-2756442-2025-07-16",
      "headline": "India could have been 3-0 up with a bit of luck in England series: Ravi ShastriFormer India head coach Ravi Shastri believes that, with a touch more luck, India might have taken a commanding 3-0 lead in the ongoing five-match Test series against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-karun-nair-dismissal-lords-test-turning-point-ajinkya-rahane-2756440-2025-07-16",
      "headline": "Karun Nair's dismissal was turning point in Lord's Test: Ajinkya RahaneAjinkya Rahane called Karun Nair's second-innings dismissal the turning point in the Lord's Test, as India's chase lost momentum following his LBW, opening the door for England to claw back into the match.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/thiago-almada-atletico-madrid-transfer-botafogo-2756431-2025-07-16",
      "headline": "Atletico Madrid agree deal to sign Argentina's Thiago Almada from BotafogoAtletico Madrid have confirmed an agreement to sign Argentina midfielder Thiago Almada from Brazilian club Botafogo, pending the player's medical examination and contract signing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-test-retirement-not-bcci-decision-rajeev-shukla-2756411-2025-07-16",
      "headline": "Kohli, Rohit retired on own will, BCCI has no role: Rajeev ShuklaBCCI vice-president Rajeev Shukla has set the record straight on Rohit Sharma and Virat Kohli's Test retirements, stating that the BCCI had no influence, and that both legends made the decision entirely on their own terms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zak-crawley-poor-form-boycott-calls-dropping-ahead-of-ashes-2756445-2025-07-16",
      "headline": "Crawley has learned nothing in 57 Tests: Boycott wants England to drop openerFormer England cricketer Geoffrey Boycott has called for Zak Crawley to be dropped after a series of disappointing performances. After a steady 65 in the first Test at Headingley, Crawley has struggled to maintain form, managing only 19, 0, 18, and 22 in his subsequent innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-ravi-shastri-missed-chances-lords-test-2756442-2025-07-16",
      "headline": "India could have been 3-0 up with a bit of luck in England series: Ravi ShastriFormer India head coach Ravi Shastri believes that, with a touch more luck, India might have taken a commanding 3-0 lead in the ongoing five-match Test series against England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-karun-nair-dismissal-lords-test-turning-point-ajinkya-rahane-2756440-2025-07-16",
      "headline": "Karun Nair's dismissal was turning point in Lord's Test: Ajinkya RahaneAjinkya Rahane called Karun Nair's second-innings dismissal the turning point in the Lord's Test, as India's chase lost momentum following his LBW, opening the door for England to claw back into the match.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/thiago-almada-atletico-madrid-transfer-botafogo-2756431-2025-07-16",
      "headline": "Atletico Madrid agree deal to sign Argentina's Thiago Almada from BotafogoAtletico Madrid have confirmed an agreement to sign Argentina midfielder Thiago Almada from Brazilian club Botafogo, pending the player's medical examination and contract signing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-test-retirement-not-bcci-decision-rajeev-shukla-2756411-2025-07-16",
      "headline": "Kohli, Rohit retired on own will, BCCI has no role: Rajeev ShuklaBCCI vice-president Rajeev Shukla has set the record straight on Rohit Sharma and Virat Kohli's Test retirements, stating that the BCCI had no influence, and that both legends made the decision entirely on their own terms."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}