{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/titan-share-price-down-3-percent-q2fy25-net-profit-falls-buy-or-sell-stock-analyst-views-2628906-2024-11-06",
      "headline": "Titan share price falls 3% after disappointing Q2 results. Buy or sell?At 11:15 am, shares of Titan were down 2.80% at Rs 3,142.50 on the Bombay Stock Exchange (BSE)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gail-share-price-surges-6-percent-strong-q2-results-bullish-brokerage-views-target-price-2628894-2024-11-06",
      "headline": "GAIL share price surges 6% after Q2 results. Will stock climb further?At 11 am, GAIL's share price was up 6.24% at Rs 208.65 on the Bombay Stock Exchange (BSE). This is a positive sign for the stock after it declined significantly over the past month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hindustan-zinc-share-price-today-dips-8-percent-government-stake-sale-ofs-2628880-2024-11-06",
      "headline": "Explained: Why Hindustan Zinc share price plunged 8% todayAt 10:45 am, Hindustan Zinc shares were down 7.71% to Rs 516.30 on the Bombay Stock Exchange (BSE). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-sensex-nifty-it-stocks-us-elections-titan-stock-price-tumbles-2628868-2024-11-06",
      "headline": "Sensex, Nifty gain as IT stocks gain amid US elections; Titan tumbles 3%The BSE Sensex was up 251.87 points to 79,728.50 points at 10:31 am, while the NSE Nifty rose 74,20 points to trade at 24,287.50."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-price-today-record-high-75000-dollars-for-first-time-us-elections-donald-trump-win-2628860-2024-11-06",
      "headline": "Bitcoin price hits record $75,000 for the first time. Here's whyFor much of the year, Bitcoin had been trading within a narrowband below $70,000, but election-day developments have driven fresh interest in the asset."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/swiggy-ipo-opens-subscription-day-1-subscribe-latest-gmp-zomato-comparison-brokerage-view-2628708-2024-11-06",
      "headline": "Swiggy IPO opens today: Is it worth subscribing? All you need to knowAs Swiggy's IPO opens for subscription, investors must decide: will this food delivery giant serve up solid returns or leave them disappointed?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/onion-prices-to-drop-in-3-to-4-days-boost-pulse-production-government-intervention-2628499-2024-11-05",
      "headline": "Onion prices to drop in 3-4 days; steps taken to boost pulse productionThe red onion crop is already reaching Nashik mandi and onions from Alwar are set to arrive in Delhi and other northern markets by Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-nifty-financial-stocks-gain-volatility-2628462-2024-11-05",
      "headline": "Sensex, Nifty rebound sharply as financial stocks gain amid volatilityThe NSE Nifty 50 rose 217.95 to end at 24,213.3, while the BSE Sensex gained 694.39 points, closing at 79,476.63. Both benchmarks had fallen by about 0.6% during the session before a strong rally in the final hours of trading."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-shares-below-ipo-price-rs-76-after-8-percent-drop-lock-in-period-expiry-2628445-2024-11-05",
      "headline": "Ola Electric shares tumble 8% to fall below IPO price. Buy, sell or hold?Ola Electric Mobility's share price dropped 8% in today's session, falling below its IPO price as the three-month lock-in period expired."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/swiggy-ipo-vs-zomato-stock-expert-insights-valuation-comparison-and-more-2628430-2024-11-05",
      "headline": "Swiggy IPO: Should you subscribe or buy Zomato stock?Swiggy's IPO opens tomorrow: Should you subscribe or invest in Zomato's stock? Here's what experts have to say. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/swiggy-ipo-opening-latest-gmp-subscribe-or-not-brokerage-views-key-details-2628349-2024-11-05",
      "headline": "Swiggy IPO: Should you subscribe as GMP declines ahead of opening? Swiggy IPO: Some brokerages recommend subscription, arguing that the pricing appears fair in comparison to competitors, while others caution against investing due to the company's reported negative cash flows and ongoing losses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tilaknagar-industries-share-price-20-percent-increase-all-time-high-q2-results-2628325-2024-11-05",
      "headline": "Why Tilaknagar Industries share price gained 20% to hit all-time high todayTilaknagar Industries share price: The company's stock price surged during today's trading session after it reported strong Q2FY25 results. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/premier-energies-share-price-jumps-7-percent-order-wins-key-factors-2628319-2024-11-05",
      "headline": "Premier Energies share price jumps nearly 7% today. Know whyPremier Energies share price has risen 37% since getting listed on the stock market in September. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/orient-technologies-share-price-jumps-16-percent-interim-dividend-board-meeting-key-details-2628310-2024-11-05",
      "headline": "Explained: Why Orient Technologies share price jumped 16% today The jump in share price follows the company's announcement of a board meeting scheduled for November 11, 2024, where directors will review the unaudited financial results for the quarter and half-year ended September 30, 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-elections-donald-trump-victory-impact-dalal-street-stock-market-sensex-nifty-explained-2628286-2024-11-05",
      "headline": "US elections: What a Donald Trump victory could mean for Dalal StreetWith the stage set for the US elections, could a Donald Trump win spark a bullish turn for the Indian stock market, or will uncertainty keep investors on edge?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/maruti-suzuki-retail-sales-november-wedding-season-inventory-2628278-2024-11-05",
      "headline": "Why Maruti Suzuki is counting on lakhs of weddings in NovemberWith impressive sales figures from October, Maruti Suzuki is optimistic that the upcoming wedding season will sustain its sales momentum in November."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sagility-india-ipo-day-1-should-you-subscribe-or-skip-check-key-details-gmp-2628228-2024-11-05",
      "headline": "Sagility India IPO Day 1: Should you subscribe or skip? Check key details, GMPSagility India IPO: Before its launch, Sagility India was trading at a premium of Rs 3 in the grey market, indicating neutral investor demand. However, the GMP has now dipped to Rs 0. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/irctc-share-price-dips-post-q2-results-interim-dividend-record-date-2628222-2024-11-05",
      "headline": "Explained: Why IRCTC share price dipped in early trade after Q2 resultsIRCTC's share price fell as much as 3% in early trade before making a comeback. At 10:40 am, shares of IRCTC were trading 0.82% higher at Rs 822.90. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-news-sensex-nifty-irctc-investor-sentiment-caution-us-presidential-elections-2628211-2024-11-05",
      "headline": "Sensex, Nifty dip as investors remain cautious ahead of US electionsThe S&P BSE Sensex was down 125.73 points to 78,656.51 at 10:17 am, while the NSE Nifty50 fell 36.20 points to trade at 23,959.15 points."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-nifty-volatility-us-elections-experts-2627851-2024-11-04",
      "headline": "Sensex, Nifty tumble ahead of US elections; Hero MotoCorp falls 4%The NSE Nifty 50 dropped by 321.20 points to settle at 23,983.15, while the BSE Sensex fell 941.88 points to 78,782.24. Most of the broader market indices also declined sharply during the session."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/us-presidential-election-results-donald-trump-kamala-harris-polling-counting-votes-republican-democrat-swing-states-2628784-2024-11-06",
      "headline": "Donald Trump smells win, takes 2 swing states, Kamala Harris skips speechUS Election Result 2024: Republican Donald Trump takes a strong lead with projected wins in 25 states, securing 246 electoral votes. Vice President Kamala Harris is hot on his heels with 210 electoral votes as the results roll in."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/us-election-2024-voting-result-live-updates-donald-trump-kamala-harris-tim-walz-jd-vance-white-house-2628341-2024-11-05",
      "headline": "Live: Trump wins Pennsylvania, projects Fox News, 3 electoral votes away presidencyUS Presidential Election Result Live Updates: Kamala Harris and Donald Trump, the two contenders for the 2024 US presidential election, wrapped up their electoral campaigns on Monday night, paving the way for Americans to cast their ballots in one of the most anticipated polls in the country. While Trump, the Republican contender, is attempting to win a second stint at the White House, Harris -- the incumbent Vice President and Democratic nominee -- is vying to create history by becoming first female President of the US. The 7 battleground states of Arizona, Nevada, Georgia, North Carolina, Wisconsin, Michigan and Pennsylvania will play a key role in deciding the fate of Harris and Trump. The two will need at least 270 electoral votes to win the presidency. Voting began at 4.30 pm (IST) on Tuesday and will continue until around 6.30 am (IST) on Wednesday morning. Follow indiatoday.in for live updates on the presidential election."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/us-election-results-trump-address-supporters-kamala-harris-howard-university-2628903-2024-11-06",
      "headline": "'You won't hear from Vice President tonight': Harris skips speech as hopes dimUS election results 2024: With projections showing Kamala Harris trailing, the mood among students, faculty and alumni at Howard University became sombre."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/elon-musk-sink-white-house-donald-trump-us-president-election-2628918-2024-11-06",
      "headline": "Let that sink in: Elon Musk recalls Twitter takeover moment with White House twistLet that sink in: Trump fan Elon Musk as Republican takes big lead"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/us-election-results-2024-donald-trump-similarities-with-indian-election-narratives-illegal-immigration-threat-to-democracy-evm-malfunction-2628914-2024-11-06",
      "headline": "Not India but Indiana. Why US polls are sounding like an Indian electionFrom democracy khatre me to doubts over EVMs to fears over illegal immigrants and citizenship, the 2024 US presidential election is sounding very similar to a general election in India. There are uncanny similarities as the third rock from Sun shrinks in global issues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/us-presidential-election-republicans-flip-one-senate-seat-deadlock-chamber-voting-ends-polls-2628820-2024-11-06",
      "headline": "Republicans seize control of US Senate for first time in four yearsThe unexpected battleground of Nebraska pushed Republicans over the top. Incumbent Republican Senator Deb Fischer brushed back a surprisingly strong challenge from independent newcomer Dan Osborn."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/us-election-results-donald-trump-kamala-harris-leads-swing-states-2628872-2024-11-06",
      "headline": "All over for Harris? '300 paar' for Trump if he holds on to leads in these statesUS election results: In the US presidential election, 270 electoral college votes are required to win the White House race. As per Associated Press trends, Trump is leading in five swing states."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-rise-of-monopoly-groups-decimating-india-businesses-2628835-2024-11-06",
      "headline": "New breed of monopolists deciding what you read, watch: Rahul GandhiRahul Gandhi said the rise of a new breed of monopolists has led to the decimation of lakhs of businesses, making it difficult to generate jobs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/us-presidential-elections-elon-musk-shows-confidence-of-donald-trump-victory-over-kamala-harris-race-to-white-house-2628892-2024-11-06",
      "headline": "Game set, match: Elon Musk as Trump leads Harris in White House raceTesla CEO and US billionaire Elon Musk has exuded confidence of Donald Trump's win in the US Presidential polls, as the early projections showed him ahead of Kamala Harris."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/sathyabamas-rise-building-a-stronger-future-2625146-2024-10-29",
      "headline": "Sathyabama's RISE - Building a Stronger FutureSathyabama Institute of Science and Technology stands out as a beacon of educational excellence and social responsibility. Under the visionary leadership of Chancellor Dr. Mariazeena Johnson, this institution is redefining what it means to be a premier university in India, transforming lives through both world-class education and impactful community initiatives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/us-elections-donald-trump-kamala-harris-7-swing-states-pennsylvania-michigan-nevada-wisconsin-arizona-north-carolina-georgia-2628824-2024-11-06",
      "headline": "Harris vs Trump: Who is leading in swing states as battle intensifies?Kamala Harris was leading in the swing state of Pennsylvania since the results started coming out. However, she lost the lead to Trump, who is now ahead by roughly two percentage points. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/swiggy-ipo-opens-subscription-day-1-subscribe-latest-gmp-zomato-comparison-brokerage-view-2628708-2024-11-06",
      "headline": "Swiggy IPO opens today: Is it worth subscribing? All you need to knowAs Swiggy's IPO opens for subscription, investors must decide: will this food delivery giant serve up solid returns or leave them disappointed?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/food/story/shalini-passi-secret-diet-skin-hair-teeth-fabulous-lives-vs-bollywood-wives-2626377-2024-11-06",
      "headline": "Shalini Passi's secret diet for that skin, hair, teeth: A shot of ghee and goat curdFrom numerous juices and soups to goat curd, Shalini Passi's diet is as bold and vibrant as her larger-than-life personality. The Fabulous Lives vs Bollywood Wives star tells all in an exclusive interview with India Today Digital."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/kamala-harris-wins-california-which-has-most-number-of-electoral-college-votes-report-us-networks-2628838-2024-11-06",
      "headline": "Kamala Harris wins Golden State California that has maximum electoral college votesDonald Trump is currently ahead in the US Presidential polls. He is leading with 230 electoral votes, as per early projections, while Kamala Harris has 179 electoral votes to her name. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/pennsylvania-election-result-live-update-us-presidential-election-donald-trump-kamala-harris-2628768-2024-11-06",
      "headline": "Pennsylvania Result Live: Donald Trump projected to win key swing statePennsylvania Election Results 2024: After trailing Kamala Harris in early trends in Pennsylvania, Republican Donald Trump pulled ahead of her, maintaining his narrow lead over the Democratic candidate with most of the ballots counted. With 19 electoral votes, Pennsylvania becomes the critical battleground for Trump and Harris. This Rust Belt seat is the largest and most hotly contested of the swing states, pivotal for both candidates' paths to the White House. Trump's return campaign has focused on revitalising his 2016 strategies that secured wins in key states, while Harris has aimed to solidify the Democratic stronghold established by President Joe Biden in 2020. As the nation watches closely for the outcome, stay tuned to IndiaToday.in as we bring all the latest from Pennsylvania. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-indian-railways-is-pushing-to-stay-on-top-of-festive-season-rush-2628476-2024-11-05",
      "headline": "How Indian Railways is pushing to stay on top of festive season rushWith 65 per cent more special trains scheduled than last year, October was hectic; the next challenge: the swarm of post-Diwali and Chhath returnees"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-auction-rishabh-shreyas-among-23-indians-with-rs-2-crore-base-price-2628870-2024-11-06",
      "headline": "Rishabh Pant, Shreyas Iyer among 23 Indians with Rs 2 crore base priceIPL Auction: 23 Indian stars registered themselves in the highest bracket of Rs 2 crore in the 2025 auction. Amongst the 23 were Rishabh Pant, Shreyas Iyer and Ishan Kishan, who were released recently from their respective franchises."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/us-election-result-2024-donald-trump-vs-kamala-harris-who-has-won-which-state-2628869-2024-11-06",
      "headline": "Donald Trump vs Kamala Harris: Who has won which state? Republican Donald Trump is looking to become only the second President to win a non-consecutive term in the Oval Office, Harris is eyeing history by becoming the first woman President of the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-florida-voters-reject-ballot-overturn-abortion-ban-republican-democratic-2628810-2024-11-06",
      "headline": "Ballot measure to overturn abortion ban rejected in Florida, passed in 3 statesThe Florida measure failed to clear the required 60% voter approval threshold to pass constitutional amendments in Florida. Most states require a simple majority."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/amazon-mandates-5-days-of-work-from-office-tells-unhappy-employees-to-seek-other-jobs-2628827-2024-11-06",
      "headline": "Amazon mandates 5 days of work from office, tells unhappy employees to seek other jobsAmazon mandates a five-day office workweek starting January, urging employees valuing remote work to seek other opportunities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ranbir-kapoor-sai-pallavi-ramayana-officially-announced-release-in-2-parts-2628896-2024-11-06",
      "headline": "Ranbir Kapoor-Sai Pallavi's Ramayana officially announced, to release in 2 partsThe epic drama Ramayana, directed by Nitesh Tiwari, will be released in two parts in 2026 and 2027. Ranbir Kapoor will play Lord Ram, Sai Pallavi will portray Sita, and Yash will essay the role of Ravana."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/us-presidential-election-live-updates-north-carolina-swing-state-kamala-harris-donald-trump-sun-belt-2628765-2024-11-06",
      "headline": "Donald Trump wins North Carolina, first of seven swing statesNorth Carolina Election Result 2024 Live Updates: The 2024 presidential election in North Carolina has been a highly anticipated contest between Republican presidential candidate Donald Trump and Democratic nominee Kamala Harris. As a pivotal battleground state with 16 electoral votes, North Carolina's outcome is crucial in influencing the overall election results. Trump's campaign has centred on the economy, immigration, and crime, while Harris has emphasised strengthening the care economy, protecting abortion rights, and defending democratic values. Stay tuned for more updates on IndiaToday.in."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/us-election-results-2024-president-donald-trump-america-second-civil-war-kamala-harris-democrats-republicans-capitol-hill-2628898-2024-11-06",
      "headline": "Amid US election, Americans were readying for second Civil WarMany Americans feared a second Civil War if Donald Trump, the Republican candidate, lost the 2024 US presidential election. Thousands were preparing for it and created 'survivalist retreats'. Indicating the chance of violence, pro-Trump far-right groups said they were \"prepared to do what it takes\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/benjamin-netanyahu-israel-war-defence-minister-yaov-gallant-2628744-2024-11-05",
      "headline": "Netanyahu fires Israel Defence Minister Yoav Gallant over 'crisis of trust'Israel's Prime Minister Benjamin Netanyahu has dismissed Defence Minister Yoav Gallant over a \"crisis of trust\" and appointed Foreign Minister Israel Katz to succeed him as the new Defence Minister."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/baby-john-poster-rajinikanth-vettaiyan-poster-copied-2628916-2024-11-06",
      "headline": "Is Baby John's poster copied from Rajinikanth's Vettaiyan? Internet think soVarun Dhawan, Keerthy Suresh and Jackie Shroff are gearing up for the release of Baby John. Internet has found out that Baby John's poster is a copy of Vettaiyan's poster."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/lady-gaga-mark-ruffalo-jennifer-aniston-votes-us-presidential-polls-kamala-harris-donald-trump-2628907-2024-11-06",
      "headline": "Lady Gaga to Jennifer Aniston: Celebs who voted in US presidential pollsA large number of Hollywood stars came forward to cast their votes in the US presidential elections. They shared pictures on social media posts to inspire others to do the same."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ranbir-kapoor-sai-pallavi-ramayana-officially-announced-release-in-2-parts-2628896-2024-11-06",
      "headline": "Ranbir Kapoor-Sai Pallavi's Ramayana officially announced, to release in 2 partsThe epic drama Ramayana, directed by Nitesh Tiwari, will be released in two parts in 2026 and 2027. Ranbir Kapoor will play Lord Ram, Sai Pallavi will portray Sita, and Yash will essay the role of Ravana."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/reality-tv/story/bigg-boss-18-sara-khan-vivan-dsena-past-marriage-ex-wife-vahbiz-dorabjee-salman-khan-2628873-2024-11-06",
      "headline": "BB 18 Day 29: Sara Khan comments on Vivan's past, says 'his ex-wife warned me'In the latest episode of Bigg Boss 18, Sara Khan commented on actor Vivian Dsena's marriage. She shared how his ex-wife Vahbiz Dorabjee had earlier warned her about his behaviour. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nathan-mcsweeney-australia-a-vs-india-a-border-gavaskar-trophy-2024-25-2628913-2024-11-06",
      "headline": "Nathan McSweeney to audition for India Test series by opening for Australia ANathan McSweeney will be opening for Australia A in the second unofficial Test vs India A at the Melbourne Cricket Ground."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-champions-league-real-madrid-vs-ac-milan-carlo-ancelotti-reaction-2628911-2024-11-06",
      "headline": "Carlo Ancelotti concerned over Real Madrid's poor form: Team is not playing wellReal Madrid manager Carlo Ancelotti has voiced his concerns following the team's rare consecutive defeats, including a recent loss to AC Milan. The team faces defensive issues and is struggling to maintain a top-eight spot in the Champions League."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/thomas-draca-italian-player-registers-for-ipl-2025-mega-auction-2628883-2024-11-06",
      "headline": "Thomas Draca becomes first player from Italy to register for IPL 2025 auctionItalian cricketer Thomas Draca has become the first player from Italy to register himself for the upcoming IPL 2025 mega auction. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-auction-rishabh-shreyas-among-23-indians-with-rs-2-crore-base-price-2628870-2024-11-06",
      "headline": "Rishabh Pant, Shreyas Iyer among 23 Indians with Rs 2 crore base priceIPL Auction: 23 Indian stars registered themselves in the highest bracket of Rs 2 crore in the 2025 auction. Amongst the 23 were Rishabh Pant, Shreyas Iyer and Ishan Kishan, who were released recently from their respective franchises."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/ronaldo-on-target-as-al-nassr-thrash-titleholders-al-ain-in-afc-champions-league-2628858-2024-11-06",
      "headline": "Ronaldo on target as Al-Nassr thrash titleholders Al-Ain in AFC Champions LeagueCristiano Ronaldo's goal helped Al-Nassr secure a commanding 5-1 win against defending champions Al-Ain, putting their opponents' knockout hopes in jeopardy. Al-Nassr now sits comfortably in third place in their group as the tournament progresses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sa-vs-ind-abhishek-sharma-yuvraj-singh-6-sixes-durban-2628848-2024-11-06",
      "headline": "Abhishek Sharma promises to make Yuvraj Singh proud at his '6-sixes' venue DurbanIndian young batting sensation Abhishek Sharma recalled Yuvraj Singh's 6 sixes upon his arrival at Durban ahead of the first T20I vs South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-test-series-gary-stead-mantra-whitewash-2628846-2024-11-06",
      "headline": "Fire a shot, get on front foot: Gary Stead on how New Zealand whitewashed IndiaNew Zealand coach Gary Stead revealed his side's mantra and how they were able to whitewash India in the recently-concluded Test series. New Zealand secured a historic series win in India with a commanding performance in all 3 matches. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/david-warner-named-new-sydney-thunder-skipper-days-after-captaincy-ban-lifted-2628822-2024-11-06",
      "headline": "David Warner named new Sydney Thunder skipper days after captaincy ban liftedDavid Warner has been appointed as the captain of Sydney Thunder for the upcoming Big Bash League season. This decision follows Cricket Australia's recent lifting of Warner's captaincy ban, imposed after the 2018 Sandpaper-gate scandal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-champions-league-manchester-united-new-boss-ruben-amorim-manchester-city-thrashing-sporing-cp-2628814-2024-11-06",
      "headline": "Manchester United cannot play the way Sporting CP does: New boss Ruben AmorimRuben Amorim has claimed that he cannot transport one reality to another and said that Manchester United cannot play the way Sporting CP does. Sporting thrashed Manchester City 4-1 in the Champions League on November 5, Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-pakistan-josh-inglis-named-captain-3rd-odi-t20i-series-pat-cummins-2628802-2024-11-06",
      "headline": "AUS vs PAK: Josh Inglis named Australia captain for 3rd ODI, T20I seriesJosh Inglis steps up as Australia's captain for the T20I series against Pakistan and the final ODI match, as key Test players focus on the Border-Gavaskar Trophy. Inglis takes over from Pat Cummins, leading a squad bolstered by new inclusions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-champions-league-ruben-amorims-sporting-thrash-manchester-city-ac-milan-beat-real-madrid-2628795-2024-11-06",
      "headline": "Ruben Amorim's Sporting thrash Manchester City, AC Milan beat Real MadridRuben Amorim got a perfect home send off by Sporting CP as they thrashed Manchester City 4-1, courtesy of a Victor Gyokeres hat-trick. Real Madrid's poor form in the Champions League continued on November 5, Tuesday as they were beaten 3-1 by AC Milan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-new-zealand-test-series-gary-stead-mantra-whitewash-2628846-2024-11-06",
      "headline": "Fire a shot, get on front foot: Gary Stead on how New Zealand whitewashed IndiaNew Zealand coach Gary Stead revealed his side's mantra and how they were able to whitewash India in the recently-concluded Test series. New Zealand secured a historic series win in India with a commanding performance in all 3 matches. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/david-warner-named-new-sydney-thunder-skipper-days-after-captaincy-ban-lifted-2628822-2024-11-06",
      "headline": "David Warner named new Sydney Thunder skipper days after captaincy ban liftedDavid Warner has been appointed as the captain of Sydney Thunder for the upcoming Big Bash League season. This decision follows Cricket Australia's recent lifting of Warner's captaincy ban, imposed after the 2018 Sandpaper-gate scandal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-champions-league-manchester-united-new-boss-ruben-amorim-manchester-city-thrashing-sporing-cp-2628814-2024-11-06",
      "headline": "Manchester United cannot play the way Sporting CP does: New boss Ruben AmorimRuben Amorim has claimed that he cannot transport one reality to another and said that Manchester United cannot play the way Sporting CP does. Sporting thrashed Manchester City 4-1 in the Champions League on November 5, Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-pakistan-josh-inglis-named-captain-3rd-odi-t20i-series-pat-cummins-2628802-2024-11-06",
      "headline": "AUS vs PAK: Josh Inglis named Australia captain for 3rd ODI, T20I seriesJosh Inglis steps up as Australia's captain for the T20I series against Pakistan and the final ODI match, as key Test players focus on the Border-Gavaskar Trophy. Inglis takes over from Pat Cummins, leading a squad bolstered by new inclusions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-champions-league-ruben-amorims-sporting-thrash-manchester-city-ac-milan-beat-real-madrid-2628795-2024-11-06",
      "headline": "Ruben Amorim's Sporting thrash Manchester City, AC Milan beat Real MadridRuben Amorim got a perfect home send off by Sporting CP as they thrashed Manchester City 4-1, courtesy of a Victor Gyokeres hat-trick. Real Madrid's poor form in the Champions League continued on November 5, Tuesday as they were beaten 3-1 by AC Milan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-successfully-trials-ai-tool-to-curb-abuse-in-womens-cricket-2628742-2024-11-05",
      "headline": "ICC successfully trials AI tool to curb abuse in women's cricket The ICC has completed a ground-breaking AI-powered social media moderation trial to eliminate abuse in the women's game. The trial was conducted during the T20 Women's World Cup in the UAE. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/all-round-team-effort-helps-u-mumba-seal-win-over-dabang-delhi-kc-2628737-2024-11-05",
      "headline": "All-round team effort helps U Mumba seal win over Dabang Delhi K.C.U Mumba clinched a thrilling win over Dabang Delhi K.C., with standout performances from Amirmohammad Zafardanesh, Manjeet, and Rohit Raghav sealing a 32-26 victory, despite a fierce comeback attempt from Yogesh and Ashu Malik in the final moments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/michael-vaughan-reveals-what-india-requires-to-win-test-series-vs-australia-2628733-2024-11-05",
      "headline": "Michael Vaughan reveals what India requires to win Test series vs AustraliaMichael Vaughan felt that for India to win the Test series against Australia, Virat Kohli and Rohit Sharma's form would be the key. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/david-beckham-wishes-virat-kohli-happy-birthday-shares-wankhede-ton-throwback-2628702-2024-11-05",
      "headline": "David Beckham wishes Virat Kohli happy birthday, shares Wankhede ton throwbackDavid Beckham extended his heart-warming birthday wish to Virat Kohli as the star India batter turned 36. Beckham wished to meet Kohli again on his next trip to India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-series-arshdeep-singh-record-t20is-2628701-2024-11-05",
      "headline": "Arshdeep Singh eyes Bhuvneshwar Kumar's all-time India record in T20IsSA vs IND: Arshdeep Singh, the fourth-highest wicket-taker for India in Men's T20Is, is on the cusp of a couple of records in the upcoming four-match series against South Africa. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rinku-singh-buys-lavish-bungalow-in-aligarh-after-being-retained-by-kkr-for-rs-13-cr-2628676-2024-11-05",
      "headline": "Rinku Singh buys bungalow in Aligarh after being retained by KKR for Rs 13 crRinku Singh bought a lavish bungalow in Aligarh after he was retained by Kolkata Knight Riders for Rs 13 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-vs-bangladesh-odi-series-squads-live-streaming-shanto-rashid-khan-2628637-2024-11-05",
      "headline": "Afghanistan vs Bangladesh ODI series Live Streaming: Squads, all you need to knowAFG vs BAN: Najmul Hossain Shanto's Bangladesh and Hashmatullah Shahidi's Afghanistan are all set to lock horns in a three-match ODI series from November 6 onwards. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dont-judge-gautam-gambhirs-commitment-sunil-joshi-defends-team-india-head-coach-2628642-2024-11-05",
      "headline": "Don't judge Gautam Gambhir's commitment: Sunil Joshi defends Team India head coachSunil Joshi came out in defence of Gautam Gambhir amid growing criticism over his coaching. India suffered a 0-3 clean-sweep against New Zealand on their home soil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-series-arshdeep-singh-record-t20is-2628701-2024-11-05",
      "headline": "Arshdeep Singh eyes Bhuvneshwar Kumar's all-time India record in T20IsSA vs IND: Arshdeep Singh, the fourth-highest wicket-taker for India in Men's T20Is, is on the cusp of a couple of records in the upcoming four-match series against South Africa. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rinku-singh-buys-lavish-bungalow-in-aligarh-after-being-retained-by-kkr-for-rs-13-cr-2628676-2024-11-05",
      "headline": "Rinku Singh buys bungalow in Aligarh after being retained by KKR for Rs 13 crRinku Singh bought a lavish bungalow in Aligarh after he was retained by Kolkata Knight Riders for Rs 13 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-vs-bangladesh-odi-series-squads-live-streaming-shanto-rashid-khan-2628637-2024-11-05",
      "headline": "Afghanistan vs Bangladesh ODI series Live Streaming: Squads, all you need to knowAFG vs BAN: Najmul Hossain Shanto's Bangladesh and Hashmatullah Shahidi's Afghanistan are all set to lock horns in a three-match ODI series from November 6 onwards. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dont-judge-gautam-gambhirs-commitment-sunil-joshi-defends-team-india-head-coach-2628642-2024-11-05",
      "headline": "Don't judge Gautam Gambhir's commitment: Sunil Joshi defends Team India head coachSunil Joshi came out in defence of Gautam Gambhir amid growing criticism over his coaching. India suffered a 0-3 clean-sweep against New Zealand on their home soil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-auction-jeddah-players-register-south-africa-2628641-2024-11-05",
      "headline": "1574 players register for IPL 2025 mega auction: ExplainedA total of 1574 players have registered for the Indian Premier League (IPL) 2025 auction to be held in Jeddah, Saudi Arabia on November 24 and 25. South Africa and Australia are on top of the list with 91 and 76 players respectively. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-mega-auction-venue-jeddah-date-last-minute-venue-change-2628636-2024-11-05",
      "headline": "Jeddah to host IPL 2025 auction on November 24 and 25 after late venue changeAfter a last-minute venue change, the Saudi Arabian city Jeddah has been chosen to host the Indian Premier League 2025 mega auction. The much-anticipated auction will be held on November 24 and 25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/imane-khelif-man-leaked-medical-report-martina-navratilova-reaction-2628628-2024-11-05",
      "headline": "Imane Khelif gender row reignited. Navratilova reacts to 'leaked medical report'Media reports alleged that Algerian boxer Imane Khelif, a Paris Olympics champion, is biologically male based on leaked medical findings. The reports claim Khelif possesses XY chromosomes and male anatomical characteristics, sparking renewed debate about her eligibility to compete in women's boxing. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/brett-lee-reveals-how-harbhajan-singh-annoyed-the-pacer-hated-bowling-to-him-2628619-2024-11-05",
      "headline": "Brett Lee reveals how Harbhajan Singh 'annoyed' the pacer: Hated bowling to himBrett Lee revealed how Harbhajan Singh used to annoy him while batting and that he hated  bowling to him. The duo were part of many memorable matches between India and Australia. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}