{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-record-highs-jumps-600-points-crosses-25000-first-time-2602473-2024-09-19",
      "headline": "Sensex jumps over 700 points, Nifty crosses 25,500 for 1st time; IT stocks gainThe S&P BSE Sensex was up 758.7 points at 83,706.93 at 9:41 am, while the NSE Nifty50 gained 215.40 points to trade at 25,592.95. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-fed-slashes-rates-by-50-bps-in-first-rate-reduction-since-2020-2602387-2024-09-18",
      "headline": "US Fed slashes rates by 50 bps in first rate reduction since 2020Policymakers see the Fed's benchmark rate falling by another half of a percentage point by the end of this year, another full percentage point in 2025, and by a final half of a percentage point in 2026 to end in a 2.75 per cent-3.00 per cent range."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-fed-rate-decision-live-news-updates-today-at-1130-pm-5-things-to-watch-out-2602214-2024-09-18",
      "headline": "US Fed rate decision today at 11:30 pm – 5 things to watch outMarkets are widely expecting a 25-basis-point cut in the key interest rate, marking the first reduction in four years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tupperware-files-for-bankruptcy-chapter-11-once-household-name-struggles-to-stay-afloat-2602163-2024-09-18",
      "headline": "Tupperware, once a household name, files for bankruptcyTupperware Brands and some of its subsidiaries filed for Chapter 11 bankruptcy protection on Tuesday. The company, widely known for its food storage containers, has been struggling with falling sales in recent years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nps-vatsalya-explained-details-how-to-invest-eligibility-criteria-online-buying-guide-2602103-2024-09-18",
      "headline": " NPS Vatsalya: How to invest, eligibility criteria, and online buying guideNPS Vatsalya enables parents or guardians to open a pension account for minors and contribute as little as Rs 1,000 annually, making it accessible to families from various economic backgrounds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/it-stocks-profit-booking-us-fed-rate-cut-decision-explained-2602086-2024-09-18",
      "headline": "Explained: Why IT stocks faced profit booking ahead of US Fed rate decisionMphasiS led the decline, dropping 5.6%, followed by L&T Technology Services, Persistent Systems, Tata Consultancy Services, HCL Technologies, and Tech Mahindra, which saw losses ranging from 3% to 4%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-fall-amid-profit-booking-in-it-stocks-tcs-shares-fall-4-percent-2602047-2024-09-18",
      "headline": "Sensex, Nifty fall amid profit booking in IT stocks; TCS falls 4%The S&P BSE Sensex closed 131.43 points down at 82,948.23, whille the NSE Nifty50 lost 41 points to end at 25,377.55. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-infra-shares-hit-20-upper-circuit-whats-next-2602045-2024-09-18",
      "headline": "Reliance Infra shares hit 20% upper circuit. What's next? The sharp uptick in Reliance Infra's share price followed the company's announcement of a significant reduction in its standalone external debt, from Rs 3,831 crore to Rs 475 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-shares-cross-rs-700-for-the-first-time-since-january-more-room-to-rise-2602021-2024-09-18",
      "headline": "Paytm shares cross Rs 700 for the first time since January. More room to rise?\tBefore today, the last time Paytm traded above Rs 700 was in late January, closing at Rs 761."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/radhika-gupta-edelweiss-mutual-fund-calls-sips-new-status-symbol-for-delhis-young-investors-2602010-2024-09-18",
      "headline": "Radhika Gupta calls SIPs the new status symbol for Delhi's young investorsRadhika Gupta, MD and CEO of Edelweiss Mutual Fund, believes that the true indicator of success in today's financial landscape should be how much one invests in Systematic Investment Plans (SIPs), not the number of real estate holdings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-assures-no-price-hikes-for-essential-commodities-wheat-rice-sugar-edible-oils-festive-season-2601992-2024-09-18",
      "headline": "Government assures no price hikes for essential commodities this festive seasonThe Ministry of Food and Consumer Affairs has highlighted that, as of now, there are no plans to allow any increase in prices for essentials items."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-shares-dip-after-multibagger-rally-buy-hold-or-sell-2601951-2024-09-18",
      "headline": "Bajaj Housing Finance shares dip after multibagger rally: Buy, hold, or sell?After a stellar market debut, Bajaj Housing Finance shares have dipped today—should investors be concerned or hold steady?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/west-bengal-gdp-decline-per-capita-income-eac-pm-working-paper-2601914-2024-09-18",
      "headline": "How West Bengal lost its crown as India's financial hubFrom economic powerhouse to struggling state, West Bengal's fall from its prime spot in India's financial scene tells a story of lost opportunity and shifting fortunes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-fed-rate-likely-to-cut-it-sector-effect-key-stocks-to-watch-infosys-tech-mahindra-wipro-2601908-2024-09-18",
      "headline": "Infosys, TCS, Wipro: Key stocks to watch as US Fed gets ready to cut ratesHistorically, a Fed rate cut cycle has often signalled the end of a period of high demand for IT services exports, leading to an economic slowdown."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-hit-all-time-high-after-early-dip-ola-electric-shares-up-4-percent-2601842-2024-09-18",
      "headline": "Sensex, Nifty hit all-time high after early dip; Ola Electric shares up 4%The S&P BSE Sensex added 188.33 points to 83,267.99, while the NSE Nifty50 gained 46.90 points to 25,465.45"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/spicejet-yet-to-pay-rs-350-crore-in-tds-pf-of-employees-2601826-2024-09-18",
      "headline": "SpiceJet yet to pay Rs 350 crore in TDS, PF of employeesSpiceJet has not paid Rs 220 crore in TDS deductions from employees' salaries between April 2020 and August 2023 to tax authorities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-richest-and-poorest-states-south-leads-gdp-race-west-bengal-stumbles-2601807-2024-09-18",
      "headline": "India's richest and poorest states: South leads GDP race, West Bengal stumblesWhile the southern states have emerged as major contributors to India's GDP, states like West Bengal, once economically strong, have witnessed a puzzling decline, according to a working paper released by the Economic Advisory Council to the Prime Minister."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nps-vatsalya-to-be-introduced-today-check-scheme-details-benefits-and-more-2601793-2024-09-18",
      "headline": "NPS Vatsalya to be introduced today: Check scheme details, benefits and moreThe scheme, announced during the Budget in July 2024, is designed for parents and guardians to make long-term investments for their minor children.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/centre-asks-edible-oil-industry-to-maintain-prices-amid-duty-hike-on-imports-2601782-2024-09-18",
      "headline": "Centre asks edible oil industry to maintain prices amid duty hike on importsThe leading edible oil associations were advised to ensure that the MRP of each type of oil is maintained until stocks imported at 0% and 12.5% BCD are exhausted. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-open-flat-ahead-of-us-feds-rate-decision-bajaj-finance-jumps-2601780-2024-09-18",
      "headline": "Sensex, Nifty open flat ahead of US Fed's rate decision; Bajaj Finance jumps The S&P BSE Sensex was up 27.55 points to 83,107.21 at 10:23 am, while the NSE Nifty50 rose 0.90 points to trade at 25,419.65."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/lebanon-hezbollah-walkietalkie-explosions-deaths-pager-blasts-israel-2602443-2024-09-19",
      "headline": "Hezbollah walkie-talkie blasts kill 20, raise fears of wider Israel conflict Live UpdatesWednesday's walkie-talkie blasts came as Israeli Defence Minister Yoav Gallant announced a \"new phase in the war\" against the Hamas militant group, adding that the \"centre of gravity\" is moving north with the deployment of a new military division."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/japan-icom-hezbollah-walkie-talkie-blasts-sales-discontinued-lebanon-explosions-2602451-2024-09-19",
      "headline": "Japan firm says production of devices used in Lebanon blasts discontinued in 2014The device in question, which requires batteries that were discontinued nearly a decade ago, has also been out of production since 2014, according to Icom. The company is currently investigating the reports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-defence-minister-khawaja-asif-kashmir-election-article-370-congress-alliance-2602483-2024-09-19",
      "headline": "Pak minister on Article 370 restoration: On same page with Congress alliancePakistani defence minister Khawaja Asif said there was a 'high chance' that the Congress-National Conference alliance would come to power in Jammu and Kashmir."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/atishi-delhi-chief-minister-cabinet-oath-september-21-lieutenant-governor-accepts-proposal-2602509-2024-09-19",
      "headline": "Atishi to take oath as Delhi Chief Minister on September 21: AAPAccording to sources in the Aam Aadmi Party, initially, it was decided that only Aatishi would take oath as Delhi Chief Minister. However, it was later decided that her council of ministers would also take the oath with her."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/beauty/story/how-much-hair-colour-is-too-much-hair-colour-2601978-2024-09-19",
      "headline": "How much hair colour is too much hair colour?Thinking about booking another hair colour appointment at the salon? Before you do, take a moment to consider where to draw the line for the sake of your hair's health."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/canada-news/story/canada-justin-trudeau-international-student-permits-reduction-immigration-foreign-workers-2602416-2024-09-19",
      "headline": "Trudeau uses 'bad actors' grounds to further cut international study permitsIn its announcement on Wednesday, the Canadian government also said that it would also tighten rules for foreign worker rules in an effort to reduce the number of temporary residents in the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/tirupati-laddu-was-prepared-using-animal-fat-says-chandrababu-naidu-sri-venkateswara-temple-andhra-pradesh-2602421-2024-09-19",
      "headline": "Chandrababu Naidu claims animal fat used in Tirupati laddoo, YSR Congress deniesSpeaking at the NDA legislature party meeting, N Chandrababu Naidu said that Tirupati laddoo was made with substandard ingredients and animal fat was used instead of ghee during its preparation during YSR Congress's government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/video/donald-trump-calls-covid-19-china-virus-2602510-2024-09-19",
      "headline": "Watch: Trump again calls Covid-19 China virus, says it came from Wuhan labRepublican nominee Donald Trump called Covid-19, the China virus, while he was addressing a gathering in Michigan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-palestine-conflict-united-nation-general-assembly-un-resolution-india-abstains-voting-2602422-2024-09-19",
      "headline": "India abstains from UN resolution to end Israel's occupation of PalestineIndia was among the 43 countries that abstained from voting in the UN General Assembly. The other key players who opted to abstain were Australia, Canada, Germany, Italy, Nepal, Ukraine, and the United Kingdom. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-hamas-war-gaza-defence-minister-yoav-gallant-2602383-2024-09-18",
      "headline": "Results very impressive: Israel declares new phase of war after Lebanon blastsThis statement from the Israeli Defence Minister comes a day after at least 12 people were killed after pagers used by Hezbollah members exploded in Lebanon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/coldplay-to-host-mumbai-concert-on-january-18-and-19-2025-2602436-2024-09-19",
      "headline": "Coldplay to host concert in Mumbai. Here's the date and venueColdplay announced its Mumbai concert, which will be held on January 18 and 19, 2025. The concert will be held at the DY Patil Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aaradhya-runs-to-hug-aishwarya-rai-at-siima-2024-falls-at-kannada-actor-shiva-rajkumars-feet-2602440-2024-09-19",
      "headline": "Video: Aaradhya runs to hug Aishwarya Rai, touches Shiva Rajkumar's feetIn a new video from SIIMA 2024, Aaradhya ran towards her mother Aishwarya Rai to give her a tight hug after she won Best Actor award. She also touched Kannada superstar Shiva Rajkumar's feet and took his blessings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/bhupinder-singh-hooda-exclusive-congress-haryana-assembly-polls-bjp-campaign-ex-chief-minister-2602355-2024-09-18",
      "headline": "Bhupinder Hooda Exclusive: No factionalism in Haryana Congress, party is unitedFormer Haryana Chief Minister Bhupinder Singh Hooda said the Congress was contesting the Haryana Assembly elections as a united front. He ruled out chances of retiring from politics, saying he was ready to take charge of any responsibility he was given."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/iranian-hackers-sent-stolen-trump-campaign-information-to-bidens-team-report-2602442-2024-09-19",
      "headline": "Iranian hackers sent stolen Trump campaign information to Biden's team: ReportAccording to a report by US investigative agencies, Iranian hackers sent unsolicited emails to people associated with President Joe Biden's campaign, to interfere in the 2024 Presidential election."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-record-highs-jumps-600-points-crosses-25000-first-time-2602473-2024-09-19",
      "headline": "Sensex jumps over 700 points, Nifty crosses 25,500 for 1st time; IT stocks gainThe S&P BSE Sensex was up 758.7 points at 83,706.93 at 9:41 am, while the NSE Nifty50 gained 215.40 points to trade at 25,592.95. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/lady-gaga-is-a-man-rumour-bill-gates-ott-show-2602478-2024-09-19",
      "headline": "Lady Gaga on 'being a man' rumour: Didn't feel like a victim with that lieLady Gaga breaks silence on rumours which claimed that she was a man during the early days of her career. Speaking on Bill Gates' new show, she shared why she didn't care to dismiss the rumours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/lokesh-kanagaraj-nagarjuna-leaked-coolie-scene-two-months-of-hard-work-gone-in-vain-2602298-2024-09-18",
      "headline": "Two months of hard work gone in vain: Lokesh Kanagaraj on Nagarjuna's leaked Coolie sceneDirector Lokesh Kanagaraj addressed the leak of a Coolie scene featuring Nagarjuna, lamenting that two months of hard work was wasted. The film, anticipated for 2025 release, stars several prominent actors, including Rajinikanth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/us-presidential-elections-2024-donald-trump-republican-new-york-speech-video-2602445-2024-09-19",
      "headline": "Watch: Trump says God saved him, promises to bring back religion in USFormer US President Donald Trump asserted that divine intervention saved him and vowed to bring back religion in America.  \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/trinamool-mp-mlas-boat-overturns-in-west-bengal-bengal-birbhum-rescued-2602444-2024-09-19",
      "headline": "Boat carrying Trinamool MPs, MLAs overturns in Bengal's BirbhumSenior Trinamool Congress leaders and local officials in West Bengal's Birbhum district had a narrow escape when their boat overturned while inspecting flood-affected areas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yuvraj-singh-six-sixes-vs-stuart-broad-t20-world-cup-2007-2602450-2024-09-19",
      "headline": "OTD in 2007: Yuvraj Singh thrashes Stuart Broad for six sixes in an overStar India all-rounder Yuvraj Singh hit England's Stuart Broad for six consecutive sixes in an over during the T20 World Cup 2007 at Kingsmead Durban."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-back-nadia-citadel-2-shares-bts-video-sets-2602487-2024-09-19",
      "headline": "Priyanka Chopra back as Nadia for Citadel 2, shares BTS video from setsPriyanka Chopra has commenced filming for the highly anticipated second season of Citadel. She shared a tour video on Instagram, showcasing her return to the role of Nadia."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/ernst-and-young-india-pune-employee-death-social-media-outrage-big-4-culture-2602162-2024-09-18",
      "headline": "EY India employee's death unleashes social media storm over 'Big 4 culture'In a letter addressed to the head of EY India, Anna Sebastian Perayil's mother blamed \"excessive workload\" for her daughter's death. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/music-director-vipin-reshammiya-father-of-himesh-reshammiya-dies-at-87-kokilaben-dhirubhai-ambani-breathing-issue-2602447-2024-09-19",
      "headline": "Music director Vipin Reshammiya, father of Himesh Reshammiya, dies at 87Singer Himesh Reshammiya's father, Vipin Reshammiya, died on September 18 after being admitted to Kokilaben Dhirubhai Ambani Hospital in Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/celebrity/story/kundali-bhagya-actor-sana-sayyad-announces-pregnancy-flaunts-baby-bump-2602511-2024-09-19",
      "headline": "Kundali Bhagya actor Sana Sayyad announces pregnancy, flaunts baby bumpTV actor Sana Sayyad is expecting her first child with her husband Imaad Shamsi. She is renowned for playing Palki in the popular soap Kundali Bhagya. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/celebrity/photo/munisha-khatwani-birthday-bash-rashami-desai-shraddha-arya-kishwer-merchantt-deepshikha-nagpal-bigg-boss-ott-3-2602477-2024-09-19",
      "headline": "Pics: Celebs at Bigg Boss OTT's Munisha Khatwani's birthday bash Bigg Boss OTT 3 contestant Munisha Khatwani celebrated her birthday on September 18. The star-studded bash was attended by a host of celebrities from the television circuit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-back-nadia-citadel-2-shares-bts-video-sets-2602487-2024-09-19",
      "headline": "Priyanka Chopra back as Nadia for Citadel 2, shares BTS video from setsPriyanka Chopra has commenced filming for the highly anticipated second season of Citadel. She shared a tour video on Instagram, showcasing her return to the role of Nadia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/lady-gaga-is-a-man-rumour-bill-gates-ott-show-2602478-2024-09-19",
      "headline": "Lady Gaga on 'being a man' rumour: Didn't feel like a victim with that lieLady Gaga breaks silence on rumours which claimed that she was a man during the early days of her career. Speaking on Bill Gates' new show, she shared why she didn't care to dismiss the rumours."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-first-test-day-one-virat-kohli-failure-hasan-mahmud-chennai-2602506-2024-09-19",
      "headline": "IND vs BAN: Virat Kohli fails on India Test return, out for 6 in ChennaiVirat Kohli's return to the India Test side is off to the worst possible start as he was dismissed for just 6 runs in the first innings of the Chennai Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-ban-rohit-sharma-shubman-gill-hasan-mahmud-2602505-2024-09-19",
      "headline": "IND vs BAN: Rohit Sharma, Shubman Gill fail in testing conditions in ChennaiIndia captain Rohit Sharma and Shubman Gill were dismissed cheaply on Day 1 of the first Test against Bangladesh after Bangladesh captain Najmul Hossain Shanto won the toss and elected to bowl first."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-first-test-day-one-42-year-toss-run-ends-chennai-chepauk-2602482-2024-09-19",
      "headline": "IND vs BAN: Bangladesh end 42-year toss run in Chennai by fielding firstBangladesh's decision to field first in the Chennai Test ended a 42-year toss run at the Chepauk. This is the first time in 21 Tests that a team has decided to field first after winning the toss at the iconic stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-r-ashwin-chennai-test-pitch-challenge-2602472-2024-09-19",
      "headline": "Bangladesh not underdogs: Ashwin reckons Chennai pitch perfect for Test cricketIndia vs Bangladesh: Ace spinner R Ashwin reckons that Bangladesh cannot be considered underdogs after their historic series win in Pakistan. Ashwin also shared his memories of playing Test cricket in his hometown, Chennai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-first-test-day-one-rohit-sharma-message-chennai-2602466-2024-09-19",
      "headline": "Back your potential: Rohit Sharma's message to India as 10-Test run startsRohit Sharma has told his side to back their potential as India kickstart their 10-Test run with the match against Bangladesh in Chennai on Thursday, September 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-ban-indias-playing-xi-chennai-test-akash-deep-kl-rahul-rishabh-pant-2602454-2024-09-19",
      "headline": "IND vs BAN: India pick 3 pacers for Chennai Test, Akash Deep in XIIndia have picked three fast bowlers for the first Test against Bangladesh in Chennai as Akash Deep joins Jasprit Bumrah and Mohammed Siraj in the playing XI. Bangladesh captain Najmul Hossain Shanto won the toss and elected to bowl first."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-rishabh-pant-comeback-test-cricket-632-days-2602446-2024-09-19",
      "headline": "India gleam with hope as Rishabh Pant returns to Tests after absence of 632 daysIndia vs Bangladesh: Rishabh Pant returns to Test cricket after a long gap of 632 days. Pant's return to the Test side not only brings incredible joy to India fans but also adds the much-needed X factor to the Test team.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yuvraj-singh-six-sixes-vs-stuart-broad-t20-world-cup-2007-2602450-2024-09-19",
      "headline": "OTD in 2007: Yuvraj Singh thrashes Stuart Broad for six sixes in an overStar India all-rounder Yuvraj Singh hit England's Stuart Broad for six consecutive sixes in an over during the T20 World Cup 2007 at Kingsmead Durban."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/coco-gauff-brad-gilbert-us-open-2024-2602437-2024-09-19",
      "headline": "Coco Gauff parts ways with coach Brad Gilbert after early US Open exitCoco Gauff has parted ways with her coach Brad Gilbert following her early exit from the US Open 2024 following a loss against Emma Navarro."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-ban-indias-playing-xi-chennai-test-akash-deep-kl-rahul-rishabh-pant-2602454-2024-09-19",
      "headline": "IND vs BAN: India pick 3 pacers for Chennai Test, Akash Deep in XIIndia have picked three fast bowlers for the first Test against Bangladesh in Chennai as Akash Deep joins Jasprit Bumrah and Mohammed Siraj in the playing XI. Bangladesh captain Najmul Hossain Shanto won the toss and elected to bowl first."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-rishabh-pant-comeback-test-cricket-632-days-2602446-2024-09-19",
      "headline": "India gleam with hope as Rishabh Pant returns to Tests after absence of 632 daysIndia vs Bangladesh: Rishabh Pant returns to Test cricket after a long gap of 632 days. Pant's return to the Test side not only brings incredible joy to India fans but also adds the much-needed X factor to the Test team.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yuvraj-singh-six-sixes-vs-stuart-broad-t20-world-cup-2007-2602450-2024-09-19",
      "headline": "OTD in 2007: Yuvraj Singh thrashes Stuart Broad for six sixes in an overStar India all-rounder Yuvraj Singh hit England's Stuart Broad for six consecutive sixes in an over during the T20 World Cup 2007 at Kingsmead Durban."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/coco-gauff-brad-gilbert-us-open-2024-2602437-2024-09-19",
      "headline": "Coco Gauff parts ways with coach Brad Gilbert after early US Open exitCoco Gauff has parted ways with her coach Brad Gilbert following her early exit from the US Open 2024 following a loss against Emma Navarro."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/champions-league-psg-beat-girona-manchester-city-inter-milan-draw-2602431-2024-09-19",
      "headline": "PSG beat Girona, Manchester City-Inter play out stalemateChampions League: Paris Saint-Germain secured a 1-0 victory over Girona with a last-minute goal. Manchester City and Inter Milan played to a goalless draw in their rematch of the 2023 final."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/misfiring-mohun-bagan-held-to-0-0-draw-by-fc-ravshan-in-acl-ii-opener-2602388-2024-09-18",
      "headline": "Misfiring Mohun Bagan held to 0-0 draw by FC Ravshan in ACL-II openerMohun Bagan's AFC Champions League Two campaign began on a frustrating note as they played out a goalless draw against Tajikistan's FC Ravshan. Fans' anger with the coach grew as Bagan failed to score goals at home."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-bangladesh-rohit-sharma-test-captain-legacy-opener-sledging-room-podcast-2602378-2024-09-18",
      "headline": "What is Rohit Sharma's legacy as Test captain and opener?India's upcoming Test cricket schedule will be a defining period for Rohit Sharma as captain. With 10 Tests in 16 weeks, including a crucial series in Australia, this phase could shape his legacy and India's World Test Championship journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-vs-south-africa-1st-odi-match-report-farooqi-ghazanfar-2602375-2024-09-18",
      "headline": "AFG vs SA: Farooqi, Ghazanfar hand hosts historic ODI win against Proteas17-year-old Allah Ghazanfar and left-arm pacer Falazhaq Farroqi ran through the South Africa batting attack on Wednesday, September 18. The fast bowlers first bowled out SA for their 5th lowest ODI total and then held their nerve to clinch a historic ODI win in Sharjah.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-champions-league-fc-barcelona-ansu-fati-injury-return-as-monaco-squad-2602362-2024-09-18",
      "headline": "Ansu returns from injury in time for Barcelona's Champions League openerAnsu Fati has returned to Barcelona's squad for their UEFA Champions League clash against AS Monaco after recovering from injury. The 21-year-old forward now has another chance to prove his worth under manager Hansi Flick."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-champions-league-bayern-munich-vincent-kompany-doubters-struggles-2602334-2024-09-18",
      "headline": "Bayern Munich boss Vincent Kompany shuts doubters after UCL win: We keep goingVincent Kompany silenced his critics as Bayern Munich delivered a dominant 9-2 victory over Dinamo Zagreb in the UEFA Champions League, showcasing his tactical brilliance and proving his doubters wrong after a challenging start to his managerial journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-australia-odi-series-harry-brook-2602320-2024-09-18",
      "headline": "Keep it simple and have fun: Harry Brook's simple mantra on captaincy debutEngland stand-in ODI captain Harry Book aims to keep things simple and have some fun in the series against Australia. Brook was named captain after Jos Buttler injured his calf.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-preview-chennai-test-prediction-gautam-gambhir-spin-2602291-2024-09-18",
      "headline": "Chennai Test: Eyeing strong start to Gambhir era, India face upbeat BangladeshIndia vs Bangladesh, Chennai Test: India will look to continue their dominance over Bangladesh and start the Gautam Gambhir era on a strong note. Having assembled a full-strength squad, the Asian giants are overwhelming favourites against an upbeat Bangladesh side, which stunned Pakistan in Pakistan earlier in September. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-champions-league-fc-barcelona-ansu-fati-injury-return-as-monaco-squad-2602362-2024-09-18",
      "headline": "Ansu returns from injury in time for Barcelona's Champions League openerAnsu Fati has returned to Barcelona's squad for their UEFA Champions League clash against AS Monaco after recovering from injury. The 21-year-old forward now has another chance to prove his worth under manager Hansi Flick."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-champions-league-bayern-munich-vincent-kompany-doubters-struggles-2602334-2024-09-18",
      "headline": "Bayern Munich boss Vincent Kompany shuts doubters after UCL win: We keep goingVincent Kompany silenced his critics as Bayern Munich delivered a dominant 9-2 victory over Dinamo Zagreb in the UEFA Champions League, showcasing his tactical brilliance and proving his doubters wrong after a challenging start to his managerial journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-australia-odi-series-harry-brook-2602320-2024-09-18",
      "headline": "Keep it simple and have fun: Harry Brook's simple mantra on captaincy debutEngland stand-in ODI captain Harry Book aims to keep things simple and have some fun in the series against Australia. Brook was named captain after Jos Buttler injured his calf.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-preview-chennai-test-prediction-gautam-gambhir-spin-2602291-2024-09-18",
      "headline": "Chennai Test: Eyeing strong start to Gambhir era, India face upbeat BangladeshIndia vs Bangladesh, Chennai Test: India will look to continue their dominance over Bangladesh and start the Gautam Gambhir era on a strong note. Having assembled a full-strength squad, the Asian giants are overwhelming favourites against an upbeat Bangladesh side, which stunned Pakistan in Pakistan earlier in September. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-all-out-for-their-4th-lowest-odi-total-as-afghanistan-shine-in-sharjah-2602296-2024-09-18",
      "headline": "South Africa all-out for their 4th-lowest ODI total as Afghanistan shine in SharjahSouth Africa were bundled out for their fifth-lowest ODI total as Afghanistan managed to get them all-out for the first-time ever in white ball cricket. Farooqi and Ghazanfar shared seven wickets between them. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-yash-dayal-test-call-up-rinku-singh-over-ipl-career-redemption-2602290-2024-09-18",
      "headline": "After Test call-up, Yash Dayal reveals how Rinku over helped his careerYash Dayal credits his IPL 2023 setback against Rinku Singh for shaping his resilience, which led to his maiden India Test call-up. Overcoming personal challenges, Dayal now stands ready for his next big challenge against Bangladesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pbks-coaching-musical-chair-continues-as-ricky-ponting-appointed-as-head-coach-2602275-2024-09-18",
      "headline": "PBKS coaching musical chair continues as Ricky Ponting appointed as head coachPBKS appointed Ricky Ponting as their head coach on a 4-year contract till 2028. He became the franchise's 6th head coach in last seven seasons. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/indian-super-league-anwar-ali-ban-east-bengal-delhi-sc-high-court-verdict-future-2602269-2024-09-18",
      "headline": "What the future of Anwar Ali is after the latest Delhi HC verdict: ExplainedAnwar Ali's football future faces uncertainty as a legal battle unfolds over his controversial move from Mohun Bagan to East Bengal. With the Kolkata Derby approaching, his potential involvement now hinges on the AIFF's next steps and a crucial NOC."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}