{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nps-vatsalya-9705-minors-sign-up-on-day-1-how-to-open-account-online-offline-documents-2603579-2024-09-20",
      "headline": "NPS Vatsalya: 9,705 minors sign up on Day 1. Here's how to invest for your child?The scheme, overseen by the Pension Fund Regulatory and Development Authority (PFRDA), is part of the National Pension System (NPS) and aims to help parents and guardians begin retirement savings for their children from an early age"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pm-modi-scans-paytm-qr-at-vishwakarma-exhibition-highlights-fintechs-role-for-small-merchants-2603537-2024-09-20",
      "headline": "PM Modi scans Paytm QR at Vishwakarma exhibition, highlights fintech's role for small merchantsPM Modi bought an artefact of Bhagwan Jagannath and paid via Paytm QR, showcasing not only the significance of the crafts but also the role of fintech in empowering small merchants and fostering increased trust in mobile payments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/study-shows-people-us-need-to-work-5-days-to-buy-iphone-16-how-long-do-indians-need-2603531-2024-09-20",
      "headline": "Study shows people in US work 5 days to buy iPhone 16; how long do Indians need?A recent study reveals how long people in different countries need to work in order to afford the iPhone 16, with citizens in Switzerland requiring the least number of days. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/no-work-no-pay-termination-samsung-warns-workers-on-strike-in-chennai-report-2603462-2024-09-20",
      "headline": "No work, no pay: Samsung warns workers on strike in Chennai The strike, which began on September 9, 2024, involves hundreds of workers at Samsung's home appliances factory near Chennai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-ends-1400-points-higher-nifty-above-25800-icici-bank-jumps-5-2603442-2024-09-20",
      "headline": "Sensex ends 1,400 points higher, Nifty above 25,800; ICICI Bank jumps 5%At the closing bell, the S&P BSE Sensex was up 1,381.99 points to 84,566.79, while the NSE Nifty50 gained 375.15 points to settle at 25,790.95."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ashneer-grover-shares-reason-behind-his-one-day-exit-from-ey-rs-1-crore-package-check-here-2603418-2024-09-20",
      "headline": "Ashneer Grover shares why he quit EY in a day despite Rs 1 crore salaryIn an old video, Grover shares why he left Ernst & Young (EY) on his very first day despite being offered a Rs 1 crore salary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/should-you-buy-vodafone-idea-shares-after-20-percent-fall-ubs-nomura-novuma-new-target-price-2603391-2024-09-20",
      "headline": "Should you buy Vodafone Idea shares after 20% fall? UBS shares new target priceVodafone Idea shares fell 20% after the Supreme Court on Thursday dismissed the company's curative petition, which sought a re-computation of Adjusted Gross Revenue (AGR) dues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/explained-why-iifl-finance-shares-surged-13-percent-today-2603356-2024-09-20",
      "headline": "Explained: Why IIFL Finance shares surged 13% todayIIFL Finance stock climbed to a high of Rs 560.60, marking its peak since late February, before settling to trade 9.31% higher as of 2:06 pm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cochin-shipyard-shares-jump-10-percent-today-ftse-all-world-index-inclusion-2603280-2024-09-20",
      "headline": "Explained: Why Cochin Shipyard shares soared 10% todayAt around 12:25 pm, shares of the company were up 9.45% at Rs 1,837.30 on the Bombay Stock Exchange (BSE)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/western-carriers-ipo-allotment-step-by-step-guide-to-check-status-latest-gmp-2603255-2024-09-20",
      "headline": " Western Carriers IPO allotment: Step-by-step guide to check statusWestern Carriers IPO allotment: Investors can check their allotment status online via the BSE website or through Link Intime India Private Ltd."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/iphone-16-in-10-minutes-quick-commerce-blinkit-steals-spotlight-from-e-commerce-giants-2603215-2024-09-20",
      "headline": "iPhone 16 in 10 minutes: Quick commerce firms bring fight to Amazon, FlipkartiPhone 16 sales: Quick commerce platforms like Blinkit, BigBasket and Zepto have started delivering the latest iPhone 16 in minutes, challenging traditional e-commerce giants Amazon and Flipkart.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-all-time-high-sensex-84000-nifty-sharp-rise-us-fed-rate-cut-small-and-midcap-stocks-2603213-2024-09-20",
      "headline": "Sensex jumps over 1,276 points to cross 84,400, Nifty nears 25,800The S&P BSE Sensex was up 1275.45 points to 84,460.25 at 12:49 pm, while the NSE Nifty50 gained 368.70 points to trade at 25,784.50."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/northern-arc-ipo-allotment-latest-gmp-step-by-step-guide-to-check-status-2603206-2024-09-20",
      "headline": "Northern Arc IPO allotment: Latest GMP, step-by-step guide to check statusNorthern Arc IPO allotment: To check their share allocation, investors should visit the IPO registrar's portal or the BSE and NSE websites."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rites-share-price-up-over-7-percent-railway-psu-stock-ex-bonus-dividend-2603180-2024-09-20",
      "headline": "RITES shares rise 8% but why railway PSU stock may be showing 48% slideDespite this positive momentum, many investors were caught off guard, seeing what appeared to be a 48% slide in the stock price on their trading apps."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-intern-to-ceo-elliott-hill-32-year-journey-at-nike-linkendin-profile-goes-viral-2603178-2024-09-20",
      "headline": "Elliott Hill's 32-year journey at Nike from intern to CEO goes viralElliott Hill, who has spent over 32 years at Nike, started his journey as an intern and will now be leading the iconic company. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-surges-500-points-nifty-gains-momentum-rites-jumps-over-7-2603164-2024-09-20",
      "headline": "Sensex surges 500 points, Nifty gains momentum; JSW Steel jumps 3%The S&P BSE Sensex was up 415.45 points at 83,600.25 at 10:16 am, while the NSE Nifty50 gained 135.80 points to trade at 25,550.90."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/arkade-developers-ipo-allotment-check-status-latest-subscription-gmp-listing-gains-2603115-2024-09-20",
      "headline": "Arkade Developers IPO allotment: Check status, GMP, subscription Arkade Developers IPO allotment: Investors can check their allotment status by logging into the BSE website or the Bigshare Services Pvt Ltd website, the issue's registrar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/northern-arc-capital-ipo-allotment-tomorrow-check-latest-subscription-listing-gain-gmp-2602821-2024-09-19",
      "headline": "Northern Arc Capital IPO allotment tomorrow: Check latest subscription, GMPNorthern Arc Capital Limited, founded in 2009, provides retail loans to underserved households and businesses across India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-end-higher-after-us-feds-50-bps-rate-cut-ntpc-gains-2602758-2024-09-19",
      "headline": "Sensex, Nifty end higher after US Fed's 50 bps rate cut; NTPC gainsThe S&P BSE Sensex ended 236.57 points higher at 83,184.80, while the NSE Nifty50 settled 38.25 points higher at 25,415.80. Both the indices had hit fresh all-time highs in early trade."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pm-modi-us-visit-president-joe-biden-quad-summit-bilateral-talks-defence-semiconductor-plant-discussions-2604269-2024-09-22",
      "headline": "PM Modi, Biden firm up drone deal, setting up of semiconductor plant in IndiaPrime Minister Narendra Modi and US President Joe Biden held bilateral talks on the sidelines of Quad Summit at Biden's residence in Delaware. They discussed several topics, including the MQ-9B Predator drone deal and the setting up of a semiconductor plant in Kolkata."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-us-visit-quad-summit-modi-biden-meeting-greenville-global-issues-2604218-2024-09-22",
      "headline": "World surrounded by conflicts, Quad important for humanity: PM Modi in USPM Modi, giving his opening remarks at the summit, added that the Quad alliance is \"not against anyone\" but an alliance which supports \"rules-based international order, respect for sovereignty and territorial integrity, and peaceful resolution of all issues.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/joe-biden-quad-summit-pm-modi-us-china-sovereignty-claims-south-china-2604251-2024-09-22",
      "headline": "China testing us all, Joe Biden tells Quad leaders in hot mic blunderAt the Quad summit, US President Joe Biden was caught on a hot mic telling leaders from India, Australia and Japan that China was continuing to \"behave aggressively\" and \"testing us all\" amid concerns over Beijing's sovereignty claims in the South China Sea."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/israel-soldiers-raid-al-jazeera-office-west-bank-order-45-day-closure-2604263-2024-09-22",
      "headline": "Israel raids Al Jazeera office in West Bank: Take your cameras and leaveArmed and masked Israeli soldiers entered the Al Jazeera office in the West Bank during a live broadcast and ordered the staff to take their cameras and leave the office soon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/kathavachaks-anirudhacharya-jaya-kishori-abhinav-arora-acharya-shantanu-kumar-vishwas-social-media-2604014-2024-09-22",
      "headline": "For kathavachaks, social media is a pot of wish and a 'vish ki kit'The practice of kathavachan, the religious storytelling of Hindu texts, has been around for centuries. The kathavachaks, or spiritual orators, have been revered. Social media, however, is changing the game. If it is boosting the reach of the new-age kathavachaks, it is also subjecting them to intense scrutiny."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/prime-minister-narendra-modi-new-york-after-quad-summit-meets-members-indian-community-2604291-2024-09-22",
      "headline": "PM arrives in New York after Quad Summit, meets members of Indian communityPrime Minister Narendra Modi landed in New York after attending the Quad Summit hosted by US President Joe Biden in his hometown of Wilmington, Delaware. He is scheduled to address the UN General Assembly and meet American tech leaders. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/sri-lanka-marxist-leader-anura-dissanayake-early-lead-presidential-polls-2604280-2024-09-22",
      "headline": "Sri Lankan Marxist leader Dissanayake takes early lead in presidential voteThe Marxist leader secured 53% of a million votes counted so far in the election. Opposition leader Sajith Premadasa was second at 22%, ahead of President Ranil Wickremesinghe in third place."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/hilsa-fish-padma-bangladesh-export-durga-puja-ban-lifted-2604111-2024-09-22",
      "headline": "Bangladesh lifts hilsa export ban, approves 3,000 tonnes to India for Durga PujaWeeks after imposing a ban on hilsa exports to India, Bangladesh on Saturday approved the export of 3,000 tonnes of the fish for the upcoming Durga Puja festival."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/how-food-allergies-found-a-miracle-fix-in-an-asthma-medicine-2602636-2024-09-22",
      "headline": "How food allergies found a miracle fix in an asthma medicineDo you ever crave something you're allergic to? You might be able to eat it soon without worrying about a rash. A medicine that was originally made for asthma might also help treat food allergies."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/woman-body-cut-into-multiple-pieces-found-inside-fridge-in-bengaluru-2604173-2024-09-22",
      "headline": "Chopped pieces of Bengaluru woman's body found in fridge at her homeThe police said it appears that the body parts have been kept inside the refrigerator for around 2-3 days. The area near the crime scene has been sealed and further investigation is underway. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-mp-rahul-gandhi-ey-worker-anna-sebastians-parents-support-employee-suicide-work-pressure-2604209-2024-09-22",
      "headline": "Rahul Gandhi speaks to EY worker's parents, assures personal commitmentRahul Gandhi expressed grief over Anna's death and also sought details from her parents about the work pressure their daughter was facing.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/joe-biden-pats-next-quad-host-prime-minister-narendra-modi-us-delaware-australia-japan-2604223-2024-09-22",
      "headline": "Will Quad survive after US polls? Biden's reply, hand around PM Modi's shoulderAfter India, the US, Australia and Japan held talks at the Quad Summit in Wilmington, Delaware on Saturday, President Joe Biden said that the forum was here to stay."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/praggnanandhaa-gukesh-guide-india-to-first-ever-gold-in-chess-olympiad-2604201-2024-09-22",
      "headline": "Chess Olympiad: D Gukesh shines as India on cusp of historic gold medalD Gukesh pulled off a big win against Fabiano Caruana to help India all but clinch their first-ever gold medal in the Open Section of the Chess Olympiad on Saturday, September 21 in Budapest. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/bengali-actors-urge-chief-minister-mamata-banerjee-to-publish-report-on-sexual-harrasment-2604272-2024-09-22",
      "headline": "Bengali actors urge Mamata Banerjee to publish report on sexual harrasmentBengali actors Ushasi Ray, Ananya Sen, Tanika Basu, Sauraseni Maitra, Angana Roy, and Daminee Benny Basu have written a letter to Chief Minister Mamata Banerjee, urging the formation of a committee to investigate cases of sexual harassment in the Bengali film industry. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-joe-biden-narendra-modi-talks-un-security-council-permanent-seat-quad-summit-india-2604279-2024-09-22",
      "headline": "US backs India's bid for permanent seat in UN Security CouncilThe US has supported India in its bid to have a permanent seat in the UN Security Council. India has been eyeing permanent membership in the powerful UN body for the past several years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/dinner-menu-quad-summit-us-president-joe-biden-wilmington-delaware-2604247-2024-09-22",
      "headline": "Lemon risotto, Caprese salad: Here's the dinner menu at Biden-hosted Quad SummitPrime Minister Narendra Modi attended an \"intimate\" dinner hosted by US President Joe Biden during the Quad Summit. Several vegetarian dishes were served to PM Modi during the dinner, which was prepared by James Beard nominated Chef Antimo DiMeo, Executive Chef of the Bardea Restaurant Group of Wilmington, Delaware."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-politics-business-sports-entertainment-422-21-09-2024",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/army-officer-fiancee-attacked-odisha-bhubneshwar-bharatpur-police-station-sexual-assault-2604036-2024-09-21",
      "headline": "This isn't Delhi, tell her: Video shows attack on Army officer, fiancee in OdishaThe video, accessed by India Today, shows the Army officer and his fiancée being manhandled by a group of men in Odisha's Bhubneshwar. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-vs-ms-dhoni-in-tests-dinesh-karthik-ind-vs-ban-2604276-2024-09-22",
      "headline": "Rishabh Pant better than MS Dhoni in Tests? Dinesh Karthik settles the debateFormer India wicketkeeper batter Dinesh Karthik has given his take on the debate around who's better between MS Dhoni and Rishabh Pant as a wicketkeeper batter for India in Tests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/prime-minister-narendra-modi-us-president-joe-biden-hug-handshakes-quad-summit-video-2604243-2024-09-22",
      "headline": "Watch: Safe trip, Biden tells PM Modi, hug and handshake after Quad Summit endsPrime Minister Narendra Modi and US President Joe Biden shared a warm hug as the Indian leader left from the venue of Quad Summit in Wilmington, Delaware on Saturday. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/presidential-debate-kamala-harris-accepts-cnn-invitation-donald-trump-to-join-2604179-2024-09-21",
      "headline": "Kamala Harris accepts invitation for 2nd presidential debate, Trump rejectsDonald Trump has rejected joining his Democratic rival Kamala Harris for a second presidential debate, saying it was \"too late\" now since Americans have already started casting their votes for the November 5 presidential election. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/manipur-violence-kuki-militants-myanmar-militant-attack-report-meitei-2604200-2024-09-22",
      "headline": "Preposterous: Kuki body rejects Manipur's alert on militant influx from Myanmar A collective of Kuki tribal groups in Manipur dismissed the government's alert about the influx of militants from Myanmar as \"preposterous\" and an attempt to perpetuate biassed ethno-centric narrative. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-us-remarks-sikhs-bjp-indians-practice-their-religion-congress-2604029-2024-09-21",
      "headline": "Rahul Gandhi breaks silence on his Sikh remark in US: BJP spreading liesDays after receiving criticism from BJP leaders over his comments on Sikhs in the US, Congress MP Rahul Gandhi said that the BJP has been spreading lies about his remarks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/diljit-dosanjh-adds-jaipur-mumbai-dil-luminati-tour-india-tour-list-2604293-2024-09-22",
      "headline": "Dil-Luminati Tour: Diljit Dosanjh adds Jaipur, Mumbai to his India tour listSinger Diljit Dosanjh announced an additional show in Delhi to complement his highly anticipated Dil-Luminati India Tour 2024. He also added new stops in Mumbai and Jaipur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rani-mukerji-spends-day-with-children-battling-cancer-2604286-2024-09-22",
      "headline": "Rani Mukerji spends time with children battling cancerActor Rani Mukerji spent a joyful day with children battling cancer. She not only interacted with them but also celebrated with a cake-cutting ceremony and a ride on an open-top bus. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/bengali-actors-urge-chief-minister-mamata-banerjee-to-publish-report-on-sexual-harrasment-2604272-2024-09-22",
      "headline": "Bengali actors urge Mamata Banerjee to publish report on sexual harrasmentBengali actors Ushasi Ray, Ananya Sen, Tanika Basu, Sauraseni Maitra, Angana Roy, and Daminee Benny Basu have written a letter to Chief Minister Mamata Banerjee, urging the formation of a committee to investigate cases of sexual harassment in the Bengali film industry. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/diljit-dosanjh-paris-concert-fan-throws-phone-singer-reacts-2604134-2024-09-21",
      "headline": "Fan throws phone at Diljit Dosanjh in Paris, his reaction is winning heartsDiljit Dosanjh recently toured Paris. A viral video from his concert in the city captured a concertgoer hurling a phone at the singer. Diljit's reaction was everything. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jp-duminy-afg-vs-sa-afghanistan-vs-south-africa-rashid-khan-2604290-2024-09-22",
      "headline": "JP Duminy on South Africa's series loss against Afghanistan: 'We were below par'South Africa batting coach JP Duminy admitted that his team has been below par after maiden series loss against Afghanistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-chennai-test-rishabh-pant-gabba-knock-devender-sharma-2604287-2024-09-22",
      "headline": "Rishabh Pant's Chennai Test hundred as special as Gabba knock: Childhood coachIndia vs Bangladesh, 1st Test: Rishabh Pant hit an entertaining second innings hundred, seamlessly returning to the longest format of the game, in Chennai. Pant was at his fluent best during the record-equalling knock. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/2007-t20-world-cup-yuvraj-singh-70-india-vs-australia-2604282-2024-09-22",
      "headline": "Yuvraj Singh 70 helps India beat Australia to reach T20 World Cup finalYuvraj Singh's explosive 70 off just 30 balls, combined with disciplined bowling, powered India into the final with a thrilling 15-run victory over Australia in the 2007 ICC Men's T20 World Cup semi-final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-vs-ms-dhoni-in-tests-dinesh-karthik-ind-vs-ban-2604276-2024-09-22",
      "headline": "Rishabh Pant better than MS Dhoni in Tests? Dinesh Karthik settles the debateFormer India wicketkeeper batter Dinesh Karthik has given his take on the debate around who's better between MS Dhoni and Rishabh Pant as a wicketkeeper batter for India in Tests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/carlo-ancelotti-reaction-real-madrid-comeback-win-over-espanyol-2604260-2024-09-22",
      "headline": "Carlo Ancelotti happy with Real Madrid's comeback win over EspanyolReal Madrid manager Carlo Ancelotti praised his team's resilience and attacking prowess following their 4-1 comeback victory against Espanyol. Despite an early setback, Madrid's dominant performance secured the win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harry-brook-mitchell-marsh-alex-carey-eng-vs-aus-2604258-2024-09-22",
      "headline": "Harry Brook blames team's inexperience after second ODI loss against Australia Harry Brook blamed his team's inexperience after losing the second ODI against Australia by 68 runs at Headingley, Leeds. England failed to chase down 271 and got all out for 202 runs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/laver-cup-team-world-take-8-4-lead-vs-europe-ruud-tsitsipas-lose-2604254-2024-09-22",
      "headline": "Team World takes 8-4 lead over Team Europe as Ruud, Tsitsipas fall in doublesLaver Cup: Ben Shelton and Alejandro Tabilo defeated Stefanos Tsitsipas and Casper Ruud 6-1, 6-2 on Saturday, giving Team World an 8-4 lead over Team Europe after day two of the Laver Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/praggnanandhaa-gukesh-guide-india-to-first-ever-gold-in-chess-olympiad-2604201-2024-09-22",
      "headline": "Chess Olympiad: D Gukesh shines as India on cusp of historic gold medalD Gukesh pulled off a big win against Fabiano Caruana to help India all but clinch their first-ever gold medal in the Open Section of the Chess Olympiad on Saturday, September 21 in Budapest. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-australia-harry-brook-powerplay-reaction-2nd-odi-2604199-2024-09-21",
      "headline": "Early wickets killed us: England's Harry Brook rues poor powerplayENG vs AUS: Harry Brook said that England lost their way in the run-chase against Australia in Leeds after losing five wickets inside the powerplay. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harry-brook-is-facing-baptism-by-fire-morgan-after-2nd-odi-loss-vs-australia-2604198-2024-09-21",
      "headline": "Harry Brook is facing baptism by fire: Eoin MorganFormer England captain Eoin Morgan has said that Harry Brook has been baptised by fire in the first two matches agianst Australia. Brook, who is standing in for Jos Buttler has lost the first two games of the 5-match series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harry-brook-mitchell-marsh-alex-carey-eng-vs-aus-2604258-2024-09-22",
      "headline": "Harry Brook blames team's inexperience after second ODI loss against Australia Harry Brook blamed his team's inexperience after losing the second ODI against Australia by 68 runs at Headingley, Leeds. England failed to chase down 271 and got all out for 202 runs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/laver-cup-team-world-take-8-4-lead-vs-europe-ruud-tsitsipas-lose-2604254-2024-09-22",
      "headline": "Team World takes 8-4 lead over Team Europe as Ruud, Tsitsipas fall in doublesLaver Cup: Ben Shelton and Alejandro Tabilo defeated Stefanos Tsitsipas and Casper Ruud 6-1, 6-2 on Saturday, giving Team World an 8-4 lead over Team Europe after day two of the Laver Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/praggnanandhaa-gukesh-guide-india-to-first-ever-gold-in-chess-olympiad-2604201-2024-09-22",
      "headline": "Chess Olympiad: D Gukesh shines as India on cusp of historic gold medalD Gukesh pulled off a big win against Fabiano Caruana to help India all but clinch their first-ever gold medal in the Open Section of the Chess Olympiad on Saturday, September 21 in Budapest. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-australia-harry-brook-powerplay-reaction-2nd-odi-2604199-2024-09-21",
      "headline": "Early wickets killed us: England's Harry Brook rues poor powerplayENG vs AUS: Harry Brook said that England lost their way in the run-chase against Australia in Leeds after losing five wickets inside the powerplay. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harry-brook-is-facing-baptism-by-fire-morgan-after-2nd-odi-loss-vs-australia-2604198-2024-09-21",
      "headline": "Harry Brook is facing baptism by fire: Eoin MorganFormer England captain Eoin Morgan has said that Harry Brook has been baptised by fire in the first two matches agianst Australia. Brook, who is standing in for Jos Buttler has lost the first two games of the 5-match series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/isl-jamshedpur-fc-eke-out-win-vs-mumbai-city-mohammedan-register-first-point-2604193-2024-09-21",
      "headline": "ISL: Jamshedpur eke out win vs Mumbai, Mohammedan register first pointISL: Jamshedpur FC held off a resilient Mumbai City to eke out a hardfought 3-2 win on Saturday, September 21. In the other match debutants Mohammedan FC registered their first points with a 1-1 draw against FC Goa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-australia-2nd-odi-harry-brook-alex-carey-report-2604187-2024-09-21",
      "headline": "Australia go 2-0 up after England batting falters in 2nd ODIENG vs AUS: Alex Carey's 74-run knock and Mitchell Starc's three wickets helped Australia beat England by 68 runs on Saturday at the Headingley in Leeds. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-luis-diaz-darwin-nunez-help-liverpool-hammer-bournemouth-3-0-2604186-2024-09-21",
      "headline": "Luis Diaz, Darwin Nunez help Liverpool hammer Bournemouth 3-0Liverpool turned around their fortunes in the Premier League with a 3-0 win against Bournemouth. Luis Diaz and Darwin Nunez were on the scoresheet for the Arne Slot side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-india-vs-bangladesh-virender-sehwag-2604184-2024-09-21",
      "headline": "Rishabh Pant reminds Aakash Chopra of Virender SehwagFormer India cricketer Aakash Chopra said that Rishabh Pant reminded him of Virender Sehwag. Chopra said that he thought T20 would be Rishabh's best format but it turned out to be the Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-rishabh-pant-sanjay-manjrekar-ms-dhoni-2604181-2024-09-21",
      "headline": "Rishabh Pant has a defensive technique similar to Dhoni: ManjrekarIND vs BAN: Rishabh Pant had a memorable day after he scored his sixth Test hundred in the series opener against Bangladesh at the MA Chidambaram Stadium in Chennai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/duleep-trophy-shreyas-iyer-ricky-bhui-2604172-2024-09-21",
      "headline": "Duleep Trophy: Shreyas Iyer, Ricky Bhui heroics help India D seize controlDuleep Trophy: Ricky Bhui neared his century while Shreyas Iyer scored a fifty to hand India D control in their match against Abhimanyu Easwaran's India C. India D led by 311 runs after Day 3 with 5 wickets in hand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/laver-cup-carlos-alcaraz-ben-shelton-frances-tiafoe-daniil-medvedev-2604167-2024-09-21",
      "headline": "Carlos Alcaraz beats Ben Shelton, Frances Tiafoe stuns Medvedev  Laver Cup 2024: Frances Tiafoe came back from behind to beat Daniil Medvedev while Carlos Alcaraz got the better of Ben Shelton at the Uber Arena. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shakib-al-hasan-injury-india-vs-bangladesh-test-match-2604159-2024-09-21",
      "headline": "Not aware of Shakib Al Hasan's injury: Batting coach David HempBangladesh batting coach David Hemp said that he was not aware of any injury to Shakib Al Hasan's finger. Hemp reacted to the speculation made by Murali Karthik during commentary in the Chennai Test match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-rishabh-pant-sanjay-manjrekar-ms-dhoni-2604181-2024-09-21",
      "headline": "Rishabh Pant has a defensive technique similar to Dhoni: ManjrekarIND vs BAN: Rishabh Pant had a memorable day after he scored his sixth Test hundred in the series opener against Bangladesh at the MA Chidambaram Stadium in Chennai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/duleep-trophy-shreyas-iyer-ricky-bhui-2604172-2024-09-21",
      "headline": "Duleep Trophy: Shreyas Iyer, Ricky Bhui heroics help India D seize controlDuleep Trophy: Ricky Bhui neared his century while Shreyas Iyer scored a fifty to hand India D control in their match against Abhimanyu Easwaran's India C. India D led by 311 runs after Day 3 with 5 wickets in hand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/laver-cup-carlos-alcaraz-ben-shelton-frances-tiafoe-daniil-medvedev-2604167-2024-09-21",
      "headline": "Carlos Alcaraz beats Ben Shelton, Frances Tiafoe stuns Medvedev  Laver Cup 2024: Frances Tiafoe came back from behind to beat Daniil Medvedev while Carlos Alcaraz got the better of Ben Shelton at the Uber Arena. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shakib-al-hasan-injury-india-vs-bangladesh-test-match-2604159-2024-09-21",
      "headline": "Not aware of Shakib Al Hasan's injury: Batting coach David HempBangladesh batting coach David Hemp said that he was not aware of any injury to Shakib Al Hasan's finger. Hemp reacted to the speculation made by Murali Karthik during commentary in the Chennai Test match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-ban-bangladesh-stick-to-positive-batting-against-attacking-indian-bowlers-2604147-2024-09-21",
      "headline": "Bangladesh stick to positive batting against attacking Indian bowlersIND vs BAN: Batting coach David Hemp said that Indian bowlers attacked the stumps, but also talked about the importance of Bangladesh batters sticking to their positive approach. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-aus-adil-rashid-becomes-1st-england-spinner-to-complete-200-odi-wickets-2604130-2024-09-21",
      "headline": "ENG vs AUS: Adil Rashid becomes 1st England spinner to complete 200 ODI wicketsAdil Rashid became the 1st spinner and only the 3rd England bowler to pick 200 ODI wickets. He achieved this feat during the 2nd ODI match between England and Australia by dismissing Glenn Maxwell."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-champions-cup-saim-ayub-babar-azam-century-stallions-panthers-2604120-2024-09-21",
      "headline": "Watch: Saim Ayub plunders 156 against Babar Azam's Stallions Pakistan Champions Cup: Saim Ayub smashed 156 runs off 130 balls with 13 fours and seven sixes, helping Panthers scored 326 for seven against Stallions at the Iqbal Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-finds-pleasure-seeing-rishabh-pant-score-his-comeback-ton-vs-ban-2604115-2024-09-21",
      "headline": "Shubman Gill finds pleasure seeing Rishabh Pant score his comeback ton vs BANShubman Gill said that he found pleasure in seeing Rishabh Pant scoring his 6th Test hundred after comeback to Test cricket. Gill was also content with his performance in 1st Test vs Bangladesh. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}