{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/budget-2026-7-key-takeaways-for-individual-taxpayers-2861880-2026-02-02",
      "headline": "Budget 2026: 7 key takeaways for individual taxpayersThe Union Budget 2026 may not have changed income tax rates, but it brings several practical updates that affect how individuals file returns, disclose income and deal with compliance. From easier timelines to simpler rules, here are the key takeaways taxpayers should know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/etf-investment-gone-wrong-silver-price-crash-gold-fall-what-investors-should-do-portfolio-down-2861873-2026-02-02",
      "headline": "Silver ETF takes a hit: Down Rs 2 lakh, what should investors do now?On the Multi Commodity Exchange (MCX), silver prices have dropped sharply from their record peak, while gold has also seen a strong correction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/silver-slides-after-record-highs-drops-nearly-rs-17000-what-should-investors-do-2861840-2026-02-02",
      "headline": "Silver prices crash Rs 17,000 today. More correction ahead?After touching record highs in recent weeks, silver prices have cooled sharply. The metal has slipped by nearly Rs 17,000, prompting investors to pause and reassess whether this fall is a buying opportunity or a sign to stay cautious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-944-points-higher-nifty-above-25000-ril-up-nse-bse-rally-2861837-2026-02-02",
      "headline": "Sensex ends 944 points higher: Why stock market rose today?The S&P BSE Sensex rallied 943.52 points to close at 81,666.46, while the NSE Nifty50 added 262.95 points to end at 25,088.40. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/from-stronger-banks-to-easier-credit-who-stands-to-gain-from-budget-2026-2861797-2026-02-02",
      "headline": "From stronger banks to easier credit: Who stands to gain from Budget 2026?A key announcement in the Budget was the proposal to set up a High-Level Committee on Banking for Viksit Bharat. The committee will undertake a comprehensive review of the sector and suggest reforms to align it with India's next stage of economic growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/nithin-kamath-stt-hike-wont-curb-fo-future-options-trading-budget-2026-2861788-2026-02-02",
      "headline": "Nithin Kamath says STT hike won't curb F&O trade. Here's whyIn the Union Budget 2026, Finance Minister Nirmala Sitharaman announced an increase in STT on futures and options trades."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cigarettes-to-cost-more-now-check-the-latest-prices-2861742-2026-02-02",
      "headline": "Cigarettes to cost more now: Check the latest pricesSmokers are now paying more at the counter. From February 1, cigarette prices have gone up following a fresh tax hike, marking the first increase in nearly seven years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-silver-price-drop-what-investors-should-do-now-2861730-2026-02-02",
      "headline": "Gold, silver prices continue to fall. Should you buy now?Gold and silver prices have tumbled sharply over the past few days. Read on to know the reason behind the rapid decline, and whether investors should buy or wait for further correction. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/budget-2026-why-government-increased-futures-options-trading-cost-stt-hike-what-means-investors-2861718-2026-02-02",
      "headline": "Why the government raised STT, making F&O trading more expensiveFinance Minister Nirmala Sitharaman made it clear in her Budget speech that the Securities Transaction Tax, or STT, will go up for derivatives trades from April 1, 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/why-long-term-capital-gains-are-back-in-the-spotlight-after-budget-2026-2861705-2026-02-02",
      "headline": "Why LTCG tax is back in the spotlight after Budget 2026After Budget 2026, long-term capital gains have emerged as a key talking point among investors and market watchers alike. So why is LTCG suddenly being discussed everywhere?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-prices-fall-after-record-rally-international-rates-india-mcx-silver-rates-2861630-2026-02-02",
      "headline": "Gold, silver extend losses today: Check latest MCX rates and city-wise pricesIn India, the correction in global prices has filtered into domestic bullion markets as well. Gold was priced at Rs 143,460 per 10 grams, down by Rs 4,780 or 3.22% as of 9:55 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-nifty-trade-higher-budget-announcement-reaction-2861622-2026-02-02",
      "headline": "Sensex, Nifty open flat but surge ahead a few minutes into early tradeThe S&P BSE Sensex was up 161.62 points to 80,884.56, while the NSE Nifty50 added 9.80 points to 24,835.25 as of 9:28 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-today-will-stock-market-crash-again-nse-bse-opening-stt-fii-outflows-2861615-2026-02-02",
      "headline": "Sensex, Nifty today: Will stock market crash again?Gift Nifty futures (GIFc1) were trading at 24,869.5 points at around 8:00 am. This suggests that the benchmark Nifty 50 index may open close to Sunday's closing level of 24,825.45."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/budget-2026-sgb-tax-change-capital-gains-explained-sovereign-gold-bond-2861601-2026-02-02",
      "headline": "Budget 2026: Will your Sovereign Gold Bond gains face higher tax?The tax benefit still exists, but it is now available only in a specific situation. Earlier, individual investors did not have to pay any capital gains tax if they held a Sovereign Gold Bond till maturity, but after the Budget 2026 announcement that has changed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/big-vision-tight-margins-why-execution-will-make-or-break-this-budget-2861556-2026-02-02",
      "headline": "Big vision, tight margins: Why execution will make or break this BudgetThe direction for Budget 2026 is right, but delivery will decide credibility. In that sense, this is a Budget that excites on paper while simultaneously inviting scrutiny on execution."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/budget/story/parliament-budget-allocation-nirmala-sitharaman-lok-sabha-rajya-sabha-2861555-2026-02-01",
      "headline": "Parliament gets Rs 1,492 crore in Budget 2026Parliament has been allocated Rs 1,492 crore in the Union Budget 2026 presented by Finance Minister Nirmala Sitharaman today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/macro-stability-is-not-to-be-sniffed-at-sanjeev-sanyal-calls-budget-2026-solid-no-nonsense-2861553-2026-02-01",
      "headline": "Macro stability is not to be sniffed at: Sanjeev Sanyal calls Budget 2026 solid, no-nonsenseEconomist and PM's Economic Advisory Council member Sanjeev Sanyal has described the Union Budget 2026 as a \"solid, no-nonsense\" exercise, arguing that fiscal consolidation and macro stability are its core strengths. He rejected the notion that the absence of \"big-bang\" announcements made the budget underwhelming."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/govt-raises-duty-free-goods-import-limit-rs-75000-under-new-baggage-rules-glbs-2861547-2026-02-01",
      "headline": "Govt raises duty-free goods import limit to Rs 75,000 under new baggage rulesA tourist of foreign origin, not being an infant, arriving in India, shall be allowed duty-free clearance of articles up to the value of Rs 25,000. This limit was Rs 15,000 under the Baggage Rules, 2016."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2026-mahatma-gandhi-national-rural-employment-guarantee-act-viksit-bharat-guarantee-for-rozgar-and-ajeevika-mission-gramin-2861515-2026-02-01",
      "headline": "MGNREGA cut, VB-G RAM G gets a boost: Union Budget 2026 signals a rural resetUnder the Budget, VB-G RAM G has been allocated Rs 95,692 crore, positioning it as the single largest component of the Department of Rural Development's spending. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/budget-ashwini-vaishnaw-outlines-indias-high-speed-rail-future-semiconductor-mission-20-2861504-2026-02-01",
      "headline": "Ashwini Vaishnaw outlines India's high-speed rail future, semiconductor mission 2.0Union Minister Ashwini Vaishnaw outlined initiatives for developing around 4,000 km high-speed network in India and the next phase of the India Semiconductor Mission, focusing on self-reliance and infrastructure growth."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/celina-jaitly-15-year-marriage-abuse-divorce-proceedings-2861869-2026-02-02",
      "headline": "Love can't fix what's broken: Celina Jaitly on 15 years of marriage Celina Jaitly's recent social media post outline her experience of a 15-year marriage marked by abuse, her reliance on writing for survival, and the legal actions initiated following her divorce filing against Peter Haag."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sonam-kapoors-ivory-look-is-a-lesson-in-elegant-maternity-dressing-see-pics-2861868-2026-02-02",
      "headline": "Sonam Kapoor's ivory look is a lesson in elegant maternity dressing. See pics Sonam Kapoor embraced understated maternity fashion at a Mumbai event, opting for a sculptural ivory ensemble by Dhruv Kapoor. Styled by Rhea Kapoor, the minimalist look balanced elegance and comfort, standing out for its quiet confidence. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/border-2-medha-rana-reveals-alia-bhatt-was-inspired-by-her-acting-exclusive-2861817-2026-02-02",
      "headline": "Border 2: Medha Rana reveals Alia Bhatt was 'inspired' by her acting | Exclusive Medha Rana opened up about the overwhelming response to Border 2 and the pressure of portraying a legacy role. In an exclusive interview, she also recalled earning praise from industry peers, including Alia Bhatt."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/karnataka-bulldozers-clinch-third-celebrity-cricket-league-title-sudeep-robo-walk-celebration-2861836-2026-02-02",
      "headline": "Kichcha Sudeep mimics Rohit Sharma's Robo Walk after CCL triumph Karnataka Bulldozers, captained by Kichcha Sudeep, ended a 12-year wait by winning the Celebrity Cricket League 2026 title. Sudeep's victory celebration, inspired by Rohit Sharma, went viral across social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ahan-shetty-on-why-father-suniel-skipped-border-2-reprises-maa-shakti-dialogue-2861839-2026-02-02",
      "headline": "Ahan Shetty reveals why father Suniel hasn't watched Border 2 yet In an exclusive interview with India Today, Ahan Shetty spoke about 'Border 2' success and how his father, Suniel Shetty, is yet to watch his performance in the war drama. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/vin-diesel-confirms-fast-furious-finale-in-moving-post-shares-release-date-title-2861833-2026-02-02",
      "headline": "Vin Diesel confirms Fast & Furious finale in moving post, shares release date, title The Fast & Furious franchise will reach its conclusion with Fast Forever, set to release in 2028. Vin Diesel confirmed the news with a tribute to Paul Walker, marking the end of an era for the iconic action series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/banned-in-theatres-dhurandhar-trends-no-1-on-netflix-pakistan-pics-go-viral-2861841-2026-02-02",
      "headline": "Banned in theatres, Dhurandhar trends No. 1 on Netflix Pakistan; pics go viral Dhurandhar enjoys strong reception and hits number one on Netflix in Pakistan. Viewers praised the film's representation of Pakistanis, performances and characterisations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/parag-tyagi-resumes-work-for-the-first-time-after-wife-shefali-jariwala-death-2861829-2026-02-02",
      "headline": "Parag Tyagi resumes work for the first time after wife Shefali Jariwala's death Parag Tyagi resumed his acting career after an eight-month break following the death of his wife, Shefali Jariwala. He shared a promo of his upcoming television show on Instagram."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ram-charan-upasana-twins-birth-allu-arjun-congratulates-2861811-2026-02-02",
      "headline": "Allu Arjun congratulates Ram Charan on twins: Double the love, double the joy Pushpa actor Allu Arjun congratulated Ram Charan and Upasana on the birth of their twins. The actor shared the message on X, while addressing the latest additions to the Mega family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/imran-khan-slams-stars-exploiting-the-film-industry-by-charging-massive-fees-2861801-2026-02-02",
      "headline": "Imran Khan slams stars exploiting the film industry by charging massive fees Actor Imran Khan criticised stars exploiting their films with huge fees. He also praised his uncle, actor Aamir Khan, for treating film projects with a sense of personal accountability and ownership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/can-this-love-be-translated-director-yoo-young-eun-on-kim-seon-ho-go-youn-jung-exclusive-2861769-2026-02-02",
      "headline": "Can This Love Be Translated: Director on Kim Seon-ho, Go Youn-jung | Exclusive Can This Love Be Translated director Yoo Young-eun revealed how quiet choices, moral conflicts and restrained emotions shaped Ho-jin and Mu-hee's evolving love story. In an exclusive interview, she broke down key episodes, performances by Kim Seon-ho and Go Youn-jung, and the series' most defining moments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/justin-bieber-hailey-bieber-ice-protest-2026-grammys-viral-style-return-2861803-2026-02-02",
      "headline": "Grammys 2026: Hailey and Justin Bieber twin in black for stylish red carpet return Justin and Hailey Bieber made a stylish return to the Grammys' red carpet in twinning black outfits. The couple made a bold statement by protesting against ICE operations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dhurandhar-viral-scene-aditya-dhar-explains-detailing-after-fans-praise-his-vision-2861782-2026-02-02",
      "headline": "Dhurandhar viral scene: Aditya Dhar explains detailing after fans praise his vision Amid a viral scene from 'Dhurandhar', director Aditya Dhar explained the minute detailing behind it, revealing how even the smallest visual choices were carefully designed to define the characters and elevate the realism of the moment. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bridgerton-4-part-1-ending-explained-sophie-benedict-and-the-problem-with-more-2861764-2026-02-02",
      "headline": "Bridgerton 4 Part 1 ending explained: Sophie, Benedict, and the problem with 'more' At the end of Bridgerton Season 4 Part I, Benedict's confession to Sophie promises \"more\" but delivers a devastating truth about love and class. Here's why his offer forces Sophie to walk away, and what it sets up next."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/on-this-day-in-1989-satyajit-ray-received-france-highest-civilian-honour-2861710-2026-02-02",
      "headline": "On this day in 1989, Satyajit Ray received France's highest civilian honour Satyajit Ray was conferred with France's highest civilian award, the Legion of Honour, on February 2, 1989. Then French President Francois Mitterrand arrived in Kolkata to present the filmmaker with this prestigious French national order of merit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/blackpink-as-if-its-your-last-1-5-billion-views-global-k-pop-dominance-2861729-2026-02-02",
      "headline": "As If It's Your Last becomes BLACKPINK's 4th video to reach 1.5 billion views BLACKPINK's music video for As If It's Your Last surpassed 1.5 billion YouTube views on February 2, becoming their fourth official video to achieve this feat and reflecting the group's enduring global impact."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/the-50-day-1-reality-tv-show-highlights-himesh-reshamiya-musical-task-first-eviction-and-more-2861724-2026-02-02",
      "headline": "The 50 Day 1 highlights: Himesh Reshamiya's musical task, first eviction and more The first episode of the reality show The 50 featured 50 celebrities stepping into the Lion's Palace. The episode featured a music-based task, notable clashes, and the season's earliest elimination."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/justin-bieber-shirtless-grammy-awards-2026-look-sparks-mixed-reactions-online-2861731-2026-02-02",
      "headline": "Justin Bieber's shirtless Grammy look sparks mixed reactions online: Risky choice Justin Bieber made a striking return to the Grammy stage in 2026 with a high-energy performance of Yukon and a daring fashion choice that set social media buzzing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/the-50-first-impression-forget-bigg-boss-and-squid-game-this-reality-show-is-wild-2861683-2026-02-02",
      "headline": "The 50 first impression: Forget Bigg Boss and Squid Game, this is reality chaos 'The 50' on Colors and Jio Hotstar is a high-octane reality show that blends survival drama with celebrity chaos. Fifty contestants, including TV stars and digital influencers, compete in an isolated palace and are not bound by any rules. Read what happens next."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-quotes-from-ex-army-chiefs-memoir-in-parliament-government-objects-says-its-not-published-2861766-2026-02-02",
      "headline": "Rahul Gandhi quotes ex-Army chief's memoir, Rajnath Singh objects, then fiery clash UpdatesThe Lok Sabha was adjourned for the day after Rahul Gandhi once again stood firm on his assertions over former Army chief MM Naravane's unpublished memoir when Parliament resumed for the third time in the past two hours."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-balochistan-liberation-army-woman-fidayee-fidayeen-suicide-attacker-viral-video-shoots-soldier-war-conflict-2861738-2026-02-02",
      "headline": "Video: Baloch woman fidayeen rains bullets on Pak soldier, dies minutes laterA video of one of the woman 'fidayeen' (suicide) attackers of the Balochistan Liberation Army, killing a Pakistani soldier during a large-scale attack in the country's province, has gone viral on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/sonam-wangchuk-wants-ladakh-to-become-nepal-or-bangladesh-centre-defends-his-detention-in-supreme-court-2861896-2026-02-02",
      "headline": "Sonam Wangchuk wants Ladakh to become Nepal: Govt defends detention in Supreme CourtThe Centre told the Supreme Court that Sonam Wangchuk's speeches sought to incite Ladakh's youth and push the region towards unrest similar to Nepal, Bangladesh and Sri Lanka, posing a threat to national security."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/china-xi-jinping-military-purge-water-instead-of-fuel-beijing-nuclear-missiles-zhang-youxia-arrest-2861699-2026-02-02",
      "headline": "Water instead of fuel in China's nuclear missiles led to Xi's military purge?The fall of Zhang Youxi, China's top uniformed military officer, in President Xi Jinping's purge might have to do with corruption, espionage and the PLA's operational readiness. Chinese missiles were found to have been filled with water instead of fuel, which led to the removal of the PLA Rocket Force's leadership in 2023 and 2024. Zhang is said to have passed on China's nuclear secrets to the US, and could be linked to the Rocket Force purge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-t20-world-cup-boycott-india-match-hypocrisy-future-trouble-2861677-2026-02-02",
      "headline": "No win, no learn: Pak's selective boycott is a masterclass in hypocrisyT20 World Cup 2026: Pakistan's selective boycott of the India match isn't principle but panic. It is a tantrum that mocks history, hurts its cricket, and leaves Islamabad howling alone while the world plays on."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/taiwanese-chipmaker-foxconn-faces-tax-row-in-karnataka-locals-warn-of-mass-protest-2861669-2026-02-02",
      "headline": "Taiwanese chipmaker Foxconn faces tax row in Karnataka, locals warn of protestFoxconn Hon Hai Technology India faces serious allegations from Bengaluru Rural Gram Panchayat over tax evasion, building regulation breaches and neglecting local employment in Karnataka villages. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/will-sue-that-loser-donald-trump-fumes-after-trevor-noah-epstein-joke-at-grammys-2861856-2026-02-02",
      "headline": "Will sue that loser: Trump fumes after Trevor Noah's Epstein joke at GrammysCalling Trevor Noah's remarks \"defamatory,\" Trump said he had never visited the island and questioned how the comedian could make such an accusation when, he claimed, not even the \"fake news media\" had dared to do so."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/story/mamata-banerjee-delhi-visit-ec-office-gyanesh-kumar-bengal-elections-sir-tmc-bjp-2861723-2026-02-02",
      "headline": "Delhi Police torturing Bengalis: Mamata Banerjee ahead of meet with poll chiefAhead of her meeting with Chief Election Commissioner Gyanesh Kumar, Mamata Banerjee visited Banga Bhawan in Delhi, alleging that people from Bengal were being intimidated by Delhi Police. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/norway-crown-princess-mette-marit-jeffrey-epstein-sex-offender-fresh-files-email-wife-hunt-scandinavians-tickle-my-brain-controversy-apology-2861654-2026-02-02",
      "headline": "I'm on wife hunt, Epstein emailed Norway Crown Princess. Her responseThe shocking email exchanges, revealed in the latest batch of files, between sex offender Jeffrey Epstein and Norway Crown Princess Mette-Marit show the friendship between the two. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/balochistan-liberation-army-pakistan-attacks-suicide-fidayeen-release-photos-women-visuals-civilians-security-forces-killed-isi-2861593-2026-02-02",
      "headline": "Baloch militant group releases photos of two suicide attackers. Both were womenThe Balochistan Liberation Army (BLA), which has claimed responsibility for the recent deadly and large-scale attack in Pakistan province, has released photos of two of their 'fidayee' (suicide) attackers and both are women."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/committed-anti-chinese-separatist-activity-under-religions-guise-china-opposes-grammy-award-to-dalai-lama-2861843-2026-02-02",
      "headline": "Anti-Chinese activity under religion's guise: China opposes Grammy to Dalai LamaThe Tibetan spiritual leader, Tenzin Gyatso, won his first Grammy on Sunday in the Best Audio Book, Narration and Storytelling Recording category for his spoken-word album \"Meditations: The Reflections of His Holiness the Dalai Lama\" at the 68th annual Grammy Awards in Los Angeles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/modi-government-national-population-register-rs-6000-crore-union-budget-allocation-nrc-caa-census-2027-2861721-2026-02-02",
      "headline": "Modi govt hasn't forgotten National Population Register, reveals Rs 6,000 croreThe Centre has allocated Rs 6,000 crore for the 2027 Census and the National Population Register (NPR) in the Union Budget. The allocation comes despite a notification for the NPR not being issued yet. The NPR courted controversy as it was seen as the first step to the National Register of Citizens (NRC)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/indian-touch-on-grammys-red-carpet-om-necklace-sabyasachi-magic-2861795-2026-02-02",
      "headline": "Indian touch on Grammys red carpet ft. Om necklace, Sabyasachi magicFrom Kelsea Ballerini's Sabyasachi earrings to Lara Raj's 'Om necklace', Indian fashion also shone bright at the Grammys 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/india-european-union-fta-eu-trade-deal-pakistan-bangladesh-textile-exporters-unsettled-trading-relations-islamabad-dhaka-2860616-2026-02-02",
      "headline": "Why the big-bang India-EU FTA has rattled both Pakistan and BangladeshExporters in both Pakistan and Bangladesh have warned that the India-EU Free Trade Agreement (FTA) could erode their hard-won advantages in the lucrative European market as Indian goods gain duty-free access. Hinting at India's Operation Sindoor, an official of a Pakistani traders' association said that Delhi had \"opened an economic front\" against Islamabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-t20-world-cup-pakistan-boycott-threat-board-meeting-sanctions-2861650-2026-02-02",
      "headline": "ICC may call board meet on Pakistan boycott threat, severe sanctions likelyThe ICC is set to meet soon to discuss Pakistan's threat to boycott the T20 World Cup match against India. On Sunday, the global body warned Pakistan of the possible implications and urged the Pakistan Cricket Board to take a decision in the best interests of global cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bridgerton-4-part-1-ending-explained-sophie-benedict-and-the-problem-with-more-2861764-2026-02-02",
      "headline": "Bridgerton 4 Part 1 ending explained: Sophie, Benedict, and the problem with 'more'At the end of Bridgerton Season 4 Part I, Benedict's confession to Sophie promises \"more\" but delivers a devastating truth about love and class. Here's why his offer forces Sophie to walk away, and what it sets up next."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/oppenheimer-tk-radha-indian-physicist-robert-oppenheimer-princeton-institute-research-science-news-physics-news-2861440-2026-02-02",
      "headline": "Meet TK Radha: Indian scientist who stunned the father of the atom bombTK Radha was a brilliant Indian physicist who earned a rare invitation from Robert Oppenheimer to conduct research at Princeton. She had an incredible journey from a Kerala village to the global stage of theoretical physics.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/budget-session-2026-news-live-updates-fm-nirmala-sitharaman-income-tax-rahul-gandhi-speech-2861588-2026-02-02",
      "headline": "Live: PM ran away, says Rahul Gandhi after chaos over Naravane memoirParliament Budget Session Live Updates: Finance Minister Nirmala Sitharaman on Sunday tabled the Union Budget for 2026–27, marking her ninth straight budget presentation in Parliament. The BJP described the budget as a decisive move toward building a developed India and hit out at the Opposition for branding it 'lacklustre' and 'hollow'. The ruling party said it did not need validation from critics, asserting that the public reposes trust in Prime Minister Narendra Modi. Countering the government's claims, Leader of Opposition Rahul Gandhi said the budget ignored the country's real crises, while Congress MP and general secretary (organisation) KC Venugopal termed it \"completely hollow\". Stay tuned to indiatoday.in for the latest updates on the ongoing Budget Session. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/bryan-johnson-recalls-disturbing-zoom-meeting-with-jeffrey-epstein-us-news-2861815-2026-02-02",
      "headline": "Sick to my stomach: 'Age-reversing' CEO Bryan Johnson recalls Epstein callKernel founder Bryan Johnson recalls his brief video call with Jeffrey Epstein eight years ago, saying that the Zoom video call convinced him that he was \"a very dark person.\"\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/delhi-school-fee-regulation-sc-says-no-urgency-to-intervene-2861794-2026-02-02",
      "headline": "No fee control this year: School fee fight pauses as Supreme Court steps backThe Supreme Court granted interim relief to the Delhi government in the private school fee regulation case after the government clarified that its new fee committee rules will not apply this academic year. The court left all legal questions open for consideration by the Delhi High Court."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/bengaluru-schoolkids-bring-fruits-for-teacher-every-day-after-she-mentions-liking-them-viral-video-2861223-2026-02-01",
      "headline": "Bengaluru schoolkids bring fruits for teacher after she mentions liking themAn Instagram video shared by Deepali Dahikamble, a Teach For India fellow based in Bengaluru, is winning hearts for capturing the generous gesture of her students."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/indian-origin-republican-diplomat-nikki-haley-son-nalin-calls-india-cheap-questions-ties-with-america-us-india-news-2861700-2026-02-02",
      "headline": "Indian govt is cheap, hasn't been good ally to US: Nikki Haley's son at it againNalin Haley, son of Indian-origin diplomat and Republican leader Nikki Haley, has mounted a fresh attack against India. After a video of Ohio gubernatorial candidate Vivek Ramaswamy speaking of the need for the US to prioritise India over China resurfaced, Nalin argued that India was run by a cheap government profiting off cheap labour exports to the US."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/zohran-mamdani-heckled-over-mother-mira-nair-jeffrey-epstein-link-new-york-mayor-protest-2861670-2026-02-02",
      "headline": "Shame: Zohran Mamdani heckled after mother Mira Nair's name in Epstein FilesZohran Mamdani was heckled by protestors outside the New York mayor's residence following revelations linking his mother Mira Nair to Jeffrey Epstein. The incident follows the release of millions of pages of Epstein-related documents by the US Justice Department."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/supreme-court-grants-bail-to-three-accused-of-tampering-blood-samples-in-2024-pune-porsche-crash-that-killed-2-2861688-2026-02-02",
      "headline": "Porsche crash: Supreme Court grants bail to 3 accused of swapping blood samplesThe Supreme Court has granted bail to three accused of swapping blood samples in the 2024 Pune Porsche crash that killed two techies, Aneesh Awadhiya and Ashwini Koshta."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-breaks-kohli-t20i-fifty-record-pakistan-whitewash-australia-3-0-2861876-2026-02-02",
      "headline": "Babar Azam breaks Virat Kohli's record, bounces back to form ahead of T20 World Cup Babar Azam broke Virat Kohli's record for most T20I fifties as Pakistan dominated Australia in a 3-0 series whitewash. Pakistan have warmed up in style for the upcoming T20 World Cup by defeating Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bharti-fulmali-online-hate-mental-toll-india-women-cricket-wpl-gujarat-giants-2861857-2026-02-02",
      "headline": "India batter reveals dark side of facing hate, trolls over her looks WPL 2026: India Women's batter Bharti Fulmali has spoken candidly about enduring online hate and trolling over her looks, admitting the mental toll it has taken over the last three years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/formula-1-indian-grand-prix-government-efforts-buddh-international-circuit-2861812-2026-02-02",
      "headline": "Will F1 return to India? Efforts underway to bring race back to Buddh circuit The Indian government is actively working to bring back the Formula 1 Grand Prix to the Buddh International Circuit after more than 10 years. Efforts focus on resolving tax and regulatory issues that previously caused the event's cancellation, signalling a potential revival in the near future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-vp-rajiv-shukla-backs-icc-warning-to-pakistan-over-india-t20-world-cup-boycott-2861810-2026-02-02",
      "headline": "ICC right to warn Pakistan over India boycott in T20 World Cup: Rajeev Shukla BCCI vice-president Rajeev Shukla has supported the ICC's decision to warn Pakistan of severe repercussions for its selective pullout from the high-profile T20 World Cup clash against India in Colombo on February 15."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/anahat-singh-wins-psa-bronze-squash-title-beats-world-number-10-2861793-2026-02-02",
      "headline": "Watch out for Anahat at LA Olympics: India proud as squash star wins major title Parth Jindal, founder of JSW Sports, hailed Anahat Singh's maiden PSA Bronze-level title and said the entire nation should keep an eye on the young squash star at the 2028 Olympics in Los Angeles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-t20-world-cup-2026-warm-up-matches-schedule-live-streaming-details-2861781-2026-02-02",
      "headline": "ICC announces T20 World Cup warm-up match fixtures, livestreaming details T20 World Cup 2026: A total of 16 warm-up matches will be played between February 2 and 6 across four venues in India and Sri Lanka. While Suryakumar Yadav-led India will take on South Africa on February 4, India A, led by Ayush Badoni, will play two warm-up matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-india-a-tilak-varma-injury-return-warm-up-matches-ayush-badoni-2861780-2026-02-02",
      "headline": "T20 World Cup: Fit-again Tilak Varma included in India A squad for warm-ups Tilak Varma returns to action as India include him in the India A warm-ups, marking his final fitness test before the T20 World Cup. The two matches will decide how soon he rejoins the senior side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-kangaroo-tattoo-australian-open-career-grand-slam-2861706-2026-02-02",
      "headline": "Carlos Alcaraz plans kangaroo tattoo to celebrate his Australian Open title win Fresh off a career-defining triumph, Carlos Alcaraz is considering a permanent reminder of his Australian Open glory in the form of a small kangaroo tattoo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-t20-world-cup-boycott-india-match-hypocrisy-future-trouble-2861677-2026-02-02",
      "headline": "No win, no learn: Pak's selective boycott is a masterclass in hypocrisy T20 World Cup 2026: Pakistan's selective boycott of the India match isn't principle but panic. It is a tantrum that mocks history, hurts its cricket, and leaves Islamabad howling alone while the world plays on."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-pakistan-india-match-boycott-necessary-stand-mohammad-yousaf-selective-influence-2861652-2026-02-02",
      "headline": "Batting great backs Pak's India boycott, alleges selective influence in ICC Pakistan's boycott of the India clash has sparked fresh debate across world cricket. Backed by Mohammad Yousaf, the move is being pitched as a stand against selective influence, not just a one-off protest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-t20-world-cup-pakistan-boycott-threat-board-meeting-sanctions-2861650-2026-02-02",
      "headline": "ICC may call board meet on Pakistan boycott threat, severe sanctions likely The ICC is set to meet soon to discuss Pakistan's threat to boycott the T20 World Cup match against India. On Sunday, the global body warned Pakistan of the possible implications and urged the Pakistan Cricket Board to take a decision in the best interests of global cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-pakistan-india-match-boycott-what-about-final-kevin-pietersen-r-ashwin-2861628-2026-02-02",
      "headline": "Boycott India match, but what about the final? Ex-cricketers question Pak stancePakistan's decision to boycott the India match has opened a bigger question. If the teams meet again later in the tournament, will Pakistan walk away from a World Cup final too?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-delhi-capitals-vs-up-warriorz-reports-eliminator-qualified-playoffs-mumbai-indians-crash-out-2861621-2026-02-02",
      "headline": "Delhi Capitals edge past UP Warriorz to book WPL 2026 Eliminator spot, MI bow outDelhi Capitals survived a late wobble to beat UP Warriorz and seal a WPL Eliminator berth. The five-wicket win also knocked defending champions Mumbai Indians out of the playoff race."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-united-vs-fulham-casemiro-jamie-carragher-football-has-not-left-u-turn-2861602-2026-02-02",
      "headline": "Football hasn't left Man United's Casemiro: Carragher makes U-turn after Fulham showCasemiro rolled back the years to run the show against Fulham. Jamie Carragher, once his harshest critic, admitted he was wrong as Manchester United's midfield general delivered a vintage, match-winning performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-novak-djokovic-carlos-alcaraz-jannik-sinner-duopoly-2861597-2026-02-02",
      "headline": "Benjamin Button of the baseline: Djokovic, at 38, is still the great disruptorAt 38, Novak Djokovic fell short of a 25th major but shook tennis' new order. His Australian Open run showed Carlos Alcaraz and Jannik Sinner's duopoly is strong, not settled, and still vulnerable to the sport's greatest survivor ever produced."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-pakistan-boycott-india-match-rashid-latiff-drama-far-from-over-icc-warning-2861592-2026-02-02",
      "headline": "IND vs PAK fiasco won't end here: Former Pakistan skipper on T20 World Cup boycott rowRashid Latif has warned that Pakistan's T20 World Cup boycott threat could spark prolonged chaos beyond one tournament. With future ICC events at stake, the former captain believes the controversy is only beginning."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sunil-gavaskar-pakistan-t20-world-cup-boycott-reversal-icc-warning-2861583-2026-02-02",
      "headline": "Gavaskar trolls Pakistan's India boycott: Like their cricketers, a U-turn awaitsSunil Gavaskar took a swipe at Pakistan's India boycott call at the T20 World Cup, saying mounting pressure could force a U-turn, just as their cricketers have often reversed retirement decisions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-icc-statement-on-pakistan-india-match-boycott-2861548-2026-02-01",
      "headline": "ICC warns Pakistan of long-term implications over boycotting T20 WC clash vs IndiaThe International Cricket Council (ICC) has reacted strongly against Pakistan's government's decision to boycott their match against India in the T20 World Cup 2026. ICC has warned the Pakistan Cricket Board (PCB) about large scale implications of their decision, saying that their stance is difficult to reconcile."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sunil-gavaskar-icc-sanction-pakistan-boycott-india-t20-world-cup-2026-2861536-2026-02-01",
      "headline": "ICC must impose strict sanctions on Pakistan for boycotting India game: GavaskarSunil Gavaskar has urged the ICC to take strict action against Pakistan for boycotting India in the T20 World Cup 2026. The move could lead to severe penalties affecting Pakistan's cricketing future and its ICC tournament hosting rights."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-2026-ind-vs-pak-controversy-india-travel-sri-lanka-pre-match-duties-pakistan-boycott-2861527-2026-02-01",
      "headline": "India to fly to SL, do usual pre-match duties despite Pakistan boycott: SourcesT20 World Cup 2026: According to sources, the Indian team will travel to Sri Lanka, complete their scheduled pre-match preparations, and await the match referee's decision should Pakistan fail to take the field following the news of their boycott of the game against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/salman-agha-pakistan-boycott-india-t20-world-cup-reacts-2861518-2026-02-01",
      "headline": "Salman Agha reacts after Pakistan's decision to boycott T20 World Cup game vs IndiaPakistan skipper Salman Agha reacted to the government's decision to boycott their T20 World Cup match against India. The Government of Pakistan confirmed that the team would participate in the tournament but would not take the field against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-boycott-india-match-icc-t20-world-cup-sanctions-possible-2861508-2026-02-01",
      "headline": "Will ICC punish Pakistan for boycotting India at T20 World Cup?The International Cricket Council has reportedly not received any official or written communication from the Pakistan Cricket Board regarding its decision to boycott India in the ICC Men's T20 World Cup. Sources told India Today that the ICC would consider any action or sanctions only after the PCB formally communicates its position."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-qualify-under-19-world-cup-2026-semi-finals-beating-pakistan-2861507-2026-02-01",
      "headline": "U-19 World Cup: India thrash Pakistan by 58 runs to seal semi-final berthUnder 19 World Cup, IND vs PAK: India qualified for the semi-finals of the Under-19 World Cup 2026 after beating Pakistan by 58 runs at Queens Sports Club in Bulawayo. Asked to chase a target of 253 runs, Pakistan got all out for 194 runs in 46.2 overs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-honours-novak-djokovic-resilience-australian-open-final-2861501-2026-02-01",
      "headline": "Carlos Alcaraz doffs hat to Novak Djokovic for silencing doubtersAustralian Open: Carlos Alcaraz heaped praise on Novak Djokovic for proving the naysayers wrong by qualifying for the final at Melbourne. Djokovic beat Jannik Sinner in the semis, but lost to Alcaraz in four sets in the final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-chases-25th-grand-slam-australian-open-final-loss-vs-carlos-alcaraz-2861489-2026-02-01",
      "headline": "Novak Djokovic refuses to give up on 25th Grand Slam dream: I always believe I canNovak Djokovic is not ready to walk away from his pursuit of a record-extending 25th Grand Slam title, even after suffering his first-ever defeat in an Australian Open final on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-doubters-historic-australian-open-career-grand-slam-2861477-2026-02-01",
      "headline": "Carlos Alcaraz sounds alarm to his doubters after historic Australian Open winAustralian Open 2026: Carlos Alcaraz hit back at his critics after becoming the youngest man to complete the Career Grand Slam, defeating Novak Djokovic in four sets to win the Australian Open."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-t20-world-cup-boycott-mohsin-naqvi-bcci-2861488-2026-02-01",
      "headline": "Pakistan to boycott India match at T20 World Cup, ICC warns of falloutPakistan will play the T20 World Cup but will not play their match against India, confirmed the country's government on Sunday, February 1. Pakistan were set to clash against India on February 15 in Colombo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-whitewash-australia-t20i-series-lahore-mohammad-nawaz-2861474-2026-02-01",
      "headline": "Pakistan warm up for T20 World Cup with historic T20I series clean sweep vs AustraliaPAK vs AUS, 3rd T20I: Salman Ali Agha's Pakistan hammered Australia by 111 runs in the third T20I to complete a 3-0 whitewash as a big boost before the T20 World Cup. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ranji-trophy-karnataka-andhra-jharkhand-jk-through-to-quarterfinals-with-mumbai-2861470-2026-02-01",
      "headline": "Karnataka, Andhra, Jharkhand, J&K through to quarterfinals with MumbaiKarnataka, Andhra, Jharkhand and Jammu & Kashmir sealed their places in the Ranji Trophy quarterfinals on a dramatic final day of group-stage action, joining already-qualified Mumbai in the knockout round."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-beats-novak-djokovic-australian-open-2026-nadal-tribute-2861453-2026-02-01",
      "headline": "Novak Djokovic's moving shoutout to Rafael Nadal steals spotlight after Aus Open finalNovak Djokovic paid an emotional tribute to Rafael Nadal during the Australian Open ceremony, honouring the 22-time Grand Slam champion who watched from the stands. Despite dominating the first set, Djokovic ultimately fell to Carlos Alcaraz, who completed a Career Grand Slam."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}