{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-tumbles-500-points-why-is-the-stock-market-falling-today-2791392-2025-09-22",
      "headline": "Sensex tumbles 500 points: Why is the stock market falling todayThe S&P BSE Sensex was down 503.31 points at 82,122.92 by 2:55 pm, while the NSE Nifty50 slipped 143.80 points to 25,183.20. Volatility surged across broader market segments, with most indices in the red. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/h1b-visa-fee-hike-indian-it-sector-demand-slowdown-investor-caution-2791384-2025-09-22",
      "headline": "IT sector faces H-1B visa jitters: Should you keep your money parked or sell?Recent changes to the H-1B visa programme have triggered new worries for Indian IT companies, already facing weaker client demand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/turning-50-here-how-to-protect-your-retirement-savings-explains-financial-advisor-2791255-2025-09-22",
      "headline": "Turning 50? Here's how to protect your retirement savings, explains financial advisorHitting 50 can be a mix of pride and worry, especially when it comes to money. Even after years of saving and investing, many fear their retirement funds may not last as long as planned. Here are expert tips to safeguard your savings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/errors-in-itr-filing-3-simple-ways-to-fix-it-revise-rectify-or-update-2791213-2025-09-22",
      "headline": "Errors in ITR filing? 3 simple ways to fix it: Revise, rectify or updateWorried about spotting a mistake in your ITR after filing? You're not alone. Errors happen to many taxpayers. Thankfully, the system gives you not one but three ways to fix them. Let's have a look."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/stock-market-tip-still-bet-on-it-stocks-h-1b-visa-worries-information-technology-shares-2791227-2025-09-22",
      "headline": "Should you still bet on IT stocks as H-1B visa worries resurface?The US move on H-1B visa has stirred fears of rising costs and tighter restrictions on tech firms that rely on sending skilled workers to client locations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/gst-20-rate-cut-groceries-electronic-items-get-cheaper-this-festive-season-2791141-2025-09-22",
      "headline": "GST 2.0 rate cut: Groceries, electronic items get cheaper this festive seasonThis report examines the impact of GST rate changes on household budgets, focusing on groceries and electronics. Items like chocolates and shampoos are now cheaper, with shampoos moving from an 18% to a 5% tax bracket. In contrast, aerated drinks are subject to a 'sin tax'. The report highlights significant savings, noting, \"an average saving of 10% will mean 5000 rupees per month saving\" for a consumer with a monthly income of one lakh rupees. The changes are presented as a \"festive gift from the Modi government,\" with major electronics also seeing price drops. Televisions over 32 inches, previously in a 28% slab, are now taxed at 18%, resulting in substantial savings for consumers looking to upgrade. Washing machines, refrigerators, and dishwashers also benefit from a 10% tax reduction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-gst-rates-goods-and-services-cheaper-live-updates-pm-modi-business-2791149-2025-09-22",
      "headline": "Live: GST 2.0 kicks off, BJP urges traders to pass on relief to consumersThe GST Council has approved major tax reforms effective today, September 22, introducing a simplified two-rate structure of 5% and 18% to ease compliance and lower costs. Essential items like soaps, shampoos, bicycles, and packaged foods will now attract 5% GST, while appliances such as ACs and large TVs will be taxed at 18%, down from 28%. Luxury and sin goods, including tobacco and high-end cars, will continue to face a 40% levy plus compensation cess. Follow Indiatoday.in for latest updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/tech-mahindra-tcs-infosys-why-are-it-stocks-falling-today-h1b-visa-stricter-norms-fees-2791142-2025-09-22",
      "headline": "Tech Mahindra, TCS, Infosys: Why are IT stocks falling today?Tech Mahindra was the worst hit, sliding nearly 5% in early trade. Infosys, Tata Consultancy Services (TCS), HCLTech and Wipro also fell more than 2.5% each. The Nifty IT index shed almost 3%, making it one of the day's worst-performing sectoral indices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-down-346-points-nifty-below-25300-tech-mahindra-tanks-6-percent-2791136-2025-09-22",
      "headline": "Sensex down 346 points, Nifty below 25,300; Tech Mahindra tanks 6%The S&P BSE Sensex was down by 267.56 points to 82,358.67, while the NSE Nifty50 lost 48.60 points to 25,278.45​​​​​​​ as of 9:25 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/h-1-b-visa-kunal-bahl-radhika-gupta-consoles-techies-return-to-india-work-here-trump-2791133-2025-09-22",
      "headline": "Kunal Bahl, rejected for H-1B, consoles techies: I did well in India, didn't I?While India has long been the biggest beneficiary of H-1B visas, accounting for 71% of all approvals last year, uncertainty has cast a shadow over careers, education plans and the information technology industry. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-reforms-today-price-changes-everyday-goods-milk-dairy-sin-ultra-luxury-pm-modi-india-tax-2791115-2025-09-22",
      "headline": "GST 2.0 kicks in: What changes in your shopping bill from today Live UpdatesThe government expects GST 2.0 to reduce compliance challenges, cut disputes, and make goods and services cheaper for households. Read on to know which items get cheaper and which turn costlier from today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/new-gst-rates-from-september-22-cheaper-costlier-list-of-products-list-2790847-2025-09-21",
      "headline": "GST 2.0 comes into effect: What's cheaper and costlier from todayAs the new rates under GST 2.0 come into effect from Monday, Prime Minister Narendra Modi said the reforms will boost savings for households, farmers, shopkeepers, and businesses."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/uorfi-javed-meets-salman-khan-bigg-boss-19-weekend-ka-vaar-set-experience-2791281-2025-09-22",
      "headline": "Uorfi meets Salman on Bigg Boss 19 set, says was too nervous to ask for pictureA visit to the 'Bigg Boss 19' sets on Weekend Ka Vaar turned into a special moment for social media star Uorfi Javed as she met the host Salman Khan. She shared that the actor was her childhood crush and revealed that she was too nervous to ask him for a picture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pawan-kalyan-they-call-him-og-trailer-emraan-hashmi-telugu-debut-2791398-2025-09-22",
      "headline": "They Call Him OG trailer: Pawan Kalyan returns with high-voltage actionPawan Kalyan makes a powerful return to Telugu cinema with the much-awaited trailer of 'They Call Him OG', promising a blend of intense action and emotional depth. The film, featuring a high-stakes clash between Kalyan and Emraan Hashmi, is all set to release on September 25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-begins-drishyam-3-shoot-after-dadasaheb-phalke-award-2023-2791389-2025-09-22",
      "headline": "Bringing Georgekutty's world alive once again: Mohanlal says as Drishyam 3 beginsMohanlal commenced filming 'Drishyam 3' with a pooja ceremony on September 22. The actor shared images and a message highlighting the return to Georgekutty's world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/two-much-with-kajol-and-twinkle-salman-aamir-bring-double-the-fun-on-talk-show-2791324-2025-09-22",
      "headline": "Two Much with Kajol and Twinkle: Salman-Aamir bring double the fun on talk showPrime Video is launching a fresh talk show 'Two Much with Kajol and Twinkle' on September 25, featuring Salman Khan and Aamir Khan in its debut episode. The show promises candid chats, fun games, and heartfelt stories, giving fans a rare glimpse into the stars' personal lives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/deepika-padukone-king-announcement-reply-to-critics-work-values-2791276-2025-09-22",
      "headline": "Why Deepika Padukone's King announcement is her hold-my-crown-moment for hatersDeepika Padukone announced her role in Shah Rukh Khan's 'King' after exiting two major Telugu projects. And that announcement is her not-so-subtle reply to her critics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/adele-super-bowl-2026-halftime-autobiography-munich-residency-record-2791203-2025-09-22",
      "headline": "Adele in talks for 2026 Super Bowl halftime show: ReportsAdele is reportedly negotiating a performance at the 2026 Super Bowl halftime show, nearly a decade after previously declining the opportunity. Alongside these discussions, the singer is said to have agreed to a multi-million pound deal for an autobiography and continues to enjoy significant financial and artistic success."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/gauahar-khan-criticises-amaal-mallik-racist-abusive-remarks-bigg-boss-19-2791288-2025-09-22",
      "headline": "Gauahar Khan criticises Amaal Mallik over racist remarks on Bigg Boss 19Gauahar Khan has condemned Amaal Mallik for making abusive and racist comments during 'Bigg Boss 19'. The actor and former Bigg Boss winner also voiced support for her brother-in-law Awez, who was targeted by Mallik."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/jackky-bhagnani-love-note-for-rakul-preet-singh-on-wife-appreciation-day-2791313-2025-09-22",
      "headline": "My safe place: Jackky Bhagnani's love note for Rakul Preet on Wife Appreciation DayJackky Bhagnani celebrated Wife Appreciation Day by sharing a heartfelt video and note for Rakul Preet Singh, calling her his best friend and safe place. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/swiped-review-lily-james-film-inspired-bumble-ceo-journey-jiohotstar-2791219-2025-09-22",
      "headline": "Swiped review: A left-swipe on this film inspired by Bumble CEO's journeyRelease Date:Fri Sep 19, 2025'Swiped', inspired by the life of founder and CEO Whitney Wolfe Herd, started streaming on JioHotstar on September 19. Is the one-hour, 50-minute film, starring Lily James, worth your time? Read our review.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/avika-gor-milind-chandwani-to-get-married-on-tv-wedding-details-out-2791293-2025-09-22",
      "headline": "Avika Gor, Milind Chandwani to get married on TV, wedding details outActor Avika Gor and fiance Milind Chandwani are set to get married on September 30 on 'Pati Patni Aur Panga' set. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/suhana-cheers-for-aryan-khan-as-the-bads-of-bollywood-tops-netflix-india-charts-2791233-2025-09-22",
      "headline": "Suhana cheers for Aryan Khan as The Ba***ds of Bollywood tops Netflix India chartsSuhana Khan shared a celebratory post as Aryan Khan's directorial debut show, 'The Ba***ds of Bollywood', topped Netflix's charts in India. Her post also included a 'Say No to Drugs' reference. Take a look:"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-weekend-ka-vaar-written-update-salman-khan-abhishek-bajaj-ashnoor-kaur-2791181-2025-09-22",
      "headline": "Bigg Boss 19 Weekend Ka Vaar: Salman warns Abhishek against trusting AshnoorActor Salman Khan confronted Ashnoor Kaur about her claims regarding Abhishek Bajaj's captaincy. Nehal Chudasama was sent to the secret room, while Amaal Mallik sang a song for Tanya Mittal. Here's everything that happened in the 'Weekend Ka Vaar' episode of 'Bigg Boss 19'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kantara-chapter-1-trailer-rishab-shetty-film-promises-thrills-steeped-in-folklore-2791271-2025-09-22",
      "headline": "Kantara Chapter 1 trailer: Rishab Shetty film promises thrills steeped in folkloreYears after 'Kantara' took Indian cinema by storm, the makers are back with its much-awaited prequel, 'Kantara: Chapter 1'. The trailer, unveiled on Monday, September 22, amid much fanfare, teases a gripping narrative that blends folklore, faith, and high-voltage drama. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/if-hollywood-has-tom-cruise-we-have-akshay-kumar-says-mahesh-bhatt-2791231-2025-09-22",
      "headline": "If Hollywood has Tom Cruise, we have Akshay Kumar, says Mahesh BhattBollywood's Akshay Kumar is hailed as an action hero on par with Hollywood's Tom Cruise, following a daring stunt in the film 'Angaaray' that left director Mahesh Bhatt in awe. He earned high praise on 'The Kapil Sharma Show' finale."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/anu-malik-says-zubeen-garg-suffered-blackouts-shares-his-devotion-to-social-issues-2791242-2025-09-22",
      "headline": "Anu Malik says Zubeen Garg suffered blackouts, shares his devotion to social issuesSinger Zubeen Garg's death led to widespread mourning across Assam and the music industry. Composer Anu Malik remembered working with Garg and recalled his health struggles during his Bollywood years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/nagaland-minister-temjen-imna-along-slams-students-remarks-on-zubeen-garg-calls-him-pride-of-northeast-2791244-2025-09-22",
      "headline": "Nagaland minister slams student's comment on Zubeen Garg: He was Northeast's prideA Nagaland minister recently criticised Naga students' remarks about singer Zubeen Garg at Kaziranga University.  He called him the pride of Northeast. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tom-holland-mild-concussion-spider-man-brand-new-day-filming-paused-2791164-2025-09-22",
      "headline": "Tom Holland suffers concussion on Spider-Man Brand New Day set, filming haltedBritish actor Tom Holland sustained a mild concussion on 'Spider-Man: Brand New Day' set. The film's production has been paused for several days as a precaution."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jolly-llb-3-box-office-collection-day-3-detailed-report-akshay-kumar-film-gets-franchise-biggest-1st-weekend-2791189-2025-09-22",
      "headline": "Jolly LLB 3 box office Day 3: Akshay's film gets franchise's biggest 1st weekend'Jolly LLB 3' recorded a solid opening weekend in India. The Akshay Kumar and Arshad Warsi-starrer legal comedy is doing better than its predecessors in the franchise. This is a promising sign, but Monday will tell us more about its long-time potential at the box office. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kajol-acting-trick-ddlj-scene-authenticity-method-explained-2791177-2025-09-22",
      "headline": "Kajol reveals the acting trick that helped her nail a DDLJ sceneKajol shares her unique acting method that helps her perform challenging scenes with conviction. She explains how momentarily believing in a character keeps her performances authentic yet true to herself."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/30-killed-as-pakistan-air-force-drops-eight-bombs-during-airstrikes-on-village-in-khyber-pakhtunkhwa-2791285-2025-09-22",
      "headline": "30 killed as Pakistan Air Force bombs village in Khyber PakhtunkhwaAround 2 am today, the Pakistan Air Force dropped eight LS-6 bombs from JF-17 fighter jets on the Matre Dara village in Khyber Pakhtunkhwa province."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-india-express-bengaluru-to-varanasi-flight-passenger-tries-to-enter-cockpit-while-looking-for-toilet-2791378-2025-09-22",
      "headline": "Air India Express passenger tries to enter cockpit while looking for toiletWhile confirming the incident on board flight IX1086, Air India Express said security protocols were not compromised and the matter has been reported to the concerned authorities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/how-pakistan-brought-mujahid-mentality-to-cricket-pitch-sahibzada-farhan-haris-rauf-asia-cup-super-fours-match-india-2791303-2025-09-22",
      "headline": "How Pakistan brought mujahid mentality to the cricket pitchPakistani cricketers' provocative gestures, like Farhan's AK-47 gunfire mimicry and Rauf's plane-shooting taunt, have exposed their \"mujahid\" mentality. Their antics, seen as militant symbolism on the pitch, have exposed the jihad rot that has percolated every strata of Pakistani society. It has bolstered the case for a boycott of the Pakistani team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/britain-leads-western-allies-recognising-palestine-gaza-crisis-2791310-2025-09-22",
      "headline": "West tilts toward two-state solution for Palestine. India was aheadThe West is finally waking up to an idea India has long stood by: that peace in the Middle East rests on an independent Palestinian state."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/iphone-17-pro-max-the-great-leveller-2791280-2025-09-22",
      "headline": "iPhone 17 Pro Max — the great levellerOne big appeal of the most expensive iPhone is its universality. It is a phone that is used by the world's richest man as well as a student in Delhi University. And that also illustrates a larger point about Silicon Valley tech. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/unfortunate-irresponsible-top-court-on-speculation-of-pilot-error-in-air-india-171-crash-2791260-2025-09-22",
      "headline": "Unfortunate: Supreme Court on speculation of pilot error in Air India 171 crashThe Supreme Court, while responding to a Public Interest Litigation (PIL) seeking an independent, court-monitored probe into the Air India plane crash, observed that it was \"irresponsible\" to blame pilots based on a preliminary inquiry report."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/hpv-positive-isnt-always-a-cervical-cancer-diagnosis-2790509-2025-09-22",
      "headline": "HPV positive isn't always a cervical cancer diagnosisWhile HPV is linked to cervical cancer, not every infection is dangerous, and with regular screening and vaccination, most cases of the disease can be prevented."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-government-bans-caste-references-in-firs-vehicle-stickers-signboards-election-rallies-2791400-2025-09-22",
      "headline": "UP bans caste-based political rallies, vehicle stickers, and signboardsThe Uttar Pradesh government, acting on an Allahabad High Court directive, has banned caste references in police records, public spaces, and rallies. FIRs and arrest memos will no longer mention caste, with parent names used for identification instead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pawan-kalyan-they-call-him-og-trailer-emraan-hashmi-telugu-debut-2791398-2025-09-22",
      "headline": "They Call Him OG trailer: Pawan Kalyan returns with high-voltage actionPawan Kalyan makes a powerful return to Telugu cinema with the much-awaited trailer of 'They Call Him OG', promising a blend of intense action and emotional depth. The film, featuring a high-stakes clash between Kalyan and Emraan Hashmi, is all set to release on September 25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/university-of-bath-school-of-management-where-careers-begin-with-confidence-2788009-2025-09-16",
      "headline": "University of Bath School of Management: Where Careers Begin With ConfidenceWith students from over 160 countries and a strong alumni network spanning 130 nations, the School creates a community that feels global in reach yet personal in experience. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/ulips-mutual-funds-why-you-need-both-for-a-balanced-portfolio-2789465-2025-09-19",
      "headline": "ULIPs & Mutual Funds: Why you need both for a balanced portfolioULIPs give you protection and discipline for the long haul, while mutual funds give you liquidity and flexibility for the near term."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-cricket-crisis-asia-cup-2025-loss-to-india-pcb-issues-2791221-2025-09-22",
      "headline": "The botched surgery: Pakistan keep faltering after yet another India defeatAsia Cup: Pakistan slumped to a six-wicket defeat to India on Sunday following their group stage loss to Suryakumar Yadav's men. The loss has put them in a tricky position ahead of their clash against Sri Lanka and Bangladesh."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/gautam-singhania-shares-video-of-speeding-lamborghini-ramming-into-divider-in-mumbai-2791251-2025-09-22",
      "headline": "Gautam Singhania's 'another day, another Lamborghini crash' video post goes viralGautam Singhania, Chairman and Managing Director of Raymond Ltd, shared a now-viral video of a speeding Lamborghini that rammed into the divider on Mumbai's Coastal Road."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/patna/story/video-car-falls-into-pothole-in-patna-owner-claims-conspiracy-to-defame-government-2791393-2025-09-22",
      "headline": "Video: Car falls into pothole, owner claims conspiracy to defame governmentVehicle owner Nitu Singh Choubey said that the accident could have been prevented if proper road maintenance and safety measures had been in place. She claimed that it was a conspiracy to defame the Nitish Kumar government."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/fatah-1-missile-debris-recovered-dal-lake-srinagar-pakistan-strike-2791396-2025-09-22",
      "headline": "Pak's Fatah-1 rocket debris fished out of Srinagar's Dal Lake during cleanupThe shell, identified as part of a Fatah-1 guided artillery rocket, had exploded in the Dal Lake during cross-border strikes earlier this year. It was handed over to police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-sahibzada-farhan-gun-celebration-asia-cup-2025-2791390-2025-09-22",
      "headline": "Farhan breaks silence on gun celebration vs India: Don't care how people take itPakistan opener Sahibzada Farhan commented on his gun celebration during the India clash in the Asia Cup 2025. Farhan scored a fifty during the game and his celebration went viral and was panned on social media"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/the-lowdown/story/mahishasur-demon-or-hero-navratra-reminds-us-of-contested-past-of-india-2791333-2025-09-22",
      "headline": "Mahishasur, demon or hero? Navratra reminds us of India's contested pastStanding tall atop Chamundi Hill, the granite statue of Mahishasur embodies a paradox: vilified as a demon in Mysore's Dussehra, yet revered as a hero by India's indigenous communities. He embodies India's dynamic history and conflicting myths."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/uk-news/story/uk-prime-minister-keir-starmer-consider-scrapping-visa-fees-high-skilled-talent-us-clampdown-2791383-2025-09-22",
      "headline": "UK to consider scrapping visa fees for high-skilled talent amid US clampdownThe reforms were being discussed in Number 10 and the Treasury before the Trump administration announced its decision to impose a $100,000 fee for new H-1B visas, which are widely used by US tech companies, from Sunday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/video-somalia-bound-ship-carrying-rice-and-sugar-catches-fire-at-gujarat-jetty-2791345-2025-09-22",
      "headline": "Video: Somalia-bound ship carrying rice and sugar catches fire at Gujarat jettyThe cargo ship was anchored at the Subhashnagar Jetty in Porbandar when it caught fire earlier today. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-refuses-to-entertain-jacqueline-fernandezs-plea-to-cancel-rs-215-crore-money-laundering-case-2791336-2025-09-22",
      "headline": "Supreme Court rejects Jacqueline Fernandez's plea to drop Rs 215-crore ED caseActor Jacqueline Fernandez approached the Supreme Court after the Delhi High Court threw out a similar petition in July, observing that the determination of whether she committed any crime could only be made during trial."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kantara-chapter-1-trailer-rishab-shetty-film-promises-thrills-steeped-in-folklore-2791271-2025-09-22",
      "headline": "Kantara Chapter 1 trailer: Rishab Shetty film promises thrills steeped in folkloreYears after 'Kantara' took Indian cinema by storm, the makers are back with its much-awaited prequel, 'Kantara: Chapter 1'. The trailer, unveiled on Monday, September 22, amid much fanfare, teases a gripping narrative that blends folklore, faith, and high-voltage drama. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/antarctica-subglacial-lakes-discovery-dynamic-water-systems-sea-level-rise-2791362-2025-09-22",
      "headline": "Antarctica's hidden waters: 85 new lakes discovered from spaceScientists have identified 85 previously unknown subglacial lakes beneath Antarctica, which could enhance climate and sea level rise predictions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-reforms-today-price-changes-everyday-goods-milk-dairy-sin-ultra-luxury-pm-modi-india-tax-2791115-2025-09-22",
      "headline": "GST 2.0 kicks in: What changes in your shopping bill from today Live UpdatesThe government expects GST 2.0 to reduce compliance challenges, cut disputes, and make goods and services cheaper for households. Read on to know which items get cheaper and which turn costlier from today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/deepika-padukone-king-announcement-reply-to-critics-work-values-2791276-2025-09-22",
      "headline": "Why Deepika Padukone's King announcement is her hold-my-crown-moment for hatersDeepika Padukone announced her role in Shah Rukh Khan's 'King' after exiting two major Telugu projects. And that announcement is her not-so-subtle reply to her critics."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-sahibzada-farhan-gun-celebration-asia-cup-2025-2791390-2025-09-22",
      "headline": "Farhan breaks silence on gun celebration vs India: Don't care how people take itPakistan opener Sahibzada Farhan commented on his gun celebration during the India clash in the Asia Cup 2025. Farhan scored a fifty during the game and his celebration went viral and was panned on social media"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ricky-ponting-suggests-travis-head-no3-ashes-series-australia-cricket-2791374-2025-09-22",
      "headline": "Travis Head to play at No.3? Ricky Ponting backs promotion ahead of Ashes seriesRicky Ponting has suggested promoting Travis Head to No.3 in the batting order for the Ashes series. This move aims to challenge England's pace attack and strengthen Australia's middle order balance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/how-pakistan-brought-mujahid-mentality-to-cricket-pitch-sahibzada-farhan-haris-rauf-asia-cup-super-fours-match-india-2791303-2025-09-22",
      "headline": "How Pakistan brought mujahid mentality to the cricket pitchPakistani cricketers' provocative gestures, like Farhan's AK-47 gunfire mimicry and Rauf's plane-shooting taunt, have exposed their \"mujahid\" mentality. Their antics, seen as militant symbolism on the pitch, have exposed the jihad rot that has percolated every strata of Pakistani society. It has bolstered the case for a boycott of the Pakistani team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/quinton-de-kock-odi-return-south-africa-pakistan-tour-2025-2791358-2025-09-22",
      "headline": "De Kock reverses ODI retirement, named in South Africa squad for PAK tourAccording to reports from South Africa, Quinton de Kock has reversed his ODI retirement and has been selected in the white-ball squads for the upcoming Pakistan tour. De Kock retired from ODIs after World Cup 2023. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/ballon-dor-livestreaming-where-to-watch-in-india-favourites-lamine-yamal-raphinha-dembele-2791343-2025-09-22",
      "headline": "Yamal, Raphinha and Dembele race for Ballon d'Or: How to watch Paris ceremony liveThe 2025 Ballon d'Or showdown in Paris features Dembele, Yamal, and Raphinha as frontrunners, while Mohamed Salah remains a notable contender. PSG and Real Madrid players may miss the ceremony, adding intrigue to the awards night."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-abhishek-sharma-praise-misbah-ul-haq-nets-practice-2791316-2025-09-22",
      "headline": "Abhishek Sharma's batting hailed by Misbah-ul-Haq, says it looked like nets practiceAbhishek Sharma's blistering 74 runs guided India to a six-wicket victory over Pakistan in the Asia Cup 2025. His composed innings earned praise from former Pakistan captain Misbah-ul-Haq, highlighting a shift in the high-pressure rivalry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/psg-ballon-dor-miss-ceremony-ousmane-dembele-marseille-match-real-madrid-2791311-2025-09-22",
      "headline": "PSG set to miss Ballon d'Or ceremony in Paris, but it's not a boycottParis Saint-Germain stars will miss Monday's 2025 Ballon d'Or ceremony due to their rescheduled Ligue 1 clash against Marseille. Dembele remains favourite for the award, while Luis Enrique, Desire Doue, and other PSG nominees may also be absent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shoaib-akhtar-slams-salman-ali-agha-captaincy-asia-cup-2025-2791304-2025-09-22",
      "headline": "Salman Agha is Pakistan's weakest link: Akhtar slams captain after India lossShoaib Akhtar slammed Salman Ali Agha's captaincy and questioned his spot in the team by calling him the weak link of the side after their humbling defeat to India. Agha failed to inspire his side as India ran away with the game in the end. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-vs-pakistan-pressure-win-in-style-sunil-gavaskar-exclusive-2791250-2025-09-22",
      "headline": "India had to win in style: Sunil Gavaskar on dominant Asia Cup win vs PakistanSunil Gavaskar believes India's dominant win over Pakistan in the Asia Cup Super 4 was fueled by pressure to make a statement after the previous match drama, with Abhishek Sharma and Shubman Gill leading the charge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-legends-slammed-new-cricketing-talents-yuvraj-singh-abhishek-sharma-2791235-2025-09-22",
      "headline": "Pakistan legends slammed for not building new names after Yuvraj-Abhishek successFormer pacer Tanveer Ahmed criticised Pakistan cricket legends for failing to groom future stars. His remarks came after Abhishek Sharma's outstanding performance against Pakistan in the Asia Cup 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/asia-cup-2025-india-vs-pakistan-salman-ali-agha-press-conference-dubai-2791238-2025-09-22",
      "headline": "Give us good pitches: Salman Agha slams Pakistan's flat tracks after India lossPakistan captain Salman Ali Agha has asked for better tracks in the country after their humbling loss to India in Dubai on Sunday, September 21. Despite a brilliant start to their innings, Pakistan lost control of the game and allowed India to win the game. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/psg-ballon-dor-miss-ceremony-ousmane-dembele-marseille-match-real-madrid-2791311-2025-09-22",
      "headline": "PSG set to miss Ballon d'Or ceremony in Paris, but it's not a boycottParis Saint-Germain stars will miss Monday's 2025 Ballon d'Or ceremony due to their rescheduled Ligue 1 clash against Marseille. Dembele remains favourite for the award, while Luis Enrique, Desire Doue, and other PSG nominees may also be absent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shoaib-akhtar-slams-salman-ali-agha-captaincy-asia-cup-2025-2791304-2025-09-22",
      "headline": "Salman Agha is Pakistan's weakest link: Akhtar slams captain after India lossShoaib Akhtar slammed Salman Ali Agha's captaincy and questioned his spot in the team by calling him the weak link of the side after their humbling defeat to India. Agha failed to inspire his side as India ran away with the game in the end. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-vs-pakistan-pressure-win-in-style-sunil-gavaskar-exclusive-2791250-2025-09-22",
      "headline": "India had to win in style: Sunil Gavaskar on dominant Asia Cup win vs PakistanSunil Gavaskar believes India's dominant win over Pakistan in the Asia Cup Super 4 was fueled by pressure to make a statement after the previous match drama, with Abhishek Sharma and Shubman Gill leading the charge."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-legends-slammed-new-cricketing-talents-yuvraj-singh-abhishek-sharma-2791235-2025-09-22",
      "headline": "Pakistan legends slammed for not building new names after Yuvraj-Abhishek successFormer pacer Tanveer Ahmed criticised Pakistan cricket legends for failing to groom future stars. His remarks came after Abhishek Sharma's outstanding performance against Pakistan in the Asia Cup 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/asia-cup-2025-india-vs-pakistan-salman-ali-agha-press-conference-dubai-2791238-2025-09-22",
      "headline": "Give us good pitches: Salman Agha slams Pakistan's flat tracks after India lossPakistan captain Salman Ali Agha has asked for better tracks in the country after their humbling loss to India in Dubai on Sunday, September 21. Despite a brilliant start to their innings, Pakistan lost control of the game and allowed India to win the game. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}