{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/spicejet-shares-surge-9-percent-what-fueling-the-rally-and-will-it-continue-2599086-2024-09-13",
      "headline": "SpiceJet shares surge 9%: What's fuelling the rally and will it continue?SpiceJet share price: Despite regulatory challenges, the airline's shares have surged recently. Will the rally hold?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pn-gadgil-jewellers-ipo-allotment-check-application-status-latest-gmp-bse-bigshare-services-2599066-2024-09-13",
      "headline": "PN Gadgil Jewellers IPO allotment: Step-by-step guide to check statusPN Gadgil Jewellers IPO allotment: If you've applied for the IPO, you can check the allotment status online in a few simple steps through the websites of the BSE and Bigshare Services."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-ipo-allotment-expected-listing-gains-110-percent-gmp-2599039-2024-09-13",
      "headline": "Bajaj Housing Finance IPO: Got allotment? Check expected listing gainsBrokerages tracking the IPO have already indicated that the IPO is set for a positive listing, with the grey market premium (GMP) indicating that investors will see their money double on listing day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-group-shares-drop-after-hindenburg-fresh-allegations-2599025-2024-09-13",
      "headline": "Adani Group shares drop after Hindenburg's fresh allegationsHindenburg Research claimed that Swiss authorities had frozen over $310 million across several Swiss bank accounts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-fall-record-highs-bajaj-finserv-finance-shares-gain-2599020-2024-09-13",
      "headline": "Sensex, Nifty near record highs; Bajaj twins gainThe S&P BSE Sensex fell 134.05 points to 82,828.66 at 10:28 am, while the NSE Nifty50 fell 44.30 points to 25,344.60."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hindenburg-research-swiss-authorities-freeze-310-million-funds-adani-group-probe-2598886-2024-09-12",
      "headline": "Adani Group rejects Hindenburg claim of Swiss banks' $310 million funds freezeHindenburg cited a Swiss media outlet, Gotham City, which alleged that more than $310 million belonging to an alleged frontman for billionaire Gautam Adani is sequestered in six Swiss banks. The Adani Group \"unequivocally\" rejected the claim."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/amazon-flipkart-violating-indian-competition-laws-competition-commission-of-india-report-2598813-2024-09-12",
      "headline": "Amazon, Flipkart found violating Indian competition laws: ReportA probe by the Competition Commission of India (CCI) found that e-commerce giants Amazon and Flipkart engaged in anti-competitive practices by favouring select sellers on their platforms. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/understanding-circle-rates-a-simple-guide-for-homebuyers-and-sellers-2598648-2024-09-12",
      "headline": "Understanding circle rates: A simple guide for homebuyers and sellersUnderstanding the concept of circle rates, and how they influence property valuations, has become critical for anyone navigating the real estate market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-retail-inflation-cpi-data-365-per-cent-august-2598623-2024-09-12",
      "headline": "Retail inflation rises to 3.65% in August, second lowest in last five yearsRetail inflation rises to 3.65 per cent in August compared to 3.6 per cent in July, as per government data. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-semiconductor-boom-top-stocks-best-pick-semicon-expert-view-investment-tips-spel-vedanta-kaynes-2598569-2024-09-12",
      "headline": "India's semiconductor boom: These stocks could be your best pickThe development of the semiconductor value chain—ranging from chip design to manufacturing and assembly, is expected to benefit various companies in the sector."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-gains-1500-points-nifty-jumps-us-rate-cut-optimism-granules-india-zomato-shares-2598547-2024-09-12",
      "headline": "Sensex gains 1,500 points on US rate cut optimism; Granules India tanks 17%The S&P BSE Sensex was up 1,439.55 points to 82,962.71 at the closing bell, while the NSE Nifty50 gained nearly 470.45 points to settle at 25,388.90."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/granules-india-share-price-crash-nearly-17-percent-explained-2598540-2024-09-12",
      "headline": "Explained: Why Granules India shares crashed nearly 17% todayGranules India stock price: With this drop, the stock now trades roughly 22% below its all-time high of Rs 724.55, reached earlier in the month"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/pwc-layoff-job-cut-1800-jobs-us-first-major-layoff-since-2009-2598534-2024-09-12",
      "headline": "PwC to cut 1,800 jobs in first major layoff since 2009The layoff affects approximately 2.5% of the company's US workforce and impacts a range of positions, including associates, managing directors, and employees in business services, audit, and tax departments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-surges-1000-points-nifty-rises-300-points-investors-add-rs-5-lakh-crore-2598507-2024-09-12",
      "headline": "Sensex surges 1,000 points, Nifty rises; investors add Rs 5 lakh croreThe S&P BSE Sensex added1048.49 points to 82,571.65, while the NSE Nifty50 gained 343.65 points to 25,262.10. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/petrol-diesel-prices-could-see-a-cut-if-crude-rates-stay-lower-for-longer-report-2598472-2024-09-12",
      "headline": "Petrol, diesel prices may fall if crude oil rates remain low: ReportCrude oil prices have recently dropped to their lowest point in nearly three years, bringing some hope for lower fuel prices. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ayushman-bharat-health-insurance-senior-citizens-aged-70-and-above-to-get-these-benefits-2598441-2024-09-12",
      "headline": "Ayushman Bharat: Senior citizens aged 70 and above to get these benefitsAyushman Bharat: The expansion aims to ease the financial burden of healthcare for the elderly, who often face high medical expenses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdfc-bank-in-talks-with-global-banks-to-sell-loans-worth-rs-8400-crore-2598417-2024-09-12",
      "headline": "HDFC Bank in talks with global banks to sell loans worth Rs 8,400 crore: ReportFor HDFC Bank, offloading these loans would help improve that ratio, which has deteriorated as credit growth has outpaced deposit accumulation in recent years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-ipo-allotment-check-application-status-latest-gmp-bse-website-kfin-technologies-2598400-2024-09-12",
      "headline": "Bajaj Housing Finance IPO allotment: Check application status and latest GMPIf you've applied for the Bajaj Housing Finance IPO, you can check your allotment status online in a few simple steps through the websites if the BSE and KFin Technologies."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/kross-limited-ipo-allotment-online-step-by-step-guide-to-check-status-gmp-2598396-2024-09-12",
      "headline": "Kross Limited IPO allotment: Step-by-step guide to check statusKross Limited IPO allotment: Investors who applied for the IPO can check their allotment status online through the BSE portal or on Kfin Technologies Limited, the registrar for the issue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-ipo-demand-investors-explained-allotment-day-2598373-2024-09-12",
      "headline": "Explained: Why everyone wants a piece of Bajaj Housing Finance IPOBoth big and small, investors rushed in to grab their share of this Rs 6,560-crore IPO, which has attracted a whopping Rs 3.2 lakh crore in bids."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/law/story/supreme-court-grants-bail-to-arvind-kejriwal-in-liquor-policy-case-he-has-been-in-jail-since-april-1-2024-2599017-2024-09-13",
      "headline": "Arvind Kejriwal gets bail, but Supreme Court split on legality of CBI's arrest Live UpdatesArvind Kejriwal Bail Order: The two Supreme Court judges delivered separate but concurring judgments. While Justice Surya Kant held Arvind Kejriwal's arrest valid, Justice Bhuyan called it 'unjustified'."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/law/story/arvind-kejriwal-gets-bail-supreme-court-in-delhi-liquor-policy-scam-2599026-2024-09-13",
      "headline": "CBI must show it's uncaged parrot: Supreme Court judge on Arvind Kejriwal arrestArvind Kejriwal was first arrested by the Enforcement Directorate (ED) on March 21 in a money laundering case connected to the liquor policy scam. The CBI arrested him later on June 26 in a corruption case. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-crime-news-man-killed-outside-gym-greater-kailash-rohit-godara-2598912-2024-09-13",
      "headline": "Man shot 8 times outside gym in posh Delhi locality, murder on CCTVIn the CCTV footage, accessed by India Today, Nadir Shah is seen talking to another man while standing next to a black SUV before being shot multiple times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/sunita-williams-goes-through-eye-checks-after-astronauts-report-vision-issues-2599058-2024-09-13",
      "headline": "Sunita Williams undergoes eye checks ahead of calling home tonightWilliams and Wilmore, who launched aboard Boeing's Starliner spacecraft on June 5, 2024, have been part of an unexpected turn of events. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/the-buckingham-murders-review-kareena-kapoor-hansal-mehta-2599034-2024-09-13",
      "headline": "The Buckingham Murders Review: Kareena Kapoor is in top formReleased-Fri Sep 13, 2024The Buckingham Murders released in theatres today, September 13. Is this murder mystery by Hansal Mehta, featuring Kareena Kapoor in the lead, worth a watch? Read the review to know."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/supreme-court-arvind-kejriwal-bail-conditions-2599029-2024-09-13",
      "headline": "Arvind Kejriwal bail conditions: Can't enter Chief Minister's office, sign filesThe Supreme Court set certain conditions while granting bail to Delhi Chief Minister Arvind Kejriwal in the liquor policy case. He has been in jail since April 1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afg-v-nz-greater-noida-rain-forces-1st-abandoned-test-in-26-years-8th-in-history-2599002-2024-09-13",
      "headline": "Rain in Greater Noida leads to first abandoned Test match in 28 yearsThe one-off Test match between Afghanistan and New Zealand became only the 8th Test match in cricketing history to be abandoned without any ball being bowled. Persistent rain in Greater Noida played spoilsport on all five days of the Test match. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/elon-musk-shares-haitian-woman-video-donald-trump-immigrants-eating-pets-ohio-2598966-2024-09-13",
      "headline": "Elon Musk shares Haitian woman's video to back Trump's 'eating pets' claimThe post by Elon Musk comes as several media outlets are fact-checking claims made by Donald Trump that illegal immigrants from Haiti were eating pets in an Ohio city."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/video/watch-tense-moments-then-relief-and-hugs-for-aap-as-arvind-kejriwal-gets-bail-2599067-2024-09-13",
      "headline": "Watch: Tense moments, then relief and hugs for AAP as Arvind Kejriwal gets bailWatching the bail verdict, the Aam Aadmi Party (AAP) leaders -- Manish Sisodia and Atishi -- were all smiles and exchanged hugs moments after the Supreme Court's verdict."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hindenburg-research-swiss-authorities-freeze-310-million-funds-adani-group-probe-2598886-2024-09-12",
      "headline": "Adani Group rejects Hindenburg claim of Swiss banks' $310 million funds freezeHindenburg cited a Swiss media outlet, Gotham City, which alleged that more than $310 million belonging to an alleged frontman for billionaire Gautam Adani is sequestered in six Swiss banks. The Adani Group \"unequivocally\" rejected the claim."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/law/story/arvind-kejriwal-supreme-court-order-judges-differ-arrest-bail-conditions-2599064-2024-09-13",
      "headline": "In Arvind Kejriwal bail order, judges differ on legality of arrestWhile Justice Surya Kant held the arrest of Arvind Kejriwal valid, Justice Ujjal Bhuyan blasted the CBI, saying the central agency must show it is an 'uncaged parrot'.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-test-series-redemption-past-horrors-rohit-sharma-najmul-shanto-2598954-2024-09-13",
      "headline": "Bangladesh look for redemption after past horrors in India TestsIND vs BAN: Bangladesh aren't the favourites to win their Test series against India, but they can hold their heads high if they give India a run for their money."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/loyal-dog-chases-ambulance-owner-hospital-video-ends-heartwarming-note-2599078-2024-09-13",
      "headline": "Loyal dog chases ambulance carrying owner. Video ends on a heartwarming note In a viral video, a loyal dog was seen chasing an ambulance carrying its ailing owner to the hospital. What happened next is absolutely heartwarming. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/miss-switzerland-finalist-kristina-joksimovic-murdered-by-husband-thomas-body-parts-pureed-in-a-blender-2598802-2024-09-12",
      "headline": "Ex-Miss Switzerland finalist murdered by husband, body parts 'pureed' in a blenderKristina Joksimovic, a former Miss Switzerland finalist, was allegedly murdered by her husband, who dismembered her body. Victim's husband named Thomas, confessed to the killing, claiming self-defense. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/malaika-arora-holds-back-tears-as-she-leaves-fathers-home-with-arjun-kapoor-amrita-2598965-2024-09-13",
      "headline": "Malaika Arora holds back tears as she leaves father's home with Arjun Kapoor, AmritaMalaika Arora was looking visibly emotional as she left her late father's home with sister Amrita Arora and Arjun Kapoor. Her father, Anil Mehta, died after jumping from their balcony. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/west-bengal-governor-cv-ananda-bose-socially-boycott-jab-at-mamata-banerjee-draws-trinamool-ire-2598893-2024-09-13",
      "headline": "Lady Macbeth of Bengal: Governor vows to 'socially boycott' Mamata BanerjeeWest Bengal Governor CV Ananda Bose on Thursday said he will not share any public platform with Chief Minister Mamata Banerjee, citing the public outcry over the Kolkata doctor's rape-murder."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-diljit-dosanjh-reunite-for-jigra-fans-say-ikk-kudi-duo-is-back-udta-punjab-vedang-raina-2599072-2024-09-13",
      "headline": "Alia Bhatt, Diljit Dosanjh reunite for Jigra, fans say 'Ikk Kudi duo is back'Alia Bhatt and Diljit Dosanjh are reuniting for the former's upcoming film Jigra. Alia shared the exciting news on Instagram, reigniting memories of their previous collaboration in Udta Punjab."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/openai-o1-is-here-a-new-ai-model-that-thinks-before-responding-how-it-works-2598995-2024-09-13",
      "headline": "OpenAI o1 is here, a new Strawberry AI model that thinks before respondingOpenAI has released a new o1 AI model. The smarter but expensive model is available for only ChatGPT Plus and Team users. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/badshah-calls-rs-8-crore-rolls-royce-bakwas-no-car-is-better-than-swift-innova-2599010-2024-09-13",
      "headline": "Rapper Badshah calls Rs 8 crore Rolls Royce 'bakwas': No car is better than SwiftBadshah reveals he owns 1,000 sneakers, including a Rs 22 lakh Nike Yeezy 2. He also calls his Rs 8 crore Rolls Royce 'rubbish'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/arvind-kejriwal-bail-hearing-live-updates-supreme-court-verdict-kejriwal-bail-plea-arrest-cbi-excise-policy-case-2598948-2024-09-13",
      "headline": "'No politician as honest as Kejriwal', says AAP leader Manish SisodiaArvind Kejriwal Bail Plea Verdict, Delhi Excise Policy Live Updates: The Supreme Court has granted bail to Delhi Chief Minister Arvind Kejriwal in the alleged liquor policy scam case. The court delivered two separate verdicts, one each on Kejriwal's bail plea and on his arrest by the CBI. While  Justice Surya Kant held Kejriwal's CBI arrest valid, Justice Ujjal Bhuyan called it 'unjustified'. However, both the judges set the Delhi High Court order upholding Kejriwal's arrest aside and granted him bail."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/berlin-movie-review-aparshakti-khuarana-ishwak-singh-rahul-bose-2598638-2024-09-13",
      "headline": "Berlin Review: Cast makes it a compelling watchReleased-Fri Sep 13, 2024Director Atul Sabharwal's film Berlin, starring Aparshakti Khurana, Ishwak Singh and Rahul Bose, is now streaming on Zee5. Read our review of the film before watching it."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-ncr-noida-ghaziabad-gurugram-north-india-rain-2598947-2024-09-13",
      "headline": "Heavy rain lashes Delhi-NCR, several roads waterlogged, more showers in storeThe weather department has issued an orange alert for Delhi-NCR, indicating a \"be prepared\" mode. The alert warns of potential disruptions to transport, including rail, road and air, with power outages also likely."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/nagpur-audi-crash-footage-la-horee-bar-missing-bjp-chandrashekhar-bawankule-son-audi-crash-2598996-2024-09-13",
      "headline": "Nagpur Audi crash: CCTV footage of bar visited by BJP leader's son missing Sanket Bawankule's Audi, allegedly driven by his friend Arjun Hawre, hit several vehicles in Ramdaspeth in the early hours of Monday, leaving two persons on a moped injured."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jammu-and-kashmir-1-terror-associate-arrested-in-poonch-grenades-explosives-seized-2598999-2024-09-13",
      "headline": "1 terror associate arrested in J&K's Poonch, huge cache of explosives seizedSecurity forces in Jammu and Kashmir's Poonch district arrested a terror associate and recovered three grenades, explosives and other incriminating documents."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/sector-36-review-a-tough-watch-where-vikrant-massey-and-deepak-dobriyal-excel-netflix-film-review-2599073-2024-09-13",
      "headline": "Sector 36 Review: A tough watch where Vikrant Massey and Deepak Dobriyal excelReleased-Fri Sep 13, 2024The Netflix film Sector 36 is based on the 2006 Nithari serial killings in Noida. The film is produced by Maddock and features Vikrant Massey and Deepak Dobriyal delivering strong performances. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/sai-pallavi-applies-mehndi-to-sister-pooja-kannan-at-her-wedding-2599090-2024-09-13",
      "headline": "Video: Sai Pallavi applies mehndi to sister Pooja Kannan at her weddingActor Sai Pallavi did her sister Pooja Kannan's mehndi at her wedding. Pooja married her fiancé Vineeth in Kotagiri last week."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/bad-newz-ott-release-when-where-to-watch-vicky-kaushal-triptii-dimri-ammy-virk-film-2599075-2024-09-13",
      "headline": "Bad Newz OTT release: When and where to watch Vicky-Triptii's filmVicky Kaushal and Triptii Dimri's 'Bad Newz' is now streaming on OTT after a decent theatrical run. The film released in theatres on July 19."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-diljit-dosanjh-reunite-for-jigra-fans-say-ikk-kudi-duo-is-back-udta-punjab-vedang-raina-2599072-2024-09-13",
      "headline": "Alia Bhatt, Diljit Dosanjh reunite for Jigra, fans say 'Ikk Kudi duo is back'Alia Bhatt and Diljit Dosanjh are reuniting for the former's upcoming film Jigra. Alia shared the exciting news on Instagram, reigniting memories of their previous collaboration in Udta Punjab."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/borussia-dortmund-dig-inter-milan-third-kit-social-media-post-yellow-black-design-2599093-2024-09-13",
      "headline": "Borussia Dortmund takes cheeky dig at Inter Milan's new third kitBorussia Dortmund playfully mocked Inter Milan's new third kit, which closely resembles their iconic yellow and black design. The humorous exchange on social media quickly grabbed attention, reigniting a lighthearted rivalry between the two clubs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/glenn-maxwell-excited-to-see-kohli-smith-go-head-to-head-in-border-gavaskar-series-2599077-2024-09-13",
      "headline": "Glenn Maxwell excited to see Kohli-Smith go head-to-head in Border Gavaskar seriesGlenn Maxwell expressed his excitement to see Virat Kohli and Glenn Maxwell go head-to-head against each other in the upcoming Border Gavaskar series. He also called them as two of the finest players of the generation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/duleep-trophy-india-d-captain-shreyas-iyer-out-duck-sunglasses-anantapur-2599069-2024-09-13",
      "headline": "Wearing sunglasses while batting, Shreyas Iyer falls for a duck in Duleep TrophyDuleep Trophy 2024: India D captain Shreyas Iyer, who wore sunglasses while batting, failed to trouble the scorers. His troubles against the short deliveries continued as left-arm pacer Khaleel Ahmed dismissed him on Friday morning in Anantapur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/in-pics-gambhir-leads-indian-teams-huddle-in-chennai-for-bangladesh-test-series-2599065-2024-09-13",
      "headline": "In pics: Gambhir leads Indian team's huddle in Chennai for Bangladesh Test seriesGautam Gambhir led the Indian team's huddle as the Test squad reached Chennai ahead of the 1st match vs Bangladesh. The opening Test will be played on September 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/kylian-mbappe-paris-saint-germain-legal-battle-wage-disput-ligue-one-comission-2599046-2024-09-13",
      "headline": "Mbappe and PSG set for likely court battle after wage disputeKylian Mbappé and PSG are likely headed for a legal battle after the club refused to pay his unpaid wages, following his free transfer to Real Madrid, marking a bitter end to their seven-year relationship."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/usman-khawaja-picks-travis-head-as-australias-opener-for-border-gavaskar-series-2599036-2024-09-13",
      "headline": "Usman Khawaja picks Travis Head as Australia's opener for Border Gavaskar seriesUsman Khawaja picked Travis Head as his opening partner for the Border Gavaskar series between India and Australia. Khawaja felt that Steve Smith should bat at No. 4."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/prime-minister-narendra-modi-paralympics-stars-medals-performers-winning-mentality-2599015-2024-09-13",
      "headline": "'Played like performers not participants': PM Modi praises Paralympics starsPrime Minister Narendra Modi praised India's Paralympians for their historic 29-medal haul at the Paris Paralympics, commending their role in shifting the nation's mindset from just participating to competing with a winning attitude on the global stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-virat-kohli-arrives-in-chennai-for-india-vs-bangladesh-test-series-2599012-2024-09-13",
      "headline": "Watch: Virat Kohli arrives in Chennai for India vs Bangladesh Test seriesVirat Kohli has arrived in Chennai for the 1st Test between India and Bangladesh. He landed at Chennai airport, directly from London, as the star batter would regroup with the Indian team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/la-liga-hugo-mallo-sexual-assault-guilty-celta-vigo-espanyol-mascot-costume-2598991-2024-09-13",
      "headline": "Former Celta Vigo captain Hugo Mallo found guilty of sexual assaultFormer Celta Vigo captain Hugo Mallo was found guilty of sexually assaulting Espanyol's mascot back in 2019. The player plans to appeal the Barcelona court's ruling, which has drawn significant attention due to his high-profile status."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-ben-shelton-madison-square-park-exhibition-jessica-pegula-emma-navarro-2599003-2024-09-13",
      "headline": "Carlos Alcaraz set to face Ben Shelton in Madison Square exhibition clashCarlos Alcaraz headlines the star-studded Garden Cup at Madison Square Garden in December, facing Ben Shelton. With top players like Jessica Pegula and Emma Navarro, the event marks tennis' return to the iconic venue since 2018."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afg-v-nz-greater-noida-rain-forces-1st-abandoned-test-in-26-years-8th-in-history-2599002-2024-09-13",
      "headline": "Rain in Greater Noida leads to first abandoned Test match in 28 yearsThe one-off Test match between Afghanistan and New Zealand became only the 8th Test match in cricketing history to be abandoned without any ball being bowled. Persistent rain in Greater Noida played spoilsport on all five days of the Test match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/prime-minister-narendra-modi-paralympics-stars-medals-performers-winning-mentality-2599015-2024-09-13",
      "headline": "'Played like performers not participants': PM Modi praises Paralympics starsPrime Minister Narendra Modi praised India's Paralympians for their historic 29-medal haul at the Paris Paralympics, commending their role in shifting the nation's mindset from just participating to competing with a winning attitude on the global stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-virat-kohli-arrives-in-chennai-for-india-vs-bangladesh-test-series-2599012-2024-09-13",
      "headline": "Watch: Virat Kohli arrives in Chennai for India vs Bangladesh Test seriesVirat Kohli has arrived in Chennai for the 1st Test between India and Bangladesh. He landed at Chennai airport, directly from London, as the star batter would regroup with the Indian team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/la-liga-hugo-mallo-sexual-assault-guilty-celta-vigo-espanyol-mascot-costume-2598991-2024-09-13",
      "headline": "Former Celta Vigo captain Hugo Mallo found guilty of sexual assaultFormer Celta Vigo captain Hugo Mallo was found guilty of sexually assaulting Espanyol's mascot back in 2019. The player plans to appeal the Barcelona court's ruling, which has drawn significant attention due to his high-profile status."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-ben-shelton-madison-square-park-exhibition-jessica-pegula-emma-navarro-2599003-2024-09-13",
      "headline": "Carlos Alcaraz set to face Ben Shelton in Madison Square exhibition clashCarlos Alcaraz headlines the star-studded Garden Cup at Madison Square Garden in December, facing Ben Shelton. With top players like Jessica Pegula and Emma Navarro, the event marks tennis' return to the iconic venue since 2018."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afg-v-nz-greater-noida-rain-forces-1st-abandoned-test-in-26-years-8th-in-history-2599002-2024-09-13",
      "headline": "Rain in Greater Noida leads to first abandoned Test match in 28 yearsThe one-off Test match between Afghanistan and New Zealand became only the 8th Test match in cricketing history to be abandoned without any ball being bowled. Persistent rain in Greater Noida played spoilsport on all five days of the Test match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shane-warnes-daughter-wishes-him-a-happy-heavenly-birthday-shares-on-insta-2598982-2024-09-13",
      "headline": "Shane Warne's daughter wishes him a 'happy heavenly birthday', shares on InstaShane Warne's daughter Brook shared a heartfelt birthday wish for her father, who would have turned 55 on September 13. Warne suffered a heart attack and passed away 2 years ago."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/india-vs-pakistan-hockey-asian-champions-trophy-head-to-head-statistics-records-2598974-2024-09-13",
      "headline": "Asian Champions Trophy 2024, India vs Pakistan: H2H, all you need to knowIndia and Pakistan will renew their rivalry on the hockey field as they face off in the Asian Champions Trophy 2024 on September 14, Saturday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/cristiano-ronaldo-billion-followers-social-media-record-history-first-ever-2598964-2024-09-13",
      "headline": "With 1 billion followers, Ronaldo creates social media historyCristiano Ronaldo became the first individual athlete to surpass 1 billion followers across social media, solidifying his status as the most influential athlete globally, just days after reaching 900 career goals on the football field."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/county-cricket-championship-somerset-aggressive-fielding-watch-surrey-2598956-2024-09-13",
      "headline": "Watch: Somerset stun Surrey with last-minute aggressive field setupSomerset's bold field setup and teenage sensation Archie Vaughan's 11-wicket haul secured a dramatic victory over Surrey, keeping their County Championship title hopes alive in a thrilling display of tactical brilliance and emerging talent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-test-series-redemption-past-horrors-rohit-sharma-najmul-shanto-2598954-2024-09-13",
      "headline": "Bangladesh look for redemption after past horrors in India TestsIND vs BAN: Bangladesh aren't the favourites to win their Test series against India, but they can hold their heads high if they give India a run for their money."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hardik-pandya-bowls-with-red-ball-speculation-test-comeback-2598894-2024-09-12",
      "headline": "Hardik bowls with red ball, triggers speculation over his Test comebackIndia's all-rounder Hardik Pandya has reignited discussions about his Test cricket comeback after sharing a video of his red-ball training session in England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/archie-vaughan-11-wicket-haul-somerset-beat-surrey-county-championship-2598887-2024-09-12",
      "headline": "Archie's 11-wicket haul spins Somerset to stunning win vs SurreySomerset defeated title-holders Surrey on Thursday, with Archie, the teenage son of former England captain Michael Vaughan, taking 11 wickets to open up the race for English cricket's County Championship.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/rafael-nadal-withdraws-laver-cup-statement-social-media-2598877-2024-09-12",
      "headline": "Rafael Nadal pulls out of Laver Cup: Won't be able to compete in Berlin Rafael Nadal has announced that he will not compete for Team Europe at the Laver Cup in Berlin. Nadal posted a statement on social media, saying that he was taking the decision for the benefit of the team.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-test-series-redemption-past-horrors-rohit-sharma-najmul-shanto-2598954-2024-09-13",
      "headline": "Bangladesh look for redemption after past horrors in India TestsIND vs BAN: Bangladesh aren't the favourites to win their Test series against India, but they can hold their heads high if they give India a run for their money."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/hardik-pandya-bowls-with-red-ball-speculation-test-comeback-2598894-2024-09-12",
      "headline": "Hardik bowls with red ball, triggers speculation over his Test comebackIndia's all-rounder Hardik Pandya has reignited discussions about his Test cricket comeback after sharing a video of his red-ball training session in England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/archie-vaughan-11-wicket-haul-somerset-beat-surrey-county-championship-2598887-2024-09-12",
      "headline": "Archie's 11-wicket haul spins Somerset to stunning win vs SurreySomerset defeated title-holders Surrey on Thursday, with Archie, the teenage son of former England captain Michael Vaughan, taking 11 wickets to open up the race for English cricket's County Championship.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/rafael-nadal-withdraws-laver-cup-statement-social-media-2598877-2024-09-12",
      "headline": "Rafael Nadal pulls out of Laver Cup: Won't be able to compete in Berlin Rafael Nadal has announced that he will not compete for Team Europe at the Laver Cup in Berlin. Nadal posted a statement on social media, saying that he was taking the decision for the benefit of the team.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-united-cristiano-ronaldo-erik-ten-hag-2598872-2024-09-12",
      "headline": "Manchester United boss Erik ten Hag responds to Cristiano Ronaldo commentsManchester United boss Erik ten Hag has responded to the criticism from Cristiano Ronaldo and said that the Portuguese superstar is far away from Manchester at the moment. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ireland-name-odis-t20is-squad-for-south-africa-series-2598841-2024-09-12",
      "headline": "Balbirnie dropped for T20Is as Ireland name squad for South Africa seriesIreland have named their white-ball squads for the upcoming series against South Africa in the UAE. Test captain Andrew Balbirnie wasn't picked in the T20I squad and will open the batting in ODIs."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/anwar-ali-east-bengal-move-delhi-hc-seek-stay-on-players-suspension-by-aiff-2598826-2024-09-12",
      "headline": "Anwar Ali, East Bengal move Delhi HC, seek stay on player's suspension by AIFFIndia defender Anwar Ali, along with East Bengal and Delhi FC, has moved the Delhi High Court seeking a stay on the AIFF's suspension. The suspension was imposed for 'illegally terminating' his contract with Mohun Bagan and included a hefty compensation demand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-smriti-mandhana-dazzles-advertisement-shah-rukh-khan-shafali-verma-jemimah-rodrigues-2598806-2024-09-12",
      "headline": "Watch: Smriti Mandhana dazzles in brand new advertisement with SRK Smriti Mandhana, Shah Rukh Khan, Shafali Verma and Jemimah Rodrigues featured in a latest advertisement. Shafali, Mandhana and Jemimah will also take part in the Women's T20 World Cup 2024. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/how-i-made-it/story/wc-influential-ten-writers-community-honors-digital-social-change-makers-2527796-2024-04-16",
      "headline": "WC influential ten: Writers community honors digital social change makersWriters Community Freelancers Releases 'WC Influential Ten' List Recognizing Social Impact through Virtual Space and Social Media"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}