{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/retiring-without-children-here-is-how-to-plan-for-a-comfortable-and-secure-future-2749583-2025-07-02",
      "headline": "Retiring without children? Here's how to plan for a comfortable and secure futureToday, more and more Indians are choosing to remain child-free or find themselves without direct heirs for various reasons. For them, retirement planning isn't just about saving money and building a corpus, it's about securing comfort, care, dignity, and independence in their golden years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-288-points-lower-nifty-settles-below-25-500-tata-steel-down-4-percent-2749530-2025-07-02",
      "headline": "Sensex ends 288 points lower, Nifty settles below 25, 500; Tata Steel down 4%The S&P BSE Sensex was down 287.60 points to end at 83,409.69, while the NSE Nifty50 lost 88.40 points to end at 25,453.40."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/need-your-uan-heres-how-to-get-it-and-manage-your-pf-smoothly-2749480-2025-07-02",
      "headline": "Need your UAN? Here's how to get it and manage your PF smoothlyThe biggest advantage of a UAN is its permanence. It doesn't change when you change jobs. It ties together all your PF accounts, making fund tracking and management simple and paperless."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/57-percent-of-indians-call-skills-critical-but-skill-frameworks-still-lag-report-2749444-2025-07-02",
      "headline": "57% of Indians call skills critical, but relevant frameworks still lag: ReportAon's 2025 APAC Skills Impact Survey reveals what really matters for Indian firms today. It reveals that for the next two to three years, Indian firms are prioritising talent retention, leadership pipelines, and workforce agility."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/tax-expert-explains-how-rs-7-lakh-profit-led-to-a-rs-74000-shock-for-investor-2749447-2025-07-02",
      "headline": "Investor earns Rs 7 lakh, faces Rs 74,000 tax despite Rs 12 lakh limit. Know whySujit Bangar, founder of TaxBuddy.com and a former IRS officer, shared the example on LinkedIn to warn investors against a common misconception."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/personal-finance-epfo-pf-account-balance-check-regularly-company-deposit-kyc-issue-money-savings-2749438-2025-07-02",
      "headline": "Don't ignore your EPF: Here's why checking it regularly mattersExperts warn that many salaried employees don't realise until it's too late that their employer hasn't been depositing funds, or that a simple KYC error has locked their money away."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-holidays-july-2025-here-is-what-traders-should-know-nse-bse-holiday-list-2749379-2025-07-02",
      "headline": "Stock market holidays July 2025: Here's what traders should knowBefore you plan your next trade or check your stocks, it helps to know if the market is open. Here's a quick look at whether the NSE and BSE will have any holidays this July."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/major-gst-relief-on-cards-as-government-considers-lowering-tax-rate-on-common-household-items-sources-2749359-2025-07-02",
      "headline": "Ghee, soap and snacks to get cheaper? Big GST cut likely, say sourcesSources say the government is weighing a major rejig of GST slabs that could bring down the tax burden on everyday essentials."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/wanting-to-switch-between-old-and-new-tax-regime-here-is-how-to-do-it-while-filing-itr-2749351-2025-07-02",
      "headline": "Wanting to switch tax regime? Here's how to do it while filing ITRIf you're a salaried employee with no business or professional income, you have the flexibility to choose the tax regime every year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/hdb-financial-share-price-listing-premium-13-percent-rs-835-bse-nse-hold-sell-buy-expert-view-2749322-2025-07-02",
      "headline": "HDB Financial lists at 13% premium: Should you book profit or hold?HDB Financial share price: The stock opened at Rs 835 on both the NSE and BSE, compared to its IPO price of Rs 740 per share. This was better than what the grey market had expected, which had estimated a gain of around 8% to 10% on listing day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sbi-classifies-reliance-communications-loan-account-as-fraud-2749309-2025-07-02",
      "headline": "SBI classifies Reliance Communications loan account as 'fraud'In a stock exchange filing, Reliance Communications stated that SBI has decided in connection with credit facilities dating back to August 2016. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/hdb-financial-share-price-market-debut-13-percent-premium-nse-bse-emkay-global-rating-2749304-2025-07-02",
      "headline": "HDB Financial shares make strong debut with 13% premium on stock marketHDB Financial shares listed at a premium of 13%. The stock made its debut at Rs 835 on both the NSE and BSE, marking a 12.84% gain (Rs 95) over the issue price of Rs 740."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/deepika-padukone-makes-history-with-hollywood-walk-of-fame-in-2026-glbs-2749830-2025-07-03",
      "headline": "Deepika Padukone makes history with Hollywood Walk of Fame in 2026Deepika Padukone becomes the first Indian actress named to the Hollywood Walk of Fame's Class of 2026, marking a historic achievement in global cinema and representation for Indian talent.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/elnaaz-norouzi-prepared-for-six-months-the-traitors-read-psychology-books-karan-johar-2749643-2025-07-02",
      "headline": "The Traitors: Actor Elnaaz Norouzi prepared for six months, read psychology booksActor Elnaaz Norouzi opened up about her six-month preparation for 'The Traitors' in a recent YouTube video. The actor disclosed reading several books on human psychology. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shanaya-kapoor-opens-up-on-trolls-says-she-reads-negative-comments-to-get-better-2749661-2025-07-02",
      "headline": "Shanaya Kapoor opens up on trolls, says she reads negative comments to get betterAhead of her debut in 'Aankhon Ki Gustaakhiyan', Shanaya Kapoor shared that she actively reads negative comments to understand audience feedback and improve her craft. Despite facing brutal remarks about her appearance, she filters the noise and takes criticism positively."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/siddharth-anand-reacts-comparison-of-brad-pitt-f1-with-ta-ra-rum-pum-saif-ali-khan-2749654-2025-07-02",
      "headline": "Internet compares Brad Pitt's F1 to Ta Ra Rum Pum: Director Siddharth Anand reactsDirector Siddharth Anand responded to social media memes that 'Ta Ra Rum Pum' inspired Brad Pitt's 'F1'. The Hollywood drama released in theatres on June 27. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/apoorva-mukhija-on-life-after-the-traitors-i-want-to-get-married-2749676-2025-07-02",
      "headline": "Apoorva Mukhija on life after The Traitors: I want to get marriedApoorva Mukhija shared that she now wants to get married and take a break from reality shows and content creation. Currently, a part of the OTT reality show 'The Traitors', she joked about having a swayamvar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/sean-diddy-combs-convicted-in-sex-abuse-case-but-acquitted-of-trafficking-charges-2749678-2025-07-02",
      "headline": "Sean 'Diddy' Combs not guilty of sex trafficking, convicted on lesser chargeSean 'Diddy Combs' was convicted of a prostitution-related felony but acquitted of sex trafficking and racketeering charges that could have led to a life sentence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diljit-dosanjh-denies-border-2-exit-sardaar-ji-row-shares-video-from-set-2749675-2025-07-02",
      "headline": "Diljit Dosanjh's BTS video dismisses Border 2 exit buzz amid Sardaar Ji 3 backlashDiljit Dosanjh refuted rumours of being replaced in 'Border 2'. The actor shared a video from the sets of the upcoming film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ramayana-part-1-laxman-ravi-dubey-most-expensive-indian-film-budget-835-crore-not-vicky-kaushal-ranveer-singh-2749652-2025-07-02",
      "headline": "Meet engineer who is playing main role in India's 1st Rs 835 crore epic filmAn actor known for donning many hats, who transitioned from engineering to television shows, will next be seen in the most expensive Indian film. Married to a famous Indian actor and his business partner, he is not Ranveer Singh or Vicky Kaushal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/heads-of-state-x-review-priyanka-chopra-john-cena-idris-alba-film-perfect-popcorn-action-flick-2749462-2025-07-02",
      "headline": "Heads of State X review: Priyanka Chopra's film is a perfect popcorn action flickMost of the social media users gave 'Heads of State' featuring Priyanka Chopra, John Cena and Idris Alba a thumbs up on X. The film premiered on Prime Video today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/video/priyanka-chopra-on-her-heads-of-state-role-director-felt-important-to-have-a-woman-2749638-2025-07-02",
      "headline": "Priyanka Chopra on her Heads of State role: Director felt important to have a womanPriyanka Chopra, in an exclusive interview with India Today, spoke about her role in the latest release, 'Heads of State'. The actor even spoke about female-driven roles in cinema. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/film-body-aicwa-to-pm-narendra-modi-on-pakistani-channels-reappearance-in-india-saba-qamar-mawra-hoccane-ban-pak-content-2749636-2025-07-02",
      "headline": "Ban Pak content: Film body to PM as channels and accounts reappear on social mediaThe Instagram accounts of Saba Qamar, Mawra Hocane and other Pakistani artistes were made available in India from July 2. AICWA has now written a letter to PM Narendra Modi, highlighting the reappearance of Pakistani content in India and the need for a complete ban. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/3bhk-movie-review-siddharth-sarathkumar-sri-ganesh-feel-good-drama-that-hits-home-2749625-2025-07-02",
      "headline": "3BHK review: Siddharth, Sarathkumar power through feel-good drama that hits homeReleased-Fri Jul 04, 20253BHK movie review: Director Sri Ganesh's '3BHK' starring Siddharth, Sarathkumar and Meetha Raghunath, is an endearing story about the struggles of a middle-class family. With heartfelt emotions and layered storytelling, the film is a mirror that reflects reality. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/maniesh-paul-to-play-villain-in-karan-johar-next-his-new-look-leaves-fans-curious-2749553-2025-07-02",
      "headline": "Maniesh Paul to play villain in KJo's next? His new look leaves fans curiousActor Maniesh Paul hinted at his next film by sharing photos of his new look on Instagram. The photos left fans and celebrities curious whether Paul would be playing a villain in the film. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/squid-game-season-3-breaks-netflix-records-global-streaming-success-2749578-2025-07-02",
      "headline": "Squid Game 3 breaks Netflix records with 60.1 million views in 3 days'Squid Game Season 3' has shattered Netflix records with over 60 million views in just three days. The final season strengthens the franchise's global legacy while sparking talks of a US adaptation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anurag-basu-credits-irrfan-for-metro-in-dino-pays-tribute-to-him-and-kk-2749513-2025-07-02",
      "headline": "Anurag Basu credits Irrfan for Metro In Dino: This film is a tribute to him and KKDirector Anurag Basu, in an interview, credited Irrfan for 'Metro In Dino'. The upcoming film is a spiritual sequel to 'Life In A Metro.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/video/exclusive-priyanka-chopra-on-missing-hindi-films-ssmb29-and-upcoming-projects-2749595-2025-07-02",
      "headline": "Exclusive: Priyanka Chopra on missing Hindi films, SSMB29, and upcoming projectsPriyanka Chopra's latest Hollywood action-comedy 'Heads of State', co-starring John Cena and Idris Elba, is now streaming on Prime Video. In an exclusive interview with India Today, the actor opened up about her excitement for her next Indian film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/john-cena-credits-indian-fans-for-his-global-reach-priyanka-chopra-heads-of-state-2749575-2025-07-02",
      "headline": "Exclusive: John Cena credits Indian fans for his global reach, says is fortunateHollywood stars Priyanka Chopra and John Cena expressed deep gratitude and personal connection to India as their film 'Heads of State' released on Prime Video on July 2. Both actors cherished the warmth of Indian fans and look forward to continuing their journey with strong ties to Indian audiences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/christopher-nolan-the-odyssey-trailer-leaked-tom-holland-matt-damon-2749425-2025-07-02",
      "headline": "Tom Holland, Matt Damon stun in leaked trailer of Christopher Nolan's The OdysseyThe trailer for 'The Odyssey', directed by Christopher Nolan, has leaked online. The upcoming film features Tom Holland, Matt Damon, and Jon Bernthal in key roles. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/hari-hara-veera-mallu-trailer-gets-a-thumbs-up-from-pawan-kalyan-watch-2749469-2025-07-02",
      "headline": "Hari Hara Veera Mallu trailer gets a thumbs-up from Pawan Kalyan. WatchWith just weeks to go for its release, the makers of 'Hari Hara Veera Mallu – Part 1' have begun full-fledged promotions. A behind-the-scenes (BTS) video of Pawan Kalyan watching the trailer has added to the hype, especially as the actor's excited response signals strong expectations."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/goa-pune-spicejet-window-frame-comes-loose-midair-passenger-safety-unaffected-2749737-2025-07-02",
      "headline": "SpiceJet aircraft's window frame comes loose mid-air, airline says no riskA window frame of a Goa-Pune SpiceJet flight came loose mid-air, sending passengers into a frenzy. However, the window frame was fixed at Pune airport and the airline said there was no risk to passengers' safety."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/op-sindoor-delegations-conveyed-a-message-of-national-unity-s-jaishankar-told-quad-leaders-2749763-2025-07-02",
      "headline": "Op Sindoor delegations conveyed national unity message: Jaishankar to Quad leadersJaishankar said that since Parliamentarians from different parties participated in the global outreach, it was India's \"political pluralism\" coming together for a common cause in the national interest, which was great."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nhai-lawyer-show-cause-notice-mp-highway-traffic-jam-high-court-hearing-2749704-2025-07-02",
      "headline": "Notice to lawyer over 'why leave early' remark after 3 die in 40-hour highway jamAn NHAI lawyer, who sparked a row over his 'why people leave home early' remark during a court hearing on the deaths of three people in a 40-hour Madhya Pradesh highway jam, was issued a show-cause notice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-2nd-test-day-1-report-shubman-gill-hundred-edgbaston-2749791-2025-07-02",
      "headline": "Day 1: Shubman Gill's hundred takes spotlight off selection scrutinyEngland vs India, 2nd Test: Captain Shubman Gill scored a superb century to help India recover from a mini-collapse at the start of the final session. India ended Day 1 on 310 for 5, with Gill and Ravindra Jadeja (41) sharing a crucial 99-run unbeaten partnership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/unidentified-interstellar-object-flying-from-outside-solar-system-discovered-2749790-2025-07-02",
      "headline": "Unidentified interstellar object flying from outside Solar System discoveredThe object was first noticed by NASA's Asteroid Terrestrial-impact Last Alert System (ATLAS), with further observations quickly pouring in from both professional and amateur astronomers worldwide. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-woman-kills-mother-in-law-land-dispute-affairs-with-brothers-husband-police-jhansi-2749793-2025-07-02",
      "headline": "Woman kills mother-in-law over land dispute, had affairs with husband's 2 brothersA woman in Uttar Pradesh's Jhansi killed her mother-in-law over a land dispute. Police said the accused had affairs with two brothers of her late husband. The accused also stole the victim's jewellery and attempted to sell it off."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-receives-grand-welcome-ghana-meets-president-mahama-2749814-2025-07-03",
      "headline": "PM Modi receives grand welcome in Ghana, meets President MahamaPM Narendra Modi arrived in Ghana on a historic two-day visit, marking the first visit by an Indian Prime Minister in 30 years. He held bilateral talks with President John Mahama and was warmly welcomed with traditional honours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-day-3-live-updates-london-carlos-alcaraz-aryna-sabalenka-2749531-2025-07-02",
      "headline": "Wimbledon, Day 3 Highlights: Jasmine Paolini knocked out, Carlos Alcaraz into Round 3Wimbledon, Day 3 Live updates: Aryna Sabalenka went through to Round 3 after beating Marie Bouzkova of the Czech Republic. Emma Raducanu and Carlos Alcaraz also advanced, while India's Yuki Bhambri also advanced to the third round. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/illegal-migrant-cannibal-started-eating-himself-during-deportation-flight-us-kristi-noem-trump-alligator-alcatraz-2749618-2025-07-02",
      "headline": "Illegal immigrant started eating himself up while being deported: US officialUS Homeland Security Secretary Kristi Noem said that an illegal immigrant, who she described as a \"cannibal\", began eating himself up during a deportation flight. She cited the example to justify that American federal agents were targeting the \"worst of the worst\" illegal immigrants in the US, not hard-working community members."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-zohran-mamdani-new-york-city-politics-communist-lunatic-jab-attacks-2749670-2025-07-02",
      "headline": "Won't let this 'communist lunatic' destroy New York: Trump's dig at Zohran MamdaniUS President Donald Trump stepped up his attack on Indian-origin mayoral candidate Zohran Mamdani, calling him a \"communist lunatic\" and vowing to save New York City and make it \"hot and great\" again."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ban-on-several-pak-news-websites-and-social-media-accounts-of-celebrities-imposed-during-op-sindoor-reversed-2749644-2025-07-02",
      "headline": "Ban on Pak news and social media channels, imposed during Op Sindoor, reversedThe Instagram accounts of several Pakistani celebrities, including those of Saba Qamar, Mawra Hocane, Ahad Raza Mir, Hania Amir are now visible in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/carlsen-questions-gukesh-rapid-blitz-skills-superunited-rapid-blitz-croatia-2025-2749804-2025-07-02",
      "headline": "Carlsen makes bold assessment of Gukesh at Grand Chess: One of weaker playersMagnus Carlsen has made a bold statement about reigning world champion Gukesh, questioning the teenager's credentials in faster formats by saying the youngest classical world champion in history \"hasn't done anything to indicate he's going to do well in such a tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-yashasvi-jaiswal-record-birmingham-2749686-2025-07-02",
      "headline": "Yashasvi Jaiswal breaks 51-year-old record with 87 in Birmingham TestENG vs IND: Yashasvi Jaiswal recorded the highest individual score by an Indian batter in Tests at Edgbaston in Birmingham, going past Sudhir Naik's 51-year-old record. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/unacceptable-us-slams-iran-for-suspending-cooperation-with-iaea-glbs-2749817-2025-07-03",
      "headline": "Unacceptable: US slams Iran for suspending cooperation with IAEAThe US has urged Iran to resume full cooperation with the IAEA after President Pezeshkian signed a law halting inspections. The US called the move \"unacceptable\" and warned Iran against using it to gain leverage. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/europe-boils-deadly-heatwave-claims-8-lives-as-temperatures-break-records-glbs-2749825-2025-07-03",
      "headline": "Europe boils: Deadly heatwave claims 8 lives as temperatures break recordsA severe early-summer heatwave has killed at least 8 people across Europe, with record-breaking temperatures sparking wildfires, health emergencies, and power plant shutdowns. Spain, France, and Italy are amongst the hardest hit, while scientists link the extreme weather to climate change and warn of more to come."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/delhi-car-ban-is-unindian-2749596-2025-07-02",
      "headline": "Delhi's Car Ban is Un-IndianDelhi's car ban targets vehicles over 10-15 years old to curb air pollution. This clashes with India's sustainable, repair-not-replace ethos, rendering the ban un-Indian."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/ai-chatgpt-helps-woman-pay-off-her-23000-credit-card-debt-jennifer-allan-financial-advice-us-delaware-2749691-2025-07-02",
      "headline": "ChatGPT helps US woman pay off her $23,000 credit card debtA realtor from Delaware in the US used ChatGPT as her financial advisor to tackle her credit card debt. The AI chatbot reportedly helped her find over $10,000 in unclaimed funds and save nearly $600 monthly. She credited ChatGPT's consistent support for helping her pay the debt."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diljit-dosanjh-denies-border-2-exit-sardaar-ji-row-shares-video-from-set-2749675-2025-07-02",
      "headline": "Diljit Dosanjh's BTS video dismisses Border 2 exit buzz amid Sardaar Ji 3 backlashDiljit Dosanjh refuted rumours of being replaced in 'Border 2'. The actor shared a video from the sets of the upcoming film. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/technology/story/microsoft-to-cut-6000-jobs-to-rein-in-cost-of-investment-in-ai-infrastructure-2749683-2025-07-02",
      "headline": "Microsoft to cut 6,000 jobs in fresh round of lay offs amid restructuringMicrosoft had pledged USD 80 billion in capital spending for its fiscal year 2025. However, the soaring cost of scaling its AI infrastructure has weighed on its margins."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-gets-first-batch-of-apache-attack-helicopters-after-delay-to-deploy-along-pakistan-border-2749520-2025-07-02",
      "headline": "India to get 1st batch of Apache choppers this month, to deploy along Pak borderThe delivery of Apache AH-64E attack helicopters from the United States has missed multiple deadlines. As part of a $600 million deal signed in 2020 with the US, the Indian Army expected delivery of six Apache helicopters by May-June 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/asaduddin-owaisi-up-government-nameplate-order-row-shopkeepers-harassed-cops-2749539-2025-07-02",
      "headline": "Shopkeepers being asked to remove their pants: Owaisi slams UP over nameplate rowAIMIM chief Asaduddin Owaisi alleged that shopkeepers in UP's Muzaffarnagar were being asked to remove their pants amid a row over the state government's directive asking eateries to display their owners' names on boards."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/dubai-dark-secret-sexual-abuse-behind-porta-potty-parties-ultra-rich-influencers-social-media-racial-profile-2748912-2025-07-02",
      "headline": "Dubai's dark secret: Sexual extremities in Porta-Potty parties of the ultrarichDubai's ultrarich lure women into secret Porta-Potty parties with luxury gifts, only to exploit them through degrading sexual acts. The recent death of a Ukrainian model in Dubai has been linked to sexual extremities at a Porta-Potty party. Experts are now warning young female tourists against such private events that have legal risks too."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/infosys-employee-arrested-for-secretly-filming-women-in-bengaluru-campus-restroom-over-30-videos-found-2749549-2025-07-02",
      "headline": "Bengaluru Infosys employee arrested for filming videos of women in washroomAn Infosys employee was arrested for secretly recording female colleagues in a restroom at the Bengaluru campus. The incident surfaced when a woman caught him in action. Police arrested him following her complaint."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/encounter-breaks-out-in-jks-kishtwar-2-3-jaish-terrorists-trapped-2749726-2025-07-02",
      "headline": "Encounter breaks out in J&K's Kishtwar, 2-3 Jaish terrorists trappedAt least two to three terrorists belonging to Pakistan-based terror outfit, Jaish-e-Mohammad, have been engaged by the security forces."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-jasmine-paolini-carlos-alcaraz-emma-raducanu-2749820-2025-07-03",
      "headline": "Jasmine Paolini stunned in Round 2, Alcaraz, Raducanu progressWimbledon 2025: Kamilla Rakhimova handed Jasmine Paolini a shock defeat, winning in three sets. Emma Raducanu and Carlos Alcaraz secured their berths in the third round of the grass court major. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-rohan-bopanna-yuki-bhambri-rithvik-bollipalli-2749816-2025-07-03",
      "headline": "Rohan Bopanna crashes out, Yuki Bhambri, Rithvik Bollipalli advanceWimbledon 2025: Yuki Bhambri and Rithvik Bollipalli made their way through to the second round of men's doubles, but veteran Rohan Bopanna failed to go beyond the opening round. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/carlsen-questions-gukesh-rapid-blitz-skills-superunited-rapid-blitz-croatia-2025-2749804-2025-07-02",
      "headline": "Carlsen makes bold assessment of Gukesh at Grand Chess: One of weaker playersMagnus Carlsen has made a bold statement about reigning world champion Gukesh, questioning the teenager's credentials in faster formats by saying the youngest classical world champion in history \"hasn't done anything to indicate he's going to do well in such a tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-2nd-test-day-1-report-shubman-gill-hundred-edgbaston-2749791-2025-07-02",
      "headline": "Day 1: Shubman Gill's hundred takes spotlight off selection scrutinyEngland vs India, 2nd Test: Captain Shubman Gill scored a superb century to help India recover from a mini-collapse at the start of the final session. India ended Day 1 on 310 for 5, with Gill and Ravindra Jadeja (41) sharing a crucial 99-run unbeaten partnership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-2nd-test-shubman-gill-hundred-virat-kohli-edgbaston-2749781-2025-07-02",
      "headline": "ENG vs IND: Captain Shubman Gill emulates Virat Kohli with gritty Edgbaston hundredShubman Gill emulated Virat Kohli as he became the fourth Indian captain to score consecutive hundreds in their first two Tests. Gill got to his seventh hundred, showing his grit and determination. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-vs-bangladesh-1st-odi-charith-asalanka-wanindu-hasaranga-2749757-2025-07-02",
      "headline": "Bangladesh lose 1st ODI after humiliating collapse vs Sri LankaSL vs BAN: Sri Lanka took a 1-0 lead in the three-match series after beating Bangladesh by 77 runs in the opening game on Wednesday, July 2, at the R. Premadasa Stadium in Colombo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/afc-womens-asia-cup-qualifiers-india-thrash-iraq-qualification-2749743-2025-07-02",
      "headline": "India edge closer to Women's Asia Cup qualification with Iraq thrashingThe Indian women's team edge closer to qualification to the AFC Women's Asia Cup as they thrashed Iraq 5-0 on Wednesday, July 2. India needs one more win to make it to the AFC Asia Cup 2027. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhav-suryavanshi-second-fastest-fifty-u19-odis-india-vs-england-2749739-2025-07-02",
      "headline": "Vaibhav Suryavanshi hits second-fastest fifty by an Indian in U19 ODIsVaibhav Suryavanshi scored the second-fastest fifty by an Indian batter in an Under-19 ODI during the third Youth ODI against England on Wednesday. The left-hander reached his half-century in just 20 balls, bringing it up with a six off England's James Minto."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/omkar-salvi-retained-mumbai-head-coach-ranji-irani-t20-titles-2749732-2025-07-02",
      "headline": "Omkar Salvi retained as Mumbai head coach after key domestic winsRoyal Challengers Bengaluru bowling coach Omkar Salvi will continue as the head coach of the Mumbai senior team, the Mumbai Cricket Association (MCA) confirmed on Wednesday.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/aryna-sabalenka-marie-bouzkova-madison-keys-wimbledon-2749721-2025-07-02",
      "headline": "Aryna Sabalenka survives Bouzkova scare, Madison Keys into Round 3Wimbledon 2025: Aryna Sabalenka has gone through to the third round after beating Marie Bouzkova in straight sets. Madison Keys and Cameron Norrie also won their respective second-round matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-india-2nd-test-ben-stokes-dismisses-yashasvi-jaiswal-heated-exchange-2749699-2025-07-02",
      "headline": "Ben Stokes dismisses Yashasvi Jaiswal moments after intense war of wordsBen Stokes turned the heat up at Edgbaston on Day 1 of the second Test, removing Yashasvi Jaiswal moments after a tense exchange of words with the young Indian opener."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/afc-womens-asia-cup-qualifiers-india-thrash-iraq-qualification-2749743-2025-07-02",
      "headline": "India edge closer to Women's Asia Cup qualification with Iraq thrashingThe Indian women's team edge closer to qualification to the AFC Women's Asia Cup as they thrashed Iraq 5-0 on Wednesday, July 2. India needs one more win to make it to the AFC Asia Cup 2027. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhav-suryavanshi-second-fastest-fifty-u19-odis-india-vs-england-2749739-2025-07-02",
      "headline": "Vaibhav Suryavanshi hits second-fastest fifty by an Indian in U19 ODIsVaibhav Suryavanshi scored the second-fastest fifty by an Indian batter in an Under-19 ODI during the third Youth ODI against England on Wednesday. The left-hander reached his half-century in just 20 balls, bringing it up with a six off England's James Minto."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/omkar-salvi-retained-mumbai-head-coach-ranji-irani-t20-titles-2749732-2025-07-02",
      "headline": "Omkar Salvi retained as Mumbai head coach after key domestic winsRoyal Challengers Bengaluru bowling coach Omkar Salvi will continue as the head coach of the Mumbai senior team, the Mumbai Cricket Association (MCA) confirmed on Wednesday.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/aryna-sabalenka-marie-bouzkova-madison-keys-wimbledon-2749721-2025-07-02",
      "headline": "Aryna Sabalenka survives Bouzkova scare, Madison Keys into Round 3Wimbledon 2025: Aryna Sabalenka has gone through to the third round after beating Marie Bouzkova in straight sets. Madison Keys and Cameron Norrie also won their respective second-round matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-india-2nd-test-ben-stokes-dismisses-yashasvi-jaiswal-heated-exchange-2749699-2025-07-02",
      "headline": "Ben Stokes dismisses Yashasvi Jaiswal moments after intense war of wordsBen Stokes turned the heat up at Edgbaston on Day 1 of the second Test, removing Yashasvi Jaiswal moments after a tense exchange of words with the young Indian opener."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}