{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/agent-body-protest-gst-reform-zero-insurance-distribution-input-tax-credit-prashant-mhatre-2797322-2025-10-03",
      "headline": "Agents' body questions GST cut, says move undermines insurance distributionPrashant Mhatre, All India President of the General Insurance Agents Federation Integrated (GIAFI), has sounded an alarm, saying the decision risks weakening the role of agents, brokers, and advisors who are central to India's insurance reach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/planning-a-personal-loan-do-not-make-these-5-errors-2795807-2025-10-03",
      "headline": "Planning a personal loan? Don't make these 5 errorsWhile personal loans can be a handy financial tool, they come with risks if mismanaged. Avoid these five common errors to keep your finances safe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/chennai-firm-wintrack-customs-official-bribery-corruption-charge-import-export-sector-cripple-2797228-2025-10-03",
      "headline": "Wintrack vs Chennai Customs is a sorry tale of grease of doing business in IndiaChennai-based logistics company Wintrack has ceased Indian operations, alleging repeated bribery demands and harassment by Chennai Customs, exposing the ugly truth that at Indian Customs integrity is the real contraband.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/delhi-government-may-revise-circle-rates-public-feedback-invited-2797279-2025-10-03",
      "headline": "Delhi government may revise circle rates, public feedback invitedThe Delhi government is considering a revision of circle rates across the city and has called on the public to share their views before any changes are finalised."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/health-insurance-trap-to-watch-2025-room-rent-caps-deductibles-co-pays-save-money-2797278-2025-10-03",
      "headline": "Health insurance in 2025: Key traps that could drain your pocketClauses such as room rent caps, deductibles, and co-pay options are often buried deep in policy documents but can have a massive influence on the claim process."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-end-higher-metal-stocks-gain-tata-steel-2797261-2025-10-03",
      "headline": "Sensex, Nifty recover losses to end higher fuelled by gains in metal stocksThe S&P BSE Sensex added 223.86 points to close at 81,207.17, while the NSE Nifty50 gained 57.95 points to end at 24,894.25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/63-of-households-aware-yet-only-95-invest-in-markets-sebi-survey-shows-2797218-2025-10-03",
      "headline": "63% of households aware, yet only 9.5% invest in markets, Sebi survey showsDespite growing awareness about investing in the markets, the latest Sebi survey shows that only a small fraction of households, i.e., just 9.5%, are actively investing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/looking-for-high-returns-this-small-savings-scheme-beats-ppf-and-nsc-2797178-2025-10-03",
      "headline": "Looking for high returns? This small savings scheme beats PPF and NSCMany investors assume PPF or NSC offer the best returns, but the scheme leads the pack with the highest interest among small savings schemes. Have a look."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/chennai-customs-wintrack-bribe-ask-legal-case-law-help-corruption-business-protection-expert-view-2797188-2025-10-03",
      "headline": "Wintrack vs Chennai Customs: If forced to bribe, can companies fight legally?The Finance Ministry has already ordered an official probe, but the matter has also raised a wider debate: if businesses are forced to pay bribes to get their consignments cleared, do they have the law on their side?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/will-zerodha-end-its-zero-brokerage-model-for-equity-delivery-trades-nithin-kamath-2797133-2025-10-03",
      "headline": "Will Zerodha end its zero-brokerage model for equity delivery trades?Zerodha, long known for offering free equity delivery trades, could soon charge for delivery trades for the first time, signalling a major shift for investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nirmala-sitharaman-opens-kautilya-economic-conclave-seeks-stronger-role-for-india-2797042-2025-10-03",
      "headline": "India can't be passive spectator: Nirmala Sitharaman talks tough amid US tariffsUnion Finance Minister Nirmala Sitharaman opened the Kautilya Economic Conclave 2025 in New Delhi, urging India to play a more active role in shaping global decisions amid growing economic and geopolitical uncertainty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wintrack-support-fallout-chennai-customs-bribery-allegations-corruption-claim-users-x-2797039-2025-10-03",
      "headline": "My Customs story floods X after Wintrack's explosive chargeAfter the Finance Ministry confirmed an official probe into Wintrack's charges, importers, customs brokers, and business owners across the country have started sharing their own accounts of harassment, bribery demands. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/are-ott-platforms-really-a-safe-place-to-launch-newcomers-and-debutants-2797213-2025-10-04",
      "headline": "Are OTT platforms really a safe place to launch newcomers and debutants? OTT platforms have emerged as a safe and effective launchpad for newcomers, providing global reach, creative freedom, and a chance to build skills without box office pressure. They allow fresh talent to experiment, gain visibility, and connect with audiences in a low-risk environment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepika-padukone-ranbir-kapoor-share-a-warm-hug-at-airport-watch-2797557-2025-10-04",
      "headline": "Deepika and Ranbir hug at airport, fans speculate Yeh Jawaani Hai Deewani 2: Watch Fans have been screaming in excitement ever since they saw Deepika Padukone and Ranbir Kapoor together at the airport. A video of the two greeting each other with a hug has emerged online. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kantara-chapter-1-box-office-day-2-rishab-shetty-film-enters-rs-100-crore-club-2797545-2025-10-04",
      "headline": "Kantara Chapter 1 box office Day 2: Rishab Shetty's film enters Rs 100 crore-club 'Kantara Chapter 1' set a new pan-India benchmark, raking in nearly Rs 90 crore worldwide on its first day and crossing Rs 106 crore in net collections within just two days. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sunny-sanskari-ki-tulsi-kumari-box-office-varun-dhawan-janhvi-kapoor-rom-com-faces-kantara-chapter-1-clash-2797537-2025-10-04",
      "headline": "Sunny Sanskari box office Day 2: Varun, Janhvi rom-com faces Kantara Chapter 1 clash Varun Dhawan's 'Sunny Sanskari Ki Tulsi Kumari' earned Rs 9.25 crore on Day 1 and Rs 5.25 crore on Day 2, bringing its total to Rs 14.50 crore. However, the rom-com struggled against Rishab Shetty's 'Kantara: Chapter 1'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actors-vijay-deverakonda-and-rashmika-mandanna-get-engaged-wedding-set-for-february-2026-2797479-2025-10-03",
      "headline": "Vijay Deverakonda, Rashmika Mandanna are engaged, wedding in February: Reports Actors Vijay Deverakonda and Rashmika Mandanna got engaged in a private ceremony attended only by family members, according to reports. Their wedding is reportedly set for February 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ram-gopal-varma-praises-kantara-chapter-1-says-all-filmmakers-should-feel-ashamed-2797432-2025-10-03",
      "headline": "Ram Gopal Varma praises Kantara: Chapter 1, says all filmmakers should feel ashamed Actor-director Rishab Shetty's Kantara Chapter 1, a prequel to the 2022 hit, released in theatres on October 2. Ram Gopal Varma praised the film for its sound design, production quality and \"unimaginable efforts.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/srk-national-award-win-for-jawan-predicted-by-atlee-recalls-sanya-malhotra-2797387-2025-10-03",
      "headline": "SRK's National Award win for Jawan was predicted by Atlee, recalls Sanya Malhotra Actor Sanya Malhotra recently stated that director Atlee predicted Shah Rukh Khan's National Award win during 'Jawan' shoot. The film also featured Deepika Padukone, Nayanthara, Vijay Sethupathi and others in key roles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/diljit-dosanjh-hindi-rebel-song-kantara-chapter-1-rishab-shetty-collaboration-2797390-2025-10-03",
      "headline": "Rishab Shetty wanted Diljit Dosanjh for Kantara but hilariously forgot his name Actor-director Rishab Shetty spoke about his experience of working with Diljit Dosanjh. Their collaboration on the 'Rebel' song marks a significant collaboration on 'Kantara Chapter 1'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/what-did-hrithik-roshan-say-about-war-2-shoot-in-his-latest-cryptic-note-2797374-2025-10-03",
      "headline": "What did Hrithik Roshan say about War 2 shoot in his latest cryptic note? Actor Hrithik Roshan opened up for the first time ever since his action-thriller 'War 2' opened to mixed reviews and had a lukewarm box office response. He expressed gratitude to director Ayan Mukerji in his cryptic post, adding that \"every film doesn't have to be a torture\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/malvika-raaj-pranav-bagga-announce-daughter-name-mahara-dreamy-photos-2797350-2025-10-03",
      "headline": "Malvika Raaj, Pranav Bagga announce their daughter's name with dreamy photos Actor Malvika Raaj and her husband Pranav Bagga revealed their daughter's name on Friday. The couple shared the news and first photos of their daughter on Instagram a day after Dussehra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rhea-chakraborty-emotional-reaction-getting-passport-back-sushant-singh-rajput-case-2797380-2025-10-03",
      "headline": "Satyameva Jayate: Rhea Chakraborty emotional on getting passport, friends react Actor Rhea Chakraborty wrote an emotional social media post after getting her passport back. Bombay High Court had earlier permitted Chakraborty to retain her passport, easing bail restrictions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/sean-diddy-combs-domestic-violence-sentenciong-court-hearing-2797360-2025-10-03",
      "headline": "I lost my way: Rapper Diddy begs for mercy ahead of sentence in sex assault case Rappy Sean Diddy Combs begged for leniency ahead of his sentencing. In his letter, Diddy confessed to losing his way and how he will always carry the burden of domestic violence. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/malti-chahar-deepak-chahar-bigg-boss-19-wildcard-entry-2797321-2025-10-03",
      "headline": "Deepak Chahar's sister Malti to join Bigg Boss 19 as wildcard: Reports Actor Malti Chahar is reportedly set to join 'Bigg Boss 19' as a wildcard contestant. She is the sister of cricketer Deepak Chahar. If she joins the Salman Khan-hosted show, she'd become the second wildcard entry of the season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kajol-hugs-saif-ali-khan-as-he-recounts-stabbing-incident-in-two-much-promo-watch-2797345-2025-10-03",
      "headline": "Kajol hugs Saif Ali Khan as he recounts stabbing incident in Two Much promo. Watch Saif Ali Khan and Akshay Kumar are all set to grace the latest episode of Kajol and Twinkle's chat show 'Two Much'. During the promo, Saif recalled the incident when he was stabbed on the neck. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/was-alia-bhatt-first-offered-sunny-sanskari-director-shashank-khaitan-replies-2797316-2025-10-03",
      "headline": "Was Alia Bhatt first offered Sunny Sanskari? Director Shashank Khaitan replies Director Shashank Khaitan's 'Sunny Sanskari Ki Tulsi Kumari' released on October 1. He firmly denies it was ever part of the 'Dulhania' franchise and clears the air on Alia Bhatt being offered the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/homebound-actor-vishal-jethwa-rising-actor-talking-about-2797269-2025-10-03",
      "headline": "Vishal Jethwa of 'Homebound' is the rising actor we should be talking about With his stupendous acting in 'Homebound', Vishal Jethwa is quietly rewriting the rulebook of Bollywood newcomers. Doubt us? Read to find out how. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-ratings-drop-twentieth-star-plus-shows-dominate-2797267-2025-10-03",
      "headline": "Bigg Boss 19 slips to 20th spot 'Bigg Boss 19' has fallen to twentieth position on the TV ratings chart after previously ranking eleventh last week. This shift highlights changing viewer preferences and the sustained dominance of leading Star Plus shows."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/boney-kapoor-khushi-kapoor-scholarship-new-york-film-academy-2797255-2025-10-03",
      "headline": "Boney Kapoor says Khushi got 100% scholarship from New York Film Academy Film producer Boney Kapoor recently shared that his actor-daughter Khushi Kapoor secured a 100% scholarship to the New York Film Academy. He said Khushi secured the scholarship based on her audition tape."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/why-ott-reminds-doordarshan-eighties-nineties-good-way-2797211-2025-10-03",
      "headline": "Why OTT reminds of Doordarshan of the eighties and nineties (and in a good way) In recent years, streaming platforms have emerged as launchpads for actors young and old who were struggling for a break in films, much like Doordarshan in the eighties and nineties. IndiaToday.in analyses the parallels. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-will-continue-to-support-all-efforts-towards-durable-peace-pm-on-hamass-statement-on-trumps-gaza-plan-2797529-2025-10-04",
      "headline": "PM Modi praises Trump as Hamas agrees to free hostages: Significant step forwardPM Modi said the move marked \"decisive progress\" and reaffirmed India's support for all efforts towards a durable and just peace in the Middle East."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/world-reacts-to-hamas-statement-on-trump-gaza-plan-and-hostage-release-glbs-2797520-2025-10-04",
      "headline": "World reacts to Hamas agreeing to release hostages under Trump's Gaza peace planThe world offered cautious responses on Friday after Hamas declared it was ready to release hostages and accept parts of President Donald Trump's Gaza peace plan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actors-vijay-deverakonda-and-rashmika-mandanna-get-engaged-wedding-set-for-february-2026-2797479-2025-10-03",
      "headline": "Vijay Deverakonda, Rashmika Mandanna are engaged, wedding in February: ReportsActors Vijay Deverakonda and Rashmika Mandanna got engaged in a private ceremony attended only by family members, according to reports. Their wedding is reportedly set for February 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-1st-test-day-3-live-score-commentary-scorecard-jadeja-washington-ahmedabad-2797535-2025-10-04",
      "headline": "Day 3 Live: Jadeja strikes twice as West Indies rocked earlyIndia (IND) vs West Indies (WI) Live score, 1st Test, Day 3: Ravindra Jadeja has struck as well, both of West Indies' openers are not back in the dugout and we could be in for a quick finish to the Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-sells-its-soul-as-trump-grabs-the-land-2797467-2025-10-03",
      "headline": "Pakistan sells its soul as Trump grabs the landAs multinationals stampede for the exits, Pakistan has discovered it can't sell itself as a market anymore. Only its soil is worth buying, and Trump just became the biggest landlord of all."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rajasthan-suspends-drug-controller-cracks-down-on-key-cough-syrup-supplier-2797553-2025-10-04",
      "headline": "Rajasthan suspends drug controller, cracks down on key cough syrup supplierThe Rajasthan government has halted 19 medicines from Kayson Pharma, the key supplier of the cough syrup allegedly linked to children's deaths in the state. Meanwhile, Tamil Nadu has also banned a particular cough syrup following cases in Madhya Pradesh and Rajasthan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/meet-judge-arun-subramanian-who-sentenced-sean-diddy-combs-to-50-months-in-jail-glbs-2797521-2025-10-04",
      "headline": "Meet Arun Subramanian, Indian-American judge who sentenced Diddy to 4 years in jailJudge Arun Subramanian, the first South Asian on Manhattan's federal bench, sentenced Sean \"Diddy\" Combs, earning recognition for his calm authority, immigrant-rooted journey, and balanced, reform-minded approach to justice."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/zubeen-gargs-bandmate-claims-singers-manager-fest-organiser-poisoned-him-2797543-2025-10-04",
      "headline": "Zubeen Garg's bandmate claims singer's manager, fest organiser poisoned himZubeen Garg's bandmate Shekhar Jyoti Goswami said the singer's manager behaved suspiciously prior to his death. Garg died under mysterious circumstances in Singapore on September 19 while swimming."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-marxism-south-america-tour-che-guevara-motorcycle-diaries-socialism-congress-politics-lula-de-silva-2797414-2025-10-04",
      "headline": "Motorcycle and socialism in Rahul Gandhi's South America sojournCongress leader Rahul Gandhi, who of late took a bit of a Left-turn, is on a South America tour spanning Colombia, Brazil, Peru, and Chile. All these countries are led by Left-of-Centre Socialist governments. Barring Brazil, the other three countries featured in Marxist revolutionary Ernesto \"Che\" Guevara's The Motorcycle Diaries. Rahul has also referred to motorcycles during the tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/learn-how-adobe-express-is-making-graphic-design-fun-in-classrooms-2792611-2025-09-24",
      "headline": "Learn How Adobe Express Is Making Graphic Design Fun In ClassroomsThe Adobe Express app is available on any smart device or desktop computer."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/cyclone-shakhti-imd-maharashtra-alert-rainfall-in-mumbai-thane-palghar-raigad-ratnagiri-2797564-2025-10-04",
      "headline": "Maharashtra on heavy rain alert as Cyclone Shakhti set to intensify todayCyclone Shakhti, moving west-northwest over the Arabian Sea, is set to lash Maharashtra with heavy rain, strong winds, and rough seas, prompting authorities to issue alerts and prepare evacuations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/usain-bolt-virat-kohli-relay-team-cricket-exclusive-2797488-2025-10-03",
      "headline": "Virat Kohli and Usain Bolt in relay? Olympic legend reveals his dream teamUsain Bolt said that Virat Kohli would be part of his dream relay team of cricketers. The sprinting legend said that he would have been a cricketer if he wasn't a track and field athlete. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/are-ott-platforms-really-a-safe-place-to-launch-newcomers-and-debutants-2797213-2025-10-04",
      "headline": "Are OTT platforms really a safe place to launch newcomers and debutants?OTT platforms have emerged as a safe and effective launchpad for newcomers, providing global reach, creative freedom, and a chance to build skills without box office pressure. They allow fresh talent to experiment, gain visibility, and connect with audiences in a low-risk environment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/child-deaths-cough-syrup-safety-madhya-pradesh-rajasthan-tests-no-toxic-chemicals-2797364-2025-10-04",
      "headline": "What are DEG and EG, the cough syrup contaminants linked to child deaths in MP?Recent child deaths in Madhya Pradesh and Rajasthan raised concerns over cough syrup safety. Health authorities found no toxic contaminants, but experts warn against irrational syrup use in young children."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/nobel-prize-2025-why-names-of-nominators-are-kept-secret-for-50-years-2797356-2025-10-04",
      "headline": "Why names of Nobel Prize nominators are kept secret for 50 yearsOnce nominations close, expert committees for each category, medicine, physics, chemistry, literature, peace, and economics, review the submissions. These committees prepare reports and engage in detailed discussions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-launches-fresh-strike-on-alleged-drug-trafficking-vessel-near-venezuela-glbs-2797511-2025-10-04",
      "headline": "Video: US strike on suspected drug boat near Venezuela kills 4Four people lost their lives after a United States strike hit a vessel suspected of transporting illegal drugs, US Defense Secretary Pete Hegseth confirmed Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/how-to-go-on-a-relationship-detox-without-hurting-your-partner-2797241-2025-10-04",
      "headline": "How to go on a relationship detox without hurting your partnerTaking a relationship detox can strengthen your bond, but telling your partner this need without hurting their feelings can be tricky."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-530-03-10-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-hamas-war-trump-gaza-peace-plan-palestine-iran-terror-group-us-middle-east-2797538-2025-10-04",
      "headline": "Everybody will be treated fairly: Trump after Hamas responds to his Gaza dealHamas has agreed to release all Israeli hostages and engage in talks under President Trump's Gaza framework, while leaving key issues, including disarmament and Israeli withdrawal, subject to further negotiation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepika-padukone-ranbir-kapoor-share-a-warm-hug-at-airport-watch-2797557-2025-10-04",
      "headline": "Deepika and Ranbir hug at airport, fans speculate Yeh Jawaani Hai Deewani 2: WatchFans have been screaming in excitement ever since they saw Deepika Padukone and Ranbir Kapoor together at the airport. A video of the two greeting each other with a hug has emerged online. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/arshdeep-singh-jet-crash-step-mumbai-man-garba-viral-video-2797561-2025-10-04",
      "headline": "Mumbai men add Arshdeep's jet-crash step to Garba. Video goes viralA video of two men from Mumbai performing the 'jet-crash' step during a Garba dance went viral on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-to-hold-virtual-dialogue-with-bihar-youth-launch-rs-62000-projects-today-2797540-2025-10-04",
      "headline": "PM to hold virtual dialogue with Bihar youth, launch Rs 62,000 projects todayPrime Minister Narendra Modi will be holding a virtual dialogue with the youth of Bihar today. He will also launch several youth-focused projects worth Rs 62,000 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bal-thackeray-will-row-reignites-after-shinde-sena-leader-ramdas-kadam-big-claims-on-fingerprints-2797433-2025-10-03",
      "headline": "Row over Balasaheb's will reignites after Shinde Sena leader's fingerprints claimRamdas Kadam, who belongs to Eknath Shinde's MLA, alleged posthumous use of Bal Thackeray's fingerprints on his will."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/singrauli-boy-calls-police-after-denied-rs-20-kurkure-video-goes-viral-madhya-pradesh-2797421-2025-10-03",
      "headline": "Mother denies Kurkure, 8-year-old boy calls cops in Madhya Pradesh, video goes viralA boy from Singrauli, Madhya Pradesh, dialed 112 after his mother denied him Rs 20 for Kurkure and beat him. The viral video shows police consoling the child and later buying him Kurkure."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/pedro-neto-diogo-jota-death-chelsea-focus-enzo-maresca-premier-league-2797547-2025-10-04",
      "headline": "Pedro Neto opens up on missing Diogo Jota, Chelsea's undeterred focus despite setbacks Pedro Neto, one of Chelsea's quiet catalysts under Enzo Maresca, reflects on belief, pressure, and purpose. In an exclusive chat with India Today, the Portuguese winger opened up on growth, loss, and Chelsea's evolving identity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-1st-test-day-3-live-score-commentary-scorecard-jadeja-washington-ahmedabad-2797535-2025-10-04",
      "headline": "Day 3 Live: Jadeja and Siraj send both openers back early India (IND) vs West Indies (WI) Live score, 1st Test, Day 3: Ravindra Jadeja has struck as well, both of West Indies' openers are not back in the dugout and we could be in for a quick finish to the Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-beat-afghanistan-sharjah-t20i-rashid-khan-four-wickets-2797536-2025-10-04",
      "headline": "AFG vs BAN: Rashid Khan rattles Bangladesh, but Nurul, Rishad seal tense chase Bangladesh managed to pull through after a dramatic middle-order collapse caused by Rashid Khan to take the lead in the three-match series against Afghanistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/renuka-singh-return-india-womens-world-cup-pakistan-match-2797507-2025-10-04",
      "headline": "Renuka Singh to return against Pakistan? Saba Karim opens up on India's key pacer Former wicketkeeper Saba Karim suggested India might bring back Renuka Singh for Sunday's Women's World Cup clash against Pakistan, with young Kranti Gaud potentially making way. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-para-athletics-championships-stray-dog-bites-coaches-jln-stadium-delhi-2797528-2025-10-04",
      "headline": "Stray dogs bite foreign coaches at World Para Athletics Championships in Delhi Two coaches from Kenya and Japan were bitten by stray dogs in separate incidents at the World Para Athletics Championships in Delhi. Both received hospital treatment and are out of danger, as organisers scrambled to reinforce safety measures at the venue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/sri-lanka-mistakes-india-clash-australia-chamari-athapaththu-press-conference-2797510-2025-10-04",
      "headline": "Sri Lanka sorted out mistakes of India clash, ready to face Australia: Chamari Athapaththu Women's World Cup, SLW vs AUSW: Sri Lankan skipper Chamari Athapaththu said that her team has learned from the mistakes in the Indian game and is ready to face Australia in Colombo. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tilak-varma-94-india-a-vs-australia-a-2nd-odi-2797506-2025-10-03",
      "headline": "IND-A vs AUS-A: Tilak Varma's gritty 94 in vain as Australia level series Tilak Varma's gritty knock went in vain as Australia-A levelled the series with a thumping 9-wicket win over India-A on Friday, October 3. Tilak scored 94 runs as the Aussies won the rain-affected game with ease. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shashank-singh-punjab-kings-ipl-power-hitting-match-winner-exclusive-2797493-2025-10-03",
      "headline": "Shashank Singh dreams of India cap after IPL rise: I am close, knocking on the door In an exclusive interview with Sports Today, Shashank Singh said he remains focused on achieving his dream of playing for India and reflected on how the IPL has shaped his career, sharing insights into his journey with Punjab Kings and the lessons he's learned along the way."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/video/usain-bolt-india-visit-cricket-connection-virat-kohli-2797491-2025-10-03",
      "headline": "Usain Bolt's cricket connection: Would have been a cricketer if not for sprinting Usain Bolt said, in an exclusive interaction with India Today, that he would have been a cricketer if he hadn't taken up sprinting. Bolt spoke about his experience being in India and much more during the interaction. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/usain-bolt-virat-kohli-relay-team-cricket-exclusive-2797488-2025-10-03",
      "headline": "Virat Kohli and Usain Bolt in relay? Olympic legend reveals his dream team Usain Bolt said that Virat Kohli would be part of his dream relay team of cricketers. The sprinting legend said that he would have been a cricketer if he wasn't a track and field athlete. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/sri-lanka-mistakes-india-clash-australia-chamari-athapaththu-press-conference-2797510-2025-10-04",
      "headline": "Sri Lanka sorted out mistakes of India clash, ready to face Australia: Chamari Athapaththu Women's World Cup, SLW vs AUSW: Sri Lankan skipper Chamari Athapaththu said that her team has learned from the mistakes in the Indian game and is ready to face Australia in Colombo. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tilak-varma-94-india-a-vs-australia-a-2nd-odi-2797506-2025-10-03",
      "headline": "IND-A vs AUS-A: Tilak Varma's gritty 94 in vain as Australia level series Tilak Varma's gritty knock went in vain as Australia-A levelled the series with a thumping 9-wicket win over India-A on Friday, October 3. Tilak scored 94 runs as the Aussies won the rain-affected game with ease. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shashank-singh-punjab-kings-ipl-power-hitting-match-winner-exclusive-2797493-2025-10-03",
      "headline": "Shashank Singh dreams of India cap after IPL rise: I am close, knocking on the door In an exclusive interview with Sports Today, Shashank Singh said he remains focused on achieving his dream of playing for India and reflected on how the IPL has shaped his career, sharing insights into his journey with Punjab Kings and the lessons he's learned along the way."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/video/usain-bolt-india-visit-cricket-connection-virat-kohli-2797491-2025-10-03",
      "headline": "Usain Bolt's cricket connection: Would have been a cricketer if not for sprinting Usain Bolt said, in an exclusive interaction with India Today, that he would have been a cricketer if he hadn't taken up sprinting. Bolt spoke about his experience being in India and much more during the interaction. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/usain-bolt-virat-kohli-relay-team-cricket-exclusive-2797488-2025-10-03",
      "headline": "Virat Kohli and Usain Bolt in relay? Olympic legend reveals his dream team Usain Bolt said that Virat Kohli would be part of his dream relay team of cricketers. The sprinting legend said that he would have been a cricketer if he wasn't a track and field athlete. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}