{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/lg-electronics-india-receives-sebi-nod-for-ipo-to-raise-rs-15000-crore-2695080-2025-03-18",
      "headline": "LG Electronics India receives Sebi nod for IPO. Check key detailsThe IPO consists solely of an offer for sale (OFS) of up to 10.18 crore equity shares by parent company LG Electronics Inc. The face value of each share is Rs 10."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nmdc-shares-rise-2-percent-after-interim-dividend-announcement-key-details-here-2695072-2025-03-18",
      "headline": "NMDC shares rise 2% after interim dividend announcement. Check detailsNMDC share price: At 11:15 am, NMDC share price was up 2% to Rs 66.26 on the Bombay Stock Exchange (BSE)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-money-gets-sebi-approval-research-analyst-one97-communication-share-price-gains-6-percent-2695061-2025-03-18",
      "headline": "Paytm shares surge 6% as subsidiary gets Sebi's research analyst certificateAt around 10:58 am, Paytm shares were up 5.39% to Rs 725.95 on the Bombay Stock Exchange (BSE)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rally-today-sensex-rises-900-points-will-positive-momentum-continue-2695054-2025-03-18",
      "headline": "Sensex surges 900 points. Is stock market ready for a strong rebound?Stock market rally today: With domestic data improving, investors are wondering if this is the start of a strong rebound. Analysts say the stock market could be in for a short-term bounce, but they aren't convinced that the rally will hold for long."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-price-today-yellow-metal-shines-record-high-will-it-keep-rising-in-near-future-2695046-2025-03-18",
      "headline": "Gold prices at record high: Will it keep rising in near future?Investors are flocking to gold as escalating trade tensions, U.S. tariff measures, and global uncertainties boost demand for the safe-haven asset. With prices soaring to record levels, the key question remains: Will gold continue its upward trajectory in the near future?\r\n\r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rally-key-factors-sensex-nifty-gain-will-positive-run-continue-2695029-2025-03-18",
      "headline": "Sensex jumps over 800 points: Why is the stock market rising today?Stock market rally: By 10:11 am, the Sensex was up 776.26 points at 74,946.21, while the Nifty gained 232.45 points to trade at 22,741.20. Banking, auto, and financial stocks led the rally, pushing benchmark indices higher."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-bell-today-sensex-rises-over-400-points-nifty-above-22600-indusind-bank-bajaj-finserv-gain-2695009-2025-03-18",
      "headline": "Sensex, Nifty open higher as banking stocks rally; ICICI, Zomato lead gainsThe S&P BSE Sensex initially rose above 400 points and was trading 326.28 points higher at 74,496.23 at around 9:22 am. The NSE Nifty 50 also gained 107.50 points to trade above 22,600. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-finserv-to-buy-out-allianzs-stake-in-insurance-joint-ventures-after-24-years-2695006-2025-03-18",
      "headline": "Bajaj to buy out Allianz's stake in insurance joint ventures after 24 yearsThe two firms have had a joint venture in the insurance sector for 24 years, and the partnership will officially come to an end once the first tranche of at least 6.1% is acquired and Allianz is reclassified from a promoter to an investor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-on-march-17-what-to-expect-from-stock-market-today-ireda-indusind-bank-bajaj-finserv-2695002-2025-03-18",
      "headline": "Stock market opening on March 17: Will Sensex, Nifty continue positive run?Stock market opening prediction on March 17: Sensex and Nifty are expected to open today's session on a positive note. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-bajaj-finserv-tata-motors-swiggy-indusind-bank-ireda-2694994-2025-03-18",
      "headline": "Stocks to watch today: Bajaj Finserv, Tata Motors, Swiggy, IndusInd Bank, IREDAStocks to watch on March 18: Bajaj Finserv, Swiggy, IndusInd Bank, IREDA, and IRCON International are among the stocks likely to remain in focus today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/looking-for-tax-saving-options-check-out-these-5-post-office-savings-schemes-ppf-nsc-ssy-2694760-2025-03-18",
      "headline": "Looking for tax-saving options? Check out these 5 post office savings schemesAmong various tax-saving methods, post office savings schemes are considered one of the safest investment options since they are backed by the government. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-holds-steadier-following-weeks-of-scary-swings-glbs-2694935-2025-03-17",
      "headline": "Wall Street holds steadier following weeks of scary swingsThe S&P 500 was 0.1% higher after falling for four consecutive weeks amid Donald Trump's tariff threats to overseas markets."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/2025-iheartradio-music-awards-taylor-swift-shines-in-voted-categories-lady-gaga-honoured-2695056-2025-03-18",
      "headline": "iHeart Radio Music Awards 2025: Taylor Swift dominates, Lady Gaga earns honourThe 2025 iHeartRadio Music Awards celebrated top artistes, with Taylor Swift dominating the voted categories. Lady Gaga received a special honour, adding to the night's excitement.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/hania-aamir-farhan-saeed-mere-humsafar-back-on-tv-2695015-2025-03-18",
      "headline": "Hania Aamir, Farhan Saeed's Mere Humsafar back on TV: When, where to watchThe popular Pakistani romance drama Mere Humsafar, starring Hania Aamir and Farhan Saeed, is making a comeback. Find out when and where you can watch this beloved series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/alka-yagnik-reacts-to-osama-bin-laden-being-her-fan-2695010-2025-03-18",
      "headline": "Alka Yagnik reacts to Osama bin Laden being her fan: Is it my fault?Alka Yagnik's old interview reacting to Osama bin Laden being her fan has resurfaced. She also spoke about industry politics, revealing how she lost songs to senior singers. Her remarks are now viral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/charanjit-singh-channi-celebrates-sidhu-moosewala-brother-shubhdeep-first-birthday-in-punjab-2694987-2025-03-18",
      "headline": "Former Punjab Chief Minister attends Sidhu Moosewala's brother's 1st birthday bashFormer Punjab Chief Minister Charanjit Singh Channi visited Sidhu Moosewala's home to celebrate the first birthday of the late singer's brother, Shubhdeep. The event, held at Musa village, saw Channi participating in the cake-cutting ceremony.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/malaika-arora-scolds-contestant-inappropriate-dance-mother-number-hip-hop-india-season-2-2694829-2025-03-17",
      "headline": "Malaika Arora scolds contestant for inappropriate danceActor Malaika Arora recently scolded a 16-year-old contestant for his inappropriate dance moves. Malaika asked for the contestant's mother's number. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/hina-khan-emotional-boyfriend-rocky-jaiswal-calls-her-brave-soul-amid-cancer-battle-2694800-2025-03-17",
      "headline": "Hina Khan emotional as boyfriend Rocky calls her a 'brave soul' amid cancer battleActor Hina Khan's boyfriend Rocky Jaiswal recently appeared on Celebrity MasterChef. Rocky spoke about Hina;s cancer battle and called her a 'braveheart.' "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/salman-khan-nephew-ayaan-agnihotri-agni-fighting-nepotism-tag-2694701-2025-03-17",
      "headline": "Salman Khan's nephew Ayaan on stage name Agni and fighting the nepotism tagBollywood superstar Salman Khan's nephew, Ayaan Agnihotri, recently made his music debut. In an exclusive conversation with India Today Digital, the actor opened up about his stage name and battling the nepotism tag. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/exclusive-tayme-thapthimthong-on-the-white-lotus-s3-lisa-of-blackpink-asian-representation-2694643-2025-03-17",
      "headline": "Exclusive: Tayme on The White Lotus S3, Lisa of Blackpink, Asian representationTayme Thapthimthong's journey from a real-life security guard to a celebrated actor in The White Lotus Season 3 is truly remarkable. Paired with Blackpink's Lisa, Tayme, in an exclusive chat with India Today speaks about his journey, Asian representation and more. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/kim-kardashian-vs-kanye-west-rapper-fights-with-ex-wife-over-daughter-north-name-2694645-2025-03-17",
      "headline": "Kim Kardashian vs Kanye West: Rapper fights with ex-wife over daughter's nameKanye West released a song featuring daughter North, despite Kim Kardashian's objections. She took legal action, but Kanye leaked their private chat and refused to back down, escalating their feud."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/after-cid-crime-patrol-begins-to-stream-on-netflix-fans-react-2694589-2025-03-17",
      "headline": "After CID, Crime Patrol begins to stream on Netflix, fans reactCrime Patrol, the iconic true-crime series on Sony TV, is now available to stream on Netflix. Fans reacted to the announcement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-kim-soo-hyun-and-kim-sae-ron-controversy-why-its-not-okay-to-be-okay-2694514-2025-03-17",
      "headline": "Kim Soo-hyun and Kim Sae-ron controversy: Exposing Korean industry's double standardsThe controversy involving South Korean actors Kim Soo-hyun and the late Kim Sae-ron has opened a Pandora's box of issues within the entertainment industry, from age-gap relationships to the treatment of disgraced celebrities. As the public grapples with these revelations, the debate continues to rage on about ethics, consent, and gender double standards. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kim-soo-hyun-agency-gold-medalist-theatens-indian-blogger-for-unauthorised-content-2694525-2025-03-17",
      "headline": "Kim Soo-hyun's agency acts against Indian blogger for unauthorised contentIn a dramatic turn of events, actor Kim Soo-hyun's agency has initiated legal proceedings against an Indian influencer. The influencer shared emails from the agency, revealing that he was threatened for posting 'unauthorised' content.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/hina-khan-performs-umrah-amid-cancer-battle-see-photos-videos-2694558-2025-03-17",
      "headline": "Hina Khan performs Umrah amid cancer battle, says she's 'overwhelmed, speechless'Actor Hina Khan performed Umrah amid her cancer battle. She shared emotional moments from Mecca on Instagram. Accompanied by her brother, the actor expressed gratitude and prayed for strength while documenting her journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kim-soo-hyun-scenes-cut-from-good-day-following-kim-sae-ron-controversy-2694544-2025-03-17",
      "headline": "Kim Soo-hyun's scenes cut from 'Good Day' following Kim Sae-ron controversyK-drama actor Kim Soo-hyun's scenes from MBC's variety program 'Good Day' were edited after Kim Sae-ron controversy. The production house shared a statement and confirmed the same. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/erica-fernandes-opens-up-past-physical-abuse-reveals-impact-of-do-patti-movie-2694425-2025-03-17",
      "headline": "TV actor Erica Fernandes says Do Patti triggered memories of abusive relationshipActor Erica Fernandes shared her experience of physical abuse in a past relationship, highlighting how films like Do Patti resurfaced painful memories. Despite the challenges, she opened up about her journey towards healing and the societal pressures that kept her silent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/sidhu-moose-wala-little-brother-holi-pic-2694313-2025-03-16",
      "headline": "Sidhu Moose Wala's little brother's Holi pic goes viral. Seen yet?A viral photo of Sidhu Moose Wala's little brother, Shubhdeep, dressed in traditional attire with Holi colours on his cheeks, has captured the hearts of fans on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/all-of-us-are-dead-actor-lomon-on-india-i-think-of-taj-mahal-and-bengal-tigers-2694255-2025-03-16",
      "headline": "All Of Us Are Dead actor Lomon on India: I think of Taj Mahal and Bengal TigersSouth Korean actor Lomon, known for his role in All of Us Are Dead, discussed his latest project Family Matters and shared insights on his career and inspirations in an exclusive interview with India Today Digital."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/hina-khan-discoloured-nails-not-nailpaint-sideeffect-of-chemotherapy-2694210-2025-03-16",
      "headline": "Hina Khan shares pic of discoloured nails: Most common side effect of chemotherapyTelevision actor Hina Khan opened up about the side effects of chemotherapy on her nails, sharing a glimpse of the discolouration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/saira-banu-says-she-shouldnt-be-called-ar-rahmans-ex-wife-were-not-divorced-only-separated-2694208-2025-03-16",
      "headline": "Saira Banu says she shouldn't be called AR Rahman's ex-wife: We're not divorcedSaira Banu, wife of AR Rahman, clarifies that they are separated but not divorced, addressing recent rumours. She cites her health issues as a reason and wishes Rahman well."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/sunita-williams-butch-wilmore-depart-space-station-begin-homecoming-voyage-2695047-2025-03-18#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Astronauts Sunita Williams, Butch Wilmore say goodbye to space Live UpdatesAstronauts donned the suit, earlier this morning, to begin their journey as they entered the spacecraft and Crew-10 astronauts bid them goodbye before closing the hatch. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nagpur-violence-how-it-started-aurangzeb-tomb-row-holy-book-desecration-2694989-2025-03-18#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Aurangzeb row: How rumours of holy book desecration fuelled Nagpur violenceNagpur violence: Several vehicles were torched in large-scale arson and vandalism as two communities clashed in Nagpur. The administration has banned large gatherings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-launches-extensive-airstrikes-on-gaza-palestine-claims-over-100-killed-2694980-2025-03-18#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Israel launches extensive airstrikes on Gaza, Palestine claims over 235 killedAt least 235 people were killed as Israeli airstrikes hit Gaza, breaking a fragile ceasefire since January. The attacks targeted Gaza City, Deir al-Balah, Khan Younis, and Rafah in the most intense bombardment since the truce began."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/balochistan-dozens-attacks-pakistan-army-loses-grip-asim-munir-imran-khan-what-happened-2695058-2025-03-18#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Pakistan army's gym rat problemFacing dozens of attacks in restive areas and protests online and offline, Pakistan's once-powerful military seems to have lost the plot and its grip. The Pakistani army's problems are typical of gym rats. This is why the Pakistani military is stuck in a political quicksand as its morale is low."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/programme/news-today/video/are-donald-trump-pm-modi-on-the-same-page-big-debate-on-rajdeep-sardesais-show-2694899-2025-03-17#?utm_source=Videos_hp&utm_medium=Videos&utm_campaign=home_Videos",
      "headline": "Are Donald Trump, PM Modi on the same page? Big debate on Rajdeep Sardesai's showThe Modi-Trump equation is the top focus of this episode of News Today. Prime Minister Modi has been reaching out to US President Trump, praising him in interviews and joining his social media platform."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/white-house-trump-deportation-video-meme-closing-time-semisonic-immigrants-2695062-2025-03-18#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "You can't stay here: White House's deportation video with hit song sparks rowThe video, a bid by the White House to troll its critics over its crackdown on illegal immigration, shows border agents loading shackled deportees on a plane."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/no-tuition-at-harvard-families-under-200k-can-now-attend-free-2695017-2025-03-18#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Harvard offers free tuition for families earning up to $200K. All you need to knowHarvard is breaking financial barriers! Starting in 2025, students from families earning up to $200,000 annually will attend tuition-free, making world-class education more accessible than ever. Is this the future of higher education? Here's everything you need to know.\r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rally-today-sensex-rises-900-points-will-positive-momentum-continue-2695054-2025-03-18#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sensex surges 900 points. Is stock market ready for a strong rebound?Stock market rally today: With domestic data improving, investors are wondering if this is the start of a strong rebound. Analysts say the stock market could be in for a short-term bounce, but they aren't convinced that the rally will hold for long."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/reality-of-trio-friendships-can-they-last-forever-2694986-2025-03-18#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "The reality of trio friendships: Can they last forever?It can get difficult to maintain a trio friendship. But is it impossible to do so? Certainly not."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/clashes-in-nagpur-after-muslim-groups-allege-holy-book-burnt-at-aurangzeb-tomb-protest-2694889-2025-03-17#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Nagpur violence planned: BJP after 30 injured in clashes amid Aurangzeb rowBJP claimed that the violence that erupted in Nagpur over Aurangzeb row was \"pre-planned\" and alleged that houses belonging to Hindus were targetted as 30 people were injured in clashes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/ebola-may-be-cured-with-a-pill-an-experiment-on-monkeys-suggests-2695079-2025-03-18#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ebola could be cured with a pill, an experiment on monkeys showsAccording to a new study, an experiment on monkeys has shown that Ebola can be cured with just a pill."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/white-house-shares-trumps-photo-after-lebanese-doctor-rasha-alawieh-deported-2694974-2025-03-18#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bye-bye, Rasha: White House shares Trump's photo after Lebanese doctor deportedThe White House sparked controversy on Monday by resharing a Department of Homeland Security post on Lebanese doctor Rasha Alawieh's deportation, adding \"bye-bye Rasha\" and a photo of Trump waving."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/looking-for-an-affordable-suv-here-are-5-options-under-rs-10-lakh-2695041-2025-03-18#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Looking for an affordable SUV? Here are 5 options under Rs 10 lakhThe Tata Punch, Hyundai Exter, Maruti Suzuki Fronx, Skoda Kylaq, and Kia Syros are available for under Rs 10 lakh (ex-showroom)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-player-replacement-rules-new-explained-2695038-2025-03-18#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "IPL 2025: How does revamped player replacement rule work ahead of new season?With 4 replacements happening before the start of the new season, we have a look at the revamped rules for IPL 2025 in which a team can replace an unavailable member of their roster with a new player. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/chinese-army-top-officials-arrested-xi-jinping-military-purge-2695008-2025-03-18#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "China's military purge deepens, top generals arrested amid power struggleChina's top military ranks are in turmoil, with Vice Chairman He Weidong and key generals arrested, raising questions over loyalty, corruption, and the stability of Xi Jinping's control."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/us-journalist-larry-taunton-swatting-incident-alabama-videos-viral-x-post-2695045-2025-03-18#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US journalist shares videos of swatting incident at Alabama home, recounts ordealA US journalist based in Alabama said he was swatted at his home at midnight. He recounted his ordeal and shared videos of the incident on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/google-techie-lists-7-key-topics-for-screening-round-interview-viral-x-post-2695067-2025-03-18#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Google techie lists 7 key topics for screening round, shares interview adviceIn a now-viral post on X, a Hyderabad-based techie revealed seven key topics for the screening round at Google. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/what-are-the-signals-from-abhishek-banerjees-comeback-meet-2694639-2025-03-17#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "What are the signals from Abhishek Banerjee's 'comeback' meetThe virtual gathering helmed by the TMC leader focused on revamping the party organisation and a head start on checking alleged electoral manipulation by its main rival.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/mlas-states-assemblies-criminal-cases-bjp-congress-aap-trinamool-andhra-pradesh-2695032-2025-03-18#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "45% of MLAs face criminal cases, Andhra has highest proportion: ReportAndhra Pradesh has the highest percentage of sitting MLAs with criminal cases at 79% (138 of 174), followed by Kerala and Telangana."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/israel-consulted-us-before-bombing-gaza-confirms-white-house-2694993-2025-03-18#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Israel consulted US before bombing Gaza, confirms White HouseIsrael consulted President Donald Trump's administration before its deadly Gaza strikes, White House press secretary Karoline Leavitt told Fox News."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/alka-yagnik-reacts-to-osama-bin-laden-being-her-fan-2695010-2025-03-18#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Alka Yagnik reacts to Osama bin Laden being her fan: Is it my fault?Alka Yagnik's old interview reacting to Osama bin Laden being her fan has resurfaced. She also spoke about industry politics, revealing how she lost songs to senior singers. Her remarks are now viral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sourav-ganguly-on-rohit-sharma-in-test-cricket-2695004-2025-03-18#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India are not good in Tests, Rohit Sharma should take responsibility: Sourav GangulyFormer India cricketer Sourav Ganguly has said that captain Rohit Sharma should take responsibility of turning things around in Test cricket. India haven't had a good run in Test cricket in recent times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-trader-robbed-of-rs-80-lakh-at-gunpoint-in-broad-daylight-video-surfaces-2695073-2025-03-18#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Video: Trader robbed of Rs 80 lakh at gunpoint in broad daylight in DelhiA trader in Delhi's Lahori Gate area was robbed of nearly Rs 80 lakh at gunpoint in broad daylight. The accused fired shots before snatching the cash-filled bag in Chandni Chowk, and fleeing. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-ends-secret-service-protection-for-joe-bidens-children-day-after-cancelling-pardons-2695016-2025-03-18#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "After cancelling pardons, Trump ends Secret Service protection for Biden's childrenUS President Donald Trump said he was revoking Secret Service protection for former President Joe Biden's adult children, which the Democrat had extended to July shortly before leaving office. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ar-rahman-conversion-to-islam-family-pressure-rajiv-menon-breaks-silence-2695087-2025-03-18",
      "headline": "AR Rahman converted to Islam, faced family pressure: DOP Rajiv MenonCinematographer Rajiv Menon stated that he was the translator between AR Rahman's family and the fakirs when they converted to Islam. He also revealed that the composer faced intense family pressure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vikram-bhatt-says-ibrahim-ali-khan-khushi-kapoor-were-good-in-nadaaniyan-better-than-saif-ali-khan-debut-2695086-2025-03-18",
      "headline": "Vikram Bhatt says Ibrahim-Khushi were good in Nadaaniyan: Better than Saif's debutFilmmaker Vikram Bhatt thinks that both Ibrahim Ali Khan and Khushi Kapoor are being subjected to unfair criticism. He said he found their performances 'good' in 'Nadaaniyan', and that Ibrahim performed better than how his father performed in his debut film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-hugs-consoles-emotional-ira-viral-video-fans-demand-privacy-2695085-2025-03-18",
      "headline": "Aamir Khan hugs and consoles emotional Ira in viral video, fans demand privacyAamir Khan's video of hugging and consoling his visibly emotional daughter Ira Khan has gone viral. Following the viral moment, fans demanded the paparazzi to give them privacy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/2025-iheartradio-music-awards-taylor-swift-shines-in-voted-categories-lady-gaga-honoured-2695056-2025-03-18",
      "headline": "iHeartRadio Music Awards 2025: Taylor Swift dominates, Lady Gaga earns honourThe 2025 iHeartRadio Music Awards celebrated top artistes, with Taylor Swift dominating the voted categories. Lady Gaga received a special honour, adding to the night's excitement.\r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tim-seifert-finn-allen-new-zealand-beat-pakistan-in-2nd-t20i-dunedin-2695068-2025-03-18",
      "headline": "Seifert, bowlers help NZ go 2-0 up vs Pakistan with 5-wicket win in 2nd T20INew Zealand beat Pakistan by five wickets in the second T20I of the five-match series at University Oval, Dunedin. The Kiwis comfortably chased down the target of 136 riding on splendid knocks from Tim Siefert and Finn Allen."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-vs-pakistan-2nd-t20i-shaheen-shah-afridi-trolled-tim-seifert-2695071-2025-03-18",
      "headline": "Shaheen trolled as Seifert hits him for 4 sixes in an over: Overrated fraudShaheen Shah Afridi was massively trolled on social media as the Pakistan pacer was destroyed by Tim Seifert during the 2nd T20I. Seifert hit Shaheen for 4 sixes in an over as the pacer went wicketless on Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-player-replacement-rules-new-explained-2695038-2025-03-18",
      "headline": "IPL 2025: How does revamped player replacement rule work ahead of new season?With 4 replacements happening before the start of the new season, we have a look at the revamped rules for IPL 2025 in which a team can replace an unavailable member of their roster with a new player. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-mayank-yadav-starts-bowling-at-bcci-centre-of-excellence-2695026-2025-03-18",
      "headline": "Watch: Mayank Yadav starts bowling at BCCI Centre of Excellence ahead of IPL 2025Lucknow Super Giants fast bowler Mayank Yadav has started bowling at the BCCI Centre of Excellence ahead of Indian Premier League 2025 (IPL 2025). Mayank has been undergoing rehabilitation since November 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sourav-ganguly-on-rohit-sharma-in-test-cricket-2695004-2025-03-18",
      "headline": "India are not good in Tests, Rohit Sharma should take responsibility: Sourav GangulyFormer India cricketer Sourav Ganguly has said that captain Rohit Sharma should take responsibility of turning things around in Test cricket. India haven't had a good run in Test cricket in recent times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ajinkya-rahane-on-kkr-captaincy-ready-for-challenge-2694988-2025-03-18",
      "headline": "Honoured to captain KKR, ready for the challenge that lies ahead: Ajinkya RahaneKolkata Knight Riders' (KKR) new captain Ajinkya Rahane said that it's an honour for him to lead the team in Indian Premier League 2025 (IPL 2025) and mentioned that he's ready for the challenge to defend the title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/what-if-virat-kohli-was-signed-by-delhi-capitals-in-2008-2694969-2025-03-18",
      "headline": "IPL Multiverse: What if Virat Kohli was signed by Delhi Capitals in 2008Delhi Capitals in 2008 passed on the chance to sign hometown hero Virat Kohli and the star batter went on to be snapped up by Royal Challengers Bengaluru. The IPL Multiverse takes a look at what would have happened if Delhi signed Kohli instead of Bengaluru.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/iona-cuts-ties-with-tobin-anderson-after-two-seasons-at-the-helm-glbs-2694933-2025-03-17",
      "headline": "Iona Cuts Ties with Tobin Anderson After Two Seasons at the HelmAnderson's brief tenure ends amid struggles to sustain the program's momentum following Rick Pitino's departure. \r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/ncaa-tournament-massive-tv-rating-and-attendance-for-womens-basketball-glbs-2694929-2025-03-17",
      "headline": "NCAA Tournament: Massive TV rating and attendance for Women's basketballThere was concern that attendance and overall interest in women's college basketball would drop this year with the departure of Caitlin Clark, Angel Reese and other stars for the WNBA. However, there is a strong rating and attendance seen for women's basketball. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/f1-teams-set-for-stricter-tests-to-avoid-flexi-wing-loophole-glbs-2694924-2025-03-17",
      "headline": "F1 teams set for stricter tests to avoid flexi-wing loopholeFormula 1's governing body, the FIA will implement tougher wing tests from the Chinese GP to prevent teams from exploiting flexible rear wings to gain an advantage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/what-if-virat-kohli-was-signed-by-delhi-capitals-in-2008-2694969-2025-03-18",
      "headline": "IPL Multiverse: What if Virat Kohli was signed by Delhi Capitals in 2008Delhi Capitals in 2008 passed on the chance to sign hometown hero Virat Kohli and the star batter went on to be snapped up by Royal Challengers Bengaluru. The IPL Multiverse takes a look at what would have happened if Delhi signed Kohli instead of Bengaluru.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/iona-cuts-ties-with-tobin-anderson-after-two-seasons-at-the-helm-glbs-2694933-2025-03-17",
      "headline": "Iona Cuts Ties with Tobin Anderson After Two Seasons at the HelmAnderson's brief tenure ends amid struggles to sustain the program's momentum following Rick Pitino's departure. \r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/ncaa-tournament-massive-tv-rating-and-attendance-for-womens-basketball-glbs-2694929-2025-03-17",
      "headline": "NCAA Tournament: Massive TV rating and attendance for Women's basketballThere was concern that attendance and overall interest in women's college basketball would drop this year with the departure of Caitlin Clark, Angel Reese and other stars for the WNBA. However, there is a strong rating and attendance seen for women's basketball. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/f1-teams-set-for-stricter-tests-to-avoid-flexi-wing-loophole-glbs-2694924-2025-03-17",
      "headline": "F1 teams set for stricter tests to avoid flexi-wing loopholeFormula 1's governing body, the FIA will implement tougher wing tests from the Chinese GP to prevent teams from exploiting flexible rear wings to gain an advantage."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}