{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/sip-vs-rd-recurring-deposit-where-should-your-monthly-savings-go-sip-or-rd-which-is-better-2797919-2025-10-05",
      "headline": "SIP vs RD: Where should your monthly savings go?Would you rather sleep peacefully or grow wealthy quietly? That's essentially what the SIP vs RD debate boils down to. Both allow disciplined monthly investing, but one protects capital while the other builds it. So which one deserves your money?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/government-probes-dark-pattern-after-man-exposes-extra-fees-on-cash-on-delivery-2797655-2025-10-04",
      "headline": "Man flags extra charge on cash-on-delivery payments, Centre launches probeThe Department of Consumer Affairs has launched an investigation into e-commerce sites charging additional fees on cash-on-delivery payments. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/agent-body-protest-gst-reform-zero-insurance-distribution-input-tax-credit-prashant-mhatre-2797322-2025-10-03",
      "headline": "Agents' body questions GST cut, says move undermines insurance distributionPrashant Mhatre, All India President of the General Insurance Agents Federation Integrated (GIAFI), has sounded an alarm, saying the decision risks weakening the role of agents, brokers, and advisors who are central to India's insurance reach."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/planning-a-personal-loan-do-not-make-these-5-errors-2795807-2025-10-03",
      "headline": "Planning a personal loan? Don't make these 5 errorsWhile personal loans can be a handy financial tool, they come with risks if mismanaged. Avoid these five common errors to keep your finances safe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/chennai-firm-wintrack-customs-official-bribery-corruption-charge-import-export-sector-cripple-2797228-2025-10-03",
      "headline": "Wintrack vs Chennai Customs is a sorry tale of grease of doing business in IndiaChennai-based logistics company Wintrack has ceased Indian operations, alleging repeated bribery demands and harassment by Chennai Customs, exposing the ugly truth that at Indian Customs integrity is the real contraband.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/delhi-government-may-revise-circle-rates-public-feedback-invited-2797279-2025-10-03",
      "headline": "Delhi government may revise circle rates, public feedback invitedThe Delhi government is considering a revision of circle rates across the city and has called on the public to share their views before any changes are finalised."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/health-insurance-trap-to-watch-2025-room-rent-caps-deductibles-co-pays-save-money-2797278-2025-10-03",
      "headline": "Health insurance in 2025: Key traps that could drain your pocketClauses such as room rent caps, deductibles, and co-pay options are often buried deep in policy documents but can have a massive influence on the claim process."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-end-higher-metal-stocks-gain-tata-steel-2797261-2025-10-03",
      "headline": "Sensex, Nifty recover losses to end higher fuelled by gains in metal stocksThe S&P BSE Sensex added 223.86 points to close at 81,207.17, while the NSE Nifty50 gained 57.95 points to end at 24,894.25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/63-of-households-aware-yet-only-95-invest-in-markets-sebi-survey-shows-2797218-2025-10-03",
      "headline": "63% of households aware, yet only 9.5% invest in markets, Sebi survey showsDespite growing awareness about investing in the markets, the latest Sebi survey shows that only a small fraction of households, i.e., just 9.5%, are actively investing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/looking-for-high-returns-this-small-savings-scheme-beats-ppf-and-nsc-2797178-2025-10-03",
      "headline": "Looking for high returns? This small savings scheme beats PPF and NSCMany investors assume PPF or NSC offer the best returns, but the scheme leads the pack with the highest interest among small savings schemes. Have a look."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/chennai-customs-wintrack-bribe-ask-legal-case-law-help-corruption-business-protection-expert-view-2797188-2025-10-03",
      "headline": "Wintrack vs Chennai Customs: If forced to bribe, can companies fight legally?The Finance Ministry has already ordered an official probe, but the matter has also raised a wider debate: if businesses are forced to pay bribes to get their consignments cleared, do they have the law on their side?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/will-zerodha-end-its-zero-brokerage-model-for-equity-delivery-trades-nithin-kamath-2797133-2025-10-03",
      "headline": "Will Zerodha end its zero-brokerage model for equity delivery trades?Zerodha, long known for offering free equity delivery trades, could soon charge for delivery trades for the first time, signalling a major shift for investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nirmala-sitharaman-opens-kautilya-economic-conclave-seeks-stronger-role-for-india-2797042-2025-10-03",
      "headline": "India can't be passive spectator: Nirmala Sitharaman talks tough amid US tariffsUnion Finance Minister Nirmala Sitharaman opened the Kautilya Economic Conclave 2025 in New Delhi, urging India to play a more active role in shaping global decisions amid growing economic and geopolitical uncertainty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wintrack-support-fallout-chennai-customs-bribery-allegations-corruption-claim-users-x-2797039-2025-10-03",
      "headline": "My Customs story floods X after Wintrack's explosive chargeAfter the Finance Ministry confirmed an official probe into Wintrack's charges, importers, customs brokers, and business owners across the country have started sharing their own accounts of harassment, bribery demands. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-205-points-lower-nifty-below-24800-tata-steel-up-3-2796990-2025-10-03",
      "headline": "Sensex opens 205 points lower, Nifty below 24,800; Tata Steel up 3%The S&P BSE Sensex was down by 208.31 points to 80,775.00, while the NSE Nifty50 lost 75 points to 24,760.80 as of 9:30 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/wework-india-ipo-open-should-you-subscribe-good-bad-review-check-gmp-listing-gains-2796988-2025-10-03",
      "headline": "WeWork India IPO opens for bidding: Should you subscribe? Check GMPFounded in 2016, WeWork India is a flexible workspace operator offering a wide range of solutions including co-working spaces, managed offices, enterprise office suites, private offices, and hybrid digital solutions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/openai-valuation-usd-500-billion-share-sale-softbank-sam-altman-2796731-2025-10-02",
      "headline": "OpenAI hits $500 billion mark as SoftBank, others buy shares: ReportThe latest valuation marks a sharp rise from the company's previous valuation of $300 billion and highlights how quickly OpenAI's value has grown as demand for artificial intelligence tools continues to rise. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/wintrack-vs-chennai-customs-import-firm-tamil-nadu-shuts-operations-bribery-corruption-allegations-controversy-2796711-2025-10-02",
      "headline": "Bribes and social media war: Import firm vs Chennai Customs over 'corruption'The controversy began on the social media platform X where Wintrack Inc, a Chennai-based import company, accused Chennai Customs of systemic corruption, saying that constant demands for bribes had forced it to shut down its operations."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/google-layoff-100-job-cuts-design-related-ai-shift-seo-sunder-pichai-artificial-intelligence-2796598-2025-10-02",
      "headline": "Google layoffs: Over 100 design jobs cut in AI shiftGoogle has also been cutting back on management layers. According to reports, the company has reduced the number of middle managers by more than a third, particularly those overseeing small teams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/gandhi-jayanti-2025-stock-market-holiday-nse-bse-open-or-close-dussehra-october-2-sensex-nifty-2796520-2025-10-02",
      "headline": "Market holiday: Are NSE, BSE open on Gandhi Jayanti, Dussehra on October 2?Sensex and Nifty gained nearly 1% in the last session after the Reserve Bank of India (RBI) kept the repo rate unchanged at 5.5% and maintained its neutral stance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/microsoft-ceo-satya-nadella-shifts-focus-to-ai-elevates-judson-althoff-to-lead-commercial-unit-2796469-2025-10-01",
      "headline": "Satya Nadella bets big on AI, names Judson Althoff to lead Microsoft commercial unitMicrosoft has elevated Chief Commercial Officer Judson Althoff as CEO of its commercial business, allowing Satya Nadella to focus on AI, datacenter buildout, and product innovation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-the-price-of-gold-keeps-breaking-records-business-news-2796426-2025-10-01",
      "headline": "Why the price of gold keeps breaking recordsBullion has soared more than 45% this year, putting it on track for the biggest annual gain since 1979.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adar-poonawalla-in-talks-to-buy-royal-challengers-bangalore-rcb-stake-united-spirits-shares-update-2796326-2025-10-01",
      "headline": "Adar Poonawalla in talks to buy RCB stake? United Spirits shares updateThe CEO of Serum Institute, Adar Poonawalla, is in talks with Diageo to purchase a stake in RCB, one of the Indian Premier League's top teams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/are-festive-cheer-and-auto-stocks-driving-the-market-rally-heres-what-expert-says-2796279-2025-10-01",
      "headline": "Are festive cheer and auto stocks driving the market rally?The stock market showed renewed strength, as festive season cheer and gains in auto stocks lifted investor sentiment across sectors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/da-hike-58-percent-government-employee-salary-rise-how-to-calculate-diwali-gift-arrears-2796256-2025-10-01",
      "headline": "DA hiked to 58%: What it means for government employees' salary and pensionThe Union Cabinet approved the proposal to increase the DA for central government employees and Dearness Relief (DR) for pensioners by 3%. With this revision, the DA rate now stands at 58%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-716-points-higher-nifty-above-24800-tata-motors-up-5-percent-2796231-2025-10-01",
      "headline": "Sensex ends 716 points higher, Nifty above 24,800; Tata Motors up 5%The S&P BSE Sensex jumped 715.64 points to end at 80,983.31, while the NSE Nifty50 added 225.20 points to close at 24,836.30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/this-indian-gold-lender-holds-3-times-the-gold-of-pakistan-muthoot-finance-2796225-2025-10-01",
      "headline": "This Indian gold lender holds 3 times the gold of PakistanThe country's largest gold loan provider, currently holds 209 tonnes of gold in its safe deposit boxes. This is three times the gold reserves of Pakistan and higher than the reserves of Brazil, Australia, and South Africa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mukesh-ambani-tops-hurun-rich-list-2025-shah-rukh-khan-joins-billionaire-club-2796169-2025-10-01",
      "headline": "Shah Rukh Khan joins billionaire club, Mukesh Ambani tops Hurun India Rich ListMukesh Ambani has reclaimed the top spot on the Hurun India Rich List 2025, while Bollywood superstar Shah Rukh Khan joins the billionaire club for the first time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-rally-why-reason-sensex-600-points-nifty-jump-rbi-mpc-auto-shares-tata-motors-2796146-2025-10-01",
      "headline": "Sensex jumps 500 points: 3 reasons why markets are rising todayThe S&P BSE Sensex surged 660.64 points to 80,928.26, while the NSE Nifty50 rose 185.70 points to 24,796.80 as of 12:10 PM. The rally was broad-based on Dalal Street. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-set-to-approve-da-hike-for-employees-and-pensioners-today-sources-2796115-2025-10-01",
      "headline": "Union Cabinet approves 3% DA hike for central government employeesEarlier this year, the government had approved a 2% increase in DA in March, raising it from 53% to 55% of the basic salary and pension."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-announces-big-push-for-business-reforms-and-easier-lending-details-here-2796075-2025-10-01",
      "headline": "RBI announces big push for business reforms and easier lending. Details hereThe Reserve Bank of India has unveiled a set of measures aimed at making it easier for businesses to operate and improving access to loans. The reforms are expected to help companies, exporters, and banks alike."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-holds-repo-rate-at-55-percent-how-it-impacts-your-emis-2796058-2025-10-01",
      "headline": "RBI holds repo rate at 5.5%: How it impacts your EMIsBy keeping the repo rate unchanged at 5.5%, the RBI has signalled stability for borrowers. Home loan EMIs are likely to stay where they are, offering some relief to existing and new buyers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-holds-lending-rate-steady-at-55-maintains-neutral-stance-2796025-2025-10-01",
      "headline": "RBI holds lending rate steady at 5.5%, maintains neutral stanceThe Reserve Bank of India (RBI) kept the key repo rate unchanged at 5.5% as the Monetary Policy Committee (MPC), led by Governor Sanjay Malhotra, concluded its three-day meeting. The central bank also maintained its neutral stance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/lg-electronics-india-ipo-opening-date-price-band-gmp-5-key-details-investors-must-know-2796023-2025-10-01",
      "headline": "LG Electronics India IPO opens next week: 5 key details investors must knowLG Electronics is set to launch the third-largest IPO of 2025, after Tata Capital's Rs 15,500 crore issue scheduled between October 6 and October 8, and HDB Financial Services, which raised Rs 12,500 crore in June this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-nearly-100-points-higher-nifty-above-24500-sun-pharma-up-2-percent-2796011-2025-10-01",
      "headline": "Sensex opens nearly 100 points higher, Nifty above 24,500; Sun Pharma up 2%The S&P BSE Sensex was up 58.51 points to 80,326.13, while the NSE NIfty50 added 25.65 points to 24,636.75 as of 9:24 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-decision-today-repo-rate-cut-governor-sanjay-malhotra-us-tariff-trade-talk-headwinds-gst-reform-2795987-2025-10-01",
      "headline": "RBI MPC decision today: Will there be a surprise rate cut?India has seen supportive fiscal measures this year, including changes in income tax slabs and GST cuts, which are expected to boost consumption during the festive season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/government-keeps-small-savings-rates-including-ppf-and-nsc-steady-2795829-2025-09-30",
      "headline": "Government keeps PPF, NSC and other small savings rates unchanged. Check hereThe government has kept interest rates unchanged for key small savings schemes, including PPF and NSC, for the upcoming quarter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/lg-electronics-india-rs-15000-crore-ipo-to-open-on-october-7-check-details-2795771-2025-09-30",
      "headline": "LG Electronics India's Rs 15,000 crore IPO to open on October 7. Check detailsThe much-anticipated IPO of LG Electronics India, worth Rs 15,000 crore, is scheduled to open on October 7. Here's everything you need to know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/buffet-vs-la-carte-all-you-can-eat-bbq-nation-the-gt-road-profit-business-model-2795755-2025-09-30",
      "headline": "Behind the buffet: How restaurants profit from all-you-can-eat deals'All you can eat.' That is how buffets work. But then how do famous buffets such as BBQ Nation, The GT Road, and Pirates of Grill, with prices ranging from Rs 900-1400, make a profit serving unlimited food?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/gold-and-silver-lead-the-way-as-investors-seek-stability-says-expert-bullion-boom-2795753-2025-09-30",
      "headline": "Gold and silver lead the way as investors seek stability, says expertWith stock market volatility unsettling investors, many are turning to gold and silver for safety. Experts say the renewed interest in precious metals reflects a broader search for stability amid uncertain conditions."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/smriti-irani-barefoot-walk-bombay-fashion-week-fashion-comeback-2798004-2025-10-05",
      "headline": "Smriti Irani makes runway comeback after 26 years with symbolic walk. Watch Smriti Irani made a return to the fashion runway after 26 years. She walked barefoot, which many saw as a statement of authenticity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kantara-chapter-1-fan-dressed-daiva-dindigul-screening-2798030-2025-10-05",
      "headline": "Kantara Chapter 1 fan dressed as Daiva stuns audience at Dindigul screening 'Kantara: Chapter 1' earned more than Rs 150 crore at box office in three days. A fan dressed as Panjurli deity drew attention at the Dindigul screening."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-spiritual-journey-himalayas-simple-lifestyle-2798016-2025-10-05",
      "headline": "Rajinikanth enjoys spiritual break in Rishikesh, relishes meal roadside Veteran actor Rajinikanth took a break from his professional commitments and embarked on a spiritual journey to the Himalayas. Pictures of him leading a simple life away from stardom have emerged online. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/elon-musk-angry-netflix-dead-end-paranormal-park-2797999-2025-10-05",
      "headline": "Why Elon Musk is angry 3 years after Netflix cancelled 'Dead End: Paranormal Park' 'Dead End: Paranormal Park', the show that drew Elon Musk's ire, was cancelled after two seasons, but the series is still available on Netflix"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-opalite-lyrics-travis-kelce-kayla-nicole-reaction-2797953-2025-10-05",
      "headline": "Travis Kelce's ex Kayla Nicole breaks silence on Taylor Swift's Opalite Taylor Swift releases her twelfth studio album, 'The Life of a Showgirl', sparking speculation over the track 'Opalite'. Kayla Nicole, Travis Kelce's former partner, shares posts interpreted by many as responses to the song."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/arbaaz-khan-wife-sshura-khan-welcome-their-first-child-2797763-2025-10-05",
      "headline": "Arbaaz Khan wife Sshura welcome first child: Sources Actor Arbaaz Khan and Sshura Khan welcome their first child. Sshura was admitted to PD Hinduja Hospital hours before the birth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-dadasaheb-phalke-award-kerala-felicitation-malayalam-cinema-2797959-2025-10-05",
      "headline": "Kerala government honours Mohanlal after Dadasaheb Phalke win Kerala government honoured veteran actor Mohanlal for receiving the Dadasaheb Phalke Award. The ceremony, held in Thiruvananthapuram, was attended by Chief Minister Pinarayi Vijayan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/samay-rana-sugar-daddy-post-debate-yuzvendra-chahal-dhanashree-verma-split-divorce-2797950-2025-10-05",
      "headline": "Dhanashree Verma shares cryptic post after Samay Raina, Yuzvendra Chahal's banter Stand-up comic Samay Rana's post referencing Yuzvendra Chahal sparked debate online. Soon after his video, Dhanshree Verma shared a cryptic post which is believed to be a dig at Raina. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-elvish-yadav-hosts-new-task-eight-nominees-eviction-weekend-ka-vaar-2797944-2025-10-05",
      "headline": "Bigg Boss 19 ep 42: Salman Khan jokes with Elvish Yadav as he appears on show Internet personality Elvish Yadav appeared on 'Bigg Boss 19' for a Weekend Ka Vaar episode. Salman Khan greeted Elvish with his catchphrase and introduced a task for contestants."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/netflix-shares-slide-elon-musk-boycott-call-dead-end-paranormal-park-2797937-2025-10-05",
      "headline": "Netflix cap drops around $15 billion after Elon Musk's boycott call Elon Musk's boycott Netflix call sends shares tumbling, sparking a new culture clash. His posts on X came after he cancelled his own subscription to the streaming platform while taking a dig at it. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-orange-door-campaign-ai-videos-12-cities-fan-puzzle-2797927-2025-10-05",
      "headline": "Taylor Swift's The Life of a Showgirl sparks global orange door hunt Taylor Swift launched an international promotional puzzle for her new album. Orange doors with QR codes have appeared in cities such as London and Berlin."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/hina-khan-breast-cancer-mental-strength-family-support-work-resilience-2797918-2025-10-05",
      "headline": "Hina Khan opens up on taboo around cancer in the entertainment industry Actor Hina Khan discusses the stigma surrounding cancer among artists and advocates for continued work. The actor shares her experience after being diagnosed with stage three breast cancer."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anshula-kapoor-honours-late-mother-mona-shourie-engagement-outfit-maheep-kapoor-performs-duties-2797899-2025-10-05",
      "headline": "Anshula Kapoor honours late mother with engagement outfit, Maheep performs duties Maheep Kapoor performed mother duties at Anshula Kapoor and Rohan Thakkar's Gor Dhana ceremony. Attended by family members, several pictures from the event have emerged online. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kantara-chapter-1-box-office-rishab-shetty-film-mints-rs-160-crore-sikandar-game-changer-2797877-2025-10-05",
      "headline": "Kantara Chapter 1 box office Day 3: Rishab's film earns Rs 160 crore, beats Sikandar Rishab Shetty's film 'Kantara Chapter 1' surpassed the 150-crore mark in three days. The film has set the cash registers ringing at Rs 162 crore. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sunny-sanskari-ki-tulsi-kumari-box-office-day-3-varun-dhawan-janhvi-kapoor-entertainer-eyes-rs-30-crore-2797868-2025-10-05",
      "headline": "Sunny Sanskari box office Day 3: Varun, Janhvi's entertainer eyes Rs 30 crore Varun Dhawan and Janhvi Kapoor's rom-com 'Sunny Sanskari Ki Tulsi Kumari' has earned Rs 22 crore at the box office despite receiving mixed reviews. After dipping on Day 2, the film bounced back on its third day with collections of Rs 7.25 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/anita-hassanandani-crowned-winner-of-reality-show-chhoriyan-chali-gaon-2797866-2025-10-05",
      "headline": "Anita Hassanandani crowned winner of reality show Chhoriyan Chali Gaon Actor Anita Hassanandani was announced as the winner of the reality show 'Chhoriyan Chali Gaon.' The show highlighted rural life and tested celebrities with traditional tasks. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/indian-cinema-mythology-folklore-cinematic-universes-baahubali-stree-hanu-man-2797217-2025-10-05",
      "headline": "Of Gods and ghosts: How mythology and folklore power India's cinematic universes Indian filmmakers are increasingly creating cinematic universes inspired by mythology and folklore, blending traditional stories with modern narratives. This trend is reshaping Indian cinema with ambitious projects spanning films, animation, and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/baahubali-off-netflix-platforms-in-india-2797823-2025-10-04",
      "headline": "Baahubali films off Netflix: On which platforms can you watch them in India? Baahubali and Baahubali 2 are currently not available on Netflix. However, fans can catch the epic films on five other platforms. Check it out."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/jin-encore-concerts-hotel-price-surge-incheon-munhak-stadium-booking-chaos-2797768-2025-10-04",
      "headline": "BTS Jin concerts cause Incheon hotel prices to soar by 200 per cent Hotels near Incheon Munhak Main Stadium raise rates sharply ahead of BTS' Jin's encore concerts. Fans and non-fan guests report cancelled bookings and increased accommodation costs."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-live-score-icc-womens-world-cup-updates-colombo-rain-2797930-2025-10-05",
      "headline": "IND vs PAK Live: Deepti, Rana go in quick successionIndia (INDW) vs Pakistan (PAKW) LIVE, Women's World Cup: Deepti Sharma and Sneh Rana will be looking to guide India to a competitive score. After play resumed, India lost the all-important wicket of Jemimah Rodrigues. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/bihar-to-be-first-state-where-evm-ballots-candidate-photos-appear-in-colour-poll-body-chief-2797969-2025-10-05",
      "headline": "Poll body announces 17 new reforms for Bihar polls; to be adopted nationwide laterThe Election Commission has introduced identity cards for booth-level officials, mobile phone deposits outside polling stations, and full webcasting, aiming to make Bihar's Assembly elections more transparent."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/air-india-dreamliner-scare-uk-bound-air-india-flight-revives-ai-171-ahmedabad-london-crash-ghosts-2797926-2025-10-05",
      "headline": "Air India Dreamliner scare revives AI 171 crash ghostsConsidered the aircraft's last lifeline, the fan-like emergency turbine dropped from the underside of the UK-bound Boeing Dreamliner, as seen seconds before the fated AI 171 crash in June."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/pilots-body-asks-aviation-regulator-to-thoroughly-check-probe-electrical-system-of-all-boeing-787-aircraft-2798059-2025-10-05",
      "headline": "Pilot's body seeks thorough check, probe of Boeing 787 aircraft's electrical systemOn Saturday, an Air India Boeing Dreamliner 787-8 aircraft operating from Amritsar to Birmingham was grounded in the UK after its emergency turbine, the Ram Air Turbine (RAT), deployed mid-descent."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sunday-special/story/why-doctors-have-horrible-illegible-handwriting-way-to-fix-it-high-court-order-legible-writing-ima-directive-medico-legal-cases-2797570-2025-10-05",
      "headline": "Why do doctors have horrible handwriting, and can it be cured?Medical prescriptions that are nothing but scribbles and scrawls are very common. Bad handwriting of doctors is a problem faced regularly by patients and pharmacists, and recently saw a stern observation by a high court in a medico-legal case. Here's why doctors have bad handwriting and the way to fix illegible prescriptions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/kerala/story/kerala-devaswom-temples-extortion-concerns-sabarimala-gold-controversy-2798065-2025-10-05",
      "headline": "Secret groups extorting wealthy devotees in temples: Kerala leader's big claimEzhava community leader Vellappally Natesan has accused secret groups of extorting money from wealthy devotees in Kerala's Devaswom-managed temples. The claims come amid increased calls for transparency and a probe into the temple administration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/doctor-arrested-for-prescribing-toxic-cough-syrup-linked-to-10-childrens-deaths-in-madhya-pradesh-2797849-2025-10-05",
      "headline": "Doctor arrested after 16 children die in Madhya Pradesh from toxic cough syrupPolice have arrested Dr Praveen Soni, who prescribed the cough syrup to children, and registered a case against him and Sresun Pharmaceuticals, the Tamil Nadu-based manufacturer of the 'Coldrif' syrup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-smriti-mandhana-trolled-failure-womens-world-cup-2025-2798072-2025-10-05",
      "headline": "Bilaterals hero, ICC events zero: Smriti Mandhana trolled after PAK failureFans trolled Smriti Mandhana after she once again failed to deliver with the bat in the Women's World Cup 2025 during the India vs Pakistan clash in Colombo on Sunday, October 5. Mandhana hasn't had the best start in the tournament.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/shutdown-blues-in-washington-ripples-in-new-delhi-mumbai-2797833-2025-10-05",
      "headline": "Shutdown Blues in Washington, Ripples in New Delhi, MumbaiA prolonged government shutdown coupled with steep tariffs threatens to further sap American demand, unsettle capital flows, and further deepen pressures already weighing on India's exports, rupee and stock markets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/travel/story/chinas-24-hour-spas-are-going-viral-heres-why-india-needs-one-2797385-2025-10-05",
      "headline": "China's 24-hour spas are going viral. Here's why India needs oneIn China, these 24-hour spas are not just about scented candles, soothing music or massages. It's beyond the traditional and is currently the internet's latest obsession. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/learn-how-adobe-express-is-making-graphic-design-fun-in-classrooms-2792611-2025-09-24",
      "headline": "Learn How Adobe Express Is Making Graphic Design Fun In ClassroomsThe Adobe Express app is available on any smart device or desktop computer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-pakistan-womens-world-cup-2025-toss-controversy-referee-error-2798025-2025-10-05",
      "headline": "Toss fixing? Pakistan captain gets to decide despite making wrong call vs IndiaThe India-Pakistan Women's World Cup 2025 match has been marred by a toss controversy due to the match referee's mistake. Pakistan captain Fatima Sana was allowed to choose despite making the wrong call at the toss."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/smriti-irani-barefoot-walk-bombay-fashion-week-fashion-comeback-2798004-2025-10-05",
      "headline": "Smriti Irani makes runway comeback after 26 years with symbolic walk. WatchSmriti Irani made a return to the fashion runway after 26 years. She walked barefoot, which many saw as a statement of authenticity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/trapeze-sans-safety-net-thats-state-of-international-polity-today-jaishankar-on-paradoxical-world-order-2798049-2025-10-05",
      "headline": "Today's world a 'trapeze sans safety net' amid paradoxical risks: JaishankarAt the 4th Kautilya Economic Conclave, EAM S Jaishankar described the global scenario as paradoxical, where heightened risk-taking coexists with efforts to de-risk politics and economics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/hindu-group-protests-modelling-show-rehearsal-diwali-miss-rishikesh-lions-club-2797847-2025-10-05",
      "headline": "Hindu outfit objects to women in western attire at modelling show in RishikeshA modelling rehearsal in Rishikesh ahead of a Diwali fair sparked protests from a Hindu group objecting to women's western attire, leading to a heated confrontation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tejashwi-yadav-again-questions-nitish-kumars-fitness-does-he-appear-mentally-healthy-2798062-2025-10-05",
      "headline": "Is he mentally fit? Tejashwi Yadav flags Nitish Kumar's 'bizarre antics' in videoBihar's political drama continues as RJD leader and Leader of the Opposition Tejashwi Yadav again raised questions about Chief Minister Nitish Kumar's mental fitness and ability to lead. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/arbaaz-khan-wife-sshura-khan-welcome-their-first-child-2797763-2025-10-05",
      "headline": "Arbaaz Khan wife Sshura welcome first child: SourcesActor Arbaaz Khan and Sshura Khan welcome their first child. Sshura was admitted to PD Hinduja Hospital hours before the birth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-530-03-10-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-20-warning-india-pakistan-conflict-pahalgam-terror-attack-asim-munir-2797842-2025-10-05",
      "headline": "The Operation Sindoor 2.0 warningIndia's security establishment warns Field Marshal Asim Munir against adventurism. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/deaths-roads-cut-off-bridge-collapse-landslides-bengal-darjeeling-mirik-kurseong-2797872-2025-10-05",
      "headline": "11 dead as heavy rain, landslides hit Darjeeling; roads blocked, bridges collapseThe North Bengal region has been under red alert as the weather body predicted extremely heavy rain in the sub-Himalayan districts of Darjeeling, Kalimpong, Cooch Behar, Jalpaiguri, and Alipurduar until Sunday morning. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/elon-musk-angry-netflix-dead-end-paranormal-park-2797999-2025-10-05",
      "headline": "Why Elon Musk is angry 3 years after Netflix cancelled 'Dead End: Paranormal Park''Dead End: Paranormal Park', the show that drew Elon Musk's ire, was cancelled after two seasons, but the series is still available on Netflix"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/photo/chiranjeevi-jackie-shroff-khushboo-and-stars-celebrate-80s-reunion-bash-2797924-2025-10-05",
      "headline": "Chiranjeevi, Jackie Shroff, Khushboo and stars celebrate 80s reunion bashA bevy of stars gathered to celebrate the 80s Stars Reunion, an annual tradition in the South Indian film industry, held in Chennai on October 4. Take a look at the pictures here. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/doctor-breaks-down-cough-syrup-prescription-age-wise-what-is-safe-for-kids-and-adults-2797956-2025-10-05",
      "headline": "Doctor breaks down cough syrup prescription age-wise: What is safe for kids and adultsAccording to the doctor, most coughs clear up on their own. Stick to simple remedies, including saline, honey (for kids over 1), humidifiers, or single-ingredient syrups. Skip codeine, multi-ingredient mixes, and antibiotics unless a doctor says otherwise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/woman-posts-video-of-blinkit-delivery-agent-touching-her-inappropriately-2797901-2025-10-05",
      "headline": "Woman posts video of Blinkit delivery agent touching her inappropriatelyA woman shared a video of a Blinkit delivery agent touching her inappropriately while delivering a parcel. She posted the clip on X, which has since gone viral. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-smriti-mandhana-trolled-failure-womens-world-cup-2025-2798072-2025-10-05",
      "headline": "Bilaterals hero, ICC events zero: Smriti Mandhana trolled after PAK failure Fans trolled Smriti Mandhana after she once again failed to deliver with the bat in the Women's World Cup 2025 during the India vs Pakistan clash in Colombo on Sunday, October 5. Mandhana hasn't had the best start in the tournament.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-womens-world-cup-bug-outbreak-colombo-pest-control-2798066-2025-10-05",
      "headline": "Bug outbreak disrupts IND vs PAK clash, groundsmen rush in with pest control measures IND vs PAK, Women's World Cup 2025: The India-Pakistan women's World Cup match was halted due to a sudden bug infestation on the field. This rare stoppage caused a 15-minute delay."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/estevaos-stoppage-time-goal-chelsea-beats-liverpool-third-straight-defeat-2798045-2025-10-05",
      "headline": "Liverpool boss Arne Slot says no need to panic after painful loss to Chelsea Liverpool boss Arne Slot said that there is no reason to panic after their loss to Chelsea on Saturday, October 4. This was the second consecutive loss for Liverpool in stoppage time as they lost grip of the top spot. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-odi-captaincy-aaron-finch-backs-india-white-ball-leadership-australia-tour-2798037-2025-10-05",
      "headline": "Having Rohit, Kohli will calm things down as Gill takes over ODI captaincy: Finch Aaron Finch has expressed strong confidence in Shubman Gill as he takes over India's ODI captaincy. Finch believes Gill's leadership and support from senior players will ensure a smooth transition and success against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-pakistan-womens-world-cup-2025-toss-controversy-referee-error-2798025-2025-10-05",
      "headline": "Toss fixing? Pakistan captain gets to decide despite making wrong call vs India The India-Pakistan Women's World Cup 2025 match has been marred by a toss controversy due to the match referee's mistake. Pakistan captain Fatima Sana was allowed to choose despite making the wrong call at the toss."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/irani-cup-2025-yash-thakur-yash-dhull-clash-vidarbha-win-2798024-2025-10-05",
      "headline": "Watch: Yash Dhull, Yash Thakur almost trade blows during intense Irani Cup final day Yash Dhull and Yash Thakur almost came to blows on the final day of the Irani Cup 2025. Thakur's celebration didn't sit well with Dhull, who charged towards the pacer and both men had to be separated by players and officials. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-11-0-ind-vs-pak-rivalrly-womens-world-cup-colombo-2798013-2025-10-05",
      "headline": "11-0 not a rivalry: Suryakumar trolls Pakistan ahead of Women's World Cup clash India men's T20I captain Suryakumar Yadav confidently predicts a 12-0 winning streak for India women against Pakistan. His remarks highlight the one-sided nature of the India-Pakistan cricket rivalry and the strong form of the Indian women's team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kaif-slams-bcci-rohit-sharma-odi-captaincy-change-shubman-gill-2798000-2025-10-05",
      "headline": "We couldn't give Rohit Sharma one year? Mohammed Kaif slams ODI captaincy change Mohammed Kaif slammed the decision made by the BCCI to replace Rohit Sharma as the captain of the Indian ODI team with Shubman Gill. Rohit's nearly four-year tenure as skipper of the ODI team came to an end on October 4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harjas-singh-australia-under-19-cricketer-smashes-319-record-sydney-2797977-2025-10-05",
      "headline": "Australia's U-19 star, Harjas Singh smashes 314 runs in Sydney grade cricket match Harjas Singh smashed 314 runs off 141 balls in a Sydney grade cricket match. His record-breaking innings may revive his pathway to higher honours despite earlier setbacks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-womens-world-cup-no-handshake-harmanpreet-kaur-colombo-2797967-2025-10-05",
      "headline": "India continue no-handshake policy in group clash vs Pakistan Harmanpreet Kaur's India continued their no-handshake policy during the toss ceremony ahead of their ICC Women's World Cup group-stage clash against Pakistan in Colombo on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-11-0-ind-vs-pak-rivalrly-womens-world-cup-colombo-2798013-2025-10-05",
      "headline": "11-0 not a rivalry: Suryakumar trolls Pakistan ahead of Women's World Cup clash India men's T20I captain Suryakumar Yadav confidently predicts a 12-0 winning streak for India women against Pakistan. His remarks highlight the one-sided nature of the India-Pakistan cricket rivalry and the strong form of the Indian women's team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kaif-slams-bcci-rohit-sharma-odi-captaincy-change-shubman-gill-2798000-2025-10-05",
      "headline": "We couldn't give Rohit Sharma one year? Mohammed Kaif slams ODI captaincy change Mohammed Kaif slammed the decision made by the BCCI to replace Rohit Sharma as the captain of the Indian ODI team with Shubman Gill. Rohit's nearly four-year tenure as skipper of the ODI team came to an end on October 4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harjas-singh-australia-under-19-cricketer-smashes-319-record-sydney-2797977-2025-10-05",
      "headline": "Australia's U-19 star, Harjas Singh smashes 314 runs in Sydney grade cricket match Harjas Singh smashed 314 runs off 141 balls in a Sydney grade cricket match. His record-breaking innings may revive his pathway to higher honours despite earlier setbacks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-womens-world-cup-no-handshake-harmanpreet-kaur-colombo-2797967-2025-10-05",
      "headline": "India continue no-handshake policy in group clash vs Pakistan Harmanpreet Kaur's India continued their no-handshake policy during the toss ceremony ahead of their ICC Women's World Cup group-stage clash against Pakistan in Colombo on Sunday."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}