{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/parliament-panel-proposes-revival-of-key-tax-relief-for-companies-report-2757016-2025-07-17",
      "headline": "Parliament panel proposes revival of key tax relief for companies: ReportThe government is set to restore Section 80M in the new Income Tax Bill, easing dividend tax burdens for companies. The bill is likely to pass in the Monsoon Session."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ecommerce-negative-review-not-published-consumer-rights-online-shopping-2757011-2025-07-17",
      "headline": "Are e-commerce firms hiding your rating? New survey reveals the truthThe survey asked consumers about their experience when posting negative reviews on e-commerce and quick commerce apps. Out of 16,519 responses, only 11% said their negative reviews were \"published as is.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-flat-nifty-above-25200-sbi-shares-up-1-percent-2756990-2025-07-17",
      "headline": "Sensex opens flat, Nifty above 25,200; SBI shares up 1%The S&P BSE Sensex was down 41.02 points to 82,593.46, while the NSE Nifty50 lost 13.30 points to 25,198.75 as of 9:30 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/smartworks-coworking-spaces-ipo-listing-share-price-strong-market-debut-today-july-17-2756976-2025-07-17",
      "headline": "Smartworks Coworking Spaces to list today. Will it make strong market debut?The company had set a price band of Rs 407 per share for the IPO. The total issue size was Rs 582.56 crore, which included a fresh issue of 1.09 crore shares worth Rs 445 crore and an offer for sale (OFS) of 34 lakh shares valued at Rs 137.56 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/anthem-biosciences-ipo-allotment-status-today-online-guide-listing-details-share-price-bse-kfin-2756970-2025-07-17",
      "headline": "Anthem Biosciences IPO: Allotment status live. GMP, listing details hereInvestors who applied for the Anthem Biosciences IPO can check their allotment status online through two platforms: the BSE website and the website of the IPO registrar, KFin Technologies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-43-points-higher-nifty-above-25200-sbi-gains-2-percent-2756659-2025-07-16",
      "headline": "Sensex closes 64 points higher, Nifty above 25,200; SBI gains 2%The S&P BSE Sensex added 63.57 points to end at 82.634.48, while the NSE Nifty50 gained just 16.25 points to close at 25,212.05."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gurugram-gurgaon-rain-water-logging-real-estate-price-bubble-review-infra-drainage-2756654-2025-07-16",
      "headline": "Gurugram's luxury flats, flooded streets: Is real estate bubble about to burst?Gurugram's luxury real estate may be booming, but repeated rain-induced flooding is testing its long-term value. If basic infrastructure fails, even the city's glitziest addresses could lose their appeal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-gold-losing-its-shine-here-is-why-fewer-people-are-investing-in-the-yellow-metal-gold-investment-trends-etfs-2756607-2025-07-16",
      "headline": "Is gold losing its shine? Here's why fewer people are investing in the yellow metalEarlier, gold symbolised family pride and social standing, but today's youngsters often see gold jewellery as outdated and instead put their money into things they believe will grow faster than gold ever could."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-upcoming-meeting-august-expectation-simplification-slab-structure-rate-rationalisation-2756556-2025-07-16",
      "headline": "Fewer slabs, simpler rules? Next GST Council meet may trigger overhaulThe upcoming GST Council meeting, likely to be held in August 2025 after the monsoon session of Parliament, could bring key reforms in the way GST is structured and collected."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-residential-housing-home-sales-drop-affordability-concerns-proptiger-report-2756552-2025-07-16",
      "headline": "Housing sales slide 14% as affordability pressures mount across cities: ReportThe PropTiger report, which tracks sales and launches across major cities, found that the most significant annual drop was recorded in Mumbai Metropolitan Region (MMR) and Pune, where sales fell by 32% and 27% respectively."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mygate-founder-abhishek-kumar-work-as-guard-why-rs-1600-crore-valuation-iit-iim-graduate-2756521-2025-07-16",
      "headline": "Why this IITian took up a guard's job to build Mygate, valued at Rs 1,600 croreMyGate has raised a total of $83.3 million across eight rounds. Its latest funding was in April 2023, a Series B round worth $3.29 million, putting its valuation at Rs 1,670 crore, according to Tracxn."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-model-y-in-india-elon-musk-key-challenges-what-next-for-ev-maker-2756518-2025-07-16",
      "headline": "Tesla is finally in India. But can it go the distance?Tesla's India debut is a big milestone, but long-term success will depend on how well the company adapts to India's unique mix of pricing realities, policy expectations, and market dynamics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/are-private-school-fees-draining-indian-middle-class-ca-shares-eye-opening-figures-2756494-2025-07-16",
      "headline": "Are private school fees draining India's middle class? CA shares eye-opening figuresWith fees climbing each year, parents are feeling the pinch more than ever. Maybe now is the right moment to pause, think, and ask ourselves, are we getting real value for this cost? Can we secure our kids' future without spending a fortune on fees? asks a Delhi-based CA."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/ssy-scheme-how-your-daughter-can-get-rs-71-lakh-at-21-sukanya-samriddhi-yojana-government-scheme-2756448-2025-07-16",
      "headline": "SSY scheme: How your daughter can get Rs 71 lakh at 21It is a small savings scheme backed by the government, which offers high interest rates, tax benefits under Section 80C, and tax-free returns on maturity. Over 4.1 crore accounts have been opened so far under this scheme."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/hdfc-bank-share-holders-good-news-soon-bonus-issue-special-interim-dividend-2756447-2025-07-16",
      "headline": "Good news soon for HDFC Bank shareholders? Here's all you need to knowHDFC Bank shares have delivered a 24% gain over the past year, with a year-to-date rise of nearly 13%. The stock has climbed more than 21% over the last six months, posting gains of 7% over the past three months and 4% in the previous month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/ashok-leyland-share-price-bonus-issue-not-down-50-percent-down-2756443-2025-07-16",
      "headline": "Did Ashok Leyland shares fall over 50% today? Details hereThe steep drop is the result of the company's 1:1 bonus issue, which came into effect on Wednesday. When a stock goes \"ex-bonus,\" its price adjusts to reflect the additional shares being issued. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-69-points-lower-nifty-below-25200-hdfc-bank-up-1-percent-2756420-2025-07-16",
      "headline": "Sensex opens 69 points lower, Nifty below 25,200; HDFC Bank up 1%The S&P BSE Sensex was down by 197.64 points to 82,373.27, while the NSE Nifty50 lost 61.80 points to 25,134.00 as of 9:28 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/anthem-biosciences-ipo-day-3-last-day-bidding-today-latest-subscription-gmp-listing-allotment-2756419-2025-07-16",
      "headline": "Anthem Biosciences IPO to close for bidding: Check latest subscription, GMPThis IPO is entirely an offer for sale (OFS) of 5.96 crore equity shares by existing shareholders. The company itself will not receive any money from this offer. The price band has been set at Rs 570 per share."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-revamp-pmo-clearance-changes-report-cess-rationalisation-meeting-august-2756402-2025-07-16",
      "headline": "Big GST changes ahead? Centre signals green light, says reportThe Prime Minister's Office (PMO) has given an in-principle nod to a revamp of the GST structure, paving the way for possible reforms in the upcoming GST Council meeting scheduled for August."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/theobroma-sold-chryscapital-buyer-two-sisters-how-it-started-mumbai-bakery-cafe-cake-brownie-2756217-2025-07-15",
      "headline": "The Theobroma story: How 2 sisters turned a cafe into 225-store pan-India chainPrivate equity firm ChrysCapital has struck a sweet deal to acquire a 90% stake in Theobroma Foods for Rs 2,410 crore. The bakery chain, started by two sisters in Mumbai, has grown into a 225-store brand loved for its brownies and cakes. Read on to know more about the Mumbai-based bakery chain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mtnl-misses-rs-8585-crore-payments-owes-7-public-sector-banks-2756159-2025-07-15",
      "headline": "MTNL misses Rs 8,585 crore payments, owes 7 public sector banksIn a filing on Tuesday, MTNL confirmed that it has defaulted on both principal and interest payments to a group of lenders, which include some of India's biggest state-owned banks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-317-points-higher-nifty-above-25100-hcltech-down-3-2756116-2025-07-15",
      "headline": "Sensex ends 317 points higher, Nifty above 25,100; HCLTech down 3%The S&P BSE Sensex added 317.45 points to end at 82,570.91, while the NSE Nifty50 was up 113.50 points to close at 25,195.80. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/should-you-subscribe-anthem-biosciences-ipo-listing-gains-gmp-allotment-date-review-2756093-2025-07-15",
      "headline": "Anthem Biosciences IPO fully booked: Should you subscribe? Check listing gainsThe IPO opened for subscription on July 14, aims to raise Rs 3,395 crore through a complete offer for sale (OFS) of 5.96 crore equity shares."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-rs-12-crore-did-not-make-this-man-happy-investment-advisor-explains-2756072-2025-07-15",
      "headline": "Why Rs 12 crore didn't make this man happy? Investment advisor explainsWhile money matters, it should never cost you your health, peace of mind, or precious family time. True wealth is living well, not just stacking numbers in a bank account, says an investment advisor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-zerodhas-nithin-kamath-wants-short-selling-made-easy-in-india-2756030-2025-07-15",
      "headline": "Why Zerodha's Nithin Kamath wants short selling made easy in IndiaIf someone wants to short a stock today, they mostly do it through futures or options. But there's a catch, there are only 224 stocks in India that have futures and options. So if a bad company is not on that list, no one can short it easily."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/theobroma-stake-sale-90-percent-chryscapital-accquisition-kainaz-messman-harchandrai-tina-messman-wykes-report-2755967-2025-07-15",
      "headline": "Theobroma to be sold, Rs 2,410-crore sweet deal baked by ChrysCapital: ReportFounded in 2004 by sisters Kainaz Messman Harchandrai and Tina Messman Wykes, Theobroma began with a single outlet at Cusrow Baug on Mumbai's Colaba Causeway. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/claiming-fake-itr-refunds-here-is-what-could-happen-2755957-2025-07-15",
      "headline": "Claiming fake ITR refunds? Here's what could happenTo give honest taxpayers a chance to fix their mistakes, the department had earlier asked people to revise their returns if they had claimed any wrong deductions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filing-itr-2-or-itr-3-check-these-common-mistakes-and-tips-to-avoid-them-2755920-2025-07-15",
      "headline": "Filing ITR-2 or ITR-3? Check these common mistakes and tips to avoid themUsing the Excel utility for ITR-2 or ITR-3 seems easy, but it's easy to get stuck if you're not careful. One wrong entry can throw your entire tax calculation off. Here's a handy guide to avoid common slip-ups."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/hcltech-share-price-it-stock-q1-results-down-4-percent-why-reason-guidance-2755904-2025-07-15",
      "headline": "Explained: Why HCLTech shares are down 4% todayOver the past few days, HCLTech has been under pressure. The stock has declined 7.9% in the last five trading sessions, 9.58% in the past month, and over 14.6% in the past six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-mumbai-showroom-opening-today-electric-cars-model-y-ev-suv-cost-in-india-rs-60-lakh-2755893-2025-07-15",
      "headline": "Tesla showroom now in Mumbai. Price list of Model Y EVs in India revealed Live UpdatesThe Mumbai showroom will serve as Tesla's main display and customer experience centre, offering visitors a chance to view the vehicles up close and understand Tesla's technology."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-119-points-higher-nifty-above-25100-tata-motors-up-1-percent-2755865-2025-07-15",
      "headline": "Sensex opens 119 points higher, Nifty above 25,100; Tata Motors up 1%The S&P BSE Sensex was up 176.33 points to 82,429.79, while the NSE Nifty50 gained 63.50 points to 25,145.80 as of 9:29 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-model-y-price-india-rs-60-lakh-mumbai-showroom-2755864-2025-07-15",
      "headline": "Tesla's Model Y to debut in India at Rs 60 lakhIn comparison, the Model Y starts at $44,990 in the United States, 263,500 yuan in China, and 45,970 euros in Germany. This makes the Indian version one of the most expensive, mainly due to import duties and logistics costs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-trading-setup-sensex-nifty-july-15-nse-bse-inflation-global-trade-tariff-2755850-2025-07-15",
      "headline": "Sensex, Nifty today: Inflation drops, but will stock markets rise?Gift Nifty futures were trading at 25,166 points around 8:22 am, suggesting a possible higher start for Nifty50, which closed at 25,082.3 on Monday. This points to cautious optimism on Dalal Street after four straight sessions of losses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/smartworks-coworking-spaces-ipo-allotment-status-online-guide-check-gmp-listing-date-2755848-2025-07-15",
      "headline": "Smartworks Coworking Spaces IPO allotment: Online guide to see status. Check GMPInvestors who applied for the IPO can check their allotment status either through the BSE website or the registrar's platform, MUFG Intime India Private Limited (also known as Link Intime India Pvt Ltd)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-hits-record-123000-as-us-policy-hopes-boost-crypto-market-btc-price-all-time-high-2755608-2025-07-14",
      "headline": "Bitcoin hits record $123,000 as US policy hopes boost crypto marketBitcoin is up about 30% so far this year and its rise has lifted other coins too. Ether, the second-biggest token, climbed to a five-month high of $3,059. XRP and Solana also rose about 3% each."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/retail-inflation-hits-6-year-low-in-june-to-210-2755534-2025-07-14",
      "headline": "Retail inflation cools to 6-year low of 2.10% in JuneThis is the fifth month in a row that inflation has remained below the Reserve Bank of India's (RBI) medium-term target of 4%, and the eighth consecutive month it has stayed under the central bank's upper limit of 6%"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-247-points-lower-nifty-below-25100-eternal-zomato-up-3-percent-2755524-2025-07-14",
      "headline": "Sensex closes 247 points lower, Nifty below 25,100; Eternal up 3%The S&P BSE Sensex was down by 247.01 points to close at 82,253.46, while the NSE Nifty50 lost 67.55 points to end at 25,082.30."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ott-dark-pattern-50-percent-find-difficult-to-unsubscribe-local-circles-report-2755499-2025-07-14",
      "headline": "Trap, click, renew: How OTT apps make it hard to cancel subscriptionsAccording to data collected by community platform LocalCircles, 50% of respondents said they have frequently had difficulty cancelling subscriptions to digital services."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/edelweiss-mutual-fund-radhika-gupta-on-why-your-portfolio-should-be-yours-not-someone-else-suno-sabki-portfolio-apni-2755465-2025-07-14",
      "headline": "Edelweiss' Radhika Gupta on why your portfolio should be yours, not someone else'sBuilding your investment portfolio should match your own risk comfort, timeframe and goals. What works for your friend may not work for you, says MD and CEO of Edelweiss Mutual Fund, Radhika Gupta."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-your-tax-refund-may-be-delayed-this-year-2755425-2025-07-14",
      "headline": "Why your tax refund may be delayed this yearOne big reason for the delay is that the tax filing season began late this year. Normally, people can file their returns from April onwards. But this time, the Income Tax Department released the ITR utilities quite late."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/siddhant-chaturvedi-hints-at-gully-boy-2-dhadak-2-crossover-with-ishaan-khatter-2757002-2025-07-17",
      "headline": "Siddhant Chaturvedi hints at Gully Boy 2-Dhadak 2 crossover with Ishaan KhatterSiddhant Chaturvedi recently hinted at a surprising Bollywood crossover, suggesting a role reversal between him and Ishaan Khatter in Gully Boy 2 and Dhadak 2. He made a playful remark, saying \"Dhadak 2 x Gully Boy 2,\" while mimicking Akshay Kumar's iconic swapping gesture from 'Ajnabee'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/10-years-of-bajrangi-bhaijaan-director-kabir-khan-shares-bts-photos-from-sets-2757022-2025-07-17",
      "headline": "10 Years of Bajrangi Bhaijaan: Director Kabir Khan shares BTS photos from setsDirector Kabir Khan marked 10 years of Bajrangi Bhaijaan by sharing memories and behind-the-scenes photos from the film's shoot. Fans flooded the post with requests to release the sequel soon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-recalls-building-own-bike-doing-stunts-bobby-deol-2757008-2025-07-17",
      "headline": "Exclusive: Salman Khan recalls building his own bike, doing stunts for Bobby DeolSalman Khan opened up about his passion for bikes and performing stunts, sharing a rare story of building a bike from scratch. He emphasised the urgent need for better motorsport infrastructure in India to support aspiring riders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/massive-fire-destroys-tomorrowland-main-stage-ahead-of-belgium-music-festival-2756988-2025-07-17",
      "headline": "Tomorrowland organisers issue statement after massive fire destroys main stageA massive fire broke out on the main stage of the Tomorrowland Festival in Belgium just two days before the event, causing severe damage. The organisers shared a statement on social media, stating that no harm occurred during the incident."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nick-jonas-shares-romantic-beach-video-with-priyanka-chopra-2756977-2025-07-17",
      "headline": "Nick Jonas shares romantic beach video with Priyanka Chopra, fans say well done jijuNick Jonas shared a romantic beach video with Priyanka Chopra that's winning hearts on the internet. Their cute chemistry and Nick's 'jiju' vibes have made Indian fans fall in love all with them over again."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vishal-appeals-stop-filming-public-reviews-theatres-first-12-shows-2756974-2025-07-17",
      "headline": "Actor Vishal appeals to stop filming public reviews inside theatres for initial showsActor Vishal, at a recent event, sought a temporary ban on public review recordings in theatres to preserve film integrity. He urged the media and exhibitors to co-operate, stressing on giving a breathing space for films to perform."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kannappa-rashtrapati-bhavan-screening-vishnu-manchu-devotional-telugu-cinema-2756959-2025-07-17",
      "headline": "Vishnu Manchu's Kannappa screened at Rashtrapati Bhavan, actor calls it honourTelugu film 'Kannappa', starring Vishnu Manchu, was screened at Rashtrapati Bhavan, attracting praise for its emotional and visual impact. This marks a significant achievement for Telugu cinema, highlighting its cultural and cinematic depth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/salman-khan-prepping-for-battle-of-galwan-exclusive-interview-2756952-2025-07-17",
      "headline": "Salman Khan on prepping for Galwan: It's slow, not feeling it yet | ExclusiveSalman Khan is undergoing intense physical and mental preparation for his upcoming film, 'Battle of Galwan'. In an exclusive interview with India Today, the actor opened up about his prep for the role."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/supergirl-first-look-milly-alcock-stars-in-dcs-gritty-new-film-glbs-2756934-2025-07-17",
      "headline": "Supergirl first look: Milly Alcock stars in DC's gritty new filmJames Gunn unveiled the first poster for Supergirl starring Milly Alcock. The film, set for 2026, explores a darker, grittier origin story, expanding DC Studios' rebooted universe with fresh emotional depth.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/disney-sues-hong-kong-jewelry-firm-over-mickey-mouse-trademark-glbs-2756930-2025-07-17",
      "headline": "Disney sues Hong Kong jewellery firm over Mickey Mouse trademarkDisney has sued Hong Kong's Red Earth Group, accusing it of trademark infringement for using Mickey Mouse imagery in its jewellery line. The entertainment giant seeks a court injunction and damages.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/harry-potter-stars-emma-watson-zoe-wanamaker-banned-from-driving-for-speeding-glbs-2756923-2025-07-17",
      "headline": "Harry Potter stars Emma Watson, Zoe Wanamaker banned from driving for speedingEmma Watson and Zoe Wanamaker, both Harry Potter stars, have been banned from driving for six months and fined £1,044 each after separate speeding offences and prior penalty points.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tomorrowland-main-stage-destroyed-by-fire-days-before-festival-begins-glbs-2756918-2025-07-17",
      "headline": "Tomorrowland Main stage destroyed by fire days before festival beginsA major fire destroyed Tomorrowland's main stage just days before the festival. While no injuries were reported, organisers face pressure to announce its fate amid fake cancellation emails and global anticipation.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/american-idol-music-head-robin-kaye-and-husband-found-shot-dead-at-la-home-glbs-2756913-2025-07-17",
      "headline": "American Idol music head Robin Kaye and husband found shot dead at LA homePolice found American Idol music supervisor Robin Kaye and her husband dead at their LA home. A 22-year-old local man has been arrested in the suspected double homicide.  \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/stranger-things-5-teaser-vecna-returns-to-hawkins-and-stakes-have-never-been-higher-2756822-2025-07-16",
      "headline": "Stranger Things 5 teaser: Vecna returns to Hawkins and stakes have never been higherNetflix revealed the much-awaited teaser for 'Stranger Things' final season. The release of the finale is planned in two phases, starting November 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/ronit-roy-to-replace-sudhanshu-pandey-in-rupali-ganguly-anupamaa-report-2756763-2025-07-16",
      "headline": "Ronit Roy to replace Sudhanshu Pandey in Anupamaa: ReportActor Ronit Roy is reportedly set to join popular television show 'Anupamaa'. He could be seen taking over as Vanraj Shah after actor Sudhanshu Pandey's exit. This casting aims to boost the show's ratings following recent challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/rajinikanth-coolie-plot-leaked-online-heres-what-we-know-2756813-2025-07-16",
      "headline": "Rajinikanth's Coolie plot leaked online? Here's what we knowThe plot of actor Rajinikanth's much-anticipated film 'Coolie' has reportedly been leaked online, despite the makers keeping key details tightly under wraps. The film is slated for a theatrical release on August 14."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kailash-kher-reacts-to-shooting-at-kapil-sharma-canada-cafe-2756801-2025-07-16",
      "headline": "Singer Kailash Kher reacts to shooting at Kapil Sharma's Canada cafeSinger Kailash Kher reacted to the incident involving an open fire at Kapil Sharma's restaurant in Canada. The shooting occurred on July 10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/shaan-quitting-sa-re-ga-ma-pa-against-himesh-reshammiya-aditya-narayan-fame-2756782-2025-07-16",
      "headline": "Shaan on quitting Sa Re Ga Ma Pa against Himesh's advice, boosting Aditya's fameSinger Shaan revealed that he had to leave 'Sa Re Ga Ma Pa' as a gesture towards his producer-friend. The producer who had appointed him departed from ZeeTV, following internal disputes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-baashha-to-re-release-in-theatres-ahead-of-coolie-2756790-2025-07-16",
      "headline": "Rajinikanth's classic Baashha to re-release in theatres ahead of CoolieAs Rajinikanth's fans gear up for 'Coolie', his iconic 1995 gangster drama 'Baashha' is set to return to theatres in a newly restored 4K version with Dolby Atmos, marking the film's 30th anniversary."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-india-ahmedabad-crash-captain-role-fuel-switch-us-report-pilots-body-2756996-2025-07-17",
      "headline": "Pilots object amid US crash report putting focus on Air India captain's 'role'A report in The Wall Street Journal, citing cockpit recordings, claimed the captain of the Air India jet cut the fuel flow to the engines. The government has urged the public to refrain from jumping to conclusions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/karnataka-blames-rcb-for-bengaluru-stampede-cites-video-appeal-by-virat-kohli-in-report-to-high-court-2757023-2025-07-17",
      "headline": "Karnataka blames RCB for stampede, cites Virat Kohli's video appealIn its report to the High Court, the Karnataka government has blamed Royal Challengers Bengaluru for the fatal stampede on June 4, pointing to Virat Kohli's public video appeal which it said drew an overwhelming crowd."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/satyajit-ray-house-demolition-bangladesh-dhaka-new-delhi-tensions-mymensingh-2757021-2025-07-17",
      "headline": "Exclusive: Demolished house not Satyajit Ray's, says Bangladesh officialA house demolished in Bangladesh's Mymensingh was wrongly linked to Satyajit Ray's ancestors, Dhaka official confirmed, claiming that the iconic filmmaker's ancestral home, Durlov House, remained untouched."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/indian-grandmaster-praggnanandhaa-beats-magnus-carlsen-freestyle-chess-rapid-2756999-2025-07-17",
      "headline": "Praggnanandhaa stuns Carlsen to take sole lead in Las VegasTeenage Indian Grandmaster Rameshbabu Praggnanandhaa continued his strong form in 2025 with a statement victory over world number one Magnus Carlsen at the Freestyle Chess Grand Slam in Las Vegas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/it-was-touch-and-go-for-a-while-obamas-break-silence-on-divorce-rumours-glbs-2756912-2025-07-17",
      "headline": "She took me back: Barack Obama shuts down divorce rumours in podcast with MichelleBarack and Michelle Obama, joined by Michelle's brother Craig Robinson, addressed divorce rumours for the first time with humour and sincerity, reaffirming their strong relationship."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/drone-delhi-india-blood-deliver-emergency-hospitals-icmr-study-futue-rules-challenges-explain-2751025-2025-07-17",
      "headline": "Can drones deliver blood in emergency? India test gives hope, flags hurdlesA bag of blood travelled 35 kilometres in 15 minutes, beating Delhi's chaotic traffic. A June ICMR report, based on trials, shows drones could revolutionise emergency medical delivery. The real test now is whether science, regulation, and infrastructure can unite to make the promise come true."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-mamatas-rallying-cry-for-bangla-speaking-migrant-workers-is-echoing-till-delhi-2756508-2025-07-16",
      "headline": "How Mamata's rallying cry for Bangla-speaking migrant workers is echoing till Delhi\"I've decided to speak more in Bangla from now on—arrest me if you can,\" charged the Bengal chief minister after her party's Kolkata rally\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-reaps-50-billion-windfall-from-tariffs-as-trade-partners-hold-fire-report-glbs-2756945-2025-07-17",
      "headline": "Trump reaps $50 billion windfall from tariffs as trade partners hold fire: ReportDonald Trump's sweeping tariffs generated nearly $50 billion in extra revenue as most US trading partners, except China and Canada, refrained from significant retaliation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-recalls-building-own-bike-doing-stunts-bobby-deol-2757008-2025-07-17",
      "headline": "Exclusive: Salman Khan recalls building his own bike, doing stunts for Bobby DeolSalman Khan opened up about his passion for bikes and performing stunts, sharing a rare story of building a bike from scratch. He emphasised the urgent need for better motorsport infrastructure in India to support aspiring riders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/ssvm-institutions-from-cradle-to-cosmos-2754432-2025-07-11",
      "headline": "SSVM Institutions: From Cradle to CosmosForging Futures with Foresight, Flair, and Faith"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/nine-year-old-girl-dies-heart-attack-rajasthan-school-lunch-break-2756911-2025-07-17",
      "headline": "9-year-old girl dies after suffering multiple heart attacks in RajasthanA nine-year-old girl, a class 4 student at Adarsh Vidya Mandir in Sikar, died after suffering consecutive heart attacks within hours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/animesh-kujur-fastest-indian-sprinter-exclusive-athletics-championships-qualification-2756963-2025-07-17",
      "headline": "Meet Animesh Kujur: India's fastest man, breaking one barrier at a timeAt just 22, Animesh Kujur is now India's fastest man alive. Hailing from a remote village in Chhattisgarh, he is rewriting the history of Indian track and field."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-india-went-the-extra-mile-in-lords-test-defeat-2756578-2025-07-16",
      "headline": "How India went the 'extra' mile in Lord's Test defeatThe margin of loss against England wasn't really 22 runs, but the 63 extras that Team India conceded in the match\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/pune/story/10-accidents-reported-in-3-hours-at-same-spot-on-pune-road-after-temporary-repair-2756932-2025-07-17",
      "headline": "10 accidents reported in 3 hours at same spot on Pune road after temporary repairNo fatalities were reported in the accidents but several two-wheeler riders sustained injuries after slipping on a muddy patch, as captured by CCTV cameras."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/bihar-assembly-elections-nitish-kumar-announces-free-electricity-all-details-2756971-2025-07-17",
      "headline": "Nitish Kumar's Bihar poll power play: Free electricity for up to 125 unitsBihar free electricity: The move, coming months ahead of the crucial Bihar Assembly elections, is expected to benefit 1.67 crore families in the state."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ecommerce-negative-review-not-published-consumer-rights-online-shopping-2757011-2025-07-17",
      "headline": "Are e-commerce firms hiding your rating? New survey reveals the truthThe survey asked consumers about their experience when posting negative reviews on e-commerce and quick commerce apps. Out of 16,519 responses, only 11% said their negative reviews were \"published as is.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/shubhanshu-shuklas-emotional-reunion-with-family-after-space-mission-see-pics-2756815-2025-07-16",
      "headline": "Shubhanshu Shukla's emotional reunion with family after space mission. See picsShukla was greeted by his family at a designated facility in Houston, where initial medical checks were conducted before the reunion. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-says-us-very-close-to-trade-deal-with-india-glbs-2756892-2025-07-16",
      "headline": "Trump says US 'very close' to trade deal with India, negotiations underwayUS President Donald Trump said the US is \"very close\" to a trade deal with India, aiming for greater market access and lower tariffs through ongoing negotiations influenced by his tariff strategy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-india-completes-inspection-of-fuel-control-switches-on-boeing-787-planes-no-issues-found-official-2756877-2025-07-16",
      "headline": "Air India finds no fault in fuel control switches on Boeing 787 planes: OfficialAir India has completed inspections of fuel control switches in its Boeing 787 fleet and found no faults, following DGCA's directive after a deadly crash last month. The AAIB report had flagged the role of fuel switches in the engine shutdown."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mp-baby-in-womb-declared-dead-government-hospital-woman-delivers-private-clinic-2756978-2025-07-17",
      "headline": "Declared dead in womb by hospital, woman delivers healthy baby at private clinicThe woman in Madhya Pradesh's Satna was told her baby was stillborn by a government hospital but delivered a healthy boy hours later after a private scan revealed the foetus was alive."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/melania-donald-trump-russia-ukraine-war-secret-agent-us-first-lady-meme-hero-slovanian-putin-2756697-2025-07-16",
      "headline": "Did secret agent Melania Trumpenko turn Trump against Putin?Is US First Lady Melania Trump a secret agent who turned Donald Trump against Russian President Vladimir Putin? Yes, if social media is to be believed. Melania became a hero for Ukrainians and became the subject of \"Agent Melania Trumpenko\" memes after Trump credited her with questioning Putin's actions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/facts-based-on-well-known-sources-aim-is-holistic-learning-ncert-on-row-over-mughal-history-in-class-8-book-2756826-2025-07-16",
      "headline": "Facts from known sources, aim is holistic learning: NCERT on Mughal chapter rowNCERT has released an official statement on its new Class 8 textbook 'Exploring Society, India and Beyond'. Responding to criticism around chapters on the Mughal era, it said that all of its content is fact-based and aimed at holistic learning."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/american-idol-music-head-robin-kaye-and-husband-found-shot-dead-at-la-home-glbs-2756913-2025-07-17",
      "headline": "American Idol music head Robin Kaye and husband found shot dead at LA homePolice found American Idol music supervisor Robin Kaye and her husband dead at their LA home. A 22-year-old local man has been arrested in the suspected double homicide.  \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-syria-conflict-damascus-strikes-druze-community-us-ceasefire-marco-rubio-2756967-2025-07-17",
      "headline": "Syria, Druze leaders agree to new truce as US calls clashes 'misunderstanding'Israeli strikes on Syria continued even as Syrian government officials and the Druze religious minority announced a new ceasefire agreement, with the US stating that all sides have agreed to bring the tensions between the two Middle East nations to an \"end tonight\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/siddhant-chaturvedi-hints-at-gully-boy-2-dhadak-2-crossover-with-ishaan-khatter-2757002-2025-07-17",
      "headline": "Siddhant Chaturvedi hints at Gully Boy 2-Dhadak 2 crossover with Ishaan KhatterSiddhant Chaturvedi recently hinted at a surprising Bollywood crossover, suggesting a role reversal between him and Ishaan Khatter in Gully Boy 2 and Dhadak 2. He made a playful remark, saying \"Dhadak 2 x Gully Boy 2,\" while mimicking Akshay Kumar's iconic swapping gesture from 'Ajnabee'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/10-years-of-bajrangi-bhaijaan-director-kabir-khan-shares-bts-photos-from-sets-2757022-2025-07-17",
      "headline": "10 Years of Bajrangi Bhaijaan: Director Kabir Khan shares BTS photos from setsDirector Kabir Khan marked 10 years of Bajrangi Bhaijaan by sharing memories and behind-the-scenes photos from the film's shoot. Fans flooded the post with requests to release the sequel soon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-recalls-building-own-bike-doing-stunts-bobby-deol-2757008-2025-07-17",
      "headline": "Exclusive: Salman Khan recalls building his own bike, doing stunts for Bobby DeolSalman Khan opened up about his passion for bikes and performing stunts, sharing a rare story of building a bike from scratch. He emphasised the urgent need for better motorsport infrastructure in India to support aspiring riders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nick-jonas-shares-romantic-beach-video-with-priyanka-chopra-2756977-2025-07-17",
      "headline": "Nick Jonas shares romantic beach video with Priyanka Chopra, fans say well done jijuNick Jonas shared a romantic beach video with Priyanka Chopra that's winning hearts on the internet. Their cute chemistry and Nick's 'jiju' vibes have made Indian fans fall in love all with them over again."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kl-rahul-will-outscore-shubman-gill-in-coming-matches-says-owais-shah-2757033-2025-07-17",
      "headline": "KL Rahul will outscore Shubman Gill in coming matches: Former England batterFormer England batter Owais Shah has backed KL Rahul to outscore Shubman Gill in the coming matches. Both Rahul and Gill have been in marvellous form in the ongoing series, having plundered runs in the first three matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/clive-lloyd-complete-overhaul-west-indies-cricket-historic-collapse-vs-australia-2757012-2025-07-17",
      "headline": "Clive Lloyd urges complete overhaul of West Indies cricket after historic collapseClive Lloyd, the legendary former West Indies captain, has called for a serious and thorough review of cricket at all levels in the Caribbean. His remarks come in the wake of the West Indies Test team's shocking collapse against Australia, where they were dismissed for just 27 runs at Sabina Park."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/indian-grandmaster-praggnanandhaa-beats-magnus-carlsen-freestyle-chess-rapid-2756999-2025-07-17",
      "headline": "Praggnanandhaa stuns Carlsen to take sole lead in Las VegasTeenage Indian Grandmaster Rameshbabu Praggnanandhaa continued his strong form in 2025 with a statement victory over world number one Magnus Carlsen at the Freestyle Chess Grand Slam in Las Vegas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/brian-lara-slams-west-indies-cricket-board-for-nicholas-poorans-retirement-2756998-2025-07-17",
      "headline": "Brian Lara slams West Indies Cricket Board for Nicholas Pooran's early retirementLegendary batter Brian Lara has slammed the West Indies Cricket Board for the retirement of Nicholas Pooran, blaming them for not doing anything to keep players loyal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/jude-bellingham-shoulder-surgery-12-weeks-recovery-real-madrid-2756985-2025-07-17",
      "headline": "Jude Bellingham undergoes surgery on dislocated shoulder injuryReal Madrid midfielder Jude Bellingham has successfully undergone surgery to correct a long-standing shoulder dislocation issue, the Spanish club announced on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lamine-yamal-inherits-lionel-messi-iconic-barcelona-number-10-jersey-2756973-2025-07-17",
      "headline": "Lamine Yamal inherits Lionel Messi's iconic Barcelona number 10 jerseyYoung Barcelona star Lamine Yamal inherited the club's iconic number 10 shirt-previously worn by all-time great Lionel Messi-on Wednesday. \"Our 10,\" wrote Barça on social media, alongside a video featuring the teenager."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/animesh-kujur-fastest-indian-sprinter-exclusive-athletics-championships-qualification-2756963-2025-07-17",
      "headline": "Meet Animesh Kujur: India's fastest man, breaking one barrier at a timeAt just 22, Animesh Kujur is now India's fastest man alive. Hailing from a remote village in Chhattisgarh, he is rewriting the history of Indian track and field."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-shubman-gill-aggression-virat-kohli-style-lords-moeen-ali-2756955-2025-07-17",
      "headline": "Shubman Gill's Kohli-style aggression triggered England's beast mode: MoeenFormer England all-rounder Moeen Ali believes Shubman Gill's on-field aggression during the Lord's Test was reminiscent of Virat Kohli's intensity - and may have inadvertently brought out the most competitive side of England in the ongoing series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-women-vs-england-women-1st-odi-report-deepti-sharma-62-southampton-2756950-2025-07-17",
      "headline": "Deepti Sharma helps India complete mammoth run chase vs EnglandDeepti Sharma gave India the upper hand against England once again—this time in more conventional fashion—with a match-winning half-century in Southampton that secured a 1-0 lead in the three-match ODI series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-australia-t20i-series-andre-russell-retirement-squad-announcement-2756897-2025-07-16",
      "headline": "Russell to retire from international cricket after 1st two T20Is vs AustraliaWest Indies all-rounder Andre Russell is all set to retire from international cricket after the first two T20Is against Australia. The first two matches of the series will take place on July 20 and 22. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harleen-deol-run-out-video-reactions-india-southampton-odi-2756895-2025-07-16",
      "headline": "Embarrassing running: Harleen Deol faces flak for bizarre run outENG-W vs IND-W: Harleen Deol fell to a direct hit from Alice Davidson-Richards in the first ODI in Southampton, after which the Indian batter was greeted with criticism. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/animesh-kujur-fastest-indian-sprinter-exclusive-athletics-championships-qualification-2756963-2025-07-17",
      "headline": "Meet Animesh Kujur: India's fastest man, breaking one barrier at a timeAt just 22, Animesh Kujur is now India's fastest man alive. Hailing from a remote village in Chhattisgarh, he is rewriting the history of Indian track and field."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-shubman-gill-aggression-virat-kohli-style-lords-moeen-ali-2756955-2025-07-17",
      "headline": "Shubman Gill's Kohli-style aggression triggered England's beast mode: MoeenFormer England all-rounder Moeen Ali believes Shubman Gill's on-field aggression during the Lord's Test was reminiscent of Virat Kohli's intensity - and may have inadvertently brought out the most competitive side of England in the ongoing series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-women-vs-england-women-1st-odi-report-deepti-sharma-62-southampton-2756950-2025-07-17",
      "headline": "Deepti Sharma helps India complete mammoth run chase vs EnglandDeepti Sharma gave India the upper hand against England once again—this time in more conventional fashion—with a match-winning half-century in Southampton that secured a 1-0 lead in the three-match ODI series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-australia-t20i-series-andre-russell-retirement-squad-announcement-2756897-2025-07-16",
      "headline": "Russell to retire from international cricket after 1st two T20Is vs AustraliaWest Indies all-rounder Andre Russell is all set to retire from international cricket after the first two T20Is against Australia. The first two matches of the series will take place on July 20 and 22. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harleen-deol-run-out-video-reactions-india-southampton-odi-2756895-2025-07-16",
      "headline": "Embarrassing running: Harleen Deol faces flak for bizarre run outENG-W vs IND-W: Harleen Deol fell to a direct hit from Alice Davidson-Richards in the first ODI in Southampton, after which the Indian batter was greeted with criticism. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/japan-open-satwiksairaj-rankireddy-chirag-shetty-injury-fitness-2756873-2025-07-16",
      "headline": "No long-term goals, just stay injury-free ahead of World Championships: SatwiksairajSatwiksairaj Rankireddy said that he and Chirag Shetty aren't keeping any long-term goals in mind and are focused on remaining fit for next month's World Championships. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-vs-bangladesh-mahedi-hasan-tanzid-hasan-3rd-t20i-2756860-2025-07-16",
      "headline": "Bangladesh secure historic T20I series win vs Sri Lanka after Tanzid, Mahedi fireSL vs BAN: Litton Das' Bangladesh claimed the T20I series 2-1 after winning the decider against Sri Lanka on Wednesday by eight wickets at the R. Premadasa Stadium in Colombo. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-new-zealand-2nd-t20i-tri-series-tim-robinson-jacob-duffy-harare-2756827-2025-07-16",
      "headline": "SA vs NZ: Robinson, Duffy star as New Zealand begin Rob Walter era with winTim Robinson and Jacob Duffy were the stars of the show as New Zealand started the Rob Walter era with a win in the second match of the tri-series on Friday, July 16 in Harare. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mahedi-hasan-harbhajan-singh-colombo-sri-lanka-vs-bangladesh-2756825-2025-07-16",
      "headline": "Mahedi Hasan breaks Harbhajan Singh's 13-year-old record in Colombo T20ISL vs BAN: Mahedi Hasan finished with figures of 4-1-11-4 in the third and final game of the three-match series against Sri Lanka on Wednesday, July 16 at the R Premadasa Stadium in Colombo. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-jasprit-bumrah-workload-manchester-test-deep-dasgupta-2756807-2025-07-16",
      "headline": "World's best bowler Jasprit Bumrah has to play Manchester Test: Ex-India cricketerFormer India wicketkeeper Deep Dasgupta wants Jasprit Bumrah to play the Manchester Test against England as he feels that the match is crucial in the context of the series. Bumrah is tipped to play just three Tests during the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kranti-goud-england-women-vs-india-women-1st-odi-video-2756804-2025-07-16",
      "headline": "Watch: Fiery Kranti Goud stuns England batters with deadly inswingersENG-W vs IND-W: Kranti Goud picked up the wickets of Amy Jones and Tammy Beaumont with deadly inswingers in the first ODI on Wednesday at the Rose Bowl in Southampton. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jitesh-sharma-dinesh-karthik-lords-test-viral-video-2756759-2025-07-16",
      "headline": "Jitesh Sharma denied entry at Lord's? Karthik opens up on viral videoENG vs IND: Former India wicketkeeper Dinesh Karthik has addressed the viral video that appeared to show Jitesh Sharma being denied entry to Lord's Cricket Ground during the third Test.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-jasprit-bumrah-workload-manchester-test-deep-dasgupta-2756807-2025-07-16",
      "headline": "World's best bowler Jasprit Bumrah has to play Manchester Test: Ex-India cricketerFormer India wicketkeeper Deep Dasgupta wants Jasprit Bumrah to play the Manchester Test against England as he feels that the match is crucial in the context of the series. Bumrah is tipped to play just three Tests during the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kranti-goud-england-women-vs-india-women-1st-odi-video-2756804-2025-07-16",
      "headline": "Watch: Fiery Kranti Goud stuns England batters with deadly inswingersENG-W vs IND-W: Kranti Goud picked up the wickets of Amy Jones and Tammy Beaumont with deadly inswingers in the first ODI on Wednesday at the Rose Bowl in Southampton. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jitesh-sharma-dinesh-karthik-lords-test-viral-video-2756759-2025-07-16",
      "headline": "Jitesh Sharma denied entry at Lord's? Karthik opens up on viral videoENG vs IND: Former India wicketkeeper Dinesh Karthik has addressed the viral video that appeared to show Jitesh Sharma being denied entry to Lord's Cricket Ground during the third Test.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-ben-stokes-bowling-workload-joe-root-lords-test-2756764-2025-07-16",
      "headline": "Panicked during Ben Stokes's long Lord's spells, but great sign for us: Joe RootJoe Root said that he panicked a bit when Ben Stokes was bowling his long spells during the Lord's Test but feels that it is a good sign for England moving forward. Stokes was the star of the show with the ball as they won the third Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/las-vegas-freestyle-chess-r-praggnanandhaa-magnus-carlsen-d-gukesh-opts-out-2756725-2025-07-16",
      "headline": "Las Vegas Freestyle chess: Praggnanandhaa grouped with Carlsen, Gukesh opts outR Praggnanandhaa will face Magnus Carlsen as the young Indian grandmaster has been grouped with the World No.1 for the Las Vegas Freestyle chess. D Gukesh will be missing the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/scott-boland-icc-rankings-hat-trick-west-indies-vs-australia-2756717-2025-07-16",
      "headline": "Boland rewarded with career-best ranking after hat-trick in Jamaica TestWI vs AUS: Australian speedster Scott Boland reached a career-high ranking of No.6 in Tests after he took a hat-trick in the second innings of the Jamaica Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lamine-yamal-birthday-party-dwarfism-controversy-legal-action-spain-2756710-2025-07-16",
      "headline": "Lamine Yamal in trouble? Spanish group vows legal actionLamine Yamal's 18th birthday party has drawn criticism for hiring people with dwarfism as entertainment. The incident raises serious questions about discrimination and the dignity of people with disabilities in Spain."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-lords-test-england-sanction-wtc-cycle-michael-vaughan-2756669-2025-07-16",
      "headline": "Michael Vaughan left fuming as England docked points for Lord's Test slow over rateMichael Vaughan was left fuming as England were docked points for maintaining a slow over rate during the Lord's Test as India escaped without facing any penalty. The Lord's Test saw many interruptions over the first two days which affected the number of overs bowled. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-retirement-uturn-virat-kohli-test-comeback-2756644-2025-07-16",
      "headline": "Virat Kohli's passion unmatched, he should come back to Test cricket: Madan LalMadan Lal, the 1983 World Cup hero, has expressed a heartfelt wish that has struck a chord with cricket fans across the nation—to see Virat Kohli return to Test cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-test-series-king-charles-akash-deep-sister-2756618-2025-07-16",
      "headline": "King Charles meets Team India, asks about Akash Deep's sisterThe Indian cricket teams met King Charles during their England tour. Charles asked about Akash Deep's sister, who is currently under treatment for cancer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/joe-root-icc-test-batting-ranking-top-spot-dethrones-harry-brook-eng-vs-ind-2756610-2025-07-16",
      "headline": "Joe Root dethrones Harry Brook to reclaim top spot in ICC Test rankingsEngland star Joe Root reclaimed the No.1 spot in ICC Test batting rankings after his century at Lord's, overtaking teammate Harry Brook and marking his eighth time at the top of the global charts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-agm-discusses-two-tier-test-system-t20-world-cup-expansion-new-members-2756600-2025-07-16",
      "headline": "ICC AGM: Two-tier Test system, T20 World Cup expansion to be discussedThe ICC's four-day AGM starting on Thursday will focus on key topics like the proposed two-tier Test system, T20 World Cup expansion, and new member ratifications. With the 2025-27 World Test Championship underway, discussions will center on funding and promotion-relegation rules within the two-tier format."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sl-vs-ban-coach-sanath-jayasuriya-dismisses-pressure-following-2nd-t20i-loss-2756581-2025-07-16",
      "headline": "Coach Sanath Jayasuriya dismisses pressure talk following 2nd T20I lossSri Lanka head coach Sanath Jayasuriya insisted on Tuesday that the team is not under pressure despite their embarrassing 83-run loss to Bangladesh in the second T20I."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}