{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/save-up-to-rs-2-lakh-a-year-real-estate-tax-hacks-every-investor-should-know-2786345-2025-09-12",
      "headline": "Save up to Rs 2 lakh a year: Real estate tax hacks every investor should knowFor many Indians, property isn't just a place to live, it's a smart investment. But what often gets overlooked are the tax breaks that can make real estate even more rewarding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/retail-inflation-rises-marginally-to-207-in-august-from-155-in-july-2786334-2025-09-12",
      "headline": "Retail inflation rises marginally to 2.07% in August from 1.55% in JulyDespite edging up in August, inflation remains very low compared to recent years and well within the RBI's target range of 2–6%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/markets-rally-for-8th-straight-session-all-eyes-on-crucial-sebi-board-meet-2786322-2025-09-12",
      "headline": "Sebi board meeting decisions in focus as markets rally for eighth straight sessionBut the bigger story now is what comes next from Sebi. The regulator's crucial board meeting is expected to decide on sweeping changes to futures and options trading."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-356-points-higher-nifty-above-25100-bel-gains-4-percent-2786308-2025-09-12",
      "headline": "Sensex closes 356 points higher, Nifty above 25,100; BEL gains 4%The S&P BSE Sensex added 356 points to close at 81,904.70, while the NSE Nifty50 gained 108.50 points to end at 25,114.00. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/saving-money-genz-vs-millennials-spending-habit-money-tips-reports-research-2786294-2025-09-12",
      "headline": "Gen-Z vs millennial: Who is better at saving money?GenZ are painted as loud, brash spenders who splurge on gadgets, sneakers, and experiences over savings. But is that really true when it comes to accumulating savings? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sebi-meeting-expectations-today-ipo-investment-fpis-reforms-min-amount-stock-market-dalal-street-2786234-2025-09-12",
      "headline": "Sebi meeting today: What can stock market investors expect from meeting?The Securities and Exchange Board of India (Sebi) is expected to approve a set of reforms that aim to make the market more attractive for businesses and investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/giorgio-armanis-will-outlines-gradual-sale-or-ipo-of-fashion-empire-2786214-2025-09-12",
      "headline": "Giorgio Armani's will outlines gradual sale or IPO of fashion empireThe late Giorgio Armani has left behind more than just a fashion empire. His will reveals a carefully crafted plan for the future of his company. Here's what it says."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-hits-record-highs-3-key-reasons-behind-the-rally-2786181-2025-09-12",
      "headline": "Gold hits record highs. 3 key reasons behind the rallyThe shine of gold is brighter than ever. Prices have soared to record levels, with global and domestic markets witnessing a strong rally. So, what's driving this rise? Three major factors are at play."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-seniors-can-unlock-rs-15-lakh-a-month-from-their-home-explains-expert-2786140-2025-09-12",
      "headline": "How seniors can unlock Rs 1.5 lakh a month from their home, explains expertRising medical bills and everyday expenses often strain retirees who have no pension. But for those who own a house, there's a way out. An expert says reverse mortgage can turn property into a monthly pension of Rs 1.5 lakh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-income-reporting-to-form-selection-7-key-checks-every-taxpayer-should-make-before-filing-itr-2786109-2025-09-12",
      "headline": "From income reporting to form selection: 7 must-do ITR stepsThis article outlines the key things taxpayers in India need to remember while filing their income tax return for the current assessment year, with a focus on accuracy, compliance, and timely processing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/infosys-shares-rally-2-percent-after-record-rs-18000-crore-buyback-will-investors-benefit-2786106-2025-09-12",
      "headline": "Infosys shares up 2% on record buyback plan. Will existing shareholders benefit?Infosys shares climbed over 2% after the IT firm announced a Rs 18,000 crore buyback, the largest in its history. The offer, priced at a 19% premium, could benefit existing shareholders, though experts caution on execution challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/stock-market-update-which-sectors-to-invest-auto-hotels-hospitals-fmcg-it-2786079-2025-09-12",
      "headline": "Dalal Street momentum: Top sectors to invest in todayExperts believe that from Q3 onwards, earnings should improve due to GST rationalisation and income tax cuts, which will start paying off."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rgv-praises-mirai-for-hollywood-level-vfx-compared-it-to-baahubali-2786388-2025-09-12",
      "headline": "RGV praises Mirai for Hollywood-level VFX, compared it to BaahubaliDirector Ram Gopal Varma has praised Teja Sajja's fantasy-action thriller Mirai for its outstanding VFX and narrative. The film is being hailed as an industry hit, drawing comparisons to Baahubali and setting new standards."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diana-penty-reflects-ageism-in-bollywood-women-playing-mothers-in-their-30s-2786340-2025-09-12",
      "headline": "Diana Penty reflects on ageism in Bollywood, women playing mothers in their 30sActor Diana Penty addressed the trend of women playing mothers in films during their 30s. She reflected on her approach to navigating the industry norms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/77th-primetime-emmy-awards-when-and-where-to-watch-nominations-and-presenters-2786379-2025-09-12",
      "headline": "77th Primetime Emmy Awards: When and where to watch, nominations and presentersGet ready to binge on awards! From star-studded presenters to binge-worthy nominations, here's everything you need to know about this year's Emmy magic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/varun-dhawan-sonu-nigam-dance-bijuria-song-sunny-sanskari-ki-tulsi-kumari-youtube-fan-fest-viral-video-2786315-2025-09-12",
      "headline": "Varun Dhawan, Sonu Nigam dance to Bijuria at YouTube fan fest. Video goes viralActor Varun Dhawan and singer Sonu Nigam performed at the YouTube Fan Fest on the song 'Bijuria' from 'Sunny Sanskari Ki Tulsi Kumari.' \r\nA video of their performance is being widely shared on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/kim-namjoon-aka-rm-birthday-of-bts-a-leader-who-leads-by-example-not-domination-2786338-2025-09-12",
      "headline": "Kim Namjoon of BTS: A leader who leads by example, not dominationKim Namjoon, the leader of BTS, exemplifies true leadership with humility and emotional intelligence that resonates deeply with fans. His journey inspires many, showing how genuine reflection and growth can shape both art and people in today's world."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/71st-national-film-awards-shah-rukh-khan-rani-mukerji-to-attend-ceremony-in-new-delhi-2786316-2025-09-12",
      "headline": "71st National Film Awards: SRK, Rani Mukerji to attend ceremony in New DelhiThe 71st National Film Awards are all set to roll out the red carpet for India's finest, with Shah Rukh Khan finally clinching his first National Award, and how! Alongside him, stars like Vikrant Massey and Rani Mukerji are ready to dazzle as the big night descends upon Vigyan Bhawan, New Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kunickaas-old-video-on-sexual-abuse-in-film-industry-goes-viral-kumar-sanus-son-reacts-2786254-2025-09-12",
      "headline": "Kunickaa's old video on sexual abuse in industry goes viral, Kumar Sanu's son reactsSinger Kumar Sanu's son Jaan condemned 'Bigg Boss 19' contestant and actor Kunickaa Sadanand's remarks on rape in the film industry. A clip from an old interview is going viral, in which she suggested women give 'hints' to men. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/drishyam-3-director-jeethu-joseph-warns-fans-not-to-expect-mind-game-2786317-2025-09-12",
      "headline": "Drishyam 3 director Jeethu Joseph warns fans not to expect another mind gameDirector Jeethu Joseph, in a recent interview, revealed that 'Drishyam 3' script has been completed. The filmmaker cautioned viewers against anticipating a complex thriller like previous instalments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/turkish-adaptation-queen-of-tears-ask-ve-gozyasi-hande-ercel-september-2025-2786283-2025-09-12",
      "headline": "Turkish remake of Queen of Tears to premiere in SeptemberTurkish remake of 'Queen of Tears' titled 'Ask ve Gozyasi' stars Hande Ercel and Baris Arduc. The series is scheduled to premiere on ATV in September 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ashneer-grover-indirectly-targets-salman-khan-bigg-boss-criticises-host-centric-reality-shows-2786306-2025-09-12",
      "headline": "Big show with superstar: Ashneer Grover's veiled jibe at Salman Khan and Bigg BossAshneer Grover calls for reality shows to prioritise contestants over hosts. His comments seemed like a veiled jibe at Salman Khan and 'Bigg Boss', which is hosted by the superstar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/shah-rukh-khan-thanks-diljit-dosanjh-supporting-aryan-khan-singing-debut-the-bads-of-bollywood-tenu-ki-pata-2786318-2025-09-12",
      "headline": "Big jhappi to you: SRK thanks Diljit Dosanjh for supporting Aryan in singing debutShah Rukh Khan recently shared a heartwarming note for Diljit Dosanjh and expressed his gratitude for supporting his son Aryan Khan with his singing debut. Diljit and Aryan collaborated for the track 'Tenu Ki Pata' from 'The Ba***ds of Bollywood'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mirai-x-reviews-teja-sajja-film-gets-thumbs-up-for-divine-cinematic-experience-2786270-2025-09-12",
      "headline": "Mirai X reviews: Teja Sajja's film gets thumbs up for divine cinematic experienceActor Teja Sajja's fantasy-action-thriller 'Mirai', received a highly positive response from viewers in their X reviews. The film was commended for its visuals, background score and divine references. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/demon-slayer-actor-takahiro-sakurai-infinity-castle-craze-inspiring-2786278-2025-09-12",
      "headline": "Exclusive: Demon Slayer star Sakurai finds India's Infinity Castle craze inspiring'Demon Slayer: Kimetsu no Yaiba Infinity Castle' has created a cultural phenomenon in India, breaking advance booking records and thrilling fans with special midnight screenings. Voice actor Takahiro Sakurai spoke exclusively with India Today about his work. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sunjay-kapur-sister-mandhira-praises-karisma-kapoor-her-upbringing-amid-legal-dispute-2786250-2025-09-12",
      "headline": "Sunjay Kapur's sister Mandhira praises Karisma, her upbringing amid legal disputeSunjay Kapur's sister Mandhira refers to Karisma Kapoor as her best friend. She praises the upbringing of Karisma's children, while discussing the legal battle over her late brother's Rs 30,000 crore estate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ilaiyaraaja-50-tamil-nadu-government-honour-kamal-haasan-rajinikanth-attend-2786259-2025-09-12",
      "headline": "Tamil Nadu government to honour Ilaiyaraaja, Kamal Haasan-Rajinikanth to attendAs Ilaiyaraaja completes 50 years in the industry, the Tamil Nadu government is all set to honour the King of Music. Kamal Haasan, Rajinikanth and several others are expected to attend the event.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/love-in-vietnam-review-scenic-beauty-fails-to-save-weak-romance-plot-2786219-2025-09-12",
      "headline": "Love in Vietnam review: Shantanu-Avneet's film can be passed off as a travelogueRelease Date:Fri Sep 12, 2025Love in Vietnam movie review: Shantanu Maheshwari and Avneet Kaur-starrer 'Love in Vietnam' attempts a cross-cultural romantic tale set in scenic Vietnam. Despite stunning visuals, the film struggles with weak storytelling and character depth."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kajol-twinkle-khanna-too-much-promo-chat-show-prime-video-september-2786200-2025-09-12",
      "headline": "Kajol, Twinkle Khanna say no to stale gossip and fake talks in Too Much promoActor Kajol and author Twinkle Khanna introduced their new chat show 'Too Much' as a break from boring and lifeless chat shows. The show, launching on Prime Video on September 25, will feature unscripted conversations with celebrity guests. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/anushka-shetty-announces-social-media-break-amid-ghaati-dull-box-office-run-2786242-2025-09-12",
      "headline": "Anushka Shetty announces social media break amid Ghaati's dull box office runActor Anushka Shetty announced a break from social media amid her latest release, 'Ghaati's lukewarm response at the box office. She shared a note and wrote about focusing on work beyond scrolling. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/trump-says-cops-have-caught-killer-of-ally-charlie-kirk-sent-him-to-custody-2786389-2025-09-12",
      "headline": "Charlie Kirk shooting suspect in custody, someone close turned him in: TrumpA suspect in the sniper killing of conservative activist Charlie Kirk at Utah Valley University has been arrested after a nationwide manhunt, US President Donald Trump confirmed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-to-visit-manipur-tomorrow-first-visit-since-2022-violence-2786292-2025-09-12",
      "headline": "PM Modi to visit Manipur tomorrow, first time since 2023 violenceTwo years after ethnic clashes rocked Manipur, Prime Minister Narendra Modi is all set to visit the northeastern state to inaugurate development projects. The visit will pave the way for peace, normalcy, and growth in the state, said state Chief Secretary."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-roasted-state-sponsor-terrorism-united-nations-hillel-neuer-viral-video-2786293-2025-09-12",
      "headline": "Mic drop. Watch how lawyer destroyed Pakistan in 4 seconds at UNPakistan was called a state sponsor of terror by Hillel Neuer, a human rights lawyer, while the UN was discussing the recent Israeli attack in Qatar targeting Hamas leaders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-india-middle-class-us-oil-petroleum-russia-war-criticism-eyewash-2786393-2025-09-12",
      "headline": "Trump wants India's middle class to buy his oil. Russian bogey is an eyewashTrump's India envoy pick, Sergio Gor, said the US wanted India to open its market to exports of American oil and petroleum products. It suggests that Trump means business and only business."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/how-last-hindu-kingdom-fell-to-a-violent-maoist-movement-nepal-gen-z-protests-pm-kp-oli-resignation-2786269-2025-09-12",
      "headline": "How the last Hindu kingdom fell to a violent Maoist movementAfter Gen Z–led protests toppled the Oli government, Nepal once again finds itself in the grip of political turmoil and violence. Just over 15 years ago, Nepal, once the world's last Hindu kingdom, where monarchs were revered as living deities, was transformed by a Maoist-led uprising."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/sunjay-kapur-inheritance-case-delhi-high-court-lawyers-heated-exchange-2786263-2025-09-12",
      "headline": "Get a taste of your own medicine: Top lawyers clash in Sunjay Kapur assets caseKarisma Kapur's children, Samaira and Kiaan, have filed a lawsuit seeking a share in their late father, Sunjay Kapur's estate, while accusing his widow Priya Sachdeva of withholding documents and critical details about his will."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/dallas-motel-murder-case-suspect-used-machete-beheaded-victim-front-family-glbs-2785981-2025-09-11",
      "headline": "Chased, beheaded, dumped: Indian man killed in front of family at US motelThe accused used a machete to fatally attack 50-year-old Chandra Mouli Nagamallaiah after an argument at the motel in Dallas. The victim was killed in front of his wife and son."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-prime-minister-narendra-modi-upcoming-manipur-visit-vote-chori-main-issue-2786347-2025-09-12",
      "headline": "No big deal, vote chori main issue: Rahul Gandhi on PM's upcoming Manipur visitPM Modi is to visit Manipur on Saturday for the first time since the ethnic violence started in the state in 2023."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/gen-z-protestors-have-chosen-next-nepal-pm-via-vote-on-discord-what-is-discord-and-how-it-is-used-2786279-2025-09-12",
      "headline": "Gen Z protestors pick Nepal's next PM via Discord, what is DiscordNepal's anti-corruption protests led by Gen Z activists toppled the KP Sharma Oli government. Now, Gen Z is using the US-based social media app Discord to decide on the country's next leader."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/russia-says-peace-talks-with-ukraine-are-paused-accuses-europe-of-hindering-them-news-agency-reuters-2786348-2025-09-12",
      "headline": "Russia pauses peace talks with Ukraine, accuses Europe of obstructionRussia said peace talks with Ukraine are on pause, blaming Europe for obstruction, while Putin signalled willingness for dialogue but warned of using force if needed."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/nepal-protest-live-updates-interim-government-gen-z-trend-social-media-ban-news-2786037-2025-09-12",
      "headline": "Live: Kulman Ghising, Harka Sampang's supporters protest outside President's officeNepal Gen Z Protest Live: As Nepal slowly returns to normalcy, after days of violent protests led by Gen Z, the discussions about who will take charge of the nation have taken the centre stage. With the Nepal Army having imposed nationwide restrictions, names such as former Chief Justice Sushila Karki, Kathmandu Mayor Balendra Shah, and former electricity board CEO Kulman Ghising are reportedly being considered to lead an interim government. \r\nIndia Today's Pankaj Das, Amit Bharadwaj and Rohit Singh are reporting from ground zero. Stay tuned to IndiaToday.in"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shashi-tharoor-criticises-trump-us-tariffs-impact-indian-exports-jobs-2786341-2025-09-12",
      "headline": "Unusual president, US tariffs costing jobs: Shashi Tharoor slams TrumpShashi Tharoor has denounced President Trump's conduct as 'unusual' and 'mercurial', highlighting the severe impact of US tariffs on Indian exports and employment. The Congress leader urged India to diversify its export markets to reduce vulnerability."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/delhi-high-court-removes-mandhira-kapur-from-sunjay-kapur-asset-case-2786261-2025-09-12",
      "headline": "Sunjay Kapur's sister tried 'backdoor entry' into assets case, his wife tells courtThe Delhi High Court rectified its records to remove Mandhira Kapur, sister of late industrialist Sunjay Kapur, from ongoing proceedings over his Rs 30,000-crore estate. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/talking-points/story/iphone-17-buying-guide-17-pro-to-iphone-air-which-one-should-you-get-2786192-2025-09-12",
      "headline": "iPhone 17 Buying Guide: 17 Pro to iPhone Air, which one should you get?Like every other year, we again have four new iPhones — the iPhone 17, the iPhone 17 Pro, the iPhone Air and the iPhone 17 Pro Max. But unlike previous years, this time choosing between one over another is not easy because each seems to be meant for a specific set of users. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/immersive/from-pond-to-plate-the-journey-of-indias-global-superfood",
      "headline": "Bihar's Makhana: From Pond to Plate, the Journey of India's Global SuperfoodMakhana (Foxnut or Gorgon Nut), cultivated across Mithilanchal and Seemanchal regions of Bihar, has emerged as India's most valued superfood. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/nepal-gen-z-protests-uneasy-calm-sushila-karki-kul-man-ghising-interim-prime-minister-2786124-2025-09-12",
      "headline": "Indian woman among 51 dead in Nepal unrest; Sushila Karki likely interim PM Live UpdatesAfter days of violent anti-corruption protests led by Nepalese youth that have left over 34 dead, an uneasy calm prevailed in Nepal on Friday. Today, all eyes will be on a key meeting on the formation of an interim government.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/butterfly-shaped-coronal-hole-solar-wind-earth-geomagnetic-storms-2786309-2025-09-12",
      "headline": "5,00,000-km-wide butterfly-shaped hole pops up on the SunNasa's Solar Dynamics Observatory has photographed a massive butterfly-shaped coronal hole on the Sun. Solar wind from the hole is set to reach Earth by 14 September, possibly causing geomagnetic storms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/wheel-of-mumbai-bound-spicejet-flight-falls-off-during-take-off-aircraft-lands-safely-passengers-safe-2786353-2025-09-12",
      "headline": "Mumbai-bound SpiceJet flight lands safely after wheel falls off during takeoffThe dislodged outer wheel was later recovered by Kandla Airport authorities, sources told India Today TV. The pilot had declared an emergency before landing at Mumbai Airport."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rss-chief-mohan-bhagwat-veiled-jibe-us-over-trump-tariffs-people-afraid-of-indias-growth-2786332-2025-09-12",
      "headline": "People afraid of India's growth: Mohan Bhagwat's veiled dig at US over tariffsIndia has termed US tariffs \"unfair, unjustified and unreasonable\", and stressed it wouldn't bow down to any pressure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/how-i-made-it/story/bihar-teen-adarsh-kumar-only-indian-finalist-for-global-student-prize-2025-2785827-2025-09-12",
      "headline": "Bihar teen who left home at 14 is only Indian finalist for Global Student Prize 2025From leaving home at 14 in Champaran, Bihar, to serving as a Google Youth Advisor and mentoring global competitions, Adarsh Kumar has transformed his journey into one that builds opportunities for countless students through fellowships, startups, and grassroots change. He is now the only Indian finalist (chosen from over 11,000 candidates) in the Global Student Prize 2025, the 'student Nobel Prize' which comes with Rs 87 lakh ($100,000)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/priyanka-chopra-fashion-week-in-ralph-lauren-and-dior-nick-jonas-in-nyc-2786324-2025-09-12",
      "headline": "Priyanka Chopra's week in Ralph Lauren and Dior in NYCTwo days, two fashion houses, and Priyanka Chopra at the centre of it all, slaying every look. Read more here."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/uk-news/story/pakistani-doctor-left-surgery-midway-uk-have-sex-with-nurse-manchester-suhail-anjum-anaesthetist-lahore-medical-liverpool-2786268-2025-09-12",
      "headline": "Pakistani doctor left surgery midway in UK to have sex with nurseA Pakistani anaesthetist admitted to leaving a patient mid-surgery at Tameside General Hospital in the UK to engage in sexual activity with a nurse in a nearby operation theatre. The incident occurred in September 2023 and was taken to a medical tribunal in the UK this year. The doctor, Suhail Anjum, is now in Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/jugnuma-the-fable-review-manoj-bajpayees-film-is-magic-but-not-for-everyone-2786172-2025-09-12",
      "headline": "Jugnuma The Fable review: Manoj Bajpayee's film is magic, but not for everyoneRelease Date:Fri Sep 12, 2025Jugnuma The Fable review: Manoj Bajpayee and Deepak Dobriyal headline Raam Reddy's 'Jugnuma: The Fable', a slow-burn mystery that ties magic, realism, and metaphor. It lingers long after viewing, but its meditative pace may not appeal to everyone."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-india-ambassador-nominee-touts-warm-us-india-ties-sees-tariff-deal-soon-glbs-2785988-2025-09-12",
      "headline": "Trump's envoy pick cites India's middle class, says want New Delhi to buy our oilSergio Gor, a close Trump aide and director of the White House Presidential Personnel Office, said that despite recent disagreements over tariffs and India's purchases of Russian oil, the US-India relationship continues to be \"warm and strategically important.\""
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sourav-ganguly-has-great-cricketing-brain-will-beat-pressure-in-sa20-allan-donald-2786398-2025-09-12",
      "headline": "Sourav Ganguly has great cricketing brain, will beat pressure in SA20: Allan DonaldSourav Ganguly may face pressure in his first SA20 coaching stint, but legendary Allan Donald believes his \"fantastic cricket brain\" will help him navigate the tough moments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/matthew-hayden-to-walk-naked-if-joe-root-doesnt-score-century-ashes-2025-26-2786383-2025-09-12",
      "headline": "Will walk around naked if Joe Root doesn't score 100 in Ashes 2025-26: HaydenMatthew Hayden has vowed to walk naked around the MCG if Joe Root fails to score a century in the Ashes 2025-26. Root is yet to score a century in Australia, having played 27 Test innings in the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/aj-lee-return-nikki-bella-reunion-wwe-divas-era-rivalry-2786006-2025-09-12",
      "headline": "Nikki Bella teases reunion with AJ Lee after WWE return sparks nostalgiaAJ Lee's surprise return has ignited excitement across the WWE Universe, while Nikki Bella's hints at a possible reunion are stirring both nostalgia and fan anticipation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/jalen-green-overpaid-phoenix-suns-financial-gamble-kevin-durant-trade-2785423-2025-09-12",
      "headline": "New Suns guard Jalen Green named among NBA's most overpaid playersJalen Green has been labeled one of the NBA's most overpaid players after signing a $105.3 million deal with the Phoenix Suns, leaving the team to gamble on his development alongside Devin Booker."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/aryna-sabalenka-warns-nick-kyrgios-2026-battle-of-the-sexes-tennis-match-2786010-2025-09-12",
      "headline": "Aryna Sabalenka fires warning shot at Kyrgios ahead of Battle of the SexesAryna Sabalenka has issued a bold warning to Nick Kyrgios ahead of their much-anticipated \"Battle of the Sexes\" match in 2026. With unique rules and a fiery rivalry, the clash in Hong Kong promises to be both thrilling and fiercely competitive."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/aryna-sabalenka-balances-tennis-aggression-and-off-court-life-2786011-2025-09-12",
      "headline": "Aryna Sabalenka opens up about balance, grief, and life beyond the tennis courtAryna Sabalenka, in a recent podcast, reflected on her fiery playing style and lighthearted life away from tennis, stressing the importance of balance while embracing the glamour that comes with being a top athlete."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/umar-gul-praises-india-rotation-policy-jasprit-bumrah-fitness-2786350-2025-09-12",
      "headline": "Does Pakistan cricket follow a rotation policy for players? Ex-pacer lifts the lidUmar Gul has praised India's approach to managing Jasprit Bumrah, saying the rotation policy and focus on player fitness has had no effect on his performance. He contrasted this with Pakistan, where pressure on injured players and lack of rotation often harms key bowlers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/jason-collins-nba-veteran-brain-tumour-treatment-support-2786002-2025-09-12",
      "headline": "NBA trailblazer Jason Collins undergoing treatment for brain tumorJason Collins, former NBA player, is undergoing treatment for a brain tumour. His family has asked for prayers and privacy as they focus on his health."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/e-sports/story/bgms-season-4-finalists-announced-8bit-esports-miss-finals-due-to-illness-2786025-2025-09-12",
      "headline": "Illness knocks out 8Bit, as top 16 teams make it to BGMS Season 4 finalsThe top 16 teams for BGMS Season 4 finals have been confirmed after intense semifinals. Illnesses and injuries have notably impacted key teams, altering the competition landscape."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/punjab-kings-omit-pakistan-logo-asia-cup-2025-india-clash-2786329-2025-09-12",
      "headline": "Punjab Kings' social media post before India vs Pakistan goes viralPunjab Kings drew attention for posting an Asia Cup 2025 promo for India vs Pakistan that omitted Pakistan's name and logo ahead of their clash in Dubai. India, meanwhile, started their campaign with a win over the UAE, topping Group A with a +10.483 net run rate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dewald-brevis-highest-t20i-score-south-africa-fearless-batting-ab-de-villiers-comparison-2786304-2025-09-12",
      "headline": "Dewald Brevis mirrors AB de Villiers, can do what most batters can't: Allan DonaldAllan Donald hailed Dewald Brevis as South Africa's next big batting star, praising his fearless strokeplay and record-breaking hundred against Australia while noting similarities with AB de Villiers. With over 2,500 T20 runs, IPL success, and a record SA20 price, Brevis is seen as a potential limited-overs superstar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/umar-gul-praises-india-rotation-policy-jasprit-bumrah-fitness-2786350-2025-09-12",
      "headline": "Does Pakistan cricket follow a rotation policy for players? Ex-pacer lifts the lidUmar Gul has praised India's approach to managing Jasprit Bumrah, saying the rotation policy and focus on player fitness has had no effect on his performance. He contrasted this with Pakistan, where pressure on injured players and lack of rotation often harms key bowlers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/jason-collins-nba-veteran-brain-tumour-treatment-support-2786002-2025-09-12",
      "headline": "NBA trailblazer Jason Collins undergoing treatment for brain tumorJason Collins, former NBA player, is undergoing treatment for a brain tumour. His family has asked for prayers and privacy as they focus on his health."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/e-sports/story/bgms-season-4-finalists-announced-8bit-esports-miss-finals-due-to-illness-2786025-2025-09-12",
      "headline": "Illness knocks out 8Bit, as top 16 teams make it to BGMS Season 4 finalsThe top 16 teams for BGMS Season 4 finals have been confirmed after intense semifinals. Illnesses and injuries have notably impacted key teams, altering the competition landscape."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/punjab-kings-omit-pakistan-logo-asia-cup-2025-india-clash-2786329-2025-09-12",
      "headline": "Punjab Kings' social media post before India vs Pakistan goes viralPunjab Kings drew attention for posting an Asia Cup 2025 promo for India vs Pakistan that omitted Pakistan's name and logo ahead of their clash in Dubai. India, meanwhile, started their campaign with a win over the UAE, topping Group A with a +10.483 net run rate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dewald-brevis-highest-t20i-score-south-africa-fearless-batting-ab-de-villiers-comparison-2786304-2025-09-12",
      "headline": "Dewald Brevis mirrors AB de Villiers, can do what most batters can't: Allan DonaldAllan Donald hailed Dewald Brevis as South Africa's next big batting star, praising his fearless strokeplay and record-breaking hundred against Australia while noting similarities with AB de Villiers. With over 2,500 T20 runs, IPL success, and a record SA20 price, Brevis is seen as a potential limited-overs superstar."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}