{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filed-the-wrong-itr-form-penalties-missed-refunds-and-what-to-do-next-2746644-2025-06-26",
      "headline": "Filed the wrong ITR form? Penalties, missed refunds and what to do nextWhether you're a salaried professional, freelancer, or a business owner, choosing the right ITR (Income Tax Return) form is important. Getting it wrong might mean missed refunds, penalties, or worse, your return being treated as invalid."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-2025-high-sensex-ends-1000-points-higher-nifty-above-25500-tata-steel-gains-3-percent-2746581-2025-06-26",
      "headline": "Sensex ends 1,000 points higher, Nifty above 25,500; Tata Steel gains 3%The S&P BSE Sensex jumped 1,000.36 points to end at 83,755.87, while the NSE Nifty50 gained 304.25 points to close at 25,549.00. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/from-phones-to-partners-8-money-lessons-to-learn-before-30-2746518-2025-06-26",
      "headline": "From phones to partners: 8 money lessons to learn before 30Managing money isn't just about making budgets, it's about making better choices, every single day. CA Nitin Kaushik shares eight crucial money lessons that everyone should grasp by the age of 30."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/saving-money-ppf-nsc-rate-cut-government-review-june-30-investors-tip-2746530-2025-06-26",
      "headline": "Are your savings at risk? Government may slash PPF, NSC rates next weekSo far this year, interest rates for schemes such as Sukanya Samriddhi Yojana (SSY), Senior Citizens Savings Scheme (SCSS), and Post Office term deposits have remained unchanged. However, this may not continue in the next quarter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/housing-sales-india-quarter-2025-trends-high-prices-buyers-wait-2746520-2025-06-26",
      "headline": "Housing sales drop 20% across top 7 cities in Q2 2025 as prices stay highA sluggish Q2 masked early signs of recovery in India's housing market, with rising prices, cautious buyers, and skewed supply dampening sales—but softening rates and easing tensions may turn the tide.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/hiding-income-or-making-wrong-claims-your-itr-could-attract-a-200-percent-penalty-2746447-2025-06-26",
      "headline": "Hiding income or making wrong claims? Your ITR could attract a 200% penaltyThe recent changes in Income Tax Return (ITR) regulations highlight stricter penalties for incorrect filings, including a potential 200% penalty on false claims."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/affordable-housing-crisis-india-sharp-decline-rising-property-costs-2746134-2025-06-26",
      "headline": "Roti, kapda, but no makaan? The disappearing dream of affordable housingAffordable housing is vanishing from India's cities, and the crisis runs deeper than shrinking supply. In this deep dive, we explore how rising costs, fading supply, and policy gaps are shutting the door on millions chasing the ownership dream."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-expensive-a-house-should-you-buy-investment-banker-shares-these-6-rules-2746421-2025-06-26",
      "headline": "How expensive a house should you buy? Investment banker shares these 6 rulesAn investment banker lays down six clear, conservative rules for home buying to help first-time buyers avoid the trap of overleveraged homeownership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/received-form-16-do-not-file-your-itr-without-checking-these-points-2746414-2025-06-26",
      "headline": "Received Form 16? Don't file your ITR without checking these pointsForm 16 is a certificate your employer gives you every year. It shows how much salary you earned in the financial year and how much tax was deducted from it. This tax is called TDS (Tax Deducted at Source)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/world-most-valuable-company-nvidia-market-cap-ai-chip-maker-share-price-microsoft-apple-tesla-us-aramco-2746366-2025-06-26",
      "headline": "Nvidia overtakes Microsoft as world's most valuable company after 4% surgeNvidia's shares touched a new record high of $154.10, after climbing 4.33% during the trading session. This rally followed a positive report from Loop Capital, which raised its price target for Nvidia from $175 to $250. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-rally-dalal-street-optimism-israel-iran-ceasefire-domestic-factors-stock-market-rising-today-2746359-2025-06-26",
      "headline": "Sensex rises over 500 points, crosses 83,000: Why is stock market rising today?By 9:59 am, the Sensex had gained 549 points to touch 83,305.06, while the Nifty rose by 172.75 points to 25,417.50. The mood across the broader market was upbeat, and volatility remained surprisingly muted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-bitcoin-reserve-signals-a-shift-an-opening-for-india-2746346-2025-06-26",
      "headline": "US Bitcoin Reserve signals a shift: An opening for IndiaIndia stands at a pivotal juncture. A measured Bitcoin strategy—perhaps a reserve pilot—could strengthen economic resilience and project modernity. As the US advances and nations like Bhutan adapt, India has a unique opportunity to lead."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anshula-kapoor-wishes-brother-arjun-kapoor-on-birthday-appreciates-quiet-love-2746682-2025-06-26",
      "headline": "Anshula wishes hope for brother Arjun Kapoor on birthday, appreciates his quiet loveSocial media influencer Anshula Kapoor wished Bollywood actor Arjun Kapoor on the occasion of his birthday on June 26. She appreciated his quiet love in a post on Instagram. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/exclusive-kajol-calls-alia-bhatt-the-most-promising-star-of-new-generation-2746687-2025-06-26",
      "headline": "Exclusive: Kajol calls Alia Bhatt the most promising star of new generation'Maa' actor Kajol commented on the way Gen-Z actors work in the film industry. In an exclusive interview with us, she also appreciated Alia Bhatt for proving her mettle in Bollywood. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sonakshi-sinha-nikita-roy-release-postponed-to-now-hit-theatres-in-july-2746679-2025-06-26",
      "headline": "Sonakshi Sinha's Nikita Roy release postponed to avoid screen battle'Nikita Roy', an upcoming Bollywood film starring Sonakshi Sinha, was scheduled to release on June 27. The release has now been postponed, due to \"battle of screens\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rupali-ganguly-on-fire-incident-at-anupamaa-sets-2746636-2025-06-26",
      "headline": "From ashes, we'll rebuild: Rupali Ganguly on Anupamaa set fireTV actor Rupali Ganguly issued a statement about the fire incident on the sets of her show 'Anupamaa.' In her statement, she thanked everyone for their prayers and extended solidarity to show producer Rajan Shahi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ashok-pathak-panchayat-season-4-binod-rise-from-background-to-breakout-2746517-2025-06-26",
      "headline": "Ashok Pathak decodes his viral breakthrough as Binod in PanchayatActor Ashok Pathak's role as Binod in the popular series 'Panchayat Season 4' has been nothing short of impressive. From his innocent expressions to the powerful climax scene, the actor gives us every reason to rate him among the standout performers of the season.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/aishwarya-sharma-on-separation-rumours-with-neil-bhatt-my-life-is-not-your-content-2746606-2025-06-26",
      "headline": "My life is not your content: Aishwarya Sharma on separation rumours with Neil BhattActor Aishwarya Sharma has strongly reacted to separation reports with Neil Bhatt. Aishwarya slammed the social media gossip around her personal life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kapil-sharma-show-turns-into-a-musical-as-metro-in-dino-cast-joins-the-fun-2746602-2025-06-26",
      "headline": "Kapil Sharma's show turns into a musical as Metro In Dino cast joins the funThe cast of 'Metro...In Dino' joined the fun on 'The Great Indian Kapil Show'. The episode will premiere on Netflix on June 28. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/manoj-manchu-kannappa-team-note-omits-brother-vishnu-family-feud-2746596-2025-06-26",
      "headline": "Actor Manoj Manchu wishes Kannappa team, omits Vishnu's name amid family feudActor Manoj Manchu wished his father, Mohan Babu, and the team of 'Kannappa', ahead of the film's release. However, he did not mention his brother Vishnu's name in the note, which came amid their family feud."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/why-american-films-and-shows-often-cast-indians-as-villains-eastern-antagonism-2745967-2025-06-26",
      "headline": "Eastern antagonism: Why American films and shows often cast Indians as villainsPriyanka Chopra, Ali Fazal and Naseeruddhn Shah are among the Indian actors who have acted in Hollywood. However, American cinema and shows are yet to break away with the colonial biases and exotic stereotypes around Indian characters. Here's a glimpse at the archetypes around South Asians, particularly Indians, in Western storytelling."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/guru-randhawa-slams-diljit-dosanjh-amid-sardaar-ji-3-row-be-proud-of-where-you-were-born-2746576-2025-06-26",
      "headline": "Guru Randhawa slams Diljit Dosanjh amid row: Be proud of where you were bornSinger Guru Randhawa called out Diljit Dosanjh amid the ongoing controversy surrounding his upcoming film Sardaar Ji 3. As calls to ban the film grow, Randhawa shared a post, seen as a dig at Dosanjh, urging him to be proud of the country he was born in.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actor-sreeleela-exits-akhil-akkineni-lenin-citing-date-conflicts-reports-2746436-2025-06-26",
      "headline": "Actor Sreeleela exits Akhil Akkineni's Lenin citing date conflicts: ReportsActor Sreeleela has quit 'Lenin' due to date conflicts after shooting some scenes. The unexpected exit could potentially delay the film's progress till a suitable replacement for the actor is finalised.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/tamil-actor-krishna-peddler-kevin-arrested-in-drug-case-2746559-2025-06-26",
      "headline": "Tamil actor Krishna among two arrested in drug caseTamil actor Krishna has been arrested following questioning in the ongoing drug abuse investigation in Tamil Nadu. Earlier, actor Srikanth was also taken into custody by the Chennai police under the Narcotic Drugs and Psychotropic Substances (NDPS) Act."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/rakhi-sawant-congratulates-hania-aamir-appreciates-diljit-dosanjh-for-sardaar-ji-3-2746510-2025-06-26",
      "headline": "Rakhi Sawant congratulates 'Hania Ameer', appreciates Diljit Dosanjh for Sardaar Ji 3Reality TV star Rakhi Sawant extended support to Pakistani actor Hania Aamir amid a raging controversy over her film 'Sardaar Ji 3.' Rakhi, not only congratulated Hania, who she referred to as 'Hania Ameer', on her Bollywood debut but also urged everyone to watch the film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/malaika-arora-wishes-ex-arjun-kapoor-with-a-white-heart-on-his-birthday-watch-2746548-2025-06-26",
      "headline": "Malaika Arora wishes ex Arjun Kapoor with white heart on his birthday. WatchMalaika Arora wished Arjun Kapoor, her ex-partner, on his 40th birthday. She shared an old Boomerang of the actor on her Instagram stories. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jr-ntr-preparation-mythological-film-lord-karthikeya-trivikram-srinivas-naga-vamsi-2746531-2025-06-26",
      "headline": "Jr NTR begins prep for mythological film on Lord Karthikeya, here's proofJr NTR and his family were seen at Mumbai's Kalina airport on Thurdsay ahead of 'War 2' promotions. He was seen holding a book on Lord Karthikeya aka Muruga, hinting at his preparation for his upcoming film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-j-hope-recruits-dancers-through-social-media-killin-it-girl-song-2746484-2025-06-26",
      "headline": "Did you know BTS J-Hope handpicked Killin' It Girl dancers via social media?In a recent video, it was revealed that BTS member J-Hope recruited the dancers through social media for his 'Killin' It Girl' music video. The music video was released on June 13. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ram-gopal-varma-announces-genelia-dsouza-will-scare-all-in-his-next-film-police-station-mein-bhoot-praises-sitaare-zameen-par-2746524-2025-06-26",
      "headline": "RGV announces sweet-innocent Genelia will scare all in his next, praises SitaareDirector Ram Gopal Varma appreciated Genelia D'Souza's 'delightful' performance in 'Sitaare Zamee Par', and announced that she will be playing a 'scary' role in his next, titled 'Police Station Mein Bhoot'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sean-diddy-combs-declines-to-testify-as-prosecutors-drop-multiple-charges-2746418-2025-06-26",
      "headline": "Sean Diddy Combs declines to testify as prosecutors drop multiple chargesRapper Sean \"Diddy\" Combs' federal trial is set for its closing argument on June 26. Prosecutors have dropped multiple allegations apart from charges of sex trafficking and racketeering."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/smita-patil-was-first-choice-but-rekha-was-perfect-umrao-jaan-muzaffar-ali-2746498-2025-06-26",
      "headline": "Smita Patil was my first choice, but Rekha was perfect as Umrao Jaan: Muzaffar AliFilmmaker Muzaffar Ali shares insights on casting Rekha over Smita Patil for 'Umrao Jaan'. The restored classic releases in cinemas, rekindling the timeless appeal and passion for cinema."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/shubhanshu-shukla-scripts-history-as-his-axiom-4-docks-at-international-space-station-2746590-2025-06-26",
      "headline": "Shubhanshu Shukla is first Indian on International Space Station Live UpdatesThe milestone marks a triumphant return for India to human spaceflight, coming 41 years after Rakesh Sharma's pioneering mission in 1984."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/axiom-4-mission-docking-live-updates-astronaut-shubhanshu-shukla-to-dock-with-iss-check-timing-live-coverage-2746400-2025-06-26",
      "headline": "LIVE: Ax-4 crew enters Space Station after 28-hour-long journey from EarthShubhanshu Shukla docks with ISS Live Updates: Indian astronaut Shubhanshu Shukla docked the Dragon spacecraft that he piloted with the International Space Station. The Ax-4 crew has been orbiting Earth since their launch from Florida a day before, as they look forward to spending 14 days on the ISS. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/owe-eternal-debt-pakistan-field-marshal-asim-munir-at-funeral-of-major-moiz-abbas-shah-who-captured-abhinandan-varthaman-balakot-india-pakistan-2746619-2025-06-26",
      "headline": "Owe eternal debt: Munir at funeral of Pak officer who captured Abhinandan VarthamanPakistan Army Chief Field Marshal Asim Munir attended the funeral of a Pakistani Major who was involved in the capture of Indian Air Force officer Abhinandan Varthaman in 2019. The 37-year-old was killed in a clash with Pakistani Taliban terrorists in Khyber Pakhtunkhwa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-needed-to-do-showmanship-khamenei-says-us-struck-irans-n-sites-but-couldnt-achieve-much-2746601-2025-06-26",
      "headline": "Iran won, heavy slap to US: Khamenei on attack on key American base in QatarOn June 21, the US got directly involved in the 12-day Israel-Iran conflict and bombed the Islamic Republic's key nuclear sites in Fordow, Natanz and Isfahan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/white-house-donald-trump-daddys-home-music-video-nato-summit-2746622-2025-06-26",
      "headline": "Daddy's home: White House plays on Trump's new nickname in Nato videoDonald Trump was jokingly called 'daddy' by Nato chief Mark Rutte while the US President was speaking to the media on the Israel-Iran ceasefire."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/zohran-mamdani-new-york-democrat-mayor-candidate-votes-whites-asians-blacks-2746578-2025-06-26",
      "headline": "Not only Asians, Whites also backed Zohran Mamdani despite racist attacksZohran Mamdani made history as the first Muslim nominee of the Democrats after former Governor Andrew Cuomo conceded the race on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-iran-war-ceasefire-is-it-truce-middle-east-us-trump-war-goals-bombing-nuclear-sites-intelligence-reports-2746537-2025-06-26",
      "headline": "Is it really truce in Middle East with Israel's unfulfilled war goals?Early intelligence reports indicate that Iran may still be capable of resuming its nuclear programme. Meanwhile, the Iranian Parliament has passed a bill to sever ties with the IAEA, removing international oversight of its nuclear ambitions, which could further provoke the West. This threatens the fragile Middle East truce, risking potential escalation in the near future."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/four-jaish-terrorists-trapped-in-jammu-and-kashmirs-udhampur-encounter-underway-2746494-2025-06-26",
      "headline": "Jaish terrorist being tracked for a year killed in gunfight in J&K's UdhampurThe gunfight broke out in Jammu and Kashmir's Udhampur district when security forces launched a search operation based on specific intelligence in the Basantgarh area this morning."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/zohram-mamdani-nyc-new-york-city-mayor-candidate-2020-old-viral-post-arya-rajendra-kerala-youngest-mayor-2746555-2025-06-26",
      "headline": "Who's Kerala's Arya Rajendran, cited by NYC's Mamdani in now-viral postZohran Mamdani, the son of Indian-American filmmaker Mira Nair, has emerged victorious in run for the New York City Mayor's post. In 2020, Mamdani shared a CPM Puducherry post on Arya Rajendran to talk about what the NYC Mayor should be like. Who's Rajendran, and what does the 5-year-old post signify?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/meril-launches-myclip-indias-first-transcatheter-edge-to-edge-repair-teer-system-for-treatment-of-severe-mitral-regurgitation-2745354-2025-06-24",
      "headline": "Meril Launches MyClip, India's First Transcatheter-Edge-to-Edge Repair (TEER) SystemThe launch of MyClip TEER System marks a transformative moment for structural heart therapy in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shashi-tharoor-congress-cryptic-post-message-rift-party-leadership-bird-message-2746575-2025-06-26",
      "headline": "Even free bird must watch skies: Congress jabs Shashi Tharoor after cryptic postThe rift between Shashi Tharoor and the Congress widened when party leader Manickam Tagore shared a 'birds' post in a veiled swipe at the Thiruvananthapuram MP, a day after he shared a cryptic post, saying, \"Don't ask permission to fly.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-wanted-terrorism-reflected-in-shanghai-summit-statement-one-particular-country-objected-government-2746624-2025-06-26",
      "headline": "One country objected to terror mention in Shanghai summit statement: GovernmentExternal Affairs spokesperson Randhir Jaiswal confirmed that no joint statement was issued during the Shanghai Cooperation Organisation summit in China as India wanted to reflect on terrorism but 'one particular country' objected."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/travel/story/rise-in-sports-tourism-wimbledon-2025-formula-1-uk-visa-india-2746586-2025-06-26",
      "headline": "Travellers are not just booking match tickets, they are getting passports tooThe world of travel has become more about elaborating on experiences. Now, there is a surge in fan-fuelled flight bookings as sports tourism is slowly driving a surge no one saw coming. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/air-india-black-box-data-extraction-process-started-memory-module-successfully-accessed-investigation-bureau-2746512-2025-06-26",
      "headline": "Black box data downloaded in Air India crash probe breakthroughThese efforts aim to reconstruct the sequence of events leading to the accident and identify contributing factors to enhance aviation safety and prevent future occurrences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/elderly-couple-dies-by-suicide-in-bengaluru-old-age-home-month-after-moving-in-2746434-2025-06-26",
      "headline": "Elderly couple dies by suicide in Bengaluru old age home month after moving inAn elderly couple in Bengaluru died by suicide at an old age home after being sent there by their son. Frequent domestic disputes reportedly led to their admission. Police have registered an Unnatural Death Report."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ashok-pathak-panchayat-season-4-binod-rise-from-background-to-breakout-2746517-2025-06-26",
      "headline": "Ashok Pathak decodes his viral breakthrough as Binod in PanchayatActor Ashok Pathak's role as Binod in the popular series 'Panchayat Season 4' has been nothing short of impressive. From his innocent expressions to the powerful climax scene, the actor gives us every reason to rate him among the standout performers of the season.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/telangana/story/woman-held-after-driving-car-on-telangana-railway-tracks-causing-train-services-delay-for-45-minutes-2746502-2025-06-26",
      "headline": "Video: Woman drives car on Telangana railway tracks, trains delayed by 45 minutesA woman drove her car on the railway tracks near Shankarpalli in Telangana delaying train services between Bengaluru and Hyderabad by nearly an hour, triggering safety concerns and police action."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bhopal-90-degree-rail-overbridge-chief-minister-admits-flaws-builders-action-2746661-2025-06-26",
      "headline": "Chief Minister admits to flaws in Bhopal's 90-degree bridge, vows actionThe 648-metre bridge in Madhya Pradesh's Aishbagh, built at a cost of Rs18 crore, features a sharp 90-degree turn. It has sparked a wave of memes and jokes on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/affordable-housing-crisis-india-sharp-decline-rising-property-costs-2746134-2025-06-26",
      "headline": "Roti, kapda, but no makaan? The disappearing dream of affordable housingAffordable housing is vanishing from India's cities, and the crisis runs deeper than shrinking supply. In this deep dive, we explore how rising costs, fading supply, and policy gaps are shutting the door on millions chasing the ownership dream."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/woman-uses-urine-as-eyewash-doctors-issue-strict-warning-2746532-2025-06-26",
      "headline": "Woman uses urine as eyewash: Doctors issue strict warningA viral social media video promoted using urine as an eye wash, alarming medical experts. Doctors caution that this practice can cause infections and permanent vision damage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diljit-dosanjh-reacts-to-criticism-of-speaking-only-about-punjab-not-india-says-cartier-stole-patiala-necklace-2746164-2025-06-26",
      "headline": "Diljit Dosanjh reacts to criticism of speaking only about Punjab, not IndiaDiljit Dosanjh got emotional while recalling how he represented Punjab at global events like the Met Gala, saying it was never about him but about showcasing his culture. He also addressed criticism for not speaking about India, stating, \"I am Punjabi, what can I say?\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/abhishek-manu-singhvi-dig-zohran-mamdani-new-york-democratic-primary-mayor-2746648-2025-06-26",
      "headline": "When Zohran Mamdani opens his mouth, Pak's PR takes off: Abhishek Singhvi's digSenior Congress leader Abhishek Manu Singhvi slammed Zohran Mamdani, an Indian-origin Democrat who won the New York mayoral primary, saying when \"he opens his mouth, Pakistan's PR takes the day off\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/shubhanshu-shuklas-namaskar-from-space-says-thrilled-to-be-here-2746413-2025-06-26",
      "headline": "Like baby learning to walk: Shubhanshu Shukla describes his space debut in callIn his first call from space, Shubhanshu Shukla said that this mission was 'a strong step forward for India's human space program and for the upcoming Gaganyaan mission.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/snake-oil-seller-to-communist-why-zohran-mamdani-mira-nair-son-facing-backlash-tsunami-democratic-primary-new-york-mayor-election-trump-2746442-2025-06-26",
      "headline": "Snake oil seller to 100% communist. Why Mamdani is facing backlash tsunamiZohran Mamdani is facing fierce backlash after his victory in New York's Democratic mayoral primary. Mamdani is the son of Indian-American filmmaker Mira Nair. Mamdani's critics include US President Donald Trump, New York City Mayor Eric Adams, as well as fellow Democrats."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-ajikya-rahane-suggests-new-role-for-shardul-thakur-2746678-2025-06-26",
      "headline": "ENG vs IND 2nd Test: Ex India captain suggests new role for Shardul ThakurFormer India vice-captain Ajinkya Rahane has suggested a new role for India all-rounder Shardul Thakur for the second Test against England in Birmingham. Thakur didn't have a memorable outing in the first Test in Leeds."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-first-test-ravindra-jadeja-performance-mark-butcher-headingley-2746672-2025-06-26",
      "headline": "Could not believe how poorly Jadeja bowled at Headingley: Ex-England batterFormer England batter Mark Butcher said he was baffled by Ravindra Jadeja's performance in the Headingley Test. Jadeja picked up just one wicket and conceded 172 runs across both innings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-test-squad-2024-jofra-archer-returns-second-test-india-2746642-2025-06-26",
      "headline": "Express pacer Jofra Archer back in England Test squad after four yearsEngland have named a 15-man squad for the second Test against India starting July 2 in Birmingham. Jofra Archer returns to the Test side after a four-year gap, boosting England's pace attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/liverpool-sign-milos-kerkez-four-year-deal-transfer-news-afc-bournemouth-2746638-2025-06-26",
      "headline": "Liverpool sign full-back Milos Kerkez from AFC Bournemouth on 5-year dealLiverpool have officially signed Hungarian left-back Milos Kerkez from Bournemouth for £40 million, securing one of the Premier League's most promising young defenders as part of Arne Slot's summer rebuild at Anfield."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-should-be-compared-with-virat-kohli-r-ashwin-2746615-2025-06-26",
      "headline": "Rishabh Pant should be compared with Virat Kohli: Ravichandran AshwinFormer India all-rounder Ravichandran Ashwin has said that Rishabh Pant should be compared to Virat Kohli, following his heroics in the first test against England at Headingley, Leeds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-city-ederson-exit-rumours-pep-guardiola-2746611-2025-06-26",
      "headline": "My future is at Manchester City, 99 percent of exit rumours is fake: EdersonManchester City goalkeeper Ederson has said that there is no truth in the exit rumours linked with him and his intention is to stay with the club. Ederson has been heavily linked with a move away from the club. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zim-vs-nz-vs-sa-tri-series-dewald-brevis-rassie-van-der-dussen-shukri-conrad-2746577-2025-06-26",
      "headline": "Dewald Brevis returns to T20I squad after two years for tri-series in ZimbabweAfter his heroics in the IPL 2025 season for CSK, Dewald Brevis has made a return to the South Africa squad for the tri-series against Zimbabwe and New Zealand. Brevis joined CSK as a replacement during the 2025 season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-mark-wood-jofra-archer-partnership-injury-return-2746563-2025-06-26",
      "headline": "ENG vs IND: Wood wants Archer linkup, but says duo won't get instant returnMark Wood said that he is eager to link up with Jofra Archer but admitted that the duo will take time to make a return to the England lineup. Archer and Wood are making a recovery from injury. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-2nd-test-siraj-new-role-r-ashwin-jasprit-bumrah-birmingham-2746540-2025-06-26",
      "headline": "Be a cushion to Bumrah: R Ashwin asks Siraj to take new role in 2nd TestRavichandran Ashwin has come out and suggested that Mohammed Siraj take up the holding role in India's bowling attack and curb his usual attacking style, which had resulted in poor returns in the first Test against England at Headingley."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-australia-1st-test-shamar-joseph-ian-healy-sledging-2746506-2025-06-26",
      "headline": "After Shamar Joseph runs through Australia, Healy responds to sledge at pacerAfter Shamar Joseph ran through the Australian top order on Day 1 of the first Test between West Indies and Australia, Ian Healy commented on his sledge aimed at the youg pacer. Healy said he made the comments at Shamar after the West Indies pacer sent a warning to Sam Konstas. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ecb-bcci-oppose-saudi-arabia-backed-t20-competition-2746486-2025-06-26",
      "headline": "England Cricket Board and BCCI join hands to scuttle ambitious Saudi T20: ReportThe England and Wales Cricket Board has joined forces with the Board of Control for Cricket in India in an attempt to thwart a new global Twenty20 league backed by Saudi Arabia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zim-vs-nz-vs-sa-tri-series-dewald-brevis-rassie-van-der-dussen-shukri-conrad-2746577-2025-06-26",
      "headline": "Dewald Brevis returns to T20I squad after two years for tri-series in ZimbabweAfter his heroics in the IPL 2025 season for CSK, Dewald Brevis has made a return to the South Africa squad for the tri-series against Zimbabwe and New Zealand. Brevis joined CSK as a replacement during the 2025 season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-mark-wood-jofra-archer-partnership-injury-return-2746563-2025-06-26",
      "headline": "ENG vs IND: Wood wants Archer linkup, but says duo won't get instant returnMark Wood said that he is eager to link up with Jofra Archer but admitted that the duo will take time to make a return to the England lineup. Archer and Wood are making a recovery from injury. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-2nd-test-siraj-new-role-r-ashwin-jasprit-bumrah-birmingham-2746540-2025-06-26",
      "headline": "Be a cushion to Bumrah: R Ashwin asks Siraj to take new role in 2nd TestRavichandran Ashwin has come out and suggested that Mohammed Siraj take up the holding role in India's bowling attack and curb his usual attacking style, which had resulted in poor returns in the first Test against England at Headingley."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-australia-1st-test-shamar-joseph-ian-healy-sledging-2746506-2025-06-26",
      "headline": "After Shamar Joseph runs through Australia, Healy responds to sledge at pacerAfter Shamar Joseph ran through the Australian top order on Day 1 of the first Test between West Indies and Australia, Ian Healy commented on his sledge aimed at the youg pacer. Healy said he made the comments at Shamar after the West Indies pacer sent a warning to Sam Konstas. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ecb-bcci-oppose-saudi-arabia-backed-t20-competition-2746486-2025-06-26",
      "headline": "England Cricket Board and BCCI join hands to scuttle ambitious Saudi T20: ReportThe England and Wales Cricket Board has joined forces with the Board of Control for Cricket in India in an attempt to thwart a new global Twenty20 league backed by Saudi Arabia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-ind-tickets-sold-out-sydney-odi-canberra-t20i-2746457-2025-06-26",
      "headline": "AUS vs IND: Tickets for Sydney ODI and Canberra T20I sold out in two weeksCricket Australia has announced that tickets for two matches in India's white-ball tour this November were snapped up within just two weeks of going on sale.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-india-november-19-revenge-australia-t20-world-cup-2024-2746469-2025-06-26",
      "headline": "Rohit reveals India wanted November 19 revenge on Australia in T20 World CupRohit Sharma revealed that the Indian team wanted to take revenge on Australia during the T20 World Cup 2024 after they were beaten by the Aussies in the final of the ODI World Cup 2023 in Ahmedabad on November 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-jasprit-bumrah-workload-gautam-gambhir-aakash-chopra-2746422-2025-06-26",
      "headline": "Why was Bumrah's participation not kept a secret? Aakash Chopra questions callAakash Chopra questioned why the Indian team management made Jasprit Bumrah's participation in the England series public. Bumrah is expected to play just three Tests against England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-sports-hernia-surgery-recovery-rehab-captain-india-2746393-2025-06-26",
      "headline": "Suryakumar Yadav undergoes successful sports hernia surgery in GermanyIndia's T20I captain Suryakumar Yadav has undergone successful surgery for a sports hernia in his lower right abdomen, performed in Munich, Germany. He is expected to begin rehabilitation soon and lead India in upcoming T20I matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-jannik-sinner-new-big-three-wimbledon-john-mcenroe-2746382-2025-06-26",
      "headline": "Who could join Carlos Alcaraz, Jannik Sinner in new Big Three? John McEnroe revealsAmerican tennis legend John McEnroe has called for the emergence of a third standout player to join Carlos Alcaraz and Jannik Sinner in forming a new Big Three. He believes that a strong third contender would raise the level of competition and named three rising stars as potential candidates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/muaythai-athletes-bhavjot-kohli-shubham-nishad-bronze-senior-asian-muaythai-championship-2746374-2025-06-26",
      "headline": "Chhattisgarh Muaythai athletes Bhavjot and Shubham win bronze in AsiaYoung Muaythai talents from Chhattisgarh, Bhavjot Singh Kohli and Shubham Kumar Nishad, have made the state proud by winning bronze medals for India at the Senior Asian Muaythai Championship held in Vietnam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-ben-duckett-ollie-pope-outsmart-jasprit-bumrah-leeds-test-2746365-2025-06-26",
      "headline": "How Ben Duckett and Ollie Pope neutralised Jasprit Bumrah in 1st TestEngland vs India, 1st Test: Ben Duckett played a fantastic innings in Leeds to hand England a 1-0 lead in the 5-match Test series. Duckett's handling of Bumrah might turn out to be crucial in this Test series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-ab-de-villiers-praise-rishabh-pant-twin-hundred-2746356-2025-06-26",
      "headline": "AB de Villiers gives honest verdict on Rishabh Pant's batting mindsetAB de Villiers shared his honest take on Rishabh Pant's fearless batting in the first Test against England at Leeds. Pant scored 134 and 118 in a losing cause, but his aggressive approach and twin tons helped him break a few batting records."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-jannik-sinner-new-big-three-wimbledon-john-mcenroe-2746382-2025-06-26",
      "headline": "Who could join Carlos Alcaraz, Jannik Sinner in new Big Three? John McEnroe revealsAmerican tennis legend John McEnroe has called for the emergence of a third standout player to join Carlos Alcaraz and Jannik Sinner in forming a new Big Three. He believes that a strong third contender would raise the level of competition and named three rising stars as potential candidates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/muaythai-athletes-bhavjot-kohli-shubham-nishad-bronze-senior-asian-muaythai-championship-2746374-2025-06-26",
      "headline": "Chhattisgarh Muaythai athletes Bhavjot and Shubham win bronze in AsiaYoung Muaythai talents from Chhattisgarh, Bhavjot Singh Kohli and Shubham Kumar Nishad, have made the state proud by winning bronze medals for India at the Senior Asian Muaythai Championship held in Vietnam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-ben-duckett-ollie-pope-outsmart-jasprit-bumrah-leeds-test-2746365-2025-06-26",
      "headline": "How Ben Duckett and Ollie Pope neutralised Jasprit Bumrah in 1st TestEngland vs India, 1st Test: Ben Duckett played a fantastic innings in Leeds to hand England a 1-0 lead in the 5-match Test series. Duckett's handling of Bumrah might turn out to be crucial in this Test series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-ab-de-villiers-praise-rishabh-pant-twin-hundred-2746356-2025-06-26",
      "headline": "AB de Villiers gives honest verdict on Rishabh Pant's batting mindsetAB de Villiers shared his honest take on Rishabh Pant's fearless batting in the first Test against England at Leeds. Pant scored 134 and 118 in a losing cause, but his aggressive approach and twin tons helped him break a few batting records."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/club-world-cup-inter-monterrey-through-to-round-of-16-bvb-win-jobe-bellingham-assist-2746334-2025-06-26",
      "headline": "Club World Cup: Inter, Monterrey through to Round of 16, BVB winInter, Monterrey and Borussia Dortmund have secured their spots in the Round of 16 stages of the FIFA Club World Cup after their respective wins in the final group-stage watch. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-1st-test-shubman-gill-captaincy-greg-chappell-2746312-2025-06-26",
      "headline": "Shubman Gill will only get better as Test captain: Chappell backs India skipperGreg Chappell has thrown his support behind Shubman Gill, saying the young opener showed encouraging signs in his first outing as India's Test captain. Despite the five-wicket defeat to England in Leeds, Chappell believes Gill has the temperament to evolve into a strong leader in the longest format."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/michael-vaughan-warns-india-after-england-record-chase-headingley-2746297-2025-06-26",
      "headline": "Michael Vaughan taunts Wasim Jaffer, predicts 4-0 England sweepFormer England captain Michael Vaughan, known for his spirited banter with former Indian opener Wasim Jaffer on X (formerly Twitter), didn't miss the chance to take a dig after India's five-wicket defeat in the first Test at Headingley. Seizing the moment, Vaughan not only poked fun at Jaffer but also revised his series prediction, calling for a 4-0 win in England's favour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-first-test-shubman-gill-gautam-gambhir-transition-dropped-catches-2746168-2025-06-26",
      "headline": "Transition no excuse, India needs to take World Test Championship seriouslyEngland vs India: India are a team in transition, and the Headingley Test can be seen as a minor blip in their journey as a side. However, transition cannot be used as an excuse for the poor display at vital moments in a game that India could have easily won."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-australia-1st-test-day-1-report-seales-shamar-2746284-2025-06-26",
      "headline": "Seales, Shamar shine against Australia on 14-wicket opening dayJayden Seales and Shamar Joseph evoked memories of West Indies' legendary pace attacks, dismantling Australia for just 180 on a lively Kensington Oval pitch on day one of the first Test. Australia hit back through Mitchell Starc, Pat Cummins, and Josh Hazlewood, who shared four wickets to leave West Indies struggling at 57 for four at stumps."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/murali-kartik-on-shubman-gills-captaincy-eng-vs-ind-leeds-2746250-2025-06-26",
      "headline": "Gill lacked authority in Leeds, claims former spinner: Had too many captainsFormer India spinner-turned commentator Murali Kartik feels Shubman Gill lacked authority as a leader during the first Test against England at Headingley, Leeds. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/greg-chappell-on-rishabh-pant-eng-vs-ind-headingley-leeds-2746234-2025-06-25",
      "headline": "Rishabh Pant is reinventing batsmanship, reminds of Gilchrist: Greg ChappellFormer Australia cricketer Greg Chappell has showered praise on India's wicketkeeper batter Rishabh Pant, saying that he's reinventing the game. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}