{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-nigeria-ties-key-to-shaping-a-stronger-global-south-2863702-2026-02-05",
      "headline": "India–Nigeria ties key to shaping a stronger global southBy working closely through diplomatic engagement, trade and cultural cooperation, Musawa believes that both nations can play a leading role in shaping a future where developing countries have a louder voice on the world stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/peace-partnerships-and-progress-top-agenda-for-caribbean-nations-2863669-2026-02-05",
      "headline": "Peace, partnerships and progress top agenda for Caribbean nationsSpeaking to India Today at the World Governments Summit, Wheatley and Mitchell highlighted the importance of peace, economic diversification and stronger global partnerships for Caribbean nations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-hovers-around-71000-hits-weakest-level-in-about-15-months-2863583-2026-02-05",
      "headline": "Bitcoin hovers around $71,000, hits weakest level in about 15 monthsBitcoin fell nearly 2% to around $71,000 on February 5, marking its weakest level in about 15 months. The world's largest cryptocurrency has now lost more than 42% from its October peak of $126,000 last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/world-govt-summit-2026-jose-ramos-horta-international-law-warning-2863587-2026-02-05",
      "headline": "Global conflicts expose decline of international law, says Timor-Leste president President of Timor-Leste José Ramos-Horta said the world is witnessing the steady breakdown of global systems that were created to protect peace, human rights, and fair international trade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-gulf-cooperation-council-agree-to-restart-talks-on-long-pending-free-trade-deal-2863520-2026-02-05",
      "headline": "India, Gulf Cooperation Council agree to restart talks on long-pending free trade dealThe move formally revives negotiations between India and the six-nation bloc after a long gap and signals a renewed push to deepen economic cooperation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-lower-down-eternal-it-metal-shares-down-ril-low-2863510-2026-02-05",
      "headline": "Sensex ends 504 points lower, Nifty below 25,700; Eternal down 2%The S&P BSE Sensex was down by 503.76 points to close at 83,313.93, while the NSE Nifty50 lost 133.20 points to end at 25,642.80. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/why-stock-market-falling-today-it-stocks-global-cues-profit-booking-sensex-down-500-points-nifty-red-2863499-2026-02-05",
      "headline": "Sensex down 500 points: Why is stock market falling today?At 2:30 PM, the S&P BSE Sensex was down 569.43 points at 83,248.26. The NSE Nifty50 also declined, falling 164.50 points to 25,611.50. Both benchmark indices were down by over half a percent, showing clear pressure across the market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ai-and-policy-are-redefining-digital-lifestyles-say-global-tech-leaders-2863480-2026-02-05",
      "headline": "AI and policy are redefining digital lifestyles, say global tech leadersAl Shamsi said telecom companies are no longer just service providers focused on speed and coverage. They are evolving into broader technology platforms that support consumer, enterprise and government services."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/a-system-upgrade-led-to-a-criminal-tax-notice-how-budget-2026-changes-that-2863440-2026-02-05",
      "headline": "A system upgrade led to a criminal tax notice. How Budget 2026 changes thatA routine system upgrade or staff reshuffle should not land a business in criminal trouble. Yet, under earlier tax rules, even genuine operational delays could trigger prosecution. Budget 2026 aims to fix this by easing penalties for procedural lapses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/regulator-cci-orders-probe-into-indigo-after-mass-flight-cancellations-interglobe-aviation-shares-down-2863443-2026-02-05",
      "headline": "Competition watchdog orders probe into IndiGo after mass flight cancellationsIn a 16-page order, the Competition Commission of India (CCI) said that IndiGo, which holds a dominant position in the domestic aviation market, may have abused its strength by cancelling a large number of flights."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/silver-etfs-sink-up-to-15-gold-etfs-remain-relatively-steady-2863421-2026-02-05",
      "headline": "Silver ETFs sink up to 15%, gold ETFs remain relatively steadySilver ETFs witnessed aggressive one-day selling, with losses ranging from over 10% to nearly 15% during morning trade. The fall was much steeper than what was seen in gold ETFs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/eu-india-fta-alcohol-industry-impact-domestic-liquor-makers-premium-spirits-2863379-2026-02-05",
      "headline": "A slow reset, not a shock: What the EU-India FTA means for liquor companiesThe EU-India FTA is not an immediate disruption to India's domestic alcohol industry but a calibrated strategic shift that will gradually reshape competition, pushing domestic producers to evolve through premiumisation, enforcement-backed regulation, and long-term adaptability rather than relying on tariff protection."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-400-points-it-stocks-down-today-investors-panic-or-not-ai-impact-dalal-street-2863368-2026-02-05",
      "headline": "Sensex falls 400 points: Are IT stocks down today, do investors need to panic?At around 10 am, the S&P BSE Sensex was down 448.57 points at 83,369.12. The NSE Nifty50 also slipped, falling 144.95 points to 25,631.05. The fall was close to half a percent, showing a clear pause after the recent rally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-it-stocks-metal-shares-tcs-infosys-indigo-2863348-2026-02-05",
      "headline": "Sensex, Nifty open lower amid IT stock worries; metal shares major laggardsThe S&P BSE Sensex was down by 225.69 points to 83,592.00, while the NSE Nifty50 lost 87.65 points to 25,688.35 as of 9:23 am. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-today-will-it-shares-fall-again-stock-market-opening-trading-setup-nse-bse-2863339-2026-02-05",
      "headline": "Sensex, Nifty today: Will IT shares fall again on stock markets?Gift Nifty futures were trading at 25,820 points at around 7:54 am. This suggests that the Nifty 50 may open above Wednesday's closing level of 25,776."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/we-want-to-double-our-stores-in-india-in-next-2-3-years-hugo-boss-ceo-2863263-2026-02-05",
      "headline": "We want to double our stores in India in next 2-3 years: Hugo Boss CEOIn an exclusive conversation with India Today, Hugo Boss CEO Daniel Grieder discusses the company's strategic focus on the Indian market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/arvind-panagariya-on-why-indias-trade-deals-with-us-eu-could-be-bigger-moment-than-1991-2863230-2026-02-04",
      "headline": "Arvind Panagariya on why India's trade deals with US, EU could be bigger moment than 1991In an exclusive interview with India Today, Dr. Arvind Panagariya, Chairman of the 16th Finance Commission and former Vice-Chairman of NITI Aayog, shares his thoughts on the landmark India-US trade deal and more. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-policies-to-ai-how-businesses-and-governments-can-deliver-at-scale-2863196-2026-02-04",
      "headline": "From policies to AI: How businesses and governments can deliver at scaleMohit Joshi and Kaan Terzioglu discussed the importance of long-term thinking, ethical practices, and digital solutions in building credibility with customers, governments, and societies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musk-becomes-worlds-first-person-with-800-billion-after-spacex-xai-deal-2863046-2026-02-04",
      "headline": "Elon Musk becomes world's first person with $800 billion after SpaceX-xAI dealMusk is now $578 billion richer than Google co-founder Larry Page, the world's second-wealthiest person, who is estimated to be worth $281 billion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/commodities/story/gold-jumps-nearly-4-silver-up-6-is-the-rally-set-to-continue-2863006-2026-02-04",
      "headline": "Gold jumps nearly 4%, silver up 6%: Is the rally set to continue?At the time of writing, gold was priced at Rs 1,58,858, up 3.28% or Rs 5,049. Silver showed an even stronger recovery, trading at Rs 2,83,395, higher by 5.74% or Rs 15,380."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/assi-actor-kani-kusruti-once-quit-acting-over-harassment-found-her-way-back-2863715-2026-02-05",
      "headline": "Assi actor Kani Kusruti once quit acting over harassment, found her way back Award-winning actor Kani Kusruti, who plays a rape survivor in the upcoming film Assi, had once quit acting after facing harassment. Assi, also starring Taapsee Pannu, is scheduled for a February 2026 release. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/netflix-ghooskhor-pandat-controversy-legal-notice-pandit-community-2863629-2026-02-05",
      "headline": "Explained: Why Manoj Bajpayee's Ghooskhor Pandat has landed in controversy Netflix's upcoming thriller Ghooskhor Pandat has landed in controversy over its title. A legal notice alleges the film defames the Pandit community, sparking a debate on creative freedom and cultural respect."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kangana-ranaut-shares-warm-moments-with-hema-malini-during-winter-session-in-parliament-2863677-2026-02-05",
      "headline": "Sansad mein sukoon: Kangana Ranaut shares Parliament selfies with Hema Malini Kangana Ranaut posted rare moments with veteran actor Hema Malini on social media as they spent time together in Parliament during the ongoing winter session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/at-animals-japan-premiere-ranbir-kapoor-says-he-was-scared-to-accept-vangas-film-2863675-2026-02-05",
      "headline": "At Animal's Japan premiere, Ranbir Kapoor says he was scared to accept Vanga's film Ranbir Kapoor and Sandeep Reddy Vanga spoke ahead of Animal's Japan premiere. The actor recalled his initial fear of taking on Ranvijay Singh, as he teased Animal Park, the sequel to the 2023 blockbuster."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/aap-rocky-has-the-best-response-to-student-asking-if-hes-married-to-rihanna-2863626-2026-02-05",
      "headline": "A$AP Rocky has the best response to student asking if he's married to Rihanna A$AP Rocky addressed a young student's question about his relationship with Rihanna while sharing insights into their musical family life and reflecting on his chart-topping album, highlighting strong family support."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rhea-chakraborty-on-comeback-with-family-business-didnt-expect-to-act-ever-again-2863507-2026-02-05",
      "headline": "Rhea Chakraborty on comeback with Family Business: Didn't expect to act ever again Actor Rhea Chakraborty opened up about her comeback with the new series Family Business. She reflected on her experience of returning to acting after a seven-year hiatus.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bipasha-basus-daughter-devi-melts-hearts-with-bedtime-prayer-watch-2863585-2026-02-05",
      "headline": "Bipasha Basu's daughter Devi melts hearts with bedtime prayer. Watch Bipasha Basu has posted videos on her social media, offering fans a look at her daughter Devi's celebrations and bedtime routine, including a recent clip of Devi saying a short prayer before sleeping."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/bhabiji-ghar-par-hain-fun-on-the-run-a-love-letter-to-fans-producer-vihaan-kohli-2863551-2026-02-05",
      "headline": "Bhabiji Ghar Par Hain! Fun on the Run, a love letter to fans: Producer Vihaan Kohli Producer Vihaan Kohli describes the upcoming film Bhabiji Ghar Par Hain: Fun on the Run as a heartfelt \"love letter\" to the show's loyal fans. In an interview with India Today, he discusses the legacy IP's transition to the big screen, navigating family-friendly comedy, and expanding the production's horizon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/blackpink-jisoo-and-seo-in-guk-boyfriend-on-demand-release-date-out-2863546-2026-02-05",
      "headline": "BLACKPINK'S Jisoo and Seo In-guk's Boyfriend on Demand release date out Netflix announced the premiere date for Boyfriend on Demand, starring Jisoo of BLACKPINK and Seo In-guk. The series explores modern romance through a virtual dating subscription."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/desi-bling-netflixs-dubai-bling-spin-off-draws-mixed-reactions-online-2863533-2026-02-05",
      "headline": "Desi Bling: Netflix's Dubai Bling spin-off draws mixed reactions online Netflix is launching Desi Bling, a luxury reality show showcasing the lavish lives of wealthy Indians in Dubai, but it has sparked mixed reactions online. While the show promises glamour and drama, many viewers have criticised its authenticity and casting choices, leading to a lively debate on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/richa-chadha-reacts-sharply-to-indian-origin-author-deepak-chopras-epstein-files-link-2863524-2026-02-05",
      "headline": "Richa Chadha reacts sharply to Indian-origin author Deepak Chopra's Epstein files link Richa Chadha commented on Deepak Chopra's apology after his name emerged in the new Epstein Files. The actor also referred to the other Deepak, who is going viral for confronting a mob, protecting a Muslim shopkeeper's store."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-coolie-film-review-soundarya-favourite-movies-baashha-thillu-mullu-2863484-2026-02-05",
      "headline": "Coolie not in Top 10 Rajinikanth films list for daughter Soundarya. Here's why Soundarya Rajinikanth, daughter of actor Rajinikanth and producer of the upcoming Tamil film With Love, gave her honest opinion on the 2025 film Coolie, during a recent interview. She spoke about not being throughly impressed by it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/suniel-shetty-questions-films-on-akbar-babur-history-should-be-about-our-culture-2863465-2026-02-05",
      "headline": "Suniel Shetty questions films on Akbar, Babur: History should be about our culture Suniel Shetty questioned films focussing on Akbar and Babur instead of Shivaji Maharaj and Rajput kings. He emphasised that history should be about \"our culture.\"\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/the-50-day-4-highlights-maxtern-threatens-to-slap-elvish-yadav-faces-consequences-2863479-2026-02-05",
      "headline": "The 50 Day 4 highlights: Maxtern threatens to slap Elvish, faces consequences YouTuber Maxtern threatened to slap Elvish Yadav on The 50, reigniting their long-running feud with explosive allegations. The tension turned physical when Elvish's friends confronted Maxtern and pushed him to the ground inside the house."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/relationship-goals-review-prime-video-rom-com-self-help-promotion-2863434-2026-02-05",
      "headline": "Relationship Goals review: A not-so-subtle sales pitch garbed as rom-comRelease Date:Wed Feb 04, 2026 Relationship Goals movie review: Prime Video's Relationship Goals mixes romance with overt self-help promotion. The film struggles to deliver genuine emotional impact amid heavy product placement, says our review. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/govinda-had-gun-in-hand-acted-in-self-defence-at-3-am-manager-on-violent-incident-2863469-2026-02-05",
      "headline": "Govinda had gun, acted in self-defence at 3 am: Manager recounts attack attempt Govinda's manager denied rumours linking the actor to any criminal or violent incident, saying he acted purely in self-defence. He revealed that the incident occurred late at night and involved unidentified individuals near the actor's residence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jana-nayagan-release-delayed-legal-issues-silambarasan-tr-supports-vijay-2863438-2026-02-05",
      "headline": "Actor Silambarasan stands by Vijay as Jana Nayagan release remains uncertain Actor Silambarasan TR has spoken out in support of Vijay, whose film Jana Nayagan remains delayed due to ongoing legal hurdles with the Cental Board of Film Certification (CBFC)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/adarsh-gourav-on-arijit-singh-playback-exit-i-am-sure-he-has-his-reasons-2863412-2026-02-05",
      "headline": "Adarsh Gourav on Arijit Singh's playback exit: I'm sure he has his reasons Actor Adarsh Gourav opened up about his admiration for singer Arijit Singh. In an interview with India Today, Gourav praised Arijit's decision to live life on his own terms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ram-charan-upasana-twins-discharge-hyderabad-hospital-2863435-2026-02-05",
      "headline": "Ram Charan and Upasana take their twins home from hospital. Video out Ram Charan and Upasana have brought their newborn twins home from a Hyderabad hospital. The family is set to celebrate the arrival, while Ram Charan's new film release faces a delay."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/how-can-nation-tolerate-traitor-remark-against-sikhs-pm-tears-into-rahul-gandhi-over-ravneet-bittu-remark-2863681-2026-02-05",
      "headline": "Congress loathes Sikhs: PM tears into Rahul Gandhi for calling Bittu a traitor Live UpdatesPrime Minister Narendra Modi hit out at Rahul Gandhi saying that the Congress leader's 'traitor' remark against Union Minister Ravneet Singh Bittu reflected arrogance at its peak and hatred towards Sikhs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-suryakumar-yadav-on-ind-vs-pak-controversy-2863528-2026-02-05",
      "headline": "Suryakumar Yadav breaks silence on Pakistan boycott threat: We are ready to playT20 World Cup: India's T20I captain, Suryakumar Yadav, remained firm that their plans do not change considering Pakistan's boycott of their group-stage clash. He said that they would prepare for the game regardless of Pakistan's stance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/opposition-walks-out-as-pm-modi-continues-rajya-sabha-speech-amid-let-lop-speak-slogans-2863611-2026-02-05",
      "headline": "Opposition walks out as PM speaks in Rajya Sabha amid 'Let LoP speak' slogansAmid the uproar created by the Opposition over Rahul Gandhi not being allowed to quote excerpts from ex-Army chief General MM Naravane's book, the Lok Sabha has been adjourned several times over the last three days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-china-talks-donald-trump-did-to-xi-jinping-what-he-did-to-narendra-modi-india-trade-deal-politics-2863423-2026-02-05",
      "headline": "Trump now does to Xi what he did to ModiA familiar pattern is emerging in US President Donald Trump's claims on social media after calls with leaders. Trump posted preemptively on his talks with Chinese President Xi Jinping like he did after a call with Indian PM Narendra Modi. The posts disregarded protocol and facts."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/govinda-had-gun-in-hand-acted-in-self-defence-at-3-am-manager-on-violent-incident-2863469-2026-02-05",
      "headline": "Govinda had gun, acted in self-defence at 3 am: Manager recounts attack attemptGovinda's manager denied rumours linking the actor to any criminal or violent incident, saying he acted purely in self-defence. He revealed that the incident occurred late at night and involved unidentified individuals near the actor's residence."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/can-india-really-stop-buying-oil-from-russia-us-trade-deal-donald-trump-narendra-modi-venezuelan-crude-america-brent-prices-2863472-2026-02-05",
      "headline": "Can India really stop buying oil from Russia?President Donald Trump claimed that India had vowed to stop buying oil from Russia. In recent years, Russia emerged as one of the key sources of crude for India. Here we analyse if it is feasible for India to end oil imports from Russia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/prime-minister-narendra-modi-rajya-sabha-speech-top-quotes-world-opening-up-india-role-in-global-welfare-2863661-2026-02-05",
      "headline": "World opening up for India, we are playing role in global welfare: PM's top quotesPrime Minister Narendra Modi addressed the Rajya Sabha on Thursday in reply to the Motion of Thanks to the Presidential address."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/salaam-cricket-t20-world-cup-sunil-gavaskar-suresh-raina-india-pakistan-2863468-2026-02-05",
      "headline": "Salaam Cricket Live: India have confidence of champions, says ChahalSalaam Cricket 2026, T20 World Cup: India spinner Yuzvendra Chahal has said that India will win all the matches of the T20 World Cup 2026 and successfully defend their title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-world-cup-2026-bangladesh-thanks-pakistan-asif-nazrul-shehbaz-sharif-politics-off-field-nexux-2863447-2026-02-05",
      "headline": "Thank you, Pakistan: Bangladesh reveals big cricket nexus against IndiaBangladesh's sports adviser Asif Nazrul thanked Pakistan for backing Dhaka's boycott of the T20 World Cup, after Islamabad decided to skip its match against India in Colombo. A day earlier, Pakistani PM Shehbaz Sharif publicly justified the move as standing \"completely\" with Bangladesh. This exposed how both governments made cricket a theatre of a political engagement against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shashi-tharoor-reaction-son-ishaan-washington-post-layoff-bizarre-move-worldview-newsletter-2863558-2026-02-05",
      "headline": "Shashi Tharoor shreds Washington Post over 'bizarre' move to lay off son IshaanShashi Tharoor slammed The Washington Post's decision to lay off his son Ishaan Tharoor, calling it a 'bizarre' and 'self-immolating' move despite his newsletter having over 500,000 subscribers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/prime-minister-narendra-modi-rajya-sabha-tmc-infiltrators-2863656-2026-02-05",
      "headline": "TMC doing their best to protect infiltrators: PM Modi in Rajya SabhaPM Modi took a dig at TMC while speaking in Rajya Sabha on Thursday, saying those trying to protect infiltrators are snatching away the rights of country's youth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/netflix-ghooskhor-pandat-controversy-legal-notice-pandit-community-2863629-2026-02-05",
      "headline": "Explained: Why Manoj Bajpayee's Ghooskhor Pandat has landed in controversyNetflix's upcoming thriller Ghooskhor Pandat has landed in controversy over its title. A legal notice alleges the film defames the Pandit community, sparking a debate on creative freedom and cultural respect."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/ishaan-tharoor-wapo-layoff-highlights-40s-layoffs-in-journalism-2863613-2026-02-05",
      "headline": "41 and vulnerable: What Ishaan Tharoor's WaPo layoff says about media careersIshaan Tharoor's layoff from The Washington Post has exposed a harsh truth about modern media careers. If a globally respected journalist with half a million subscribers can be cut at 41, what does that say about job security, age, and the future of newsroom work?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/i-advised-pm-to-not-come-to-lok-sabha-congress-mps-had-surrounded-his-chair-speaker-om-birla-2863503-2026-02-05",
      "headline": "Why Speaker advised PM to skip Lok Sabha speechLok Sabha Speaker Om Birla said he advised PM Narendra Modi not to attend the House amid Opposition-led chaos, calling the MPs' conduct a \"black spot\" in Parliament's history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/peace-partnerships-and-progress-top-agenda-for-caribbean-nations-2863669-2026-02-05",
      "headline": "Peace, partnerships and progress top agenda for Caribbean nationsSpeaking to India Today at the World Governments Summit, Wheatley and Mitchell highlighted the importance of peace, economic diversification and stronger global partnerships for Caribbean nations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/canadian-woman-forgets-airpods-on-flight-now-shes-tracking-them-around-the-world-2863601-2026-02-05",
      "headline": "Canadian woman forgets AirPods on flight. Now, she's tracking them around the worldClaire Hanna, who is a journalist by profession, shared her bizarre experience in a post on X, explaining that she had left her AirPods on an Air Canada flight from Toronto to Rome while travelling to cover the Milano Cortina 2026 Olympics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jewar-airport-when-farmers-became-crorepatis-overnight-then-lost-it-all-on-luxuries-ground-report-exclusive-2863473-2026-02-05",
      "headline": "Jewar airport: When farmers became crorepatis overnight, then lost it all on luxuriesFor generations, land was the farmers' only steady asset, producing food, income and security. Compensation replaced that asset with a lump sum, but this money came without financial planning support, guidance or long-term safeguards."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ghaziabad-sisters-suicide-korean-culture-indian-identity-father-2863452-2026-02-05",
      "headline": "They hated being called Indian: Father's claim in Ghaziabad girls' suicide caseIn an interview with India Today, Chetan Kumar, the father of the three girls who jumped to death from their Ghaziabad flat, claimed they had begun rejecting their Indian identity and wanted to settle in Korea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-united-states-secret-trade-deal-before-election-unelected-yunus-regime-garment-textile-sector-2862850-2026-02-05",
      "headline": "Yunus's rush to ink secretive deal with US has Bangladesh exporters worriedThe interim setup of Muhammad Yunus is set to sign a tariff deal with the US. However, the non-disclosure agreement that keeps details shrouded in mystery has got Bangladeshi business leaders concerned. Then there is a bigger question. Is it legal for the unelected Yunus regime to ink a deal even as an elected government could come to office in weeks time?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/indian-businessman-racial-slur-riyadh-exhibition-not-one-muslim-viral-video-online-outrage-2863319-2026-02-05",
      "headline": "Not one Muslim? Indian businessman comes under racial attack at Riyadh exhibitionIn the video, the man appears to mock the firm for its religious identity, sneering that it has \"not even one Muslim.\" The controversy gained traction after a UAE-based political analyst shared the video online, condemning the incident as \"blatant racism.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/nilgiris-forest-department-tamil-nadu-lantana-tribal-efforts-land-conservation-wildlife-climate-change-2862377-2026-02-03",
      "headline": "This Nilgiris factory is turning a destructive weed into clean fuel and jobsIn Mudumalai Tiger Reserve alone, the invasive shrub has invaded nearly 44 per cent of the area, disrupting food sources for herbivores and altering soil chemistry, which makes forest regeneration harder. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/features/story/what-is-anthropic-claude-cowork-tool-that-has-hit-stocks-of-infosys-tcs-and-other-saas-companies-2863312-2026-02-05",
      "headline": "What is Anthropic Claude Cowork, tool that hit Infosys, TCS, other SaaS companies?Infosys, TCS and other SaaS companies lost hundreds of billions of dollars in market value just like that. Reason? It was AI. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/joint-statement-on-india-us-trade-deal-next-week-fine-print-to-be-made-public-sources-2863459-2026-02-05",
      "headline": "India-US statement on trade deal in 4-5 days, agriculture safeguardedThe much-awaited statement is likely to lift the secrecy that has shrouded the trade deal ever since Trump unilaterally announced that a trade deal with India had been reached. There was no mention of the deal in PM Modi's post."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/open-to-exploring-commercial-merits-of-any-new-crude-supply-option-including-venezuela-govt-on-trumps-claim-2863492-2026-02-05",
      "headline": "Energy security India's priority, open to Venezuela oil trade: Govt on Trump's claimMinistry of External Affairs (MEA) spokesperson Randhir Jaiswal said India is open to exploring Venezuelan crude commercially, stressing energy policy followed market realities and national security. No automatic shift from Russian Iranian oil has been confirmed."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/sunil-gavaskar-backs-virat-kohli-and-rohit-sharma-for-2027-odi-world-cup-2863689-2026-02-05",
      "headline": "Sunil Gavaskar backs Virat Kohli and Rohit Sharma for 2027 ODI World Cup Sunil Gavaskar did not think twice when he backed both Virat Kohli and Rohit Sharma to play the 2027 ODI World Cup. Speaking at India Today's Salaam Cricket 2026, Gavaskar backed the idea of having India's favourite duo for one last push for the ODI crown. \"Virat and Kohli will definitely play ODI World Cup 2027. They've been performing well. Even if the ODI are six months later, they will continue practising and stay in touch with the game. Their experience is of utmost importance to the team,\" he said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gavaskar-dance-promise-suryakumar-yadav-india-defend-t20-world-cup-crown-2863680-2026-02-05",
      "headline": "Dancing with joy: Gavaskar's promise to Suryakumar Yadav if India defend T20 crown Sunil Gavaskar has promised India captain Suryakumar Yadav a joyful dance if the team successfully defend their T20 World Cup crown, saying nothing moves him more than seeing India lift a trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-vs-dc-live-score-wpl-2026-final-royal-challengers-bengaluru-delhi-capitals-womens-match-2863668-2026-02-05",
      "headline": "RCB vs DC Live Score, Final: Arundhati removes Shafali, Lee on the charge WPL 2026, Royal Challengers Bengaluru (RCB-W) vs Delhi Capitals (DC-W) Live Score: Shafali Verma and Lizelle Lee have got a decent start as Delhi Capitals have made decent use of the powerplay. RCB, on the other hand, need to separate the duo to put the brakes on the scoring. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-captain-salman-agha-government-permission-india-t20-world-cup-2026-2863592-2026-02-05",
      "headline": "Will Pakistan play India in T20 World Cup semi final or final? Captain reveals Pakistan captain Salman Agha has said that they will have to seek the government's permission to face India in the semi-final or final of the T20 World Cup 2026. Pakistan government has denied permission to its players to play against India in the group stage game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/supreme-court-lifts-bcci-ban-anurag-thakur-nine-years-2863590-2026-02-05",
      "headline": "Anurag Thakur gets relief as Supreme Court lifts nine-year BCCI ban The Supreme Court has lifted the nine-year ban on Anurag Thakur, allowing him to participate in BCCI affairs after noting the ban was not meant to be lifelong and citing his unconditional apology."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-pakistan-t20-world-cup-2026-uncertainty-players-mental-health-ishant-sharma-2863557-2026-02-05",
      "headline": "Uncertainty over India vs Pakistan match not good for players: Ishant Sharma Former India bowler Ishant Sharma has expressed concern for players amid the uncertainty of the India-Pakistan T20 World Cup match. The ongoing boycott threat by Pakistan could impact players' preparations and tournament dynamics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/be-the-same-person-no-matter-what-happens-rishabh-pant-reveals-rahul-dravids-advice-2863559-2026-02-05",
      "headline": "Be the same person no matter what happens: Rishabh Pant reveals Rahul Dravid's advice Pant, who flourished under Dravid across formats, said one piece of advice from the Indian legend has stayed with him.\r\n\r\n\"I think the key is not thinking about it too much and not dwelling on it. There's one really good line I learnt from Rahul (Dravid) bhai. He always told me one thing: 'Rishabh, no matter what happens, try to be the same person when you score a hundred and when you score a zero,'\" Pant said.\r\n\r\n\"I think, as an athlete, that's the hardest thing to do — to remain who you are. Emotions sometimes get the better of you, but that line always stays with me. So personally, I try that. Whether I score zero or a hundred, I want to be the same guy. Maybe when I get out, it hurts more. I don't enjoy scoring runs as much as I feel the pain of getting out,\" the wicketkeeper-batter concluded."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-suryakumar-yadav-on-ind-vs-pak-controversy-2863528-2026-02-05",
      "headline": "Suryakumar Yadav breaks silence on Pakistan boycott threat: We are ready to play T20 World Cup: India's T20I captain, Suryakumar Yadav, remained firm that their plans do not change considering Pakistan's boycott of their group-stage clash. He said that they would prepare for the game regardless of Pakistan's stance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-t20-world-cup-rishabh-pant-abhishek-sharma-rahul-dravid-2863509-2026-02-05",
      "headline": "Dravid's student, now Abhishek's fan: Rishabh Pant on batting mavericks Rishabh Pant has revealed his admiration for two batting mavericks - Rahul Dravid and Abhishek Sharma. Speaking on India Today's Salaam Cricket, Pant revealed how one of Dravid's advises will stay with him lifelong."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/salaam-cricket-t20-world-cup-sunil-gavaskar-suresh-raina-india-pakistan-2863468-2026-02-05",
      "headline": "Salaam Cricket Live: India have confidence of champions, says Chahal Salaam Cricket 2026, T20 World Cup: India spinner Yuzvendra Chahal has said that India will win all the matches of the T20 World Cup 2026 and successfully defend their title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-world-cup-2026-bangladesh-thanks-pakistan-asif-nazrul-shehbaz-sharif-politics-off-field-nexux-2863447-2026-02-05",
      "headline": "Thank you, Pakistan: Bangladesh reveals big cricket nexus against India Bangladesh's sports adviser Asif Nazrul thanked Pakistan for backing Dhaka's boycott of the T20 World Cup, after Islamabad decided to skip its match against India in Colombo. A day earlier, Pakistani PM Shehbaz Sharif publicly justified the move as standing \"completely\" with Bangladesh. This exposed how both governments made cricket a theatre of a political engagement against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indian-origin-captains-t20-world-cup-2026-2863098-2026-02-05",
      "headline": "Beyond Suryakumar Yadav. List of Indian-origin captains in T20 World CupT20 World Cup 2026: It is not just the Indian team that will have a captain from India in the T20 World Cup. The mega event on Indian and Sri Lankan soil is set to witness several Indian-origin players leading their respective associate teams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tilak-varma-angry-arshdeep-singh-ind-vs-sa-warm-up-2863369-2026-02-05",
      "headline": "Tilak Varma gets angry at Arshdeep Singh: Don't take videos without permissionT20 World Cup: India batter Tilak Varma got angry at Arshdeep Singh at the end of the team's warm-up game against South Africa. In the dressing room, Tilak told Arshdeep to not film him without permission."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ishan-kishan-sanju-samson-india-opener-spot-t20-world-cup-warm-up-2863268-2026-02-05",
      "headline": "Has Samson lost opener's battle to Kishan? Aakash Chopra gives his verdictT20 World Cup: Aakash Chopra said that Ishan Kishan cemented his place for the opener's slot with his 53-run knock against South Africa in the warm-up match on Wednesday in Navi Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-pak-nasser-hussain-sky-cricket-podcast-2863332-2026-02-05",
      "headline": "I quite like it: Hussain backs Bangladesh, Pakistan over World Cup boycottNasser Hussain has lambasted the ICC and the BCCI over the ongoing uncertainty in the cricketing world. Nasser says that he quite likes the fact that the board stood up for their players."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/delhi-capitals-vs-royal-challengers-bengaluru-wpl-2026-final-preview-2863228-2026-02-05",
      "headline": "Delhi look to break final curse, aim for 2024 revenge in battle of best friendsWPL 2026 Final, RCB vs DC Preview: In the battle of best friends, Jemimah Rodrigues' Delhi Capitals will be up against Smriti Mandhana's Royal Challengers Bengaluru in the summit clash on Thursday in Vadodara. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/time-to-stand-up-to-bcci-400-million-now-on-one-side-ex-pak-cricket-chief-2863306-2026-02-05",
      "headline": "Time to stand up to BCCI, 400 million now on one side: Ex-Pak cricket chiefT20 World Cup 2026: Speaking to India Today, former Pakistan Cricket Board chief Najam Sethi said Pakistan is now standing up to BCCI by announcing the boycott of their game against India. Sethi said the ICC is run by people in the BCCI and Pakistan are willing to let go off short-term financial gains to end the bullying of the global cricket body."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-t20-world-cup-2026-india-role-impact-bench-2863285-2026-02-05",
      "headline": "Sanju Samson's fate sealed? Job's not finished with T20 World Cup 2026 in sightWith India's T20 plans taking shape, Sanju Samson faces a reduced role ahead of the 2026 World Cup. Staying ready, and being used wisely, may decide his future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/isl-broadcast-deal-dip-in-value-below-kerala-super-league-ipl-fancode-2862862-2026-02-05",
      "headline": "Rs 9 crore for ISL, Rs 100 crore for Kerala: How low has Indian football sunkThe ISL has its broadcast deal, but the numbers tell a harsher story. Now, valued below regional leagues and nowhere near cricket, Indian football's top tier has fallen from grace."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-2026-pakistan-prime-minister-shahbaz-sharif-no-change-india-boycott-stance-2863261-2026-02-04",
      "headline": "T20 World Cup: Pakistan PM confirms no change in India boycott stancePakistan Prime Minister Shahbaz Sharif confirmed that Pakistan will not play against India in the T20 World Cup 2026 group stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rcb-recharge-goa-trip-wpl-2026-final-delhi-capitals-2863250-2026-02-04",
      "headline": "Could Goa break unsettle RCB? Smriti Mandhana opens up ahead of WPL finalWPL 2026: Smriti Mandhana said that Royal Challengers Bengaluru (RCB) are fresh for the final against Delhi Capitals (DC) after they spent their one-week break enjoying in Goa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-2026-india-vs-south-africa-warm-ups-ishan-kishan-sanju-samson-debate-tilak-varma-return-india-defend-title-2863245-2026-02-04",
      "headline": "IND vs SA, warm-up: Ishan edges Samson, Tilak back as India ready to defend crownIND vs SA, T20 World Cup Warm-ups: India's only warm-up turned into a statement as Ishan Kishan sealed the opener role, Tilak Varma returned in style, and the bowlers controlled the chase to down South Africa by 30 runs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/india-among-six-nations-bidding-to-host-afc-asian-cup-2031-with-government-support-2863218-2026-02-04",
      "headline": "India among six bidders to host football's Asian Cup 2031India is among six nations bidding to host the AFC Asian Cup 2031, the Asian Football Confederation confirmed, as the country renews its push to stage the continent's top football tournament with full government backing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-pakistan-cricket-board-heavy-financial-losses-india-match-boycott-2863209-2026-02-04",
      "headline": "PCB face heavy financial losses if they refuse to play India at T20 World Cup: ReportThe Pakistan Cricket Board risks significant financial losses if penalised by the ICC for not playing India in the T20 World Cup. This could lead to serious financial challenges amid ongoing stadium upgrades and revenue dependencies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-2026-india-pakistan-match-bangladesh-reinstated-najam-sethi-ex-pcb-chief-2863200-2026-02-04",
      "headline": "IND-PAK match can happen if Bangladesh are reinstated at T20 World Cup: Ex-PCB chiefFormer chief of the Pakistan Cricket Board (PCB), Najam Sethi believes that there is still a chance that the India-Pakistan game can take place if Bangladesh are reinstated with their games being held in Sri Lanka. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-afghanistan-u19-world-cup-semi-final-report-aaron-george-115-final-vs-england-2863176-2026-02-04",
      "headline": "Aaron George's 115 helps India chase a record 311 vs Afghanistan to reach finalICC U19 World Cup: India scripted a remarkable chase as opener Aaron George's heroic century powered them past a record 311 against Afghanistan in the second semi-final, setting up a title clash with England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ishan-kishan-t20-world-cup-warm-up-innings-challenges-sanju-samson-opener-spot-2863175-2026-02-04",
      "headline": "Ishan Kishan's blitz as opener vs South Africa puts Samson under serious pressureIND vs SA, T20 World Cup: Ishan Kishan went berserk in the warm-up match against South Africa at the Dr DY Patil Stadium in Navi Mumbai, scoring 53 off 20 balls with seven sixes before retiring out."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-optimistic-early-return-injury-recovery-progress-2863152-2026-02-04",
      "headline": "Fitness is getting better and I will be back soon: Rishabh PantIndia's wicketkeeper-batter Rishabh Pant on Tuesday said he is recovering well from his injury and is hopeful of returning to competitive cricket at the earliest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/t20-world-cup-italy-squad-all-players-profile-jj-smuts-wayne-madsen-fixtures-schedule-2862177-2026-02-04",
      "headline": "From JJ Smuts to Wayne Madsen: Italy's T20 World Cup stars you can't missT20 World Cup 2026: Italy are set to make their maiden appearance on the global stage. Led by Wayne Madsen, the Azzurri face a stern challenge in a tough group that also features England and the West Indies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/mirabai-chanu-national-weightlifting-records-205kg-total-championships-2863143-2026-02-04",
      "headline": "Mirabai Chanu shatters three national records at Weightlifting ChampionshipsIndian weightlifting star Mirabai Chanu continued her record-breaking run, rewriting the national marks with a commanding display at the National Weightlifting Championships on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhav-sooryavanshi-under-19-world-cup-fifty-ind-vs-afg-semi-final-2863108-2026-02-04",
      "headline": "U19 World Cup: Vaibhav steps up under pressure with 33-ball 68 in semi-finalIND-U19 vs AFG-U19: Vaibhav Sooryavanshi delivered a fearless counterattack under pressure, smashing 68 off just 33 balls to give India a flying start in their chase against Afghanistan in the Under-19 World Cup 2026 semi-final at the Harare Sports Club on Wednesday."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}