{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-43-points-higher-nifty-above-25200-sbi-gains-2-percent-2756659-2025-07-16",
      "headline": "Sensex closes 64 points higher, Nifty above 25,200; SBI gains 2%The S&P BSE Sensex added 63.57 points to end at 82.634.48, while the NSE Nifty50 gained just 16.25 points to close at 25,212.05."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gurugram-gurgaon-rain-water-logging-real-estate-price-bubble-review-infra-drainage-2756654-2025-07-16",
      "headline": "Gurugram's luxury flats, flooded streets: Is real estate bubble about to burst?Gurugram's luxury real estate may be booming, but repeated rain-induced flooding is testing its long-term value. If basic infrastructure fails, even the city's glitziest addresses could lose their appeal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/is-gold-losing-its-shine-here-is-why-fewer-people-are-investing-in-the-yellow-metal-gold-investment-trends-etfs-2756607-2025-07-16",
      "headline": "Is gold losing its shine? Here's why fewer people are investing in the yellow metalEarlier, gold symbolised family pride and social standing, but today's youngsters often see gold jewellery as outdated and instead put their money into things they believe will grow faster than gold ever could."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-upcoming-meeting-august-expectation-simplification-slab-structure-rate-rationalisation-2756556-2025-07-16",
      "headline": "Fewer slabs, simpler rules? Next GST Council meet may trigger overhaulThe upcoming GST Council meeting, likely to be held in August 2025 after the monsoon session of Parliament, could bring key reforms in the way GST is structured and collected."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-residential-housing-home-sales-drop-affordability-concerns-proptiger-report-2756552-2025-07-16",
      "headline": "Housing sales slide 14% as affordability pressures mount across cities: ReportThe PropTiger report, which tracks sales and launches across major cities, found that the most significant annual drop was recorded in Mumbai Metropolitan Region (MMR) and Pune, where sales fell by 32% and 27% respectively."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mygate-founder-abhishek-kumar-work-as-guard-why-rs-1600-crore-valuation-iit-iim-graduate-2756521-2025-07-16",
      "headline": "Why this IITian took up a guard's job to build Mygate, valued at Rs 1,600 croreMyGate has raised a total of $83.3 million across eight rounds. Its latest funding was in April 2023, a Series B round worth $3.29 million, putting its valuation at Rs 1,670 crore, according to Tracxn."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-model-y-in-india-elon-musk-key-challenges-what-next-for-ev-maker-2756518-2025-07-16",
      "headline": "Tesla is finally in India. But can it go the distance?Tesla's India debut is a big milestone, but long-term success will depend on how well the company adapts to India's unique mix of pricing realities, policy expectations, and market dynamics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/are-private-school-fees-draining-indian-middle-class-ca-shares-eye-opening-figures-2756494-2025-07-16",
      "headline": "Are private school fees draining India's middle class? CA shares eye-opening figuresWith fees climbing each year, parents are feeling the pinch more than ever. Maybe now is the right moment to pause, think, and ask ourselves, are we getting real value for this cost? Can we secure our kids' future without spending a fortune on fees? asks a Delhi-based CA."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/ssy-scheme-how-your-daughter-can-get-rs-71-lakh-at-21-sukanya-samriddhi-yojana-government-scheme-2756448-2025-07-16",
      "headline": "SSY scheme: How your daughter can get Rs 71 lakh at 21It is a small savings scheme backed by the government, which offers high interest rates, tax benefits under Section 80C, and tax-free returns on maturity. Over 4.1 crore accounts have been opened so far under this scheme."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/hdfc-bank-share-holders-good-news-soon-bonus-issue-special-interim-dividend-2756447-2025-07-16",
      "headline": "Good news soon for HDFC Bank shareholders? Here's all you need to knowHDFC Bank shares have delivered a 24% gain over the past year, with a year-to-date rise of nearly 13%. The stock has climbed more than 21% over the last six months, posting gains of 7% over the past three months and 4% in the previous month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/ashok-leyland-share-price-bonus-issue-not-down-50-percent-down-2756443-2025-07-16",
      "headline": "Did Ashok Leyland shares fall over 50% today? Details hereThe steep drop is the result of the company's 1:1 bonus issue, which came into effect on Wednesday. When a stock goes \"ex-bonus,\" its price adjusts to reflect the additional shares being issued. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-69-points-lower-nifty-below-25200-hdfc-bank-up-1-percent-2756420-2025-07-16",
      "headline": "Sensex opens 69 points lower, Nifty below 25,200; HDFC Bank up 1%The S&P BSE Sensex was down by 197.64 points to 82,373.27, while the NSE Nifty50 lost 61.80 points to 25,134.00 as of 9:28 am. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tomorrowland-main-stage-destroyed-by-fire-days-before-festival-begins-glbs-2756918-2025-07-17",
      "headline": "Tomorrowland Main stage destroyed by fire days before festival beginsA major fire destroyed Tomorrowland's main stage just days before the festival. While no injuries were reported, organisers face pressure to announce its fate amid fake cancellation emails and global anticipation.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/american-idol-music-head-robin-kaye-and-husband-found-shot-dead-at-la-home-glbs-2756913-2025-07-17",
      "headline": "American Idol music head Robin Kaye and husband found shot dead at LA homePolice found American Idol music supervisor Robin Kaye and her husband dead at their LA home. A 22-year-old local man has been arrested in the suspected double homicide.  \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/stranger-things-5-teaser-vecna-returns-to-hawkins-and-stakes-have-never-been-higher-2756822-2025-07-16",
      "headline": "Stranger Things 5 teaser: Vecna returns to Hawkins and stakes have never been higherNetflix revealed the much-awaited teaser for 'Stranger Things' final season. The release of the finale is planned in two phases, starting November 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/ronit-roy-to-replace-sudhanshu-pandey-in-rupali-ganguly-anupamaa-report-2756763-2025-07-16",
      "headline": "Ronit Roy to replace Sudhanshu Pandey in Anupamaa: ReportActor Ronit Roy is reportedly set to join popular television show 'Anupamaa'. He could be seen taking over as Vanraj Shah after actor Sudhanshu Pandey's exit. This casting aims to boost the show's ratings following recent challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/rajinikanth-coolie-plot-leaked-online-heres-what-we-know-2756813-2025-07-16",
      "headline": "Rajinikanth's Coolie plot leaked online? Here's what we knowThe plot of actor Rajinikanth's much-anticipated film 'Coolie' has reportedly been leaked online, despite the makers keeping key details tightly under wraps. The film is slated for a theatrical release on August 14."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kailash-kher-reacts-to-shooting-at-kapil-sharma-canada-cafe-2756801-2025-07-16",
      "headline": "Singer Kailash Kher reacts to shooting at Kapil Sharma's Canada cafeSinger Kailash Kher reacted to the incident involving an open fire at Kapil Sharma's restaurant in Canada. The shooting occurred on July 10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/shaan-quitting-sa-re-ga-ma-pa-against-himesh-reshammiya-aditya-narayan-fame-2756782-2025-07-16",
      "headline": "Shaan on quitting Sa Re Ga Ma Pa against Himesh's advice, boosting Aditya's fameSinger Shaan revealed that he had to leave 'Sa Re Ga Ma Pa' as a gesture towards his producer-friend. The producer who had appointed him departed from ZeeTV, following internal disputes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-baashha-to-re-release-in-theatres-ahead-of-coolie-2756790-2025-07-16",
      "headline": "Rajinikanth's classic Baashha to re-release in theatres ahead of CoolieAs Rajinikanth's fans gear up for 'Coolie', his iconic 1995 gangster drama 'Baashha' is set to return to theatres in a newly restored 4K version with Dolby Atmos, marking the film's 30th anniversary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kalki-2898-ad-bags-best-film-nomination-alongside-stree-2-empuraan-at-indian-film-festival-of-melbourne-2025-2756744-2025-07-16",
      "headline": "Kalki 2898 AD bags Best Film nomination alongside Stree 2, Empuraan at IFFM 2025Nag Ashwin's 'Kalki 2898 AD' continues its global run with a Best Film nomination at the Indian Film Festival of Melbourne 2025. The nomination came a year after its release, with recognition pouring in for the film's vision and scale."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-father-undergoes-heart-surgery-family-gives-health-update-2756716-2025-07-16",
      "headline": "Taylor Swift's father undergoes heart surgery, family gives health updatePop sensation Taylor Swift's father, Scott Swift, is on the road to recovery following a successful quintuple bypass surgery. The global music icon was reportedly by his side throughout the ordeal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-melts-hearts-as-he-hugs-young-fan-at-mumbai-event-indian-supercross-racing-league-2756776-2025-07-16",
      "headline": "Salman Khan melts hearts as he hugs young fan at Mumbai eventSalman Khan charmed everyone by warmly embracing a young fan on stage during an event in Mumbai. The video quickly grabbed a lot of attention. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/the-revolutionaries-rohit-saraf-bold-move-to-break-the-soft-boy-mold-2756602-2025-07-16",
      "headline": "Is The Revolutionaries Rohit Saraf's bold move to break the soft-boy mold?Actor Rohit Saraf steps away from his romantic image in the upcoming series, 'The Revolutionaries'. His role of a freedom fighter could mark his most serious and defining performance yet. If done right, this could be his chance to pivot from the chocolate boy image. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-summer-i-turned-pretty-3-review-a-dull-ride-through-a-cringe-summer-rom-com-2756718-2025-07-16",
      "headline": "The Summer I Turned Pretty 3 Review: A dull ride through a cringe summer rom-comRelease Date:Wed Jul 16, 2025The Summer I Turned Pretty Season 3 series review: The Prime Video series returned with familiar teen romance and recycled drama, leaving viewers craving freshness in the teen rom-com genre. Despite strong music and a good-looking cast, the show struggles with pacing and emotional depth, making it feel like a repetitive rerun."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ashish-chanchlani-and-elli-avrram-share-playful-video-after-sparking-dating-rumours-2756608-2025-07-16",
      "headline": "Dating or just dropping content? Ashish Chanchlani, Elli's video has fans guessingInfluencer Ashish Chanchlani teamed up with actor Elli AvrRam for a fun video on Wednesday. The video, which was shared on Instagram, sparked further interest in their relationship."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/pratyusha-banerjee-death-case-rahul-raj-singh-demands-evidence-from-kamya-punjabi-says-fighting-lone-battle-for-8-years-2756663-2025-07-16",
      "headline": "Rahul Raj Singh demands evidence from Kamya Punjabi in Pratyusha Banerjee death caseRahul Raj Singh challenges Kamya Punjabi and Neeru Shah to provide evidence or face legal consequences. He claims their actions had severely impacted his life after Pratyusha Banerjee's death."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-kareena-kapoor-varun-dhawan-vicky-kaushal-wish-katrina-kaif-on-her-42nd-birthday-2756667-2025-07-16",
      "headline": "Priyanka, Kareena, Varun and others wish Katrina Kaif on her 42nd birthdayActors Priyanka Chopra, Kareena Kapoor and Varun Dhawan, among others, extended birthday wishes to Katrina Kaif on social media. The 'Merry Christmas' actor turned 42 years old on Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-hunt-actor-shafeeq-mustafa-interview-sivarasan-rajiv-gandhi-assassination-case-2756665-2025-07-16",
      "headline": "The Hunt actor Shafeeq Mustafa on playing Sivarasan, understanding LTTE politicsMalayalam actor Shafeeq Mustafa describes his role as Sivarasan in The Hunt as a career milestone and dream come true. The series has brought him widespread recognition and critical appreciation for his authentic portrayal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/deepak-dobriyal-says-waiting-for-the-right-biopic-not-just-any-role-exclusive-2756655-2025-07-16",
      "headline": "Exclusive: Deepak Dobriyal says he's waiting for the right biopic, not just any role Actor Deepak Dobriyal shared his wish to play challenging real-life characters in biopics, including Nusrat Fateh Ali Khan, Pinki Pramanik, and Dhyan Chand. He also spoke about avoiding repetitive roles and choosing strong scripts with good directors and star casts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vicky-kaushal-kisses-katrina-kaif-in-birthday-post-and-its-too-cute-to-miss-2756633-2025-07-16",
      "headline": "Vicky Kaushal kisses Katrina Kaif in birthday post, and it's too cute to missVicky Kaushal shared a heartwarming birthday tribute to his 'special one', Katrina Kaif, sharing a series of adorable photos alongside a simple yet touching note that melted hearts online."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-india-completes-inspection-of-fuel-control-switches-on-boeing-787-planes-no-issues-found-official-2756877-2025-07-16",
      "headline": "Air India finds no fault in fuel control switches on Boeing 787 planes: OfficialAir India has completed inspections of fuel control switches in its Boeing 787 fleet and found no faults, following DGCA's directive after a deadly crash last month. The AAIB report had flagged the role of fuel switches in the engine shutdown."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-says-us-very-close-to-trade-deal-with-india-glbs-2756892-2025-07-16",
      "headline": "Trump says US 'very close' to trade deal with IndiaUS President Donald Trump said the US is \"very close\" to a trade deal with India, aiming for greater market access and lower tariffs through ongoing negotiations influenced by his tariff strategy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/video-israel-rains-bombs-syria-blast-near-presidential-palace-civilians-hit-2756812-2025-07-16",
      "headline": "Video: Israel rains bombs on Syria; blast near presidential palace, civilians hitIsrael launched major airstrikes on Syrian military headquarters in Damascus, citing the need to protect Druze civilians in Sweida. The strikes followed weeks of violence by Syrian forces against minorities near the Israeli border."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/devendra-fadnavis-offer-to-uddhav-thackeray-join-us-after-2029-if-you-want-2756805-2025-07-16",
      "headline": "Join us after 2029 if you want: Devendra Fadnavis' offer to Uddhav ThackerayThe remark came during the farewell ceremony of Ambadas Danve, the Leader of Opposition and a member of Thackeray's faction of the Shiv Sena."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/shubhanshu-shuklas-emotional-reunion-with-family-after-space-mission-see-pics-2756815-2025-07-16",
      "headline": "Shubhanshu Shukla's emotional reunion with family after space mission. See picsShukla was greeted by his family at a designated facility in Houston, where initial medical checks were conducted before the reunion. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-goa-indigo-flight-makes-emergency-landing-in-mumbai-over-engine-failure-2756869-2025-07-16",
      "headline": "Delhi-Goa IndiGo flight makes emergency landing in Mumbai over engine failureThe aircraft landed at 9.42 pm at Mumbai's Chhatrapati Shivaji Maharaj International Airport. The pilot had raised an alarm at 9.25 pm and landed the plane safely."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/facts-based-on-well-known-sources-aim-is-holistic-learning-ncert-on-row-over-mughal-history-in-class-8-book-2756826-2025-07-16",
      "headline": "Facts from known sources, aim is holistic learning: NCERT on Mughal chapter rowNCERT has released an official statement on its new Class 8 textbook 'Exploring Society, India and Beyond'. Responding to criticism around chapters on the Mughal era, it said that all of its content is fact-based and aimed at holistic learning."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-bangladesh-razing-satyajit-rays-ancestral-home-is-a-shared-cultural-loss-2756672-2025-07-16",
      "headline": "Why Bangladesh razing Satyajit Ray's ancestral home is a shared cultural lossThe Ray family has been one of the architects of the Bengali experience, their works foundational to the artistic and educational landscape on both sides of the border\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/video-anchor-runs-for-cover-live-on-air-as-israel-launches-airstrikes-on-syria-2756840-2025-07-16",
      "headline": "Video: Anchor runs for cover live on air as Israel launches airstrikes on SyriaThe video clip shared by Israeli Defence Minister, Israel Katz on X, showed the anchor reading news about the latest strikes by the Jewish nation on Syria."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/ssvm-institutions-from-cradle-to-cosmos-2754432-2025-07-11",
      "headline": "SSVM Institutions: From Cradle to CosmosForging Futures with Foresight, Flair, and Faith"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/on-death-row-in-yemen-kerala-nurse-nimisha-priya-fate-hinges-on-qisas-what-is-god-law-2756750-2025-07-16",
      "headline": "On death row in Yemen, Kerala nurse's fate hinges on Qisas: What is God's law?Nimisha Priya's execution in Yemen has been postponed, but her fate remains uncertain as the victim's family refuses all offers of reconciliation or blood money, insisting on Qisas, or retributive justice under Islamic law."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tejasvi-surya-narayana-murthy-flight-conversation-70-hour-work-week-pm-modi-2756752-2025-07-16",
      "headline": "Narayana Murthy's in-flight 'masterclass' with Tejasvi Surya ft 70-hour week, PMSharing details of their conversation on a Mumbai-Bengaluru flight, which Tejasvi Surya described as a 'two-hour masterclass', the BJP MP said it featured topics ranging from AI to a 70-hour work week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/happy-world-snake-day-2025-india-types-cobra-python-tribute-venom-poisonous-attack-harmful-relatives-heres-how-2756591-2025-07-16",
      "headline": "Happy World Snake Day, dear relativesSnakes are a misunderstood and feared lot, though 75% of them found in India are non-venomous. On World Snake Day, paying tribute to a species that's more venomous and strikes without provocation, our relatives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-india-boeing-787-ahmedabad-crash-demand-cockpit-video-recorders-debate-safety-vs-privacy-2756086-2025-07-16",
      "headline": "Why no cameras in cockpits? Air India crash sparks debate, demandThe fuel-switch report in the Air India Boeing 787 crash probe has sparked a demand for a cockpit video recorder. The NTSB of the US that probes air crashes has for years batted for one. If cockpit voice recorders are part of the black boxes of planes, what has kept cockpit video recorders, which would aid air crash investigations, from being installed?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-woman-kills-5-year-old-daughter-has-sex-with-lover-besides-girls-dead-body-2756699-2025-07-16",
      "headline": "UP woman kills 5-year-old daughter, consumes drugs with lover, has sex next to bodyInitially, the woman accused her husband of killing their daughter so that he could go to jail, and she would have no problem living with her lover. She later confessed to her crime."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-mamatas-rallying-cry-for-bangla-speaking-migrant-workers-is-echoing-till-delhi-2756508-2025-07-16",
      "headline": "How Mamata's rallying cry for Bangla-speaking migrant workers is echoing till Delhi\"I've decided to speak more in Bangla from now on—arrest me if you can,\" charged the Bengal chief minister after her party's Kolkata rally\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/stranger-things-5-teaser-vecna-returns-to-hawkins-and-stakes-have-never-been-higher-2756822-2025-07-16",
      "headline": "Stranger Things 5 teaser: Vecna returns to Hawkins and stakes have never been higherNetflix revealed the much-awaited teaser for 'Stranger Things' final season. The release of the finale is planned in two phases, starting November 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/melania-donald-trump-russia-ukraine-war-secret-agent-us-first-lady-meme-hero-slovanian-putin-2756697-2025-07-16",
      "headline": "Did secret agent Melania Trumpenko turn Trump against Putin?Is US First Lady Melania Trump a secret agent who turned Donald Trump against Russian President Vladimir Putin? Yes, if social media is to be believed. Melania became a hero for Ukrainians and became the subject of \"Agent Melania Trumpenko\" memes after Trump credited her with questioning Putin's actions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rajasthan-woman-gangraped-by-7-men-in-moving-car-held-captive-for-11-days-in-alwar-2756700-2025-07-16",
      "headline": "Woman gangraped by 7 men in moving car, held captive for 11 days in RajasthanAccording to the complaint filed by the survivor's husband, the incident began on the night of April 25, when the woman went outside her home to relieve herself. She was allegedly forced into a Bolero vehicle by three men. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-glass-partition-removed-public-funds-junked-barely-lasts-a-year-dy-chandrachud-br-gavai-exclusive-rti-2756631-2025-07-16",
      "headline": "Top court glass partition installed, removed in months. Total cost: Rs 2.68 croreThrough the RTI filed by India Today, we have exclusively learnt that the total cost of installation of the glass panels in the Supreme Court amounted to approximately Rs 2.6 crore. The cost of its removal was estimated at Rs 8,63,700."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/uk-news/story/rare-gandhi-portrait-oil-painting-sold-for-triple-its-estimate-in-london-bonhams-uk-clare-leighton-brailsford-mahadev-desai-2756774-2025-07-16",
      "headline": "Rare sitting Gandhi portrait sold in London for Rs 1.75 cr, double the estimateA rare oil portrait of Mahatma Gandhi, painted by British artist Clare Leighton in 1931 during the Indian leader's London visit for the second Round Table Conference, sold for GBP 152,800 (Rs 1.75 crore). The oil portrait, believed to be the only one which Gandhi personally sat for, was auctioned at more than double its estimated price."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-india-went-the-extra-mile-in-lords-test-defeat-2756578-2025-07-16",
      "headline": "How India went the 'extra' mile in Lord's Test defeatThe margin of loss against England wasn't really 22 runs, but the 63 extras that Team India conceded in the match\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nato-chief-mark-rutte-warning-india-russia-oil-trade-sanctions-brics-response-us-trade-2756612-2025-07-16",
      "headline": "Who's Nato chief to warn India on trade?Nato chief Mark Rutte's warning to India over Russian oil trade crosses diplomatic lines and raises questions about the Western military alliance's role in global trade. In his attempt to be Trump's tough messenger, Rutte could risk alienating a strategic partner like India. Who's Rutte to warn a sovereign country? "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pak-tv-anchor-jasmeen-manzoor-shares-photos-domestic-abuse-ex-husband-have-50-more-pics-2756769-2025-07-16",
      "headline": "Pak TV anchor shares photos of domestic abuse by ex-husband: Have 50 more picsSenior Pakistani TV anchor Jasmeen Manzoor shared images of domestic abuse injuries, accusing her ex-husband of violence and slamming the legal system for inaction by calling it \"shameful and pathetic\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tomorrowland-main-stage-destroyed-by-fire-days-before-festival-begins-glbs-2756918-2025-07-17",
      "headline": "Tomorrowland Main stage destroyed by fire days before festival beginsA major fire destroyed Tomorrowland's main stage just days before the festival. While no injuries were reported, organisers face pressure to announce its fate amid fake cancellation emails and global anticipation.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/american-idol-music-head-robin-kaye-and-husband-found-shot-dead-at-la-home-glbs-2756913-2025-07-17",
      "headline": "American Idol music head Robin Kaye and husband found shot dead at LA homePolice found American Idol music supervisor Robin Kaye and her husband dead at their LA home. A 22-year-old local man has been arrested in the suspected double homicide.  \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/rajinikanth-coolie-plot-leaked-online-heres-what-we-know-2756813-2025-07-16",
      "headline": "Rajinikanth's Coolie plot leaked online? Here's what we knowThe plot of actor Rajinikanth's much-anticipated film 'Coolie' has reportedly been leaked online, despite the makers keeping key details tightly under wraps. The film is slated for a theatrical release on August 14."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kailash-kher-reacts-to-shooting-at-kapil-sharma-canada-cafe-2756801-2025-07-16",
      "headline": "Singer Kailash Kher reacts to shooting at Kapil Sharma's Canada cafeSinger Kailash Kher reacted to the incident involving an open fire at Kapil Sharma's restaurant in Canada. The shooting occurred on July 10. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-australia-t20i-series-andre-russell-retirement-squad-announcement-2756897-2025-07-16",
      "headline": "Russell to retire from international cricket after 1st two T20Is vs AustraliaWest Indies all-rounder Andre Russell is all set to retire from international cricket after the first two T20Is against Australia. The first two matches of the series will take place on July 20 and 22. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harleen-deol-run-out-video-reactions-india-southampton-odi-2756895-2025-07-16",
      "headline": "Embarrassing running: Harleen Deol faces flak for bizarre run outENG-W vs IND-W: Harleen Deol fell to a direct hit from Alice Davidson-Richards in the first ODI in Southampton, after which the Indian batter was greeted with criticism. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/japan-open-satwiksairaj-rankireddy-chirag-shetty-injury-fitness-2756873-2025-07-16",
      "headline": "No long-term goals, just stay injury-free ahead of World Championships: SatwiksairajSatwiksairaj Rankireddy said that he and Chirag Shetty aren't keeping any long-term goals in mind and are focused on remaining fit for next month's World Championships. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-vs-bangladesh-mahedi-hasan-tanzid-hasan-3rd-t20i-2756860-2025-07-16",
      "headline": "Bangladesh secure historic T20I series win vs Sri Lanka after Tanzid, Mahedi fireSL vs BAN: Litton Das' Bangladesh claimed the T20I series 2-1 after winning the decider against Sri Lanka on Wednesday by eight wickets at the R. Premadasa Stadium in Colombo. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-new-zealand-2nd-t20i-tri-series-tim-robinson-jacob-duffy-harare-2756827-2025-07-16",
      "headline": "SA vs NZ: Robinson, Duffy star as New Zealand begin Rob Walter era with winTim Robinson and Jacob Duffy were the stars of the show as New Zealand started the Rob Walter era with a win in the second match of the tri-series on Friday, July 16 in Harare. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mahedi-hasan-harbhajan-singh-colombo-sri-lanka-vs-bangladesh-2756825-2025-07-16",
      "headline": "Mahedi Hasan breaks Harbhajan Singh's 13-year-old record in Colombo T20ISL vs BAN: Mahedi Hasan finished with figures of 4-1-11-4 in the third and final game of the three-match series against Sri Lanka on Wednesday, July 16 at the R Premadasa Stadium in Colombo. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-jasprit-bumrah-workload-manchester-test-deep-dasgupta-2756807-2025-07-16",
      "headline": "World's best bowler Jasprit Bumrah has to play Manchester Test: Ex-India cricketerFormer India wicketkeeper Deep Dasgupta wants Jasprit Bumrah to play the Manchester Test against England as he feels that the match is crucial in the context of the series. Bumrah is tipped to play just three Tests during the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kranti-goud-england-women-vs-india-women-1st-odi-video-2756804-2025-07-16",
      "headline": "Watch: Fiery Kranti Goud stuns England batters with deadly inswingersENG-W vs IND-W: Kranti Goud picked up the wickets of Amy Jones and Tammy Beaumont with deadly inswingers in the first ODI on Wednesday at the Rose Bowl in Southampton. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jitesh-sharma-dinesh-karthik-lords-test-viral-video-2756759-2025-07-16",
      "headline": "Jitesh Sharma denied entry at Lord's? Karthik opens up on viral videoENG vs IND: Former India wicketkeeper Dinesh Karthik has addressed the viral video that appeared to show Jitesh Sharma being denied entry to Lord's Cricket Ground during the third Test.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-ben-stokes-bowling-workload-joe-root-lords-test-2756764-2025-07-16",
      "headline": "Panicked during Ben Stokes's long Lord's spells, but great sign for us: Joe RootJoe Root said that he panicked a bit when Ben Stokes was bowling his long spells during the Lord's Test but feels that it is a good sign for England moving forward. Stokes was the star of the show with the ball as they won the third Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-jasprit-bumrah-workload-manchester-test-deep-dasgupta-2756807-2025-07-16",
      "headline": "World's best bowler Jasprit Bumrah has to play Manchester Test: Ex-India cricketerFormer India wicketkeeper Deep Dasgupta wants Jasprit Bumrah to play the Manchester Test against England as he feels that the match is crucial in the context of the series. Bumrah is tipped to play just three Tests during the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kranti-goud-england-women-vs-india-women-1st-odi-video-2756804-2025-07-16",
      "headline": "Watch: Fiery Kranti Goud stuns England batters with deadly inswingersENG-W vs IND-W: Kranti Goud picked up the wickets of Amy Jones and Tammy Beaumont with deadly inswingers in the first ODI on Wednesday at the Rose Bowl in Southampton. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jitesh-sharma-dinesh-karthik-lords-test-viral-video-2756759-2025-07-16",
      "headline": "Jitesh Sharma denied entry at Lord's? Karthik opens up on viral videoENG vs IND: Former India wicketkeeper Dinesh Karthik has addressed the viral video that appeared to show Jitesh Sharma being denied entry to Lord's Cricket Ground during the third Test.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-ben-stokes-bowling-workload-joe-root-lords-test-2756764-2025-07-16",
      "headline": "Panicked during Ben Stokes's long Lord's spells, but great sign for us: Joe RootJoe Root said that he panicked a bit when Ben Stokes was bowling his long spells during the Lord's Test but feels that it is a good sign for England moving forward. Stokes was the star of the show with the ball as they won the third Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/las-vegas-freestyle-chess-r-praggnanandhaa-magnus-carlsen-d-gukesh-opts-out-2756725-2025-07-16",
      "headline": "Las Vegas Freestyle chess: Praggnanandhaa grouped with Carlsen, Gukesh opts outR Praggnanandhaa will face Magnus Carlsen as the young Indian grandmaster has been grouped with the World No.1 for the Las Vegas Freestyle chess. D Gukesh will be missing the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/scott-boland-icc-rankings-hat-trick-west-indies-vs-australia-2756717-2025-07-16",
      "headline": "Boland rewarded with career-best ranking after hat-trick in Jamaica TestWI vs AUS: Australian speedster Scott Boland reached a career-high ranking of No.6 in Tests after he took a hat-trick in the second innings of the Jamaica Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lamine-yamal-birthday-party-dwarfism-controversy-legal-action-spain-2756710-2025-07-16",
      "headline": "Lamine Yamal in trouble? Spanish group vows legal actionLamine Yamal's 18th birthday party has drawn criticism for hiring people with dwarfism as entertainment. The incident raises serious questions about discrimination and the dignity of people with disabilities in Spain."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-lords-test-england-sanction-wtc-cycle-michael-vaughan-2756669-2025-07-16",
      "headline": "Michael Vaughan left fuming as England docked points for Lord's Test slow over rateMichael Vaughan was left fuming as England were docked points for maintaining a slow over rate during the Lord's Test as India escaped without facing any penalty. The Lord's Test saw many interruptions over the first two days which affected the number of overs bowled. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-retirement-uturn-virat-kohli-test-comeback-2756644-2025-07-16",
      "headline": "Virat Kohli's passion unmatched, he should come back to Test cricket: Madan LalMadan Lal, the 1983 World Cup hero, has expressed a heartfelt wish that has struck a chord with cricket fans across the nation—to see Virat Kohli return to Test cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-test-series-king-charles-akash-deep-sister-2756618-2025-07-16",
      "headline": "King Charles meets Team India, asks about Akash Deep's sisterThe Indian cricket teams met King Charles during their England tour. Charles asked about Akash Deep's sister, who is currently under treatment for cancer."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-lords-test-england-sanction-wtc-cycle-michael-vaughan-2756669-2025-07-16",
      "headline": "Michael Vaughan left fuming as England docked points for Lord's Test slow over rateMichael Vaughan was left fuming as England were docked points for maintaining a slow over rate during the Lord's Test as India escaped without facing any penalty. The Lord's Test saw many interruptions over the first two days which affected the number of overs bowled. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-retirement-uturn-virat-kohli-test-comeback-2756644-2025-07-16",
      "headline": "Virat Kohli's passion unmatched, he should come back to Test cricket: Madan LalMadan Lal, the 1983 World Cup hero, has expressed a heartfelt wish that has struck a chord with cricket fans across the nation—to see Virat Kohli return to Test cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-test-series-king-charles-akash-deep-sister-2756618-2025-07-16",
      "headline": "King Charles meets Team India, asks about Akash Deep's sisterThe Indian cricket teams met King Charles during their England tour. Charles asked about Akash Deep's sister, who is currently under treatment for cancer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/joe-root-icc-test-batting-ranking-top-spot-dethrones-harry-brook-eng-vs-ind-2756610-2025-07-16",
      "headline": "Joe Root dethrones Harry Brook to reclaim top spot in ICC Test rankingsEngland star Joe Root reclaimed the No.1 spot in ICC Test batting rankings after his century at Lord's, overtaking teammate Harry Brook and marking his eighth time at the top of the global charts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-agm-discusses-two-tier-test-system-t20-world-cup-expansion-new-members-2756600-2025-07-16",
      "headline": "ICC AGM: Two-tier Test system, T20 World Cup expansion to be discussedThe ICC's four-day AGM starting on Thursday will focus on key topics like the proposed two-tier Test system, T20 World Cup expansion, and new member ratifications. With the 2025-27 World Test Championship underway, discussions will center on funding and promotion-relegation rules within the two-tier format."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sl-vs-ban-coach-sanath-jayasuriya-dismisses-pressure-following-2nd-t20i-loss-2756581-2025-07-16",
      "headline": "Coach Sanath Jayasuriya dismisses pressure talk following 2nd T20I lossSri Lanka head coach Sanath Jayasuriya insisted on Tuesday that the team is not under pressure despite their embarrassing 83-run loss to Bangladesh in the second T20I."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-broad-buttler-chirpy-sundar-nitish-fuelled-england-lord-win-2756563-2025-07-16",
      "headline": "Broad, Buttler believe chirpy Sundar, Nitish fuelled England's Lord's winEngland vs India: Stuart Broad and Jos Buttler felt Nitish Kumar Reddy and Washington Sundar's on-field antics on days three and four of the Lord's Test backfired, contributing to India's heartbreaking loss."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/sunil-chhetri-isl-uncertain-future-statement-bengaluru-fc-indian-football-2756537-2025-07-16",
      "headline": "Sunil Chhetri's first reaction over ISL's uncertain future: Very concerningIndian Super League: Sunil Chhetri urged calm and unity across Indian football as uncertainty looms over the ISL's future, expressing faith in the AIFF and FSDL to find a solution that protects the sport's growth and stability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-docked-two-wtc-points-slow-over-rate-lords-test-2756513-2025-07-16",
      "headline": "England penalised two WTC points for slow overrate in Lord's Test against IndiaEngland have been docked two ICC World Test Championship points for a slow over rate in the Lord's Test against India. This penalty has pushed England down to third place, affecting their championship hopes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/pv-sindhu-early-exit-japan-open-2025-lakshya-sen-satwik-chirag-win-2756506-2025-07-16",
      "headline": "Japan Open 2025: PV Sindhu crashes out in opening roundPV Sindhu's struggles continued as the two-time Olympic medallist crashed out in the first round of the Japan Open 2025 Super 750 tournament. In contrast, Lakshya Sen and the men's doubles pair of Satwiksairaj Rankireddy and Chirag Shetty registered commanding straight-game victories to advance to the second round."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/stuart-macgill-cocaine-conviction-anxiety-family-impact-cricket-coaching-2756492-2025-07-16",
      "headline": "Stuart MacGill breaks silence on life after cocaine case: Worried for my kidsFormer Australian spinner Stuart MacGill has opened up about the toll of his legal troubles on his life and family. He reveals how anxiety and isolation have affected him and his children while he tries to rebuild through cricket coaching."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/satwik-chirag-lakshya-sen-badminton-japan-open-second-round-2756478-2025-07-16",
      "headline": "Satwik-Chirag, Lakshya Sen cruise into second round of Japan Open 2025India's campaign at the Japan Open 2025 began on a high note, with Satwik-Chirag and Lakshya Sen cruising into the second round after impressive straight-game wins in their respective men's doubles and singles matches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rocky-flintoff-andrew-flintoff-the-hundred-wilcard-northern-superchargers-2756468-2025-07-16",
      "headline": "Andrew Flintoff drafts son Rocky as wilcard for Northern SuperchargersAndrew Flintoff's 17-year-old son Rocky has joined his dad's team, Northern Superchargers, as a wildcard pick for The Hundred 2025 — just days after scoring a century against India U-19 in a Youth ODI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zak-crawley-poor-form-boycott-calls-dropping-ahead-of-ashes-2756445-2025-07-16",
      "headline": "Crawley has learned nothing in 57 Tests: Boycott wants England to drop openerFormer England cricketer Geoffrey Boycott has called for Zak Crawley to be dropped after a series of disappointing performances. After a steady 65 in the first Test at Headingley, Crawley has struggled to maintain form, managing only 19, 0, 18, and 22 in his subsequent innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-ravi-shastri-missed-chances-lords-test-2756442-2025-07-16",
      "headline": "India could have been 3-0 up with a bit of luck in England series: Ravi ShastriFormer India head coach Ravi Shastri believes that, with a touch more luck, India might have taken a commanding 3-0 lead in the ongoing five-match Test series against England."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}