{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-the-middle-class-is-chasing-expensive-brands-explains-market-expert-2725916-2025-05-16",
      "headline": "Why the middle class is chasing expensive brands, explains market expertA market expert noted that nearly 75% of luxury spending today comes from the middle class, not due to rising incomes, but because of social media, marketing tricks, and peer pressure that fuel the urge to appear successful."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indian-traders-body-boycotts-turkey-and-azerbaijan-over-support-for-pakistan-2725887-2025-05-16",
      "headline": "Indian traders' body boycotts Turkey and Azerbaijan over support for PakistanThe move comes after both Turkey and Azerbaijan openly showed support for Pakistan, at a time when India is facing sensitive national security challenges. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-us-trade-deal-first-phase-likely-to-be-ready-by-july-1-say-sources-2725866-2025-05-16",
      "headline": "India-US trade deal: First phase likely to be ready by July 1, say sourcesIndia and the United States are in negotiations for a trade deal, with sources indicating that phase one could be ready by July 1st. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/un-sees-indian-economy-growing-at-63-percent-as-global-outlook-wobbles-2725850-2025-05-16",
      "headline": "UN sees Indian economy growing at 6.3% as global outlook wobblesAccording to the UN's mid-year update of the World Economic Situation and Prospects (WESP), India's growth is being fuelled by strong household spending and solid government investments. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-slips-200-points-nifty-holds-ground-above-25000-defence-stocks-surge-2725827-2025-05-16",
      "headline": "Sensex slips 200 points, Nifty holds ground above 25,000; defence stocks surgeThe S&P BSE Sensex lost 200.15 points to close at 82,330.59, while the NSE Nifty50 was down 42.30 points to end at 25,019.80."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/upcoming-ipo-next-week-2-public-listing-belrise-industries-borana-weaves-details-gmp-price-band-2725818-2025-05-16",
      "headline": "2 IPOs to open next week: Check Belrise Industries, Borana Weaves detailsWhile Belrise Industries will open for bidding on May 21, investors can bid for the IPO of Borana Weaves starting May 20, 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-2025-is-july-31-your-tax-deadline-find-out-2725807-2025-05-16",
      "headline": "ITR filing 2025: Is July 31 your tax deadline? Find outFiling your return on time helps avoid penalties and delays in refunds. It also keeps your financial records in order. So, if your deadline is July 31, skip the last-minute rush and file in advance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-2025-is-digital-form-16-a-game-changer-for-salaried-taxpayers-2725775-2025-05-16",
      "headline": "ITR filing 2025: Is digital Form 16 a game-changer for salaried taxpayers?Digital Form 16 is an electronic version of the traditional Form 16. It's generated directly from the TRACES portal, which is managed by the Income Tax Department. This means all your salary details, TDS, and tax-saving deductions are recorded accurately and match what the government sees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/government-clears-187-startups-for-tax-relief-heres-what-it-means-2725727-2025-05-16",
      "headline": "Government clears 187 startups for tax relief. Here's what it meansTo qualify, the start-up must be recognised by the Department for Promotion of Industry and Internal Trade (DPIIT). It should be a private limited company or a limited liability partnership and its turnover should not cross Rs 100 crore in any year since incorporation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pakistan-latest-imf-funding-what-can-be-done-india-oppose-economic-collapse-terror-support-2725731-2025-05-16",
      "headline": "What Pakistan can and can't do with IMF loanThe International Monetary Fund (IMF) has approved a fresh loan package for Pakistan, agreeing to release USD 1 billion under its Extended Fund Facility (EFF)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/defence-stocks-extend-rally-on-possible-rs-50000-crore-budget-boost-should-you-buy-sell-or-hold-2725720-2025-05-16",
      "headline": "Defence stocks extend rally on possible budget boost. What should investors do?The NSE Nifty India Defence index surged over 5% intraday on Friday. Cochin Shipyard and GRSE have been leading the charge, with the latter gaining a stunning 30% since May 13."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/singtel-offloads-12-percent-stake-in-bharti-airtel-in-154-billion-deal-2725693-2025-05-16",
      "headline": "Singtel offloads 1.2% stake in Bharti Airtel in $1.54 billion dealSingtel, which has been an investor in Airtel for over 20 years, said its stake would drop to 28.3%, valued at around S$48 billion, from 29.5% previously."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/blaming-nris-wont-solve-indias-housing-problem-says-investor-heres-why-2725672-2025-05-16",
      "headline": "Blaming NRIs won't solve India's housing problem, says investor. Here's whyNRIs earn in strong currencies like US dollars, pounds, or euros. So when they convert that money to rupees, they can afford much more. A house that seems expensive to someone in India may feel quite reasonable to someone earning abroad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/cochin-shipyard-grse-shares-rally-up-to-12-percent-why-are-these-defence-stocks-rising-2725671-2025-05-16",
      "headline": "Cochin Shipyard, GRSE rally up to 12%: Why are these defence stocks rising?Cochin Shipyard jumped 12.51% to Rs 2,039 on the BSE at around 11:47 am, extending its rally for a sixth straight session. GRSE climbed 11.10% intraday to Rs 2,510, taking its cumulative gains to over 30% since announcing results post-market on May 13."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stop-us-travel-turkey-tourism-boycott-us-deal-missile-ace-investor-shankar-sharma-2725670-2025-05-16",
      "headline": "Stop all bookings to America, warns ace investor as Indians ditch TurkeyTourism to Turkey and Azerbaijan has already taken a major hit, especially after reports that Pakistan used Turkish-made drones in its recent strikes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/borana-weaves-ipo-to-open-may-20-check-gmp-expected-listing-gains-2725648-2025-05-16",
      "headline": "Borana Weaves IPO to open May 20: Check GMP, expected listing gainsAccording to grey market trends, the IPO is commanding a premium of Rs 55 per share, suggesting potential listing gains of over 25% for successful applicants."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/apple-assures-india-manufacturing-plans-intact-despite-donald-trump-remarks-2725630-2025-05-16",
      "headline": "Apple assures India manufacturing plans intact despite Trump remarks: ReportWhile Apple has not issued a public statement, sources said the company reaffirmed to Indian officials that India remains a key part of its global supply chain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/yes-bank-share-price-stock-in-focus-today-sebi-probe-stake-sale-japan-sbmc-2725615-2025-05-16",
      "headline": "Explained: Why Yes Bank shares are in focus todayYes Bank stock: The shares fell over 1% in early trade but later recovered to trade in the green. At the start of the day, Yes Bank shares opened at Rs 21.50, slightly below Thursday's close of Rs 21.51."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pakistan-offers-zero-tariff-bilateral-trade-deal-to-us-report-2725614-2025-05-16",
      "headline": "Pakistan offers zero-tariff bilateral trade deal to US: ReportThe development comes shortly after US President Donald Trump claimed credit for brokering a ceasefire between India and Pakistan, following four days of intense cross-border hostilities involving drones and missile strikes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/bharti-airtel-share-price-falls-3-percent-in-early-trade-today-2725602-2025-05-16",
      "headline": "Explained: Why Bharti Airtel shares fell 3% in early trade today At 9:35 am, shares of Bharti Airtel were trading 2.69% lower at Rs 1,816.60 on the Bombay Stock Exchange (BSE)."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/indusind-bank-share-price-down-1-percent-internal-audit-report-rs-674-crore-interest-wrong-2725600-2025-05-16",
      "headline": "IndusInd bank shares down 2% after private lender flags interest mistakeIndusInd bank stock opened at Rs 735.95 after having closed at Rs 780.30 in the previous session. The shares have lost 7.29% in the past 5 days, 23.55% over the last 6 months, and 45.48% over the past year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-200-points-nifty-remains-above-25000-indusind-bank-down-3-2725598-2025-05-16",
      "headline": "Sensex, Nifty open lower after yesterday's rally; IndusInd Bank down 3%The BSE Sensex was down 226.18 points to 82,304.56 at 9:20 am, while the NSE Nifty50 fell 67.80 points to trade at 24,994.30."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-prediction-today-sensex-nifty-opening-higher-dalal-street-trading-rally-nse-bse-2725577-2025-05-16",
      "headline": "Stock market today: Sensex, Nifty likely to open higher. Here's whyBoth the Sensex and Nifty touched their highest levels in the last seven months in the last session. So far this week, the Nifty has gained around 4.5% and the BSE Sensex about 4%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-may-16-shares-in-news-today-hyundai-airtel-indusind-bank-bhel-bajaj-auto-nse-bse-trading-2725574-2025-05-16",
      "headline": "Stocks to watch on May 16: Hyundai, Airtel, IndusInd Bank, BHEL, Bajaj AutoHyundai Motor, BHEL, Delhivery, Emami will announce their earnings for the January-March quarter on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/indusind-bank-accounting-error-internal-audit-department-rs-674-crore-incorrect-interest-2725571-2025-05-16",
      "headline": "IndusInd Bank flags Rs 674 crore error as 'incorrectly recorded interest'The bank said its Internal Audit Department (IAD) found that a total of Rs 674 crore was wrongly shown as interest over three quarters in FY 2024-25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-offered-zero-tariff-trade-deal-donald-trump-2725297-2025-05-15",
      "headline": "India offered zero-tariff trade deal: Donald TrumpUS President Donald Trump claimed that India has offered the United States a trade deal with \"literally zero tariffs\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/yes-bank-shares-jump-21-percent-in-5-days-what-investors-need-to-know-2725245-2025-05-15",
      "headline": "YES Bank shares jump 21% in 5 days. What investors need to knowSMBC, a part of the Sumitomo Mitsui Financial Group (SMFG), plans to buy the 20% stake from State Bank of India (SBI) and seven private banks, HDFC Bank, ICICI Bank, Kotak Mahindra Bank, Axis Bank, IDFC First Bank, Federal Bank, and Bandhan Bank. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-ends-1200-points-higher-nifty-above-25000-tata-motors-surges-4-percent-2725220-2025-05-15",
      "headline": "Sensex ends 1,200 points higher, Nifty above 25,000; Tata Motors surges 4%The S&P BSE Sensex surged 1,200.18 points to end at 82,530.74, while the NSE Nifty50 gained 395.60 points to close at 25,062.10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-claims-india-offered-zero-tariff-deal-in-trade-talks-2725187-2025-05-15",
      "headline": "Donald Trump claims India has offered zero-tariff deal in trade talksSpeaking at a business forum in Qatar, Trump said, \"India has offered us a deal where basically they are willing to literally charge us no tariff.\" He didn't provide further details, and there was no immediate response from the Indian government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/planning-a-personal-loan-7-hidden-charges-you-must-know-about-processing-fee-late-payment-fee-emi-bounce-charges-2725178-2025-05-15",
      "headline": "Planning a personal loan? 7 hidden charges you must know aboutMany people only look at the interest rate when taking a personal loan. But there are several other costs that can add up. Knowing these charges helps you plan better, avoid surprises, and even negotiate some of them with the bank."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-rally-sensex-jumps-1300-points-over-reports-of-india-offering-no-tariff-deal-to-us-nifty-gain-2725179-2025-05-15",
      "headline": "Sensex jumps 1,300 points: Why is stock market rising today?As of 2:38 p.m., the S&P BSE Sensex had gained 1,217.88 points to reach 82,548.44, and the NSE Nifty50 had climbed 410.57 points to 25,077.50."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/fds-vs-ppf-which-investment-option-should-you-choose-and-why-2725126-2025-05-15",
      "headline": "FDs vs PPF: Which investment option should you choose and why?By investing in PPF, you can claim a tax exemption of up to Rs 1.5 lakh under Section 80C in a financial year, under the old tax regime. Moreover, the interest you earn from a PPF account is also tax-free. FDs, however, do not offer any tax deduction unless it's a 5-year tax-saving FD."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/i-dont-want-you-to-build-in-india-they-can-take-care-of-themselves-trump-told-apple-ceo-tim-cook-report-2725124-2025-05-15",
      "headline": "Don't want you building in India, Trump tells Apple CEO Tim CookTrump's remarks came just days after India threatened to impose retaliatory tariffs on the US. This was in response to the US raising duties on Indian steel and aluminium exports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/mutual-funds-load-up-on-it-cut-fmcg-and-telecom-stakes-in-april-report-2725083-2025-05-15",
      "headline": "Mutual funds load up on IT, cut FMCG and telecom stakes in April: ReportKotak Mahindra Bank attracted the highest MF investment in the financial sector, with Rs 1,586 crore. IDFC First Bank and HDFC Bank followed, drawing Rs 1,150 crore and Rs 1,026 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/tata-motors-share-price-rise-3-percent-why-reason-curvv-tiago-rashtrapati-bhavan-clsa-rating-2725044-2025-05-15",
      "headline": "Tata Motors shares rise 4% today. Here's whyThe rise in Tata Motors' share price comes even after the company reported a 51% fall in its consolidated net profit to Rs 8,470 crore for the quarter ending March 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/travel-sites-see-spike-in-turkey-azerbaijan-cancellations-over-pakistan-support-makemytrip-ixigo-report-major-cancellations-2725041-2025-05-15",
      "headline": "Travel sites see spike in Turkey, Azerbaijan cancellations over Pakistan supportBoycott calls grow as Turkey and Azerbaijan back Pakistan. Travel sites like MakeMyTrip and ixigo report major cancellations and suspended bookings to these destinations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/raymond-share-price-jumps-5-percent-as-technical-realty-demerger-confusion-fades-2724985-2025-05-15",
      "headline": "Raymond shares jump 5%. Why stock hit upper circuit today?At the Bombay Stock Exchange, Raymond shares were locked at Rs 578.70 in early trade, up 4.99%. The buying comes a day after the stock appeared to lose more than 60% of its value, a fall that was not driven by weak fundamentals or selling pressure but by a mechanical price adjustment."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/ipo/story/virtual-galaxy-infotech-ipo-gmp-listing-gains-rs-87000-stock-market-debut-may-19-sme-2724983-2025-05-15",
      "headline": "Rs 87,000 profit on listing? This IPO's GMP suggests bonanza for investorsVirtual Galaxy Infotech IPO: The IPO received a strong response from all categories of investors as it was subscribed 231.45 times overall."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/why-is-stock-market-falling-today-check-key-reasons-sensex-nifty-decline-2724977-2025-05-15",
      "headline": "Sensex falls over 500 points. Why is stock market falling today?At around 9:47 am, the Sensex was down 516.75 points at 80,839.01 while the Nifty hovered at 24,528.25, down 142.25 points. The selloff, however, remained largely confined to heavyweight largecaps. The broader market showed surprising strength, with midcap and smallcap indices trading firmly in the green."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/blusmart-collapse-banks-lessors-rush-to-offload-2000-evs-says-report-2724971-2025-05-15",
      "headline": "BluSmart collapse: Banks, lessors rush to offload 2,000 EVs, says reportWith BluSmart unable to raise funds and its founders facing regulatory heat, several financiers have begun repossessing the EVs they leased or financed and are now either seeking buyers or looking to lease them to new operators."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/vikrant-massey-in-karan-johars-dostana-2-after-kartik-aaryan-exit-2725896-2025-05-16",
      "headline": "Vikrant Massey in Karan Johar's Dostana 2 after Kartik Aaryan's exit: ReportVikrant Massey is rumoured to be replacing Kartik Aaryan in Karan Johar's much-delayed Dostana 2, which is expected to begin shooting in January 2026. The film will also star Lakshya and introduce a fresh female lead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-jin-shares-heartbreak-anthem-dont-say-you-love-me-from-album-echo-2725895-2025-05-16",
      "headline": "BTS' Jin shares heartbreak anthem Don't Say You Love Me from album EchoBTS's Jin dropped the new music video for the title track, 'Don't Say You Love Me', featuring actor Shin Se-kyung. The song is a part of his album, 'Echo'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/assamese-singer-gayatri-hazarika-dies-at-44-assam-mourns-a-cultural-icon-2725885-2025-05-16",
      "headline": "Assamese singer Gayatri Hazarika dies at 44; Assam mourns a cultural iconAssamese singer Gayatri Hazarika had been battling colon cancer for some time. The popular Assamese icon died at a hospital in Guwahati. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ajay-devgn-riteish-deshmukhs-dhamaal-4-gears-up-for-eid-2026-release-2725870-2025-05-16",
      "headline": "Ajay Devgn-Riteish Deshmukh's Dhamaal 4 gears up for Eid 2026 releaseAjay Devgn's Dhamaal 4 is scheduled to release on Eid 2026. The Indra Kumar-directorial also features Riteish Deshmukh and Arshad Warsi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/jacqueline-fernandez-brings-old-hollywood-glam-to-cannes-2025-in-red-gown-pics-2725869-2025-05-16",
      "headline": "Jacqueline Fernandez brings old Hollywood glam to Cannes 2025 in red gown. PicsActor Jacqueline Fernandez walked the red carpet of the Cannes International Film Festival as part of the 'Women in Cinema' gala. The actor looked stunning in her jewelled shirt, and also in her red corset gown. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/shin-chan-will-dance-to-bollywood-songs-in-upcoming-film-2725669-2025-05-16",
      "headline": "Kurta-clad Shin Chan will dance to Bollywood songs in upcoming film. DetailsShin Chan's new movie, 'Shin Chan: The Spicy Kasukabe Dancers', will be released in theatres in India this October. Our favourite troublemaker is coming back in a desi avatar. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sham-kaushal-note-for-vicky-kaushal-brother-sunny-kaushal-sends-wishes-2725819-2025-05-16",
      "headline": "Love you puttar: Sham Kaushal's note for Vicky, brother Sunny sends wishesVicky Kaushal's father, Sham, extended his birthday wishes to his son with a heartfelt note. The actor's brother, Sunny Kaushal, also sent his love. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-consoles-emotional-crew-member-at-subham-event-fans-call-her-gold-2725817-2025-05-16",
      "headline": "Samantha consoles emotional crew member at Subham event, fans call her 'gold'Actor Samantha often wins hearts on the internet with her thoughtful gestures. In yet another touching moment captured at the success bash of 'Subham', she was seen consoling an emotional crew member while addressing the media on stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ananya-panday-shuts-down-getting-butt-done-rumours-my-body-is-filling-out-2725811-2025-05-16",
      "headline": "My body is filling out: Ananya Panday shuts down 'getting butt done' rumoursAnanya Panday commented on being subjected to body-shaming. The actor addressed the rumours of getting buttock enhancement surgery done in an interview with Lilly Singh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-and-raj-nidimoru-living-together-amid-affair-rumours-2725784-2025-05-16",
      "headline": "Samantha and Raj Nidimoru 'considering living together' amid affair rumours: ReportActor Samantha Ruth Prabhu and director Raj Nidimoru are 'considering living together' amid affair rumours, according to a recent report. Samantha acted in Raj's spy action-thriller show, 'Ciatdel: Honey Bunny'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anupam-kher-reunites-with-the-legendary-actor-robert-de-niro-at-cannes-2725762-2025-05-16",
      "headline": "The legends reunite: Anupam Kher, Rober De Niro in a picture perfect Cannes momentIndian actor Anupam Kher reunited with his 'Silver Linings Playbook' co-star and long-time friend, Hollywood legend Robert De Niro, at the 78th Cannes Film Festival."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/showbuzz/reviews/story/dd-next-level-review-santhanam-prem-anand-gautham-menon-dhilluku-dhuddu-2725776-2025-05-16",
      "headline": "DD Next Level review: Few gags aside, Santhanam's film is mostly tortureReleased-Fri May 16, 2025DD Next Level movie review: Director Prem Anand's 'DD Next Level', starring Santhanam, Selvaraghavan and Geethika Tiwary, is a horror movie spoof. Barring a few fun gags, the film is replete with outdated fart jokes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/tourist-family-ott-release-when-and-where-to-watch-sasikumar-simran-film-2725722-2025-05-16",
      "headline": "Tourist Family OTT Release: When and where to watch Sasikumar-Simran's film'Tourist Family', the emotional Tamil drama, is set to stream on JioHotstar from May 31 after a successful theatrical run. The film made history as the first small-budget Tamil movie to be screened in the UK's prestigious SUPERSCREEN format."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/neena-gupta-sings-dum-maaro-dum-to-baby-matara-in-cute-nani-over-mozart-moment-2725773-2025-05-16",
      "headline": "Neena Gupta sings Dum Maaro Dum to baby Matara in cute 'Nani over Mozart' momentActor Neena Gupta was seen singing 'Dum Maaro Dum' to her granddaughter Matara in a heartwarming moment shared by Masaba Gupta. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karan-johar-announces-new-podcast-pushes-for-meaningful-conversations-and-honest-answers-2725766-2025-05-16",
      "headline": "Karan Johar pushes for 'meaningful conversations and honest answers' in new podcastFilmmaker Karan Johar has now turned into a podcaster with a new stint. He announced that he would be rooting for 'meaningful conversations' in a refreshing move after hosting a gossip show, 'Koffee With Karan', for years. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/michael-jordon-attends-tom-cruise-mission-impossible-the-final-reckoning-london-screening-2725763-2025-05-16",
      "headline": "Michael Jordon attends Tom Cruise's Mission Impossible screening, share warm momentActors Michael B Jordon and Tom Cruise embraced at 'Mission: Impossible - The Final Reckoning' premiere in London. Jordon shared the heart-warming moment on social media. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sidharth-malhotra-tamannaah-bhatia-vvan-release-in-may-2026-2725748-2025-05-16",
      "headline": "Sidharth Malhotra, Tamannaah Bhatia's Vvan set for summer release. Check dateSidharth Malhotra and Tamannaah Bhatia's 'Vvan' to release in theatres on May 15, 2026. The makers shared a post on social media and announced the same. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tom-cruise-makes-influencer-niharika-nms-dream-come-true-at-mi-8-premiere-2725694-2025-05-16",
      "headline": "Tom Cruise makes influencer Niharika NM's 'dream come true' at MI 8 premiereActor Tom Cruise made Indian influencer Niharika NM's 'dream come true'. The latter shared a glimpse of her meeting with the Hollywood actor from the MI 8 premiere."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karan-johar-says-those-still-branding-alia-bhatt-with-nepotism-are-idiotic-2725711-2025-05-16",
      "headline": "Karan Johar says those still branding Alia Bhatt with nepotism are 'idiotic' Filmmaker Karan Johar once again defended Alia Bhatt against those who call her a product of nepotism in the film industry. He also talked about the backlash that his film 'Nadaaniyan' received for launching another star-kid. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/tulbul-project-omar-abdullah-mehbooba-mufti-indus-waters-treaty-jammu-kashmir-india-pak-conflict-2725855-2025-05-16",
      "headline": "Omar Abdullah vs Mehbooba Mufti over water project after India pauses Indus treatyWhile Omar Abdullah has advocated for the revival of the Tulbul project after India suspended the Indus Waters Treaty with Pakistan, Mehbooba Mufti labelled his suggestion \"deeply unfortunate\" and \"dangerously provocative\"."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/gujarat-media-baron-arrested-in-money-laundering-case-gets-bail-within-hours-2725932-2025-05-16",
      "headline": "Gujarat Samachar owner gets bail on health grounds hours after arrest by EDBahubali Shah, the co-owner of Gujarat Samachar who was arrested by the ED in a money laundering case earlier today, was granted bail on health grounds."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-deputy-pm-foreign-minister-ishaq-dar-prey-to-own-fake-news-fact-checked-by-pak-media-2725750-2025-05-16",
      "headline": "Pakistan's anti-India propaganda has a victim, its Deputy PM Ishaq DarIn a stunning self-goal, Pakistan's Deputy PM Ishaq Dar quoted a fake headline from a digitally altered frontpage of British newspaper, The Daily Telegraph. Ironically, the fake page had been promoted by the Pakistani establishment's disinformation brigade. Adding to Dar's embarrassment, the farce was also fact-checked by the Pakistani media."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/indian-mountaineer-dies-while-descending-mt-everest-efforts-on-to-retrieve-body-2725780-2025-05-16",
      "headline": "Indian mountaineer dies while descending Mt Everest, efforts on to retrieve bodyDuring the descent, mountaineer Subrata Ghosh became exhausted and showed signs of altitude sickness, ultimately leading to his death. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/operation-sindoor-india-pakistan-war-1965-how-param-vir-chakra-abdul-hamid-destroyed-patton-tanks-rcl-gun-asal-uttar-2725726-2025-05-16",
      "headline": "India's war hero who created a graveyard of Pak's Patton tanks with a gunThe 1965 Indo-Pak War saw the biggest tank battle since World War II. Indian Army Havildar Abdul Hamid drove around in a jeep, mounted with a recoilless gun, through sugarcane fields, destroying Pakistan's US-made Patton tanks. Hamid destroyed up to 12 tanks and laid his life in the line of duty. He was awarded the Param Vir Chakra, India's highest wartime gallantry award."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pak-offering-financial-aid-to-terror-outfits-imf-must-rethink-loan-to-nation-rajnath-singh-at-bhuj-airbase-2725709-2025-05-16",
      "headline": "Pak to give Rs 14 crore to Masood Azhar, IMF must rethink loan: Rajnath SinghRajnath Singh, speaking at the Bhuj airbase, claimed that Pakistan has announced financial aid to rebuild the terror infrastructure of Lashkar-e-Taiba and Jaish-e-Mohammed in Muridke and Bahawalpur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/us-army-warfare-expert-operation-sindoor-india-military-superior-pakistan-china-air-defence-2725651-2025-05-16",
      "headline": "Chinese, Pak air defence systems no match for India's BrahMos: US warfare expertOperation Sindoor: Colonel (Retd) John Spencer said India demonstrated both offensive and defensive superiority during Operation Sindoor, sending a message that it can hit 'anywhere in Pakistan, anytime'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/the-lowdown/story/frenemies-india-afghanistan-taking-again-jaishankar-taliban-pakistan-conflict-2725710-2025-05-16",
      "headline": "Why frenemies India and Afghanistan are talking againOn Friday, S Jaishankar spoke with his Afghan counterpart. It was the first political-level contact between India and Afghanistan since the Taliban seized power. In this edition of The Lowdown, we explain India's past relationship with the Taliban and how the latest development indicates a new bend in the topsy-turvy path to Kabul."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anupam-kher-reunites-with-the-legendary-actor-robert-de-niro-at-cannes-2725762-2025-05-16",
      "headline": "The legends reunite: Anupam Kher, Robert De Niro in a picture perfect Cannes momentIndian actor Anupam Kher reunited with his 'Silver Linings Playbook' co-star and long-time friend, Hollywood legend Robert De Niro, at the 78th Cannes Film Festival."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/an-architectural-trail-in-gujarat-2723608-2025-05-15",
      "headline": "An Architectural Trail in GujaratPress Release | Vadnagar has substantial remains of its ancient Buddhist heritage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/who-is-bahubali-shah-gujarat-samachar-media-baron-ed-arrest-money-laundering-2725858-2025-05-16",
      "headline": "Who is Bahubali Shah, Gujarat media baron arrested in money laundering case?The ED on Friday arrested Bahubali Shah, the co-owner of Gujarat's largest daily, Gujarat Samachar. The arrest has triggered a political storm in the state, bringing into spotlight a newspaper founded 92 years ago in 1932."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/former-fbi-chief-james-comey-assassination-threat-donald-trump-8647-post-2725603-2025-05-16",
      "headline": "What is 8647, the cryptic post by ex-FBI chief hinting Trump assassination?James Comey, who was fired by Trump during his first term, has deleted the post after he faced severe backlash from Republicans and members of Congress."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/opinion/story/india-has-defused-pak-biggest-weapon-its-ability-to-cry-nuclear-wolf-2725774-2025-05-16",
      "headline": "India has defused Pak's biggest weapon - its ability to cry nuclear wolfIn a bid to deter India from responding to cross-border terrorism mounted by organisations nurtured and supported by elements of the Pakistani state - a fact that is well recognised today - it resorts to making thinly veiled nuclear threats."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/donald-trumps-desert-stormy-daniels-hot-heavy-and-steamy-qatar-khosla-ka-ghosla-india-pakistan-war-2725658-2025-05-16",
      "headline": "Donald Trump's Gulf Tour: Hot, Heavy and StormyFrom gorgeous trade deals to sheikhing it with a man with a bounty on his head, Trump's geopolitics, driven by a shrinking lexicon and fixation on wealth, turns global affairs into a flashy, hot and heavy spectacle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/doha-diamond-league-neeraj-chopra-preview-90m-jan-zelezny-coach-2725576-2025-05-16",
      "headline": "With Zelezny in his corner, fit-again Neeraj Chopra aims to join 90m club in DohaInjury-free and working with legendary coach Jan Železný, Neeraj Chopra is eyeing the elusive 90m mark as he kicks off his 2025 season in Doha. The two-time Olympic medallist is confident and in form, looking to join the elite club at a venue famed for big javelin throws."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/dust-storm-delhi-weather-department-sounds-orange-alert-2725888-2025-05-16",
      "headline": "Weather department sounds orange alert as dust storm likely in Delhi todayThe India Meteorological Department has issued an orange alert for Delhi. Some parts of the city experienced heavy rain today. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/dr-rooma-sinha-completes-1000-robotic-gynaecological-surgeries-india-2725696-2025-05-16",
      "headline": "Inside the OR: Meet the Indian doctor behind 1,000 robotic surgeriesDr Rooma Sinha becomes the first Indian gynaecologist to complete over 1,000 robotic surgeries. She opens about robotic surgery and how it can empower women to focus on their health."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/india-was-on-top-message-was-it-can-hit-anywhere-in-pak-at-any-time-us-warfare-expert-2725788-2025-05-16",
      "headline": "India was on top, message was it can hit anywhere in Pak at any time: US expertIn a strong endorsement of Operation Sindoor, American urban warfare expert Colonel (Retd) John Spencer praised India's display of both offensive and defensive dominance. He stated that the operation sent a clear message: India can strike \"anywhere in Pakistan, anytime.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pakistan-latest-imf-funding-what-can-be-done-india-oppose-economic-collapse-terror-support-2725731-2025-05-16",
      "headline": "What Pakistan can and can't do with IMF loanThe International Monetary Fund (IMF) has approved a fresh loan package for Pakistan, agreeing to release USD 1 billion under its Extended Fund Facility (EFF)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-conflict-military-action-all-party-foreign-tour-army-2725633-2025-05-16",
      "headline": "India to mount diplomatic offensive on Pak, send MPs to brief countriesA delegation of MPs from all political parties will begin an outreach tour after May 22 to brief foreign nations on the recent India-Pakistan conflict and India's stance, sources said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/kerala-woman-drives-caravan-to-ladakh-with-family-of-7-shares-videos-of-dream-journey-2725683-2025-05-16",
      "headline": "Kerala woman drives caravan to Ladakh with family, shares videos of dream journeyThe videos show the family engaging in heartwarming activities - sharing meals, cleaning the caravan, chatting, and enjoying the journey together as they cruise through diverse landscapes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-operation-sindoor-airbase-military-posts-singh-chief-minister-bholari-air-base-2725752-2025-05-16",
      "headline": "Op Sindoor killed 6 Air Force staff at Bholari airbase, Pak Chief Minister confirmsThe Chief Minister of Sindh confirmed that Indian air strikes targeted the Bholari airbase, killing six air force personnel, thereby validating India's claim of striking military targets and countering Islamabad's civilian casualty allegations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/thank-trump-for-peace-kashmiri-waiter-told-me-in-doha-white-house-secretary-glbs-2725541-2025-05-16",
      "headline": "My waiter from Kashmir said...: Trump aide Karoline Leavitt's tweet goes viralWhite House Press Secretary Karoline Leavitt credited President Trump for brokering an India-Pakistan ceasefire, citing a Kashmiri waiter's gratitude, despite Indian officials denying US involvement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/global-life-expectancy-decline-pandemic-mental-health-maternal-child-deaths-who-report-2725846-2025-05-16",
      "headline": "WHO reports biggest drop in global life expectancy since Covid-19 pandemicThe World Health Organisation reports a 1.8-year drop in global life expectancy due to the Covid-19 pandemic. The findings highlight urgent challenges in mental health, maternal care, and health worker shortages worldwide."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-josh-hazlewood-not-returned-mo-bobat-rcb-vs-kkr-confirmed-2725918-2025-05-16",
      "headline": "RCB director confirms Josh Hazlewood yet to join squad for IPL resumptionRCB Director of Cricket Mo Bobat confirmed Josh Hazlewood remains in rehab under the joint supervision of Cricket Australia and RCB, casting further doubt on his return for IPL 2025's decisive final stretch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-virat-kohli-test-retirement-rcb-vs-kkr-mo-bobat-2725919-2025-05-16",
      "headline": "Virat Kohli doesn't want more attention on Test retirement: RCB directorRCB director of cricket Mo Bobat said that Virat Kohli doesn't want more attention on his Test retirement and just wants to go about his business in the IPL 2025. Kohli made his Test retirement on May 12. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pro-kabaddi-league-season-12-auction-dates-mumbai-2725886-2025-05-16",
      "headline": "Pro Kabbadi League Season 12 auction to take place in Mumbai on May 31, June 1The Pro Kabaddi League Season 12 auction dates have been revealed and the event will take place in Mumbai. The PKL auction 2025 will take place on May 31 and June 1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-pakistan-cricket-tour-rescheduled-border-tensions-psl-final-clash-2725879-2025-05-16",
      "headline": "Bangladesh tour to Pakistan likely to be rescheduled due to India-Pakistan tensionThe Bangladesh cricket tour of Pakistan is likely to be rescheduled due to recent India-Pakistan border tensions. The conflict and PSL final clash have complicated scheduling, with official dates yet to be announced."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-retirement-ravi-shastri-scg-test-snub-border-gavaskar-trophy-2725849-2025-05-16",
      "headline": "Shastri reveals chat with Rohit about missing SCG Test: Series wasn't overRavi Shastri said he talked with Rohit Sharma about his decision to drop himself for the SCG Test against Australia during the Border-Gavaskar Trophy 2024-25. Rohit recently announced his retirement from Tests. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rcb-vs-kkr-benagluru-weather-prediction-rain-thunderstorm-threat-chinnaswamy-2725844-2025-05-16",
      "headline": "RCB vs KKR, Weather Forecast: Will rain at Chinnaswamy dampen IPL resumption?RCB's near-assured playoff dreams and KKR's survival hopes could be at the mercy of Bengaluru's unpredictable skies, as heavy thunderstorms loom over the IPL 2025's highly anticipated return clash at the Chinnaswamy Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/sneh-rana-exclusive-interview-dream-india-comebacks-england-t20is-2725842-2025-05-16",
      "headline": "Sneh Rana chuffed with dream India comebacks after long waitIn an exclusive chat with India Today Digital, Indian women's all-rounder Sneh Rana spoke about her stupendous ODI series in Sri Lanka where she took 15 wickets and her T20I recall after two years for the tour of England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-suspension-rcb-mo-bobat-bengaluru-2725823-2025-05-16",
      "headline": "Thought IPL 2025 would be called off: Mo Bobat recalls eve of suspensionRCB's director of cricket Mo Bobat said that he thought the IPL 2025 season would be called off for a period of time after the tournament was initially suspended after the PBKS vs DC game in Dharamshala was called off. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rajat-patidar-rcb-captaincy-virat-kohli-confidence-deserve-it-2725781-2025-05-16",
      "headline": "Rajat Patidar opens up on Virat Kohli's influence during RCB captaincy shiftRajat Patidar opened up on the pressure of leading RCB in IPL 2025 and how Virat Kohli's faith in him gave the young skipper confidence to take charge and steer the team towards a strong campaign."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-shubman-gill-wasim-jaffer-india-captain-2725740-2025-05-16",
      "headline": "Bumrah automatic choice as captain, Shubman vice-captain: Wasim JafferWasim Jaffer said that Jasprit Bumrah should be appointed as the new Indian Test captain, replacing Rohit Sharma, who recently retired from the purest format. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-will-jacks-india-return-instagram-story-mumbai-indians-2725706-2025-05-16",
      "headline": "Will Jacks confirms India return with special post as MI get major boostWill Jacks shared a photo from his flight to Mumbai, confirming his return for the remainder of IPL 2025 and handing Mumbai Indians a timely boost as other overseas stars continue to opt out."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/sneh-rana-exclusive-interview-dream-india-comebacks-england-t20is-2725842-2025-05-16",
      "headline": "Sneh Rana chuffed with dream India comebacks after long waitIn an exclusive chat with India Today Digital, Indian women's all-rounder Sneh Rana spoke about her stupendous ODI series in Sri Lanka where she took 15 wickets and her T20I recall after two years for the tour of England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-suspension-rcb-mo-bobat-bengaluru-2725823-2025-05-16",
      "headline": "Thought IPL 2025 would be called off: Mo Bobat recalls eve of suspensionRCB's director of cricket Mo Bobat said that he thought the IPL 2025 season would be called off for a period of time after the tournament was initially suspended after the PBKS vs DC game in Dharamshala was called off. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rajat-patidar-rcb-captaincy-virat-kohli-confidence-deserve-it-2725781-2025-05-16",
      "headline": "Rajat Patidar opens up on Virat Kohli's influence during RCB captaincy shiftRajat Patidar opened up on the pressure of leading RCB in IPL 2025 and how Virat Kohli's faith in him gave the young skipper confidence to take charge and steer the team towards a strong campaign."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-shubman-gill-wasim-jaffer-india-captain-2725740-2025-05-16",
      "headline": "Bumrah automatic choice as captain, Shubman vice-captain: Wasim JafferWasim Jaffer said that Jasprit Bumrah should be appointed as the new Indian Test captain, replacing Rohit Sharma, who recently retired from the purest format. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-will-jacks-india-return-instagram-story-mumbai-indians-2725706-2025-05-16",
      "headline": "Will Jacks confirms India return with special post as MI get major boostWill Jacks shared a photo from his flight to Mumbai, confirming his return for the remainder of IPL 2025 and handing Mumbai Indians a timely boost as other overseas stars continue to opt out."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}