{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/foreign-investors-fpis-stock-market-selloff-q2-earnings-downgrade-trump-trade-high-valuations-ipos-2634365-2024-11-16",
      "headline": "Why are foreign investors exiting India? 3 reasons behind stock market selloffExperts suggest that the trajectory of future FPI flows will largely depend on how India maintains macroeconomic stability and improves corporate earnings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ntpc-green-energy-ipo-gmp-price-band-key-dates-other-details-2634349-2024-11-16",
      "headline": "NTPC Green Energy IPO: Check key dates, price band, and latest GMPNTPC Green Energy IPO: The IPO is positioned as one of the largest in India this year, alongside Hyundai Motor India Ltd. and Swiggy Ltd. The anchor book will open for subscription on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-price-biggest-weekly-drop-in-3-years-should-you-buy-sell-expert-views-2634341-2024-11-16",
      "headline": "Gold rates see biggest weekly drop in 3 years. Good time to buy?Despite the fall in prices, analysts remain bullish about the yellow metal's long-term potential. Here is all you need to know. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/public-listings-fall-flat-is-ipo-market-losing-its-charm-hyundai-swiggy-ntpc-green-energy-2633955-2024-11-15",
      "headline": "Is the IPO craze over? Stock market correction hits public listingsSubscription figures for IPOs have dropped in recent months. Global economic uncertainty, rising interest rates, and tighter liquidity have made investors cautious."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ntpc-green-energy-ipo-key-details-10-things-to-know-before-subscribing-review-price-gmp-2633922-2024-11-15",
      "headline": "NTPC Green Energy IPO: 10 things to know before subscribingNTPC Green Energy is a wholly-owned subsidiary of NTPC Ltd, focusing on renewable energy projects through both organic growth and acquisitions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/narayana-murthy-i-dont-believe-in-work-life-balance-6-day-workweek-debate-2633876-2024-11-15",
      "headline": "I don't believe in work-life balance: Narayana MurthyNarayana Murthy said that hard work is key to national progress, citing Prime Minister Narendra Modi's long work hours as an example. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/atv-projects-india-lic-multibagger-stock-rs-1-lakh-investment-now-worth-rs-8-lakh-2633835-2024-11-15",
      "headline": "Rs 1 lakh investment now worth Rs 8 lakh: Check this LIC-backed penny stockATV Projects India has shown remarkable growth over recent years, making it one of the standout multibagger stocks in the Indian market. Since the start of 2024, the stock has risen by over 110%, moving from Rs 15.25 to Rs 32.50 per share."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-sensex-nifty-free-fall-good-time-to-invest-mutual-funds-2633831-2024-11-15",
      "headline": "Stock markets in free fall: Is it a good time to invest in mutual funds?With the Sensex and Nifty tumbling nearly 10% from their peaks, investors are wondering: Could this market correction be a blessing in disguise for mutual fund investors?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-correction-crisis-dalal-street-sensex-nifty-outlook-brokerage-expert-views-2633803-2024-11-15",
      "headline": "Stock markets in correction phase: More turbulence ahead on Dalal Street?The Sensex and Nifty have tumbled nearly 10% from their recent peaks, leaving investors wondering: Is this just a healthy pause, or should they brace for more turbulence?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sbi-hikes-home-loan-interest-rates-by-5-basis-points-check-details-november-15-2633789-2024-11-15",
      "headline": "SBI hikes home loan interest rates by 5 basis points. Check details  The change in interest rates is effective from November 15, and will make borrowing costs slightly higher for customers seeking loans from the State Bank of India (SBI)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/signature-global-share-price-target-rs-2000-brokerages-bullish-icici-motilal-oswal-2633769-2024-11-15",
      "headline": "Signature Global shares at over Rs 2,000? These 2 brokerages are bullishShares of Signature Global rose nearly 3.5% in the previous trading session after multiple brokerages raised their target price. Its total market capitalisation stands at 18,238.99 crore."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/piyush-goyal-wants-rbi-to-cut-interest-rates-shaktikanta-das-responds-mpc-meeting-december-2633674-2024-11-15",
      "headline": "Piyush Goyal wants RBI to cut interest rates. Shaktikanta Das respondsUnion Minister Piyush Goyal described the link between food inflation and interest rates as an 'absolutely flawed theory.'"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/narayana-murthy-infosys-founder-stands-firm-on-6-day-workweek-pm-modi-2633642-2024-11-15",
      "headline": "I'll take this with me to grave: Narayana Murthy defends 6-day workweek viewNarayana Murthy, who has been vocal about his views on work ethics and productivity, expressed disappointment over India's move from a six-day workweek to a five-day one in 1986. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wolf-in-sheeps-clothing-kutniti-report-flags-elon-musk-starlink-us-military-intelligence-ties-india-entry-plans-2633628-2024-11-15",
      "headline": "'Wolf in sheep's clothing': Report flags Starlink's US military tiesStarlink operates through a constellation of satellites to provide internet access worldwide, a model distinct from traditional telecom services that rely on ground-based towers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-nse-bse-closed-today-holiday-guru-nanak-jayanti-no-trading-sensex-nifty-2633616-2024-11-15",
      "headline": "Stock markets closed today for Guru Nanak Jayanti holiday?Sensex and Nifty, have faced a six-session losing streak, marked by selling pressure from foreign institutional investors (FIIs) and worries over rising retail inflation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/siemens-may-cut-up-to-5000-jobs-amid-ongoing-struggles-2633486-2024-11-14",
      "headline": "Siemens layoffs: Tech giant may cut up to 5,000 jobs amid ongoing strugglesThe company's Q4 FY 2024 results highlighted the impact of global geopolitical and macroeconomic challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-nifty-fall-six-straight-sessions-fii-selling-continues-fmcg-shares-2633390-2024-11-14",
      "headline": "Sensex, Nifty fall for 6th straight session as FMCG stocks decline sharplyThe S&P BSE Sensex ended 110.64 points lower at 77,580.31 at the closing bell, while the NSE Nifty50 fell 26.35 points to 23,532.70."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-poor-service-standards-bureau-of-indian-standards-investigation-2633362-2024-11-14",
      "headline": "More trouble for Ola Electric, faces probe over poor service standards: ReportThis comes after the Central Consumer Protection Authority (CCPA) issued a notice to the SoftBank-backed e-scooter maker following a high volume of complaints."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/boeing-layoffs-aerospace-giant-reduce-workforce-by-17000-warn-letter-2633348-2024-11-14",
      "headline": "Boeing layoffs: Aerospace giant to reduce workforce by 17,000Boeing Layoffs: The aerospace giant has faced financial challenges this year, pushing it to make these deep cuts to realign its current financial realities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdfc-icici-sbi-itc-titan-stocks-sector-safe-bet-market-fall-infrastructure-housing-finance-investing-tips-2633338-2024-11-14",
      "headline": "Markets in free fall: These sectors and stocks can be safe betsBoth the Sensex and Nifty indices have fallen around 10% from their 52-week peaks, marking a notable slump in the market."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/manipur-violence-jiribam-kuki-meitei-n-biren-singh-ministers-mlas-protest-militants-curfew-2634597-2024-11-17",
      "headline": "Manipur wants AFSPA revoked as violence flares up, Biren Singh's house targetedViolence erupted in Manipur on Saturday after the bodies of six people, who had gone missing from a relief camp in Jiribam, were recovered."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-long-range-hypersonic-missile-drdo-army-rajnath-singh-test-trial-2634622-2024-11-17",
      "headline": "India successfully tests first long-range hypersonic missile, joins select clubThe long-range hypersonic missile is designed to carry various payloads for ranges greater than 1500km for the armed forces."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-air-pollution-air-quality-index-severe-category-imd-weather-update-flights-airport-visibility-video-2634620-2024-11-17",
      "headline": "Delhi air quality 'severe', 107 flights delayed, 3 cancelled due to thick smogVisibility at Delhi's Indira Gandhi International (IGI) Airport dropped to 800 meters at 7:30 am, leading to 107 flights being delayed and 3 cancelled, according to Flightradar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/boxing-mike-tyson-retirement-almost-died-jake-paul-fight-highlights-ulcer-2634606-2024-11-17",
      "headline": "I almost died: Mike Tyson hints at retirement, recalls health battleLegendary Mike Tyson took to X after his fight against Logan Paul and opened up on the health scare that he faced before the bout. Tyson revealed that he almost died in June and had to begin his training from scratch to get ready for the November 15 fight. He also hinted at his retirement.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/why-high-school-relationships-fail-even-after-years-of-togetherness-2634582-2024-11-17",
      "headline": "Why most high-school relationships fail, even after years of togethernessDeep friendship, emotional connection, and comfort can keep high-school sweethearts together, even as they navigate life with an expanded horizon. However, chances are high that one or both partners can grow apart later on."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-plays-justice-for-all-mar-a-lago-us-capitol-attack-insurrection-riot-prisoners-pardon-2634625-2024-11-17",
      "headline": "'Justice For All': Trump plays song made with Capitol attack prisoners at clubAt his Mar-a-Lago club in Florida, President-elect Donald Trump played \"Justice For All,\" a song he recorded with the J6 Prison Choir, a group of about 20 men incarcerated for their roles in the January 6 insurrection at the US Capitol."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-lands-in-nigeria-president-tinubu-receives-him-at-abuja-airport-2634588-2024-11-17",
      "headline": "PM Modi arrives in Nigeria, receives grand welcome on maiden visitNigerian President Bola Ahmed Tinubu and the members of the Indian community received Prime Minister Narendra Modi at the Abuja airport on Sunday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/israel-hamas-war-flash-bombs-fired-towards-prime-minister-benjamin-netanyahu-home-no-damages-reported-2634609-2024-11-17",
      "headline": "Netanyahu's home hit by flash bombs month after drone attack from LebanonThe incident took place on Saturday night. Neither Benjamin Netanyahu nor his family were present and there was no damage reported, according to the police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sachin-tendulkar-vs-umpire-steve-bucknor-twitter-post-2634618-2024-11-17",
      "headline": "Sachin vs Steve Bucknor? Viral post triggers hilarious responsesSachin Tendulkar took a hilarios dig at an umpire in his latest social media post. Fans and cricketers speculated if the cryptic post was meant for former umpire Steve Bucknor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/harnessing-the-power-of-data-iim-kozhikodes-professional-certificate-programme-in-advanced-data-analytics-for-managers-2631624-2024-11-11",
      "headline": "Harnessing the Power of Data: IIM Kozhikode's Professional Certificate Programme in Advanced Data Analytics for ManagersEmpowering Managers with Data-Driven Insights for Strategic Decision-Making"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-news-donald-trump-cabinet-who-is-chris-wright-climate-change-critic-new-energy-secretary-2634611-2024-11-17",
      "headline": "Who is Chris Wright, from climate change critic to Trump's new Energy Secretary?Chris Wright is the founder, CEO, and Chairman of Liberty Energy, a company listed on the New York Stock Exchange. He is known for his work across various energy sectors, including oil, gas, nuclear, solar, and geothermal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-australia-bgt-rohit-sharma-2nd-child-ritika-sajdeh-perth-test-2634610-2024-11-17",
      "headline": "Rohit should leave for Perth as soon as possible: Sourav GangulyFormer India captain Sourav Ganguly feels that Rohit Sharma should leave for Australia as soon as possible and play the opening Test match in Perth. Speaking ahead of India's tour of Australia, Ganguly said that the Indian team needs leadership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/naanum-rowdy-dhaan-film-that-changed-dhanush-nayanthara-relationship-2634517-2024-11-17",
      "headline": "Naanum Rowdy Dhaan: The film that changed Dhanush-Nayanthara's equation foreverNayanthara wrote an open letter to Dhanush accusing him of holding a personal grudge against her and her partner, Vignesh Shivan. Let us revisit Naanum Rowdy Dhaan, a film that changed the dynamics between Nayanthara and Dhanush forever."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/can-skincare-be-a-form-of-meditation-2633686-2024-11-16",
      "headline": "Can skincare be a form of meditation?The simple act of washing your face or applying a face pack can be meditative, say 'mindful beauty' experts\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/xi-jinping-cautions-us-meeting-biden-make-the-right-choice-donald-trump-2634591-2024-11-17",
      "headline": "Biden and Xi Jinping agree on humans controlling nuclear weapons, not AIThe discussions between Joe Biden and Xi Jinping in Peru marked a first-of-its-kind step for the US and China in addressing the role of artificial intelligence in nuclear use and defence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jhansi-hospital-fire-newborns-killed-up-government-probe-yogi-adityanath-short-circuit-2634536-2024-11-16",
      "headline": "UP forms team to probe hospital fire, denies claims of expired extinguishersUttar Pradesh Chief Minister Yogi Adityanath said a short circuit caused the fire at the children's ward of a Jhansi medical college that killed 10 newborns. The state government ordered a three-tier probe into the incident."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-virat-kohli-steve-smith-bengaluru-test-2634524-2024-11-17",
      "headline": "When Virat Kohli was angered by Steve Smith's bizarre DRS tactics  Border-Gavaskar Trophy: Virat Kohli and Steve Smith were involved in a controversy surrounding a DRS call when India and Australia faced each other in the Bengaluru Test back in 2017.  India won the Test by 75 runs and made it 1-1 in the four-match series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-politics-business-sports-entertainment-science-431-15-11-2024",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/richa-chadha-calls-out-silence-on-delhi-toxic-air-jhansi-hospital-fire-2634613-2024-11-17",
      "headline": "We're getting poisoned: Richa Chadha slams lack of action over Delhi air crisisRicha Chadha criticises the government's failure to address air pollution and healthcare accountability, slamming the indifference to the deaths of newborns in Jhansi and the worsening air crisis in North India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bihar-patna-nalanda-medical-college-hospital-man-eye-missing-dead-negligence-2634581-2024-11-16",
      "headline": "Dead patient's eye goes missing at Patna hospital, doctors say rat gnawed itThe family of the man, Fantush, staged a protest inside the hospital premises, alleging medical negligence in the case. However, the hospital staff claimed that a rat had gnawed at his eye."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/zoho-ceo-sridhar-vembu-learn-kannada-bengaluru-non-native-residents-disrespectful-x-debate-viral-post-2634599-2024-11-17",
      "headline": "Zoho CEO divides internet: Living in Bengaluru and not learning Kannada disrespectfulZoho CEO Sridhar Vembu stirred a heated debate online when he called on non-native residents of Bengaluru to learn Kannada, deeming it essential for respecting the local culture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-news-pentagon-report-on-ufo-unidentified-flying-objects-uap-aliens-new-york-elon-musk-2634596-2024-11-17",
      "headline": "Pentagon says 757 new UFO sighting reports in US, majority in airspace The report consisted of hundreds of new cases of misidentified balloons, birds, and satellites, including some that cannot be explained in easier terms, such as a close call between a commercial airliner and an unidentified object near the New York coast. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/telangana/story/kasthuri-shankar-arrested-controversial-remarks-telugu-community-tamil-nadu-madras-high-court-2634587-2024-11-17",
      "headline": "Actor Kasturi Shankar arrested for remarks against Telugu communityActor Kasturi Shankar stoked controversy by saying, \"The Telugu-speaking community came as assistants to the king's consort and later adopted a Tamil identity,\" while engaging in divisive politics.\" She made the comments during a speech she delivered at a protest meeting on November 3."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-reported-meeting-between-tehran-un-envoy-elon-musk-fabricated-story-2634595-2024-11-17",
      "headline": "Fabricated story: Iran on reported meeting between UN envoy, Elon MuskThe New York Times reported on Thursday (November 14) that Elon Musk, who is an adviser to US President-elect Donald Trump, met Iran's ambassador to the UN on Monday (November 11)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/naanum-rowdy-dhaan-film-that-changed-dhanush-nayanthara-relationship-2634517-2024-11-17",
      "headline": "Naanum Rowdy Dhaan: The film that changed Dhanush-Nayanthara's equation foreverNayanthara wrote an open letter to Dhanush accusing him of holding a personal grudge against her and her partner, Vignesh Shivan. Let us revisit Naanum Rowdy Dhaan, a film that changed the dynamics between Nayanthara and Dhanush forever."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/amaran-box-office-collection-day-17-detailed-report-sivakarthikeyan-film-picks-up-as-kanguva-slows-down-2634627-2024-11-17",
      "headline": "Amaran box office Day 17: Sivakarthikeyan's film picks up as Kanguva slows downAmaran continues to perform fantastically even in its third weekend at the box office. The Sivakarthikeyan biographical drama is expected to touch the benchmark of Rs 200 crore in India soon. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kanguva-box-office-collection-day-3-detailed-report-suriya-film-remains-slow-in-1st-weekend-2634612-2024-11-17",
      "headline": "Kanguva box office Day 3: Suriya's film remains slow in 1st weekendSuriya's pan-India action fantasy film, Kanguva, failed to pick up even on Saturday after registering a subtle Friday at the box office. The film has dropped drastically after its opening day numbers. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/richa-chadha-calls-out-silence-on-delhi-toxic-air-jhansi-hospital-fire-2634613-2024-11-17",
      "headline": "We're getting poisoned: Richa Chadha slams lack of action over Delhi air crisisRicha Chadha criticises the government's failure to address air pollution and healthcare accountability, slamming the indifference to the deaths of newborns in Jhansi and the worsening air crisis in North India."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-australia-vs-india-perth-test-virat-kohli-form-glenn-mcgrath-2634637-2024-11-17",
      "headline": "'Emotional' Virat Kohli may struggle if he gets a couple of low scores: McGrathLegendary pacer Glenn McGrath believes Virat Kohli could face challenges in Australia if he starts the Border-Gavaskar Trophy series with low scores. McGrath highlights Kohli's emotional playing style and suggests Australia should apply pressure on him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-jasprit-bumrah-border-gavaskar-trophy-pat-cummins-2634633-2024-11-17",
      "headline": "Jasprit Bumrah will play big role in Border-Gavaskar Trophy: CumminsAustralia captain Pat Cummins feels that Jasprit Bumrah will play a big role in the upcoming Border-Gavaskar Trophy. Cummins said that he is a big fan of Bumrah."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-sachin-tendulkar-vs-umpire-steve-bucknor-twitter-post-2634618-2024-11-17",
      "headline": "Sachin vs Steve Bucknor? Viral post triggers hilarious responsesSachin Tendulkar took a hilarios dig at an umpire in his latest social media post. Fans and cricketers speculated if the cryptic post was meant for former umpire Steve Bucknor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-australia-bgt-rohit-sharma-2nd-child-ritika-sajdeh-perth-test-2634610-2024-11-17",
      "headline": "Rohit should leave for Perth as soon as possible: Sourav GangulyFormer India captain Sourav Ganguly feels that Rohit Sharma should leave for Australia as soon as possible and play the opening Test match in Perth. Speaking ahead of India's tour of Australia, Ganguly said that the Indian team needs leadership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-virat-kohli-steve-smith-bengaluru-test-2634524-2024-11-17",
      "headline": "When Virat Kohli was angered by Steve Smith's bizarre DRS tactics  Border-Gavaskar Trophy: Virat Kohli and Steve Smith were involved in a controversy surrounding a DRS call when India and Australia faced each other in the Bengaluru Test back in 2017.  India won the Test by 75 runs and made it 1-1 in the four-match series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/boxing-mike-tyson-retirement-almost-died-jake-paul-fight-highlights-ulcer-2634606-2024-11-17",
      "headline": "I almost died: Mike Tyson hints at retirement, recalls health battleLegendary Mike Tyson took to X after his fight against Logan Paul and opened up on the health scare that he faced before the bout. Tyson revealed that he almost died in June and had to begin his training from scratch to get ready for the November 15 fight. He also hinted at his retirement.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/icc-champions-trophy-tour-2025-ytvd-2634566-2024-11-16",
      "headline": "ICC announces 2025 Champions Trophy trophy tourICC's Champions Trophy tour starts in Pakistan, moves to India in January, skipping Kashmir."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/taylor-firtz-atp-finals-title-match-alexander-zverev-told-myself-to-fight-turin-2634577-2024-11-16",
      "headline": "Told myself to fight: Fritz after securing historic ATP Finals title matchTaylor Fritz defeated Alexander Zverev in a dramatic ATP Finals clash, becoming the first American in 18 years to reach the title match. Fritz's resilience and precision under pressure secured a hard-fought victory in Turin's semi-final showdown."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ayush-badoni-credits-lsg-coach-justin-langer-after-hitting-double-ton-in-ranji-2634573-2024-11-16",
      "headline": "Ayush Badoni credits LSG coach Justin Langer after hitting double ton in RanjiAyush Badoni scored an unbeaten 205 as Delhi managed a draw against Jharkhand in the Ranji Trophy match. Badoni credited Justin Langer for his growth over time in the sport. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-dhruv-jurel-transitions-to-going-alarm-free-as-he-gears-up-for-australia-tests-2634554-2024-11-16",
      "headline": "Jurel transitions to 'alarm-free' mornings as he gears up for Australia TestsDhruv Jurel shared snippets from his photo-shoot ahead of the Border Gavaskar Trophy series. He captioned the post, \"From setting alarms to catch India's Tests in Australia to waking up alarm-free.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/mike-tyson-leg-injury-vs-jake-paul-evander-holyfield-reacts-boxing-bout-2634553-2024-11-16",
      "headline": "Something was wrong with Tyson's leg: Holyfield reacts to Jake Paul lossMike Tyson's loss to Jake Paul sparked criticism and analysis, with Evander Holyfield attributing the defeat to Tyson's knee issues. Paul's win reignites debates about the ethics of staging fights between retired legends and younger competitors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/icc-champions-trophy-tour-2025-ytvd-2634566-2024-11-16",
      "headline": "ICC announces 2025 Champions Trophy trophy tourICC's Champions Trophy tour starts in Pakistan, moves to India in January, skipping Kashmir."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/taylor-firtz-atp-finals-title-match-alexander-zverev-told-myself-to-fight-turin-2634577-2024-11-16",
      "headline": "Told myself to fight: Fritz after securing historic ATP Finals title matchTaylor Fritz defeated Alexander Zverev in a dramatic ATP Finals clash, becoming the first American in 18 years to reach the title match. Fritz's resilience and precision under pressure secured a hard-fought victory in Turin's semi-final showdown."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ayush-badoni-credits-lsg-coach-justin-langer-after-hitting-double-ton-in-ranji-2634573-2024-11-16",
      "headline": "Ayush Badoni credits LSG coach Justin Langer after hitting double ton in RanjiAyush Badoni scored an unbeaten 205 as Delhi managed a draw against Jharkhand in the Ranji Trophy match. Badoni credited Justin Langer for his growth over time in the sport. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-dhruv-jurel-transitions-to-going-alarm-free-as-he-gears-up-for-australia-tests-2634554-2024-11-16",
      "headline": "Jurel transitions to 'alarm-free' mornings as he gears up for Australia TestsDhruv Jurel shared snippets from his photo-shoot ahead of the Border Gavaskar Trophy series. He captioned the post, \"From setting alarms to catch India's Tests in Australia to waking up alarm-free.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/mike-tyson-leg-injury-vs-jake-paul-evander-holyfield-reacts-boxing-bout-2634553-2024-11-16",
      "headline": "Something was wrong with Tyson's leg: Holyfield reacts to Jake Paul lossMike Tyson's loss to Jake Paul sparked criticism and analysis, with Evander Holyfield attributing the defeat to Tyson's knee issues. Paul's win reignites debates about the ethics of staging fights between retired legends and younger competitors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tennis-atp-finals-2024-carlos-alcaraz-novak-djokovic-comeback-2634542-2024-11-16",
      "headline": "Alcaraz backs 'dangerous' and 'hungry' Djokovic for strong comebackCarlos Alcaraz backed Novak Djokovic to make a strong comeback in the upcoming season. Djokovic won the gold medal in the Paris Olympics, but failed to win any other tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-vs-india-t20i-arshdeep-singh-rise-exceptional-highest-wicket-taker-dinesh-karthik-2634540-2024-11-16",
      "headline": "Arshdeep Singh's rise has been exceptional: Dinesh Karthik praises pacerArshdeep Singh's meteoric T20I rise sees him near India's all-time wicket-taking record. Praised by Dinesh Karthik, the pacer's consistency and skill have made him invaluable, with his 2024 T20 World Cup heroics further solidifying his reputation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/shami-dedicates-his-all-round-show-in-ranji-to-fans-as-bengal-win-a-thriller-2634534-2024-11-16",
      "headline": "Shami dedicates his all-round show in Ranji to fans as Bengal win a thrillerMohammed Shami dedicated his all-round performance in the Ranji match for Bengal to his fans. Bengal beat Madhya Pradesh by 11 runs in the Group C clash. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/prickly-coach-gautam-gambhir-not-a-great-fit-for-indian-team-tim-paine-2634526-2024-11-16",
      "headline": "Prickly coach Gautam Gambhir not a great fit for Indian team: Tim Paine Tim Paine criticised Gautam Gambhir for his coaching style and called him a 'prickly character'. Gambhir hitting back at Ponting over Kohli's criticism did not sit well with Paine. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/olympique-lyon-relegation-financial-mismanagement-transfer-ban-ligue-1-2634516-2024-11-16",
      "headline": "Ligue 1 club Lyon handed provisional relegation over financial crashOlympique Lyon faces provisional relegation to Ligue 2 by DNCG over financial irregularities, with a transfer ban and salary oversight imposed. Owner John Textor remains optimistic about avoiding demotion as the club races to resolve its financial crisis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/alyssa-healy-ruled-out-of-wbbl-due-to-injury-big-setback-for-sydney-sxers-2634506-2024-11-16",
      "headline": "Alyssa Healy ruled out of WBBL due to injury, big setback for Sydney SixersAlyssa Healy has been ruled out of the remainder of the Women's Big Bash League due to knee injury. This development came as a huge setback for the Sydney Sixers. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-pakistan-mohammad-rizwan-sydney-t20i-2634505-2024-11-16",
      "headline": "Rizwan rues crucial drop catches after Pakistan lose T20I seriesAUS vs PAK: Skipper Mohammad Rizwan said that Pakistan's catching wasn't up to the mark in the second T20I on Saturday against Australia at the Sydney Cricket Ground. Pakistan lost the game by 13 runs to concede a 2-0 lead to the Aussies. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-rajasthan-royals-auction-prediction-jos-buttler-back-or-move-on-new-overseas-batter-2634492-2024-11-16",
      "headline": "IPL auction prediction: Will RR get Buttler back or is it time to move on?Rajasthan Royals enter a new era under new coach Rahul Dravid, with Jos Buttler's departure marking a significant shift. Balancing fresh talent with experience, RR's auction strategy holds the key to reshaping their squad for IPL 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/olympique-lyon-relegation-financial-mismanagement-transfer-ban-ligue-1-2634516-2024-11-16",
      "headline": "Ligue 1 club Lyon handed provisional relegation over financial crashOlympique Lyon faces provisional relegation to Ligue 2 by DNCG over financial irregularities, with a transfer ban and salary oversight imposed. Owner John Textor remains optimistic about avoiding demotion as the club races to resolve its financial crisis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/alyssa-healy-ruled-out-of-wbbl-due-to-injury-big-setback-for-sydney-sxers-2634506-2024-11-16",
      "headline": "Alyssa Healy ruled out of WBBL due to injury, big setback for Sydney SixersAlyssa Healy has been ruled out of the remainder of the Women's Big Bash League due to knee injury. This development came as a huge setback for the Sydney Sixers. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-pakistan-mohammad-rizwan-sydney-t20i-2634505-2024-11-16",
      "headline": "Rizwan rues crucial drop catches after Pakistan lose T20I seriesAUS vs PAK: Skipper Mohammad Rizwan said that Pakistan's catching wasn't up to the mark in the second T20I on Saturday against Australia at the Sydney Cricket Ground. Pakistan lost the game by 13 runs to concede a 2-0 lead to the Aussies. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-rajasthan-royals-auction-prediction-jos-buttler-back-or-move-on-new-overseas-batter-2634492-2024-11-16",
      "headline": "IPL auction prediction: Will RR get Buttler back or is it time to move on?Rajasthan Royals enter a new era under new coach Rahul Dravid, with Jos Buttler's departure marking a significant shift. Balancing fresh talent with experience, RR's auction strategy holds the key to reshaping their squad for IPL 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-pakistan-spencer-johnson-scg-t20i-series-2634483-2024-11-16",
      "headline": "Spencer Johnson rocks Pakistan at SCG as Australia win T20I seriesAUS vs PAK: Spencer Johnson picked up five wickets as Australia beat Pakistan by 13 runs on Saturday at the Sydney Cricket Ground. Pakistan were bowled out for 134 while chasing a target of 148. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/haris-rauf-achieves-monumental-feat-after-4-wicket-haul-in-2nd-t20i-vs-australia-2634479-2024-11-16",
      "headline": "Haris Rauf achieves monumental feat after 4-wicket haul in 2nd T20I vs AustraliaHaris Rauf achieved a monumental feat with his 4-wicket haul in the 2nd T20I against Australia. He became Pakistan's joint-highest wicket-taker in T20Is with 107 scalps. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-left-thumb-fracture-australia-vs-india-in-doubt-border-gavaskar-trophy-perth-test-2634477-2024-11-16",
      "headline": "Shubman Gill fractures left-thumb, in doubt for Perth Test vs AustraliaIndia faces a major setback as Shubman Gill's thumb fracture rules him out of the first Border-Gavaskar Test in Perth, leaving the top-order uncertain, especially with injury concerns around KL Rahul and skipper Rohit Sharma's availability in question."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ufc-309-jon-jones-vs-stipe-miocic-main-card-schedule-madison-square-garden-2634474-2024-11-16",
      "headline": "UFC 309: All you need to know as Jon Jones vs Stipe Miococ headlines eventUFC 309 promises an electrifying night of fights at Madison Square Garden. Jon Jones defends his heavyweight title against Stipe Miocic, while Charles Oliveira faces Michael Chandler in a lightweight rematch."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}