{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/british-automobile-maker-jaguar-land-rover-suspend-shipments-to-us-over-tariffs-britain-2704600-2025-04-05",
      "headline": "Jaguar Land Rover to suspend shipments to US over tariffs on BritainJaguar Land Rover, which is owned by India's Tata Motors, confirmed the temporary export suspension after the Times newspaper reported the plan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jp-morgan-warns-of-60-chance-of-global-recession-after-donald-trumps-tariffs-2704407-2025-04-05",
      "headline": "JP Morgan warns of 60% chance of global recession after Trump's tariffsFollowing the US-China trade war, global investment firm J.P. Morgan said it now sees a 60% chance of the global economy entering recession by year-end, up from 40% previously."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bloodbath-on-wall-street-dow-crashes-2200-points-sp-suffers-worst-6-collapse-since-2020-glbs-2704343-2025-04-05",
      "headline": "Wall Street shatters as Trump tariffs trigger worst day in US markets since 2020US markets suffered their steepest decline since 2020 after China retaliated against Trump's tariffs. The S&P 500 fell 6%, fuelling recession fears and intensifying investor anxiety across global markets.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dow-crashes-2000-points-as-trumps-tariffs-spark-global-market-panic-glbs-2704333-2025-04-05",
      "headline": "Dow crashes 2,000 points as Trump's tariffs spark global market panicGlobal markets plunged as Trump's tariffs triggered a trade war escalation with China. The Dow fell over 2,000 points, crude prices tumbled, and investors feared an impending global recession. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-federal-reserve-chair-jerome-powell-warns-higher-inflation-slower-growth-trump-tariffs-2704280-2025-04-04",
      "headline": "Higher inflation, slower growth: US Federal Reserve chair warns after Trump tariffsUS Federal Reserve chair Jerome Powell spoke as global markets continued a swoon that has wiped some 10 per cent off major US stock indexes since Trump announced a raft of new tariffs on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-stocks-opened-sharply-lower-after-chinas-retaliatory-tariff-measure-nasdaq-composite-2704230-2025-04-04",
      "headline": "US stocks plummet after China's retaliatory levies in response to Trump tariffsNasdaq IXIC dropped more than 20 per cent from its all-time closing high touched in December, putting it on course to confirm a bear market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/income-tax-return-2025-itr-2-filing-now-made-easier-check-latest-updates-2704180-2025-04-04",
      "headline": "Income tax return 2025: ITR-2 filing now made easierITR-2 is meant for individuals whose annual income is above Rs 50 lakh or who earn from sources like rent, capital gains, or other sources."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-tumbles-over-900-points-nifty-ends-below-23000-it-metal-stocks-crash-2704038-2025-04-04",
      "headline": "Sensex tumbles over 900 points, Nifty ends below 23,000; IT, metal stocks crashThe S&P BSE Sensex tumbled 930.67 points to 75,364.69 at the closing bell, while the NSE Nifty50 tumbled 345.65 points to settle at 22,904.45."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/it-stocks-infoys-tcs-hcltech-down-nifty-sensex-crash-trump-tariff-fy26-outlook-2704032-2025-04-04",
      "headline": "IT stocks bleed as market crashes. Why TCS, Infosys, Wipro shares are down?All major IT stocks declined as fears of a US recession led to heavy selling. IT companies earn a large portion of their revenue from the US market, and concerns about a slowdown in technology spending have further weakened investor sentiment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/piyush-goyal-shark-tank-india-criticism-startups-aman-gupta-boat-ice-cream-brand-2703988-2025-04-04",
      "headline": "With 'fancy ice-cream' jab, Piyush Goyal's cold message to Shark Tank judgesPiyush Goyal row: While flagging the trend of Indian startups focusing on 'fancy ice creams' and food delivery apps, Piyush Goyal drew a parallel with China to pitch for more innovation in deep-tech."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ril-share-price-reliance-industries-stock-fall-4-percent-stock-market-crash-mukesh-ambani-net-worth-2703996-2025-04-04",
      "headline": "RIL share price falls 4% ahead of Q4 results. Should you sell?Reliance Industries stock: RIL shares opened at Rs 1,240 and fell to an intraday low of Rs 1,192.85 in the afternoon session. The stock was close to its 52-week low of Rs 1,156, which it touched on March 3, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-tariff-us-india-26-percent-clarity-while-house-new-document-trade-2703962-2025-04-04",
      "headline": "US tariffs stay at 26% as White House unveils new trade documentInitially, India's tariff rate was mentioned as 27% in the earlier version of the White House annex. However, the latest revision has adjusted it to 26%."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sidharth-malhota-saif-ali-khan-in-talks-for-race-4-producer-ramesh-taurani-2704640-2025-04-05",
      "headline": "Sidharth Malhotra, Saif Ali Khan in talks for Race 4: Producer Ramesh TauraniProducer Ramesh Taurani clarified the casting rumors surrounding Race 4. He mentioned that only Saif Ali Khan and Sidharth Malhotra are currently in talks for the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/top-10-teen-shows-to-watch-on-netflix-in-april-2025-glbs-2704466-2025-04-05",
      "headline": "Top 10 teen shows to watch on Netflix in April 2025Netflix's April 2025 lineup features ten top-rated teen shows, blending romance, drama, comedy, and fantasy. Highlights include Heartstopper, Stranger Things, Never Have I Ever, and Teenage Bounty Hunters.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/burqa-city-director-fabrice-bracq-surprised-by-similarity-with-laapataa-ladies-plot-2704619-2025-04-05",
      "headline": "Burqa City director 'surprised' by similarity with Laapataa Ladies' plotFrench director Fabrice Bracq accused Kiran Rao's Laapataa Ladies of plagiarising his short film Burqa City. The controversy has sparked a debate on originality and creative influence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/laapataa-ladies-writer-biplab-goswami-denies-plagiarism-claims-in-social-media-post-2704593-2025-04-05",
      "headline": "Laapataa Ladies writer Biplab Goswami denies plagiarism claims: Completely untrueBiplab Goswami, screenwriter of Laapataa Ladies, denied plagiarism allegations following online comparisons to Burqa City. He asserted the film's originality, citing years of research and screenplay registration since 2014."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshan-calls-jr-ntr-favourite-co-star-wants-to-work-with-christopher-nolan-2704562-2025-04-05",
      "headline": "Hrithik Roshan calls Jr NTR his favourite co-star: He's brilliant and amazingHrithik Roshan, during his Tour marking 25 years in Bollywood, called Jr NTR his favourite co-star. He also spoke about directing Krrish 4 and his desire to work with Christopher Nolan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/actors-mugdha-chaphekar-ravish-desai-separation-9-years-of-marriage-2704534-2025-04-05",
      "headline": "Mugdha Chaphekar, Ravish Desai announce separation after 9 years of marriageTV actors Mugdha Chaphekar and Ravish Desai have announced their separation after nine years of marriage. They have been living apart for over a year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/travis-scott-india-debut-circus-maximus-tour-second-show-added-tickets-live-2704500-2025-04-05",
      "headline": "Travis Scott India Tour: Second show added in Delhi due to high demandTravis Scott is set to perform in India for the first time with his Circus Maximus Tour on October 18, 2025. Owing to a huge demand, a second show has also been added."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/chhaava-ott-release-when-and-where-to-watch-vicky-kaushals-blockbuster-film-2704498-2025-04-05",
      "headline": "Chhaava on OTT: When and where to watch Vicky Kaushal's blockbuster filmVicky Kaushal's blockbuster Chhaava is gearing up for its digital release on Netflix, expected on April 11. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rrr-stars-ram-charan-jr-ntr-to-reunite-with-rajamouli-royal-albert-hall-2704467-2025-04-05",
      "headline": "RRR stars Ram Charan, Jr NTR to reunite with director Rajamouli, but not for filmRam Charan and Jr NTR, stars of the blockbuster RRR, will join director SS Rajamouli and composer MM Keeravaani for a special Q&A session at London's Royal Albert Hall."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/manoj-kumar-funeral-amitabh-bachchan-salim-khan-hug-abhishek-bachchan-arbaaz-khan-2704468-2025-04-05",
      "headline": "Teary-eyed Amitabh Bachchan attends Manoj Kumar's funeral with son AbhishekVeteran actor Manoj Kumar's last rites are being conducted in Juhu, Mumbai, with several celebrities, including Amitabh Bachchan, present to pay their respects. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/l2-empuraan-box-office-day-9-mohanlal-prithviraj-sukumaran-film-nears-rs-100-crore-domestically-new-malayalam-record-2704445-2025-04-05",
      "headline": "Empuraan box office Day 9: Mohanlal film becomes highest-grossing Malayalam filmL2 Empuraan continues its impressive box office run, earning Rs 2.9 crore on its ninth day. With a total of Rs 91.15 crore in India and strong overseas earnings, it may become the highest-grossing Malayalam film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/lost-charm-of-bollywood-music-veer-zaara-urvashi-rautela-tauba-tauba-2704071-2025-04-05",
      "headline": "Echoes of the past: Lost charm of Bollywood music, can the glory days be back?It has been a while since the Hindi film industry produced a full album which boasted some memorable tracks. So does this mean Bollywood music has lost its sheen? Artistes such as Lalit Pandit and Shabana Azmi weigh in."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/manoj-kumar-last-rites-state-honour-details-2704422-2025-04-05",
      "headline": "Veteran actor Manoj Kumar to be cremated with state honours in MumbaiVeteran actor Manoj Kumar, known for his patriotic films, will be given a state funeral. The Bollywood fraternity and his family are set to bid him a final farewell, with his last rites scheduled in Juhu at 11:30 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/salman-khan-sikander-box-office-collection-day-6-rs-4-crore-2704391-2025-04-05",
      "headline": "Sikandar box office Day 6: Salman Khan film struggles, earns mere Rs 3.75 croreSalman Khan's latest film Sikandar, directed by AR Murugadoss, saw a significant drop at the box office on its sixth day despite a decent start. The film's total domestic collection now stands at Rs 94 crore after earning just Rs 3.75 crore on Day 6.\r\n75 crore on Friday"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jr-ntr-praises-brother-in-law-narne-nithin-at-mad-square-success-bash-2704324-2025-04-04",
      "headline": "Jr NTR praises brother-in-law Nithin at MAD Square success bashMAD Square has been a hit among audiences, and Jr NTR couldn't be prouder of his brother-in-law Narne Nithin's acting journey. Speaking at the success bash on Friday, he reminisced about his initial reaction when Nithin first approached him to discuss his aspirations of becoming an actor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/the-last-five-years-finally-hits-broadway-after-years-of-anticipation-glbs-2704301-2025-04-04",
      "headline": "The Last Five Years finally hits Broadway after years of anticipationNick Jonas and Adrienne Warren bring the beloved musical 'The Last Five Years' to Broadway for the first time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/elizabeth-olsen-admits-marvel-films-arent-her-cup-of-tea-not-the-art-i-consume-2704292-2025-04-04",
      "headline": "Elizabeth Olsen admits Marvel films aren't her cup of tea: Not the art I consumeActor Elizabeth Olsen opened up about her personal film preferences and how they differ from her roles in the Marvel Cinematic Universe. Despite her pride in playing Wanda Maximoff, she shared the pressure to choose projects that reflect her true taste.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/new-sex-trafficking-charges-filed-against-sean-diddy-combs-glbs-2704291-2025-04-04",
      "headline": "New sex trafficking charges filed against Sean 'Diddy' CombsSean Diddy Combs faces two additional sex trafficking charges, expanding the federal indictment against him."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/good-bad-ugly-trailer-ajith-kumar-adhik-ravichandran-trisha-krishnan-2704271-2025-04-04",
      "headline": "Good Bad Ugly trailer: Ajith Kumar brings mass back in Adhik Ravichandran's nextThe much-anticipated trailer of Ajith Kumar's Good Bad Ugly is finally out. Directed by Adhik Ravichandran, the film is set to hit theatres on April 10. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-us-vs-china-trade-war-tariff-retaliation-market-slump-global-recession-fears-2704601-2025-04-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump says US no longer whipping post, China warns against tariff 'weapons'President Trump defended steep new tariffs on Chinese goods, calling them a step toward ending unfair trade. China responded with identical tariffs, warning the US against using trade as a weapon. Tensions continue escalating."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/government-in-talks-with-exporters-over-us-tariffs-all-options-on-table-sources-2704642-2025-04-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Government in talks with exporters over US tariffs, all options on table: SourcesIndia is reviewing the impact of new US tariffs on its exports and weighing possible responses. Officials are considering trade concessions under an upcoming bilateral deal and see strategic openings amid global supply chain shifts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-3-day-visit-to-sri-lanka-key-meet-focus-security-energy-trade-anura-kumara-dissanayake-2704369-2025-04-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India, Sri Lanka sign 1st defence deal, six other pacts during PM Modi's visit  Live UpdatesIn a big announcement and relief to several fishermen from Tamil Nadu, PM Modi said that he had also raised their concerns and declared that Sri Lanka has agreed to the immediate release of any Indian fishermen and the prompt return of their boats."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-dc-ms-dhoni-sakshi-video-viral-2704650-2025-04-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "MS Dhoni's last match? Wife Sakshi's chat with Ziva goes viralIPL 2025, CSK vs DC: A video of Sakshi Dhoni where she was talking to Ziva went viral on social media. Sakshi appeared to say \"last match\" to Ziva, as seen from lip-reading the video."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/lost-charm-of-bollywood-music-veer-zaara-urvashi-rautela-tauba-tauba-2704071-2025-04-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Echoes of the past: Lost charm of Bollywood music, can the glory days be back?It has been a while since the Hindi film industry produced a full album which boasted some memorable tracks. So does this mean Bollywood music has lost its sheen? Artistes such as Lalit Pandit and Shabana Azmi weigh in."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-land-under-catholic-churches-rss-organiser-article-waqf-bill-2704536-2025-04-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Amid Waqf row, RSS report on land under Catholic churches gets Rahul Gandhi flakThe article on the website of the Organiser, which has now been unpublished, claimed that Catholic institutions hold 7 crore hectares of land, making them the largest non-governmental landowner."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nitish-kumar-jdu-muslim-votes-bihar-elections-waqf-bill-support-impact-data-2704584-2025-04-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Joining NDA cost JDU Muslim votes, Waqf bill support won't do any damageWhile Nitish Kumar, after severing ties with the NDA, gained a significant portion of Muslim votes in the 2014 Lok Sabha elections, data on the post-2015 scenario presents a different picture. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bookmyshow-removes-all-content-of-comic-kunal-kamra-amid-eknath-shinde-joke-row-delists-him-2704471-2025-04-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "BookMyShow removes all content of comic Kunal Kamra amid joke row, delists himSoon after the online ticketing platform's decision to delete Kamra from the history list of artists, Shiv Sena (Shinde faction) youth leader Rahool N Kanal welcomed the move, thanking BookMyShow for removing any content linked to the artist."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pm-narendra-modi-meets-sri-lankas-1996-world-cup-heroes-in-colombo-2704661-2025-04-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "PM Modi meets Sri Lanka's 1996 World Cup heroes in ColomboPrime Minister Narendra Modi met with Sri Lanka's 1996 World Cup heroes in Colombo on Saturday, April 5. PM Modi had a chat with some of the stars from the iconic side that defeated Australia to win the title. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/university-of-bath-school-of-management-a-pathway-to-global-career-success-2702196-2025-04-01#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "University of Bath School of Management: A Pathway to Global Career SuccessBath's School of Management blends top academics, hands-on learning, and career support to help students secure jobs at leading global companies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/bjp-brand-kia-cue-tamil-nadu-k-annamalai-aiadmk-dmk-regional-politics-2704441-2025-04-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "A Kia cue for the BJPThe BJP's national showroom may be packed, but in states like Tamil Nadu, one-size-fits-all politics keep crashing. It's time for a branding revamp - same engine, different badge. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-dc-ms-dhoni-flop-kl-rahul-special-chennai-2704608-2025-04-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "CSK vs DC: No MS Dhoni special at Chepauk as KL Rahul inspires Delhi hat-trickIPL 2025, CSK vs DC: Chennai Super Kings's batting failed yet again as Delhi Capitals comfortably defended a 183-run total with ease. MS Dhoni was unbeaten on 30 off 26 deliveries as CSK's lack of intent left pundits and fans puzzled on Saturday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-trump-largest-b2-stealth-bomber-warplanes-indian-ocean-diego-garcia-houthis-iran-2704425-2025-04-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why US has sent 'ghosts of the sky' to this remote island near IranThe massive deployment of one of the world's most advanced military aircraft, known as 'ghosts of the sky', just 2,400 miles from Iran's coastline, has only added to the tensions in the Middle East."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/prajwal-revanna-confined-woman-raped-her-filmed-act-mentions-police-chargesheet-2704523-2025-04-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Prajwal Revanna confined woman, raped her, filmed act: Police chargesheetThe chargesheet states that the Prajwal Revanna forcibly confined the woman, raped her multiple times, recorded the acts, and threatened her with dire consequences if she ever spoke about the assaults. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/british-automobile-maker-jaguar-land-rover-suspend-shipments-to-us-over-tariffs-britain-2704600-2025-04-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Jaguar Land Rover to suspend shipments to US over tariffs on BritainJaguar Land Rover, which is owned by India's Tata Motors, confirmed the temporary export suspension after the Times newspaper reported the plan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/gossip-can-be-good-heres-how-to-make-it-healthy-and-harmless-2704449-2025-04-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Gossip can be good. Here's how to make it healthy (and harmless)Beyond its bad reputation, gossiping can also be positive and healthy. Psychologists call it 'social glue' that brings communities together. It is also deemed good for mental health (when it is harmless)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/laapataa-ladies-writer-biplab-goswami-denies-plagiarism-claims-in-social-media-post-2704593-2025-04-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Laapataa Ladies writer Biplab Goswami denies plagiarism claims: Completely untrueBiplab Goswami, screenwriter of Laapataa Ladies, denied plagiarism allegations following online comparisons to Burqa City. He asserted the film's originality, citing years of research and screenplay registration since 2014."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-470-04-04-2025#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/union-home-minister-amit-shah-lay-down-arms-and-join-mainstream-or-face-action-2704547-2025-04-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Lay down arms and join mainstream or face action: Amit Shah to NaxalsUnion Home Minister Amit Shah on Saturday urged Naxals to surrender and join the mainstream, reaffirming the government's resolve to end red terror in Chhattisgarh's Bastar by March 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/justice-yashwant-varma-allahabad-high-court-judge-transfer-centre-approves-judicial-work-supreme-court-cash-at-home-recovery-row-2704492-2025-04-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Cash row: Justice Varma takes oath as High Court judge, but won't get any workJustice Yashwant Varma, from whose residence a huge amount of unaccounted cash was recovered, will not be assigned any judicial work until the probe against him is ongoing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/ghibli-ai-art-vs-real-hand-drawn-magic-of-ghibli-studio-2704156-2025-04-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ghibli AI art vs real hand-drawn magic: Can tech match the heart of the originals?The Ghibli AI art trend has gone viral with people gushing over its lively creation and vibrant style, but fans of the original studio say it lacks soul. Can an AI-made filter really capture decades of emotional, hand-drawn animation? Where do we draw the line in honouring Ghibli's timeless artistry?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/indians-abroad/story/canada-ottawa-rockland-indian-national-stabbed-to-death-suspect-taken-into-custody-embassy-tweet-2704379-2025-04-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Indian stabbed to death in Canada's Ottawa, suspect taken into custody: EmbassyThe Indian embassy in Canada confirmed the incident on X and said it was in touch with the victim's family. Authorities have not disclosed the cause of death or whether any charges have been filed."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/video-woman-drags-mother-in-law-by-hair-beats-up-husband-in-gwalior-2704497-2025-04-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Video: Woman drags mother-in-law by hair, beats up husband in GwaliorAccording to complainant Vishal Batra, his wife Neelika had been pressuring him for over a year to evict his 70-year-old mother, Sarla Batra, and send her to an old-age home. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/do-you-also-feel-a-small-electric-shock-when-touching-someone-explained-2704428-2025-04-05#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Do you also feel a small electric shock when touching someone? ExplainedFeeling a tiny electric shock when you touch a doorknob, a chair, or even another person? You're not alone; it happens to all of us now and then. That little jolt might be surprising, but it's not unusual. So, what causes this sudden spark? Let's break it down and understand the science behind it.\r\n\r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-csk-vs-dc-ms-dhoni-intent-stephen-fleming-press-conference-2704687-2025-04-05",
      "headline": "MS Dhoni had intent against DC: CSK coach Stephen Fleming defends legendChennai Super Kings coach Stephen Fleming has defended the intent shown by MS Dhoni during their loss against the Delhi Capitals on Saturday, April 5. Dhoni scored 30 off 26 balls against Delhi at Chepauk. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-vikram-solanki-press-conference-srh-vs-gt-2704670-2025-04-05",
      "headline": "Sunrisers very capable and strong: Vikram Solanki not undermining SRHIPL 2025, SRH vs GT: In the pre-match press conference, Gujarat Titans Director of Cricket, Vikram Solanki, said that his team won't undermine the Sunrisers Hyderabad in their upcoming clash on Sunday at the Rajiv Gandhi International Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pm-narendra-modi-meets-sri-lankas-1996-world-cup-heroes-in-colombo-2704661-2025-04-05",
      "headline": "PM Modi meets Sri Lanka's 1996 World Cup heroes in ColomboPrime Minister Narendra Modi met with Sri Lanka's 1996 World Cup heroes in Colombo on Saturday, April 5. PM Modi had a chat with some of the stars from the iconic side that defeated Australia to win the title. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-dc-ms-dhoni-retirement-rumour-stephen-fleming-reaction-2704651-2025-04-05",
      "headline": "MS Dhoni is still going strong: CSK coach Fleming brushes off retirement chatterIPL 2025, CSK vs DC: Head coach Stephen Fleming addressed MS Dhoni retirement rumours after Chennai's humbling defeat to Delhi. Dhoni struggled to hit big sixes in his laboured knock of 30 in CSK's failed chase of 184. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-dc-ms-dhoni-sakshi-video-viral-2704650-2025-04-05",
      "headline": "MS Dhoni's last match? Wife Sakshi's chat with Ziva goes viralIPL 2025, CSK vs DC: A video of Sakshi Dhoni where she was talking to Ziva went viral on social media. Sakshi appeared to say \"last match\" to Ziva, as seen from lip-reading the video."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kolkata-knight-riders-varun-chakravarthy-architect-chennai-2704649-2025-04-05",
      "headline": "Mystery spinner to architect: KKR's Varun Chakravarthy returns to 'OG playground'After starting the IPL 2025 campaign in fine fashion, KKR's Varun Chakravarthy decided to return to his role as an architect in Chennai. Varun is KKR's highest wicket-taker this season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-dc-kl-rahul-player-of-match-reaction-opening-ambition-2704635-2025-04-05",
      "headline": "KL Rahul puts team first, says ready to be floater for Delhi Capitals tooIPL 2025, CSK vs DC: KL Rahul, opening the batting in the absence of Faf du Plessis, hit a match-winning 77 against Chennai Super Kings on Saturday, April 05. Rahul opened up about how he is prepared to be flexible with his batting position."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-dc-vansh-bedi-falls-asleep-chennai-chepauk-2704637-2025-04-05",
      "headline": "CSK player falls asleep in dugout during run-chase against DC, image goes viralCSK player Vansh Bedi was spotted sleeping in the dugout during their run-chase against Delhi Capitals on Saturday, April 5. Chennai lost their third game on the bounce and find themselves struggling for form. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/barcelona-vs-real-madrid-el-clasico-legends-squads-match-date-timing-livestreaming-info-2704623-2025-04-05",
      "headline": "Barcelona vs Real Madrid legends: Squads, match date, timing, where to watchFC Barcelona and Real Madrid are set to play a legends match in Mumbai on April 6. Here's everything you need to know about the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-dc-ruturaj-gaikwad-reaction-chepauk-chennai-2704622-2025-04-05",
      "headline": "CSK loses 3 in 3: Ruturaj Gaikwad says team overconcerned, over-tentative in powerplayChennai Super Kings captain Ruturaj Gaikwad feels his side is being overconcerned and over-tentative with both bat and ball during the powerplay overs after their loss to Delhi Capitals in Chennai on Saturday, April 5. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-csk-vs-dc-parents-2704613-2025-04-05",
      "headline": "CSK should apologise to MS Dhoni's parents: Fans slam Chepauk flop showIPL 2025, CSK vs DC: Fans were not happy after Chennai Super Kings (CSK) slumped to a 25-run defeat at the hands of Delhi Capitals (DC) with MS Dhoni's parents in attendance at the Chepauk. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-dc-kl-rahul-player-of-match-reaction-opening-ambition-2704635-2025-04-05",
      "headline": "KL Rahul puts team first, says ready to be floater for Delhi Capitals tooIPL 2025, CSK vs DC: KL Rahul, opening the batting in the absence of Faf du Plessis, hit a match-winning 77 against Chennai Super Kings on Saturday, April 05. Rahul opened up about how he is prepared to be flexible with his batting position."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-dc-vansh-bedi-falls-asleep-chennai-chepauk-2704637-2025-04-05",
      "headline": "CSK player falls asleep in dugout during run-chase against DC, image goes viralCSK player Vansh Bedi was spotted sleeping in the dugout during their run-chase against Delhi Capitals on Saturday, April 5. Chennai lost their third game on the bounce and find themselves struggling for form. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/barcelona-vs-real-madrid-el-clasico-legends-squads-match-date-timing-livestreaming-info-2704623-2025-04-05",
      "headline": "Barcelona vs Real Madrid legends: Squads, match date, timing, where to watchFC Barcelona and Real Madrid are set to play a legends match in Mumbai on April 6. Here's everything you need to know about the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-dc-ruturaj-gaikwad-reaction-chepauk-chennai-2704622-2025-04-05",
      "headline": "CSK loses 3 in 3: Ruturaj Gaikwad says team overconcerned, over-tentative in powerplayChennai Super Kings captain Ruturaj Gaikwad feels his side is being overconcerned and over-tentative with both bat and ball during the powerplay overs after their loss to Delhi Capitals in Chennai on Saturday, April 5. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-csk-vs-dc-parents-2704613-2025-04-05",
      "headline": "CSK should apologise to MS Dhoni's parents: Fans slam Chepauk flop showIPL 2025, CSK vs DC: Fans were not happy after Chennai Super Kings (CSK) slumped to a 25-run defeat at the hands of Delhi Capitals (DC) with MS Dhoni's parents in attendance at the Chepauk. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}