{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/tcs-share-price-fall-it-stocks-down-weak-q1-results-should-you-buy-expert-view-sensex-nifty-2754140-2025-07-11",
      "headline": "TCS falls 2% on Q1 results miss. Should you buy as IT stocks struggle?TCS share price: The IT giant has lost 2.74% over the past five days and declined 4.37% in the past month. Over a six-month period, the stock is down 22.63%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/hul-share-price-rise-4-percent-priya-nair-new-ceo-rohit-jawa-replacement-leadership-change-2754108-2025-07-11",
      "headline": "Explained: Why HUL shares rose 4% todayHUL shares were up 3.8%, trading at Rs 2,500 as of 9;25 am, compared to Thursday's closing price of Rs 2,409.05. The stock ended Thursday's session nearly 1% lower but has gained 3.58% in the past five days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-280-points-lower-nifty-below-25300-hul-up-3-percent-2754105-2025-07-11",
      "headline": "Sensex opens 280 points lower, Nifty below 25,300; HUL up 4%The S&P BSE Sensex was down 250.37 points to 82,939.91, while the NSE Nifty50 lost 64.95 points to 25,290.30 as of 9:32 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-sensex-nifty-today-trading-setup-tcs-q1-results-weak-trump-tariff-2754096-2025-07-11",
      "headline": "Stock market opening: Weak TCS Q1 results to hamper Sensex, Nifty?The Gift Nifty futures were trading at 25,295 as of 8:30 am, suggesting that the Nifty 50 could open below Thursday's closing mark of 25,355.25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/priya-nair-first-woman-ceo-hul-hindustan-unilever-92-year-history-education-work-experience-rohit-jawa-2754081-2025-07-11",
      "headline": "Who is Priya Nair, first woman CEO of Hindustan UnileverPriya Nair will take over from Rohit Jawa, who will step down on July 31, 2025. Nair's appointment will come into effect from August 1, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/international-monetary-fund-praises-upi-says-it-makes-india-global-leader-in-fast-payment-2754002-2025-07-10",
      "headline": "IMF praises UPI, says it makes India global leader in fast paymentUnified Payments Interface is an instant and real-time payment system developed by NPCI to facilitate inter-bank transactions through mobile phones."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-346-points-lower-nifty-below-25400-airtel-down-3-percent-2753743-2025-07-10",
      "headline": "Sensex closes 346 points lower, Nifty below 25,400; Airtel down 3%The S&P BSE Sensex was down by 345.80 points to end at 83,190.28, while the NSE Nifty50 lost 120.85 points to close at 25,355.25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dubai-property-money-trail-ed-probe-income-tax-department-real-estate-2753725-2025-07-10",
      "headline": "Dubai dreams under scanner as ED questions homebuyers: ReportMany of the individuals who bought property in Dubai are now under scrutiny as they failed to provide proper bank transaction records showing how the payments were made."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/8th-pay-commission-may-hike-salaries-by-30-34-percent-report-2753705-2025-07-10",
      "headline": "8th Pay Commission may hike salaries by 30–34%: ReportThe 8th Pay Commission could benefit around 11 million people, including about 4.4 million central government employees and nearly 6.8 million pensioners. Once approved, the changes will raise their basic pay, allowances, and retirement benefits."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/will-itr-filing-deadline-be-extended-again-here-is-why-it-might-2753681-2025-07-10",
      "headline": "Will ITR filing deadline be extended again? Here's why it mightIn May, the CBDT announced extending the ITR filing deadline, citing big changes in the forms and system readiness. It said that the updated ITRs will make compliance simpler and reporting more transparent for taxpayers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/amazon-now-delivery-zepto-blinkit-swiggy-instamart-flipkart-minute-new-rival-delhi-10-minute-delivery-quick-commerce-2753688-2025-07-10",
      "headline": "Zepto, Blinkit, Instamart face a new rival in Delhi's 10-min delivery warThe move brings the e-commerce giant into direct competition with local players such as Blinkit (owned by Eternal), Swiggy Instamart and Zepto, who already dominate the quick delivery space. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/smartworks-coworking-spaces-ipo-subscription-bidding-open-review-good-bad-gmp-today-2753663-2025-07-10",
      "headline": "Smartworks Coworking Spaces IPO open for bidding: Should you subscribe?The bidding window for the IPO will remain open until Monday, July 14. Investors can place bids within the price band of Rs 387 to Rs 407 per share."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/superman-dean-cain-james-gunn-immigrant-remark-too-woke-2754123-2025-07-11",
      "headline": "Former Superman Dean Cain feels James Gunn's immigrant superhero remark is too wokeActor Dean Cain has voiced his disapproval of James Gunn's 'Superman' with regard to the immigrant narrative. He slammed the filmmaker and Hollywood for making iconic characters too woke."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/video/stand-firm-against-violence-kapil-sharmas-canada-cafe-vows-to-continue-after-attack-2754104-2025-07-11",
      "headline": "Stand firm against violence: Kapil Sharma's Canada cafe vows to continue after attackThe Caps Cafe in Surrey, recently inaugurated and owned by comedian Kapil Sharma, has issued its first response following an attack on the premises. The cafe stated they are troubled by the incident but remain committed to their mission of spreading warmth and joy. They called for standing firm against violence. This incident occurs against a backdrop of tense India-Canada relations and growing concerns among the Indian community in Canada about targeted attacks on their achievements. The new Canadian Prime Minister, Mark Carney, has expressed intentions to designate pro-Khalistani elements as terrorists, though the effectiveness of this stance remains to be seen. The attack on Caps Cafe highlights the ongoing security concerns for Indian businesses and individuals in Canada."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/parag-tyagi-shuts-down-trolls-shefali-jariwala-death-dont-care-about-judgements-2754141-2025-07-11",
      "headline": "Parag Tyagi shuts down trolls after Shefali's death: Don't care about judgementsActor Parag Tyagi reacted to all the criticism about being active on social media after wife Shefali Jariwala's death. He responded to the trolls in the comment section of his latest post. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kangana-ranaut-criticises-diljit-dosanjh-pakistani-actor-hania-aamir-sardaar-ji-3-collaboration-2754132-2025-07-11",
      "headline": "Kangana asks why Diljit has his own path amid row over Sardaar Ji 3Kangana Ranaut reacted to Diljit Dosanjh's collaboration with Pakistani actor Hania Aamir in 'Sardaar Ji 3', emphasising nationalism. She stressed the importance of a unified national agenda. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/justin-bieber-new-album-swag-right-on-time-2754121-2025-07-11",
      "headline": "Justin Bieber's new album SWAG is clocking in right on time. Here's whyJustin Bieber is making a strong comeback with his new album 'SWAG' set for release on July 11. The album reflects his personal growth, fatherhood, and maturity, featuring collaborations with top artists."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/priyanka-chopra-chats-with-panchayat-pradhan-raghubir-yadav-asks-for-lauki-from-phulera-heads-of-state-2754118-2025-07-11",
      "headline": "Dekh rahe ho Binod: Priyanka chats with Pradhan, asks for lauki from PhuleraIn a surprise crossover, 'Heads Of State' star Priyanka Chopra shared a fun exchange with Panchayat's Pradhan ji (Raghubir Yadav), a moment that has quickly gone viral.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nayanthara-vignesh-shivan-divorce-5-crore-notice-chandramukhi-footage-2754098-2025-07-11",
      "headline": "Nayanthara silences divorce rumours with a cute pic featuring husband Vignesh ShivanNayanthara shared an adorable picture with Vignesh Shivan to address 'loopy' news about them. Recently, reports about them being slapped with a Rs 5 crore notice for their documentary and about their divorce surfaced."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/amitabh-bachchan-announces-kaun-banega-crorepati-17-agneepath-vijay-style-watch-promo-2754099-2025-07-11",
      "headline": "Amitabh Bachchan announces KBC 17 in Agneepath's Vijay style. Watch promoAmitabh Bachchan officially announced the return of Kaun Banega Crorepati. Season 17 in the new promo. The popular quiz show is set to premiere on August 11 on Sony TV. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-nick-jonas-dreamy-miami-holiday-malti-painting-steals-attention-2754091-2025-07-11",
      "headline": "Priyanka-Nick enjoy dreamy Miami holiday, but Malti's painting steals attentionPriyanka Chopra, Nick Jonas, and daughter Malti Marie have jetted to Miami for their summer break. The actor shared pictures from their trip, and little Malti is too cute to miss. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kattappa-baahubali-and-the-pop-culture-storm-prabhass-iconic-film-created-2753884-2025-07-11",
      "headline": "Kattappa, Baahubali and the pop culture storm Prabhas's iconic film createdSS Rajamouli's 'Baahubali: The Beginning' completed a decade on July 10, marking a revolutionary moment for Indian cinema with its unforgettable storytelling and cultural impact. The film, starring Prabhas and Rana Daggubati, not only captivated audiences but also sparked a nationwide meme culture and fan theories, making it a timeless pop culture phenomenon in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/not-giving-up-stand-firm-against-violence-kapil-sharmas-canada-cafes-message-after-firing-2754082-2025-07-11",
      "headline": "Not giving up, stand against violence: Kapil Sharma's Canada cafe after firingIn a strong message on Instagram, comedian Kapil Sharma's Kap's Cafe said that the firing attack late Wednesday night has shocked them, but they won't give up, and will stand firm against violence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kyunki-saas-bhi-kabhi-bahu-thi-reboot-story-gender-issues-smriti-irani-as-tulsi-virani-progressive-show-2753862-2025-07-11",
      "headline": "Why the Kyunki Saas Bhi Kabhi Bahu Thi reboot must be more of today, less of 2000The 'Kyunki Saas Bhi Kabhi Bahu Thi' reboot can't survive on nostalgia alone. It must spark real conversations about gender, relationships and inclusivity, turning Tulsi from a tradition-keeper into a cultural voice of change. Here's what we want more of. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/hailee-steinfeld-miles-teller-star-in-paramounts-winter-games-rom-com-glbs-2754058-2025-07-11",
      "headline": "Hailee Steinfeld, Miles Teller star in Paramount's Winter Games rom-comParamount's Winter Games stars Hailee Steinfeld and Miles Teller in a rom-com set during the Olympics. The film adds to Steinfeld's busy year, including marriage, a hit thriller, and new music.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/justin-bieber-returns-with-new-album-swag-after-4-years-of-break-glbs-2754048-2025-07-11",
      "headline": "Justin Bieber returns with new album Swag after 4-year hiatusJustin Bieber is set to release his new album 'Swag', marking his musical comeback after four years, featuring high-profile collaborations and global teasers that have fuelled fan anticipation.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/kanye-west-sued-by-ex-assistant-for-sexual-assault-and-trafficking-glbs-2754045-2025-07-11",
      "headline": "Kanye West sued by ex-assistant for sexual assault and traffickingLauren Pisciotta has sued Kanye West, accusing him of sexual assault, harassment, and trafficking. She details disturbing incidents, including oral rape and stalking, escalating after she rejected his advances.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kichcha-sudeep-announces-k47-i-feel-the-need-to-bring-out-a-film-this-year-2753833-2025-07-10",
      "headline": "Kichcha Sudeep announces K47: I feel the need to bring out a film this yearKannada actor Kichcha Sudeep announced his forty-seventh film, tentatively titled 'K47' with 'Max' director Vijay Kartikeya. During the press conference he revealed that he aims to release the film in December 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/soha-ali-khan-recalls-sharmila-tagore-did-not-meet-saif-ali-khan-for-weeks-2753769-2025-07-10",
      "headline": "When Saif Ali Khan told Sharmila Tagore he doesn't want her, recalls Soha Ali KhanActor Soha Ali Khan recently recalled that as a working mother, Sharmila Tagore didn't see Saif Ali Khan for weeks during his childhood. She mentioned how Saif would get upset with mother Sharmila when she came to meet him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ramayana-sunny-deol-lord-hanuman-15-minute-screen-time-ranbir-kapoor-sai-pallavi-yash-2753898-2025-07-10",
      "headline": "Here's why Sunny Deol has only 15-minute screen time as Lord Hanuman in RamayanaNitesh Tiwari's 'Ramayana: Part 1', featuring Ranbir Kapoor and Yash, will release during Diwali 2026. Sunny Deol as Lord Hanuman will have a limited role in the first part with a bigger part in the 2027 sequel, promising a grand spectacle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/the-paradise-raghav-juyal-joins-nani-film-makers-share-bts-clip-on-his-birthday-2753918-2025-07-10",
      "headline": "The Paradise: Raghav Juyal joins Nani's film, makers share BTS clip on his birthdayOn Raghav Juyal's birthday, the makers of Nani's 'The Paradise' officially welcomed him to the cast with a BTS video. In the clip, director Srikanth Odela teased Juyal's dark and brutal character."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/fir-reveals-father-killed-tennis-player-radhika-yadav-over-taunts-academy-dispute-2754035-2025-07-11",
      "headline": "Taunted for living off daughter, tennis player's father shot her on wife's birthdayNational tennis player Radhika Yadav was shot dead by her father at their Gurugram home. He confessed to the murder, citing anger over her tennis academy and public remarks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/not-giving-up-stand-firm-against-violence-kapil-sharmas-canada-cafes-message-after-firing-2754082-2025-07-11",
      "headline": "Not giving up, stand against violence: Kapil Sharma's Canada cafe after firingIn a strong message on Instagram, comedian Kapil Sharma's Kap's Cafe said that the firing attack late Wednesday night has shocked them, but they won't give up, and will stand firm against violence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/tej-pratap-yadav-rally-mahua-new-flag-bihar-assembly-elections-rjd-expulsion-2754134-2025-07-11",
      "headline": "Tej Pratap Yadav to float party? MLA holds rally with new flag after expulsionIn his first rally after parting ways with the RJD, Tej Pratap and his supporters were seen carrying a green-and-white flag, with 'Team Tej Pratap Yadav' written on it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-bazball-shutdown-lords-test-ben-stokes-joe-root-2754144-2025-07-11",
      "headline": "ENG vs IND: Bazball shutdown, but was it really India's day at Lord's?Day 1 of the Lord's Test saw England being forced to mute Bazball and go for the traditional approach. While India forced the hosts to move away from their usual style, did they actually win the day in the end?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/fake-weddings-delhi-ncr-ethnic-wear-food-no-relatives-noida-latest-party-trend-india-2754092-2025-07-11",
      "headline": "Fake wedding parties: Kya hai yeh nautanki?Fake weddings are becoming popular in Delhi-NCR as a fresh way to party without nosy relatives. These events combine ethnic fashion, street food and a relaxed atmosphere for urban Indians."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ups-chhangur-baba-got-rs-300-crore-from-muslim-countries-via-nepal-for-conversions-2754154-2025-07-11",
      "headline": "UP's Chhangur Baba got Rs 300 crore from Muslim countries for conversionsOut of this, Rs 200 crore has been officially confirmed, while Rs 300 crore was routed through Nepal using illegal hawala channels."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/priya-nair-first-woman-ceo-hul-hindustan-unilever-92-year-history-education-work-experience-rohit-jawa-2754081-2025-07-11",
      "headline": "Who is Priya Nair, first woman CEO of Hindustan UnileverPriya Nair will take over from Rohit Jawa, who will step down on July 31, 2025. Nair's appointment will come into effect from August 1, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-showroom-experience-center-mumbai-opening-july-15-elon-musk-entry-india-2754155-2025-07-11",
      "headline": "Tesla drives into India: Mumbai to get first experience centre on July 15The space will allow visitors to explore Tesla's electric cars and related technologies, though test drives and deliveries may not be offered at this stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/priyanka-chopra-chats-with-panchayat-pradhan-raghubir-yadav-asks-for-lauki-from-phulera-heads-of-state-2754118-2025-07-11",
      "headline": "Dekh rahe ho Binod: Priyanka chats with Pradhan, asks for lauki from PhuleraIn a surprise crossover, 'Heads Of State' star Priyanka Chopra shared a fun exchange with Panchayat's Pradhan ji (Raghubir Yadav), a moment that has quickly gone viral.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-announces-35-tariff-rate-for-goods-imported-from-canada-starting-august-1-glbs-2754062-2025-07-11",
      "headline": "After Trump's 35% tariffs, Canada says will continue to defend our businessTrump has already sent letters to 22 countries outlining new tariff rates, including a 50 per cent tariff on imports from Brazil. He warned that any retaliation would be met with even higher tariffs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/who-is-harjeet-singh-laddi-kalislistani-terrorist-behind-firing-at-kaps-cafe-2754120-2025-07-11",
      "headline": "Who is Harjeet Singh Laddi, Khalistani terrorist behind firing at Kap's cafe?Harjeet Singh Laddi, the Khalistani terrorist who claimed responsibility for firing at Kapil Sharma's Canada cafe, has long been under surveillance for his involvement in extremist activities and is on the National Investigation Agency's most-wanted list. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/police-constable-left-sobbing-with-broken-nose-after-manchester-airport-brawl-jury-sees-footage-2754084-2025-07-11",
      "headline": "Bodycam video shows moment cop bloodied, sobbing after arrest brawl at US airportFootage from the constable's body-cam was played to the jury which showed a bloodied and crying Ward being comforted by a colleague in the aftermath of the incident."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kyunki-saas-bhi-kabhi-bahu-thi-reboot-story-gender-issues-smriti-irani-as-tulsi-virani-progressive-show-2753862-2025-07-11",
      "headline": "Why the Kyunki Saas Bhi Kabhi Bahu Thi reboot must be more of today, less of 2000The 'Kyunki Saas Bhi Kabhi Bahu Thi' reboot can't survive on nostalgia alone. It must spark real conversations about gender, relationships and inclusivity, turning Tulsi from a tradition-keeper into a cultural voice of change. Here's what we want more of. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/as-brics-debates-reducing-dollar-dependence-why-india-is-walking-a-fine-line-2753797-2025-07-10",
      "headline": "As BRICS debates reducing dollar dependence, why India is walking a fine lineNew Delhi's core demand: build alternatives that are interoperable and don't just replace the US dollar with another hegemon\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/no-more-sir-bangladesh-scraps-hasina-era-rule-for-addressing-women-officials-glbs-2754041-2025-07-11",
      "headline": "No more 'Sir': Bangladesh scraps Hasina-era rule for addressing women officialsBangladesh's interim government has officially cancelled a controversial rule from the Hasina era that required female officials to be addressed as \"Sir.\" A new committee will review titles and suggest gender-appropriate alternatives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/reviews/story/mg-m9-mpv-review-kia-carnival-toyota-vellfire-2754133-2025-07-11",
      "headline": "MG M9 review, first drive: An all-electric alternative to the Toyota Vellfire and Kia Carnival?There's an all-new competitor in the luxury MPV market, a segment which appears to be the next frontier for the ultra-rich. Can the all-electric MG M9 be the choice for the wealthy man in search of a van?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/parag-tyagi-shuts-down-trolls-shefali-jariwala-death-dont-care-about-judgements-2754141-2025-07-11",
      "headline": "Parag Tyagi shuts down trolls after Shefali's death: Don't care about judgementsActor Parag Tyagi reacted to all the criticism about being active on social media after wife Shefali Jariwala's death. He responded to the trolls in the comment section of his latest post. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/fresh-iphone-17-pro-design-leaked-just-2-months-ahead-of-potential-launch-event-2754124-2025-07-11",
      "headline": "Fresh iPhone 17 Pro design leaked just 2 months ahead of potential launch eventJust two months ahead of Apple's potential iPhone 17 launch event, a new leak has given the clearest look yet at what could be the final design of the iPhone 17 Pro."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-defensive-blockball-lords-test-bazball-shift-2754068-2025-07-11",
      "headline": "From Bazball to Blockball: England return to old ways at Lord'sEngland vs India, Lord's Test: England shunned Bazball and turned to Blockball on Day 1 of the Lord's Test. Is this England's way of telling the world that it took them 3 years to get serious about Test cricket?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/bathroom-camping-is-gen-zs-new-escape-from-crisis-does-it-help-2753848-2025-07-11",
      "headline": "'Bathroom camping' is Gen Z's new escape from crisis. Does it help?In the latest episode of what's the new bizarre trend, Gen Z is finding solace in washrooms. Like a quick winding down session, bathrooms are becoming zen rooms. But is it worth it?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kattappa-baahubali-and-the-pop-culture-storm-prabhass-iconic-film-created-2753884-2025-07-11",
      "headline": "Kattappa, Baahubali and the pop culture storm Prabhas's iconic film createdSS Rajamouli's 'Baahubali: The Beginning' completed a decade on July 10, marking a revolutionary moment for Indian cinema with its unforgettable storytelling and cultural impact. The film, starring Prabhas and Rana Daggubati, not only captivated audiences but also sparked a nationwide meme culture and fan theories, making it a timeless pop culture phenomenon in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/pro-tamil-party-naam-tamilar-katchi-holds-meeting-hundreds-of-cattle-raises-land-demands-2754042-2025-07-11",
      "headline": "Pro-Tamil party holds rare meeting with hundreds of cattle, raises land demandsNaam Tamilar Katchi held a one-of-a-kind conference in Madurai attended by hundreds of cattle, demanding restoration of grazing lands and spotlighting farmers' issues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/amitabh-bachchan-announces-kaun-banega-crorepati-17-agneepath-vijay-style-watch-promo-2754099-2025-07-11",
      "headline": "Amitabh Bachchan announces KBC 17 in Agneepath's Vijay style. Watch promoAmitabh Bachchan officially announced the return of Kaun Banega Crorepati. Season 17 in the new promo. The popular quiz show is set to premiere on August 11 on Sony TV. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/armed-men-kidnap-kill-nine-bus-passengers-in-pakistans-balochistan-province-2754102-2025-07-11",
      "headline": "Armed men kidnap, kill nine bus passengers in Pakistan's Balochistan provinceNine bus passengers were kidnapped and shot dead by armed men in Pakistan's Balochistan province, with officials suspecting separatist militants behind the attack. No group has claimed responsibility yet.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/superman-dean-cain-james-gunn-immigrant-remark-too-woke-2754123-2025-07-11",
      "headline": "Former Superman Dean Cain feels James Gunn's immigrant superhero remark is too wokeActor Dean Cain has voiced his disapproval of James Gunn's 'Superman' with regard to the immigrant narrative. He slammed the filmmaker and Hollywood for making iconic characters too woke."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kangana-ranaut-criticises-diljit-dosanjh-pakistani-actor-hania-aamir-sardaar-ji-3-collaboration-2754132-2025-07-11",
      "headline": "Kangana asks why Diljit has his own path amid row over Sardaar Ji 3Kangana Ranaut reacted to Diljit Dosanjh's collaboration with Pakistani actor Hania Aamir in 'Sardaar Ji 3', emphasising nationalism. She stressed the importance of a unified national agenda. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nayanthara-vignesh-shivan-divorce-5-crore-notice-chandramukhi-footage-2754098-2025-07-11",
      "headline": "Nayanthara silences divorce rumours with a cute pic featuring husband Vignesh ShivanNayanthara shared an adorable picture with Vignesh Shivan to address 'loopy' news about them. Recently, reports about them being slapped with a Rs 5 crore notice for their documentary and about their divorce surfaced."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-nick-jonas-dreamy-miami-holiday-malti-painting-steals-attention-2754091-2025-07-11",
      "headline": "Priyanka-Nick enjoy dreamy Miami holiday, but Malti's painting steals attentionPriyanka Chopra, Nick Jonas, and daughter Malti Marie have jetted to Miami for their summer break. The actor shared pictures from their trip, and little Malti is too cute to miss. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-bazball-shutdown-lords-test-ben-stokes-joe-root-2754144-2025-07-11",
      "headline": "ENG vs IND: Bazball shutdown, but was it really India's day at Lord's?Day 1 of the Lord's Test saw England being forced to mute Bazball and go for the traditional approach. While India forced the hosts to move away from their usual style, did they actually win the day in the end?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-sem-verbeek-father-happy-birthday-mixed-doubles-title-katerina-siniakova-2754138-2025-07-11",
      "headline": "Wimbledon mixed champion Verbeek gets crowd to sing Happy Birthday to dadSem Verbeek marked his first Grand Slam title at Wimbledon 2025 with a special gesture, leading Centre Court in singing 'Happy Birthday' to his father moments after winning the mixed doubles final alongside Katerina Siniakova."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-joe-root-99-ollie-pope-reaction-lords-test-day-1-2754127-2025-07-11",
      "headline": "Joe Root has inspired everyone, hope he completes his hundred on Day 2: PopeEngland vice-captain Ollie Pope praised Joe Root for his inspirational presence in the dressing room and expressed hope that the star batter would complete a well-deserved century on Day 2 of the third Test against India at Lord's."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/tottenham-hotspur-mohammed-kudus-signing-west-ham-united-premier-league-2754115-2025-07-11",
      "headline": "Tottenham Hotspur complete Mohammed Kudus signing from West Ham UnitedTottenham Hotspur have bolstered their squad by signing Mohammed Kudus from West Ham for €55 million, making a bold start to their 2025–26 campaign under new manager Thomas Frank and aiming for silverware on all fronts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wiaan-mulder-brain-lara-chat-reveal-should-have-gone-for-400-south-africa-vs-zimbabwe-2754100-2025-07-11",
      "headline": "Wiaan Mulder reveals Brian Lara's message: Should've gone for the 400Wiaan Mulder declared on 367 in South Africa's dominant win over Zimbabwe, falling short of Brian Lara's iconic 400. But Lara later told Mulder he should've gone for it and backed him to try again."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-amanda-anisimova-mental-health-battles-women-singles-final-2754093-2025-07-11",
      "headline": "How Amanda Anisimova defied mental health battles to rediscover herselfWimbledon: After dropping out of the top 400 of the WTA rankings since her mental health break two years ago, Amanda Anisimova is on the cusp of her maiden Grand Slam and will look for glory when she faces Iga Swiatek in the final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/curtis-campher-five-wickets-five-balls-munster-reds-t20-historic-bowling-feat-2754085-2025-07-11",
      "headline": "Ireland's Curtis Campher becomes first man to take five wickets in five ballsIreland all-rounder Curtis Campher etched his name into the history books on Thursday, becoming the first male cricketer in professional cricket to take five wickets in five consecutive deliveries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/salonee-dangore-exclusive-interview-wcpl-shane-warne-2753242-2025-07-11",
      "headline": "Inspired by Shane Warne, Salonee Dangore sets sights on dream WCPL journeyIn an exclusive chat with India Today Digital, Chhattisgarh leg-spinner Salonee Dangore spoke about her upcoming stint with the Trinbago Knight Riders and her journey as a net bowler with the Delhi Capitals in the Women's Premier League.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ben-stokes-groin-injury-england-india-third-test-lords-ollie-pope-2754078-2025-07-11",
      "headline": "Ben Stokes' injury scare leaves England camp concerned at Lord'sOllie Pope said England are keeping their fingers crossed that captain Ben Stokes has not sustained a serious injury, after he appeared to struggle on the first day of the third Test against India at Lord's."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-vs-jannik-sinner-wimbledon-semifinal-preview-head-to-head-record-live-streaming-info-2754073-2025-07-11",
      "headline": "Djokovic vs Sinner: All you need to know about Wimbledon semi-finalWimbledon 2025: 24-time Grand Slam champion Novak Djokovic and world No. 1 Jannik Sinner will face off in a blockbuster semi-final clash on Friday on Centre Court."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-defensive-blockball-lords-test-bazball-shift-2754068-2025-07-11",
      "headline": "From Bazball to Blockball: England return to old ways at Lord'sEngland vs India, Lord's Test: England shunned Bazball and turned to Blockball on Day 1 of the Lord's Test. Is this England's way of telling the world that it took them 3 years to get serious about Test cricket?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/curtis-campher-five-wickets-five-balls-munster-reds-t20-historic-bowling-feat-2754085-2025-07-11",
      "headline": "Ireland's Curtis Campher becomes first man to take five wickets in five ballsIreland all-rounder Curtis Campher etched his name into the history books on Thursday, becoming the first male cricketer in professional cricket to take five wickets in five consecutive deliveries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/salonee-dangore-exclusive-interview-wcpl-shane-warne-2753242-2025-07-11",
      "headline": "Inspired by Shane Warne, Salonee Dangore sets sights on dream WCPL journeyIn an exclusive chat with India Today Digital, Chhattisgarh leg-spinner Salonee Dangore spoke about her upcoming stint with the Trinbago Knight Riders and her journey as a net bowler with the Delhi Capitals in the Women's Premier League.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ben-stokes-groin-injury-england-india-third-test-lords-ollie-pope-2754078-2025-07-11",
      "headline": "Ben Stokes' injury scare leaves England camp concerned at Lord'sOllie Pope said England are keeping their fingers crossed that captain Ben Stokes has not sustained a serious injury, after he appeared to struggle on the first day of the third Test against India at Lord's."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-vs-jannik-sinner-wimbledon-semifinal-preview-head-to-head-record-live-streaming-info-2754073-2025-07-11",
      "headline": "Djokovic vs Sinner: All you need to know about Wimbledon semi-finalWimbledon 2025: 24-time Grand Slam champion Novak Djokovic and world No. 1 Jannik Sinner will face off in a blockbuster semi-final clash on Friday on Centre Court."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-defensive-blockball-lords-test-bazball-shift-2754068-2025-07-11",
      "headline": "From Bazball to Blockball: England return to old ways at Lord'sEngland vs India, Lord's Test: England shunned Bazball and turned to Blockball on Day 1 of the Lord's Test. Is this England's way of telling the world that it took them 3 years to get serious about Test cricket?"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}