{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/high-salary-still-broke-financial-expert-sanjay-kathuria-on-lifestyle-inflation-2752583-2025-07-08",
      "headline": "Earning Rs 80,000 a month and still broke? Finance coach explains what's wrongMany in their 20s and 30s are earning more than generations before, but their money often disappears into lifestyle upgrades, digital conveniences, and impulse-driven choices. The result is a sense of helplessness despite a good paycheck."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bill-gates-net-worth-trails-former-microsoft-ceo-steve-balmer-top-10-richest-world-2752559-2025-07-08",
      "headline": "Bill Gates no longer in world's top 10 richest; trails former Microsoft CEOBill Gates now ranks behind Michael Dell, who is at number 11 with $137 billion, and Steve Ballmer, his former Microsoft colleague, who is far ahead at number 5 with $172 billion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/all-you-need-to-know-about-uae-golden-visa-cost-application-process-documentation-2752538-2025-07-08",
      "headline": "All you need to know about UAE's Golden Visa: Cost, application, documentationUnlike earlier Golden Visas that required big investments in property or business, this new scheme allows skilled professionals to apply based on their talent and work experience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/jane-street-vs-sebi-all-you-need-to-know-about-the-case-2752537-2025-07-08",
      "headline": "Jane Street vs Sebi: All you need to know about the caseAt the heart of the controversy is a long-running investigation into the firm's index arbitrage strategy, one that Jane Street insists is standard and legal, but which Sebi believes may have distorted prices in India's rapidly growing equity derivatives market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/will-you-receive-a-tax-refund-now-if-you-file-your-itr-before-september-15-2752492-2025-07-08",
      "headline": "Filed your ITR early? Will you get a faster tax refund?Filing an ITR early improves your chances of a quicker refund, but only if your return is correct, complete and verified on time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/insurance-claim-rejections-india-irda-data-real-stories-personal-finance-health-life-term-2752351-2025-07-08",
      "headline": "Insured, but still deniedIn Part 2 of our series on India's insurance crisis, we explore why, for thousands of Indians, having a policy doesn't mean having protection when it matters most."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sebi-vs-jane-street-to-challenge-trading-ban-slams-charges-as-inflammatory-2752400-2025-07-08",
      "headline": "Jane Street to challenge Sebi trading ban, slams charges as inflammatory: ReportIn an internal email to staff over the weekend, the US-based firm said it was \"beyond disappointed\" by Sebi's accusations, which it described as \"extremely inflammatory.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/expert-sanjay-bangar-ulips-high-premiums-not-tax-free-explained-2752383-2025-07-08",
      "headline": "Have lost their tax edge: Expert sounds the alarm on ULIPsThe tax expert said ULIPs no longer guarantee tax-free returns. Investors paying over Rs 2.5 lakh annually may face capital gains tax—making mutual funds a more efficient alternative."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-65-points-lower-nifty-below-25500-kotak-bank-up-3-percent-2752380-2025-07-08",
      "headline": "Sensex opens 65 points lower, Nifty below 25,500; Kotak Bank up 3%The S&P BSE Sensex was up by 72.04 points to 83,514.54, while the NSE Nifty50 added 16.50 points to 25,477.80 as of 9:40 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-sensex-nifty-trading-setup-trump-tariff-trade-deal-nse-bse-2752364-2025-07-08",
      "headline": "Market opening: How will Sensex, Nifty react to Trump's tariff announcement?While a US-India trade deal may help improve mood, the benefits may be limited to specific sectors. For today's session, Nifty to find support between 25,330 and 25,180 and face resistance near 25,510 and 25,630, say experts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-tariff-new-14-countries-latest-rates-india-trade-deal-brics-export-america-2752360-2025-07-08",
      "headline": "Trump's tariff list: 14 countries, new rates, and what they export to AmericaUS President Donald Trump confirmed that letters had been sent to several nations, warning them that if new trade agreements are not reached by August 1, increased import duties will be implemented."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/necktie-nomics-can-the-rbi-governor-tie-colour-predict-rate-moves-2752135-2025-07-07",
      "headline": "Necktie Nomics: Can the RBI Governor's tie colour predict rate moves?An SBI report looked at the ties worn by the RBI Governor during Monetary Policy Committee (MPC) meetings. Instead of only watching inflation numbers or GDP data, they turned their attention to the shades of silk draped around the Governor's neck."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-trump-tariff-trade-sensex-ends-flat-nifty-below-25500-hul-gains-3-2752040-2025-07-07",
      "headline": "Sensex ends flat, Nifty below 25,500; HUL gains 3%The S&P BSE Sensex closed 9.61 points higher at 83,442.50, while the NSE Nifty remained flat to end below 25,500."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gccs-global-capability-centres-push-indias-office-leasing-to-new-heights-report-2751996-2025-07-07",
      "headline": "GCCs push India's office leasing to new heights: ReportGCCs are no longer coming to India just for cheaper costs. They now see India as a strong base for talent, innovation and large modern offices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sebi-increase-watch-derivative-trading-sanjay-malhotra-jane-street-ban-fo-stock-market-news-2751986-2025-07-07",
      "headline": "Sebi to intensify watch on derivatives trading after Jane Street episodeIndia is currently the world's largest equity derivatives market. According to the Futures Industry Association, it accounted for nearly 60% of the derivatives contracts traded globally in April."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/emis-hurt-india-middle-class-more-than-inflation-says-financial-expert-2751948-2025-07-07",
      "headline": "EMIs hurt India's middle class more than inflation, says financial expertToday, almost everything is available on easy monthly instalments, from a new phone to flight tickets, even groceries. What was once a helpful option has now turned into a lifestyle. However, this is silently eating into people's income, leaving little room for savings or emergencies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filing-itr-for-the-first-time-7-common-errors-new-taxpayers-must-avoid-2751883-2025-07-07",
      "headline": "Filing ITR for the first time? 7 common errors new taxpayers must avoidFiling your ITR is not enough. You must verify it too. If you forget, the tax department treats it as if you never filed it at all. You can e-verify using Aadhaar OTP, net banking, or by sending a signed physical copy. Without verification, your return stays incomplete."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/house-rent-above-rs-50000-heres-the-tds-rule-you-need-to-know-2751860-2025-07-07",
      "headline": "House rent above Rs 50,000? Here's the TDS rule you need to knowFor tenants living in high-rent homes, the line between a routine payment and a tax lapse can be thinner than it seems, and ignoring it can invite penalties that quickly snowball."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/hul-share-price-hindustan-unilever-q1-results-brokerage-views-ubs-nuvama-should-you-buy-2751850-2025-07-07",
      "headline": "HUL shares gain 2% today. Should you buy the FMCG stock?HUL share price: The stock has gained 3.67% in the last five trading sessions. However, when looking at a longer time frame, the stock is still down 7.97% over the past year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/lost-rs-18-lakh-in-6-months-financial-advisor-abhishek-walia-warning-on-online-betting-2751836-2025-07-07",
      "headline": "Lost Rs 18 lakh in 6 months: Financial advisor's warning on online bettingWhat begins as casual fun can spiral into secrecy, debt, and broken trust. A financial advisor warns that, without strong regulation, betting apps are fast becoming one of India's biggest financial threats."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tariffs-steel-auto-aluminium-interim-trade-deal-us-trump-deadline-commerce-2751832-2025-07-07",
      "headline": "Tariffs on steel, auto unlikely in interim trade deal with US: Government sourcesWith the US to soon notify countries of higher tariffs by July 9, with new rates effective August 1, sectoral levies on steel, auto and aluminium are unlikely in the India-US interim trade deal, government sources said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-100-points-lower-nifty-below-25500-hul-up-1-percent-2751812-2025-07-07",
      "headline": "Sensex opens 100 points lower, Nifty below 25,500; HUL up 2%The S&P BSE Sensex was down by 65.28 points to 83,367.61, while the NSE Nifty50 lost 16.45 points to 25,444.55 as of 9:50 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-tariff-us-trade-letters-india-deal-global-trade-what-to-expect-stock-market-2751802-2025-07-07",
      "headline": "Trump reveals tariff letter plan with a twist: Here's what's coming nextTrump also said that any country supporting what he called the 'Anti-American policies' of the BRICS group will face an additional 10% tariff."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-sensex-nifty-trade-setup-trump-tariff-trade-deal-india-bse-nse-2751784-2025-07-07",
      "headline": "Stock market opening: Will Sensex, Nifty fall as Trump singals delay in tariffs?The Gift Nifty futures were trading at 25,512 as of 8:08 am., suggesting that the Nifty 50 may open around its previous close of 25,461. Sensex and Nifty declined by 0.7% each last week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/the-stark-irony-of-worlds-4th-largest-economy-with-81-crore-free-mealers-2749762-2025-07-06",
      "headline": "The stark irony of world's 4th largest economy with 81 crore free-mealersIndia's growing wealth gap often sparks despair, but the author, a retired ESIC Regional Director, argues the real solution lies in enforcing India's long-ignored labour laws."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/oxford-india-forum-2025-business-leaders-policymakers-entrepreneurs-kalli-purie-isro-ai-2751203-2025-07-05",
      "headline": "Oxford India Forum 2025 celebrates India's rising influence, youthful ambitionThe Oxford India Forum 2025 brought together a dynamic mix of business leaders, policymakers, entrepreneurs, academics and students to reflect on India's evolving global role and the path forward."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/photo-essay/the-great-indian-salary-crisis-middle-class-unemployment-job-loss-268-04-07-2025",
      "headline": "The Great Indian Salary CrisisWhite-collar employees in India are caught in a salary spiral where costs keep climbing, pay moves slowly, and financial stability slips further away. On paper, the economy is booming, but the pay cheques of working middle-class Indians tell a very different story."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-proposes-retaliatory-duties-at-world-trade-body-against-us-tariffs-on-autos-2750911-2025-07-04",
      "headline": "India proposes retaliatory duties at world trade body against US tariffs on autosIndia has proposed to impose an equivalent amount of duty collected from products originating in the United States."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/real-estate-vs-mutual-funds-where-should-you-invest-explains-stock-market-expert-2750826-2025-07-04",
      "headline": "Real Estate vs Mutual Funds: Where should you invest, explains stock market expertOwning a house was once every family's dream, but times have changed. With high prices and new ways to invest, is real estate still smart, or are mutual funds better? A stock market expert explains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/books/video/ankur-mehra-book-pixels-to-profits-creators-must-think-like-startups-not-influencers-2750822-2025-07-04",
      "headline": "Ankur Mehra says creators must think like startups, not influencersAnkur Mehra, in his new book Pixels to Profits, urges creators to stop chasing follower counts and instead build sustainable, multi-platform businesses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/books/story/success-isnt-about-number-of-followers-in-creator-economy-ankur-mehra-2750781-2025-07-04",
      "headline": "Success isn't about number of followers in creator economy: Ankur MehraIn a conversation with Business Today's Sakshi Batra, Ankur Mehra, author of Pixels to Profits, explains what it really takes to succeed in the creator economy, and why chasing viral fame or follower counts may be the wrong metric altogether."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-192-points-higher-nifty-below-25500-infosys-gains-1-percent-2750774-2025-07-04",
      "headline": "Sensex ends 192 points higher, Nifty below 25,500; Infosys gains 1%Sensex ends 192 points higher, Nifty below 25,500; Infosys gains 1%"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/prada-kolhapuri-chappal-gi-tag-law-protection-indian-articrafts-artisans-reform-global-policy-fashion-2750757-2025-07-04",
      "headline": "India tags it, West sells it. Can Prada's Kolhapuri row lead to real reform?The luxury brand's new \"toe-ring sandal\" has ignited not just cultural outrage but also legal action in India, with a Public Interest Litigation filed in the Bombay High Court."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/where-are-itr-2-and-itr-3-forms-why-they-are-missing-and-what-to-do-income-tax-filing-2750711-2025-07-04",
      "headline": "Where are ITR-2 and ITR-3 forms? Why they're missing and what to doIt's ITR season but many taxpayers can't find the ITR-2 and ITR-3 forms on the Income Tax portal yet. If you have capital gains, foreign income or business income, this delay might worry you. The good news is there's an extended deadline this year. Here's why these forms are missing and what you should do next."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/sbi-credit-card-rules-changing-from-july-15-here-is-what-cardholders-must-know-2750616-2025-07-04",
      "headline": "SBI credit card rules changing from July 15: Here's what cardholders must knowAt present, many cardholders pay only a small part of their bill to avoid late charges. But now, the way the minimum amount due (MAD) is calculated will change starting July 15, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/exclusive-world-bank-poverty-in-india-measurement-metrics-one-in-four-below-minimum-standard-of-living-2750607-2025-07-04",
      "headline": "One in 4 Indians still below minimum standard of living: World BankDespite a sharp drop in extreme poverty, about one in four Indians still falls below the level needed to meet essential needs and maintain a minimum standard of living."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sebi-ban-jane-street-stock-manipulation-bank-nifty-options-futures-shorting-reason-interim-order-2750597-2025-07-04",
      "headline": "Sebi bans Jane Street for stock market manipulation. Here's what went wrongUS Trading Firm Jane Street: Securities and Exchange Board of India (Sebi) said the trades executed by the group were \"prima facie fraudulent and manipulative\" and violated the country's capital market regulations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/want-rs-36-lakh-in-5-years-know-who-can-avail-this-government-scheme-national-savings-certificate-nsc-2750564-2025-07-04",
      "headline": "Want Rs 36 lakh in 5 years? Know who can avail this government schemeThis government scheme offers guaranteed returns, so you don't have to worry about market ups and downs. For the current quarter, the interest rate is fixed at 7.7% per year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/soham-parekh-us-startups-multiple-jobs-moonlighting-why-reasons-latest-update-2750540-2025-07-04",
      "headline": "Why did Soham Parekh work multiple jobs? Indian techie shares his reasonsHe confirmed that he worked at several companies simultaneously and misrepresented his location and employment status in the process."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-gathering-dust-in-locker-financial-advisor-explains-how-to-make-it-work-2750539-2025-07-04",
      "headline": "Gold gathering dust in locker? Financial advisor explains how to make it workA financial advisor has warned that family gold stored in lockers faces risk from rust, floods, and poor insurance. He explains how a scheme can offer safety and steady returns instead."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/neena-gupta-joins-kareena-kapoor-calling-out-prada-kolhapuri-chappal-row-2752501-2025-07-08",
      "headline": "After Kareena Kapoor, Neena Gupta calls out Prada over Kolhapuri footwear row Actor Neena Gupta joined Kareena Kapoor in calling out Prada for allegedly copying the design of traditional Kolhapuri chappals in their latest collection. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saiyami-kher-becomes-first-indian-actor-to-complete-ironman-703-twice-in-a-year-2752593-2025-07-08",
      "headline": "Saiyami Kher becomes first Indian actor to complete Ironman 70.3 twice in a yearSaiyami Kher has become the first Indian actor to complete the Ironman 70.3 triathlon twice in less than a year. She finished her second race in Sweden with a faster time. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ananya-panday-cheers-for-shanaya-kapoor-ahead-of-aankhon-ki-gustaakhiyan-release-2752491-2025-07-08",
      "headline": "Ananya Panday cheers for Shanaya Kapoor ahead of Aankhon Ki Gustaakhiyan releaseAhead of 'Aankhon Ki Gustaakhiyan' release, actor Ananya Panday cheered for debutant Shanaya Kapoor on Instagram. She also shared that she loves the song 'Alvida' from the upcoming film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/aamir-khan-jwala-gutta-vishnu-vishal-10-months-ivf-journey-2752577-2025-07-08",
      "headline": "Aamir Khan hosted Jwala Gutta for 10 months during her IVF journey: Vishnu VishalAamir Khan helped actor Vishnu Vishal and badminton player Jwala Gutta by directing them to a doctor who specialises in IVF. In a recent interview, Vishnu also revealed that Jwala stayed at Aamir's Mumbai house throughout her pregnancy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/raveena-tandon-fumes-at-crew-for-secretly-recording-shraddha-kapoor-rahul-mody-2752458-2025-07-08",
      "headline": "Raveena Tandon fumes at crew for secretly recording Shraddha Kapoor, Rahul ModyActor Raveena Tandon recently slammed a cabin crew member for secretly filming Shraddha Kapoor and her rumoured boyfriend Rahul Mody. Although the clip was originally recorded in February, it has resurfaced on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranbir-kapoor-said-raha-is-his-dal-chawal-recalls-his-ramayana-co-star-indira-krishnan-2752443-2025-07-08",
      "headline": "Raha is his dal chawal: Ranbir's Ramayana co-star recalls set conversationRamayana actor Indira Krishnan spoke about actor Ranbir Kapoor's bond with his daughter Raha in a recent interview. She said Kapoor once told her that Raha is his dal chawal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/r-madhavan-age-appropriate-romance-bollywood-aap-jaisa-koi-2752544-2025-07-08",
      "headline": "R Madhavan on Bollywood's shift to age-appropriate romances: Woh zamana gayaActor R Madhavan discusses the end of older heroes romancing younger heroines in Bollywood. His film 'Aap Jaisa Koi' explores modern love and loneliness beyond age differences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/apoorva-mukhija-parents-compared-her-to-deepika-padukone-after-indias-got-latent-row-2752415-2025-07-08",
      "headline": "Apoorva Mukhija's parents compared her to Deepika Padukone after India's Got Latent rowInfluencer Apoorva Mukhija told filmmaker Farah Khan how her parents reacted to the 'India's Got Latent' controversy. She also shared her initial reaction to the backlash she received for her controversial remarks. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/shreya-ghoshal-sings-piyu-bole-for-pregnant-fan-during-her-amsterdam-tour-2752534-2025-07-08",
      "headline": "Shreya Ghoshal melts hearts as she sings Piyu Bole for pregnant fanDuring her Amsterdam tour stop, Indian playback singer Shreya Ghoshal shared a touching moment with an expectant mother by singing 'Piyu Bole' to her unborn child. This heartfelt gesture has gone viral on social media, showcasing Ghoshal's warmth and deep connection with her fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/pamela-anderson-opens-up-about-why-she-doesnt-want-to-be-known-as-a-sex-symbol-2752500-2025-07-08",
      "headline": "Pamela Anderson opens up about why she doesn't want to be known as a sex symbolActor Pamela Anderson recently shared that she doesn't want to be associated with her sex symbol title. She mentioned that it can be scary, and it makes her uncomfortable."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/unni-mukundan-instagram-hacked-actor-warns-against-suspicious-activity-2752505-2025-07-08",
      "headline": "Unni Mukundan's Instagram hacked, actor warns against suspicious activityMalayalam actor Unni Mukundan has warned his fans that his official Instagram account has been hacked and urged caution against interacting with any messages from it. He is actively working with relevant teams to regain control and promises to update followers only through verified channels."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/metro-in-dino-jab-we-met-life-in-a-metro-love-aaj-kal-rain-becomes-a-character-in-the-films-2752099-2025-07-08",
      "headline": "When it rains in Bollywood... magic unfolds and stories transformBollywood filmmakers have long used rain not just as a backdrop, but as a powerful emotional tool, a silent character that enhances love, heartbreak, transformation, and nostalgia. From 'Metro... In Dino' to 'Jab We Met', these iconic rain moments continue to stir hearts and shape stories."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nick-jonas-calls-priyanka-chopra-saint-shares-parenting-lessons-2752460-2025-07-08",
      "headline": "Nick Jonas calls Priyanka Chopra saint, shares parenting lessonsNick Jonas recently opened up about fatherhood and called wife Priyanka Chopra a 'saint' while sharing parenting lessons. He praised Priyanka as an amazing partner who makes his journey as a father even more special."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/scarlett-johansson-highest-grossing-actor-beat-robert-downey-samuel-jackson-hollywood-2752408-2025-07-08",
      "headline": "Scarlett Johansson becomes highest grossing actor, beats Robert Downey JrActor Scarlett Johansson has set a new global box office record as the highest-grossing lead actor. Her milestone post-'Jurassic World Rebirth' propelled her past fellow MCU stars."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-twinkle-khanna-enjoy-summer-getaway-children-aarav-nitara-2752473-2025-07-08",
      "headline": "Akshay-Twinkle enjoy lakeside picnic with children Aarav and Nitara. WatchTwinkle Khanna and Akshay Kumar stepped out for a picnic together with their children Nitara and Aarav. The former actor shared a video, giving a glimpse of their family time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kyunki-saas-bhi-kabhi-bahu-thi-is-back-but-who-asked-for-it-2752463-2025-07-08",
      "headline": "Kyunki Saas Bhi Kabhi Bahu Thi is back. But, who asked for it? 'Kyunki Saas Bhi Kabhi Bahu Thi' may have once stood as a symbol of family values, teaching the audience what an ideal woman should look like, but it doesn't sound relevant today. Nostalgia may be powerful, but it shouldn't come at the cost of progress. Women are chasing dreams beyond the kitchen. Do you believe that bringing back Tulsi is a step forward in storytelling?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-trailer-ahaan-panday-aneet-padda-promise-an-imperfectly-perfect-love-story-2752461-2025-07-08",
      "headline": "Saiyaara trailer: Ahaan Panday, Aneet Padda promise an imperfectly perfect love storyThe official trailer for 'Saiyaara', featuring newcomers Ahaan Panday and Aneet Padda, is now out. The trailer teases an epic love story, elevated by a background score that adds impact to every moment. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/siva-shakti-datta-lyricist-father-of-oscar-winner-mm-keeravani-dies-at-92-2752444-2025-07-08",
      "headline": "Telugu lyricist Siva Shakti Datta, father of Oscar winner MM Keeravani, dies at 92Veteran lyricist Siva Shakthi Datta, father of Oscar-award-winning composer MM Keeravani, died on Monday night at his residence in Hyderabad. He was 92 years old. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/soundarya-sharma-is-manifesting-an-action-film-with-shah-rukh-khan-2752437-2025-07-08",
      "headline": "Exclusive: Soundarya Sharma is manifesting an action film with Shah Rukh KhanActor Soundarya Sharma shared her aspirations to work in rom-coms and action films, expressing a strong desire to collaborate with Shah Rukh Khan and other renowned directors. She credited SRK's journey for inspiring her own dreams and looks forward to expanding her career with diverse and meaningful projects."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/parliament-pac-meeting-air-india-crash-aviation-safety-surge-pricing-2752590-2025-07-08",
      "headline": "Top officials present, MPs ask pointed questions on Air India crash, black boxAt the meeting, which was scheduled to discuss levy charges at airports, the MPs sought clarity on the timeframe for the analysis of the doomed aircraft's black box."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/congress-mallikarjun-kharge-mispronounces-droupadi-murmu-ram-nath-kovind-bjp-2752496-2025-07-08",
      "headline": "Murma ji and Covid: Congress chief's gaffes on Presidents' names leave BJP furiousMallikarjun Kharge, speaking in Chhattisgarh, could be heard referring to the President as 'Murma ji'. Seconds later, he did a gaffe again, mispronouncing 'Kovind' as 'Covid'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ahead-of-polls-nitish-kumar-announces-35-reservation-for-bihar-women-candidates-in-all-government-jobs-2752489-2025-07-08",
      "headline": "Nitish Kumar's big 35% jobs quota for Bihar women, NDA in poll overdriveAhead of the Assembly polls, Bihar Chief Minister Nitish Kumar announced a 35% reservation for local women in all state government jobs and approved the formation of a new Bihar Youth Commission. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-wimbledon-trip-test-retirement-let-him-watch-in-peace-2752438-2025-07-08",
      "headline": "Virat Kohli's Wimbledon trip a problem? Let him watch, without being watchedVirat Kohli watching Wimbledon at the iconic Centre Court on Monday has upset a few. The former India captain was rooting for Novak Djokovic in his fourth-round match. Can't Kohli even watch tennis now?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/shubahsnhu-shukla-ax-4-mission-isro-student-interaction-astronaut-sleeping-in-space-2752587-2025-07-08",
      "headline": "Shux tells students how astronauts sleep in space where Sun rises 16 timesConnecting directly from the International Space Station (ISS), Shukla shared firsthand experiences about the unique challenges of living, and sleeping in space. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/do-you-know-who-my-dad-is-ill-buy-you-mns-leaders-son-threatened-influencer-2752481-2025-07-08",
      "headline": "Do you know who my dad is? I'll buy you: MNS leader's son 'threatened' influencerSocial media influencer Rajshree More claimed that Rahil Shaikh kept repeating that his father's name was Javed Shaikh throughout the confrontation. \"Do you know who my father is? Who are you? I can buy you. How much money do you want?\" she claimed Rahil said to her."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/raj-thackeray-mns-workers-detained-counter-protest-rally-marathi-language-food-stall-owner-2752412-2025-07-08",
      "headline": "Raj Thackeray's party workers detained, Fadnavis says rally didn't follow routeThe Maharashtra Navnirman Sena (MNS) took out a rally to counter a protest staged by traders in Thane over the assault of a food stall owner for not speaking Marathi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/rcb-moves-karnataka-high-court-against-tribunal-order-blaming-it-for-chinnaswamy-stadium-stampede-2752557-2025-07-08",
      "headline": "RCB challenges tribunal order blaming it for Bengaluru stampede in High CourtRoyal Challengers Bengaluru (RCB) franchise moved the Karnataka High Court against CAT's remarks blaming it for the Chinnaswamy Stadium stampede. RCB argued it wasn't heard before the remarks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/insurance-claim-rejections-india-irda-data-real-stories-personal-finance-health-life-term-2752351-2025-07-08",
      "headline": "Insured, but still deniedIn Part 2 of our series on India's insurance crisis, we explore why, for thousands of Indians, having a policy doesn't mean having protection when it matters most."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/madras-high-court-warns-former-dmk-minister-ponmudy-over-derogatory-remarks-against-vaishnavites-saivites-and-women-hints-at-cbi-probe-2752527-2025-07-08",
      "headline": "Politicians act like kings: Madras High Court raps ex-minister for vulgar speechThe Madras High Court criticised former DMK Minister K Ponmudy for his derogatory remarks against Vaishnavites, Saivites, and women. Justice Velmurugan warned of a possible CBI probe if police fail to act. The final decision is set for July 8, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/zohran-mamdani-new-york-city-old-tweet-showing-middle-finger-to-columbus-statue-sparks-new-row-with-italian-americans-2752535-2025-07-08",
      "headline": "Zohran Mamdani's old tweet showing middle finger to Columbus statue sparks new rowA 2020 tweet in which he is seen showing the middle finger to a statue of Christopher Columbus has infuriated the Italian-American voter base, which makes up 8 percent of New York City's electorate,"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/mumbai/story/mumbai-ca-suicide-man-blackmailed-paid-rs-3-crore-for-private-video-2752573-2025-07-08",
      "headline": "Mumbai CA, blackmailed into paying Rs 3 crore for private video, dies by suicideOver 18 months, the accused duo, Saba Qureshi and Rahul Parnwani, extorted Rs 3 crore from Raj More by secretly recording his private moments and threatening to leak them. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kyunki-saas-bhi-kabhi-bahu-thi-is-back-but-who-asked-for-it-2752463-2025-07-08",
      "headline": "Kyunki Saas Bhi Kabhi Bahu Thi is back. But, who asked for it? 'Kyunki Saas Bhi Kabhi Bahu Thi' may have once stood as a symbol of family values, teaching the audience what an ideal woman should look like, but it doesn't sound relevant today. Nostalgia may be powerful, but it shouldn't come at the cost of progress. Women are chasing dreams beyond the kitchen. Do you believe that bringing back Tulsi is a step forward in storytelling?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rottweiler-dogs-attack-75-year-old-woman-in-dehradun-during-morning-walk-2752531-2025-07-08",
      "headline": "Rottweiler dogs attack 75-year-old Dehradun woman on morning walk, owner arrestedThe elderly woman was rushed to the hospital where she underwent multiple surgeries. According to the doctors, the woman's condition remains critical."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indian-railways-northeast-chickens-neck-capital-guwahati-sairang-aizawl-bairabi-inauguration-inspection-2749489-2025-07-08",
      "headline": "How Indian rail is pushing beyond Chicken's Neck, one capital at a timeSixty years after Assam's Guwahati was linked by rail, Mizoram's Aizawl is the latest Northeast capital ready to join the network, beyond the strategic Shillong Corridor or Chicken's Neck. With state-of-the-art bridges in Seismic Zone V and kilometre-long tunnels, the Indian Railways has connected Aizawl, after linking Itanagar and Agartala."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-acknowledges-virat-kohli-gladiator-shoutout-wimbledon-2752524-2025-07-08",
      "headline": "Novak Djokovic acknowledges Virat Kohli's 'gladiator' shoutout: Thank YouFormer World No. 1 Novak Djokovic thanked Virat Kohli for his support during his round-of-16 clash with Alex de Minaur. Kohli, clearly captivated by Djokovic's resilience on Centre Court, hailed the Serb as a \"gladiator.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/r-madhavan-age-appropriate-romance-bollywood-aap-jaisa-koi-2752544-2025-07-08",
      "headline": "R Madhavan on Bollywood's shift to age-appropriate romances: Woh zamana gayaActor R Madhavan discusses the end of older heroes romancing younger heroines in Bollywood. His film 'Aap Jaisa Koi' explores modern love and loneliness beyond age differences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/expired-valium-at-home-drug-regulator-lists-17-unused-medicines-to-flush-now-anti-anxiety-diazepam-mental-health-cdsco-2752526-2025-07-08",
      "headline": "Expired Valium at home? Drug regulator lists 17 unused medicines to flush nowThat half-used strip of pills in your medicine cabinet isn't just clutter, it could be deadly. India's top drug regulator warns that expired medications can be fatal if taken by someone they weren't meant for. This isn't just a health advisory by CDSCO, it's an urgent call to action"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/uae-dubai-golden-visa-rs-23-lakh-india-bangladesh-indians-secure-lifetime-residency-nomination-details-2752427-2025-07-08",
      "headline": "UAE offering Indians lifetime Golden Visa for just Rs 23 lakhThe UAE government has rolled out nomination-based Golden Visa, offering lifetime residency, starting at just Rs 23 lakh. This is way lower than the Rs 4.66 crore required for PR through the property route. With the ability to sponsor family, work or do business, and settle permanently, this is being called a golden chance for Indians eyeing a future in the Emirates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/swarm-of-bees-disrupt-indigo-surat-jaipur-flight-by-an-hour-2752472-2025-07-08",
      "headline": "Un-bee-lievable: Swarm of bees disrupt IndiGo Surat-Jaipur flight by an hourThe flight was ready for departure with all passengers and luggage on board when thousands of bees suddenly swarmed the aircraft's luggage door. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/indian-woman-defends-strapping-toddler-to-leash-in-us-after-video-sparks-debate-2752601-2025-07-08",
      "headline": "Indian woman defends strapping toddler to leash in US after video sparks debateAn Indian mother sparked debate online after she shared a video of her 3.5-year-old son on a leash during a family holiday in New York City."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mastermind-ashok-sao-trader-patna-businessman-gopal-khemka-murder-arrested-rivalry-2752464-2025-07-08",
      "headline": "Mastermind who plotted Patna businessman's murder a trader, arrestedA trader identified as Ashok Saw has been arrested for masterminding Patna businessman Gopal Khemka's murder, for which a Rs 10 lakh contract was given. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/we-are-close-to-making-deal-with-india-says-trump-after-tariff-letters-to-14-countries-2752328-2025-07-08",
      "headline": "Close to making deal with India: Trump after tariff letters to 14 countriesSpeaking during a dinner with Israeli PM Netanyahu, Donald Trump noted that countries unwilling to agree will receive tariff notices. Trump added some may get adjustments if they have valid reasons, stressing fairness in negotiations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-lords-test-pitch-shubman-gill-dig-england-headache-2752350-2025-07-08",
      "headline": "Lord's pitch chatter: Shubman Gill's subtle dig and England's growing headacheEngland vs India, 3rd Test: On a Birmingham featherbed that suits their style, England were outplayed comfortably by Shubman Gill's India. Ahead of the third Test in London, there is speculation that England might resort to a more lively pitch. But, can they afford the extra spice at Lord's? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/neena-gupta-joins-kareena-kapoor-calling-out-prada-kolhapuri-chappal-row-2752501-2025-07-08",
      "headline": "After Kareena Kapoor, Neena Gupta calls out Prada over Kolhapuri footwear row Actor Neena Gupta joined Kareena Kapoor in calling out Prada for allegedly copying the design of traditional Kolhapuri chappals in their latest collection. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saiyami-kher-becomes-first-indian-actor-to-complete-ironman-703-twice-in-a-year-2752593-2025-07-08",
      "headline": "Saiyami Kher becomes first Indian actor to complete Ironman 70.3 twice in a yearSaiyami Kher has become the first Indian actor to complete the Ironman 70.3 triathlon twice in less than a year. She finished her second race in Sweden with a faster time. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ananya-panday-cheers-for-shanaya-kapoor-ahead-of-aankhon-ki-gustaakhiyan-release-2752491-2025-07-08",
      "headline": "Ananya Panday cheers for Shanaya Kapoor ahead of Aankhon Ki Gustaakhiyan releaseAhead of 'Aankhon Ki Gustaakhiyan' release, actor Ananya Panday cheered for debutant Shanaya Kapoor on Instagram. She also shared that she loves the song 'Alvida' from the upcoming film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/aamir-khan-jwala-gutta-vishnu-vishal-10-months-ivf-journey-2752577-2025-07-08",
      "headline": "Aamir Khan hosted Jwala Gutta for 10 months during her IVF journey: Vishnu VishalAamir Khan helped actor Vishnu Vishal and badminton player Jwala Gutta by directing them to a doctor who specialises in IVF. In a recent interview, Vishnu also revealed that Jwala stayed at Aamir's Mumbai house throughout her pregnancy."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/virat-kohli-backs-novak-djokovic-eighth-wimbledon-25th-grand-slam-2752600-2025-07-08",
      "headline": "Virat Kohli makes Wimbledon 2025 prediction: I want Novak Djokovic to winVirat Kohli, speaking from the Center Court at Wimbledon, backed Novak Djokovic to play Carlos Alcaraz in the men's singles final and beat the Spaniard for his 25th Grand Slam title. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bangladesh-vs-pakistan-babar-azam-mohammad-rizwan-shaheen-afridi-dropped-2752572-2025-07-08",
      "headline": "No Babar, Rizwan, Shaheen as Pakistan announce squad for Bangladesh T20I seriesThere was no place for Babar Azam, Mohammad Rizwan and Shaheen Shah Afridi as Pakistan announced the squad for the upcoming T20I series against Bangladesh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/mirra-andreeva-reaction-roger-federer-attends-wimbledon-win-2752553-2025-07-08",
      "headline": "Dream come true! Andreeva starstruck as Roger Federer attends her Wimbledon winWimbledon 2025: Russian tennis star Mirra Andreeva fulfilled a lifelong dream when 20-time Grand Slam champion Roger Federer watched her match from the iconic Royal Box at SW19 on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tim-david-australia-odi-team-return-t20i-world-cup-2752552-2025-07-08",
      "headline": "Why Tim David isn't chasing an ODI return? Australian batter explains decisionTim David is in no rush to return to the ODI setup as Australia enter a period of transition with their 50-over side following the retirements of big names. David said that his current focus is on T20s. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-acknowledges-virat-kohli-gladiator-shoutout-wimbledon-2752524-2025-07-08",
      "headline": "Novak Djokovic acknowledges Virat Kohli's 'gladiator' shoutout: Thank YouFormer World No. 1 Novak Djokovic thanked Virat Kohli for his support during his round-of-16 clash with Alex de Minaur. Kohli, clearly captivated by Djokovic's resilience on Centre Court, hailed the Serb as a \"gladiator.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-shubman-gill-batting-captaincy-don-bradman-ravi-shastri-2752519-2025-07-08",
      "headline": "Shubman Gill batted like Don Bradman in 2nd Test, captaincy 10 out of 10: Ravi ShastriRavi Shastri heaped praise on Shubman Gill for his batting prowess and captaincy skills during India's win in the second Test against England. Gill scored twin centuries as India handed England a big defeat to level the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-third-test-ben-stokes-captaincy-michael-atherton-lords-2752475-2025-07-08",
      "headline": "Lord's Test vs India will be Ben Stokes' toughest challenge as captain: AthertonMichael Atherton believes the Lord's Test will be a stern challenge for Ben Stokes' England captaincy after the heavy Edgbaston defeat. The upcoming match will be a test of Stokes' leadership and resilience, according to Atherton. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-wimbledon-trip-test-retirement-let-him-watch-in-peace-2752438-2025-07-08",
      "headline": "Virat Kohli's Wimbledon trip a problem? Let him watch, without being watchedVirat Kohli watching Wimbledon at the iconic Centre Court on Monday has upset a few. The former India captain was rooting for Novak Djokovic in his fourth-round match. Can't Kohli even watch tennis now?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/serie-a-luka-modric-ac-milan-real-madrid-massimiliano-allegri-2752428-2025-07-08",
      "headline": "Extraordinary Luka Modric is coming to AC Milan: New manager Massimiliano AllegriAC Milan boss Massimiliano Allegri has confirmed that Luka Modric will join the club after the end of the FIFA World Cup this month. Modric is set to leave Real Madrid after a successful 13 years with the club. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-mcc-verdict-akash-deep-wicket-joe-root-2752411-2025-07-08",
      "headline": "Was Akash Deep's delivery to Joe Root a no-ball? MCC settles debateThe Marylebone Cricket Club (MCC), the England-based governing body responsible for cricket laws, has confirmed that Akash Deep's delivery, which dismissed Joe Root in the second Anderson-Tendulkar Trophy Test, was legal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-shubman-gill-batting-captaincy-don-bradman-ravi-shastri-2752519-2025-07-08",
      "headline": "Shubman Gill batted like Don Bradman in 2nd Test, captaincy 10 out of 10: Ravi ShastriRavi Shastri heaped praise on Shubman Gill for his batting prowess and captaincy skills during India's win in the second Test against England. Gill scored twin centuries as India handed England a big defeat to level the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-third-test-ben-stokes-captaincy-michael-atherton-lords-2752475-2025-07-08",
      "headline": "Lord's Test vs India will be Ben Stokes' toughest challenge as captain: AthertonMichael Atherton believes the Lord's Test will be a stern challenge for Ben Stokes' England captaincy after the heavy Edgbaston defeat. The upcoming match will be a test of Stokes' leadership and resilience, according to Atherton. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-wimbledon-trip-test-retirement-let-him-watch-in-peace-2752438-2025-07-08",
      "headline": "Virat Kohli's Wimbledon trip a problem? Let him watch, without being watchedVirat Kohli watching Wimbledon at the iconic Centre Court on Monday has upset a few. The former India captain was rooting for Novak Djokovic in his fourth-round match. Can't Kohli even watch tennis now?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/serie-a-luka-modric-ac-milan-real-madrid-massimiliano-allegri-2752428-2025-07-08",
      "headline": "Extraordinary Luka Modric is coming to AC Milan: New manager Massimiliano AllegriAC Milan boss Massimiliano Allegri has confirmed that Luka Modric will join the club after the end of the FIFA World Cup this month. Modric is set to leave Real Madrid after a successful 13 years with the club. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-mcc-verdict-akash-deep-wicket-joe-root-2752411-2025-07-08",
      "headline": "Was Akash Deep's delivery to Joe Root a no-ball? MCC settles debateThe Marylebone Cricket Club (MCC), the England-based governing body responsible for cricket laws, has confirmed that Akash Deep's delivery, which dismissed Joe Root in the second Anderson-Tendulkar Trophy Test, was legal. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}