{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-why-cas-are-seeking-extension-of-september-15-deadline-2783609-2025-09-08",
      "headline": "ITR filing: Why CAs are seeking extension of September 15 deadlineThe pressure on taxpayers is mounting with the September 15 ITR deadline just days away. Professional groups are demanding an extension, citing delays, technical snags, and even natural disasters that have slowed down the process."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/lg-electronics-ipo-date-time-value-october-debut-stock-market-report-2783566-2025-09-08",
      "headline": "LG Electronics eyes Rs 15,000 crore IPO debut in October: ReportThe consumer electronics major plans to raise around Rs 15,000 crore through the share sale, making it the largest IPO of 2025 so far."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hero-motocorp-names-harshavardhan-chitale-as-new-ceo-2783544-2025-09-08",
      "headline": "Who is Harshavardhan Chitale, Hero MotoCorp's incoming CEOHarshavardhan Chitale, who currently heads the professional business of Dutch lighting major Signify, will take over from acting CEO Vikram Kasbekar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/video/upcoming-10-ipos-this-week-will-dalal-street-deliver-big-returns-bt-show-market-opening-2783537-2025-09-08",
      "headline": "10 IPOs lined up this week: Will Dalal Street deliver big returns?While the IPO market remains attractive, the overall market sentiment is improving slowly, and investors should not rush in with high expectations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-tariff-us-supreme-court-case-india-asia-trade-deals-illegal-exports-business-2783161-2025-09-08",
      "headline": "Explained: What happens if US Supreme Court rules against Trump's trade tariffsThe US Supreme Court is hearing a case that could reshape the way America uses tariffs as a tool in trade. The matter at stake is not whether tariffs are allowed at all but who has the constitutional authority to impose them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-rises-200-points-nifty-above-24800-tata-steel-gains-over-2-2783524-2025-09-08",
      "headline": "Sensex, Nifty gain as steel stocks lead charge on Dalal StreetThe S&P BSE Sensex rose nearly 200 points to around 80,906, while the NSE Nifty50 advanced over 70 points to trade above 24,810."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/urban-company-ipo-bidding-opening-date-price-band-gmp-listing-gains-allotment-listing-2783517-2025-09-08",
      "headline": "Urban Company IPO to open soon: Check price band, GMP, important datesUrban Company is looking to raise a total of Rs 1,900.00 crores through this public offer, which includes both a fresh issue of shares and an offer for sale by existing shareholders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-eu-europe-free-trade-deal-market-access-agricultural-duties-trump-tariff-2783480-2025-09-08",
      "headline": "High-stakes India-EU free trade talks begin this week as US pressure mountsIndia and the European Union are intensifying talks to finalise their free trade agreement by year-end. The negotiations focus on resolving trade barriers while expanding strategic and defence ties amid global uncertainties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/delhi-court-restrains-journalists-publishing-unverified-defamatory-content-adani-enterprise-limited-2783317-2025-09-07",
      "headline": "Court restrains media from publishing defamatory content against Adani EnterpriseAEL alleged that coordinated defamatory publications on paranjoy.in, adaniwatch.org and adanifiles.com.au, along with related videos and posts, were deliberately designed to tarnish its reputation and disrupt its global business operations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/physicswallah-files-for-rs-3820-crore-ipo-amid-edtech-sector-slowdown-alakh-pandey-2783282-2025-09-07",
      "headline": "PhysicsWallah files for Rs 3,820 crore IPO amid edtech sector slowdownEdtech unicorn PhysicsWallah has filed for a ₹38.2 billion ($437M) IPO, aiming to expand physical centers, tech, and acquisitions. The move comes as India's IPO market gains momentum after a slow start."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/terrific-effort-but-still-away-from-being-good-and-simple-tax-ex-cea-on-gst-20-2782748-2025-09-05",
      "headline": "Terrific effort but still away from being Good and Simple Tax: Ex-CEA on GST 2.0Former Chief Economic Advisor Arvind Subramanian analyses the recent GST rationalisation. He states the tax has become \"more good and more simple\" with the removal of the 28% slab, but cautions, \"we're still some ways away from reaching that goal.\" "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-prices-in-delhi-rates-surge-by-rs-900-to-rs-107-lakh-amid-interest-rate-cut-hopes-2782688-2025-09-05",
      "headline": "Gold prices surge by Rs 900 to Rs 1.07 lakh amid interest rate cut hopesGold of 99.5 per cent purity advanced by Rs 900 to Rs 1,06,100 per 10 grams (inclusive of all taxes) on Friday, from the previous close of Rs 1,05,200 per 10 grams."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tiger-shroff-flaunts-abs-throws-t-shirt-to-fans-at-mumbais-gaiety-galaxy-baaghi-4-watch-2783614-2025-09-08",
      "headline": "Tiger Shroff flaunts abs, throws t-shirt to fans at Mumbai's Gaiety Galaxy. WatchTiger Shroff recently visited the iconic Gaiety Galaxy amid 'Baaghi 4' success. The actor surprised fans after he removed his T-shirt and flaunted his abs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-weekend-ka-vaar-highlights-salman-khan-shehbaaz-badesha-shehnaaz-gill-wild-card-no-elimination-2783564-2025-09-08",
      "headline": "Bigg Boss 19 Weekend Ka Vaar: Shehbaaz enters as wild card, no eliminationShehnaaz Gill's brother Shehbaaz Badesha entered 'Bigg Boss 19' on Sunday as the first wild card of the season. The 'Weekend Ka Vaar' episode concluded with Salman Khan announcing no elimination, as Kunickaa Sadanand secured immunity in a task.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/baaghi-4-box-office-collection-day-3-detailed-report-tiger-shroff-film-marks-record-low-for-action-franchise-opening-weekend-2783586-2025-09-08",
      "headline": "Baaghi 4 box office Day 3: Tiger Shroff's film marks record low for action franchiseTiger Shroff's 'Baaghi 4' has wrapped up its opening weekend on a weak note with just Rs 31 crore nett, marking the lowest three-day collection in the popular action franchise. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/white-lotus-star-patrick-schwarzenegger-marries-abby-champion-idaho-wedding-2783579-2025-09-08",
      "headline": "White Lotus star Patrick Schwarzenegger marries Abby Champion in IdahoPatrick Schwarzenegger of 'The White Lotus' fame and his girlfriend, Abby Champion, got married in a lakeside wedding in Idaho, surrounded by family, friends, and Hollywood celebrities.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/demon-slayer-kimetsu-no-yaiba-infinity-castle-review-must-watch-visual-spectacle-2783543-2025-09-08",
      "headline": "Demon Slayer Kimetsu no Yaiba Infinity Castle review: Must-watch visual spectacleRelease Date:Fri Sep 12, 2025'Demon Slayer: Kimetsu no Yaiba Infinity Castle' continues the saga with intense battles and emotional arcs. Releasing on September 12 in India, this film is a must-watch for anime fans despite minor pacing issues. Read our review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/vmas-2025-full-winner-list-lady-gaga-rose-katseye-ariana-grande-win-big-2783521-2025-09-08",
      "headline": "VMAs 2025: Lady Gaga, Rose win top honours, complete list of winners outThe 2024 VMAs celebrated global music talent with Lady Gaga winning artist of the year. Rose made history as the first K-pop artist to win song of the year, signalling growing diversity and innovation in music."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ar-rahman-shares-selfie-with-harry-potter-draco-malfoy-at-gandhi-premiere-2783509-2025-09-08",
      "headline": "AR Rahman shares selfie with Harry Potter's Draco Malfoy at Gandhi premiereHarry Potter star Tom Felton is set to make his Bollywood debut in Hansal Mehta's 'Gandhi' series, which had its premiere at TIFF 2025. Renowned composer AR Rahman shared a joyful selfie with Felton to mark the occasion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/lokah-chapter-1-chandra-superhero-film-unlike-pan-india-films-2782187-2025-09-08",
      "headline": "Why Malayalam superhero film Lokah breaks the pan-Indian blockbuster mouldMalayalam superhero film, 'Lokah: Chapter 1' has done more than deliver a surprise hit - it has redefined the conversation around what a pan-Indian film can be. By blending Kerala's rooted storytelling with the scale of a superhero fantasy, it challenges long-held assumptions that only star-driven, big-budget spectacles can travel across regions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dulquer-salmaan-confirms-mammootty-moothon-role-lokah-birthday-2783496-2025-09-08",
      "headline": "Mammootty is Moothon: Dulquer Salmaan confirms his father's cameo in LokahDulquer Salmaan confirmed Mammootty's cameo in 'Lokah' as 'Moothon' on his birthday, ending fan speculation. 'Lokah Chapter 1: Chandra', produced by Salmaan, is setting the box office on fire."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thalapathy-vijay-wife-sangeetha-son-jason-sanjay-airport-divorce-rumours-2783490-2025-09-08",
      "headline": "Thalapathy Vijay's wife and son Jason Sanjay seen at airport amid divorce rumoursThalapathy Vijay's wife Sangeetha and son Jason were seen at the airport recently. Their appearance came amid their divorce rumours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kamal-haasan-rajinikanth-reunite-new-film-lokesh-kanagaraj-2783484-2025-09-08",
      "headline": "Kamal Haasan on reuniting with Rajinikanth: We were never competitorsKamal Haasan, at the NEXA SIIMA held in Dubai on September 6, confirmed his reunion with Rajinikanth. The two will be joining hands after 46 years. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/demon-slayer-kimetsu-no-yaiba-infinity-castle-advance-booking-india-gets-5-am-shows-first-for-any-japanese-film-2783378-2025-09-07",
      "headline": "Demon Slayer Infinity Castle set for historic 5 am shows in IndiaThe highly-anticipated anime film 'Demon Slayer: Infinity Castle' is set to release globally on September 12, including early morning screenings in Mumbai, marking a first for Japanese cinema in India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/trisha-krishnan-cheers-loudest-for-thalapathy-vijay-wishes-him-well-for-his-next-chapter-siima-2025-2783375-2025-09-07",
      "headline": "Trisha cheers for Thalapathy Vijay, wishes him success in his next chapterAt the 2025 SIIMA awards in Dubai, Trisha Krishnan was honoured for her 25-year journey in South Indian cinema and warmly wished co-star Vijay success in his new ventures. She also praised Ajith Kumar's humility and kindness. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shahid-kapoors-emotional-birthday-note-for-wife-mira-rajput-my-love-you-complete-me-2783338-2025-09-07",
      "headline": "My love, you complete me: Shahid Kapoor's emotional birthday note for wife Mira RajputMira Rajput Kapoor turned 31 on Sunday, September 7. On the occasion, her actor-husband Shahid Kapoor had the sweetest birthday note. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/not-just-acting-aamir-khan-serenades-fans-with-his-singing-skills-2783325-2025-09-07",
      "headline": "Not just acting, Aamir Khan serenades fans with his singing skills. WatchAamir Khan has caught everyone's attention with his singing skills in a viral video, showcasing a new side of the star. A video from a recent event has now gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-salman-khan-in-tears-as-kunickaas-son-ayaan-narrates-her-life-story-2783314-2025-09-07",
      "headline": "Bigg Boss 19: Salman Khan in tears as Kunickaa's son Ayaan narrates her life storyThe latest 'Weekend Ka Vaar' episode of 'Bigg Boss 19' touched hearts as Kunickaa Sadanand's son, Ayaan Lal, stood up for his mother against hurtful remarks, revealing her struggles and resilience. Salman Khan and the audience were visibly moved by this emotional moment. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/siima-2025-awards-winners-amaran-aadujeevitham-prithviraj-sukumaran-sai-pallavi-2783288-2025-09-07",
      "headline": "SIIMA 2025 Tamil, Malayalam: Prithviraj Sukumaran, Sai Pallavi win top honoursSIIMA 2025 honours Tamil and Malayalam cinema: Sivakarthikeyan's 'Amaran' and Prithviraj Sukumaran's 'The Goat Life' take top honours. Sai Pallavi won Best Actor (Female) and Sukumaran bagged Best Actor. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/anuparna-roy-makes-history-wins-best-director-at-82nd-venice-film-festival-2783284-2025-09-07",
      "headline": "India's Anuparna Roy makes history, wins Best Director at 82nd Venice Film FestivalThe 82nd Venice Film Festival concluded with Indian filmmaker Anuparna Roy making history, winning Best Director for her debut 'Songs of Forgotten Trees', while American indie 'Father Mother Sister Brother' took home the Golden Lion for Best Film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-leads-beach-clean-up-drive-in-mumbai-amruta-fadnavis-champions-public-responsibility-2783265-2025-09-07",
      "headline": "Akshay Kumar leads beach clean-up drive in Mumbai, champions public responsibilityAkshay Kumar actively participated in a beach clean-up drive at Mumbai's Juhu Beach, joining hands with Amruta Fadnavis and BMC officials to promote environmental responsibility. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bihar-voter-list-revision-vote-chori-electoral-roll-political-rhetoric-free-and-fair-election-india-today-south-conclave-2783603-2025-09-08",
      "headline": "By and large, free and fair: Former poll officers reject 'vote chori rhetoric'Three former Election Commissioners said at the India Today South Conclave that elections in India are largely free and fair, and claims of 'vote chori' are routine political rhetoric. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/zelenskyy-backs-us-tariffs-on-india-trump-right-idea-russian-oil-ukraine-war-sanctions-2783608-2025-09-08",
      "headline": "Right idea to tariff those who...: Zelenskyy amid Trump's India offensiveRight idea to put tariffs on countries still making deals with Russia: Ukraine's Zelenskyy on Trump's sanction"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/exclusive-amid-bihar-sir-row-ex-poll-officers-back-idea-but-question-timing-india-today-south-conclave-2025-2783626-2025-09-08",
      "headline": "Exclusive: Amid Bihar SIR row, ex-poll officers back idea but question 'timing'Three former Chief Election Commissioners -- SY Quraishi, OP Rawat, and Ashok Lavasa -- have backed the concept of a Systematic Investigation of Rolls (SIR) but questioned its timing in Bihar, where floods and upcoming elections make the move contentious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mehul-choksi-extradition-case-hearing-india-assures-belgium-on-prison-conditions-says-no-overcrowding-barrack-number-12-2783573-2025-09-08",
      "headline": "No solitary confinement for Mehul Choksi, India assures Belgium for extraditionIndia has assured Belgium that fugitive businessman Mehul Choksi, wanted in the PNB fraud case, will not be kept in solitary confinement if extradited. He will be lodged in Barrack No. 12, which is not overcrowded, and his cell will be monitored round-the-clock."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/gurugram-gurgaon-urban-floods-waterlogging-sahibi-river-lost-aravalli-hills-delhi-haryana-hydrology-natural-drainage-2781896-2025-09-08",
      "headline": "There was once a river in GurgaonBefore Gurgaon became Gurugram, a city of glass facades and corporate towers, it was shaped by the flow of the Sahibi River. Once a lifeline for farms, wetlands, and wildlife, that river now survives only as the foul-smelling Najafgarh drain that drains into the Yamuna in northern Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/dr-bhupen-hazarika-birth-centenary-narendra-modi-tribute-2783274-2025-09-08",
      "headline": "A tribute to Bhupen DaMarking Bhupen Hazarika's birth centenary, India remembers his voice that transcends borders, carries themes of justice, unity, and compassion, and makes him an enduring symbol of cultural identity."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/elon-musk-backs-x-fact-check-after-trump-aide-peter-navarros-anti-india-rant-says-people-decide-narrative-on-platform-2783499-2025-09-08",
      "headline": "You hear all sides: Elon Musk after X fact-checks Trump aide's anti-India rantWithout naming Peter Navarro, Elon Musk underscored that Community Notes \"corrects everyone without exception\" and ensures that \"people decide the narrative\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/comeback-kid-congress-will-bihar-walk-rahul-gandhis-voter-adhikar-talk-2783078-2025-09-06",
      "headline": "Comeback kid Congress? Will Bihar walk Rahul Gandhi's Voter Adhikar talk?The Voter Adhikar Yatra, with Tejashwi Yadav and other INDIA leaders, may have just given the Congress what it lacked in the Bihar poll theatre: visibility and legitimacy\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/hockey-asia-cup-2025-reporters-diary-rajgir-india-win-2783462-2025-09-08",
      "headline": "Discovering Rajgir through hockey: A reporter's diary of Asia Cup 2025From sweltering heat to electrifying hockey fever, Rajgir offered unforgettable moments during the Hockey Asia Cup 2025. While India lifted the title, it was the city's passionate fans who stole the show, proving that this ancient cultural hub in Bihar could become a rising center for sports in the country. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/yogi-adityanath-orders-probe-uttar-pradesh-college-universities-accreditation-admissions-fake-course-affidavit-report-2783590-2025-09-08",
      "headline": "Yogi Adityanath orders UP college probe; admissions, courses under scrutinyUttar Pradesh Chief Minister Yogi Adityanath has ordered an intensive inspection of all universities and colleges in the state. The exercise will verify recognition, admissions, and courses, with strict action against institutions running unapproved programmes. Officials said reports must be submitted to the government within 15 days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-signals-tougher-russia-sanctions-india-oil-trade-may-face-heat-glbs-2783456-2025-09-08",
      "headline": "Trump says ready for 'second phase' of sanctions on countries buying Russian oilAfter Moscow launched its largest aerial assault on Ukraine, US President Donald Trump said he is ready to move to a \"second phase\" of sanctions against Russia. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/video-congress-mp-piggybacks-on-villager-during-bihar-flood-survey-sparks-row-2783536-2025-09-08",
      "headline": "Video: Congress MP piggybacks on villager during Bihar flood survey, sparks rowA viral video, recorded during his visit to flood-affected areas, shows the 74-year-old Congress MP being carried by one of the locals on his back while wading through water."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/not-just-her-job-why-mens-nutrition-matters-equally-for-fertility-2782969-2025-09-08",
      "headline": "Not just her job: Why men's nutrition matters equally for fertilityThe nutritionist explains how omega-3 fatty acids, antioxidants, CoQ10 and balanced nutrition can improve sperm quality, energy, and male fertility and why it is equally important if not more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/delhi/story/phulera-panchayat-aap-attacks-delhi-chief-minister-rekha-gupta-over-husband-manish-gupta-presence-in-government-meetings-2783514-2025-09-08",
      "headline": "AAP's 'Phulera panchayat' swipe after Rekha Gupta's husband joins meetingThe Aam Aadmi Party (AAP) on Sunday targeted Delhi Chief Minister Rekha Gupta after a photo surfaced of her husband, Manish Gupta, seated beside her during an official meeting. Comparing it with the popular web series, AAP said the capital was being run like a \"Phulera Panchayat\" where non-elected family members hold sway."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/rajballabh-yadav-controversial-remarks-tejashwi-yadav-wife-protests-nawada-2783448-2025-09-08",
      "headline": "Ex-RJD leader likens Tejashwi Yadav's wife to jersey cow, sparks rowFollowing Rajballabh Yadav's remarks, the RJD Women's Wing in Nawada organised protests, expressing their disapproval. At Sadbhavna Chowk, they burned an effigy of Yadav and raised slogans against him, illustrating the depth of their anger and disappointment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-may-refund-half-of-tariffs-imposed-by-donald-trump-what-treasury-chief-said-2783481-2025-09-08",
      "headline": "US may refund half of tariffs imposed by Trump? What treasury chief saidScott Bessent's remarks come after two federal courts ruled that Trump lacked the power to levy tariffs on nearly every country under the International Emergency Economic Powers Act, a 1977 law designed for national security crises."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/demon-slayer-kimetsu-no-yaiba-infinity-castle-review-must-watch-visual-spectacle-2783543-2025-09-08",
      "headline": "Demon Slayer Kimetsu no Yaiba Infinity Castle review: Must-watch visual spectacleRelease Date:Fri Sep 12, 2025'Demon Slayer: Kimetsu no Yaiba Infinity Castle' continues the saga with intense battles and emotional arcs. Releasing on September 12 in India, this film is a must-watch for anime fans despite minor pacing issues. Read our review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/us-man-want-kids-to-grow-up-in-america-not-india-post-h1b-visa-debate-street-celebration-dhol-video-2783610-2025-09-08",
      "headline": "US man's 'want kids to grow up in America, not India' post sparks H-1B visa debateDaniel Keene, who lives near Dallas, posted a video shot from a car showing a group of people playing dhol and dancing on the street."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/three-soldiers-injured-one-critical-during-encounter-with-terrorists-in-jks-kulgam-gunbattle-on-2783528-2025-09-08",
      "headline": "Terrorist killed, three soldiers injured during encounter in J&K's KulgamOne terrorist was killed, and three Army personnel were injured in an encounter in Guddar area of Kulgam district, Jammu and Kashmir, on Monday. Security officials said two to three terrorists may still be trapped, and the operation is ongoing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/how-are-exam-stress-and-late-nights-shaping-students-snack-choices-2783331-2025-09-08",
      "headline": "How are exam stress and late nights shaping students' snack choices?College canteens and vending machines are no longer just about chips and colas. A wave of mindful eating is reshaping how students fuel their study sessions and snack breaks.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/in-pictures-breathtaking-views-of-the-blood-moon-from-around-the-world-glbs-2783477-2025-09-08",
      "headline": "In pictures: Breathtaking views of the Blood Moon from around the worldMillions of people in Asia and Europe enjoyed the second total lunar eclipse of the year, watching the Moon turn red. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/us-tariffs-congress-mp-shashi-tharoor-hits-back-after-donald-trump-aide-howard-lutnick-says-india-will-apologise-2783508-2025-09-08",
      "headline": "Nothing to say sorry for: Shashi Tharoor hits back after Trump aide's tariff jabThe Congress MP said India's conduct had been marked by maturity and fairness, insisting that the country has nothing to apologise for, while questioning why New Delhi was being singled out when other nations were engaging in far larger transactions with Moscow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/four-humans-to-begin-living-on-artificial-mars-year-long-mission-to-simulate-life-on-red-planet-2783563-2025-09-08",
      "headline": "Four astronauts to begin year-long mission on artificial MarsThe simulation is part of Nasa's Crew Health and Performance Exploration Analog (CHAPEA), a series of Earth-based experiments to evaluate how humans cope with the physical and psychological demands of deep-space travel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/popcorn-vs-chips-which-is-healthy-snack-weight-loss-2782674-2025-09-08",
      "headline": "Is popcorn the guilt-free snack you have been looking for?Popcorn is emerging as the healthier snacking choice - but is it really better than chips? The answer isn't as black and white as it seems."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/afghanistan-asia-cup-team-preview-rashid-khan-spin-bowling-2783606-2025-09-08",
      "headline": "Spin-powered Afghanistan are no longer just challengers, but contendersAsia Cup 2025: After their success in the 2024 T20 World Cup, Afghanistan have evolved from being mere challengers to genuine contenders for the ACC Asia Men's T20 Cup, which begins on September 9."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-opener-india-asia-cup-t20-ravi-shastri-shubman-gill-2783584-2025-09-08",
      "headline": "Even Shubman will find it tough to displace Samson as opener: Ravi ShastriFormer India coach Ravi Shastri thinks wicketkeeper Sanju Samson's success as a T20I opener might push the new vice-captain, Shubman Gill, to bat lower in the Asia Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-afghanistan-hong-kong-oman-uae-previews-2783374-2025-09-08",
      "headline": "Asia Cup 2025: What to expect from Oman, UAE and Hong Kong?Asia Cup 2025 begins with Afghanistan and Hong Kong opening the tournament in Abu Dhabi. The event features debutants Oman and returning UAE, creating fresh competition dynamics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/aj-lee-wwe-comeback-chicago-fan-excitement-2783164-2025-09-08",
      "headline": "AJ Lee make WWE return after a decade, joins Punk vs Seth and Becky feudAJ Lee makes her WWE return after a decade, thrilling fans in Chicago. Her comeback adds new intensity to the Punk, Seth and Becky storyline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/india-win-asia-cup-2025-world-cup-qualification-2783473-2025-09-08",
      "headline": "Asia Cup conquered: India's transitioning side ready to chase World Cup gloryIndia have finally slayed the dragon and secured their first Asia Cup title in 8 years with a thumping win in Rajgir. Now with continental success and momentum, the young and transitioning Indian team get ready for the big mission in 2026, the World Cup. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harbhajan-singh-punjab-flood-relief-boats-ambulances-funds-2783464-2025-09-08",
      "headline": "Harbhajan Singh aids Punjab flood relief with boats and fundsFormer India spinner Harbhajan Singh steps up flood relief efforts in Punjab by providing boats and ambulances. His mobilisation of funds and resources highlights urgent community support amid ongoing monsoon challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/e-sports/story/battlegrounds-masters-series-season-4-top-teams-qualify-grand-finals-2783483-2025-09-08",
      "headline": "Revenant XSpark tops BGMS Season 4 points table after 84 matchesThe league stage of Battlegrounds Masters Series Season 4 has concluded, with the top four teams securing direct spots in the grand finals. The remaining teams will now battle it out in the semi-finals and playoffs, raising the stakes and intensifying the competition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-final-carlos-alcaraz-plan-against-jannik-sinner-2783529-2025-09-08",
      "headline": "How Alcaraz devised masterplan to dethrone Sinner after Wimbledon heartbreakCarlos Alcaraz defeated Jannik Sinner to reclaim the title of World No.1 at the US Open 2025. After the match, Alcaraz explained how he devised a masterplan to defeat Sinner after his Wimbledon heartbreak."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/aj-lee-wwe-next-appearance-2783478-2025-09-08",
      "headline": "AJ Lee to return to WWE in Monday Night Raw match against Becky LynchWWE star AJ Lee returned after a decade to support her husband, CM Punk. Her in-ring comeback on Monday Night Raw ushers in an exciting new chapter for WWE's women's division."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/kings-india-beat-korea-4-1-asia-cup-title-hockey-world-cup-special-2783518-2025-09-08",
      "headline": "Kings of Asia: India's dominant Asia Cup victoryIndia's dominant 4-1 victory over South Korea not only secured their fourth Asia Cup crown but also booked a direct berth at the 2026 Hockey World Cup. With four trophies, India are now the second-most successful team in the tournament, behind five-time champions Korea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sufyan-mehmood-jatinder-singh-oman-upset-asia-cup-debut-india-pakistan-2783479-2025-09-08",
      "headline": "Oman confident of causing upsets: Sufyan Mehmood's bold statementAsia Cup 2025: All-rounder Sufyan Mehmood said that Oman are confident of causing upsets in the upcoming tournaments. Making their debut in the competition, Oman will start their campaign on September 12 against Pakistan in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/e-sports/story/battlegrounds-masters-series-season-4-top-teams-qualify-grand-finals-2783483-2025-09-08",
      "headline": "Revenant XSpark tops BGMS Season 4 points table after 84 matchesThe league stage of Battlegrounds Masters Series Season 4 has concluded, with the top four teams securing direct spots in the grand finals. The remaining teams will now battle it out in the semi-finals and playoffs, raising the stakes and intensifying the competition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-final-carlos-alcaraz-plan-against-jannik-sinner-2783529-2025-09-08",
      "headline": "How Alcaraz devised masterplan to dethrone Sinner after Wimbledon heartbreakCarlos Alcaraz defeated Jannik Sinner to reclaim the title of World No.1 at the US Open 2025. After the match, Alcaraz explained how he devised a masterplan to defeat Sinner after his Wimbledon heartbreak."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/aj-lee-wwe-next-appearance-2783478-2025-09-08",
      "headline": "AJ Lee to return to WWE in Monday Night Raw match against Becky LynchWWE star AJ Lee returned after a decade to support her husband, CM Punk. Her in-ring comeback on Monday Night Raw ushers in an exciting new chapter for WWE's women's division."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/kings-india-beat-korea-4-1-asia-cup-title-hockey-world-cup-special-2783518-2025-09-08",
      "headline": "Kings of Asia: India's dominant Asia Cup victoryIndia's dominant 4-1 victory over South Korea not only secured their fourth Asia Cup crown but also booked a direct berth at the 2026 Hockey World Cup. With four trophies, India are now the second-most successful team in the tournament, behind five-time champions Korea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sufyan-mehmood-jatinder-singh-oman-upset-asia-cup-debut-india-pakistan-2783479-2025-09-08",
      "headline": "Oman confident of causing upsets: Sufyan Mehmood's bold statementAsia Cup 2025: All-rounder Sufyan Mehmood said that Oman are confident of causing upsets in the upcoming tournaments. Making their debut in the competition, Oman will start their campaign on September 12 against Pakistan in Dubai. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}