{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/coca-cola-record-servings-maha-kumbh-180-million-q1-fy25-results-prayagraj-atlanta-2717829-2025-05-01",
      "headline": "Coca-Cola sells record servings at Maha Kumbh. The final number may shock youWhile saints and seekers looked for divine blessings, the world's biggest beverage giant looked across the Ganga's banks and found its biggest crowd."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-holiday-today-maharashtra-day-sensex-nifty-trading-open-close-may-1-2717776-2025-05-01",
      "headline": "Sensex, Nifty holiday: Are stock markets open for trading today?There are also no market holidays in the months of June and July 2025, so investors can expect uninterrupted trading during this period."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/amul-milk-price-hike-mother-dairy-two-rupees-per-litre-2717659-2025-04-30",
      "headline": "After Mother Dairy, Amul hikes milk prices by Rs 2 per litreAfter Mother Dairy, Amul has also hiked the prices of its milk up to 2rs per litre. The new prices will come into effect from tomorrow, i.e., May 1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/cash-is-king-says-mark-mobius-amid-trade-war-fears-backs-india-over-china-2717526-2025-04-30",
      "headline": "'Cash is king,' says Mark Mobius amid trade war fears, backs India over ChinaVeteran investor Mark Mobius believes that the uncertainty around the trade wars makes it risky to invest right now. However, he does see hope in countries like India, which he says could benefit as global supply chains shift away from China."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-closes-46-points-lower-nifty-below-24400-bajaj-twins-fall-5-percent-2717501-2025-04-30",
      "headline": "Sensex closes 46 points lower, Nifty below 24,400; Bajaj twins fall 5%The S&P BSE Sensex was down by 46.14 points to end at 80,242.24, while the NSE Nifty50 lost 1.75 points to close at 24,334.20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/gold-prices-today-fall-stock-market-investment-akshaya-tritiya-safe-haven-2717498-2025-04-30",
      "headline": "Can gold retain its glitter as Dalal Street gets back its glow?Just a week ago, gold was trading at record levels due to global uncertainty. Concerns over trade tensions, US tariffs, and geopolitical issues had pushed investors towards gold, a common choice during uncertain times. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/upcoming-ipos-public-listing-market-buzz-dalal-street-trading-lg-tata-zepto-reliance-hdfc-2717462-2025-04-30",
      "headline": "New wave of IPOs is coming. Is Dalal Street ready?Tata Capital, PhonePe, and Zepto are also said to be in the pipeline. Financial firms like HDB Financial Services and Hero FinCorp are planning to raise Rs 12,500 crore and Rs 3,668 crore, respectively. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/rakuten-to-invest-over-100-million-dollars-in-india-plans-to-boost-hiring-by-8-percent-2717447-2025-04-30",
      "headline": "Rakuten to invest over $100 million in India, plans to boost hiring by 8%Rakuten currently employs 4,000 people in India, 90% of whom are tech staff, and plans to recruit people who it considers \"power users\" of AI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rbi-raises-atm-charges-rs-23-from-may-1-know-the-details-here-2717434-2025-04-30",
      "headline": "RBI's raises ATM charges to Rs 23 from May 1: Know the details herePeople living in metro cities would get three free transactions per month, while those living in non-metro areas would get five free transactions per month. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indian-rupee-rallies-strongest-2025-level-foreign-inflows-dollar-sales-2717421-2025-04-30",
      "headline": "Rupee jumps to highest level in 2025. Check factors behind strong rallyThe Indian rupee reached its highest level of 2025, driven by foreign inflows and exporter dollar sales. Optimism over US-India trade talks and a weakening US dollar further supported the currency's rally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/if-we-look-closely-zoho-founder-and-ceo-sridhar-vembu-on-finding-rural-talent-2717362-2025-04-30",
      "headline": "'If we look closely...': Zoho's Sridhar Vembu on finding rural talentZoho's CEO, Sridhar Vembu, believes that India's path to development must include creating jobs and opportunities in smaller towns and villages."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/adani-group-stocks-trading-price-target-q4-results-brokerage-reports-2717352-2025-04-30",
      "headline": "5 Adani stocks get new targets after Q4 results: What should investors do?With Gautam Adani-led Adani Enterprises Ltd set to announce its earnings report soon, stock brokerages have already reviewed the performance of five listed companies from the group and shared fresh price targets and advice for investors."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/raid-2-movie-review-ajay-devgn-film-crumbles-under-weight-of-his-stardom-2717810-2025-05-01",
      "headline": "Raid 2 movie review: Ajay Devgn's film crumbles under weight of his stardomReleased-Thu May 01, 2025In 'Raid 2', you never get to meet Amay Patnaik, the honest income tax officer, because Ajay Devgn never gives in to the character. He appears like both Singham and Vijay Salgaonkar in parts, and drives a half-baked story. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-53-birthday-wife-shalini-race-themed-birthday-party-viral-pics-2717797-2025-05-01",
      "headline": "Ajith Kumar turns 54, wife Shalini shares old pics from race-themed birthday bashAjith Kumar is celebrating his 54th birthday on May 1. His wife, Shalini, shared throwback photos from the race-themed birthday bash she hosted in 2024."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-accidental-actor-birthday-took-up-job-to-pay-my-debts-2717774-2025-05-01",
      "headline": "Ajith shares story of becoming 'accidental actor': Took up job to pay my debtsAjith Kumar, one of the celebrated superstars of Tamil cinema, called himself an 'accidental actor' in an exclusive conversation with India Today. He explained the story of how he took up acting to pay his debts from a failed business."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/waves-summit-2025-mumbai-pm-modi-inaugurate-shah-rukh-khan-deepika-padukone-karan-johar-rajinikanth-2717665-2025-05-01",
      "headline": "WAVES 2025 to kick off today in Mumbai, PM Modi to inaugurateWAVES 2025 will commence on May 1 in Mumbai. Set to be inaugurated by PM Modi, the four-day event will witness a plethora of keynote speakers from various walks of life.   "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/pope-franciss-final-interview-to-feature-in-scorseses-film-aldeas-a-new-story-glbs-2717762-2025-05-01",
      "headline": "Pope Francis's final interview to feature in Scorsese's film 'Aldeas — A New Story'Martin Scorsese is producing Aldeas — A New Story, a documentary focused on Pope Francis's Aldeas initiative, featuring youth films promoting cultural dialogue, as well as the Pope's final interview before his death.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/who-is-david-corenswet-meet-the-actor-playing-the-new-superman-glbs-2717757-2025-05-01",
      "headline": "Who is David Corenswet? Meet the actor playing the new SupermanDavid Corenswet, once a rising Netflix star, is now cast as James Gunn's new Superman. From humble beginnings to donning the cape, his journey marks a fresh era for DC films.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hania-aamir-mahira-khan-pak-actors-instagram-disabled-in-india-2717680-2025-04-30",
      "headline": "Instagram accounts of several Pak actors including Hania Aamir's blocked in IndiaOther Pakistani celebrities whose Instagram accounts have been disabled in India are Ali Zafar, Sanam Saeed, Bilal Abbas, Iqra Aziz, Imran Abbas and Sajal Aly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-opens-up-about-his-passion-for-acting-i-have-very-strong-work-ethics-2717592-2025-04-30",
      "headline": "Ajith opens up about his passion for acting: I have very strong work ethicsAjith Kumar, celebrated actor and racer, shared insights on his dual passions - acting and racing - in an exclusive interview. Recently awarded the Padma Bhushan, he reflected on his journey and future racing plans."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/janhvi-kapoor-criticises-jaipur-drunk-driving-accident-that-killed-teen-girl-2717658-2025-04-30",
      "headline": "Janhvi Kapoor fumes over Jaipur drunk-driving accident that killed 14-year-oldA tragic incident in Jaipur unfolded as a 14-year-old girl lost her life due to a drunk-driving accident, prompting actor Janhvi Kapoor to express her outrage on social media. The accident involved a car allegedly driven by an intoxicated woman."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/countdown-jensen-ackles-show-to-premiere-prime-video-on-june-25-2717642-2025-04-30",
      "headline": "Countdown: Jensen Ackles-led show to premiere on June 25Prime Video announces the premiere date for its new action series 'Countdown', created by Derek Haas. The show features a stellar cast including Jensen Ackles and Eric Dane, with a premiere set for June 25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/gram-chikitsalay-trailer-amol-parashar-vinay-pathak-tvf-panchayat-like-heartfelt-show-2717619-2025-04-30",
      "headline": "Gram Chikitsalay trailer: Amol Parashar is on lookout for patients in rural taleThe trailer of 'Gram Chikitsalay' introduces viewers to the challenges faced by Dr Prabhat, a city doctor, as he attempts to rejuvenate a neglected health centre in the village of Bhathkandi. With a talented cast, the series is set to premiere on Prime Video on May 9."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/who-was-costao-fernandes-nawazuddin-siddiqui-costao-brings-heroic-life-customs-officer-2717593-2025-04-30",
      "headline": "Who's Costao Fernandes? Nawazuddin brings heroic life of customs officer to screen'Costao' tells the true story of Tony da Costa Fernandes, a brave officer who took down smugglers and paid a heavy price for justice. Featuring Nawazuddin Siddiqui, the film covers the themes of courage, corruption, and honour. Here's all you need to know about the gutsy customs officer.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/influencer-ishita-mangal-slams-ranveer-singh-nitanshi-goel-sidharth-malhotra-celebs-for-disrespecting-designers-2717492-2025-04-30",
      "headline": "Influencer slams Ranveer Singh, Nitanshi Goel, and celebs for disrespecting designersInfluencer Ishita Mangal recently called out Bollywood actors for showing disrespect towards designers during fashion shows. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ground-zero-actor-emraan-hashmi-attack-on-ghazi-baba-most-crucial-counter-terror-attack-india-2717568-2025-04-30",
      "headline": "Exclusive: Emraan Hashmi revisits India's most crucial counter-terror attackActor Emraan Hashmi discusses his role in 'Ground Zero', highlighting its focus on one of the most crucial anti-terror operation in early 2000s Kashmir, a volatile period marked by significant terrorist activities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/met-gala-2025-shah-rukh-khan-kiara-advani-diljit-dosanjh-indian-fans-expect-this-year-isha-ambani-2717551-2025-04-30",
      "headline": "Met Gala 2025: What can Indian fans expect this yearMet Gala 2025 is just around the corner, and fans are quite excited about the same. With several prominent names from the Indian circuit, including Shah Rukh Khan, Kiara Advani, and more on the list, this year's fashionable event is shaping up to be a glamorous global affair.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/sheena-bajaj-expecting-first-child-with-husband-rohit-purohit-2717500-2025-04-30",
      "headline": "Best of Luck Nikki's Sheena Bajaj expecting first child with husband Rohit PurohitActor Sheena Bajaj is pregnant with her first child. The actor shared the news with her fans on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nani-telegana-representation-in-films-paradise-dasara-2717511-2025-04-30",
      "headline": "Actor Nani defends portrayal of Telangana people in Dasara | ExclusiveTelugu actor Nani addresses the portrayal of Telangana in films, promising a fresh perspective in his upcoming movie 'The Paradise'. In an interview, he defends his previous work while assuring a new narrative in his latest project."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vvan-force-of-the-forest-tamannaah-bhatia-joins-sidharth-malhotras-upcoming-folk-thriller-2717473-2025-04-30",
      "headline": "Vvan: Tamannaah Bhatia joins Sidharth Malhotra's upcoming folk thrillerTamannaah Bhatia is set to star alongside Sidharth Malhotra in the folk thriller 'Vvan-Force of the Forest.' A teaser showcasing her mysterious new avatar was released, coinciding with Chhath 2024 festivities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-hospitalised-minor-leg-injury-chennai-airport-after-padma-bhushan-2717445-2025-04-30",
      "headline": "Ajith Kumar hospitalised after minor leg injury in ChennaiActor Ajith Kumar has been hospitalised in Chennai after his return from New Delhi. The actor suffered a minor injury at the Chennai airport on Tuesday night."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/work-with-pak-to-de-escalate-tensions-marco-rubio-to-jaishankar-after-pahalgam-terror-attack-glbs-2717753-2025-05-01",
      "headline": "Rubio dials S Jaishankar, Shehbaz Sharif: India, Pak should de-escalate tensionsUS Secretary of State Marco Rubio spoke with Indian External Affairs Minister Dr S Jaishankar and Pakistan Prime Minister Shehbaz Sharif amid rising tensions following the Pahalgam terror attack that killed 26 people."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/how-india-shutting-airspace-will-impact-pakistan-flying-hours-operation-costs-2717801-2025-05-01",
      "headline": "Flying hours, operation costs: How India shutting airspace will impact PakistanIndia closed its airspace to all aircraft registered, operated, or leased by Pakistan-including commercial airlines and military flights - from April 30 to May 23, 2025. The airspace ban is seen as a tit-for-tat response amid rising tensions following the deadly Pahalgam terror attack that left 26 people dead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-using-jammers-to-block-pakistan-aircraft-navigation-systems-sources-2717791-2025-05-01",
      "headline": "India deploys jammers to block Pakistan aircraft navigation systems: SourcesThe Indian jamming systems are capable of interfering with multiple satellite-based navigation platforms, including GPS (US), GLONASS (Russia), and Beidou (China)-all of which are used by Pakistani military craft, sources said. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/caste-survey-central-government-rahul-gandhi-obc-political-agenda-congress-2717769-2025-05-01",
      "headline": "With Centre's caste survey nod, BJP tries to disarm Rahul Gandhi's OBC agendaThe nationwide caste survey has been Congress MP Rahul Gandhi's biggest and most potent weapon before the government approved the proposed exercise to be included in the upcoming census."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/immersive/history-of-terrorism-in-kashmir-part-4/",
      "headline": "The 1989 un-Islamic kidnapping and chaos in the valleyIn part 4 of our series on the history of terrorism in Kashmir, we revisit the December 1989 kidnapping of Rubaiya Sayeed that encouraged thousands to hit the streets and bring the Indian government to its knees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pak-army-continues-ceasefire-violation-along-loc-jammu-kashmir-kupwara-deadly-pahalgam-terror-attack-2717770-2025-05-01",
      "headline": "Pak continues unprovoked firing along LoC despite India's warning, Army respondsPakistan violated the ceasefire for the seventh night in a row, on Wednesday by launching unprovoked firing across the Line of Control (LoC) near Kupwara, Uri, and Akhnoor in Jammu and Kashmir. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/israel-faces-national-danger-amid-raging-wildfire-people-abandon-vehicles-flee-2717815-2025-05-01",
      "headline": "Israel faces national danger amid raging wildfire, people abandon vehicles, fleeIsraeli Prime Minister Benjamin Netanyahu warned that the rapidly advancing flames could reach Jerusalem itself, calling it \"a national emergency, not just a local one\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/isi-chief-lt-gen-asim-malik-appointed-national-security-advisor-india-pak-tensions-pahalgam-attack-2717754-2025-05-01",
      "headline": "Pak's ISI chief gets key role amid tensions with India over Pahalgam attackAmid escalating tensions between India and Pakistan over the Pahalgam terror attack, ISI chief Lt Gen Mohammad Asim Malik was appointed Pakistan's National Security Advisor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/raid-2-movie-review-ajay-devgn-film-crumbles-under-weight-of-his-stardom-2717810-2025-05-01",
      "headline": "Raid 2 movie review: Ajay Devgn's film crumbles under weight of his stardomReleased-Thu May 01, 2025In 'Raid 2', you never get to meet Amay Patnaik, the honest income tax officer, because Ajay Devgn never gives in to the character. He appears like both Singham and Vijay Salgaonkar in parts, and drives a half-baked story. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-victim-shubham-dwivedi-wife-he-would-have-said-i-love-you-2717650-2025-04-30",
      "headline": "Everything ended in a second: Pahalgam attack victim's wife recounts horrorAishanya, wife of Kanpur resident Shubham Dwivedi who was killed in the Pahalgam terror attack, shared what really happened in the Baisaran meadow on April 22."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hania-aamir-mahira-khan-pak-actors-instagram-disabled-in-india-2717680-2025-04-30",
      "headline": "Instagram accounts of several Pak actors including Hania Aamir's blocked in IndiaOther Pakistani celebrities whose Instagram accounts have been disabled in India are Ali Zafar, Sanam Saeed, Bilal Abbas, Iqra Aziz, Imran Abbas and Sajal Aly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/ukraine-inches-closer-to-signing-us-minerals-deal-in-bid-to-secure-continued-military-aid-glbs-2717748-2025-05-01",
      "headline": "US, Ukraine ink minerals deal months after Trump-Zelenskyy Oval Office showdownUS President Donald Trump earlier said that access to Ukraine's rare earth materials should be part of any continued US assistance, framing it as reimbursement for billions already spent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyer-ipl-2025-csk-vs-pbks-fine-chennai-offence-2717825-2025-05-01",
      "headline": "Shreyas Iyer penalised for slow over rate against Chennai Super KingsIPL 2025, CSK vs PBKS: Punjab Kings' skipper Shreyas Iyer was fined Rs 12 lakh of his match fees after the four-wicket win over the Chennai Super Kings on Wednesday at the Chepauk."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pahalgam-terror-attack-live-updates-pakistan-army-youtube-channel-ispr-blocked-india-pm-modi-rahul-gandhi-ceasefire-2717792-2025-05-01",
      "headline": "Pakistan Army's YouTube channel blocked in India after Pahalgam attackPahalgam attack live updates: Today marks the 9th day since the deadly Pahalgam terror attack that killed 26 people, mostly tourists. India is weighing options for retaliation beyond the sweeping diplomatic and strategic countermeasures already taken against Pakistan. These measures include the effective downgrading of diplomatic ties, closure of key border routes, suspension of the Indus Waters Treaty, and expulsion of Pakistani military attaches from its High Commission in New Delhi. On Wednesday, Prime Minister Modi held a series of back-to-back key cabinet meetings. On Tuesday, he granted the Indian Armed Forces \"complete operational freedom\" to respond to the Pahalgam terror attack. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pak-pm-seeks-us-help-urging-india-dial-down-pahalgam-attack-rhetoric-2717733-2025-04-30",
      "headline": "Pak PM seeks US's help in urging India to 'dial down Pahalgam attack rhetoric'Pakistan Prime Minister Shehbaz Sharif accused India of engaging in \"escalatory and provocative behaviour\" during a phone call with US Secretary of State Marco Rubio amid tensions with India over the Pahalgam terror attack."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-haveri-ksrtc-bus-driver-under-probe-after-stopping-bus-midway-for-namaz-2717675-2025-04-30",
      "headline": "Karnataka bus driver under probe after viral video shows him stopping for namazA KSRTC driver-cum-conductor in Karnataka's Haveri district is under investigation after a viral video showed him stopping a government bus mid-route to offer namaz, delaying passengers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/why-did-hitler-kill-himself-fear-suicide-and-a-bunker-bound-love-story-2717712-2025-04-30",
      "headline": "Hitler's last days: How the world's most feared man went from power to paranoiaAdolf Hitler, the Nazi Führer once feared across Europe, ended his life in a Berlin bunker with his mistress-turned-wife Eva Braun on April 30, 1945. How did the dictator fall from absolute power to a paranoid spiral, and what was behind the twisted loyalty that ended in the joint suicide with Eva Braun just hours after marriage?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/waves-summit-2025-mumbai-pm-modi-inaugurate-shah-rukh-khan-deepika-padukone-karan-johar-rajinikanth-2717665-2025-05-01",
      "headline": "WAVES 2025 to kick off today in Mumbai, PM Modi to inaugurateWAVES 2025 will commence on May 1 in Mumbai. Set to be inaugurated by PM Modi, the four-day event will witness a plethora of keynote speakers from various walks of life.   "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/inside-story-congress-gayab-debacle-how-tweet-sparked-row-in-party-2717673-2025-05-01",
      "headline": "Inside story of Congress's 'Gayab' debacle: How a tweet sparked row in partyAccording to sources, the Congress's social media head Supriya Shrinate refused to delete the controversial 'Gayab' post targeting Prime Minister Narendra Modi even after Jairam Ramesh and Pawan Khera intervened."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/fire-delhi-market-ina-tenders-rushed-casualties-2717700-2025-04-30",
      "headline": "Massive fire at Delhi's popular Dilli Haat, 30 shops destroyedA massive fire swept through the popular Dilli Haat in Delhi, destroying 30 shops and causing losses to traders worth crores. The blaze was brought under control and no casualties were reported."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/mark-zuckerberg-says-in-18-months-coding-will-be-done-by-ai-it-will-be-better-than-work-of-most-engineers-2717414-2025-04-30",
      "headline": "Mark Zuckerberg says in 18 months coding will be done by AIIn a podcast interview with Dwarkesh Patel, Meta CEO Mark Zuckerberg said that in the next 12 to 18 months, most of the code for Meta will be written by AI. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhis-offer-caste-census-population-survey-government-big-decision-2717627-2025-04-30",
      "headline": "In welcoming caste census, Rahul Gandhi takes aim at 50% cap on reservationFollowing the government's decision to include the caste census in the next national census, Rahul Gandhi said that Prime Minister Narendra Modi-led government adopted the Congress party's vision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/china-flips-script-says-us-may-be-true-origin-of-covid-19-in-new-white-paper-glbs-2717767-2025-05-01",
      "headline": "China flips script, says US may be true origin of Covid-19 in new white paperChina has released a white paper rejecting the COVID-19 lab leak theory, accusing the US of being the virus's origin and politicizing the pandemic to deflect blame from its own failures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/tesla-board-began-ceo-search-to-potentially-replace-elon-musk-wsj-report-glbs-2717772-2025-05-01",
      "headline": "Tesla board began CEO search to potentially replace Elon Musk: ReportTesla's board is quietly seeking a successor to Elon Musk as CEO amid falling profits, political backlash, and market share losses, while Musk last month pledged to refocus on the struggling automaker."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyer-ipl-2025-csk-vs-pbks-fine-chennai-offence-2717825-2025-05-01",
      "headline": "Shreyas Iyer penalised for slow over rate against Chennai Super KingsIPL 2025, CSK vs PBKS: Punjab Kings' skipper Shreyas Iyer was fined Rs 12 lakh of his match fees after the four-wicket win over the Chennai Super Kings on Wednesday at the Chepauk."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/punjab-kings-coach-ricky-ponting-blames-psl-for-replacements-delay-in-ipl-2025-2717822-2025-05-01",
      "headline": "Punjab Kings coach Ricky Ponting blames PSL for replacements delay in IPL 2025Punjab Kings head coach Ricky Ponting blamed the ongoing PSL 2025 in Pakistan for the franchise's current lack of interest in seeking replacements, citing the limited availability of quality options. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-kasi-viswanathan-csk-vs-pbks-ipl-2025-2717819-2025-05-01",
      "headline": "Watch: Dhoni talks at length with CEO Kasi Viswanathan after early exitIPL 2025, CSK vs PBKS: MS Dhoni had a chat with Chennai Super Kings CEO Kasi Viswanathan after the five-time champions failed to qualify for the playoffs following their four-wicket defeat to Punjab Kings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-csk-bowling-coach-eric-simons-blames-chennai-batters-for-early-exit-2717818-2025-05-01",
      "headline": "IPL 2025: CSK bowling coach Eric Simons blames Chennai batters for early exitChennai Super Kings' bowling coach Eric Simons admitted that his team had to improve their batting accuracy after being eliminated from the playoffs by the Punjab Kings. \"We have been good at taking wickets, but as a team in our batting, there are a few areas where we need to find and to be more accurate around and what we need to do,\" Simons said. \"It's all about being more accurate.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-trent-boult-excited-to-go-up-against-fearless-vaibhav-suryavanshi-2717653-2025-05-01",
      "headline": "Trent Boult excited to go up against 'fearless' Vaibhav Suryavanshi in JaipurMumbai Indians fast bowler Trent Boult said he was excited to take on Vaibhav Suryavanshi in the upcoming fixture against the Rajasthan Royals (RR) at Sawai Man Singh Stadium, Jaipur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/david-boon-retires-as-icc-match-referee-after-remarkable-14-year-stint-2717802-2025-05-01",
      "headline": "David Boon retires as ICC match referee after remarkable 14-year stintDavid Boon retired as an ICC match referee on Wednesday, ending a remarkable 14-year tenure. His final assignment was the second Test between Bangladesh and Zimbabwe in Chattogram."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyer-ricky-ponting-csk-vs-pbks-ipl-2025-press-conference-2717800-2025-05-01",
      "headline": "Shreyas Iyer has taken his game to a new level: Ricky PontingIPL 2025, CSK vs PBKS: Ricky Ponting lauded Shreyas Iyer after his match-winning 72 off 41 balls against the Chennai Super Kings took Punjab Kings to second in the points table. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/champions-league-barcelona-draw-six-goal-thriller-with-inter-milan-2717798-2025-05-01",
      "headline": "Barcelona fight back to draw six-goal thriller with Inter MilanBarcelona rallied twice to force a 3-3 draw at home against Inter Milan in the thrilling first leg of their Champions League semi-final on Wednesday at Montjuic Olympic Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-pbks-chennai-super-kings-analysis-2717773-2025-05-01",
      "headline": "5 reasons behind CSK's horrendous IPL 2025 campaignCSK's IPL 2025 campaign unravelled under the weight of outdated tactics, misfired auction moves, and unsteady leadership. With playoff hopes extinguished, the five-time champions are left to confront a season that exposed cracks in their once-unshakeable foundation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-will-ponder-releasing-r-ashwin-says-sanjay-bangar-2717749-2025-05-01",
      "headline": "CSK will ponder releasing Ashwin for next season to free up purse: Sanjay BangarFormer India cricketer turned commentator Sanjay Bangar feels Chennai Super Kings (CSK) might think about releasing Ravichandran Ashwin for the next season of the Indian Premier League (IPL) to free up some purse."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/csk-bowling-coach-eric-simons-on-matheesha-pathirana-2717750-2025-05-01",
      "headline": "Pathirana's accuracy not a problem, batters are playing him a lot better: Eric SimonsChennai Super Kings' bowling coach, Eric Simons, defended Matheesha Pathirana following another poor outing against Punjab Kings in Match 49 of the Indian Premier League 2025 (IPL 2025). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shreyas-iyer-ricky-ponting-csk-vs-pbks-ipl-2025-press-conference-2717800-2025-05-01",
      "headline": "Shreyas Iyer has taken his game to a new level: Ricky PontingIPL 2025, CSK vs PBKS: Ricky Ponting lauded Shreyas Iyer after his match-winning 72 off 41 balls against the Chennai Super Kings took Punjab Kings to second in the points table. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/champions-league-barcelona-draw-six-goal-thriller-with-inter-milan-2717798-2025-05-01",
      "headline": "Barcelona fight back to draw six-goal thriller with Inter MilanBarcelona rallied twice to force a 3-3 draw at home against Inter Milan in the thrilling first leg of their Champions League semi-final on Wednesday at Montjuic Olympic Stadium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-pbks-chennai-super-kings-analysis-2717773-2025-05-01",
      "headline": "5 reasons behind CSK's horrendous IPL 2025 campaignCSK's IPL 2025 campaign unravelled under the weight of outdated tactics, misfired auction moves, and unsteady leadership. With playoff hopes extinguished, the five-time champions are left to confront a season that exposed cracks in their once-unshakeable foundation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-will-ponder-releasing-r-ashwin-says-sanjay-bangar-2717749-2025-05-01",
      "headline": "CSK will ponder releasing Ashwin for next season to free up purse: Sanjay BangarFormer India cricketer turned commentator Sanjay Bangar feels Chennai Super Kings (CSK) might think about releasing Ravichandran Ashwin for the next season of the Indian Premier League (IPL) to free up some purse."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/csk-bowling-coach-eric-simons-on-matheesha-pathirana-2717750-2025-05-01",
      "headline": "Pathirana's accuracy not a problem, batters are playing him a lot better: Eric SimonsChennai Super Kings' bowling coach, Eric Simons, defended Matheesha Pathirana following another poor outing against Punjab Kings in Match 49 of the Indian Premier League 2025 (IPL 2025). "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}