{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/budget-2025-income-tax-itr-filing-will-the-old-tax-regime-face-the-axe-2657339-2024-12-30",
      "headline": "Budget 2025: Will the old tax regime face the axe?With Budget 2025 approaching, debates intensify over the potential scrapping of the Old Tax Regime amidst tax reforms."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-enterprises-to-sell-entire-adani-wilmar-stake-in-usd-2-billion-deal-lence-pte-ltd-divestment-2657295-2024-12-30",
      "headline": "Adani Enterprises to sell entire Adani Wilmar stake in $2 billion dealAdani Enterprises and its wholly-owned subsidiary, Adani Commodities LLP (ACL), have entered into an agreement with Lence Pte Ltd, a fully-owned subsidiary of Wilmar International."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-falls-over-450-points-nifty-declines-adani-enterprises-jumps-7-percent-2657286-2024-12-30",
      "headline": "Sensex falls over 450 points, Nifty declines; Adani Enterprises jumps 7%The S&P BSE Sensex ended 450.94 points lower at 78,248.13, while the NSE Nifty50 settled 168.50 points lower at 23,644.90."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/greaves-cotton-share-price-jumps-13-percent-52-week-high-today-why-vijay-kedia-greaves-electric-mobility-ipo-stmp-2657274-2024-12-30",
      "headline": "Greaves Cotton share price surges 13% to hit 52-week high today. Here's why Greaves Cotton share price hit 52-week high. The share which had closed at Rs 281.83 on Friday, opened at Rs 288.70 on Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/are-fixed-deposits-still-the-best-bet-for-indian-investors-is-fd-safe-2657273-2024-12-30",
      "headline": "Are fixed deposits still the best bet for Indian investors?Fixed deposits are safe but face risks like limited protection, reinvestment challenges, and low post-tax real returns."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-in-january-2025-what-to-expect-investors-face-a-tough-start-sectors-to-watch-dalal-street-2657261-2024-12-30",
      "headline": "Stock market in January 2025: Will investors face a tough start to the year? Historically, January has often been a challenging month for equity markets, with the NSE Nifty 50 index recording losses in 13 out of the past 20 years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/budget-2025-last-major-income-tax-relief-economists-experts-standard-deduction-tax-rate-cut-2657244-2024-12-30",
      "headline": "Budget 2025: When was the last major income tax relief given? Budget 2025: The last Union Budget did not make changes to the old tax regime but introduced modifications to the new tax regime to make it more appealing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-in-2025-whats-next-for-stock-markets-in-the-new-year-2657239-2024-12-30",
      "headline": "Stock markets in 2025: What's next for Sensex and Nifty in the new year?Can Indian equities continue their upward climb, or will a mix of global and domestic hurdles create a rocky road ahead? Here is all you need to know. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/anya-polytech-and-fertilizers-ipo-day-3-check-latest-subscription-and-gmp-stmp-2657215-2024-12-30",
      "headline": "Anya Polytech & Fertilizers IPO Day 3: Check latest subscription and GMPAnya Polytech's unlisted shares are trading at a premium of Rs 5 in the grey market, reflecting a 35% gain over the upper price band of Rs 14."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mamata-machinery-share-price-tanked-5-percent-today-profit-booking-after-bumper-ipo-listing-stmp-2657201-2024-12-30",
      "headline": "Explained: Why Mamata Machinery share price tanked 5% todayMamata Machinery share price: The decline comes after the company's spectacular stock market debut last week, with analysts attributing the fall to profit booking by retail investors capitalising on the massive listing gains."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/unimech-aerospace-ipo-listing-check-latest-gmp-and-share-price-prediction-stmp-2657189-2024-12-30",
      "headline": "Unimech Aerospace IPO listing: Check latest GMP and share price predictionUnimech Aerospace IPO listing: In the grey market, Unimech Aerospace shares are commanding a robust premium of Rs 715, reflecting strong demand. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sagility-india-share-price-gains-nearly-3-will-it-continue-to-rally-stmp-2657182-2024-12-30",
      "headline": "Sagility India share price gains nearly 3%. Will it continue to rally?Sagility India share price: At around 11:30 am, the stock was trading 2.58% higher at Rs 55.25 after opening at Rs 55.01 and reaching an intraday high of Rs 56.44."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/itr-filing-simplified-5-updates-you-should-know-income-tax-filing-form-26as-2657176-2024-12-30",
      "headline": "ITR filing simplified: 5 updates you should knowUpdated tax rules, including pre-filled forms and flexible return filing, aim to reduce errors and ensure seamless compliance for taxpayers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dam-capital-share-price-fell-over-7-percent-profit-booking-today-market-listing-stmp-2657160-2024-12-30",
      "headline": "Explained: Why DAM Capital share price fell over 7% todayDAM Capital stock price: The sell-off is attributed to profit booking, a common trend after sharp initial gains. Analysts had previously offered mixed views on the company's shares."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indo-farm-equipment-ipo-opens-tomorrow-check-gmp-price-band-key-dates-stmp-2657143-2024-12-30",
      "headline": "Indo Farm Equipment IPO opens tomorrow: Check GMP, price band, key datesIndo Farm Equipment IPO: The price band is fixed at Rs 204-215 per share, with a lot size of 69 shares. The issue will close on Thursday, January 2."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/carraro-india-share-price-lists-at-7-percent-discount-rs-660-vs-ipo-price-of-rs-704-nse-stmp-2657142-2024-12-30",
      "headline": "Carraro India share listing: Stock list at Rs 660 vs IPO price of Rs 704Carraro India share price: On the NSE, the shares began trading at Rs 651, a discount of Rs 53 or 7.53%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ventive-hospitality-share-price-listing-rs-71815-bse-at-12-percent-premium-from-ipo-price-2657133-2024-12-30",
      "headline": "Ventive Hospitality share price lists at Rs 718.15 on BSE at 12% premium Ventive Hospitality listing: On the National Stock Exchange (NSE), the stock opened at Rs 716, reflecting an 11.35% premium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/senores-pharmaceuticals-share-price-listing-54-percent-premium-rs-600-nse-bumper-debut-d-street-2657125-2024-12-30",
      "headline": "Senores Pharmaceuticals shares list at 54% premium, bumper debut on D-StreetSenores Pharmaceuticals listing: Senores Pharmaceuticals shares opened at Rs 600 on the National Stock Exchange at a premium of 53.45% over its IPO price of 391. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jsw-energy-share-price-gains-6-percent-why-are-brokerages-bullish-on-the-stock-reason-rise-2657120-2024-12-30",
      "headline": "JSW Energy share price gains 6%. Why are brokerages bullish on the stock? JSW Energy stock: Brokerages are bullish on the shares of JSW Energy after the company's wholly-owned subsidiary, JSW Neo Energy signed a major deal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-start-week-lower-adani-enterprises-gain-3-percent-in-early-trade-2657115-2024-12-30",
      "headline": "Sensex, Nifty start week lower; Adani Enterprises gain 3% in early tradeThe S&P BSE Sensex was down by 76.67 points to 78,623.40, while the NSE Nifty50 lost 35.25 points to 23,778.15 as of 9:23 AM. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/assembly/story/delhi-lt-governor-vk-saxena-arvind-kejriwal-atishi-temporary-chief-minister-letter-elections-2657401-2024-12-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Lt Governor flags Arvind Kejriwal's 'temporary Chief Minister' remark to AtishiDelhi Lieutenant Governor VK Saxena hit out at AAP chief Arvind Kejriwal for calling Atishi a \"makeshift Chief Minister\" and said he was hurt by the statements made by him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-mcg-test-loss-captaincy-rohit-sharma-retirement-romours-2657224-2024-12-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rohit Sharma admits to dip in form, captaincy amid calls for Test retirement Australia vs India, 4th Test: Rohit Sharma acknowledged concerns about his batting form and captaincy but remained tight-lipped about his future in the team. Rohit has managed just 31 runs in six innings in the Border-Gavaskar Trophy 2024-25. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/manmohan-singh-death-congress-explains-why-gandhi-family-missed-ex-pm-ashes-immersion-2657369-2024-12-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'For privacy to his family': Congress on missing Manmohan Singh's ashes immersionCongress's clarification came after several BJP leaders criticised the grand old party for not accompanying Dr Manmohan Singh's family when his ashes were immersed in the Yamuna river. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tamil-nadu-bjp-k-annamalai-self-whipping-flogging-murugan-tamil-culture-penance-sattai-adi-nerthi-kadan-explained-2657347-2024-12-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "What the flog?  The significance of Annamalai ultimate penanceBJP Tamil Nadu president K Annamalai self-whipped to protest against the sexual assault incident at Chennai's Anna University. Through this act, he also took on MK Stalin's DMK government, calling it \"a surrender to a higher power.\" What is the self-whipping act regarded as the ultimate form of penance, and what is its significance in Tamil culture?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/when-jimmy-carter-walked-the-streets-of-a-small-gurgaon-village-that-later-became-carterpuri-2657257-2024-12-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "When a US President visited a Gurugram village that later became CarterpuriDuring his visit to India in 1978, the then President of the USA, Jimmy Carter, visited a small village in Haryana, which was later renamed Carterpuri in his honour by the then Prime Minister of India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-rohit-sharma-virat-kohli-test-future-call-for-retirement-2657408-2024-12-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Do old guards Rohit Sharma and Virat Kohli deserve more leeway in Tests?Australia vs India, 4th Test: Rohit Sharma and Virat Kohli failed to deliver when the team needed their senior pros to dig in for a draw in Melbourne. Do they deserve more leeway? Should Rohit continue as captain for the series finale in Sydney?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/delhi-weather-update-fog-cold-wave-punjab-haryana-imd-temperature-visibility-2657425-2024-12-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Delhi, surrounding regions brace for chilly New Year, dense fog on cardsDelhi and surrounding areas braced for severe cold and dense fog as the New Year approaches. Delhi saw temperatures dip well below average, with visibility and travel expected to be heavily impacted across several states until January 1.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/berlin-says-elon-musk-trying-to-influence-german-election-2657381-2024-12-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Berlin says Elon Musk trying to influence German electionThe support of the AfD from Musk, who is set to serve US President-elect Donald Trump's administration as an outside adviser, comes as Germans are set to vote on Feb. 23. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/smokers-lose-20-minutes-of-life-with-a-single-cigarette-new-study-warns-2657418-2024-12-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Smokers lose 20 minutes of life with a single cigaretteA recent study reveals that smoking reduces life expectancy by an average of 20 minutes per cigarette, with women losing more time than men."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/who-is-saurabh-sharma-wanted-for-the-massive-cash-gold-haul-in-madhya-pradesh-2657308-2024-12-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Who is Saurabh Sharma, wanted for the massive cash-gold haul in Madhya Pradesh?Raids continue as three agencies investigate Sharma's alleged illegal activities. A lookout notice is being planned for the absconding suspect"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/isro-pslv-c60-spadex-launch-live-updates-docking-undocking-poem-4-india-space-mission-2657234-2024-12-30?utm_source=LiveBlog_hp&utm_medium=LiveBlog&utm_campaign=home_LiveBlog",
      "headline": "PSLV-C60 Spadex Mission: Isro all set for launch tonightThe mission involves launching two specially designed satellites weighing approximately 220 kg each using the workhorse Polar Satellite Launch Vehicle (PSLV) rocket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-vietnam-trip-new-year-bjp-vs-congress-manmohan-singh-death-funeral-2657260-2024-12-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "BJP roasts Rahul Gandhi over Vietnam trip, Congress says 'Get well in New Year'In a fresh round of political sparring, the BJP slammed Congress leader Rahul Gandhi for allegedly travelling to Vietnam to celebrate the New Year, just days after the death of former Prime Minister Manmohan Singh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/south-korea-plane-crash-azerbaijan-airlines-deaths-which-seats-front-middle-rear-safest-passenger-airplane-explained-2657211-2024-12-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Which is safest seat on a plane; front, middle or rear? Here's a deep diveFatal air crashes in Kazakhstan and South Korea, where survivors were evacuated from the rear of the jets, have raised a buzz if the seats at the plane's end are safer than others. Are they really safe?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/south/story/pawan-kalyan-on-allu-arjun-arrest-does-not-blame-telangana-police-law-equal-for-everyone-2657305-2024-12-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Law equal for all, I don't blame police: Pawan Kalyan on Allu Arjun's arrestAndhra Pradesh Deputy Chief Minister and former actor Pawan Kalyan spoke on the stampede at a theatre and Allu Arjun's arrest following that. He said he didn't find any fault with Telangana police's action and added law was equal for everyone."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/asha-bhonsle-91-karan-aujla-tauba-tauba-recreates-vicky-kaushal-hook-step-2657423-2024-12-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Viral: 91-year-old Asha Bhosle owns Tauba Tauba, recreates hook stepVeteran singer Asha Bhosle, at 91, mesmerised the audience in Dubai with her rendition of Karan Aujla's Tauba Tauba, showcasing her timeless talent and charm. Her performance, including the song's hook step, received admiration from fans and celebrities alike."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-aus-4th-test-day-5-was-yashasvi-jaiswal-out-or-not-out-controversial-drs-call-explained-2657173-2024-12-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Was Yashasvi Jaiswal out or not out? Controversial DRS call explainedIND vs AUS: Yashasvi Jaiswal was dismissed on 84 via a controversial DRS call on the final day of the MCG Test. Jaiswal was given caught out, despite the snicko meter showing no spike at all."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/international-shows/story/c-drama-hidden-love-actor-zhao-lusi-health-concern-hospitalised-wheelchair-pic-2657279-2024-12-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Hidden Love star Zhao Lusi's pic in wheelchair goes viral, team shares statementChinese actress Zhao Lusi, known for her role in Hidden Love, was recently hospitalised, sparking concerns over her health. Her team shared a statement and announced a suspension of all work commitments for a speedy recovery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-india-bangladesh-must-worry-about-chinas-mega-brahmaputra-dam-2657300-2024-12-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why India, Bangladesh must worry about China's mega Brahmaputra damThe $137 billion project, while promising clean energy and regional development, risks ecological damage, geopolitical tensions and water disruptions for downstream India and Bangladesh"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/maharashtra-man-dies-due-to-heart-attack-while-playing-cricket-in-jalna-video-viral-2657348-2024-12-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Man collapses during cricket match, dies of suspected heart attack in MaharashtraA man, who was playing cricket on Christmas, died due to a possible heart attack in Maharashtra's Jalna. The victim was walking to the crease during a match when he collapsed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/indians-abroad/story/missing-indian-kerala-student-found-dead-in-river-newbridge-edinburgh-heriot-watt-university-police-scotland-2657252-2024-12-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Missing 22-year-old Kerala student found dead in Scottish riverThe body of Santra Saju, a 22-year-old Indian student from Kerala, has been found in a river near Newbridge, Scotland. Saju, a student at Heriot-Watt University in Edinburgh, went missing on December 6. Police Scotland confirmed the discovery, stating that while formal identification is pending, Saju's family has been informed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/asteroid-to-hit-earth-a-new-equation-could-tell-us-when-2657275-2024-12-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Asteroid to hit Earth? A new equation could tell us whenThis advancement could provide crucial early warnings about incoming asteroids, allowing for timely intervention or acceptance of our fate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/budget-2025-last-major-income-tax-relief-economists-experts-standard-deduction-tax-rate-cut-2657244-2024-12-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Budget 2025: When was the last major income tax relief given? Budget 2025: The last Union Budget did not make changes to the old tax regime but introduced modifications to the new tax regime to make it more appealing."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/protesting-bihar-bpsc-students-fume-prashant-kishor-bihar-police-lathicharge-2657166-2024-12-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Prashant Kishor's defence as lathicharged exam aspirants ask 'Where were you?'BPSC Student Protest: Protesting Bihar Public Service Commission (BPSC) aspirants asked political strategist-turned-politician Prashant Kishor to step back from the protest site at Patna's Gardanibagh late on Sunday after he was absent during the lathicharge by Bihar Police.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/army-officer-assaulted-ncc-training-camp-kerala-thrikkakkara-crowd-food-poisoning-scare-among-cadets-2657250-2024-12-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Army officer assaulted as mob storms Kerala NCC camp over food poisoning claimsAn Army officer was assaulted during an NCC training camp in Kerala's Thrikkakkara after a crowd disrupted operations following a food poisoning scare among cadets. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-on-barroz-lukewarm-box-office-reception-the-film-is-not-for-numbers-2657427-2024-12-30",
      "headline": "Mohanlal on Barroz's lukewarm box office reception: The film is not for numbersMohanlal defends Barroz's box office performance, emphasising the film's artistic intent over commercial success. The children's film, directed by the actor himself, aims to offer a unique visual experience with its exclusive 3D format."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/asha-bhonsle-91-karan-aujla-tauba-tauba-recreates-vicky-kaushal-hook-step-2657423-2024-12-30",
      "headline": "Viral: 91-year-old Asha Bhosle owns Tauba Tauba, recreates hook stepVeteran singer Asha Bhosle, at 91, mesmerised the audience in Dubai with her rendition of Karan Aujla's Tauba Tauba, showcasing her timeless talent and charm. Her performance, including the song's hook step, received admiration from fans and celebrities alike."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kannada-star-upendra-expresses-interest-in-hindi-remake-of-his-iconic-film-upendra-2657415-2024-12-30",
      "headline": "Kannada star Upendra expresses interest in Hindi remake of his iconic film UpendraKannada actor Upendra discusses the evolution of Kannada cinema and his interest in remaking his iconic film 'Upendra' in Hindi, highlighting the industry's growth and pan-Indian appeal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actor-nassar-son-faisal-uttered-vijay-regaining-consiousnes-after-14-days-coma-stmp-2657416-2024-12-30",
      "headline": "Actor Nassar's son took Thalapathy Vijay's name after 14-day comaVeteran actor Nassar shared a moving account of his son Faisal's recovery from a coma, emphasising Tamil cinema star Vijay's pivotal role. Faisal, a devoted fan, first took Vijay's name upon awakening, with Vijay personally supporting his rehabilitation journey."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/madhya-pradesh-bengal-senior-womens-one-day-trophy-anushka-sharma-2657441-2024-12-30",
      "headline": "MP win Senior Women's One-Day Trophy title after Anushka Sharma starsSenior Women's One-Day Trophy 2024-25: Anushka Sharma's 69 not out and Kranti Gaud's four-wicket haul helped Madhya Pradesh win the title after beating Bengal by seven wickets in the final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-vs-sri-lanka-mitch-hay-2nd-t20i-series-win-report-2657414-2024-12-30",
      "headline": "Mitch Hay stars as New Zealand crush Sri Lanka to claim series NZ vs SL: Mitch Hay's unbeaten 41 off 19 balls helped New Zealand win the T20I series after beating Sri Lanka by 45 runs in the second game at the Bay Oval in Mount Maunganui. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-rohit-sharma-virat-kohli-test-future-call-for-retirement-2657408-2024-12-30",
      "headline": "Do old guards Rohit Sharma and Virat Kohli deserve more leeway in Tests?Australia vs India, 4th Test: Rohit Sharma and Virat Kohli failed to deliver when the team needed their senior pros to dig in for a draw in Melbourne. Do they deserve more leeway? Should Rohit continue as captain for the series finale in Sydney?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/australia-vs-india-must-go-for-border-gavaskar-trophy-draw-world-test-championship-sunil-gavaskar-2657395-2024-12-30",
      "headline": "India must look to win in Sydney, stop thinking about WTC final: GavaskarAUS vs IND: Indian cricket legend Sunil Gavaskar believes that the Rohit Sharma-led Indian Test team should focus on securing a draw in the ongoing Border Gavaskar Trophy, rather than focusing on the chances of qualifying for the World Test Championship final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/australia-vs-india-mcg-test-rohit-sharma-press-conference-defeat-form-captaincy-2657374-2024-12-30",
      "headline": "It's mentally disturbing: Rohit Sharma on horror form, captaincy in Australia tourAustralia vs India, 4th Test: Captain Rohit Sharma addressed the press in Melbourne after India's 184-run defeat. From his own form to selection issues, the skipper took tough questions from the media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-yashasvi-jaiswal-shut-up-to-sam-konstas-hits-a-shot-silly-point-melbourne-test-2657386-2024-12-30",
      "headline": "Watch: Jaiswal tells chatty Konstas to shut up, then hits a shot at himYashasvi Jaiswal and Sam Konstas clashed in a fiery spat during the MCG Test, with Jaiswal responding to constant sledging by smashing a shot onto Konstas' body, adding another layer of tension to the Border-Gavaskar Trophy series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/brisbane-international-nick-kyrgios-novak-djokovic-chest-bump-celebration-2657375-2024-12-30",
      "headline": "Watch: Kyrgios, Djokovic hog limelight with chest-bump celebration Brisbane International: Nick Kyrgios and Novak Djokovic celebrated whole-heartedly after winning their doubles match on Monday against Alexander Erler and Andreas Mies at the Pat Rafter Arena. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-border-gavaskar-trophy-india-vs-australia-rohit-sharma-rishabh-pant-mcg-2657354-2024-12-30",
      "headline": "Rohit Sharma slammed for blaming Pant, youngsters after MCG defeatBorder Gavaskar Trophy, IND vs AUS: Rohit Sharma faced criticism for his comments on youngsters after India lost the Boxing Day Test by 184 runs at the Melbourne Cricket Ground. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-if-rohit-sharma-was-not-captain-wouldnt-be-playing-irfan-pathan-melbourne-test-2657313-2024-12-30",
      "headline": "If Rohit was not captain, he wouldn't be playing in this team: Irfan PathanRohit Sharma's dismal Test form sparked sharp criticism, with Irfan Pathan questioning his place in the XI. The Indian skipper managed only 31 runs in five innings, contributing to India's struggles in the ongoing Border-Gavaskar Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-yashasvi-jaiswal-pat-cummins-controversial-dismissal-mcg-test-2657303-2024-12-30",
      "headline": "Yashasvi Jaiswal hit it: Cummins gives verdict on controversial dismissalIND vs AUS, Border Gavaskar Trophy: Yashasvi Jaiswal scored 82 runs and was dismissed by Pat Cummins on Day 5 of the Boxing Day Test against Australia at the Melbourne Cricket Ground. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/icc-test-cricketer-of-the-year-jasprit-bumrah-joe-root-nominees-2024-2657270-2024-12-30",
      "headline": "Jasprit Bumrah, Joe Root among nominees for ICC Test Cricketer of 2024 awardIndia fast bowler Jasprit Bumrah, who took 71 wickets in 2024, has been nominated for the ICC Test Cricketer of the Year award. Joe Root, Harry Brook and Kamindu Mendis are the other three in the shortlist. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/brisbane-international-nick-kyrgios-novak-djokovic-chest-bump-celebration-2657375-2024-12-30",
      "headline": "Watch: Kyrgios, Djokovic hog limelight with chest-bump celebration Brisbane International: Nick Kyrgios and Novak Djokovic celebrated whole-heartedly after winning their doubles match on Monday against Alexander Erler and Andreas Mies at the Pat Rafter Arena. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-border-gavaskar-trophy-india-vs-australia-rohit-sharma-rishabh-pant-mcg-2657354-2024-12-30",
      "headline": "Rohit Sharma slammed for blaming Pant, youngsters after MCG defeatBorder Gavaskar Trophy, IND vs AUS: Rohit Sharma faced criticism for his comments on youngsters after India lost the Boxing Day Test by 184 runs at the Melbourne Cricket Ground. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-if-rohit-sharma-was-not-captain-wouldnt-be-playing-irfan-pathan-melbourne-test-2657313-2024-12-30",
      "headline": "If Rohit was not captain, he wouldn't be playing in this team: Irfan PathanRohit Sharma's dismal Test form sparked sharp criticism, with Irfan Pathan questioning his place in the XI. The Indian skipper managed only 31 runs in five innings, contributing to India's struggles in the ongoing Border-Gavaskar Trophy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-yashasvi-jaiswal-pat-cummins-controversial-dismissal-mcg-test-2657303-2024-12-30",
      "headline": "Yashasvi Jaiswal hit it: Cummins gives verdict on controversial dismissalIND vs AUS, Border Gavaskar Trophy: Yashasvi Jaiswal scored 82 runs and was dismissed by Pat Cummins on Day 5 of the Boxing Day Test against Australia at the Melbourne Cricket Ground. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/icc-test-cricketer-of-the-year-jasprit-bumrah-joe-root-nominees-2024-2657270-2024-12-30",
      "headline": "Jasprit Bumrah, Joe Root among nominees for ICC Test Cricketer of 2024 awardIndia fast bowler Jasprit Bumrah, who took 71 wickets in 2024, has been nominated for the ICC Test Cricketer of the Year award. Joe Root, Harry Brook and Kamindu Mendis are the other three in the shortlist. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-mitchell-starc-availability-sydney-test-pat-cummins-gives-update-2657267-2024-12-30",
      "headline": "Will Starc be available for Sydney Test? Cummins gives positive updatePat Cummins confirmed Mitchell Starc's availability for the Sydney Test, alleviating concerns over his back injury. Starc bowled through pain in Melbourne, displaying resilience, and his availability strengthens Australia's chances in the Border-Gavaskar Trophy decider."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-aus-4th-test-rishabh-pant-dismissal-rohit-sharma-press-conference-comments-2657240-2024-12-30",
      "headline": "Today or 1st innings? Rohit's cheeky reaction to Pant's frustrating dismissalsBorder-Gavaskar Trophy: India captain Rohit Sharma expressed his disappointment with Rishabh Pant's shot selection in both innings of the Boxing Day Test. Pant faced the heat after throwing his wicket away at a crucial juncture on Day 5 of the Test, which India lost by 184 runs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-jaspirt-bumrah-over-bowling-risk-rohit-sharma-wary-melbourne-test-2657242-2024-12-30",
      "headline": "Rohit Sharma wary of over-bowling Bumrah in Australia: Been very carefulRohit Sharma acknowledged the risks of over-bowling Jasprit Bumrah but emphasized that careful workload management has been a priority to preserve the pacer's form and fitness during the demanding Border-Gavaskar Trophy series against Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-rohit-sharma-virat-kohli-test-future-sanjay-manjrekar-2657236-2024-12-30",
      "headline": "Virat Kohli deserves a longer rope, don't compare him to Rohit Sharma: ManjrekarSanjay Manjrekar said that it was unfair to judge Virat Kohli and Rohit Sharma's performances in the Border-Gavaskar Trophy by the same standard, particularly in light of calls for their retirement after their struggles in the Boxing Day Test.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-mcg-test-loss-captaincy-rohit-sharma-retirement-romours-2657224-2024-12-30",
      "headline": "Rohit Sharma admits to dip in form, captaincy amid calls for Test retirement Australia vs India, 4th Test: Rohit Sharma acknowledged concerns about his batting form and captaincy but remained tight-lipped about his future in the team. Rohit has managed just 31 runs in six innings in the Border-Gavaskar Trophy 2024-25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-aus-4th-test-rohit-sharma-india-wanted-to-go-for-win-mcg-boxing-day-2657219-2024-12-30",
      "headline": "Rohit Sharma's bizarre tactical claim after MCG loss: Wanted to go for the winIndia captain Rohit Sharma revealed that India were backing themselves to chase down 340 runs on the final day of the Boxing Day Test match. Rohit's thought process seemed bizarre given the fact that no team in the past 96 years has successfully chased a target exceeding 300 at the MCG."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/australia-vs-india-world-test-championship-wtc-final-chances-melbourne-loss-2657208-2024-12-30",
      "headline": "How can India qualify for WTC final after Boxing Day Test defeat?World Test Championship: Rohit Sharma-led India encountered another setback in their quest for the World Test Championship (WTC) 2023-25 final after suffering a 184-run defeat to Australia in the fourth Test at the Melbourne Cricket Ground (MCG) on December 30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/controversy-over-yashasvi-jaiswals-dismissal-in-melbourne-test-2657204-2024-12-30",
      "headline": "Controversy over Yashasvi Jaiswal's dismissal in Melbourne TestA major DRS controversy erupted during the Melbourne Test match when Yashasvi Jaiswal was given out by the third umpire."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-mcg-test-loss-captaincy-rohit-sharma-retirement-romours-2657224-2024-12-30",
      "headline": "Rohit Sharma admits to dip in form, captaincy amid calls for Test retirement Australia vs India, 4th Test: Rohit Sharma acknowledged concerns about his batting form and captaincy but remained tight-lipped about his future in the team. Rohit has managed just 31 runs in six innings in the Border-Gavaskar Trophy 2024-25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-aus-4th-test-rohit-sharma-india-wanted-to-go-for-win-mcg-boxing-day-2657219-2024-12-30",
      "headline": "Rohit Sharma's bizarre tactical claim after MCG loss: Wanted to go for the winIndia captain Rohit Sharma revealed that India were backing themselves to chase down 340 runs on the final day of the Boxing Day Test match. Rohit's thought process seemed bizarre given the fact that no team in the past 96 years has successfully chased a target exceeding 300 at the MCG."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/australia-vs-india-world-test-championship-wtc-final-chances-melbourne-loss-2657208-2024-12-30",
      "headline": "How can India qualify for WTC final after Boxing Day Test defeat?World Test Championship: Rohit Sharma-led India encountered another setback in their quest for the World Test Championship (WTC) 2023-25 final after suffering a 184-run defeat to Australia in the fourth Test at the Melbourne Cricket Ground (MCG) on December 30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/controversy-over-yashasvi-jaiswals-dismissal-in-melbourne-test-2657204-2024-12-30",
      "headline": "Controversy over Yashasvi Jaiswal's dismissal in Melbourne TestA major DRS controversy erupted during the Melbourne Test match when Yashasvi Jaiswal was given out by the third umpire."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/australia-vs-india-melbourne-test-yashasvi-jaiswal-dismissal-drs-gavaskar-2657194-2024-12-30",
      "headline": "Sunil Gavaskar blasts Yashasvi Jaiswal's controversial MCG dismissalLegendary Indian cricketer Sunil Gavaskar and the BCCI vice president Rajeev Shukla questioned third umpire Sharfuddoula's decision to adjudge Yashasvi Jaiswal out on Day 5 of the Boxing Day Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-4th-test-day-5-score-melbourne-thriller-wtc-standings-2657179-2024-12-30",
      "headline": "Steely Australia break India's resistance to win MCG thriller, end 13-year streakAustralia vs India, 4th Test: Australia rode on an all-round bowling show on Day 5 to beat India by 184 runs and take a 2-1 lead in the five-match series on Monday. India paid the price for their big stars, including Rohit Sharma and Virat Kohli, not showing enough fight with the bat in the final innings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-aus-4th-test-day-5-was-yashasvi-jaiswal-out-or-not-out-controversial-drs-call-explained-2657173-2024-12-30",
      "headline": "Was Yashasvi Jaiswal out or not out? Controversial DRS call explainedIND vs AUS: Yashasvi Jaiswal was dismissed on 84 via a controversial DRS call on the final day of the MCG Test. Jaiswal was given caught out, despite the snicko meter showing no spike at all."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}