{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-high-rally-it-auto-metal-stocks-future-fed-rate-cut-2839875-2025-12-22",
      "headline": "Sensex ends 638 points higher, Nifty above 26,100; Trent up 4%The S&P BSE Sensex was up 638.12 points to close at 85,567.48, while the NSE Nifty50 added 206 points to end at 26,172.40. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/bank-locker-shortage-in-india-why-getting-a-locker-is-becoming-difficult-2839846-2025-12-22",
      "headline": "Trying to get a bank locker? Here's why you may be turned awayIndia currently has around 60 lakh bank lockers, while demand is projected to rise to nearly 6 crore by 2030, according to industry estimates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/cochin-shipyard-share-price-jumps-over-6-percent-why-is-it-rising-today-2839817-2025-12-22",
      "headline": "Cochin Shipyard share price jumps over 6%. Why is it rising today?The stock was trading around Rs 1,645, up over 6% on the Bombay Stock Exchange at around 2:04 pm, and touched intraday highs above Rs 1,653.50 during the session."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/want-safe-returns-this-post-office-scheme-can-earn-you-up-to-rs-2-lakh-in-interest-2839805-2025-12-22",
      "headline": "Want safe returns? This post office scheme can earn you up to Rs 2 lakh in interestSafe investments often mean modest returns, but that is not always the case. With the right amount and tenure, some secure schemes can generate meaningful interest over time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/8th-pay-commission-salary-expectations-pay-hike-expectations-timeline-2839803-2025-12-22",
      "headline": "8th Pay Commission: What next pay hike may look like for government employeesThe 8th Pay Commission signals higher pay, but history suggests patience may be required before revised salaries and arrears actually reach employees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-new-zealand-fta-women-led-trade-deal-zero-duty-exports-services-student-visas-investment-piyush-goyal-explained-2839797-2025-12-22",
      "headline": "First women-led FTA: 3 specialities of India's free trade deal with New ZealandNegotiations for the India–New Zealand Free Trade Agreement were formally launched on March 16, 2025, during discussions between Commerce and Industry Minister Piyush Goyal and New Zealand's Trade and Investment Minister Todd McClay. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/waiting-for-your-income-tax-refund-why-you-may-not-get-interest-despite-the-delay-2839763-2025-12-22",
      "headline": "Waiting for your income tax refund? Why you may not get interest despite the delayWaiting for an income tax refund can be frustrating, especially when the money is stuck for weeks. While the law promises interest on delayed refunds, not every taxpayer is entitled to it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-new-zealand-sign-landmark-free-trade-deal-to-focus-on-innovation-investment-and-shared-opportunities-2839733-2025-12-22",
      "headline": "India, New Zealand sign free trade deal to focus on innovation, investmentThe agreement, described by both sides as ambitious and mutually beneficial, is expected to enhance market access, promote investment flows, strengthen strategic cooperation, and create new opportunities for businesses, farmers, MSMEs, innovators, students and youth across sectors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/gold-price-record-high-key-levels-good-time-to-buy-or-not-2839717-2025-12-22",
      "headline": "Gold hits record high again. Should you buy at these levels?In the domestic market, MCX gold futures are consolidating near lifetime highs around Rs 1,35,400 per 10 grams. Prices continue to hold a rising channel, suggesting strong underlying demand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/explained-why-groww-share-price-gained-today-jefferies-buy-rating-target-price-rs-180-2839709-2025-12-22",
      "headline": "Explained: Why Groww share price gained 6% todayGroww share price: The rally in the stock comes after a strong move last week as well. Groww shares had already risen about 13% on Friday, and Monday marked the third straight session of gains for the stock."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/shriram-finance-share-price-jumps-4-percent-today-why-is-stock-rising-explained-2839700-2025-12-22",
      "headline": "Shriram Finance share price jumps 4% today. Here's why it's gainingThe stock moved higher after global brokerage MUFG raised its target price on Shriram Finance, citing the strong strategic impact of its recent deal and the potential for a re-rating."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/infosys-share-price-why-is-it-rising-today-adrs-explained-2839678-2025-12-22",
      "headline": "Infosys shares rise 3% today. Why is the IT giant's stock price rising?Shares in the Bengaluru-based software services firm were up 2.18% on the Bombay Stock Exchange (BSE) at 10:10 am to trade at Rs 1,674.50, reflecting stronger sentiment after the company addressed market speculation linked to sharp ADR moves last week. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/foxconn-women-led-iphone-plant-hires-30000-staff-in-record-india-hiring-2839669-2025-12-22",
      "headline": "Foxconn's new women-led iPhone plant in India hires 30,000 staff: ReportThe workers receive free accommodation, subsidised meals, and earn an average salary of around Rs 18,000 per month, among the highest for women in blue-collar manufacturing roles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-rising-today-sensex-jumps-500-points-key-reasons-explained-2839656-2025-12-22",
      "headline": "Sensex jumps over 500 points: Why is stock market rising today?The Sensex was trading at 85,434.75, up 505.39 points at 9:31 am, while the NSE Nifty50 rose 166.50 points to 26,132.90."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-372-points-higher-nifty-above-26000-infosys-jumps-3-percent-2839653-2025-12-22",
      "headline": "Sensex opens 372 points higher, Nifty above 26,000; Infosys jumps 3%The S&P BSE Sensex was up 491.74 points to 85,421.10, while the NSE Nifty50 added 157.75 points to 26,124.15 as of 9:29 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-price-today-india-hits-record-high-why-gold-rates-are-rising-us-fed-rate-cuts-safe-haven-demand-2839652-2025-12-22",
      "headline": "Gold surges to record high: Why is it rising again?Gold, which is seen as a safe store of value during uncertain times, has risen 67% so far this year. While gold touched new highs, silver prices moved in the opposite direction in the domestic market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-sensex-nifty-trading-setup-view-today-nse-bse-shares-to-buy-2839637-2025-12-22",
      "headline": "Sensex, Nifty today: Will stock market continue to fall or open higher?Gift Nifty futures were trading at around 26,190 points at 7:52 am IST, pointing to a positive start for the Nifty, compared with Friday's close of 25,966.4. This suggests markets may try to recover after a weak spell."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/reserve-bank-of-india-governor-sanjay-malhotra-india-goldilocks-phase-high-growth-low-inflation-2839522-2025-12-21",
      "headline": "India in goldilocks phase with 8% growth, low inflation: RBI GovernorIn an exclusive interview with India Today, Reserve Bank of India (RBI) Governor Sanjay Malhotra described the Indian economy as being in a 'Goldilocks period' characterised by high GDP growth of 8 per cent and low inflation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-is-it-difficult-to-run-airline-in-india-aviation-industry-challenges-failures-indigo-airindia-kingfisher-2839324-2025-12-21",
      "headline": "India is flying more, but why do airlines still struggleIndia's skies are busier than ever, airports are expanding, and passengers are flying in record numbers. Yet the business of running an airline remains unforgiving."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/india-new-insurance-amendment-bill-sabka-bima-sabki-rakhsha-decoded-2838964-2025-12-20",
      "headline": "New insurance rules: Will claim settlements improve for policyholders?The new insurance laws strengthen oversight and enforcement. In this special report, IndiaToday.in examines whether that will actually improve claim settlements for policyholders."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/babul-supriyos-children-fail-to-get-into-ms-dhonis-ranchi-home-troll-their-father-2839889-2025-12-22",
      "headline": "Babul Supriyo's children fail to get into MS Dhoni's Ranchi home, troll their father Babul Supriyo recounted his daughter Naina and nephew Golu's visit to former Indian cricket captain MS Dhoni's Ranchi farmhouse. He described their creative but unsuccessful efforts to meet the cricketer, and the affection fans have for Dhoni."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/shiva-rajkumar-confirms-bigger-role-in-rajinikanths-jailer-2-with-shoot-starting-soon-2839880-2025-12-22",
      "headline": "Shiva Rajkumar confirms bigger role in Jailer 2, to join shoot this week Kannada actor Shiva Rajkumar shared details about his participation in the highly anticipated Jailer 2, including an extended cameo and his shooting timeline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/chitrangada-singh-on-missed-film-opportunity-with-shah-rukh-khan-2839891-2025-12-22",
      "headline": "Chitrangada Singh on missed film opportunity with SRK: Listened to too many people Chitrangada Singh has spoken about the career-defining films she turned down, including Gangs of Wasseypur, Tanu Weds Manu and a missed opportunity to star opposite Shah Rukh Khan."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/samantha-mobbed-hyderabad-event-chinmayi-reacts-calls-better-crowd-control-2839862-2025-12-22",
      "headline": "Chinmayi reacts to Samantha being mobbed at event: Team member likely has bruises Singer Chinmayi Sripada reacted strongly after Samantha Ruth Prabhu was mobbed at a Hyderabad event. The incident highlighted the urgent need for improved crowd management and celebrity safety measures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/real-uzair-baloch-denies-killing-anyone-as-viral-video-surfaces-amid-dhurandhar-buzz-2839815-2025-12-22",
      "headline": "Real Uzair Baloch denies killing anyone as viral video surfaces amid Dhurandhar buzz An old interview featuring Lyari gangster Uzair Baloch resurfaces amid the buzz around Aditya Dhar's Dhurandhar, where he claims he never killed anyone and explains why locals call him a 'don'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/sreenivasan-tribute-by-director-sathyan-anthikad-highlights-malayalam-cinema-legacy-2839802-2025-12-22",
      "headline": "Director Sathyan Anthikad leaves pen, moving note at Sreenivasan's last rites Director Sathyan Anthikad paid tribute to Sreenivasan during his final rites with a special note and a cherished pen, reflecting the deep creative partnership between the two. The final ceremony was held with full state honours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/dulquer-salmaan-amaal-celebrate-14-years-marriage-heartfelt-social-media-post-2839824-2025-12-22",
      "headline": "Dulquer Salmaan marks 14 years with wife Amaal: Proud to be your other half Actor Dulquer Salmaan shared a series of personal photos and a touching note on social media to celebrate 14 years of togetherness with his wife, Amaal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/the-beckham-feud-david-victoria-brooklyn-and-a-family-soap-in-the-making-2839808-2025-12-22",
      "headline": "Palace fight is passe. Beckham family feud is all the talk The reported Beckham family feud has unfolded over time and come into the open only recently. Here's a timeline, from wedding tensions and missed birthdays to family dos, which pointed to a growing rift all along."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/nicki-minaj-comment-invites-fan-fury-if-you-are-born-a-boy-be-a-boy-2839785-2025-12-22",
      "headline": "If you are born a boy, be a boy: Nicki Minaj's comment invites fan fury Rapper Nicki Minaj has come under intense scrutiny following comments made during a national television appearance. Her remarks on gender identities have led to widespread discussion and a polarised response on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/arjun-mathur-highlights-nepotism-casting-challenges-hindi-film-ott-industry-2839801-2025-12-22",
      "headline": "Arjun Mathur slams film industry's casting culture in blunt post Actor Arjun Mathur's recent Instagram post has drawn attention, as he voiced concerns about casting practices, industry preference for social media presence, and the ongoing debate around nepotism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/weathering-with-you-proves-anime-romances-are-never-just-about-love-2838388-2025-12-22",
      "headline": "Weathering With You proves anime romances are never just about love In this week's Animania, we discuss Weathering With You, a visually stunning anime that blends romance, rain and rebellion. The film explores love, climate anxiety and growing up in modern Tokyo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/shiva-rajkumar-cancer-recovery-brother-puneeth-loss-upcoming-film-45-release-2839770-2025-12-22",
      "headline": "Shiva Rajkumar on cancer recovery: Didn't know if I'd hold my wife's hand again At a press event for the film 45 in Chennai, Shiva Rajkumar discussed his recovery from cancer surgery, the impact of his brother Puneeth's death, his film collaborations, political intentions, and his upcoming role in a female avatar."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-kannada-12-planted-guests-wildcard-entrants-secret-room-twists-2839765-2025-12-22",
      "headline": "Bigg Boss Kannada 12: Sudeep reveals twist as wildcards Rajath-Chaitra exit Bigg Boss Season 11 contestants Rajath and Chaitra, who entered the Season 12 house first as guests and later as wildcard contestants, exited the show after Kiccha Sudeep made a surprising revelation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shilpa-shetty-shares-memories-of-father-surendra-on-his-85th-birth-anniversary-2839779-2025-12-22",
      "headline": "Shilpa Shetty shares memories of father Surendra on his 85th birth anniversary Shilpa Shetty remembered her late father Surendra Shetty on what would have been his 85th birthday, sharing emotional family moments and a heartfelt note on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chaturvedi-endorses-dhurandhar-as-new-age-cinema-no-veneer-whitewashing-2839773-2025-12-22",
      "headline": "No veneer, whitewashing: Priyanka Chaturvedi endorses Dhurandhar as new age cinema Shiv Sena MP Priyanka Chaturvedi reviewed Dhurandhar and called it fearless new-age cinema. She compared Aditya Dhar's film with Chhaava -- both featuring Akshaye Khanna."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/drishyam-3-release-date-october-2-2026-ajay-devgn-family-thriller-2839758-2025-12-22",
      "headline": "Ajay Devgn's Drishyam 3 release date out: Aakhri hissa baaki hai, watch promo The makers of Drishyam 3 have announced the film's release date. Starring Ajay Devgn, Tabu, Shriya Saran, and Rajat Kapoor, shooting of the film is underway across multiple cities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-remembers-mother-teji-bachchan-on-18th-death-anniversary-2839756-2025-12-22",
      "headline": "Big B remembers mother Teji Bachchan on 18th death anniversary: Din samarpit Amitabh Bachchan remembered his late mother Teji Bachchan on her 18th death anniversary with an emotional blog post, saying there were no words left, only prayers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/did-prabhas-the-raja-saab-land-the-highest-non-theatrical-deal-producer-clarifies-2839748-2025-12-22",
      "headline": "Did Prabhas' The Raja Saab land the highest non-theatrical deal? Producer clarifies Amid speculation around The Raja Saab's non-theatrical business, the producer has said that the upcoming film has secured the highest value available."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/arjun-rampal-plays-dhurandhar-fa9la-at-gurugram-club-turns-dj-as-crowd-goes-wild-2839742-2025-12-22",
      "headline": "Arjun Rampal plays Dhurandhar's FA9LA at Gurugram club, turns DJ as crowd goes wild Arjun Rampal played a remix of FA9LA from the film Dhurandhar during a DJ set at a Gurugram club, drawing cheers from the crowd. The video instantly went viral. Watch it inside."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/misinformation-being-spread-on-aravalli-mining-govt-taking-ecology-economy-together-says-minister-amid-row-2839903-2025-12-22",
      "headline": "Aravalli mining row: Minister says misinformation spread, ecology not ignoredUnion Minister Bhupender Yadav on Tuesday said misinformation was being spread about the Supreme Court's decision on the Aravalli range, asserting that the government has consistently promoted the protection of the country's oldest mountain range."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/bangladesh-student-leader-motaleb-shikder-shot-in-head-during-violent-protests-over-osman-hadis-killing-2839782-2025-12-22",
      "headline": "Bangladesh student leader shot in head during violent protests over Hadi's killingThe shooting of NCP labour leader Md Motaleb Sikder follows the killing of student leader Sharif Osman Hadi, whose death sparked protests and heightened concerns over Bangladesh's law and order."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/yogi-adityanath-mocks-akhilesh-rahul-cough-syrup-racket-up-2839837-2025-12-22",
      "headline": "Yogi Adityanath's 'do namune' jab, Akhilesh Yadav turns the taunt aroundAkhilesh Yadav countered Yogi Adityanath's jibe about \"'do namune' sitting in Delhi and Lucknow\" by terming it an own goal that exposed the rift within the BJP."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/kerala/story/are-you-bangladeshi-mob-asks-before-kerala-lynching-dalit-family-seeks-sc-st-act-chhattisgarh-2839704-2025-12-22",
      "headline": "Are you Bangladeshi: Video shows mob confronting Dalit man in Kerala lynchingA video of the Palakkad lynching shows men interrogating a migrant labourer, slapping him and asking if he was Bangladeshi. Police said the assault followed theft allegations. The family refused the body, seeking SC/ST Act charges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/aravalli-is-25-billion-year-old-why-its-a-time-keeper-of-earths-ancient-history-2839853-2025-12-22",
      "headline": "Do you know how old the Aravalli range is? It's older than dinosaursFor Delhi, the Aravallis act as the city's \"lungs,\" filtering air pollution, moderating urban heat, and recharging groundwater via seasonal streams. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/nitish-kumar-hijab-controversy-row-samajwadi-party-leader-sumaiya-rana-refuses-pak-tv-interview-over-hijab-row-2839881-2025-12-22",
      "headline": "Ghar ki baat: Samajwadi Party leader refuses Pak TV interview over hijab rowFollowing a row over Bihar Chief Minister Nitish Kumar allegedly pulling down a Muslim woman's hijab, Samajwadi Party leader Sumaiya Rana declined an interview with a Pakistani news channel. She said Indians live in peace and can resolve issues internally, without foreign interference."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/indians-in-new-zealand-protest-against-sikh-procession-nagar-kirtan-nanaksar-gurudwara-manurewa-auckland-haka-dance-2839751-2025-12-22",
      "headline": "This isn't India: New Zealand far-right group performs Haka against SikhsA Sikh religious procession in Auckland had to pause when a far-right group blocked it with a Haka display. The Sikhs, including Nihangs, did not react to the protests. Community leaders have expressed concern, noting this was the third big anti-immigrant incident in New Zealand this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhurandhar-box-office-collection-day-17-ranveer-singh-film-crosses-rs-800-crore-worldwide-2839596-2025-12-22",
      "headline": "Dhurandhar box office day 17: Ranveer beats Ranbir's Animal, enters all-time top 10'Dhurandhar', starring Ranveer Singh, has entered the all-time top 10 Indian films and crossed the box office collection of Ranbir Kapoor's film 'Animal'. Its robust box office performance is despite facing competition from major releases such as 'Avatar: Fire & Ash'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/winter-desert-saudi-arabia-turns-white-nation-snowfall-climate-change-global-warming-global-weather-uae-2839703-2025-12-22",
      "headline": "Why is Saudi Arabia witnessing rare snowfall? Science explainedThe unusual episode once again underlined how climate change is harbouring unusual weather in regions that are far from prepared to handle it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/aravalli-hills-controversy-explained-supreme-court-definition-political-reactions-activists-ecology-mining-2839750-2025-12-22",
      "headline": "Decoded: The Aravalli Hills controversy and what's at stakeThe Supreme Court introduced a new height-based definition for the Aravalli Hills, triggering widespread concern about ecological risks. Environmentalists and opposition leaders warn this may lead to increased mining and irreversible damage to the region's fragile ecosystem."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/culprits-death-term-will-give-us-peace-brother-of-hindu-man-lynched-in-bangladesh-2839842-2025-12-22",
      "headline": "What brother of Hindu man killed in Bangladesh said on blasphemy allegationsIn an Exclusive Interview with India Today, Apu Das, the brother of the Hindu man Dipu Das, who was brutally killed in Bangladesh, has demanded the death penalty for those involved in the killing of his brother. Read this India Today's Exclusive interview ..."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/bangladesh-hindu-man-dipu-chandra-das-lynching-shocking-details-colleagues-handed-him-over-to-islamists-2839729-2025-12-22",
      "headline": "Bangladesh lynching shocker: Hindu man's co-workers joined Islamist mob to kill himJust a timely call could have saved the life of 27-year-old Hindu man Dipu Chandra Das, who was lynched by Islamists in Bangladesh. Investigators and reports have revealed that Das was forced to resign by his factory colleagues and handed over to the mob that broke into the factory to drag him out. He was brutally beaten to death and his body was set on fire."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/no-workout-no-crash-diets-how-discipline-helped-me-lose-21-kilos-in-10-months-2839725-2025-12-22",
      "headline": "No workout, no crash diets: How discipline helped me lose 21 kilos in 10 monthsI didn't wait for a Monday or a New Year's resolution. I started anyway and lost 21 kilos in 10 months. Here's what worked for me and might help you too."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/chhattisgarh/story/sorry-mummy-papa-engineering-student-dies-by-suicide-cites-exam-stress-in-note-chhattisgarh-raigarh-2839610-2025-12-22",
      "headline": "Sorry mummy, papa: Engineering student dies by suicide, cites exam stress in notePolice said a suicide note recovered from the room states that the student felt she could not meet her parents' expectations and was distressed about her academic performance and financial burden on the family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-under-19-cricket-team-asia-cup-victory-india-celebrated-islamabad-2839826-2025-12-22",
      "headline": "Party in Islamabad as fans celebrate U19 Asia Cup win like World Cup triumphU19 Asia Cup IND vs PAK: Fans in Islamabad braved the winter chill to turn up at the airport early on Monday morning and cheer on the Under-19 Asia Cup-winning team. Pakistan had defeated India in the final in Dubai on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/newsmo-the-tribe-that-lives-by-sunlight-inside-the-hidden-world-of-keralas-isolated-cholanaikkans-2838761-2025-12-19",
      "headline": "Hidden world of Cholanaikkans, isolated Kerala tribe that lives by sunlightEntry into their habitat is restricted, and interactions with the outside world are carefully mediated by government authorities to protect a fragile culture that could be irreversibly altered by sustained contact."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/the-beckham-feud-david-victoria-brooklyn-and-a-family-soap-in-the-making-2839808-2025-12-22",
      "headline": "Palace fight is passe. Beckham family feud is all the talkThe reported Beckham family feud has unfolded over time and come into the open only recently. Here's a timeline, from wedding tensions and missed birthdays to family dos, which pointed to a growing rift all along."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-asim-munir-afghan-taliban-ttp-glbs-2839584-2025-12-22",
      "headline": "We felt it: Asim Munir claims 'divine help' during Op Sindoor, warns TalibanWhile addressing the National Ulema Conference in Islamabad, Asim Munir claimed \"divine help\" during Operation Sindoor and urged Afghanistan's Taliban to choose between backing the TTP or maintaining ties with Islamabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/arjun-rampal-plays-dhurandhar-fa9la-at-gurugram-club-turns-dj-as-crowd-goes-wild-2839742-2025-12-22",
      "headline": "Arjun Rampal turns DJ, plays Dhurandhar's FA9LA at Gurugram club, crowd goes wildArjun Rampal played a remix of FA9LA from the film Dhurandhar during a DJ set at a Gurugram club, drawing cheers from the crowd. The video instantly went viral. Watch it inside."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/black-garlic-health-benefits-sweet-jelly-texture-2839798-2025-12-22",
      "headline": "Ever tried black garlic? It's sweet, jelly-like and full of health benefitsIf you've ever chewed raw garlic, the flavour of black garlic may come as a pleasant surprise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/is-silent-resignation-becoming-the-new-normal-for-indias-gen-z-2839403-2025-12-21",
      "headline": "Why is India's Gen Z quietly quitting without resigning?The Gen Z in India is redefining disengagement not by walking out of offices, but by emotionally checking out while remaining on payrolls. Resignations are scanty and this absence is masking a deeper crisis brewing inside workplaces."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/which-country-is-best-at-math-global-rankings-and-indias-position-2839757-2025-12-22",
      "headline": "Which country is best at Maths? A look at global rankings and India's positionCountries from Southeast Asia are dominating the global maths rankings, from Singapore to Vietnam and Taiwan. What factors are driving this success? And where does India stand in the list? Know everything here."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/indians-in-america-visa-updates-news-why-american-tech-companies-h1b-visa-holders-not-to-leave-us-trump-executive-order-2839772-2025-12-22",
      "headline": "H-1B staffers shouldn't leave US: What's behind Apple, Google, Microsoft email?An increase in the H-1B visa application fee and stricter social media vetting prompted several US tech companies to ask employees to remain in the country or return to the US immediately. The move was triggered by lack of clarity on new provisions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/learn-hindi-or-leave-bjp-councillor-filmed-threatening-african-man-in-delhi-park-2839822-2025-12-22",
      "headline": "Learn Hindi or leave: BJP councillor filmed threatening African man in Delhi parkA BJP councillor in Delhi has sparked controversy by threatening an African football coach to learn Hindi within a month or leave the city. The incident has ignited widespread debate on language, identity, and intolerance in public spaces."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mitchell-starc-icc-uniform-drs-ashes-2025-controversy-2839915-2025-12-22",
      "headline": "After Ashes snicko controversy, Mitchell Starc tells ICC to pay for uniform DRS system Mitchell Starc has called for the ICC to fund for a uniform DRS system in international cricket after controversy erupted during the Ashes 2025 series during the Adelaide Test. The match saw multiple instances where the snicko failed to give the correct decision. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-jemimah-rodrigues-praises-trolls-india-sri-lanka-2839872-2025-12-22",
      "headline": "Crazy biceps: Jemimah subtly hits back at Mandhana's trolls after landmark T20I IND vs SL, 1st Women's T20I: Jemimah Rodrigues congratulated Smriti Mandhana on reaching 4000 T20I runs while subtly responding to trolls commenting on the left-handed batter's appearance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/reporters-diary-of-lionel-messis-india-tour-delhi-leg-2839850-2025-12-22",
      "headline": "Spanish chants, VIP boos and Ronaldo fan jibes: Reporter's diary from Lionel Messi tour The Delhi leg of Lionel Messi's India tour had it all, from passionate fans to celebrity sightings. Here's a reporter's firsthand account of the third and final instalment of Messi's historic tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-trolls-england-ashes-series-defeat-in-australia-2839834-2025-12-22",
      "headline": "Rohit Sharma joins the Aussies, trolls England after Ashes humiliation Rohit Sharma trolled England following their Ashes series loss in Australia. England lost the third Test in Adelaide by 82 runs, which resulted in fourth successive Ashes series loss in Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/paula-badosa-praises-shrivalli-bhamidipaty-india-tennis-rising-star-2839833-2025-12-22",
      "headline": "Paula Badosa identifies India's future tennis star, praises her serve and aggression Spanish star Paula Badosa praised India's rising tennis talent Shrivalli Bhamidipaty for her powerful serve and aggressive game. Badosa and Bhamidipaty are teammates for AOS Eagles in the World Tennis League. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-under-19-cricket-team-asia-cup-victory-india-celebrated-islamabad-2839826-2025-12-22",
      "headline": "Party in Islamabad as fans celebrate U19 Asia Cup win like World Cup triumph U19 Asia Cup IND vs PAK: Fans in Islamabad braved the winter chill to turn up at the airport early on Monday morning and cheer on the Under-19 Asia Cup-winning team. Pakistan had defeated India in the final in Dubai on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/punjab-kings-cooper-connolly-ipl-2026-debut-maxwell-comparisons-2839828-2025-12-22",
      "headline": "Punjab Kings' Cooper Connolly embraces Glenn Maxwell comparisons with caution Punjab Kings' recruit Cooper Connolly has welcomed comparisons with Australian all-rounder Glenn Maxwell, calling them a compliment while acknowledging the gap between himself and the world-class star."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/punjab-vijay-hazare-trophy-squad-shubman-gill-abhishek-sharma-arshdeep-singh-2839816-2025-12-22",
      "headline": "Shubman Gill, Abhishek and Arshdeep named in Punjab's Vijay Hazare Trophy squad Punjab announces 18-member squad for the upcoming Vijay Hazare Trophy, featuring big guns Shubman Gill, Abhishek Sharma, and Arshdeep Singh, gearing up for their season opener against Maharashtra on December 24."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yuzvendra-chahal-luxury-car-purchase-absence-parents-2839813-2025-12-22",
      "headline": "Milestone with luxury: Yuzvendra Chahal welcomes brand-new BMW with proud parents Yuzvendra Chahal marked a personal milestone by buying a new luxury BMW car and sharing the moment with his parents, even as illness keeps him sidelined from cricket while he gears up for IPL 2025 with Punjab Kings."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-ashes-defeat-australia-nasser-hussain-bazball-impact-2839795-2025-12-22",
      "headline": "Bazball for nothing? Nasser Hussain questions England branding after Ashes defeat Nasser Hussain reckons that despite the Bazball rebranding, England's showing against Australia in the Ashes has ultimately proved \"no different\" from past drubbings away from home."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nz-vs-wi-jacob-duffy-breaks-richard-hadlee-record-new-zealand-west-indies-2839774-2025-12-22",
      "headline": "Jacob Duffy shatters Richard Hadlee's 40-year record after series win vs West Indies Jacob Duffy broke Sir Richard Hadlee's 40-year-old record after New Zealand's win over West Indies in the third Test. Duffy took his third five-wicket haul to guide New Zealand to a 323-run victory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shakib-al-hasan-mi-emirates-ilt20-winning-streak-desert-vipers-2839777-2025-12-22",
      "headline": "Not Finished: MI Emirates' Shakib Al Hasan sinks Desert Vipers in ILT20Shakib Al Hasan starred with bat and ball to power MI Emirates to a four-wicket ILT20 win over Desert Vipers, even as the 38-year-old fuels speculation about a final international return for Bangladesh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-autograph-net-bowler-iphone-alibaug-vijay-hazare-trophy-2839759-2025-12-22",
      "headline": "Autograph on iPhone: Virat Kohli makes net bowler's day in Alibaug training sessionA young fast bowler from Jharkhand, who bowled to Virat Kohli during a three-day training session in Alibaug, shared photographs he clicked with the legendary batter. The youngster also posted a picture of his autographed iPhone."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/stuart-broad-backs-worst-australian-side-since-2010-remark-england-ashes-loss-2839754-2025-12-22",
      "headline": "Defiant Broad sticks to 'worst Australian side since 2010' swipe despite Ashes lossStuart Broad has refused to backtrack on his pre-Ashes assessment, insisting he has \"no regrets\" about branding this Australia side the worst since 2010 despite England losing all three completed Tests of the five-match series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aaqib-javed-on-pakistan-learning-from-india-to-revive-their-cricket-2839749-2025-12-22",
      "headline": "Pakistan learning from India? Ex-coach hints at analysing India's success modelPakistan is closely monitoring India's limited-overs cricket success to revive its fortunes. The focus is on grassroots talent and infrastructure ahead of the T20 World Cup 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/bruno-fernandes-injury-blow-hits-manchester-united-premier-league-festive-fixtures-2839735-2025-12-22",
      "headline": "Manchester United dealt major blow as Bruno Fernandes faces extended injury absenceManchester United captain Bruno Fernandes is expected to miss upcoming Premier League fixtures after sustaining a hamstring injury during the defeat to Aston Villa, further compounding the club's injury problems."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-finalises-t20-world-cup-squad-ishan-kishan-return-shubman-gill-omitted-2839718-2025-12-22",
      "headline": "I was shocked: Former captain says he didn't expect India to drop Shubman GillFormer India captain Kris Srikkanth said he didn't expect the selectors to drop Shubman Gill from the T20 World Cup squad. The ex-chairman of selectors gave Ajit Agarkar and his selection team credit for valuing domestic performances.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bazball-died-in-adelaide-australian-media-covered-englands-ashes-loss-2839710-2025-12-22",
      "headline": "Bazball died in Adelaide: How Australian media covered England's Ashes nightmareAustralia completed a dominant Ashes series victory over England with a 3-0 lead in the five-match series. Following their win, the Australian media mocked the England team by giving a twist to the historic Ashes obituary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nz-vs-wi-3rd-test-jacob-duffy-5-wickets-323-run-win-devon-conway-brandon-king-2839687-2025-12-22",
      "headline": "NZ vs WI: Jacob Duffy's 5-wicket haul sets up 2-0 series win for NZ with 323-run winNew Zealand beat West Indies by 323 runs in the third Test to claim the series 2-0. Jacob Duffy was adjudged Player of the Match for taking his third five-wicket haul."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-form-struggles-optimism-t20-world-cup-2839671-2025-12-22",
      "headline": "The day I blast…: Surya's speech on poor form at Ahmedabad university goes viralBacked despite lean returns, Suryakumar Yadav reiterated his acknowledgement of a dip in T20I form in 2025. The India captain will be under pressure as he prepares the team for the T20 World Cup, starting February 7."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/suzie-bates-injury-quadriceps-tear-sidelines-new-zealand-opener-three-months-2839658-2025-12-22",
      "headline": "New Zealand's Suzie Bates ruled out for three months due to quadriceps injuryNew Zealand opener Suzie Bates will miss the remainder of the domestic season and upcoming White Ferns series due to a quadriceps injury. She is determined to recover in time for the South Africa tour, aiming to return strong despite the setback."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/what-shubman-gill-can-learn-from-rohit-sharma-about-world-cup-omission-2839639-2025-12-22",
      "headline": "A snub that stings: What Shubman Gill can learn from Rohit SharmaSeen as India's future across formats as recently as a few months ago, Shubman Gill now faces a rare pause. His T20 World Cup omission hurts, but history suggests setbacks shape leaders more than seamless ascents ever do."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/michael-vaughan-england-ashes-defeat-criticism-cockiness-bazball-australia-2839608-2025-12-22",
      "headline": "England's cockiness cost the Ashes, Australia are laughing at them: VaughanFormer captain Michael Vaughan has strongly criticised England's approach following their another Ashes series loss in Australia. England's defeat in Adelaide, resulting in a 0-3 deficit, has intensified scrutiny over the team's attitude and preparation, with Vaughan calling the outcome 'humbling.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaishnavi-sharma-harmanpreet-kaur-after-debut-heroics-vs-sri-lanka-2839597-2025-12-22",
      "headline": "Vaishnavi Sharma credits captain Harmanpreet after debut heroics vs Sri LankaIND-W vs SL-W: Vaishnavi Sharma impressed on her international debut with a disciplined four-over spell, helping India restrict Sri Lanka to 121/6. Sharma praised captain Harmanpreet Kaur's leadership, highlighting her influence both before and during the match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bazball-pronounced-dead-can-england-afford-to-sack-brendon-mccullum-2839583-2025-12-22",
      "headline": "With Bazball now pronounced dead, can England afford to sack Brendon McCullum?Australia's demolition of England has exposed the limits of Bazball and left the ECB facing a stark choice: evolve with McCullum, or risk another identity crisis by sacking him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jemimah-rodrigues-india-no-3-t20-world-cup-ind-vs-sl-2839581-2025-12-22",
      "headline": "IND vs SL: Why waste good form? Jemimah Rodrigues making India's No.3 her ownJemimah Rodrigues laid down the marker and proved why she is India's No.3 for the long haul as they defeated Sri Lanka in the first T20I on Sunday, December 21. With the T20 World Cup coming up, the 25-year-old is ready to make the spot her own and be a vital part of the Indian team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-women-vs-sri-lanka-1st-t20i-match-report-vizag-2839562-2025-12-21",
      "headline": "IND vs SL: No World Cup hangover as India thrash Sri Lanka in 1st T20IThe Indian women's team put on a dominant performance to thrash Sri Lanka by eight wickets to start the T20I series with a win in Vizag on Sunday, December 21. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-4000-runs-womens-t20i-record-india-vs-sri-lanka-2839558-2025-12-21",
      "headline": "IND vs SL: Smriti Mandhana hits new milestone after return to actionSmriti Mandhana crossed a new milestone as she became the second player in women's T20Is to get to the 4,000-run mark during the first match of the series between India and Sri Lanka. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-considered-retirement-2023-world-cup-final-loss-2839542-2025-12-21",
      "headline": "Rohit Sharma contemplated retirement after 2023 World Cup: Felt I had nothing leftFormer India captain Rohit Sharma revealed that he considered retirement after the loss to Australia in the final of the 2023 World Cup. India stumbled at the final hurdle with the Aussies securing a comfortable win. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kolkata-knight-riders-secure-cameron-green-rs-25-20-crores-ipl-2026-auction-2839516-2025-12-21",
      "headline": "Green is the future: Why KKR went big for all-rounder in IPL 2026 auctionKolkata Knight Riders head coach Abhishek Nayar details the strategic acquisition of Australian all-rounder Cameron Green at the IPL 2026 auction, highlighting the franchise's intent to strengthen its top order and fill the gap left by Andre Russell's departure."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}