{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mahindra-pidilite-dr-reddy-deny-conflict-interest-claims-involving-sebi-chairperson-madhavi-buch-husband-dhaval-buch-2597403-2024-09-10",
      "headline": "Mahindra, Pidilite, Dr Reddy's refute conflict allegations involving Dhaval BuchMahindra & Mahindra, Dr. Reddy's Laboratories, and Pidilite Industries have refuted Congress's allegations of conflict of interest involving SEBI Chairperson Madhabi Puri Buch's husband. The companies clarified their engagements with Dhaval Buch were based on his expertise and predate her SEBI tenure.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-toll-rules-pay-only-for-distance-covered-no-charges-for-first-20-km-gnss-2597322-2024-09-10",
      "headline": "New toll rules: Pay only for distance covered, no charges for first 20 kmThe new toll rules are part of the revised National Highways Fee Rules, 2024, which now focus on a pay-as-you-go system based on the distance you travel beyond the initial 20 km."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-ipo-day-2-latest-subscription-booked-8x-expected-listing-gains-2597288-2024-09-10",
      "headline": "Bajaj Housing Finance IPO booked 8x on Day 2. Check expected listing gainsBajaj Housing Finance is offering its shares in the price range of Rs 66-70 each. Investors can apply for a minimum of 214 shares and in multiples thereafter. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mutual-fund-assets-hit-record-rs-66-lakh-crore-in-august-amfi-data-sip-2597259-2024-09-10",
      "headline": "Mutual fund assets hit record Rs 66 lakh crore in AugustData from the Association for Mutual Funds in India (AMFI) shows that inflows into equity mutual funds rose by 3% in August, reaching Rs 38,239 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/noida-property-prices-all-time-high-circle-rate-hike-proposal-homebuyers-plight-2597254-2024-09-10",
      "headline": "Noida's housing dream fades as proposed rate hike pushes homes out of reachNoida's once-affordable housing dream is slipping away as soaring property prices and a proposed circle rate hike threaten to push homeownership further out of reach for the urban middle class."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-end-higher-driven-by-rally-in-it-pharma-stocks-2597181-2024-09-10",
      "headline": "Sensex, Nifty end higher driven by rally in IT and pharma stocks The S&P BSE Sensex added 361.75 points to end at 81,921.29, while the NSE Nifty50 gained 104.70 points to close at 25,041.10."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-election-trump-kamala-harris-risk-looms-over-wall-street-but-there-are-bigger-threats-federal-reserve-rate-2597159-2024-09-10",
      "headline": "US election risk looms over Wall Street, but there are bigger threatsRight now, Wall Street is facing some uncertain moments as investors keep a close eye on the US stock rally, with the presidential election and other big economic factors coming into play."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/mahindra-group-denies-conflict-of-interest-allegations-regarding-payments-to-dhaval-buch-2597155-2024-09-10",
      "headline": "Mahindra Group rejects conflict of interest claims over payments to Dhaval BuchIn a stock exchange filing, the Mahindra Group has clarified that Dhaval Buch was hired for his supply chain expertise, unrelated to the Sebi approvals cited by the Congress party. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/swiggy-ipo-plans-to-raise-rs-5000-crore-through-fresh-issue-2597106-2024-09-10",
      "headline": "Swiggy plans to raise Rs 5,000 crore in upcoming IPO through fresh issueThe Bengaluru-based firm had earlier planned to raise Rs 3,750 crore through fresh issue, along with an additional Rs 6,664 crore offer for sale."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-housing-finance-ipo-subscription-4x-expected-listing-gain-gmp-close-to-100-percent-2597080-2024-09-10",
      "headline": "Bajaj Housing Finance IPO subscribed over 4x, GMP nears 100%Bajaj Housing Finance has demonstrated impressive growth, with a compound annual growth rate (CAGR) of 30.9% in AUM from Fiscal 2022 to 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jupiter-wagons-stock-price-down-correction-good-buying-opportunity-2597061-2024-09-10",
      "headline": "Jupiter Wagons stock down 12% in a month. Is it a buying opportunity?On Tuesday, the stock extended its losses, dropping to a day's low of Rs 490. At 1:22 pm, shares of Jupiter Wagons were trading 1.24% lower at Rs 502.45."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/p-n-gadgil-jewellers-ipo-opens-review-good-bad-subscribe-skip-expert-view-gmp-2597060-2024-09-10",
      "headline": "P N Gadgil Jewellers IPO opens: Should you subscribe or skip?P N Gadgil Jewellers IPO is a book-built issue which includes a fresh issue of 1.77 crore shares, amounting to Rs 850 crore, and an offer for sale of 52 lakh shares, totalling Rs 250 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-power-share-price-gains-today-solar-power-cell-production-explained-2597031-2024-09-10",
      "headline": "Explained: Why Tata Power shares soared over 5% today Tata Power shares jumped after the company's subsidiary, TP Solar, began commercial production of solar cells at its new plant in Tirunelveli, Tamil Nadu."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/suzlon-energy-share-price-up-5-percent-bull-run-key-triggers-analyst-view-2597004-2024-09-10",
      "headline": "Suzlon Energy shares up 5%. Will positive momentum continue? Suzlon Energy shares were up nearly 5% after the company announced a major 1.17 GW order win from NTPC Green Energy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gautam-adanis-usd-185-billion-airport-deal-in-kenya-nairobi-jomo-kenyatta-hits-legal-roadblock-2596992-2024-09-10",
      "headline": " Gautam Adani's $1.85 billion airport deal in Kenya hits legal roadblockThe deal faced opposition from various groups in Kenya, with a key legal challenge filed by the Kenya Human Rights Commission and the Law Society of Kenya"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-share-price-surges-stock-trend-expert-view-2596958-2024-09-10",
      "headline": "Explained: Why Paytm shares jumped 9% in early tradeIn the past week, Paytm's share price has risen by more than 13%, and in the last month, it has gone up by over 30%. Over the last three months, Paytm's stock has jumped by more than 74%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-india-join-hands-to-expand-semiconductor-industry-chips-act-itsi-all-you-need-to-know-2596941-2024-09-10",
      "headline": "US, India join hands to expand semiconductor industry. All you need to know The US Department of State will collaborate with the India Semiconductor Mission, under India's Ministry of Electronics and IT, to explore ways to grow and diversify the semiconductor ecosystem."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musk-worlds-first-trillionaire-gautam-adani-second-in-line-dubai-based-informa-connect-academy-2596928-2024-09-10",
      "headline": "Elon Musk set to be world's 1st trillionaire, second could be an IndianTesla CEO Elon Musk is set to become the world's first trillionaire, with an Indian business tycoon close behind."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-sensex-nifty-open-marginally-higher-on-positive-global-cues-paytm-up-9-percent-2596922-2024-09-10",
      "headline": "Sensex, Nifty open marginally higher on positive global cues; Paytm up 9%The S&P BSE Sensex was down 47.27 points to 81,512.27, while the NSE Nifty50 shed 18.70 points to 24,917.70. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/wazirx-security-partner-liminal-company-cyberattack-security-breach-audit-findings-2596809-2024-09-09",
      "headline": "Crypto firm WazirX's security partner says no evidence of cyberattack on its systemThe cyberattack on crypto exchange WazirX in July, that led to a loss of about Rs 2,000 crore in digital assets, had originated from their end, according to its security partner and digital asset custody company, Liminal Custody."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-in-us-bharat-jodo-nyay-yatra-congress-bjp-democracy-2597510-2024-09-11",
      "headline": "Forced to take out Yatra due to non-functioning democracy: Rahul Gandhi in USThe Leader of the Opposition in the Lok Sabha, in his remarks, suggested that the Yatra was a response to what he perceived as the non-functioning of democratic processes in the country. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/omar-abdullah-exclusive-jammu-and-kashmir-election-full-statehood-restoration-supreme-court-2597499-2024-09-11",
      "headline": "Will knock Supreme Court's door if J&K's statehood not restored: Omar AbdullahSpeaking exclusively to India Today TV, National Conference Omar Abdullah said while restoring Article 370 may be a longer struggle, the demand for statehood can be served through a resolution by the Jammu and Kashmir Assembly."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rg-kar-medical-college-and-hospital-rape-murder-principal-sandip-ghosh-molestation-of-nurse-student-hong-kong-2017-2596994-2024-09-10",
      "headline": "RG Kar's Sandip Ghosh faced molestation case in Hong KongSandip Ghosh, who is in the eye of the storm after the RG Kar rape-murder case, was accused of molesting a male nursing student in Hong Kong in 2017. Ghosh, who is now under CBI probe, was in Hong Kong under an exchange programme, and cleared in the case by a court."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/babita-phogat-bjp-vinesh-phogat-congress-haryana-election-bhupinder-hooda-2597312-2024-09-10",
      "headline": "Babita Phogat on cousin Vinesh joining Congress: Bhupinder Hooda created riftBabita Phogat, who is a BJP leader, said her cousin Vinesh Phogat took a hasty decision when she joined the Congress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-election-2024/story/five-most-memorable-moments-of-presidential-debate-since-1960-us-presidential-polls-2597324-2024-09-11",
      "headline": "Kennedy vs Nixon to Bush vs Gore: Iconic US Presidential debatesUS presidential debates have historically been significant, shaping public perceptions. Notable examples include Kennedy vs. Nixon (1960), where Kennedy's polished appearance outshone Nixon. These debates have often played a key role in influencing election outcomes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tejashwi-yadav-nitish-kumar-bihar-alliance-assembly-elections-rjd-jdu-2597315-2024-09-10",
      "headline": "Nitish Kumar came with folded hands, won't make mistake again: Tejashwi YadavTejashwi Yadav took aim at Nitish Kumar, claiming that his political relevance is over and vowing not to support him again as Bihar gears up for the 2025 Assembly polls."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/tyreek-hill-arrest-miami-police-releases-video-of-dolphins-stars-detention-2597269-2024-09-10",
      "headline": "Video: Cops drag NFL star Tyreek Hill out of sports car, force him onto groundNewly released body cam footage shows Miami Dolphins star Tyreek Hill in a heated confrontation with police, following a traffic stop that quickly escalated."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bengal-protesting-doctors-kolkata-rape-murder-rg-kar-hospital-mamata-banerjee-supreme-court-order-2597370-2024-09-10",
      "headline": "Bengal seeks talks with doctors after they defy court's return-to-work deadlineA delegation of 10 doctors was invited by the West Bengal government for a discussion amid the ongoing protests against the rape and murder of a trainee doctor at the RG Kar hospital in Kolkata."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/what-goes-into-petrichor-perfume-baked-earth-and-bacteria-geosmin-for-mitti-ki-khushboo-in-a-bottle-2597139-2024-09-10",
      "headline": "The making of petrichor perfume: Baked earth and bacteria for mitti ki khushbooFor centuries, perfumers in Kannauj – known as the perfume capital of India – have been making mitti attars, capturing that smell of the season's first rain in little bottles, long before the term petrichor and international perfumes popularised this earthy fragrance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/democrat-kamala-harris-republican-doanld-trump-first-presidential-debate-of-2024-rules-date-time-where-to-watch-all-you-need-to-know-2597169-2024-09-10",
      "headline": "Donald Trump-Kamala Harris 2024 US election debate: All you need to knowKamala Harris and Donald Trump will face off in their first presidential debate Wednesday morning India time. The debate will be moderated by David Muir and Linsey Davis and will cover various topics. The 90-minute debate will take place at the National Constitution Center in Philadelphia, Pennsylvania, a key swing state."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maharashtra-assembly-polls-mahayuti-alliance-rift-eknath-shinde-ajit-pawar-maha-vikas-aghadi-2597408-2024-09-10",
      "headline": "Will Mahayuti partners get equal seats? What Eknath Shinde saidMaharashtra Chief Minister Eknath Shinde has dismissed rumours of discord within the Mahayuti alliance, asserting that all partners will receive equal importance in the upcoming Assembly polls."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-us-remarks-on-sikhs-wear-turban-controversy-gurudwara-kripan-religious-freedom-narendra-modi-hardeep-puri-2597094-2024-09-10",
      "headline": "Will a Sikh be allowed to wear turban in India? Now, where did this come from?Sikhs proudly wear the dastar (turban) and kara (steel bangle) in India. They are also allowed to carry a kirpan (sacred dagger) in domestic flights, while even plastic toy knives are confiscated at airports. So, where did Congress leader Rahul Gandhi's remarks on Sikh rights come from?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/qaidi-number-804-imran-khan-pti-challenging-pakistani-army-establishment-protests-islamabad-jalsa-2597290-2024-09-10",
      "headline": "Qaidi Number 804 is challenging Pakistani establishment. Who is he?There is a prisoner who is challenging the Pakistani establishment from behind bars. Imran Khan's supporters are celebrating him as 'Qaidi Number 804' as they believe he has been jailed for taking on the all-powerful military of Pakistan. From songs to shoes to chants during T20 matches, 'Qaidi Number 804' is everywhere in Pakistan.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/features/story/not-much-new-iphone-16-launch-event-was-all-about-apple-creating-new-vision-for-its-products-2597309-2024-09-10",
      "headline": "iPhone 16 event was all about Apple creating new vision for its productsApple's new products look similar to what the company is selling for the last few years. But look closer and in the iPhone 16 phones and the Watch Series 10 you may see signs of a new vision that Apple aims to pursue in the coming years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/narayana-murthy-does-not-believe-in-coaching-classes-says-wrong-way-to-help-children-2597092-2024-09-10",
      "headline": "Narayana Murthy criticises coaching classes, says wrong way to help childrenInfosys co-founder NR Narayana Murthy has expressed his disapproval of coaching classes, stating that they are an inappropriate method for assisting children in passing examinations and that he does not support their use."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sebi-chief-madhabi-buch-earned-crores-mahindra-icici-dr-reddys-via-agora-congress-2597084-2024-09-10",
      "headline": "Mahindra clarifies after Congress's 'payments to Sebi chief's husband' chargeMahindra, in a statement, said Dhaval Buch, who joined the company in 2019, was hired solely for his expertise in supply chain management. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/best-time-to-buy-car-oems-dole-out-handsome-offers-amid-inventory-pile-up-2597329-2024-09-10",
      "headline": "Best time to buy car? OEMs dole out handsome offers amid inventory pile upCarmakers are providing not only cash discounts on their vehicles but also additional offers on accessories to boost sales."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/video/locals-in-andhras-guntur-grab-bottles-during-police-disposal-of-seized-alcohol-2596846-2024-09-10",
      "headline": "Video: Andhra cops line up liquor bottles for disposal, locals grab and run offLiquor enthusiasts in Andhra Pradesh's Guntur rushed to grab bottles of alcohol while police were destroying seized illicit liquor at a dumping yard on Etukuru Road."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/canada-news/story/canada-international-students-visa-approvals-projected-drop-halved-study-permit-applyboard-report-2597007-2024-09-10",
      "headline": "Canada's study visa approvals for Indian students to drop by 50% in 2024: ReportIndian students planning to study in Canada are likely to face a major challenge with approvals for study visas expected to drop by nearly 50% this year. A report by ApplyBoard cites stricter immigration policies and higher financial requirements as key reasons behind the decline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indian-air-force-inquiry-wing-commander-accused-rape-woman-flying-officer-jammu-kashmir-2597197-2024-09-10",
      "headline": "Air Force officer accuses Wing Commander at J&K station of rapeAccording to the complainant, the incident occurred on the night of December 31, 2023, during a New Year's party held at the Officers' mess after the officer allegedly sexually assaulted her in his room."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/jatindranath-mukherjee-bagha-jatin-tiger-of-bengal-revolutionary-threatened-british-raj-2597214-2024-09-10",
      "headline": "Jatindranath Mukherjee, the Tiger of Bengal who threatened the British RajAlmost a century ago, on this day, revolutionary Jatindranath Mukherjee succumbed to severe bullet injuries at Balasore in Odisha, following a gallant battle with the British police during the uprising against British rule."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/indian-origin-teen-agastya-goel-son-of-iit-jee-topper-toughest-programming-olympiad-2597325-2024-09-10",
      "headline": "Indian-origin teen, son of IIT-JEE topper, wins gold at toughest coding OlympiadIndian-origin teen Agastya Goel has won his second gold medal at the 36th International Olympiad in Informatics, the world's toughest programming contest, following in the footsteps of his 1990 IIT-JEE topper father Ashish Goel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/australia-social-media-kids-restrictions-ban-prime-minister-anthony-albanese-2597135-2024-09-10",
      "headline": "Australia plans social media minimum age limit, PM wants kids on footy fieldsThe minimum age for children to log into sites such as Facebook, Instagram, and TikTok has not been decided but is expected to be between 14 and 16 years, Australian Prime Minister said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/aap-reactions-slams-bjp-memorandum-dismiss-delhi-government-president-forwards-home-ministry-2597112-2024-09-10",
      "headline": "AAP fumes as President acts on BJP's demand to dismiss Delhi governmentAAP leaders lashed out at the BJP after its memorandum calling for the dismissal of the Delhi government was forwarded to the Union Home Ministry by President Droupadi Murmu."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/diljit-dosanjh-dil-luminati-tour-india-early-bird-tickets-sold-out-2597394-2024-09-10",
      "headline": "Diljit Dosanjh's Dil-Luminati India Tour early bird tickets sell out in minutesDiljit Dosanjh's Dil-luminati Tour is set to dazzle Indian fans after a successful run in Canada, the US, Australia, and New Zealand. The excitement is palpable as presale tickets sold out within minutes after going live."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/story/sony-entertainment-channel-shows-off-air-kbc-indias-best-dancer-continue-2597368-2024-09-10",
      "headline": "Aapka Apna Zakir, Kavya, other fiction shows on Sony TV to go off airAll Sony Entertainment Channel shows, including Aapka Apna Zakir, Kavya and Jubilee Talkies will be going off air in a few weeks. The channel will air India's Best Dancer, Kaun Banega Crorepati 16 and re-reuns of old shows."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/chunky-panday-passes-driving-test-after-43-years-celebrates-achievement-on-instagram-2597349-2024-09-10",
      "headline": "Chunky Panday passes driving test after 43 yearsChunky Panday shared a momentous achievement of his life on Instagram. The actor revealed that he passed his driving test after 43 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sohail-khan-reacts-to-dating-rumours-after-being-seen-with-mystery-woman-in-mumbai-2597321-2024-09-10",
      "headline": "Sohail Khan reacts to dating rumours after being seen with mystery woman in MumbaiActor Sohail Khan has addressed speculations about his love life after being seen with a mystery woman. He clarified that she is just an old friend and dismissed the dating rumours."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/nations-league-kevin-de-bruyne-slams-belgium-team-mates-after-loss-to-france-2597497-2024-09-10",
      "headline": "Kevin de Bruyne slams Belgium team-mates after loss to FranceBelgium captain Kevin De Bruyne slammed his teammates and questioned the manager's tactical decisions after his team's 2-0 loss to France in the Nations League."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-unsure-about-quinton-de-kocks-t20i-future-rob-walter-2597483-2024-09-10",
      "headline": "South Africa unsure about Quinton de Kock's T20I future: Rob WalterSouth Africa white-ball coach Rob Walter said they're unsure about Quinton de Kock's T20I future after he was omitted from the team for a second consecutive series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/neeraj-chopra-avinash-sable-to-compete-in-diamond-league-final-in-brussels-2597461-2024-09-10",
      "headline": "Neeraj Chopra, Avinash Sable to compete in Diamond League final in BrusselsAvinash Sable, the national record holder in the 3000m steeplechase, will compete in his first Diamond League Final in Brussels, joining star javelin thrower Neeraj Chopra in the season-ending event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-sri-lanka-third-test-ollie-pope-michael-vaughan-reaction-oval-2597462-2024-09-10",
      "headline": "England disrepected Test cricket during Oval loss to Sri Lanka: Michael VaughanMichael Vaughan slammed England and claimed that they disrespected Test cricket with their strategies in the Oval Test loss to Sri Lanka. England were slammed for being over-aggressive with their approach. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/litton-das-pakistan-series-india-test-challenge-sg-ball-2597455-2024-09-10",
      "headline": "Pakistan win is in the past: Litton wary of India's SG balls ahead of Test seriesIndia vs Bangladesh: Litton Das said their heroics against Pakistan are behind them and that they must now focus on the upcoming series against India. Bangladesh will travel to India on September 15 to play two Tests and three T20 Internationals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/video/glad-that-i-was-able-to-change-the-colour-of-the-medal-archer-harvinder-2597433-2024-09-10",
      "headline": "Glad that I was able to change the colour of the medal: Archer HarvinderArcher Harvinder Singh, who won gold in the Paris Paralympics said that he was glad to be able to change the colour of his medal. Harvinder had earlier won bronze in Tokyo Paralympics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/video/nishad-kumar-elated-with-tremendous-support-after-historic-paralympics-campaign-2597407-2024-09-10",
      "headline": "Nishad Kumar elated with tremendous support after historic Paralympics campaignHigh-jumper Nishad Kumar was welcomed with a rousing reception at the Delhi Airport on Tuesday, September 10. The silver medallist in the Paris Paralympics said that he was elated to see the kind support India offered during the Games."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/greater-noida-venue-future-match-referee-report-afghanistan-vs-new-zealand-2597404-2024-09-10",
      "headline": "AFG vs NZ may be Greater Noida's last international match, eyes on referee's reportThe international cricket match between Afghanistan and New Zealand at Greater Noida's Shaheed Vijay Singh Pathik Sports Complex may be the venue's last, subject to the match referee's report. Inadequate infrastructure and rain disruptions have raised concerns about the venue's future."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/badminton/story/hong-kong-open-chirag-sen-manav-choudhary-knocked-out-in-qualifiers-2597405-2024-09-10",
      "headline": "Hong Kong Open: Chirag Sen, Manav Choudhary knocked out in qualifiersIndia's Chirag Sen and Manav Choudhary were knocked out in the qualifiers of the Hong Kong Open on Tuesday, September 10. While Chirag was knocked out in the Round of 16 of his qualification round, Manav lost in the quarter-finals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-trolled-social-media-twitter-champions-cup-pakistan-2597393-2024-09-10",
      "headline": "Babar Azam trolled after failing in practice matchPakistan batter Babar Azam was trolled on social media by fans after failing to score big runs in a practice game. Babar, who has been going through a terrible patch of form got out trying to play a sweep shot against a left-arm spinner."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/cristiano-ronaldo-future-ballon-dor-winners-kylian-mbappe-lamine-yamal-jude-bellingham-erling-haaland-2597389-2024-09-10",
      "headline": "Mbappe, Yamal, Bellingham: Cristiano Ronaldo picks future Ballon d'Or winnersCristiano Ronaldo has picked Kylian Mbappe, Erling Haaland, Jude Bellingham and Lamine Yamal as future Ballon d'Or winners. Ronaldo is a five-time winner of the award. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/video/nishad-kumar-elated-with-tremendous-support-after-historic-paralympics-campaign-2597407-2024-09-10",
      "headline": "Nishad Kumar elated with tremendous support after historic Paralympics campaignHigh-jumper Nishad Kumar was welcomed with a rousing reception at the Delhi Airport on Tuesday, September 10. The silver medallist in the Paris Paralympics said that he was elated to see the kind support India offered during the Games."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/greater-noida-venue-future-match-referee-report-afghanistan-vs-new-zealand-2597404-2024-09-10",
      "headline": "AFG vs NZ may be Greater Noida's last international match, eyes on referee's reportThe international cricket match between Afghanistan and New Zealand at Greater Noida's Shaheed Vijay Singh Pathik Sports Complex may be the venue's last, subject to the match referee's report. Inadequate infrastructure and rain disruptions have raised concerns about the venue's future."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/badminton/story/hong-kong-open-chirag-sen-manav-choudhary-knocked-out-in-qualifiers-2597405-2024-09-10",
      "headline": "Hong Kong Open: Chirag Sen, Manav Choudhary knocked out in qualifiersIndia's Chirag Sen and Manav Choudhary were knocked out in the qualifiers of the Hong Kong Open on Tuesday, September 10. While Chirag was knocked out in the Round of 16 of his qualification round, Manav lost in the quarter-finals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-trolled-social-media-twitter-champions-cup-pakistan-2597393-2024-09-10",
      "headline": "Babar Azam trolled after failing in practice matchPakistan batter Babar Azam was trolled on social media by fans after failing to score big runs in a practice game. Babar, who has been going through a terrible patch of form got out trying to play a sweep shot against a left-arm spinner."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/cristiano-ronaldo-future-ballon-dor-winners-kylian-mbappe-lamine-yamal-jude-bellingham-erling-haaland-2597389-2024-09-10",
      "headline": "Mbappe, Yamal, Bellingham: Cristiano Ronaldo picks future Ballon d'Or winnersCristiano Ronaldo has picked Kylian Mbappe, Erling Haaland, Jude Bellingham and Lamine Yamal as future Ballon d'Or winners. Ronaldo is a five-time winner of the award. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-kl-rahul-vs-sarfaraz-khan-kris-srikkanth-2597374-2024-09-10",
      "headline": "I feel bad for Sarfaraz, but KL Rahul has done well in Tests: Kris SrikkanthIndia vs Bangladesh: Former opener and ex-chairman of the selection committee, Kris Srikkanth, backed the idea of KL Rahul playing at No. 5 ahead of young Sarfaraz Khan in the first Test against Bangladesh. Rahul returned to the Test squad after missing the second half of England series earlier in the year due to injury. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/young-indian-chess-players-great-at-grabbing-opportunities-viswanathan-anand-2597371-2024-09-10",
      "headline": "Young Indian chess players great at grabbing opportunities: Viswanathan AnandViswanathan Anand, transitioning from world champion to mentor, shares insights on India's chess prospects and his own future. He reflects on the rise of young talents and India's chances at the upcoming Chess Olympiad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-1st-test-mehidy-hasan-miraz-number-eight-all-rounder-2597351-2024-09-10",
      "headline": "Don't want to be best No.8, aim to bat higher: Mehidy Hasan MirazBangladesh's Mehidy Hasan Miraz has claimed that he doesn't want to be the best No.8 and bat higher up in the order. Mehidy was the star of the show for Bangladesh in their series win over Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yuzvendra-chahal-county-championship-five-wicket-haul-northamptonshire-vs-derbyshire-2597343-2024-09-10",
      "headline": "Yuzvendra Chahal takes 5-wicket haul in County Championship for NorthantsCounty Championship 2024: Yuzvendra Chahal picked his third five-wicket haul in first-class cricket, leading Northamptonshire's charge against Derbyshire on Day 2 of their contest in Northampton on Tuesday, September 10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-squad-vs-pakistan-ben-stokes-jack-leach-2597344-2024-09-10",
      "headline": "Ben Stokes returns as England announce 17-member squad for Pakistan Test seriesEngland announced their squad for 3-match Test series against Pakistan on Tuesday, September 10. Ben Stokes, who is currently rehabilitating from a hamstring tear was named the captain the side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-1st-test-brad-hoggs-india-playing-xi-ravindra-jadeja-kl-rahul-chennai-2597313-2024-09-10",
      "headline": "Ravindra Jadeja at No.5, No KL Rahul: Brad Hogg's India playing XI vs BangladeshBrag Hogg has included Ravindra Jadeja at No.5 and snubbed KL Rahul from his India's playing XI for the 1st Test against Bangladesh in Chennai. Jadeja and Rahul were included in the squad for the 1st Test against Bangladesh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-australia-1st-t20i-phil-salt-playing-xi-2597286-2024-09-10",
      "headline": "ENG vs AUS: Phil Salt to captain as England hand 3 debuts in 1st T20IEngland announced their playing XI for the 1st T20I match against Australia a day in advance. With Phil Salt captaining, the hosts named three debutants in the first XI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/pralympics-medal-wins-india-athletes-rewarded-sports-ministry-mansukh-mandaviya-2597273-2024-09-10",
      "headline": "Sports ministry announces cash rewards for Paralympians after historic campaignThe Indian government on Tuesday, September 10, announced cash rewards for Paralympic medallists. Sports minister Mansukh Mandaviya pledged support from the government for the LA 2028 campaign and said that medal winners would get special prizes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-squad-vs-pakistan-ben-stokes-jack-leach-2597344-2024-09-10",
      "headline": "Ben Stokes returns as England announce 17-member squad for Pakistan Test seriesEngland announced their squad for 3-match Test series against Pakistan on Tuesday, September 10. Ben Stokes, who is currently rehabilitating from a hamstring tear was named the captain the side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-1st-test-brad-hoggs-india-playing-xi-ravindra-jadeja-kl-rahul-chennai-2597313-2024-09-10",
      "headline": "Ravindra Jadeja at No.5, No KL Rahul: Brad Hogg's India playing XI vs BangladeshBrag Hogg has included Ravindra Jadeja at No.5 and snubbed KL Rahul from his India's playing XI for the 1st Test against Bangladesh in Chennai. Jadeja and Rahul were included in the squad for the 1st Test against Bangladesh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-australia-1st-t20i-phil-salt-playing-xi-2597286-2024-09-10",
      "headline": "ENG vs AUS: Phil Salt to captain as England hand 3 debuts in 1st T20IEngland announced their playing XI for the 1st T20I match against Australia a day in advance. With Phil Salt captaining, the hosts named three debutants in the first XI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/paralympics/story/pralympics-medal-wins-india-athletes-rewarded-sports-ministry-mansukh-mandaviya-2597273-2024-09-10",
      "headline": "Sports ministry announces cash rewards for Paralympians after historic campaignThe Indian government on Tuesday, September 10, announced cash rewards for Paralympic medallists. Sports minister Mansukh Mandaviya pledged support from the government for the LA 2028 campaign and said that medal winners would get special prizes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-first-test-nahid-rana-training-pace-chennai-2597246-2024-09-10",
      "headline": "IND vs BAN: Bangladesh are well-prepared for India series, says Nahid RanaNahid Rana has claimed that Bangladesh are well-prepared for the tour of India, starting with the Test series. Nahid was one of the stars for Bangladesh during their Test series win against Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-career-numbers-india-vs-england-2024-india-vs-bangladesh-2597201-2024-09-10",
      "headline": "Shubman Gill recalls 'confidence boosting' turnaround in England Test seriesStar India batter Shubman Gill recalled how he regained his confidence after a poor start to the England Test series earlier this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/ronald-koeman-keeps-netherlands-door-open-for-memphis-depay-after-corinthians-move-2597202-2024-09-10",
      "headline": "Ronald Koeman keeps Netherlands door open for Memphis Depay after Corinthians moveNetherlands boss Ronald Koeman has kept the door open for a return to the national team for Memphis Depay, despite his move to join Corinthians. Depay joined the Brazilian club on September 9. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/anwar-ali-mohun-bagan-ban-4-months-indian-football-12-90-crore-compensation-2597199-2024-09-10",
      "headline": "Anwar banned for 4 months, Mohun Bagan eligible for Rs 12.90 crore compensationIndia international Anwar Ali has been banned for four months by the Indian football governing body for illegally terminating his contract with Kolkata giants Mohun Bagan. The Indian Super League club is eligible for Rs 12.90 crore compensation."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/how-i-made-it/story/wc-influential-ten-writers-community-honors-digital-social-change-makers-2527796-2024-04-16",
      "headline": "WC influential ten: Writers community honors digital social change makersWriters Community Freelancers Releases 'WC Influential Ten' List Recognizing Social Impact through Virtual Space and Social Media"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}