{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-niu-gensheng-china-dairy-tycoon-rose-from-poverty-to-prosperity-2709398-2025-04-15",
      "headline": "How Niu Gensheng, China's dairy tycoon, rose from poverty to prosperityNiu Gensheng was born into a poor family in Inner Mongolia. His parents couldn't afford to raise him, so they sold him to a cattle farmer. The farmer adopted him, but life was still full of challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/retail-inflation-eases-march-february-2709360-2025-04-15",
      "headline": "Retail inflation eases further to 3.34% in March, lowest since August 2019The March CPI inflation print came in below February's 3.61%, marking the second straight month that inflation has stayed under the Reserve Bank of India's 4% medium-term target."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hermes-overtakes-lvmh-in-market-value-years-after-takeover-drama-2709317-2025-04-15",
      "headline": "Hermes overtakes LVMH in market value years after takeover dramaWay back in 2010, LVMH's billionaire CEO Bernard Arnault shocked the corporate world by acquiring a huge stake in Hermes. It was seen as an effort to seize control of the company. But the Hermes family fought back. They came together to defend their brand and ultimately made Arnault sell his shares."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-gains-nearly-1600-points-nifty-above-23300-indusind-bank-gains-7-percent-2709343-2025-04-15",
      "headline": "Sensex gains nearly 1,600 points, Nifty above 23,300; IndusInd bank gains 7%The S&P BSE Sensex gained 1,577.63 points to close at 76,734.89, while the NSE Nifty50 added 500 points to end at 23,328.55. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-recovers-fully-from-trump-tariffs-as-sensex-nifty-rally-2709336-2025-04-15",
      "headline": "Dalal Street dusts off Trump's April 2 tariff shock, stages full comebackTrading resumed after a long weekend, but there was no slowdown in terms of momentum. The Nifty50 climbed as much as 2.4% intraday, comfortably reclaiming its pre-tariff territory, while the Sensex gained over 1,600 points."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/ups-vs-nps-which-pension-scheme-should-you-opt-for-unified-pension-scheme-national-pension-scheme-which-is-better-2709287-2025-04-15",
      "headline": "UPS vs NPS: Which pension scheme should you opt forThe Unified Pension Scheme is the new retirement scheme effective from April 1, 2025. It is for central government employees. If you're currently under NPS, you'll have the option to shift to this new plan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/multibagger-stock-venkys-india-limited-has-given-13000-percent-return-should-you-buy-expert-view-2709299-2025-04-15",
      "headline": "This multibagger stock has given 13,000% return. Should you buy?Since its stock market debut on July 28, 2003, the company has delivered a return of nearly 12,951.78%. It touched its 52-week high of Rs 2,559.95 on September 4, 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-green-q4-business-update-share-price-rising-today-check-key-details-2709262-2025-04-15",
      "headline": "Adani Green share price jumps 5% today after Q4 business update. Check detailsThe stock rose as much as 5.33% in early trade to hit Rs 941.40 on the Bombay Stock Exchange (BSE). At around 1:05 pm, the shares of the company were trading 4.17% higher at Rs 931."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/usd-vs-inr-ca-explains-which-one-actually-holds-more-value-2709245-2025-04-15",
      "headline": "USD vs INR: CA explains which one actually holds more valueCA Nitin Kaushik said that some people argue that salaries in India grow faster. Though he doesn't deny it, he questions whether that trend still holds true today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-dalal-street-rally-sensex-nifty-jump-more-gains-ahead-explained-2709226-2025-04-15",
      "headline": "Sensex, Nifty jump 6% in two sessions. Are Dalal Street bulls back on track?While the sharp rebound in equity markets has reignited investor enthusiasm, experts are urging caution amid ongoing global uncertainties, especially around the US trade policy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rich-dad-poor-dad-author-robert-kiyosaki-warns-of-giant-market-crash-bets-on-gold-and-bitcoin-2709197-2025-04-15",
      "headline": "'Rich Dad Poor Dad' author warns of giant market crash, bets on gold and BitcoinAccording to Robert Kiyosaki the rising gold, silver, and Bitcoin prices show that traditional ways of saving—like stocks, bonds, mutual funds, and ETFs—are no longer safe. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/defence-stocks-should-you-buy-hal-bel-mazagon-dock-check-price-target-2709189-2025-04-15",
      "headline": "Should you buy HAL, BEL, Mazagon Dock, other defence stocks? Check price targetDefence companies are expected to do well for many positive reasons. These include higher government spending on defence, tensions between countries, a longer list of defence products being made in India, etc. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nani-reacts-to-hit-3-being-compared-with-animal-marco-and-kill-2709492-2025-04-15",
      "headline": "Nani reacts to HIT 3 being compared with Animal, Marco, and KillAt the trailer launch of HIT: The Third Case, Nani addressed fan comparisons between HIT 3, Animal, Marco, and Kill, stating that HIT 3 follows its own cinematic language and grammar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kalki-director-nag-ashwin-says-he-wrote-inception-like-story-before-christopher-nolan-2709446-2025-04-15",
      "headline": "Kalki's Nag Ashwin says he wrote Inception-like story before Christopher Nolan'Kalki 2898 AD' director Nag Ashwin recently opened up about his early writing experiences, revealing that his story was similar to the Hollywood film Inception, and sharing his admiration for Trivikram's 2010 film Khaleja."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/cate-blanchett-on-her-hollywood-retirement-i-am-serious-about-giving-up-acting-2709458-2025-04-15",
      "headline": "Cate Blanchett on her Hollywood retirement: I am serious about giving up actingCate Blanchett, known for her versatility, revealed her serious intent to retire from acting. The acclaimed actor said that she wished to explore other interests beyond the film industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahesh-manjrekar-bond-salman-khan-devmanus-exclusive-2709447-2025-04-15",
      "headline": "Salman Khan doesn't look it, but he is a Devmanus: Mahesh ManjrekarMahesh Manjrekar praises his unique bond with Salman Khan, describing him as a 'Devmanus' despite not fitting the conventional image. He will next be seen in the Marathi film 'Devmanus'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sunny-deol-jaat-sparks-controversy-christian-community-expresses-outrage-over-church-scene-2709438-2025-04-15",
      "headline": "Sunny Deol's Jaat sparks outrage over church scene, Christians demand banThe release of Sunny Deol's latest film 'Jaat' has ignited controversy due to a scene perceived as disrespectful by the Christian community. The community has demanded a ban and legal action, claiming the portrayal is an insult to their faith."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ar-rahman-responds-abhijeet-bhattacharya-slam-overusing-technology-2709441-2025-04-15",
      "headline": "AR Rahman reacts to Abhijeet Bhattacharya slamming him for 'overusing' technologySinger Abhijeet Bhattacharya criticised AR Rahman for overusing technology in music, impacting live instrumentation. AR Rahman defended himself in an exclusive interview, highlighting his support for musicians."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-last-of-us-season-2-who-is-eugene-and-why-his-death-matters-glbs-2709437-2025-04-15",
      "headline": "The Last of Us Season 2: Who Is Eugene and Why His Death MattersThe Last of Us Season 2 introduces Eugene, a mysterious off-screen character whose death—linked to Joel—adds emotional depth and unanswered questions. Though absent in life, Eugene's story unfolds through flashbacks and dialogue, setting up a powerful turning point in the HBO series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ibrahim-ali-khan-finally-addresses-nadaaniyan-criticism-they-tried-to-twist-it-2709391-2025-04-15",
      "headline": "Ibrahim Ali Khan finally addresses Nadaaniyan criticism: They tried to twist itIbrahim Ali Khan breaks his silence over criticism of his debut film 'Nadaaniyan'. The actor admitted that he needs to work on his craft, but maintained that social media was harsher than it should have been while reviewing the film. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/premalu-actor-naslen-reveals-why-he-said-no-to-ajith-kumars-good-bad-ugly-2709334-2025-04-15",
      "headline": "Premalu actor Naslen reveals why he rejected to Ajith Kumar's Good Bad UglyDuring a recent press meet for the film 'Alappuzha Gymkhana', Malayalam actor Naslen Gafoor revealed why he turned down a role in Ajith Kumar's 'Good Bad Ugly'. Naslen is best known for the blockbuster Premalu (2024)."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kaitlyn-dever-the-last-of-us-abby-anderson-role-extra-security-due-to-polarising-reaction-2709352-2025-04-15",
      "headline": "The Last of Us S2's Kaitlyn Dever on security concerns, taking on Abby's roleThe second season of 'The Last of Us' introduces Kaitlyn Dever as Abby Anderson, a character known for dividing fans due to her controversial actions in the video game series. Despite rumours of needing extra security, Dever clarifies she never made such a statement and feels confident in the support from the show's creators."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/palak-tiwari-on-debut-with-salman-khan-wouldnt-have-done-it-any-other-way-exclusive-2709309-2025-04-15",
      "headline": "Palak Tiwari on debut with Salman Khan: Wouldn't have done it any other wayPalak Tiwari reflects on her debut with Salman Khan in 'Kisi Ka Bhai Kisi Ki Jaan', expressing gratitude for the experience despite limited screen time. The actor will next be seen in 'The Bhootniii.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/backstreet-boy-nick-carter-accused-of-sexual-assaults-in-new-lawsuit-2709327-2025-04-15",
      "headline": "Backstreet Boy Nick Carter accused of sexual assaults in new lawsuitBackstreet Boys' Nick Carter is embroiled in a fresh lawsuit accusing him of sexual assaults and knowingly transmitting STDs. The accuser, Laura Penly, detailed multiple incidents and and is seeking damages."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/priyanka-chahar-talks-about-moving-forward-amid-breakup-rumours-with-ankit-gupta-2709323-2025-04-15",
      "headline": "Priyanka Chahar talks about 'moving forward' amid breakup rumours with Ankit GuptaActor Priyanka Chahar Choudhary seemingly confirmed her breakup with actor Ankit Gupta. In an interview, she talked about moving forward in life and embracing change. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/john-travolta-pays-tribute-to-late-son-jett-on-birthday-love-you-forever-2709291-2025-04-15",
      "headline": "John Travolta pays tribute to late son Jett on birthday: Love you foreverActor John Travolta shared a moving tribute to his late son Jett on what would have been his birthday. Jett died in 2009."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/like-adolescence-indian-films-and-shows-that-mastered-one-shot-technique-2709297-2025-04-15",
      "headline": "Like Adolescence, Indian films and shows that mastered one-shot techniqueIt's not just challenging but also demanding for both the audience and the filmmakers to tell a story or a part of their story using a one-shot camera technique. With 'Adolescence' creating noise about the same, here's a list of Indian shows and films that make the best use of this style of camera movement. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ilaiyaraaja-sends-legal-notice-to-good-bad-ugly-makers-over-use-of-his-songs-2709284-2025-04-15",
      "headline": "Ilaiyaraaja sends legal notice to Good Bad Ugly makers, demands Rs 5 croreLegendary music director Ilaiyaraaja has issued a legal notice to the makers of Ajith Kumar's Good Bad Ugly for using altered versions of three of his iconic songs without permission. He has demanded Rs 5 crore in compensation and the removal of the songs from the recently released action-comedy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/rapper-lil-nas-x-suffers-partial-facial-paralysis-shares-update-from-hospital-bed-glbs-2709267-2025-04-15",
      "headline": "Rapper Lil Nas X suffers partial facial paralysis, shares update from hospital bedRapper Lil Nas X reveals he's lost control of the right side of his face, sharing a video from his hospital bed. Fans express concern as he struggles to smile and speak. Updates on his condition are awaited.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/tamil-director-actor-ss-stanley-dies-at-57-in-chennai-2709254-2025-04-15",
      "headline": "Tamil director-actor SS Stanley dies at 57 in ChennaiPopular Tamil director and actor SS Stanley died at 57 due to health complications. He was undergoing treatment in a private hospital in Chennai. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nanis-dialogue-in-hit-3-trailer-resonates-with-fans-draws-parallel-with-real-life-2708970-2025-04-15",
      "headline": "Nani's dialogue in HIT 3 trailer resonates with fans, draws parallel with real-lifeIn the newly released trailer of HIT 3, Nani's powerful one-liner about survival has struck a chord with fans, who see it as a nod to his journey in the film industry as an outsider. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ed-first-chargesheet-sonia-gandhi-rahul-national-herald-money-laundering-case-2709442-2025-04-15",
      "headline": "Gandhis, Sam Pitroda named in ED chargesheet in National Herald caseThe ED filed a chargesheet against Congress MPs Sonia Gandhi and Rahul Gandhi, Indian Overseas Congress chief Sam Pitroda and others in the alleged National Herald money laundering case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/court-karnataka-lokayukta-probe-muda-case-involving-siddaramaiah-chief-minister-2709353-2025-04-15",
      "headline": "In Muda case against Siddaramaiah, court wants full report, orders further probeA Bengaluru special court postponed its decision on the Lokayukta's closure report in the Muda case involving Chief Minister Siddaramaiah, ordering Lokayukta police to continue further investigation into the allegations against others."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/california-senate-bill-pitted-khalistanis-against-indian-diaspora-in-us-hindus-sikhs-2709364-2025-04-15",
      "headline": "Why a California Bill has pitted Khalistanis against Indian diaspora in USA bill introduced in the California Senate, aimed at curbing \"transnational repression\" by foreign governments, has sparked fears among Hindu and Sikh Americans of being unfairly branded \"agents of India\". While pro-Khalistani groups cheered it on, Indian Americans warn it risks legitimising fringe narratives and vilifying entire communities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/south-states-top-india-justice-report-2025-west-bengal-at-bottom-police-judicial-reforms-undertrials-legal-aid-2709368-2025-04-15",
      "headline": "South states take 5 top spots, Bengal last in policing, justice delivery: ReportThe India Justice Report of 2025 has revealed that the southern states have excelled in policing, justice delivery and prison management. While Karnataka led the pack, West Bengal slipped to the bottom. Telangana made the biggest leap, vaulting from 11th to 3rd place among the large and mid-sized states."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/maach-mishti-and-more-why-fish-is-not-just-food-for-bengalis-it-is-sacred-2709439-2025-04-15",
      "headline": "Maach, mishti, and more: Why fish is not just food for Bengalis, it is sacredFish market by a Kali temple, sacred or sacrilege?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/mit-student-visas-revoked-trump-targets-universities-fund-cuts-diversity-programmes-2709369-2025-04-15",
      "headline": "MIT says 9 student visas revoked without explanation: 'Extremely concerning'Till now, the US government has cancelled the visas of nearly 530 students, faculty and researchers. MIT President, Sally Kornbluth, said the university remains \"extremely concerned\" about the broader implications of the abrupt visa revocation."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/saudi-arabia-10000-hajj-slots-indians-80-per-cent-private-quota-hit-private-operators-ministry-of-minority-affairs-2709380-2025-04-15",
      "headline": "Saudi Arabia adds 10,000 Hajj slots for Indians after 80% of private quota hitSaudi Arabia will accommodate 10,000 additional Indian Hajj pilgrims this year, increasing India's total quota to 175,025, according to the Ministry of Minority Affairs. The decision follows a request from India after several Indian private tour operators missed key deadlines and saw 52,000 slots being cancelled by Saudi Arabia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-ed-chargesheet-rahul-sonia-gandhi-national-herald-money-laundering-pm-hm-intimidation-2709459-2025-04-15",
      "headline": "Intimidation by PM: Congress on ED naming Gandhis in National Herald caseCongress General Secretary Jairam Ramesh called the seizing of the assets of the National Herald \"a state-sponsored crime masquerading as the rule of law\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sunny-deol-jaat-sparks-controversy-christian-community-expresses-outrage-over-church-scene-2709438-2025-04-15",
      "headline": "Sunny Deol's Jaat sparks outrage over church scene, Christians demand banThe release of Sunny Deol's latest film 'Jaat' has ignited controversy due to a scene perceived as disrespectful by the Christian community. The community has demanded a ban and legal action, claiming the portrayal is an insult to their faith."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-muslim-woman-hindu-man-harassed-moral-policing-video-surfaces-2709485-2025-04-15",
      "headline": "'Remove your burqa': Man harasses Muslim woman, Hindu friend in Bengaluru parkA video of a Muslim woman and a Hindu man being harassed by an unidentified man in Bengaluru has gone viral. This is the second such incident reported in a week.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bengal-murshidabad-violence-waqf-act-protest-initial-probe-bangladesh-miscreants-involvement-mamata-banerjee-trinamool-2709328-2025-04-15",
      "headline": "Bangladeshi miscreants involved in Bengal Waqf violence, Centre told: SourcesThe probe found that the Mamata Banerjee-led government failed to monitor the intruders as unrest gripped two districts in Bengal over the Waqf law, killing three people. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ayodhya-ram-mandir-bomb-threat-mail-security-concerns-police-fir-up-police-2709396-2025-04-15",
      "headline": "'Increase your security': Ayodhya Ram Mandir gets threat mail, case filedThe Shri Ram Janmabhoomi Teerth Kshetra Trust, which manages the Ram Temple in Ayodhya, received a bomb threat mail on Monday. The mail originated from Tamil Nadu and the cyber cell was probing the matter."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/declassified-cia-file-aliens-soviet-soldiers-stone-russia-siberia-ukraine-ufo-kgb-cold-war-document-memo-2709424-2025-04-15",
      "headline": "Aliens turned 23 Soviet soldiers into stones? Chilling details in CIA fileA declassified CIA file claims a clash between Soviet soldiers and aliens turned 23 troops to stone."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-monsoon-2025-above-average-india-meterological-department-rains-rainfall-2709332-2025-04-15",
      "headline": "India may receive above-normal monsoon rains in 2025, weather department predictsThe officials said all key climate factors — including the El Nino and the Indian Ocean Dipole (IOD) — are currently in a neutral phase. These neutral conditions are considered favourable for a healthy monsoon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/south/story/tamil-nadu-resolution-mk-stalin-assembly-autonomy-high-level-panel-chaos-bjp-protest-walk-out-justice-kurien-joseph-2709234-2025-04-15",
      "headline": "Days after big win over Governor, Tamil Nadu's move to secure more autonomyThe committee, which will be headed by former Supreme Court judge Kurian Joseph, will submit its interim report by January 2026 and the final report within two years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tn-cong-mla-hasan-maulana-on-waqf-land-claim-on-vellore-village-by-dargah-2709209-2025-04-15",
      "headline": "Once a Waqf, always a Waqf: Congress MLA backs claim on Tamil Nadu village landFresh controversy was triggered after a Dargah sent eviction notices to residents of a village in Vellore, Tamil Nadu, claiming it was part of Waqf board.    "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/singapore-woman-shares-employees-brutal-resignation-note-felt-like-toilet-paper-2709172-2025-04-15",
      "headline": "Felt like toilet paper: Singapore woman shares employee's brutal resignation noteIn a now-viral LinkedIn post, a Singapore-based businesswoman shared how an employee resigned, saying they felt like \"toilet paper\" at their company."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/china-us-trade-war-beijing-stops-us-made-boeing-jet-deliveries-2709306-2025-04-15",
      "headline": "China stops US-made Boeing jet deliveries as trade war expands: ReportBeijing has ordered the immediate stoppage of any purchases related to aircraft machinery and equipment from US companies, escalating the trade war between the two nations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-niu-gensheng-china-dairy-tycoon-rose-from-poverty-to-prosperity-2709398-2025-04-15",
      "headline": "How Niu Gensheng, China's dairy tycoon, rose from poverty to prosperityNiu Gensheng was born into a poor family in Inner Mongolia. His parents couldn't afford to raise him, so they sold him to a cattle farmer. The farmer adopted him, but life was still full of challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-us-trade-deal-commerce-secretary-liberalisation-policies-pm-modi-donald-trump-tariffs-2709345-2025-04-15",
      "headline": "India seeing 'very good progress' on trade talks with US: ReportCommerce Secretary Sunil Barthwal expressed hope that India would be able to negotiate a good bilateral trade agreement with the US. He said the trade talks had seen \"very good progress\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/donald-trump-aide-dress-made-in-china-chinese-envoy-claim-sparks-debate-2709310-2025-04-15",
      "headline": "Trump aide's dress made in China? Chinese envoy's claim sparks debateA Chinese envoy has claimed that White House Press Secretary Karoline Leavitt made a public appearance in a dress that was apparently made in China. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-gains-nearly-1600-points-nifty-above-23300-indusind-bank-gains-7-percent-2709343-2025-04-15",
      "headline": "Sensex gains nearly 1,600 points, Nifty above 23,300; IndusInd bank gains 7%The S&P BSE Sensex gained 1,577.63 points to close at 76,734.89, while the NSE Nifty50 added 500 points to end at 23,328.55. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/west-bengal-anti-waqf-violence-hindu-victim-target-riots-trinamool-congress-mamata-banerjee-response-2709212-2025-04-15",
      "headline": "Why no Mamata for victims, but mollycoddling of aggressorsEven as Hindus were hacked to death and hundreds of families fled communal riots in West Bengal after anti-waqf protests turned violent, CM Mamata Banerjee chose appeasement over action. While Mamata and Trinamool leaders have spoken, appealed to and mollycoddled the rioters, they haven't condoled the deaths and devastation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-allahabad-high-court-orders-grabbing-breasts-invited-trouble-objectionable-rulings-judge-cases-remark-takes-note-2709270-2025-04-15",
      "headline": "Supreme Court questions High Court's 'she invited trouble' remark in rape caseThe Supreme Court blasted the Allahabad High Court after it granted bail to a person accused of raping a student and said the woman 'herself invited trouble'."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-bat-size-checks-mohit-sharma-hilarious-dc-vs-rr-delhi-2709503-2025-04-15",
      "headline": "Let them get banned: Mohit Sharma's hilarious take on bat size checks in IPLIPL 2025, DC vs RR: Senior fast bowler Mohit Sharma welcomed the BCCI's decision to check the size of the bats in the field of play. The fast bowler highlighted the lack of balance between bat and ball in modern-day T20s. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-glenn-maxwell-on-family-support-pbks-vs-kkr-2709502-2025-04-15",
      "headline": "Joined by family, Glenn Maxwell hopes for mid-season turnaround in IPL 2025Australia and Punjab Kings (PBKS) all rounder Glenn Maxwell revealed that his family has come to India to support him amid poor form in the ongoing Indian Premier League 2025 (IPL 2025). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-kkr-anrich-nortje-josh-inglis-xavier-bartlett-2709494-2025-04-15",
      "headline": "PBKS vs KKR: Nortje makes Kolkata debut, Inglis in for StoinisAnrich Nortje is making his debut for KKR as Josh Inglis and Xavier Bartlett make their first bow in the IPL. Marcus Stoinis is missing the game against KKR after his heroics in the last game. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/paige-bueckers-guides-in-new-era-for-dallas-wings-as-top-pick-in-wnba-draft-2025-glbs-2709484-2025-04-15",
      "headline": "Paige Bueckers guides in new era for Dallas Wings as top pick in WNBA Draft 2025Paige Bueckers, a guard from UConn and a recently crowned NCAA champion, was selected No. 1 overall by the Dallas Wings in the WNBA Draft 2025, setting the tone for a franchise ready to rebuild."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-major-flaw-in-rishabh-pants-technique-asked-to-learn-from-virat-kohli-2709451-2025-04-15",
      "headline": "Major flaw in Rishabh Pant's technique pointed out, asked to learn from Virat KohliFormer India cricketer turned commentator Wasim Jaffer has pointed out a major flaw in Rishabh Pant's technique and has asked him to learn from Virat Kohli. Pant scored his first half-century of the season vs Chennai Super Kings (CSK) in Match 30 of the Indian Premier League 2025 (IPL 2025). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/sudirman-cup-squad-india-injury-gayatri-gopichand-jolly-full-list-2709420-2025-04-15",
      "headline": "India announce Sudirman Cup squad, Gayatri Gopichand and Jolly Treesa miss outSudirman Cup 2025: Gayatri Gopichand and Jolly Treesa will miss the prestigious mixed team event due to injuries. However, India are bolstered by the return of former World No. 1 men's doubles pairing of Satwiksairaj Rankireddy and Chirag Shetty. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohsin-naqvi-fails-to-attend-quarterly-meeting-of-icc-post-champions-trophy-2709395-2025-04-15",
      "headline": "Mohsin Naqvi fails to attend quarterly meeting of ICC post Champions TrophyPakistan Cricket Board (PCB) chairman Mohsin Naqvi failed to attend the quarterly meeting of the ICC (International Cricket Council) in Harare due to pending personal business in Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-csk-ms-dhoni-run-out-fluke-rishabh-pant-2709384-2025-04-15",
      "headline": "MS Dhoni's run-out vs LSG fluke? CSK captain reflects on magical effortIPL 2025, LSG vs CSK: MS Dhoni reflected on his magical effort with the gloves, saying he wasn't sure whether his throw would hit the stumps at the non-striker's end. Dhoni's run-out of Abdul Samad in Lucknow left quite a few in awe.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rohit-sharma-batting-form-mi-vs-srh-2709371-2025-04-15",
      "headline": "Rohit's struggles has not let MI set the tone in IPL 2025: Anjum ChopraFormer India captain Anjum Chopra believes that Rohit Sharma's poor form has not allowed Mumbai Indians to set the tone in the Indian Premier League so far, Anjum feels that MI might need to demote Rohit to the middle-order."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-csk-ms-dhoni-injury-scare-limping-knee-issue-2709320-2025-04-15",
      "headline": "Injury scare for MS Dhoni? CSK captain seen limping after heroics vs LSG in LucknowIPL 2025, LSG vs CSK: After hitting a match-winning 26 off just 11 balls, MS Dhoni was seen limping as he went up to collect the Player of the Match award. Dhoni has been managing a troublesome knee over the past few years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/sudirman-cup-squad-india-injury-gayatri-gopichand-jolly-full-list-2709420-2025-04-15",
      "headline": "India announce Sudirman Cup squad, Gayatri Gopichand and Jolly Treesa miss outSudirman Cup 2025: Gayatri Gopichand and Jolly Treesa will miss the prestigious mixed team event due to injuries. However, India are bolstered by the return of former World No. 1 men's doubles pairing of Satwiksairaj Rankireddy and Chirag Shetty. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohsin-naqvi-fails-to-attend-quarterly-meeting-of-icc-post-champions-trophy-2709395-2025-04-15",
      "headline": "Mohsin Naqvi fails to attend quarterly meeting of ICC post Champions TrophyPakistan Cricket Board (PCB) chairman Mohsin Naqvi failed to attend the quarterly meeting of the ICC (International Cricket Council) in Harare due to pending personal business in Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-csk-ms-dhoni-run-out-fluke-rishabh-pant-2709384-2025-04-15",
      "headline": "MS Dhoni's run-out vs LSG fluke? CSK captain reflects on magical effortIPL 2025, LSG vs CSK: MS Dhoni reflected on his magical effort with the gloves, saying he wasn't sure whether his throw would hit the stumps at the non-striker's end. Dhoni's run-out of Abdul Samad in Lucknow left quite a few in awe.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rohit-sharma-batting-form-mi-vs-srh-2709371-2025-04-15",
      "headline": "Rohit's struggles has not let MI set the tone in IPL 2025: Anjum ChopraFormer India captain Anjum Chopra believes that Rohit Sharma's poor form has not allowed Mumbai Indians to set the tone in the Indian Premier League so far, Anjum feels that MI might need to demote Rohit to the middle-order."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-vs-csk-ms-dhoni-injury-scare-limping-knee-issue-2709320-2025-04-15",
      "headline": "Injury scare for MS Dhoni? CSK captain seen limping after heroics vs LSG in LucknowIPL 2025, LSG vs CSK: After hitting a match-winning 26 off just 11 balls, MS Dhoni was seen limping as he went up to collect the Player of the Match award. Dhoni has been managing a troublesome knee over the past few years."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}