{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-us-trade-pact-deadlock-over-tariffs-as-negotiations-continue-2748943-2025-07-01",
      "headline": "India-US trade pact: Deadlock over tariffs as negotiations continueIndia and the US are yet to reach an agreement on their trade pact, with tariffs being a major point of contention. India is pushing for zero tariffs in certain sectors, while the US wants to maintain a 10% tariff. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-91-points-higher-nifty-above-25500-ril-bel-up-2-percent-2748968-2025-07-01",
      "headline": "Sensex closes 91 points higher, Nifty above 25,500; RIL up 2%The S&P BSE Sensex was up 90.83 points to end at 83,697.29, while the NSE Nifty50 added 24.75 points to close at 25,541.80. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/tax-to-tatkal-trains-aadhar-credit-card-july-1-money-changes-that-matter-to-you-itr-deadline-2748932-2025-07-01",
      "headline": "From tax to tatkal trains: July 1 money changes that matter to youThe CBDT has extended the last date for filing Income Tax Returns (ITR) for salaried individuals. Instead of July 31, the new deadline is now September 15."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-may-finalise-interim-trade-deal-with-us-this-week-report-2748838-2025-07-01",
      "headline": "India may finalise interim trade deal with US this week: ReportBoth sides are racing to complete the deal before July 9, when the US is set to impose a 26% reciprocal tariff on Indian goods. These tariffs were first announced by President Donald Trump in April and temporarily suspended for 90 days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pm-modi-blog-digital-india-10-years-linkedin-people-movement-2748806-2025-07-01",
      "headline": "Digital India turns 10, PM Modi says it's become a people's movementIn the blog titled 'A Decade of Digital India', on LinkedIn, PM Modi said the Digital India initiative is no longer just a government programme but a 'people's movement.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/family-offices-india-booming-ultrarich-wealth-creation-asset-management-tax-legal-2748784-2025-07-01",
      "headline": "Why India's ultra-rich love family officesForget yachts. For India's ultra-rich, the ultimate power move is a family office. Read on to see why it's becoming the new gold standard of wealth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/world-richest-forbes-list-2025-new-york-mumbai-billionaires-top-10-cities-wealth-ultra-rich-mukesh-ambani-2748773-2025-07-01",
      "headline": "New York tops billionaire list. Which Indian city made it to the top 10?Globally, nearly a quarter of the world's 3,028 billionaires live in just 10 cities across six countries. These cities continue to attract wealth due to strong business ecosystems, investor-friendly policies, and thriving industries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-flat-nifty-above-25500-asian-paints-up-2-percent-2748711-2025-07-01",
      "headline": "Sensex opens flat, Nifty above 25,500; Asian Paints up 2%The S&P BSE Sensex was up 186.04 points to 83,792.50, while the NSE Nifty50 added 56.35 points to 25,573.40 as of 9:28 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/sbi-70-years-when-start-why-year-history-customer-share-price-imperial-bank-of-calcutta-2748710-2025-07-01",
      "headline": "SBI turns 70: Why bank's blue keyhole has stood the test of timeAfter independence, under the first 5-year plan's push for rural development, the government nationalised the Imperial Bank. On July 1, 1955, the State Bank of India was born under the State Bank of India Act."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ms-dhoni-files-for-trademark-of-iconic-nickname-captain-cool-2748422-2025-06-30",
      "headline": "MS Dhoni files for trademark of iconic nickname 'Captain Cool'Over the years, 'Captain Cool' has meant much more than just a catchy title. It sums up Dhoni's calm mind under pressure, from winning India's first T20 World Cup in 2007 to lifting the ODI World Cup in 2011 and the Champions Trophy in 2013. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-450-points-lower-nifty-below-25600-trent-gains-3-2748406-2025-06-30",
      "headline": "Sensex ends 450 points lower, Nifty below 25,600; Trent gains 3%The S&P BSE Sensex fell 452.44 points to close at 83,606.46, while the NSE Nifty50 dropped 120.75 points, ending below the 25,600 mark."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/look-rich-or-be-rich-startup-founder-on-middle-class-dilemma-2748370-2025-06-30",
      "headline": "Look rich or be rich: Startup founder on middle class dilemmaToday, many people in the middle class are busy trying to look rich, rather than actually becoming rich. Costly gadgets, fancy brunches and trendy holidays are often paid for with loans and EMIs, says founder and CEO, Shyam Achuthan."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/son-of-sardaar-2-ajay-devgn-neeru-bajwa-bring-patiala-swag-in-films-title-track-2749016-2025-07-01",
      "headline": "Son of Sardaar 2: Ajay Devgn, Neeru Bajwa bring Patiala swag in film's title trackThe title track of 'Son of Sardaar 2' has been released, bringing vibrant Punjabi energy and a fresh twist to the much-anticipated sequel. Featuring Ajay Devgn's return as Jassi and a star-studded cast, the film promises a blend of fun, chaos, and desi charm, set to hit theatres on July 25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kareena-kapoor-says-karisma-kapoor-carried-the-family-legacy-ranbir-kapoor-2748867-2025-07-01",
      "headline": "Kareena Kapoor says she and Karisma carried the family legacy, not RanbirActor Kareena Kapoor recently stated that it was she and her sister Karisma who took forward the family legacy much before Ranbir Kapoor entered the Hindi film industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vikrant-massey-left-religion-column-blank-on-his-son-birth-certificate-2748967-2025-07-01",
      "headline": "Here's why Vikrant Massey left religion column blank on his son's birth certificateActor Vikrant Massey shared why we left the religion column blank on his son's birth certificate. He said the concept of religion is man-made. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/unni-mukundan-marco-sequel-discussions-still-on-reveal-makers-2748985-2025-07-01",
      "headline": "Actor Unni Mukundan's Marco sequel discussions still on, reveal makersMalayalam actor Unni Mukundan has recently revealed that he has dropped all plans to make the sequel to his hit film 'Marco'. Now the makers, Cubes Entertainments, revealed a piece of information that is in contrast to what Mukundan had said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thammudu-release-trailer-nithiin-promises-emotional-ride-high-on-action-dil-raju-2748945-2025-07-01",
      "headline": "Thammudu release trailer: Nithiin promises emotional ride high on actionThe release trailer of Telugu actor Nithiin's emotional actioner 'Thammudu' is out. The film is releasing on July 4, 2025.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/janaki-vs-state-of-kerala-film-bodies-cbfc-demand-title-2748990-2025-07-01",
      "headline": "Malayalam film bodies protest Censor Board's demand to change Janaki titleFilm associations in Kerala strongly opposed the CBFC's demand to change the title of 'Janaki vs State of Kerala'. The protest highlighted concerns over artistic freedom and cultural respect in the Malayalam film industry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/abhishek-bachchan-recalls-how-father-amitabh-bachchan-went-from-harsh-critic-to-biggest-fan-2748887-2025-07-01",
      "headline": "Abhishek Bachchan recalls how Big B went from tough critic to biggest fanActor Abhishek Bachchan opened up about his evolving relationship with father Amitabh Bachchan, saying he's now his biggest supporter but was once his harshest critic. He added how his father's honest feedback shaped his journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/brad-pitt-f1-album-hans-zimmer-races-ahead-with-its-music-heres-why-it-deserves-a-spotlight-2748893-2025-07-01",
      "headline": "Brad Pitt's F1 album races ahead with its music. Here's why it deserves a spotlightBrad Pitt's 'F1: The Movie' has taken the spotlight not only for its gripping story and stunning visuals, but also for its powerful music album featuring 17 high-energy tracks and Hans Zimmer's evocative score. The soundtrack makes for an essential part of the film's thrilling racing experience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karan-johar-jokes-move-to-london-whatsapp-chats-got-leaked-kareena-kapoor-sonam-kapoor-2748844-2025-07-01",
      "headline": "Karan Johar jokes he'd move to London if his WhatsApp chats got leakedIn a recent interview, filmmaker Karan Johar mentioned that he is in a WhatsApp group called GUTS with Kareena, Karisma, Sonam and Rhea Kapoor. He also shared that if his chats ever got leaked, he would move to London."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/huma-qureshi-on-item-songs-deserving-special-lens-2748955-2025-07-01",
      "headline": "No shame in being sensual: Huma Qureshi on why special songs deserve a new lensActor Huma Qureshi, in an exclusive interview with India Today, talked about the changing dynamics in filming special songs featuring women. She also named the song that she would like to recreate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/farah-khan-asked-kay-kay-menon-if-he-was-drunk-while-shooting-for-sajanaji-vari-vari-2748885-2025-07-01",
      "headline": "Farah Khan thought I was drunk: Kay Kay Menon on Sajana Ji Vari Vari shootActor Kay Kay Menon shared a funny incident from the sets of his film 'Honeymoon Travels Pvt Ltd' in a recent interview. He said choreographer Farah Khan asked him if he was drunk or had drugs while shooting for the song 'Sajana Ji Vari Vari.' "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/shine-tom-chacko-father-cp-chacko-death-in-car-accident-statement-2748928-2025-07-01",
      "headline": "Actor Shine Tom recalls last moments of his father before fatal car accidentMalayalam actor Shine Tom Chacko spoke about the fatal car accident that killed his father, CP Chacko, earlier this year. He explained how he and his mother suffered cracks in spine and hip, respectively."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/munmun-dutta-reacts-to-quitting-taarak-mehta-ka-ooltah-chashmah-2748917-2025-07-01",
      "headline": "Rumours are not always true: Actor Munmun Dutta reacts to quitting Taarak MehtaActor Munmun Dutta has confirmed she is not quitting 'Taarak Mehta Ka Ooltah Chashmah'. She posted a behind-the-scenes video on Instagram saying the exit rumours are not true. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jurassic-world-4-first-reviews-homage-to-steven-spielberg-jaw-2748833-2025-07-01",
      "headline": "Jurassic World 4 first reviews: An homage to Steven Spielberg's Jaw, say criticsThe first reviews of 'Jurassic World Rebirth' are full of praise for its adrenaline-pumping ride, thrills, and jaw-dropping action. The science-fiction action-adventure features Scarlett Johansson, Jonathan Bailey, and Mahershala Ali in key roles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/rupali-ganguly-praises-vijay-ganguly-choreography-sitaare-zameen-par-2748871-2025-07-01",
      "headline": "Pics: Rupali Ganguly celebrates brother's work in Aamir Khan's Sitaare Zameen ParRupali Ganguly shared photos celebrating her brother Vijay Gsnguly's choreography in the film 'Sitaare Zameen Par'. The film marks a meaningful journey for Vijay, with solo credits alongside Aamir Khan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/anshula-kapoor-the-traitors-experience-triggers-memories-of-mother-mona-shouri-death-2748902-2025-07-01",
      "headline": "Anshula Kapoor on The Traitors: Last mission triggered memories of my mother's deathAnshula Kapoor reveals how participating in the reality show 'The Traitors' triggered memories of her mother's death, leading to emotional distress and PTSD (post-traumatic stress disorder)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/chiranjeevis-vishwambhara-in-final-stage-of-production-makers-promise-top-tier-vfx-2748869-2025-07-01",
      "headline": "Chiranjeevi's Vishwambhara in final stage of production, makers promise top-tier VFXThe makers of Chiranjeevi's 'Vishwambhara' have confirmed that the film is in its final stage of production, with global-standard VFX in the works. A visually grand theatrical experience is promised, with the release date expected soon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kuberaa-director-sekhar-kammula-dhanush-film-failing-tamil-box-office-2748860-2025-07-01",
      "headline": "Kuberaa director on why Dhanush's film is failing in Tamil: Thought it would catch on'Kuberaa' director Sekhar Kammula, who is riding high on the success of his film in Telugu, recently spoke about how he was surprised to find out why the film didn't receive the same reception from the Tamil audience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-opens-up-about-naming-his-dog-shah-rukh-khan-2748826-2025-07-01",
      "headline": "Aamir Khan opens up about naming his dog Shah Rukh, calls it a childish phaseAamir Khan has addressed his controversial remark about naming his dog Shah Rukh, calling it a \"childish\" phase in their friendship. He also revealed that the past rivalry is long over and the two now share a friendly bond."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/drunk-on-power-madras-high-courts-scathing-observation-for-tamil-nadu-police-in-custodial-death-case-2748993-2025-07-01",
      "headline": "Drunk on power: Madras High Court to Tamil Nadu Police in custodial death caseMadras High Court made damning observations on the custodial death of 27-year-old Ajith Kumar. The high court also ordered a judicial inquiry led by a retired judge of the Madurai Bench and directed the Tamil Nadu government to initiate action against all senior officials responsible. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-congress-mla-br-patil-claims-credit-for-siddaramaiah-meeting-with-sonia-gandhi-in-viral-phone-call-claims-lack-of-party-support-2748979-2025-07-01",
      "headline": "Made Siddaramaiah meet Sonia Gandhi, his rise was luck: Karnataka Congress MLAA video of senior Karnataka Congress MLA BR Patil expressing disappointment over party dynamics is being widely circulated. In the call, he also claims credit for Siddaramaiah's rise, and says he has no godfather in the party."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/another-law-student-alleges-molestation-by-kolkata-gangrape-accused-monojit-mishra-2748991-2025-07-01",
      "headline": "Another law student alleges molestation by Kolkata gangrape accused Monojit MishraThe student alleged that Mishra, a Trinamool Congress Chhatra Parishad leader, assaulted and threatened her during a college trip two years back."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modis-8-year-landmark-journey-of-gst-meets-rahul-gandhis-economic-injustice-cry-2749013-2025-07-01",
      "headline": "PM's 8-year 'landmark' journey of GST meets Rahul Gandhi's 'economic injustice' cryPrime Minister Narendra Modi praised the completion of eight years of GST implementation, but his praise was sharply countered by Rahul Gandhi, who condemned the tax system as a form of \"economic injustice\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/who-the-fork-are-you-zohran-mamdani-must-be-condemned-eating-with-hands-viral-video-2749000-2025-07-01",
      "headline": "Who the Fork Are You?Donald Trump's MAGA crazies have taken exception to Zohran Mamdani using his fingers to eat food. Primitive, they said. So, the author gives them a schooling -- and a scalding -- for knowing @&#t about eating."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rcb-created-nuisance-cops-are-not-alladin-ka-chirag-had-shortage-of-time-tribunal-on-bengaluru-stampede-2748951-2025-07-01",
      "headline": "RCB created nuisance, cops not magicians or gods: Tribunal on Bengaluru stampedeIn a strong observation, the Central Administrative Tribunal said that Royal Challengers Bengaluru was primarily responsible for the stampede outside the Chinnaswamy stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-india-flight-dropped-900-feet-delhi-vienna-flight-pilots-grounded-dgca-2748820-2025-07-01",
      "headline": "Delhi-Vienna Air India flight plunged 900 feet, pilots grounded: ReportJust days after a deadly crash in Ahmedabad, an Air India Delhi-Vienna flight dropped 900 feet mid-air, triggering warnings. Pilots have been grounded as the aviation watchdog is probing maintenance lapses and safety compliance."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/uk-based-families-of-crash-victims-considering-suing-air-india-boeing-for-enhanced-compensation-sources-2748895-2025-07-01",
      "headline": "UK families of crash victims may sue Air India, Boeing over compensationAir India crash: All but one of the 242 passengers and crew on board the Boeing 787 Dreamliner, and another 34 individuals who were on the ground, were killed in the crash in Ahmedabad."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/british-influencer-miles-routledge-finds-airpods-in-jhelum-pakistan-a-year-after-losing-it-in-dubai-blames-indians-2748823-2025-07-01",
      "headline": "Cow-worshipping Indians to blame: UK vlogger after finding stolen AirPods in PakBritish YouTuber Miles Routledge found his stolen AirPods in Pakistan a year after losing them in Dubai. However, he directed his outrage at India, criticising Indian culture after being told that an Indian man had stolen his AirPods and sold them to a Pakistani. Last year, Routledge had sparked controversy for racist posts targeting Indians and for joking about nuking India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jaishankar-trump-india-pakistan-ceasefire-operation-sindoor-quad-summit-us-trade-2748892-2025-07-01",
      "headline": "I was there...: Jaishankar rejects Trump's repeated claims on India-Pak ceasefireDuring his visit to the United States, S Jaishankar dismissed President Donald Trump's repeated claim of brokering an India-Pakistan ceasefire, stressing that Operation Sindoor was India's firm response to terror."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/brandon-gill-indian-origin-wife-defends-his-remarks-on-zohran-mamdani-viral-video-2748771-2025-07-01",
      "headline": "Indian-origin wife of US Congressman defends his racist jab at Zohran MamdaniIt began after a video of New York City mayoral candidate Zohran Mamdani eating rice with his hands while speaking during an interview went viral on X. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/armenian-pm-nikol-pashniyan-offers-to-drop-his-pants-in-front-of-head-of-church-amid-coup-buzz-2748898-2025-07-01",
      "headline": "Armenian PM offers to drop his pants in front of head of church amid coup buzzAmid a rift with the Armenian Apostolic Church, Prime Minister Nikol Pashinyan made a scandalous remark. He vowed to 'bare himself' before the church's head. The statement comes in the wake of the church publicly denouncing the government's handling of the conflict with Azerbaijan, while the state has accused the clergy of attempting a coup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/sumit-antil-exclusive-para-javelin-able-bodied-tournaments-2748758-2025-07-01",
      "headline": "Bored of winning, para-javelin star Sumit Antil tests limits in able-bodied meetsTwo-time Paralympic gold medallist Sumit Antil, in conversation with India Today, spoke about competing in able-bodied events and his ultimate goal of breaching the 80m mark. The world record holder has begun preparation for the World Para Athletics Championships in September-October."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/randeep-surjewala-denies-leadership-change-in-karnataka-amid-buzz-siddaramaiah-dk-shivakumar-2748923-2025-07-01",
      "headline": "Answer is clearly no: Congress rules out leadership change in KarnatakaCongress leader Randeep Surjewala dismissed talks of a leadership change in Karnataka, saying BJP is spreading this to derail the government's welfare guarantees. He asserted that the government has enough funds for development."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/narayana-murthy-asked-indians-to-work-70-hours-now-infosys-is-telling-staff-to-avoid-overtime-and-maintain-work-life-balance-2748795-2025-07-01",
      "headline": "Narayana Murthy asked Indians to work 70 hours, now Infosys tells staff no overtimeInfosys has reportedly started an internal campaign urging employees to maintain work-life balance. The company is urging employees to limit overtime, especially during remote work. This "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/probably-have-to-close-shop-head-back-home-to-south-africa-trumps-searing-attack-on-elon-musk-over-tax-bill-2748751-2025-07-01",
      "headline": "Trump's 'shut shop, go back home' threat invites a dare from Elon MuskThe US President's fiery post came as Elon Musk renewed his criticism of Trump's 'Big, Beautiful bill' and promised to launch a new political outfit if it was passed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/brad-pitt-f1-album-hans-zimmer-races-ahead-with-its-music-heres-why-it-deserves-a-spotlight-2748893-2025-07-01",
      "headline": "Brad Pitt's F1 album races ahead with its music. Here's why it deserves a spotlightBrad Pitt's 'F1: The Movie' has taken the spotlight not only for its gripping story and stunning visuals, but also for its powerful music album featuring 17 high-energy tracks and Hans Zimmer's evocative score. The soundtrack makes for an essential part of the film's thrilling racing experience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/telangana/story/death-toll-rises-in-pashamylarama-sigachi-industries-pharma-plant-explosion-2748724-2025-07-01",
      "headline": "36 dead in Telangana pharma plant blast, bodies were pulled out of debrisThe death toll due to a reactor explosion at a chemical manufacturing plant in Telangana's Sangareddy district rose to 35. Rescue is ongoing, and a government inquiry has been ordered."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/video-shows-tn-police-assaulting-temple-security-guard-with-lathi-in-custodial-death-case-2748907-2025-07-01",
      "headline": "Tamil Nadu custodial death: Video shows cops thrashing temple guard with stickA video showing a 27-year-old temple security guard being beaten by a group of policemen has been exclusively accessed by India Today. Footage shows police using lathi to assault the man, who later died."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/opinion/story/vendetta-republic-minorities-women-justice-under-siege-in-yunus-bangladesh-2748551-2025-07-01",
      "headline": "Vendetta Republic: Minorities, women, justice under siege in Yunus's BangladeshIn Bangladesh, crimes against women seem to be on the rise at a time when Islamist radicals, who strongly back the Yunus regime, have taken to the streets to oppose women's rights. But the Yunus administration is in persistent denial. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shefali-jariwala-death-timeline-fasting-medication-autopsy-forensic-analysis-accidental-2748547-2025-06-30",
      "headline": "Held puja, observed fast, took anti-ageing drugs: Shefali Jariwala's last hoursActor Shefali Jariwala, of 'Kaanta Laga' fame, died on June 27. Here's a detailed report about the sequence of events, as confirmed by police sources."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kerala-healthcare-ventilator-congress-vd-satheesan-thiruvananthapuram-doctor-facebook-post-triggers-storm-veena-george-2748837-2025-07-01",
      "headline": "Kerala healthcare on ventilator? Doctor's FB post triggers storm, and a probeThe head of urology at the Government Medical College in Thiruvananthapuram has alleged that three of four surgeries are being postponed in his department due to lack of equipment. His angry post on Facebook has triggered a political storm in Kerala and forced the CPM-led government to form a probe panel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/family-offices-india-booming-ultrarich-wealth-creation-asset-management-tax-legal-2748784-2025-07-01",
      "headline": "Why India's ultra-rich love family officesForget yachts. For India's ultra-rich, the ultimate power move is a family office. Read on to see why it's becoming the new gold standard of wealth."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/grooming-gang-rochdale-leader-builds-house-pakistan-occupied-kashmir-uk-neighbour-live-in-fear-abdul-rauf-2748494-2025-07-01",
      "headline": "Fear in POK village as grooming gang leader faces deportation from UKConvicted grooming gang leader Abdul Rauf, living in Rochdale, UK, is building a house in his native village in Charhoi in Pakistan-occupied Kashmir (POK). Neighbours fear for their children's safety as the convicted sex offender walks freely without serving his full sentence. Though Rauf is fighting deportation, claiming he is stateless, the construction in POK village states otherwise."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-classic-sumit-antil-sun-pharma-doctor-day-2749004-2025-07-01",
      "headline": "Neeraj Chopra invited me to NC Classic: Paralympic champion Sumit AntilNeeraj Chopra invited Paralympic gold medallist Sumit Antil to participate in his historic javelin event in Bengaluru, revealed the latter in an exclusive interview with India Today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-icc-t20i-rankings-india-england-charani-2748977-2025-07-01",
      "headline": "ICC Player Rankings: Smriti Mandhana moves to third spot in T20IsIndia vice-captain Smriti Mandhana on Tuesday moved up one spot to be ranked third in the ICC rankings for batters in women's T20 Internationals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/india-2036-olympics-bid-gujarat-ioc-visit-2748950-2025-07-01",
      "headline": "Indian delegation visits Olympic headquarters in major push for 2036 hosting dreamsA high-level Indian delegation visited the IOC headquarters in Lausanne to advance the 2036 Olympic bid. The visit comes amid a pause in the host selection process, but India remains determined to host the Games."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-giovanni-perricard-fastest-serve-record-taylor-fritz-2748934-2025-07-01",
      "headline": "Watch: French player smashes Wimbledon record with 246 kph serve vs FritzFrance's Giovanni Perricard created history in the opening day of Wimbledon 2025 as the 6' 8 in player smashed the record for the fastest serve in the tournament's history. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-live-score-day-2-updates-novak-djokovic-jannik-sinner-iga-swiatek-2748926-2025-07-01",
      "headline": "Day 2 Live: Pegula kicks off proceedings vs Italian CocciarettoWimbledon 2025 Day 2 Live Score: It is set to be an exciting day of tennis in London, with former champion Novak Djokovic taking the stage. Powerhouses Jannik Sinner and Iga Swiatek are set to play their first round matches as well."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/delhi-premier-league-auction-rishabh-pant-digvesh-rathi-2748900-2025-07-01",
      "headline": "Rishabh Pant among 10 IPL players to feature in Delhi Premier League auctionDelhi Premier League auction is set to seem some of the biggest cricketing talent in the country. More than 10 IPL stars are going to participate in the auction including the likes of Rishabh Pant and Digvesh Rathi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fifa-club-world-cup-simone-inzaghi-al-hilal-manchester-city-mount-everest-2748889-2025-07-01",
      "headline": "Climbed Mount Everest: Inzaghi on Al-Hilal's win vs Manchester CitySimone Inzaghi compared their victory over Manchester City to climbing Mount Everest without oxygen. Such was the victory for the Saudi-based side against the Premier League giants in Manchester City. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-bumrah-selection-dilemma-second-test-edgbaston-2748859-2025-07-01",
      "headline": "India's Bumrah puzzle: Pundits add to selection drama before Birmingham TestEngland vs India: Jasprit Bumrah has been signed up to play only three of the five Tests in England. India are yet to take a call on his participation in the second Test, starting 2 July in Birmingham. But can they afford to play at Edgbaston without him?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/akash-deep-offers-shami-like-threat-bumrah-replacement-birmingham-test-2748856-2025-07-01",
      "headline": "Akash Deep offers Shami-like threat, should replace Bumrah if needed: PathanENG vs IND: Irfan Pathan highlighted how Akash Deep can provide a Shami-like threat with the ball, with his straight-seamed deliveries being a possible threat against the aggressive England batting unit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-wimbledon-2025-admitted-nervous-in-first-round-scare-fabio-fognini-2748804-2025-07-01",
      "headline": "Alcaraz felt Centre Court nerves after 1st round scare: Was struggling a bitCarlos Alcaraz highlighted that the weight of the occasion got to him during the first-round clash against Fabio Fognini which may have been a bit too close for comfort for the two-time champion. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yashasvi-jaiswal-removed-slip-position-india-catching-drills-birmingham-2748788-2025-07-01",
      "headline": "Why Yashasvi Jaiswal was relieved of slip duties ahead of Edgbaston TestEngland vs India: During India's intense fielding drills on Monday in Birmingham, young opener Yashasvi Jaiswal was a notable absentee in the slip cordon and in the gully region. The opener dropped as many as four catches in the first Test that India lost by five wickets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fifa-club-world-cup-simone-inzaghi-al-hilal-manchester-city-mount-everest-2748889-2025-07-01",
      "headline": "Climbed Mount Everest: Inzaghi on Al-Hilal's win vs Manchester CitySimone Inzaghi compared their victory over Manchester City to climbing Mount Everest without oxygen. Such was the victory for the Saudi-based side against the Premier League giants in Manchester City. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-bumrah-selection-dilemma-second-test-edgbaston-2748859-2025-07-01",
      "headline": "India's Bumrah puzzle: Pundits add to selection drama before Birmingham TestEngland vs India: Jasprit Bumrah has been signed up to play only three of the five Tests in England. India are yet to take a call on his participation in the second Test, starting 2 July in Birmingham. But can they afford to play at Edgbaston without him?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/akash-deep-offers-shami-like-threat-bumrah-replacement-birmingham-test-2748856-2025-07-01",
      "headline": "Akash Deep offers Shami-like threat, should replace Bumrah if needed: PathanENG vs IND: Irfan Pathan highlighted how Akash Deep can provide a Shami-like threat with the ball, with his straight-seamed deliveries being a possible threat against the aggressive England batting unit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-wimbledon-2025-admitted-nervous-in-first-round-scare-fabio-fognini-2748804-2025-07-01",
      "headline": "Alcaraz felt Centre Court nerves after 1st round scare: Was struggling a bitCarlos Alcaraz highlighted that the weight of the occasion got to him during the first-round clash against Fabio Fognini which may have been a bit too close for comfort for the two-time champion. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/yashasvi-jaiswal-removed-slip-position-india-catching-drills-birmingham-2748788-2025-07-01",
      "headline": "Why Yashasvi Jaiswal was relieved of slip duties ahead of Edgbaston TestEngland vs India: During India's intense fielding drills on Monday in Birmingham, young opener Yashasvi Jaiswal was a notable absentee in the slip cordon and in the gully region. The opener dropped as many as four catches in the first Test that India lost by five wickets."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}