{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdfc-bank-slashes-fd-and-savings-rates-again-in-june-details-here-2747224-2025-06-27",
      "headline": "HDFC Bank slashes FD and savings rates again in June. Details hereHDFC Bank's latest changes signal that deposit rates could remain soft if the RBI continues its rate-cutting cycle. Depositors should review their plans, stay updated with rate changes, and make informed decisions before booking new FDs or RDs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-may-soon-allow-direct-epf-withdrawals-via-atms-and-upi-2747195-2025-06-27",
      "headline": "EPFO may soon allow direct EPF withdrawals via ATMs and UPIThe EPFO recently increased the auto-settlement limit from Rs 1 lakh to Rs 5 lakh. This means members can get up to Rs 5 lakh cleared automatically within three days for things like medical expenses, education, housing, or marriage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-300-points-higher-nifty-above-25600-jio-financial-shares-jump-4-2747184-2025-06-27",
      "headline": "Sensex ends 300 points higher, Nifty above 25,600; Jio Financial shares jump 4%The S&P BSE Sensex ended 303.03 points higher at 84,058.90, while the NSE Nifty50 rose 88.80 to settle at 25,637.80."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/switched-jobs-this-year-here-is-how-to-file-your-itr-right-got-salary-from-two-employers-2747138-2025-06-27",
      "headline": "Switched jobs this year? Here's how to file your ITR rightIf you worked for more than one employer in the same year, make sure to report each salary and related deductions separately in the ITR form. Don't mix them up; each employer's income should be shown in its own section. This helps avoid overlaps and mistakes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/where-are-indias-ultra-rich-families-investing-in-2025-2747127-2025-06-27",
      "headline": "Where are India's ultra-rich families investing in 2025?A new EY–Julius Baer report, The Indian Family Office Playbook, reveals that many family offices are moving away from traditional wealth preservation and diving into global markets, private credit, and real assets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rs-45-lakh-for-raising-a-child-why-parenting-feels-like-a-luxury-now-2747066-2025-06-27",
      "headline": "Rs 45 lakh for raising a child? Why parenting feels like a luxury nowRising everyday expenses, pricey education and costly healthcare are forcing many young couples to think twice about kids. According to a startup founder, starting a family is personal, but money has become a key factor."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/madras-hc-supports-sbi-decision-cancelling-circle-based-officer-appointment-over-cibil-report-anomalies-bad-credit-score-2747020-2025-06-27",
      "headline": "Madras High Court backs bank appointment cancellation over adverse CIBIL reportThe Madras High Court upheld SBI's decision to cancel a candidate's appointment due to adverse credit history, stressing that financial discipline is essential for roles involving public money."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/no-guarantees-in-mutual-funds-investment-adviser-warns-against-risky-pf-advice-2747011-2025-06-27",
      "headline": "No guarantees in mutual funds: Investment adviser warns against risky PF adviceAn investment adviser explains why PF money should not be used for risky bets like mutual funds with \"guaranteed returns.\" "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-saving-30-percent-of-your-income-is-not-always-possible-ca-explains-2746968-2025-06-27",
      "headline": "Why saving 30% of your income isn't always possible, CA explainsFor those supporting families or beginning their careers, setting aside a significant portion of their income can be particularly challenging, explains CA Abhishek Walia. For those supporting families or beginning their careers, setting aside a significant portion of their income can be particularly challenging, he says."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-in-july-will-sensex-nifty-hit-record-high-explained-2746951-2025-06-27",
      "headline": "Will Sensex and Nifty hit record highs in July? Here's all you need to knowWith domestic flows steady and global risks fading, July could be the moment markets break through resistance. But with key events ahead, will momentum hold or falter?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jsw-paints-to-acquire-majority-stake-in-akzo-nobel-india-2746932-2025-06-27",
      "headline": "JSW Paints to acquire majority stake in Akzo Nobel IndiaWith this move, JSW Paints will take sole control of Akzo Nobel India, which operates under the Dulux brand, and emerge as the fourth-largest player in the decorative paints segment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-opens-140-points-higher-nifty-above-25600-it-stocks-gain-2746923-2025-06-27",
      "headline": "Sensex, Nifty open higher for 4th straight session as global cues aid momentumThe BSE Sensex opened with a gain of over 140 points and was trading 89.06 points higher at 83,844.93 around 9:22 am. The NSE Nifty50 breached the 25,600-mark at the open before paring some gains to trade 25.35 points up at 25,574.35."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/love-marriage-vikram-prabhu-film-pleasant-rom-com-that-never-achieves-its-full-potential-2747315-2025-06-27",
      "headline": "Love Marriage review: Pleasant rom-com that never achieves its full potentialReleased-Fri Jun 27, 2025Love Marriage review: Director Shanmuga Priyan's 'Love Marriage', starring Vikram Prabhu, Sushmitha Bhat and Meenakshi Dinesh, is a Tamil remake of the Telugu film, 'Ashoka Vanamlo Arjuna Kalyanam'. The pleasant romantic comedy is a perfect canvas for a laughter riot but bogged down by redundant ideas. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ayushmann-khurrana-reacts-to-oscars-academy-invitation-feels-honoured-to-represent-india-2747318-2025-06-27",
      "headline": "Ayushmann Khurrana reacts to Academy invitation, feels honoured to represent IndiaActor Ayushmann Khurrana has been invited to join the Oscars Academy, marking a significant achievement for Indian cinema. The actor reacted to the news and expressed his gratitude. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/india-is-remaking-brooklyn-nine-nine-kunal-kemmu-might-play-jake-peralta-reports-2747282-2025-06-27",
      "headline": "India is remaking Brooklyn Nine Nine, Kunal Kemmu might play Jake Peralta: Reports'Brooklyn Nine Nine' could get an Indian adaptation. The makers have reportedly discussed signing actor Kunal Kemmu to play Andy Samberg's character, Jake Perala. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-traitors-actor-purav-jha-teams-up-with-harsh-gujral-after-elnaaz-norouzis-exit-2747243-2025-06-27",
      "headline": "The Traitors: Actor Purav Jha teams up with Harsh Gujral after Elnaaz Norouzi's exitIn the new episode of 'The Traitors', actor Purav Jha teamed up with his friend Harsh Gujral. Jha appointed Gujral as the traitor after Norouzi was voted out in the circle of shaq."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vicky-kaushal-expresses-love-and-respect-for-his-love-and-war-colleagues-ranbir-kapoor-and-alia-bhatt-2747264-2025-06-27",
      "headline": "Vicky expresses love and respect for his Love & War colleagues, Ranbir and AliaVicky Kaushal opened up about how he felt working alongside Ranbir Kapoor and Alia Bhatt in 'Love & War'. The actors are once again sharing the silver screen in the Sanjay Leela Bhansali-directorial. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-gushes-over-rumoured-girlfriend-rashmika-mandanna-terrific-mysaa-poster-2747244-2025-06-27",
      "headline": "Vijay Deverakonda gushes over rumoured girlfriend Rashmika's terrific Mysaa posterActor Rashmika Mandanna shared the first look of her upcoming movie 'Mysaa'. She described her look as her fiercest avatar yet. Turns out her rumoured boyfriend, actor Vijay Devarakonda, also thinks that this is her one-of-a-kind portrayal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kpop-demon-hunters-exposes-fear-of-imperfection-2746395-2025-06-27",
      "headline": "How KPop Demon Hunters exposes our fear of imperfectionNetflix's latest anime, 'KPop Demon Hunters', showcases trendy songs and great choreography, but beneath it, is a scathing critique of societal expectations, personal shame, and the exhausting battle to be seen as you are. In this week's K-Fix, we discuss how an American film about the K-pop fandom becomes so much more. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thalapathy-vijay-meets-singapore-high-commissioner-simon-wong-politician-shares-pic-2747283-2025-06-27",
      "headline": "Thalapathy Vijay meets Singapore High Commissioner Simon Wong, politician shares picSimon Wong, the High Commissioner of the Republic of Singapore to India, recently met Thalapathy Vijay. Sharing a photo with the Tamil superstar, he posed an intriguing question to his followers.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/exclusive-vivek-agnihotri-on-india-soft-power-10-us-premieres-of-bengal-files-2747274-2025-06-27",
      "headline": "Exclusive: Vivek Agnihotri on India's soft power, 10 US premieres of Bengal FilesFilmmaker Vivek Agnihotri has decided to premiere his film 'The Bengali Files' in 10 US cities in a grand manner. But, what is this promotional strategy all about? He discussed it in an exclusive interview with IndiaToday.in. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-family-man-3-manoj-bajpayee-faces-new-nemesis-jaideep-ahlawat-in-spy-thriller-2747262-2025-06-27",
      "headline": "The Family Man 3: Manoj Bajpayee faces new nemesis, Jaideep Ahlawat in spy-thrillerPrime Video has released the announcement video for 'The Family Man 3', featuring new antagonists Jaideep Ahlawat and Nimrat Kaur. The third season brings intense espionage and higher stakes for Srikant Tiwari and his team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/esha-deol-and-ex-bharat-takhtani-make-joint-appearance-at-mumbai-airport-2747230-2025-06-27",
      "headline": "Esha Deol and ex Bharat Takhtani make joint appearance at Mumbai airportEsha Deol and Bharat Takhtani were seen together for the first time since their 2024 divorce, as they boarded a flight in Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actor-ravi-mohan-claim-of-living-in-rented-home-amid-divorce-sparks-backlash-2747205-2025-06-27",
      "headline": "Actor Ravi Mohan's claim of living in rented home amid divorce sparks backlashActor Ravi Mohan recently revealed that he has been living in a rented house since his split with estranged wife Aarti Ravi. His comments sparked backlash from social media users. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-celebrates-one-year-kalk-2898-ad-says-open-to-sequel-if-team-wants-him-2747231-2025-06-27",
      "headline": "Big B marks 1 year of Prabhas's Kalki, says open to sequel if team wants himAmitabh Bachchan shared a heartfelt post to celebrate one year of 'Kalki 2898 AD'. The veteran icon is looking forward to being a part of the sequel if the team ever asks him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-jin-announces-solo-concert-with-singer-choi-ye-na-details-out-2747129-2025-06-27",
      "headline": "BTS' Jin announces solo concert with singer Choi Ye-na. Here's all about itBTS member Jin is launching his highly anticipated solo fan concert tour. The tour is scheduled to begin in South Korea. Here's everything you need to know about the tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diljit-dosanjh-dropped-from-border-2-amid-row-over-casting-pakistani-actor-hania-amir-in-sardaar-ji-3-sources-2747180-2025-06-27",
      "headline": "Diljit Dosanjh likely to be replaced in Border 2 amid Sardaar Ji 3 row: SourcesActor Diljit Dosanjh is likely to be replaced by Ammy Virk in 'Border 2'. This comes amid a row surrounding his Punjabi film 'Sardaar Ji 3'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/umrao-jaan-director-calls-bhansali-heeramandi-over-the-top-too-palatial-rich-2747118-2025-06-27",
      "headline": "Umrao Jaan director calls Bhansali's Heeramandi over the top: Too palatial and richDirector Muzaffar Ali recently expressed his views on Sanjay Leela Bhansali's show 'Heeramandi'. His classic 'Umrao Jaan' featuring Rekha re-released in theatres on June 27."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/video/exclusive-park-sung-hoon-on-squid-game-3-dealing-with-hate-visiting-india-queen-of-tears-2747164-2025-06-27",
      "headline": "Exclusive: Park Sung-hoon on Squid Game 3, dealing with hate, visiting India | Queen of TearsIn an exclusive conversation with India Today's Bhavna Agarwal, Squid Game 3 star Park Sung-hoon opens up about playing Hyun-ju, a transgender woman with selfless heart in the show, playing villain roles and India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/park-sung-hoon-squid-game-3-hyun-ju-message-for-indian-fans-2747158-2025-06-27",
      "headline": "Exclusive: Park Sung-hoon discusses playing transgender Hyun-ju on Squid Game 3Actor Park Sung-hoon takes on a groundbreaking role as Hyun-ju, a transgender woman, in Squid Game 3. His performance highlights empathy and moral strength amid the series' intense drama."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/actor-sudhanshu-pandey-slams-ram-kapoor-for-offensive-remarks-apologises-to-women-2747139-2025-06-27",
      "headline": "Actor Sudhanshu Pandey slams Ram Kapoor for offensive remarks, apologises to womenActor Sudhanshu Pandey has openly criticised Ram Kapoor's inappropriate comments made during the 'Mistry' promotional tour. He has also issued a sincere apology to women on behalf of the television industry, highlighting the need for respect and decency."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kolkata-law-student-spurned-marriage-proposal-locked-inside-college-guard-room-and-gang-raped-later-police-2747135-2025-06-27",
      "headline": "Touched his feet but he didn't let me go: Kolkata law student's rape complaintA 24-year-old student said in her complaint that she was gang-raped inside a Kolkata law college after rejecting a marriage proposal from the main accused. She said the assault was filmed and used to blackmail and threaten her."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/charade-at-paks-behest-india-rejects-court-of-arbitrations-ruling-on-jk-hydropower-project-2747313-2025-06-27",
      "headline": "Charade at Pak's behest: India on Court of Arbitration 'ruling' on J&K dam projectIndia has rejected a so-called Court of Arbitration ruling that issued a \"supplemental award\" on its competence concerning the Kishenganga and Ratle hydroelectric projects in Jammu and Kashmir."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjp-trinamool-student-leader-accused-gang-rape-law-student-accused-pics-2747240-2025-06-27",
      "headline": "BJP claims Kolkata rape accused seen with Trinamool leaders, party says no linkThe BJP claimed that Manojit Mishra, the main accused in the Kolkata gang-rape of a law student, was seen with top Trinamool Congress leaders. However, the Trinamool Congress sought to distance itself from the accused, saying it had no links with him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/films-named-after-sita-ram-why-janaki-a-problem-kerala-high-court-pulls-up-censor-board-for-blocking-release-2747203-2025-06-27",
      "headline": "Ram Lakhan okay, but not Janaki? Kerala High Court raps censor board over film rowThe Kerala High Court questioned the Central Board of Film Certification's objection to the name 'Janaki' in JSK – Janaki vs State of Kerala, starring Union Minister Suresh Gopi and actor Anupama Parameswaran, asking why similar names in older films never faced complaints."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/the-gaza-grind-and-iranian-gambit-will-have-a-cost-for-israel-2747190-2025-06-27",
      "headline": "The Gaza Grind and Iranian Gambit Will Have a Cost for IsraelIsrael's fan club is shrinking in the West. UK and European Parliaments are echoing public disgust with calls for ceasefire and arms embargoes. Enemies are emboldened, allies are wavering. And the Gaza grind is bleeding goodwill. Israel simply needs a new script."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/probe-new-york-mayor-election-democratic-zohran-mamdani-citizenship-deport-demand-republicans-us-mira-nair-2747080-2025-06-27",
      "headline": "Calls for Zohran Mamdani's deportation; Trump's border czar says 'game on'Republicans are demanding a federal probe into NYC mayoral candidate Zohran Mamdani's citizenship, with some calling for his deportation. Critics accuse him of ties to extremism and the Palestinian terror group, Hamas. The backlash, by Republicans like President Donald Trump's son, includes Islamophobic rhetoric and accusations of being a Hamas sympathiser."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/trinamool-mp-kalyan-banerjee-avoid-bad-company-shocker-on-kolkata-law-student-gangrape-2747202-2025-06-27",
      "headline": "Trinamool MP's 'avoid bad company' shocker on law student's gangrapeIn what appears to be a blatant case of survivor-shaming, Trinamool Congress MP Kalyan Banerjee said, 'Those who are roaming around with such people should understand whom they are accompanying.' He further asserted that no law or police force could stop rapes until the 'dirty mindsets' of some men are changed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/hyderabad/story/hyderabad-couple-arrested-for-live-streaming-sex-acts-for-money-2747268-2025-06-27",
      "headline": "Rs 1,000 for 5 minutes: Hyderabad couple livestreamed sex acts, arrestedA Hyderabad couple has been arrested for allegedly performing masked sexual acts on live streams for paying viewers, charging Rs 1,000 per 5-minute session and blackmailing some viewers for more money."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/south-africa-country-junked-nuclear-weapons-helped-non-proliferation-treaty-ben-gurion-nehru-golda-meir-iran-2746849-2025-06-27",
      "headline": "How a country that helped Israel get nuclear weapons junked its own nukesIsrael, the only undeclared nuclear power, started work on its N-weapons programme within years of the founding of the Jewish nation. One of its clandestine partners was apartheid-era South Africa. While Israel is said to be in possession of 90 warheads now, South Africa signed the NPT and junked its nukes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/meril-launches-myclip-indias-first-transcatheter-edge-to-edge-repair-teer-system-for-treatment-of-severe-mitral-regurgitation-2745354-2025-06-24",
      "headline": "Meril Launches MyClip, India's First Transcatheter-Edge-to-Edge Repair (TEER) SystemThe launch of MyClip TEER System marks a transformative moment for structural heart therapy in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/diljit-dosanjh-dropped-from-border-2-amid-row-over-casting-pakistani-actor-hania-amir-in-sardaar-ji-3-sources-2747180-2025-06-27",
      "headline": "Diljit Dosanjh likely to be replaced in Border 2 amid Sardaar Ji 3 row: SourcesActor Diljit Dosanjh is likely to be replaced by Ammy Virk in 'Border 2'. This comes amid a row surrounding his Punjabi film 'Sardaar Ji 3'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/new-york-city-zohran-mamdani-gujarat-muslim-narendra-modi-claim-draws-flak-called-out-for-blatant-lies-2747173-2025-06-27",
      "headline": "Zohran Mamdani's Gujarat Muslim remark draws flak, called out for 'blatant lies'It was Zohran Mamdani's claim that only a few Muslims remain in Gujarat that drew criticism from several quarters, including Opposition leaders in India, who were quick to fact-check the far-left figure. Many cited the last published census data of Gujarat, according to which Muslims made up at least 10 percent of the state's population."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/where-are-indias-ultra-rich-families-investing-in-2025-2747127-2025-06-27",
      "headline": "Where are India's ultra-rich families investing in 2025?A new EY–Julius Baer report, The Indian Family Office Playbook, reveals that many family offices are moving away from traditional wealth preservation and diving into global markets, private credit, and real assets."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/one-accused-two-aides-in-kolkata-law-college-gangrape-case-why-all-three-face-same-charges-2747214-2025-06-27",
      "headline": "One raped, others looked on: Why all 3 face equal charges in Kolkata gang rape caseA 24-year-old woman has alleged that a former student of South Calcutta Law College, along with two current students, gang-raped her on June 25 after she declined a proposal of marriage. While only one man physically raped the woman, the others played active roles in facilitating and enabling the crime."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/amit-shah-confirms-annamalai-will-take-key-national-role-while-staying-active-in-tamil-nadu-politics-2746991-2025-06-27",
      "headline": "Annamalai to get national role but continue work in Tamil Nadu: Amit ShahUnion Home Minister Amit Shah revealed that former Tamil Nadu BJP state chief K Annamalai will be given national responsibilities, while playing key role in Tamil Nadu politics. Shah also asserted that the NDA will form the Tamil Nadu government in 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kolkata-law-college-gang-rape-case-three-arrested-including-staff-member-2747081-2025-06-27",
      "headline": "Student gang-raped in Kolkata law college, Trinamool leader, 2 students arrestedA 24-year-old law student in south Kolkata was allegedly gang-raped inside the college premises. Three accused were arrested in the case, including two students and a staffer - who is a Trinamool Congress student wing leader."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/lifestyle/what-s-hot/story/quiet-cracking-reasons-and-solution-2746990-2025-06-27",
      "headline": "Resignation mail in drafts? It could be Quiet CrackingQuiet cracking is basically a persistent sense of workplace unhappiness caused by feeling unseen, unheard, and unsupported, leading to disengagement, poor performance, and a growing urge to quit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/books/story/side-effects-to-surprises-dr-ambrish-mithal-on-indias-weight-loss-drug-revolution-2747188-2025-06-27",
      "headline": "Side effects to surprises: Dr Ambrish Mithal on India's weight-loss drug revolutionIn this episode of 'Booked', top endocrinologist Dr. Ambrish Mithal unpacks the world of new-age weight-management drugs, their side effects, their benefits and what lies ahead in his new book The Weight Loss Revolution."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/british-f35-jet-stranded-thiruvananthapuram-airport-repair-40-member-team-uk-tow-vehicle-airlift-repair-2746623-2025-06-27",
      "headline": "Tow trolley, 40 staffers from UK as F-35 refuses to leave Kerala even after 13 daysBraving rain on Thiruvananthapuram airport's tarmac, the British $110-million stealth F-35B jet remains grounded in Kerala, now to be towed into a hangar for repairs. A special tow vehicle and 40 UK engineers are flying in to fix the hydraulic snag that's kept the F-35B earthbound since June 14."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/squid-game-3-review-lee-jung-jae-show-deadly-but-less-thrilling-netflix-2747132-2025-06-27",
      "headline": "Squid Game 3 review: Lee Jung-jae's show is still deadly but less thrillingReleased-Fri Jun 27, 2025'Squid Game 3' review: Lee Jung-jae's 'Squid Game Season 3' released on Netflix today, June 27. The gripping and well-crafted series has its own moments of falter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/forgotten-freedom-fighter-thakur-chedilal-india-independence-2744941-2025-06-27",
      "headline": "Thakur Chedilal, the Oxford lawyer who lit the fire of rebellion in Central IndiaHe was once eyed by Gandhi and Patel for the highest office, yet history let him slip through its pages. The story of Thakur Chedilal is one of quiet defiance, buried legacy, and unshakable patriotism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shubhanshu-shukla-international-space-station-iss-india-view-from-space-rakesh-sharma-first-indian-2746977-2025-06-27",
      "headline": "From Sharma to Shukla, night lights reveal India's transformation over the yearsIf Rakesh Sharma, the first Indian to fly to space in 1984, were to travel to space once again, the view of India's night-time lights would leave him transfixed. Night-time lights as seen from space indicate economic progress and urbanisation. This is how the look of India has changed from Sharma to Shubhanshu Shukla in 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/s-jaishankar-sco-summit-document-pakistan-veiled-dig-terrorism-reference-rajnath-singh-2747196-2025-06-27",
      "headline": "No terror mention, no deal: S Jaishankar backs Rajnath Singh's Shanghai meet standBacking Defence Minister Rajnath Singh's stand to not sign the document at the SCO Defence Ministers' meeting, External Affairs Minister S Jaishankar took a veiled dig at Pakistan, saying it did not want a reference to terrorism in the communique."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/elderly-woman-tied-men-locked-in-basement-noida-sector-55-old-age-home-raid-reveals-abuse-2747086-2025-06-27",
      "headline": "Urine and faeces on clothes, tied up, locked in rooms: Noida old age home horrorDuring the raid, a woman claiming to be a nurse was found, but investigation revealed she was only 12th-pass. Elderly residents were found in clothes soiled with urine and faeces.The residents were forced to care for themselves. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zimbabwe-vs-south-africa-dewald-brevis-keshav-maharaj-2747317-2025-06-27",
      "headline": "Dewald Brevis set for debut in Keshav Maharaj-led new-look XIZimbabwe (ZIM) vs South Africa (SA), 1st Test: Keshav Maharaj will lead a new-look XI in the series opener against Zimbabwe. Batting stars Dewald Brevis and Lhuan-dre Pretorius are set to make their debuts on Saturday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sri-lanka-vs-bangladesh-3rd-day-colombo-test-report-kamindu-mendis-2747308-2025-06-27",
      "headline": "Sri Lanka close in on series win as Bangladesh collapse under spin pressureSri Lanka's spin dominance and batting grit put them on the verge of an innings victory over Bangladesh in Colombo, with just four wickets separating them from a commanding series sweep at home."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sunil-gavaskar-warns-fans-fakes-quotes-fact-check-verify-2747171-2025-06-27",
      "headline": "Sunil Gavaskar warns fans on fakes quotes attributed to himSunil Gavaskar has warned fans about websites and individual accounts misusing his name by attributing fake quotes. He implored that the fans always verify and fact-check such information before believing it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-premier-league-up-warriorz-jon-lewis-leaves-after-three-years-2747285-2025-06-27",
      "headline": "WPL: UP Warriorz part ways with Jon Lewis after three-year associationUP Warriorz have announced that head coach Jon Lewis has left the role on Friday, June 27. Lewis guided the Warriorz to the play-offs in his first season in charge of the franchise.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/paralympics-sheetal-devi-driving-using-her-feet-stunning-clip-goes-viral-2747220-2025-06-27",
      "headline": "Sheetal Devi starts driving using her feet, stunning clip goes viralSheetal Devi took fans online by storm as she was seen on video driving a vehicle with just her two feet. The star Paralympian continues to defy the odds regardless of how stacked it may be against her."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-draw-carlos-alcaraz-jannik-sinner-novak-djokovic-2747199-2025-06-27",
      "headline": "Wimbledon draw: Alcaraz faces tough test, Sinner and Djokovic in same halfThe Wimbledon 2025 draw promises drama as Carlos Alcaraz defends his crown, Novak Djokovic chases a 25th Slam, and Jannik Sinner eyes redemption — all while tennis braces for a thrilling generational shift on grass."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-united-ruud-van-nistelrooy-sacked-leicester-city-2747198-2025-06-27",
      "headline": "Manchester United legend Ruud van Nistlerooy sacked as Leicester City bossLeicester City have decided to part ways with Ruud van Nistelrooy on Friday, June 27 after the club was relegated from the Premier League last season. Van Nistelrooy joined the club in November last year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/javelin-neeraj-chopra-nc-classic-fan-request-vvip-experience-bengaluru-2747183-2025-06-27",
      "headline": "Fan asks Rs 2000 to watch NC Classic, Neeraj Chopra offers him VVIP experienceNeeraj Chopra, in a heartwarming gesture, offered a fan full VVIP experience for the upcoming NC Classic in Bengaluru, scheduled to be held on July 5. Neeraj is set to host the event, which will feature some of javelin's finest stars. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-cricketer-accused-sexual-harassment-rape-guyana-investigation-2747163-2025-06-27",
      "headline": "West Indies cricketer accused of sexual assault, victims allege cover-up: ReportAt least eleven women, including a teenager, have accused a West Indies cricketer of sexual harassment. The player, who is from Guyana, is at the centre of allegations that local authorities have attempted to cover up, according to media reports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-women-2025-full-squads-streaming-all-you-need-to-know-2747104-2025-06-27",
      "headline": "ENG vs IND Women's ODI and T20I Live Streaming: All you need to knowEngland vs India Women's ODI, T2OI series 2025 Live Streaming: England will host the Indian women's team for five T20Is and three ODIs. With the ODI World Cup fast approaching, both teams will aim to put their best foot forward and fine-tune their combinations across the series.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-draw-carlos-alcaraz-jannik-sinner-novak-djokovic-2747199-2025-06-27",
      "headline": "Wimbledon draw: Alcaraz faces tough test, Sinner and Djokovic in same halfThe Wimbledon 2025 draw promises drama as Carlos Alcaraz defends his crown, Novak Djokovic chases a 25th Slam, and Jannik Sinner eyes redemption — all while tennis braces for a thrilling generational shift on grass."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-united-ruud-van-nistelrooy-sacked-leicester-city-2747198-2025-06-27",
      "headline": "Manchester United legend Ruud van Nistlerooy sacked as Leicester City bossLeicester City have decided to part ways with Ruud van Nistelrooy on Friday, June 27 after the club was relegated from the Premier League last season. Van Nistelrooy joined the club in November last year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/javelin-neeraj-chopra-nc-classic-fan-request-vvip-experience-bengaluru-2747183-2025-06-27",
      "headline": "Fan asks Rs 2000 to watch NC Classic, Neeraj Chopra offers him VVIP experienceNeeraj Chopra, in a heartwarming gesture, offered a fan full VVIP experience for the upcoming NC Classic in Bengaluru, scheduled to be held on July 5. Neeraj is set to host the event, which will feature some of javelin's finest stars. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-cricketer-accused-sexual-harassment-rape-guyana-investigation-2747163-2025-06-27",
      "headline": "West Indies cricketer accused of sexual assault, victims allege cover-up: ReportAt least eleven women, including a teenager, have accused a West Indies cricketer of sexual harassment. The player, who is from Guyana, is at the centre of allegations that local authorities have attempted to cover up, according to media reports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-women-2025-full-squads-streaming-all-you-need-to-know-2747104-2025-06-27",
      "headline": "ENG vs IND Women's ODI and T20I Live Streaming: All you need to knowEngland vs India Women's ODI, T2OI series 2025 Live Streaming: England will host the Indian women's team for five T20Is and three ODIs. With the ODI World Cup fast approaching, both teams will aim to put their best foot forward and fine-tune their combinations across the series.\r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}