{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/credit-score-check-why-and-how-often-should-you-review-it-2664595-2025-01-14",
      "headline": "Credit score check: Why and how often should you review it?A credit score is a numerical measure of your creditworthiness, based on payment history, debt, and credit history length."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-close-higher-adani-enterprises-gain-7-percent-adani-ports-rise-2664584-2025-01-14",
      "headline": "Sensex, Nifty snap losing streak to end higher; Adani stocks gain up to 7%The S&P BSE Sensex gained169.62 points to close at 76,499.63, while the NSE Nifty50 added 90.10 points to end at 23,176.05. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/looking-for-an-online-personal-loan-check-these-7-simple-steps-2664570-2025-01-14",
      "headline": "Looking for an online personal loan? Check these 7 simple steps To avoid delays in your online personal loan application, ensure you meet the eligibility criteria and have all necessary documents ready."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-how-government-can-prioritise-job-creation-and-skill-development-2664523-2025-01-14",
      "headline": "Budget 2025: How government can prioritise job creation and skill development The upcoming Budget 2025 is expected to focus on economic growth while addressing key challenges and leveraging opportunities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/biocon-share-price-rise-reason-surged-7-percent-today-hsbc-rating-upgrade-2664516-2025-01-14",
      "headline": "Explained: Why Biocon shares surged 7% today Biocon share price: The stock has gained 9.66% in the last month, 7.99% over the past six months, and an impressive 37.98% in the last year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-what-nris-are-expecting-from-nirmala-sitharaman-2664427-2025-01-14",
      "headline": "Budget 2025: What NRIs are expecting from Nirmala SitharamanAll eyes are on the Union Budget 2025, set to be announced in February, for key reform announcements."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hcltech-shares-tumble-nearly-10-after-q3-results-what-should-investors-do-2664501-2025-01-14",
      "headline": "HCLTech shares tumble nearly 10% after Q3 results. What should investors do?Several brokerages have shared their views on the IT giant's Q3 results. Brokerage firm Morgan Stanley maintained an 'Equal-Weight' rating with a target price of Rs 1,970."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/truly-disheartening-l-and-t-hr-head-defends-chairman-amid-90-hour-workweek-row-2664470-2025-01-14",
      "headline": "Truly disheartening: L&T HR head defends chairman amid 90-hour workweek rowL&T Chairman S N Subrahmanyan's 90-hour workweek remark has triggered debate on work-life balance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-power-adani-green-why-adani-group-shares-jumped-up-to-18-percent-today-stmp-2664471-2025-01-14",
      "headline": "Adani Power, Adani Green: Why Adani Group shares jumped up to 18% todayAdani Group shares: At 12:05 pm, Adani Power soared 18.05% to Rs 531.40 on the Bombay Stock Exchange (BSE), while Adani Green Energy climbed 14.15% to Rs 1,015.80. Adani Enterprises, the group's flagship company, was trading 8% higher at Rs 2,401.75."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jsw-energy-shares-price-rise-why-6-percent-today-ksk-mahanadi-power-company-limited-kmpcl-accquisition-stmp-2664434-2025-01-14",
      "headline": "JSW Energy shares price rises 6% today. Here's why JSW Energy share price: The stock has lost 20.14% in the last month and 23.69% over the past six months. Despite the recent decline, JSW Energy has gained 16.15% over the past year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jsw-energy-share-price-jumps-over-7-percent-key-factors-behind-gain-explained-stmp-2664433-2025-01-14",
      "headline": "JSW Energy share price jumps nearly 7%. Why is it gaining today?JSW energy share price: The stock opened at Rs 528.15, and climbed to an intraday high of Rs 552.50 at around 11:07 am, marking a jump of 6.59% jump."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hcltech-stock-price-fell-nearly-10-despite-positive-q3-results-explained-stmp-2664425-2025-01-14",
      "headline": "Explained: Why HCLTech share price fell nearly 10% despite positive Q3 resultsHCLTech share price: At 10:46 am, HCLTech's shares were trading 9.02% lower at Rs 1,806.20 on the Bombay Stock Exchange (BSE). Earlier, its shares hit an intraday low of Rs 1,798.40."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-and-nifty-rebound-why-is-stock-market-rising-today-key-factors-explained-2664418-2025-01-14",
      "headline": "Sensex, Nifty rebound: What's driving today's gains, and will the recovery last?Despite today's rally, the stock market remains under pressure due to several factors, especially the impact of Q3 earnings and sustained selling by foreign institutional investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/quadrant-future-tek-shares-price-listing-makes-strong-debut-lists-at-27-percent-premium-nse-bse-2664408-2025-01-14",
      "headline": "Quadrant Future Tek listing: Shares make strong D-Street debut at 27% premium Quadrant Future Tek stock: The stock opened at Rs 370 on the NSE, reflecting a 27.5% premium over its IPO price of Rs 290. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-stock-market-rebound-sensex-nifty-gain-in-early-trade-hcltech-down-9-percent-2664400-2025-01-14",
      "headline": "Stock market rebound: Sensex, Nifty gain in early trade; HCLTech down 9% The S&P BSE Sensex gained 408.52 points to 76,738.53, while the NSE Nifty50 110.05 points to 23,196.00 as of 9:30 AM."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tiktok-us-may-go-to-tesla-ceo-elon-musk-as-china-explores-potential-sale-report-2664398-2025-01-14",
      "headline": "TikTok US may go to Elon Musk as China explores potential sale: ReportChinese authorities want to keep TikTok under the control of its parent company, ByteDance. One potential scenario involves Elon Musk's social media platform, X, acquiring TikTok US and running it jointly with ByteDance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-holiday-are-bse-nse-open-on-tuesday-january-14-for-pongal-makar-sankranti-2025-2664384-2025-01-14",
      "headline": "Stock market holiday: Are BSE, NSE open on January 14, Makar Sankranti?The holiday schedules for the BSE and NSE are determined based on national holidays and key religious and cultural festivals that are widely observed across the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-today-sensex-nifty-red-alert-on-dalal-street-should-investors-worry-stop-sip-expert-views-2664377-2025-01-14",
      "headline": "Red alert on Dalal Street: Should investors worry?Sensex, Nifty today: While the sharp decline may cause concern, historical data suggests that market corrections are not uncommon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-sensex-nifty-jsw-cements-hdfc-hcltech-delta-corp-united-spirits-bel-2664373-2025-01-14",
      "headline": "Stocks to watch today: JSW Cements, HDFC AMC, HCLTech, BEL, Adani WilmarStocks such as JSW Cements, HDFC AMC, HCLTech, Delta Corp, United Spirits, and BEL are expected to remain in focus."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/retail-inflation-eases-to-4-month-low-of-522-in-december-2024-2664141-2025-01-13",
      "headline": "Retail inflation eases to 4-month low of 5.22% in DecemberIndia's inflation eased to 5.22% in December 2024 as food prices slowed, with the RBI maintaining a cautious policy stance."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/will-summon-meta-for-disinformation-parliamentary-panel-chief-after-mark-zuckerbergs-2024-lok-sahba-polls-claim-2664548-2025-01-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Meta in trouble after Zuckerberg's election claim, faces parliamentary summonsMeta boss Mark Zuckerberg had suggested that most incumbent governments worldwide, including India, were defeated in elections held post-Covid-19. His statement triggered a massive political row."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sharad-pawar-ncp-rift-maha-vikas-aghadi-mumbai-civic-polls-india-bloc-future-2664543-2025-01-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "INDIA for national polls: Sharad Pawar fuels MVA rift talk ahead of civic pollsSharad Pawar on Tuesday hinted that the party was likely to follow in the footsteps of Uddhav Sena and contest the Mumbai civic polls alone. The remark comes as the MVA is smarting from its Assembly election drubbing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-hoax-calls-accused-linked-to-political-party-claims-cops-2664564-2025-01-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Cops say NGO with political ties linked to Delhi hoax calls case, BJP blames AAPDelhi Police has uncovered key details while investigating hoax bomb emails sent to over 400 schools, which caused widespread alarm among students and disrupted classes. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/delhi-assembly-election-slum-slum-dwellers-population-housing-aap-arvind-kejriwal-bjp-congress-rahul-gandhi-2664539-2025-01-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why the way to power in Delhi is through its slumsAhead of the Delhi Assembly election, the AAP, BJP, and Congress have sharpened their pitch on slums and are courting the city's over three million slum dwellers. The residents of the 675 slums in Delhi form around 15% of Delhi's electorate, and any swing in their voting pattern will impact the fortunes of the parties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-rates-coach-andy-murray-first-impression-australian-open-nishesh-basavareddy-2664572-2025-01-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "All new coaching pods a hit? Novak Djokovic rates Andy Murray's first impressionNovak Djokovic flaunted his partnership with Andy Murray at the Australian Open amid the debut of coaching pods, an interesting innovation allowing closer coach-player communication. While Djokovic embraced the setup, other players, including Aryna Sabalenka, expressed concerns about the change."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/is-elon-musk-buying-tiktok-amid-threat-of-us-ban-here-is-the-full-story-in-5-points-2664580-2025-01-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Is Elon Musk buying TikTok amid threat of US ban? Here is the full story in 5 pointsChina is reportedly considering selling TikTok's US operations to Elon Musk if the app fails to avoid a potential ban, raising questions about its future in the American market."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/maha-kumbh-mahakumbh-mela-2025-steve-jobs-wife-falls-unwell-2664545-2025-01-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Steve Jobs's wife falls ill at Maha Kumbh Mela: Never experienced such crowdDespite her illness, Laurene Powell Jobs is determined to take part in the ritual of taking a holy dip at the Sangam, the confluence of the Ganga, Yamuna, and mythical Saraswati rivers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/h1b-visa-programme-us-companies-hiring-remotely-avoid-complex-costly-process-foreign-workers-indians-tech-2664509-2025-01-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "To beat H-1B visa challenges, US companies are turning to remote hiringAmid the debate over the H-1B visa programme as Donald Trump is set to take over as the American President, companies in the US are increasingly turning to remote hiring to avoid the complex and costly process of securing H-1B visas for foreign workers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/watch-amit-shah-flies-kite-on-makar-sankranti-in-ahmedabad-2664604-2025-01-14?utm_source=Videos_hp&utm_medium=Videos&utm_campaign=home_Videos",
      "headline": "Watch: Amit Shah flies kite on Makar Sankranti in AhmedabadUnion Home Minister Amit Shah and Gujarat Chief Minister Bhupendra Patel celebrated Makar Sankranti by flying kites on Tuesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/arvind-kejriwal-one-line-rahul-gandhi-jugalbandi-swipe-congress-bjp-delhi-election-2664464-2025-01-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "I spoke about Rahul Gandhi, hurt BJP replied: Arvind Kejriwal's 'nexus' chargeThe AAP has been attacking its INDIA bloc ally Congress and alleging a nexus with the BJP amid a fierce triangular contest in the Delhi elections."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-daniil-medvedev-vs-kasidit-samrej-high-praise-joke-melbourne-crowd-2664544-2025-01-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Money, girls, casino: Inimitable Medvedev praises opponent after tough openerAustralian Open 2025: Fifth seed Daniil Medvedev was at his inimitable best when he praised Kasidit Samrej, who dragged the Russian to five sets in their opening-round clash on Tuesday, January 14. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ram-temple-consecration-day-true-independence-rss-chief-mohan-bhagwat-2664319-2025-01-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "RSS chief Mohan Bhagwat's 'true independence' remark sparks rowMohan Bhagwat's remarks faced criticism from Shiv Sena (UBT) MP Sanjay Raut, who said that Ram Lalla was not brought by the RSS."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-no-wives-girlfriends-indian-team-tour-series-champions-trophy-bgt-rohit-sharma-virat-kohli-2664421-2025-01-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "BCCI's new rules after Australia tour disaster, curbs on WAGs' stay during toursThe Indian Cricket Board has reacted sharply to India's loss in the Border-Gavaskar Trophy. Sources have told India Today that the BCCI has cracked the whip on the Indian team and has taken strict steps to get their focus back on the game.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-v-narayanans-stint-as-new-isro-chief-will-be-full-of-possibilities-2664055-2025-01-13?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why V Narayanan's stint as new ISRO chief will be full of possibilitiesThe rocket and spacecraft propulsion expert enters the top orbit of ISRO at a time the organisation has lined up a series of high-profile and ambitious missions\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/jammu-and-kashmir/story/mine-blast-loc-jammu-and-kashmir-rajouri-district-nowshera-2664538-2025-01-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "6 jawans injured in accidental mine blast near LoC in J&K's Rajouri: SourcesPersonnel from the Gorkha Rifles were conducting a routine patrol near Khamba Fort in Rajouri at around 10.45 am on Tuesday, when an accidental blast took place."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bengal-woman-carries-injured-husband-on-back-raiganj-government-hospital-fails-to-provide-wheelchair-2664541-2025-01-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bengal woman carries husband on back after hospital fails to provide wheelchairPhotos and videos of Salita Barman carrying her injured husband have gone viral, drawing widespread condemnation and highlighting the lack of basic amenities at the state-run hospital."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/golden-retriever-energy-partner-dating-singles-2664441-2025-01-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Is chasing 'golden retriever energy' in a partner overrated?According to a Tinder survey, 45 per cent of singles are now looking for a 'golden retriever type' in 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/author-neil-gaiman-sexual-assault-allegations-babysitter-nanny-bdsm-master-slave-2664440-2025-01-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'The Sandman' author Neil Gaiman raped babysitter in front of his son: ReportA bombshell report details further sexual assault allegations by eight women against author Neil Gaiman, including claims of rape and abuse by a former babysitter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/california-wildfires-malibu-concrete-mansion-survived-los-angeles-palisades-inferno-us-houses-timber-2664184-2025-01-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How this Malibu mansion defeated wildfire. It's a concrete miracleAmid the devastation in Malibu from the California wildfires, a USD 9-million mansion stands unscathed and defiant. Its owner, a retired waste-management executive, called it a \"miracle\". However, the three-storey house's survival is more of science than miracle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/yuvraj-singh-father-slams-hindi-films-actors-calls-taare-zameen-par-rubbish-2664520-2025-01-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Yuvraj Singh's father slams Hindi films, actors, calls Taare Zameen Par rubbishYuvraj Singh's father, Yograj Singh, criticised Taare Zameen Par and Hindi films, calling them 'rubbish'. He praised Hollywood classics like The Godfather. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/terrace-tourism-old-ahmedabad-gujrat-kite-string-uttarayan-makar-sankranti-patang-explained-roof-on-rent-2664479-2025-01-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Terrace tourism for kite-flying in Uttarayan: Old Ahmedabad's new business ideaThere could be no better place to fly kites and celebrate Uttarayan than Old Ahmedabad with its high-density rooftops, believe many Gujaratis. That craze has kick-started terrace tourism and homeowners are renting out rooftops for up to Rs 1 lakh. Then there are packages that include food, music and even massages."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/move-over-ozempic-this-new-drug-claims-to-reduce-weight-faster-2664499-2025-01-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Move over Ozempic, this new drug claims to reduce weight fasterRetatrutide, an experimental drug by Eli Lilly, shows promising results in weight loss by targeting three hormones, potentially outperforming current treatments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-flies-us-flag-at-full-height-before-end-of-jimmy-carter-mourning-period-2664537-2025-01-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump flies US flag at full height before end of Jimmy Carter's mourning periodBoth President Joe Biden, a Democrat, and Florida Gov. Ron DeSantis, a Republican, directed that US flags be flown at half-staff for 30 days from the date of Carter's death — or through Jan. 28."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/truly-disheartening-l-and-t-hr-head-defends-chairman-amid-90-hour-workweek-row-2664470-2025-01-14?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Truly disheartening: L&T HR head defends chairman amid 90-hour workweek rowL&T Chairman S N Subrahmanyan's 90-hour workweek remark has triggered debate on work-life balance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/sundance-film-festival-to-proceed-amid-los-angeles-fires-from-january-23-at-utah-2664611-2025-01-14",
      "headline": "Sundance Film Festival to proceed amid Los Angeles fires: Important to carry on The Sundance Film Festival will go ahead in Park City, Utah, despite the Los Angeles wildfires. The decision aims to highlight the festival's commitment to resilience and community spirit."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/web-series/story/black-warrant-on-netflix-and-the-ranga-billa-case-what-really-happened-in-and-out-of-jail-2664553-2025-01-14",
      "headline": "Black Warrant and the Ranga-Billa case: What really happened in and out of jailBlack Warrant, a prison drama, is currently streaming on Netflix. The show is based on a book of the same title and one of its episodes narrates the story of the infamous Ranga-Billa case. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/soodhu-kavvum-2-mirchi-shiva-black-comedy-is-now-streaming-online-2664600-2025-01-14",
      "headline": "Soodhu Kavvum 2: Mirchi Shiva's black comedy is now streaming onlineSoodhu Kavvum 2, featuring Mirchi Shiva, is now available for streaming on Aha Tamil. Directed by SJ Arjun, the film follows Guru's comedic quest for revenge against a corrupt minister."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shraddha-kapoor-nagin-script-finally-ready-nikhil-dwivedi-shares-update-2664594-2025-01-14",
      "headline": "Shraddha Kapoor's Nagin script 'finally' ready, Nikhil Dwivedi shares updateShraddha Kapoor's Nagin trilogy, a love and sacrifice epic, is finally scripted after three years. Filmmaker Nikhil Dwivedi shared updates, with filming expected to start in 2025. \r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-wasim-akram-unveils-the-iconic-white-jacket-for-champions-trophy-2025-2664578-2025-01-14",
      "headline": "Watch: Wasim Akram unveils the iconic white jacket for Champions Trophy 2025Legendary Pakistan fast bowler Wasim Akram unveiled the iconic white jacket for the ICC Champions Trophy 2025 set to begin from February 19."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jemimah-rodrigues-top-20-in-icc-rankings-maiden-india-century-vs-ireland-rajkot-2664607-2025-01-14",
      "headline": "Jemimah Rodrigues rises to top-20 in ICC rankings after maiden century vs IrelandJemimah Rodrigues' maiden ODI century propelled her into the ICC top-20 rankings, marking a career-defining moment in India's commanding series against Ireland, as rising stars contributed to the team's historic highest-ever total in women's ODIs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/christopher-nkunku-chelsea-bayern-munich-swap-deal-mathys-tel-transfer-news-2664592-2025-01-14",
      "headline": "Chelsea's Christopher Nkunku eager to complete Bayern Munich move: ReportsChristopher Nkunku's potential return to Bayern Munich through a high-profile swap deal with Chelsea for Mathys Tel has sparked widespread interest, as both clubs explore a transformative move during the January transfer window."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-annabel-sutherland-adjudged-icc-players-of-the-month-for-december-2664585-2025-01-14",
      "headline": "Jasprit Bumrah beats Pat Cummins to win ICC Player of Month for DecemberIndia fast bowler Jasprit Bumrah and Australia all-rounder Annabel Sutherland were named ICC men's and women's players of the month respectively for December."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-rates-coach-andy-murray-first-impression-australian-open-nishesh-basavareddy-2664572-2025-01-14",
      "headline": "All new coaching pods a hit? Novak Djokovic rates Andy Murray's first impressionNovak Djokovic flaunted his partnership with Andy Murray at the Australian Open amid the debut of coaching pods, an interesting innovation allowing closer coach-player communication. While Djokovic embraced the setup, other players, including Aryna Sabalenka, expressed concerns about the change."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-pacer-ihsanullah-retires-from-psl-after-draft-snub-2664561-2025-01-14",
      "headline": "Pakistan pacer Ihsanullah retires from PSL after draft snub, makes bizarre claimPakistan's pace sensation Ihsanullah, who rose to prominence with 22 wickets in PSL 8, has retired from the Pakistan Super League after being overlooked in the PSL 10 draft. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravi-shastri-1985-audi-100-in-raymond-supercar-meet-2664546-2025-01-14",
      "headline": "Ravi Shastri rewinds clock, flaunts his famous 1985 Audi in supercar meetFormer India captain Ravi Shastri flaunted his 1985 Audi 100 at a supercar meet in Mumbai. Shastri, who had won the Audi 100 in the Benson & Hedges World Championship of Cricket, said that he was thrilled to drive the machine after many years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-daniil-medvedev-vs-kasidit-samrej-high-praise-joke-melbourne-crowd-2664544-2025-01-14",
      "headline": "Money, girls, casino: Inimitable Medvedev praises opponent after tough openerAustralian Open 2025: Fifth seed Daniil Medvedev was at his inimitable best when he praised Kasidit Samrej, who dragged the Russian to five sets in their opening-round clash on Tuesday, January 14. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/2nd-odi-australia-extend-women-ashes-lead-win-over-england-2664531-2025-01-14",
      "headline": "2nd ODI: Australia extend Women's Ashes lead with 21-run win over EnglandAustralia extended their lead in the Women's Ashes with a 21-run win over England in a thrilling second ODI at the Junction Oval in Melbourne.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-daniil-medvedev-smashes-camera-breaks-racquet-in-frustration-2664507-2025-01-14",
      "headline": "Watch: Daniil Medvedev smashes camera, breaks racquet in frustrationRussian tennis player Daniil Medvedev had an on-court meltdown in the first round of the Australian Open. Playing against Kasidit Samrej, Medvedev smashed his racquet into the net camera.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-trains-mumbai-camp-rediscover-form-champions-trophy-2664495-2025-01-14",
      "headline": "Watch: Rohit Sharma trains with Mumbai camp ahead of Champions TrophyIndia captain Rohit Sharma practised with the Mumbai team on Tuesday as the side geared up for the resumption of the Ranji Trophy on January 23."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravi-shastri-1985-audi-100-in-raymond-supercar-meet-2664546-2025-01-14",
      "headline": "Ravi Shastri rewinds clock, flaunts his famous 1985 Audi in supercar meetFormer India captain Ravi Shastri flaunted his 1985 Audi 100 at a supercar meet in Mumbai. Shastri, who had won the Audi 100 in the Benson & Hedges World Championship of Cricket, said that he was thrilled to drive the machine after many years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-daniil-medvedev-vs-kasidit-samrej-high-praise-joke-melbourne-crowd-2664544-2025-01-14",
      "headline": "Money, girls, casino: Inimitable Medvedev praises opponent after tough openerAustralian Open 2025: Fifth seed Daniil Medvedev was at his inimitable best when he praised Kasidit Samrej, who dragged the Russian to five sets in their opening-round clash on Tuesday, January 14. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/2nd-odi-australia-extend-women-ashes-lead-win-over-england-2664531-2025-01-14",
      "headline": "2nd ODI: Australia extend Women's Ashes lead with 21-run win over EnglandAustralia extended their lead in the Women's Ashes with a 21-run win over England in a thrilling second ODI at the Junction Oval in Melbourne.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-daniil-medvedev-smashes-camera-breaks-racquet-in-frustration-2664507-2025-01-14",
      "headline": "Watch: Daniil Medvedev smashes camera, breaks racquet in frustrationRussian tennis player Daniil Medvedev had an on-court meltdown in the first round of the Australian Open. Playing against Kasidit Samrej, Medvedev smashed his racquet into the net camera.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-trains-mumbai-camp-rediscover-form-champions-trophy-2664495-2025-01-14",
      "headline": "Watch: Rohit Sharma trains with Mumbai camp ahead of Champions TrophyIndia captain Rohit Sharma practised with the Mumbai team on Tuesday as the side geared up for the resumption of the Ranji Trophy on January 23."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-sam-konstas-controversy-ian-chappell-india-vs-england-test-series-2664494-2025-01-14",
      "headline": "Virat Kohli has to stop his senseless antics: Ian Chappell blasts batterFormer Australia player Ian Chappell has blasted Virat Kohli for his antics in the Border-Gavaskar Trophy. Chappell slammed Kohli for his bust-up with 19-year-old Sam Konstas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-emma-raducanu-elena-rybakina-first-round-wins-2664480-2025-01-14",
      "headline": "Emma Raducanu, Elena Rybakina advance with contrasting winsAustralian Open 2025: Sixth seed Elena Rybakina stormed into the second round with a comfortable win over 16-year-old local wildcard Emerson Jones. Emma Raducanu, who was back in action after three months, looked wobbly in her first-round win. te"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/bcci-to-take-strict-measures-against-indian-team-after-australia-series-loss-2664444-2025-01-14",
      "headline": "BCCI to take strict measures against Indian team after Australia series lossThe BCCI plans to implement stricter policies for the Indian cricket team following their disappointing tour of Australia."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-bcci-review-meeting-captaincy-rumours-rajeev-shukla-2664423-2025-01-14",
      "headline": "Rohit insisted on remaining Test captain? BCCI vice-president rubbishes reportBCCI vice-president Rajeev Shukla rubbished rumours of a rift in the Indian dressing room and a report that claimed Rohit Sharma wanted to retain Test captaincy despite the Border-Gavaskar Trophy loss. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-no-wives-girlfriends-indian-team-tour-series-champions-trophy-bgt-rohit-sharma-virat-kohli-2664421-2025-01-14",
      "headline": "BCCI's new rules after Australia tour disaster, curbs on WAGs' stay during toursThe Indian Cricket Board has reacted sharply to India's loss in the Border-Gavaskar Trophy. Sources have told India Today that the BCCI has cracked the whip on the Indian team and has taken strict steps to get their focus back on the game.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-rohan-bopanna-nicolas-barrientos-shock-first-round-exit-2664409-2025-01-14",
      "headline": "Champion last year, Rohan Bopanna suffers shock first-round exitAustralian Open 2025: The Indo-Colombian pair of Rohan Bopanna and Nicolas Barrientos was knocked out in the opening round of men's doubles on Tuesday, January 14. Bopanna, who won the Australian Open last year with Matthew Ebden, hasn't had a great start to the new season with his new partner. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/kho-kho-world-cup-india-vs-brazil-team-coach-grabieal-coronas-2664407-2025-01-14",
      "headline": "Kho Kho World Cup: 4 months after stumbling upon sport, Brazil is at big stageAfter stumbling on the sport of Kho Kho just four months ago, a rag-tag Brazil team has arrived at the maiden World Cup. India Today speaks to Brazil's captain Gabriel Barros Coronas and coach Laura Doering about the team's journey and their hopes for the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-kapil-dev-responds-to-yograj-singhs-shocking-pistol-claim-2664399-2025-01-14",
      "headline": "Watch: Kapil Dev responds to Yograj Singh's shocking 'pistol' claimFormer India captain Kapil Dev has reacted to Yograj Singh's claims that he went to the former skipper's house to kill him. Yograj had said that he wanted to shoot Kapil after being dropped from the North Zone team.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-no-wives-girlfriends-indian-team-tour-series-champions-trophy-bgt-rohit-sharma-virat-kohli-2664421-2025-01-14",
      "headline": "BCCI's new rules after Australia tour disaster, curbs on WAGs' stay during toursThe Indian Cricket Board has reacted sharply to India's loss in the Border-Gavaskar Trophy. Sources have told India Today that the BCCI has cracked the whip on the Indian team and has taken strict steps to get their focus back on the game.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-rohan-bopanna-nicolas-barrientos-shock-first-round-exit-2664409-2025-01-14",
      "headline": "Champion last year, Rohan Bopanna suffers shock first-round exitAustralian Open 2025: The Indo-Colombian pair of Rohan Bopanna and Nicolas Barrientos was knocked out in the opening round of men's doubles on Tuesday, January 14. Bopanna, who won the Australian Open last year with Matthew Ebden, hasn't had a great start to the new season with his new partner. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/kho-kho-world-cup-india-vs-brazil-team-coach-grabieal-coronas-2664407-2025-01-14",
      "headline": "Kho Kho World Cup: 4 months after stumbling upon sport, Brazil is at big stageAfter stumbling on the sport of Kho Kho just four months ago, a rag-tag Brazil team has arrived at the maiden World Cup. India Today speaks to Brazil's captain Gabriel Barros Coronas and coach Laura Doering about the team's journey and their hopes for the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-kapil-dev-responds-to-yograj-singhs-shocking-pistol-claim-2664399-2025-01-14",
      "headline": "Watch: Kapil Dev responds to Yograj Singh's shocking 'pistol' claimFormer India captain Kapil Dev has reacted to Yograj Singh's claims that he went to the former skipper's house to kill him. Yograj had said that he wanted to shoot Kapil after being dropped from the North Zone team.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-to-play-ranji-trophy-captain-wants-to-train-with-mumbai-says-report-2664390-2025-01-14",
      "headline": "Rohit Sharma to play Ranji Trophy? Captain wants to train with MumbaiIndia captain Rohit Sharma wants to train with the Mumbai Ranji team to improve his form in Test cricket. Rohit has had two woeful Test series where he has failed to play any impactful knocks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-aus-bgt-jasprit-bumrah-don-bradman-adam-gilchrist-2664346-2025-01-14",
      "headline": "Jasprit Bumrah would've even troubled Sir Don Bradman: GilchristFormer Australia wicketkeeper batter Adam Gilchrist feels India fast bowler Jasprit Bumrah would've even troubled legendary Sir Don Bradman in his playing days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-nitish-reddy-visits-tirupati-temple-climbs-stairs-on-knees-2664375-2025-01-14",
      "headline": "Watch: Nitish Reddy visits Tirupati, climbs stairs on kneesNitish Kumar Reddy visited the Tirupati temple after his return from Australia. He climbed the stairs of the temple on his knees. Nitish posted video snippets from the temple which have since gone viral.\r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}