{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/goa-fire-tragedy-victim-compensation-insurance-claim-accidental-government-rules-actions-legal-help-2835385-2025-12-13",
      "headline": "Goa fire tragedy: From compensation to insurance, what victims can claimThe Uphaar cinema fire in Delhi, the Kumbakonam school blaze, the Mumbai Kamala Mills fire, the Surat coaching centre tragedy, each incident left behind not just casualties, but families pushed into years of legal battles simply to secure basic compensation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/johnson-johnson-ordered-to-pay-usd-40-million-to-2-women-in-talc-cancer-case-2835339-2025-12-13",
      "headline": "Johnson & Johnson ordered to pay $40 million to 2 women in talc powder caseThe verdict comes as the company faces tens of thousands of similar lawsuits nationwide and after its latest attempt to resolve the litigation through bankruptcy was rejected by US courts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-is-young-india-really-spending-money-hint-its-not-gadgets-and-clothes-2835034-2025-12-12",
      "headline": "How is young India really spending money? Hint: It's not gadgets and clothesYoung Indians' spending habits are shifting quickly, and it's no longer about gadgets or new outfits. Here's a closer look at where their money is actually going."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cabinet-clears-100-percent-fdi-in-insurance-what-the-new-bill-means-for-the-sector-2835061-2025-12-12",
      "headline": "Cabinet clears 100% FDI in insurance: What the new bill means for the sectorThe government says the changes are designed to offer stronger protection to policyholders and bring more players into the market. This could lead to better products, faster claim settlements, and improved customer service."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/aroon-purie-rings-nse-bell-says-its-for-next-chapter-of-india-india-today-group-2835055-2025-12-12",
      "headline": "Aroon Purie rings NSE bell, says it's for next chapter of India, India Today GroupIndia Today Group Chairman and Editor-in-Chief Aroon Purie on Friday rang the closing bell at the National Stock Exchange (NSE) to mark the Group's 50-year journey and said it was for the next chapter of India and the India Today Group."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/aroon-purie-nse-closing-bell-ringing-next-chapter-india-today-nation-building-journalism-standard-2835038-2025-12-12",
      "headline": "NSE bell we ring today is for next chapter of India, India Today Group: Aroon PurieThe moment symbolised both a milestone for the media group and a nod to India's financial markets, which have grown alongside the Group's own evolution since 1975."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/video-nse-felicitates-india-today-group-chairman-aroon-purie-on-50-year-milestone-2835027-2025-12-12",
      "headline": "Video: NSE felicitates India Today Group Chairman Aroon Purie on 50-year milestoneNational Stock Exchange (NSE) MD & CEO Ashish Kumar Chauhan on Friday felicitated India Today Group Chairman Aroon Purie as the Group completed 50 years at a ceremony in Mumbai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/retail-inflation-rises-to-071-in-november-from-025-in-october-2835031-2025-12-12",
      "headline": "Retail inflation rises to 0.71% in November from 0.25% in OctoberFood inflation remained in deflation for the sixth straight month, but the pace of decline narrowed sharply. The Consumer Food Price Index showed a contraction of 3.91% in November, compared to a much steeper 5.02% fall in October."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/silver-prices-cross-rs-2-lakh-milestone-is-there-more-upside-left-2835028-2025-12-12",
      "headline": "Silver prices cross Rs 2 lakh milestone: Is there more upside left?Silver has been on a strong upward streak over the past month, supported by a softer US dollar, falling global interest rates and renewed buying in industrial commodities. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/video-india-today-chairman-aroon-purie-rings-nse-bell-to-mark-itgs-50-years-2835021-2025-12-12",
      "headline": "Video: India Today Chairman Aroon Purie rings NSE bell to mark ITG's 50 yearsIndia Today Group Chairman and Editor-in-Chief Aroon Purie rang the NSE bell on Friday to mark the Group's 50 years. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-450-points-higher-nifty-above-26000-tata-steel-up-3-percent-2835012-2025-12-12",
      "headline": "Sensex ends 450 points higher, Nifty above 26,000; Tata Steel up 3%Sensex ends 450 points higher, Nifty above 26,000; Tata Steel up 3%"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-us-trade-deal-talks-agriculture-market-refuse-to-open-defence-energy-okay-piyush-goyal-trump-tariff-2835007-2025-12-12",
      "headline": "India–US trade deal talks move forward, but Delhi refuses to open agriculture marketIndia has refused to allow American agricultural products into the Indian market. India believes that permitting US farm goods would increase competitive pressure on domestic farmers and reduce their income. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/the-heirs-dilemma-why-silence-around-money-is-leaving-families-unprepared-2834990-2025-12-12",
      "headline": "Unclaimed wealth is rising in India. How silence around money is costing familiesA growing number of Indian families are learning that wealth without communication can turn into confusion, conflict and costly mistakes. The solution begins long before any will is written."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/from-tds-gaps-to-bank-errors-why-your-itr-refund-is-delayed-and-what-to-do-now-2834954-2025-12-12",
      "headline": "From TDS gaps to bank errors: Why your ITR refund is delayed and what to do nowSeveral taxpayers in India have not received their income tax refunds for the assessment year 2025-26, with delays attributed to verification errors and compliance checks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/inside-the-world-of-indias-ultra-rich-what-they-buy-how-they-live-2834890-2025-12-12",
      "headline": "Inside the world of India's ultra-rich: What they buy, how they liveHow are India's wealthiest families redefining luxury today, and what do their latest spending habits reveal about their lifestyles? Let's have a look."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-dharavi-redevelopment-plan-new-home-keys-first-demolition-later-2834864-2025-12-12",
      "headline": "Keys to new homes first, then redevelopment begins: Pranav Adani on Dharavi planPranav Adani said that the Dharavi project is finally progressing with a concrete plan to build around 2 lakh new homes, ensuring residents are moved into these units before any demolition or redevelopment of old structures begins."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/nps-expands-investment-options-now-gold-silver-etfs-and-nifty-250-picks-allowed-2834859-2025-12-12",
      "headline": "NPS expands investment options: Now gold, silver ETFs and Nifty 250 picks allowedIndia's pension regulator issues updated unified investment rules for pension schemes, introducing clearer limits and a wider range of asset classes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/new-labour-codes-take-home-salary-pf-contribution-math-explained-2834849-2025-12-12",
      "headline": "New labour codes: No, your take-home salary isn't reducing. Here's the mathFears of reduced take-home salaries have surged since the new labour codes were notified, but a closer look at the PF calculation shows the impact may not be what many employees expect."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hindustan-zinc-shares-rise-silver-prices-metals-sector-momentum-2834830-2025-12-12",
      "headline": "Hindustan Zinc share price jumps over 3%: Why is the stock rising today?Hindustan Zinc's share price advanced over 3% in Friday trading, continuing its upward momentum amid rising silver prices and sector-wide gains in metals stocks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-gains-400-points-nifty-nears-26000-strong-domestic-global-cues-2834819-2025-12-12",
      "headline": "Sensex jumps over 400 points: Why is the stock market rising todayIndian stock markets opened higher on Friday, buoyed by improved global cues and robust domestic investor activity. Experts highlight the role of the US Federal Reserve's rate cut, domestic retail inflows, and stable earnings outlook in supporting the rally."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ranveer-singh-dhurandhar-is-lyari-town-ka-satya-2835443-2025-12-13",
      "headline": "Dhurandhar is Lyari Town ka Satya Dhurandhar humanises Lyari gangsters so thoroughly that you catch yourself rooting for the rogues. Much like Satya did for Mumbai's underworld."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/anand-math-a-film-that-traces-indias-nation-building-challenges-through-bankim-chandras-vision-2835445-2025-12-13",
      "headline": "Anand Math: A film that traces India's nation-building challenges through Bankim Chandra's vision As part of our Retro Review series, we revisit Anand Math. The cinematic adaptation of Bankim Chandra Chattopadhyay's iconic novel strategically inverts colonial narratives while constructing a particular vision of nationalist masculinity, and gives us India's greatest song – Vande Mataram."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-padayappa-re-release-in-france-theatre-sees-fan-frenzy-2835435-2025-12-13",
      "headline": "Rajinikanth's Padayappa re-release in France theatre sees fan frenzy The re-release of the 1999 cult classic, 'Padayappa', marked Rajinikanth's 75th birthday, turning theatres nationwide into \"live concerts.\" A viral video from a theatre in France captured the global celebration, showing fans dancing and cheering wildly for the actor on the silver screen.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhurandhar-box-office-ranveer-singh-film-shows-no-slowdown-eyes-rs-250-crore-mark-2835407-2025-12-13",
      "headline": "Dhurandhar box office: Ranveer's film shows no slowdown, eyes Rs 250 crore-mark Dhurandhar box office Day 8: Ranveer Singh and Akshaye Khanna's film Dhurandhar maintains its impressive performance at the box office. The film has also become 2025's fifth-highest grosser. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/grammy-winner-ricky-kej-claims-he-was-robbed-by-zomato-agent-bengaluru-agent-shares-cctv-footage-2835409-2025-12-13",
      "headline": "Grammy winner Ricky Kej claims he was robbed by Zomato agent, shares CCTV footage Grammy winner Ricky Kej shared CCTV evidence of theft at his Bengaluru residence. In a long post, he called for vigilance and assistance from Zomato and Bengaluru police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-gives-197-million-bonus-to-eras-tour-team-their-reaction-goes-viral-2835403-2025-12-13",
      "headline": "Taylor Swift gives $197 million bonus to Eras Tour team. Their reaction goes viral Taylor Swift handed out more than a staggering $197 million in bonuses to her crew at the end of the Eras Tour. The behind-the-scenes moment as shown in new documentary footage, has since gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/akhanda-2-box-office-day-1-nandamuri-balakrishna-film-has-strong-start-crosses-rs-30-crore-2835390-2025-12-13",
      "headline": "Akhanda 2 box office Day 1: Balakrishna film has strong start, crosses Rs 30 crore Nandamuri Balakrishna's film Akhanda 2 saw a strong box office debut following a week-long delay. The sequel to the 2021 action film overcame last-minute hurdles to reach audiences and record impressive first-day earnings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/how-dhurandhar-disrupts-cinematic-power-and-refuses-to-be-ignored-2835294-2025-12-13",
      "headline": "How Dhurandhar disrupts cinematic power, and refuses to be ignored Dhurandhar shakes up Hindi cinema with its fearless storytelling and unapologetic politics. It breaks formula, challenges hero worship, and refuses to be predictable."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aditya-dhar-played-candy-crush-during-tense-dhurandhar-scenes-says-madhavan-2835374-2025-12-13",
      "headline": "Aditya Dhar played Candy Crush during tense Dhurandhar scenes, says Madhavan Madhavan shared a BTS anecdote from the sets of Dhurandhar, revealing director Aditya Dhar's unusual calm during tense moments. He recalled that Dhar remained completely composed, even passing time by playing Candy Crush."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kerala-high-court-gives-green-signal-to-malayalam-film-haal-after-legal-row-2835344-2025-12-13",
      "headline": "Kerala High Court gives green signal to Malayalam film Haal after legal row The Kerala High Court has dismissed appeals challenging the reversal of the A-certificate for the Malayalam film Haal. The court reviewed objections about religious portrayal and CBFC-ordered scene removals, ultimately supporting a prior ruling that some certification cuts were not needed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/120-bahadur-war-2-sky-force-why-did-patriotic-films-miss-the-target-in-2025-2834739-2025-12-13",
      "headline": "120 Bahadur, War 2, Sky Force: Why did patriotic films miss the target in 2025? Bollywood's once-reliable war and patriotic genre hit a slump this year with most films failing to hit the mark. Experts blame repetitive storytelling, weak writing, and a lack of emotional tension. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aditya-dhar-reacts-to-hrithik-roshans-dhurandhar-praise-calls-it-very-encouraging-2835323-2025-12-13",
      "headline": "Aditya Dhar reacts to Hrithik Roshan's Dhurandhar praise, calls it very encouraging Aditya Dhar's reaction to Hrithik Roshan's praise for Dhurandhar has drawn attention, especially after the actor shared two contrasting yet appreciative takes on the film. While Hrithik questioned its politics, he applauded its cinematic craft."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-visits-tirupati-temple-with-family-after-his-75th-birthday-2835328-2025-12-13",
      "headline": "Rajinikanth visits Tirupati temple with family after his 75th birthday Superstar Rajinikanth, fresh from celebrating his 75th birthday, paid a visit to Tirumala Tirupati temple with his family to seek divine blessings. A video from the visit on Saturday surfaced online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kollywood-financial-crisis-2025-ott-impact-theatre-closures-industry-challenges-2834489-2025-12-13",
      "headline": "Empty theatres, fat pay cheques: Crisis of accountability shakes Tamil industry Kollywood is facing a severe financial crisis in 2025 due to empty theatres and OTT disruption. Theatre owners and producers clash over OTT windows, threatening the industry's future viability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/exclusive-saali-mohabbat-radhika-apte-not-big-on-morality-but-ethics-2835276-2025-12-12",
      "headline": "Exclusive I Saali Mohabbat's Radhika Apte: Not big on morality but ethics Actor Radhika Apte discusses her selective approach to roles, driven by sharp instincts and a search for complexity. Apte, who features in 'Saali Mohabbat', speaks to India Today on drawing the line based on a film's ethical vision, viewing morality as a \"society-made thing\" that hinders empathy.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-jungkook-exhibition-opens-in-mumbai-fans-chants-and-his-golden-era-2835256-2025-12-12",
      "headline": "BTS' Jungkook's exhibition opens in Mumbai: Fans, chants and ​his Golden era Fans gathered in Bandra as 'Golden: The Moments', BTS and Jungkook's first official activity in India, opens, offering immersive exhibits and a space for community engagement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/emotional-amitabh-bachchan-humbled-by-sea-of-fans-outside-his-jalsa-home-2835234-2025-12-12",
      "headline": "Emotional Amitabh Bachchan humbled by sea of fans outside his home Jalsa Actor Amitabh Bachchan shared videos of a \"sea of fans\" cheering outside his Jalsa residence on Sunday. Moved by their \"immeasurable\" love, the 83-year-old actor humbly questioned his worthiness, asking what he had done \"to be deserving of such\" devotion from the massive crowd."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/euphoria-season-3-first-footage-teases-whats-in-store-for-zendaya-sydney-sweeney-2835193-2025-12-12",
      "headline": "Euphoria Season 3 first footage teases what's in store for Zendaya, Sydney Sweeney The first 'Euphoria Season 3' footage confirms Zendaya's Rue is deep in trouble, in debt to Laurie and running. The show is set for its HBO premiere in April 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/exo-to-release-winter-single-im-home-ahead-of-their-2026-group-comeback-2835191-2025-12-12",
      "headline": "EXO to release winter single I'm Home ahead of their 2026 group comeback EXO is making a seasonal comeback with their new single 'I'm Home'. The release hints at a sentimental 2026 album and features six of the original nine members, stirring mixed emotions among fans."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjps-historic-win-in-local-body-polls-in-thiruvananthapuram-bastion-of-congresss-shashi-tharoor-2835415-2025-12-13",
      "headline": "BJP makes history in Kerala, wrests Thiruvananthapuram Corporation from CPMThe BJP-led NDA has made historic gains in Kerala's local body elections, capturing key urban centres including Thiruvananthapuram Corporation and Tripunithura Municipality. This marks a significant shift in Kerala's political landscape, traditionally dominated by the Left Democratic Front."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-kolkata-visit-fans-throw-bottles-politicians-booed-mismanagement-2835393-2025-12-13",
      "headline": "Chaos at Messi's Kolkata event after he leaves in 10 mins, angry fans throw bottles  Live UpdatesChaos overshadowed Lionel Messi's Salt Lake Stadium appearance as crowd mismanagement led to unrest inside the venue. Messi's brief stay and heavy security exit left many fans disappointed, turning celebration into frustration."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-gautam-adani-meeting-handshake-sharad-pawar-dinner-no-photos-2835428-2025-12-13",
      "headline": "Rahul Gandhi, Adani came face-to-face at Pawar's dinner. Why no photo surfaced?Rahul Gandhi and industrialist Gautam Adani, who has been at the Congress MP's crosshairs, came face-to-face during Sharad Pawar's birthday bash. However, it was ensured that no photos of the encounter became public."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/you-promised-imran-khans-ex-wife-jemima-goldsmith-appeals-elon-musk-alleges-x-curbing-posts-pti-leader-detention-2835436-2025-12-13",
      "headline": "You promised...: Imran Khan's ex-wife Jemima Goldsmith writes to Elon MuskCiting analysis by X's AI tool Grok, Jemima Goldsmith claimed her account's reach has collapsed despite a large following, even as Khan's family continues to allege mistreatment and denial of access to him in Adiala Jail, drawing renewed protests and international scrutiny."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ranveer-singh-dhurandhar-is-lyari-town-ka-satya-2835443-2025-12-13",
      "headline": "Dhurandhar is Lyari Town ka SatyaDhurandhar humanises Lyari gangsters so thoroughly that you catch yourself rooting for the rogues. Much like Satya did for Mumbai's underworld."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/watershed-in-kerala-politics-pm-thanks-generation-of-bjp-karyakartas-after-thiruvananthapuram-corporation-win-2835441-2025-12-13",
      "headline": "Watershed moment: PM thanks BJP workers after Thiruvananthapuram civic poll winPrime Minister Narendra Modi termed the BJP-NDA's win in the Thiruvananthapuram Corporation a watershed moment in Kerala politics, thanking party workers for sustained grassroots efforts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-india-tour-organiser-detained-kolkata-mismanagement-2835429-2025-12-13",
      "headline": "Messi's India tour organiser arrested in Kolkata over mismanagementLionel Messi's India tour began with chaos in Kolkata after crowd unrest overshadowed celebrations. The arrest of organiser Satadru Dutta shifted focus from spectacle to accountability and investigations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/vehicles-collide-on-greater-noida-expressway-amid-dense-fog-several-injured-2835373-2025-12-13",
      "headline": "Dozen vehicles collide on Greater Noida expressway due to fog, several injuredThe accident occurred in low-visibility conditions, with fog severely reducing sight distance for motorists. Emergency services rushed to the spot after receiving information about the pile-up. The injured were shifted to nearby hospitals for treatment."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/lifestyle/travel/story/i-visited-dow-hill-indias-most-haunted-hill-forest-and-then-something-happened-2835035-2025-12-13",
      "headline": "I visited Dow Hill, India's most haunted hill forest. And then, something happenedKurseong's Dow Hill is unsettling even in broad daylight. We wandered in after sunset, and one moment there still sends a chill down my spine."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kerala-local-body-election-results-live-munambam-nda-wins-waqf-land-dispute-2835379-2025-12-13",
      "headline": "Kerala: NDA wins Munambam, centre of dispute between Christians and waqf boardMunambam, located in Kerala's Ernakulam district, has been at the centre of protests and court cases after over 404 acres of land were declared as waqf property."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-sanjv-goenka-india-tour-world-cup-exclusive-2835444-2025-12-13",
      "headline": "Exclusive: Messi talks India, culture and World Cup glory with Sanjiv GoenkaBefore the crowds arrived, Lionel Messi spent his first morning in India with Sanjiv Goenka — a private Kolkata conversation that set a reflective tone and offered a rare glimpse into the man behind football's most celebrated name."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/keep-your-little-ones-cozy-this-winter-with-amazon-everyday-essentials-2833300-2025-12-09",
      "headline": "Keep Your Little Ones Cozy This Winter with Amazon Everyday EssentialsWhether you're looking to care for little ones or find the perfect gift, this collection of baby and kids' essentials brings together nourishment, comfort, and thoughtful design."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/120-bahadur-war-2-sky-force-why-did-patriotic-films-miss-the-target-in-2025-2834739-2025-12-13",
      "headline": "120 Bahadur, War 2, Sky Force: Why did patriotic films miss the target in 2025?Bollywood's once-reliable war and patriotic genre hit a slump this year with most films failing to hit the mark. Experts blame repetitive storytelling, weak writing, and a lack of emotional tension. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/grammy-winner-ricky-kej-claims-he-was-robbed-by-zomato-agent-bengaluru-agent-shares-cctv-footage-2835409-2025-12-13",
      "headline": "Grammy winner Ricky Kej claims he was robbed by Zomato agent, shares CCTV footageGrammy winner Ricky Kej shared CCTV evidence of theft at his Bengaluru residence. In a long post, he called for vigilance and assistance from Zomato and Bengaluru police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/missing-aishe-data-india-shaping-higher-education-blind-2835416-2025-12-13",
      "headline": "No AISHE report since 2021–22: Why India can't afford a higher-ed data silenceIndia's most crucial higher-education report, the All India Survey on Higher Education (AISHE) has not been released. The last edition was 2021–22. Why is the data missing, and what does it mean for transparency and accountability?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-chaotic-kolkata-visit-fan-fury-salt-lake-stadium-mismanagement-refunds-2835437-2025-12-13",
      "headline": "Messy start to Messi's India tour: VIPs get darshan, fans feel cheatedLionel Messi's Kolkata visit, intended as a celebratory start to his India tour, descended into chaos as poor crowd management, VVIP congestion, and a rushed exit left fans frustrated, organiser detained, and the Chief Minister issuing an apology."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/taylor-swift-gives-197-million-bonus-to-eras-tour-team-their-reaction-goes-viral-2835403-2025-12-13",
      "headline": "Taylor Swift gives $197 million bonus to Eras Tour team. Their reaction goes viralTaylor Swift handed out more than a staggering $197 million in bonuses to her crew at the end of the Eras Tour. The behind-the-scenes moment as shown in new documentary footage, has since gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-550-12-12-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/know-real-dhurandhars-lyaric-karachi-pakistan-rehman-dakait-uzair-baloch-chaudhry-aslam-2835296-2025-12-13",
      "headline": "Know real Dhurandhars: Men who turned Karachi into a war zoneRehman Dakait, Chaudhry Aslam, Uzair Baloch carved legends in blood, bullets, and vengeance, leaving Pakistan's Lyari haunted. 'Dhurandhar' brings their violent underworld to life on screen, where monsters, messiahs, and spies collide. Know the real stories of these men: the Dhurandhars who ruled Lyari with fear and fire."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kollywood-financial-crisis-2025-ott-impact-theatre-closures-industry-challenges-2834489-2025-12-13",
      "headline": "Empty theatres, fat pay cheques: Crisis of accountability shakes Tamil industryKollywood is facing a severe financial crisis in 2025 due to empty theatres and OTT disruption. Theatre owners and producers clash over OTT windows, threatening the industry's future viability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2026-auction-history-richard-madley-interview-auctioneer-2835312-2025-12-13",
      "headline": "From secrecy to spectacle: How India fell in love with IPL auctionThe first IPL auction in 2008 was not televised, yet it has since evolved into one of India's prime-time spectacles. Auctioneer Richard Madley, who held the gavel for 11 seasons, recalls its rise and argues against scrapping the auction, insisting the format ensures fairness and competitive balance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/john-cena-final-wwe-match-gunther-date-time-how-to-watch-2835205-2025-12-13",
      "headline": "John Cena's final WWE match at Saturday Night's main event: All you need to knowJohn Cena is all set to bring his iconic WWE career to a close as he will the centre of attraction at WWE's Saturday Night's Main Event on Saturday, December 13. Here's a look at the match card, livestreaming details and more from the event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sincerely-apologise-to-messi-his-fans-mamata-banerjee-over-mismanagement-at-kolkata-stadium-2835405-2025-12-13",
      "headline": "Sincerely apologise to Messi, fans: Mamata Banerjee after chaos at Kolkata stadiumThousands of fans, who had paid premium ticket prices, grew frustrated when Messi left the field in under 10 minutes, leading to protests, bottle-throwing, and damage to hoardings. Mamata Banerjee announced a high-level enquiry committee to investigate the mismanagement and recommend corrective measures."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/grap-iii-invoked-in-delhi-again-as-air-quality-inches-near-severe-2835387-2025-12-13",
      "headline": "Anti-pollution curbs under Grap-III back in Delhi as air quality turns severeDelhi faces a sharp rise in air pollution, prompting authorities to enforce Stage III of the Graded Response Action Plan immediately. The city wakes up to thick smog and deteriorating air quality, raising health concerns for vulnerable groups.\r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-cricket-board-urges-icc-include-captain-salman-ali-agha-t20-world-cup-2026-poster-2835447-2025-12-13",
      "headline": "PCB unhappy as ICC omits Pakistan captain Agha from T20 World Cup ticket poster The Pakistan Cricket Board (PCB) has expressed its dissatisfaction with the International Cricket Council for omitting Pakistan captain Salman Ali Agha from the promotional poster for the upcoming T20 World Cup 2026 ticket sales. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhishek-sharma-nears-virat-kohli-indian-t20-runs-record-india-south-africa-series-2835450-2025-12-13",
      "headline": "Abhishek Sharma on cusp of Virat Kohli's historic 8-year-old T20 record Abhishek Sharma is closing in on Virat Kohli's T20 calendar-year run record, having scored 1,533 runs in 39 matches, while India's T20I series against South Africa remains evenly poised at 1‑1."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-chaotic-kolkata-visit-fan-fury-salt-lake-stadium-mismanagement-refunds-2835437-2025-12-13",
      "headline": "Messy start to Messi's India tour: VIPs get darshan, fans feel cheated Lionel Messi's Kolkata visit, intended as a celebratory start to his India tour, descended into chaos as poor crowd management, VVIP congestion, and a rushed exit left fans frustrated, organiser detained, and the Chief Minister issuing an apology."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-returns-india-lionel-messi-goat-india-tour-mumbai-2835431-2025-12-13",
      "headline": "Virat Kohli lands in India, fans buzz over possible Lionel Messi meet in Mumbai Virat Kohli has returned to India along with wife Anushka Sharma amid Lionel Messi's Goat India tour. Fans are speculating that India batter is set to meet Messi in Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-india-tour-organiser-detained-kolkata-mismanagement-2835429-2025-12-13",
      "headline": "Messi's India tour organiser arrested in Kolkata over mismanagement Lionel Messi's India tour began with chaos in Kolkata after crowd unrest overshadowed celebrations. The arrest of organiser Satadru Dutta shifted focus from spectacle to accountability and investigations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhoni-lockie-ferguson-leave-india-vs-new-zealand-2835391-2025-12-13",
      "headline": "Most would hit it: Ferguson reacts to viral MS Dhoni leave in World Cup 2019 semis Lockie Ferguson recalled MS Dhoni's famous leave in the 2019 World Cup semi-final, admitting he bowled a poor ball and praising Dhoni's calculated approach despite India's heartbreaking exit.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-kolkata-visit-fans-throw-bottles-politicians-booed-mismanagement-2835393-2025-12-13",
      "headline": "Chaos at Messi's Kolkata event after he leaves in 10 mins, angry fans throw bottles Live Updates Chaos overshadowed Lionel Messi's Salt Lake Stadium appearance as crowd mismanagement led to unrest inside the venue. Messi's brief stay and heavy security exit left many fans disappointed, turning celebration into frustration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/nikhil-naaz-lionel-messi-begins-72-hour-india-visit-set-to-unveil-70-ft-statue-in-kolkata-ytvd-2835378-2025-12-13",
      "headline": "Lionel Messi Begins 72-Hour India Visit, Set To Unveil 70-Ft Statue In Kolkata In this news bulletin, India Today's Consulting Editor (Sports) Nikhil Naaz details the itinerary of football legend Lionel Messi's 'GOAT Tour' to India. Naaz states, 'It's going to be a very hectic schedule for G.O.A.T... He's here roughly for about 70, 72 hours.' The programme highlights Messi's arrival in Kolkata to unveil a 70-foot statue and meet Shah Rukh Khan. Naaz reports that the tour includes a match in Hyderabad with Telangana Chief Minister Revanth Reddy and an exhibition game in Mumbai involving Bollywood stars. The visit concludes in New Delhi with a meeting with Prime Minister Narendra Modi. Naaz also confirms that teammates Luis Suarez and Rodrigo De Paul are accompanying Messi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/lionel-messi-lands-in-kolkata-for-3-day-tour-to-unveil-70-foot-statue-and-play-friendly-match-ytvd-2835371-2025-12-13",
      "headline": "Lionel Messi Lands In Kolkata For 3-Day Tour; To Unveil 70-Foot Statue And Play Friendly Match On this Special Report, the focus is on football legend Lionel Messi's whirlwind three-day tour of India. The Argentine icon has landed in Kolkata to kick off his visit, where he is set to virtually unveil a 70-foot statue of himself. The programme highlights the excitement at Salt Lake Stadium, where Messi will play a friendly match attended by Chief Minister Mamata Banerjee and superstar Shah Rukh Khan. An unidentified speaker details the security arrangements, mentioning 3,000 personnel deployed for the event and advising the public to use carpooling to avoid congestion. The report also features a fan, Uttam Shah, who has built a replica of Messi's house showcasing key moments from the legend's life. The atmosphere in the city is described as electric, with fans eagerly awaiting the global icon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-meets-shahrukh-khan-unveils-70-foot-statue-kolkata-2835366-2025-12-13",
      "headline": "Watch: Messi unveils 70-foot statue of himself in Kolkata, meets Shah Rukh Khan Football legend Lionel Messi has arrived in Kolkata for his GOAT India Tour and met Bollywood superstar Shahrukh Khan. He also unveiled a 70-foot statue of himself at Sree Bhumi Sporting Club in Lake Town, Kolkata."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-siraj-three-wickets-hyderabad-thrash-mumbai-syed-mushtaq-ali-trophy-2835359-2025-12-13",
      "headline": "Ignored for T20Is, Siraj sends strong message to selectors with SMAT heroics Mohammed Siraj delivered a standout performance, taking 3 wickets for Hyderabad against Mumbai in the Syed Mushtaq Ali Trophy 2025-26. His efforts earned him the Player of the Match award as Hyderabad chased down the target of 132 in just 11.5 overs."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/suryakumar-yadav-poor-form-aakash-chopra-india-t20-world-cup-2026-2835338-2025-12-13",
      "headline": "Captain's job is not just to toss: Former opener on Suryakumar Yadav's poor formFormer India opener Aakash Chopra has criticised Suryakumar Yadav's poor batting form ahead of T20 World Cup 2026. The India T20I skipper hasn't scored a half century in the last 20 innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/kolkata-anirban-sinha-roy-reports-on-lionel-messis-70-foot-statue-fan-frenzy-ytvd-2835333-2025-12-13",
      "headline": "Kolkata: Anirban Sinha Roy Reports On Lionel Messi's 70-Foot Statue & Fan FrenzyIn this Special Report, India Today's Anirban Sinha Roy and Nikhil Naz track the frenzy as Lionel Messi lands in Kolkata for his first visit in 14 years. The Argentine legend kicks off a 72-hour 'Bharat Darshan' by unveiling a 70-foot statue of himself. The programme details his jam-packed schedule, including a match with Telangana CM Revanth Reddy in Hyderabad and a Bollywood exhibition game in Mumbai. Anchor Jessica Goel explores the fan mania, with tickets for a meet-and-greet reportedly costing Rs 10 lakh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/video/lionel-messis-rousing-reception-at-kolkata-airport-2835331-2025-12-13",
      "headline": "Watch: Lionel Messi's rousing reception at Kolkata airportArgentine superstar Lionel Messi arrived in Kolkata on Saturday to start his GOAT India Tour 2025. The football legend got a rousing reception as thousands of fans swarmed the airport to catch a glimpse of their favourite star. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-india-tour-day-1-live-updates-goat-tour-kolkata-salt-lake-stadium-2835324-2025-12-13",
      "headline": "Live: After Kolkata's messy start, spotlight on Hyderabad leg of GOAT tourLionel Messi India tour Day 1 live updates: After chaos erupted on Day 1 of the Messi tour in Kolkata, the organiser of the event has been detained. West Bengal Director General of Police (DGP) Rajeev Kumar told the media that the situation was under control and law and order had been restored. He said that the organisers have confirmed that they will provide refunds for the disappointed fans. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-kolkata-heavu-security-luis-suarez-strolling-airport-viral-video-watch-2835321-2025-12-13",
      "headline": "Watch: Lionel Messi swarmed by security while Luis Suarez strolls at Kolkata airportLionel Messi's Kolkata arrival under heavy security highlighted his unmatched global stature. A viral airport clip showing Luis Suarez walking freely offered a light-hearted contrast."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2026-auction-history-richard-madley-interview-auctioneer-2835312-2025-12-13",
      "headline": "From secrecy to spectacle: How India fell in love with IPL auctionThe first IPL auction in 2008 was not televised, yet it has since evolved into one of India's prime-time spectacles. Auctioneer Richard Madley, who held the gavel for 11 seasons, recalls its rise and argues against scrapping the auction, insisting the format ensures fairness and competitive balance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/special-report-global-football-legends-tour-security-plans-and-fan-tributes-ytvd-2835319-2025-12-13",
      "headline": "Messi Lands in Kolkata: Global Football Legend's Tour, Security Plans and Fan TributesThis special report covers the anticipated tour of a global football icon. The itinerary includes visits to major cities and interactions with prominent figures. An unidentified speaker details the security protocols, mentioning that '3,000 people will be on this job' to ensure safety. The programme also highlights a fan's tribute featuring a replica house and the excitement surrounding the scheduled matches. The report notes the involvement of various dignitaries and the star's engagement with children."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/messi-mania-jessica-goel-reports-on-argentina-legends-arrival-in-kolkata-for-goat-tour-ytvd-2835314-2025-12-13",
      "headline": "Messi Lands in India: Argentina Legend's Arrival in Kolkata for 'G.O.A.T Tour'In this Special Report, India Today anchor Jessica Goel and reporter Anirban Sinha Roy track the arrival of football legend Lionel Messi in Kolkata for his 'GOAT India Tour'. The Argentine superstar, accompanied by Luis Suarez and Rodrigo De Paul, landed to a frenzy of fans at the airport. Messi is set to unveil a 72-feet statue of himself and meet Bollywood superstar Shah Rukh Khan (SRK) and former cricketer Sourav Ganguly. The programme captures the excitement of fans who queued up overnight to catch a glimpse of the icon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-south-africa-gambhir-dexters-lab-t20-experiments-chaos-analysis-2835273-2025-12-13",
      "headline": "Inside Gambhir's Dexter's Lab: No Dee Dee needed when GG pushes all wrong buttonsGautam Gambhir's experiments with the Indian cricket team are slowly resembling that of the protagonist in the famous Dexter's laboratory cartoon. While it was Dee Dee causing chaos in the lab in the cartoon, here it is GG who is pressing all the wrong buttons. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-india-shah-rukh-khan-kolkata-arrive-meetup-salt-lake-stadium-watch-video-2835310-2025-12-13",
      "headline": "Watch: Ahead of Messi meetup, Shah Rukh Khan arrives in KolkataShah Rukh Khan's arrival in Kolkata added Bollywood glamour to Lionel Messi's visit. With both icons set to appear at Salt Lake Stadium, the City of Joy prepared for a rare crossover moment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-india-kolkata-young-fan-save-indian-football-placard-viral-video-2835308-2025-12-13",
      "headline": "Save Indian football: Young fan spotted with placard as Messi arrives in IndiaLionel Messi's India visit brought global attention but little football substance. One placard at a Kolkata airport ended up saying more about Indian football's present crisis than the entire star-studded itinerary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/john-cena-final-wwe-match-gunther-date-time-how-to-watch-2835205-2025-12-13",
      "headline": "John Cena's final WWE match at Saturday Night's main event: All you need to knowJohn Cena is all set to bring his iconic WWE career to a close as he will the centre of attraction at WWE's Saturday Night's Main Event on Saturday, December 13. Here's a look at the match card, livestreaming details and more from the event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-arrives-in-kolkata-to-begin-goat-india-tour-as-fans-gather-to-welcome-the-argentine-star-2835300-2025-12-13",
      "headline": "Lionel Messi lands in Kolkata to huge fan turnout as GOAT India tour kicks offLionel Messi arrived in Kolkata to launch the GOAT India Tour 2025, drawing huge midnight crowds, ecstatic fans and heavy security as he begins a packed three-day schedule across four Indian cities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/antim-panghal-wins-gold-2025-senior-national-wrestling-championship-55kg-2835284-2025-12-13",
      "headline": "Olympian Antim Panghal dazzles in wrestling nationals, clinches gold medalAntim Panghal secured gold in the women's 55kg category as Haryana topped the team standings on the opening day of the Senior National Wrestling Championship on Friday, December 12. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/assam-cricket-players-suspended-corruption-syed-mushtaq-ali-trophy-2025-2835237-2025-12-12",
      "headline": "Four Assam players suspended for alleged corruption in Syed Mushtaq Ali Trophy 2025The Assam Cricket Association has suspended four players following allegations of involvement in corrupt practices during the Syed Mushtaq Ali Trophy 2025, barring them from all cricket-related activities while investigations continue."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashes-2025-jofra-archer-gold-chain-ryan-harris-advice-ricky-ponting-2835228-2025-12-12",
      "headline": "Ashes 2025: Jofra Archer given cheeky gold chain advice by Ex-AUS pacerFormer Australia pacer Ryan Harris took a cheeky dig at Jofra Archer, saying that the England pacer should ditch the big gold chain that he wears while playing to improve his delivery speed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-jiostar-deny-breakup-rumours-broadcast-deal-continues-2835216-2025-12-12",
      "headline": "JioStar and ICC deny break-up rumours, to continue broadcast partnershipThe ICC and JioStar has refuted claims of an imminent breakup in their broadcasting partnership with a joint statement on Friday, December 12. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-form-under-spotlight-india-t20i-squad-south-africa-series-2835192-2025-12-12",
      "headline": "What's going wrong with Shubman Gill in T20Is? Coach offers a strange explanationIndia vs South Africa: Shubman Gill's prolonged lean patch and India's continued backing of him have placed the spotlight firmly on the young opener as India prepare for next year's T20 World Cup. Gill has averaged less than 25 and hasn't hit a fifty yet in T20Is this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vaibhav-suryavanshi-on-being-googled-more-than-virat-kohli-see-it-move-on-2835174-2025-12-12",
      "headline": "Vaibhav Suryavanshi on being Googled more than Virat Kohli: I see it, I move onIndia's 14-year-old sensation Vaibhav Suryavanshi has reacted calmly to being Googled more than Virat Kohli after his explosive 171 against UAE in the U19 Asia Cup. The young opener says fame does not distract him as he focuses on preparation and improving his game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/brock-lesnar-roman-reigns-tribute-john-cena-retirement-final-wwe-match-2835172-2025-12-12",
      "headline": "I can see you: Cena gets tribute from Lesnar, Reigns ahead of WWE retirementBrock Lesnar and Roman Reigns sent emotional messages to John Cena ahead of his retirement from WWE. Cena will hang up his boots on December 13 at Saturday Night's main event. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}