{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-group-stocks-enterprise-green-energy-shares-gain-up-to-5-after-clarification-on-us-bribery-charge-2640859-2024-11-27",
      "headline": "Adani Group stocks gain up to 5% after clarification on US bribery chargeAdani Group stocks such as Adani Green Energy Ltd, Adani Power Ltd, Adani Energy Solutions Ltd, and Adani Enterprises Ltd gained as much as 5% after a fresh clarification on the US bribery charges. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-mobility-share-price-rises-sharply-new-range-of-electric-scooters-2640858-2024-11-27",
      "headline": "Explained: Ola Electric share price jumped 13% todayOla Electric Mobility share price opened at Rs 77.71 on the Bombay Stock Exchange (BSE), a 5% increase from the previous close of Rs 73.47, and touched a high of Rs 83.90, marking an increase of over 13%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ntpc-green-energy-share-price-stock-market-listing-should-you-hold-or-sell-2640846-2024-11-27",
      "headline": "NTPC Green Energy shares rise after listing. Should you hold or sell?NTPC Green Energy market listing: By 10:40 am, NTPC Green shares climbed further to Rs 120.80, signalling strong post-listing momentum. The upward movement in NTPC Green's share price defied expectations of a muted debut.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/ntpc-green-energy-share-price-stocks-make-muted-debut-on-dalal-street-lists-at-3-percent-premium-2640834-2024-11-27",
      "headline": "NTPC Green Energy shares make muted debut on D-Street, lists at 3% premiumNTPC Green Energy listing: NTPC Green Energy shares opened at Rs 111.50 each on the NSE (National Stock Exchange), marking a 3.24% increase from the issue price of Rs 108."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/enviro-infra-engineers-ipo-allotment-online-step-by-step-guide-to-check-status-latest-gmp-2640828-2024-11-27",
      "headline": "Enviro Infra Engineers IPO allotment: Step-by-step guide to check statusEnviro Infra Engineers IPO allotment: Investors who have bid for the Enviro Infra Engineers IPO can check their allotment status through the online portals of the Bombay Stock Exchange (BSE) and Bigshare Services Pvt Ltd. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-flat-adani-green-energy-enterprises-shares-gain-2-percent-2640808-2024-11-27",
      "headline": "Sensex, Nifty open flat; Adani Green Energy shares gain 2%The S&P BSE Sensex was down 61.58 points to 79,942.48, while the NSE Nifty50 lost 13.55 points to 24,180.95 "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-green-energy-ola-electric-mm-ntpc-green-energy-stocks-to-watch-today-2640797-2024-11-27",
      "headline": "Adani Green Energy, Ola Electric, M&M, NTPC Green Energy: Stocks to watch todaySeveral stocks such as NTPC Green Energy, Adani Green Energy, Ola Electric are expected to be in focus today. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-green-clarification-no-bribery-charges-against-gautam-adani-nephew-in-us-indictment-2640796-2024-11-27",
      "headline": "No bribery charges against Gautam Adani, nephew in US indictment: Adani GreenGautam Adani Bribery Case: Adani Green Energy Ltd (AGEL) highlighted that the charges in the US Department of Justice (DOJ) indictment and the civil complaint by the US Securities and Exchange Commission (SEC) do not include allegations of bribery or corruption. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/warren-buffett-money-net-worth-children-donates-usd-12-billion-unveils-plans-for-his-wealth-after-death-2640786-2024-11-27",
      "headline": "Warren Buffett donates $1.1 billion, reveals wealth distribution plan after deathWarren Buffett: In his latest letter to Berkshire Hathaway shareholders, the 94-year-old provided a deeply personal reflection on life's unpredictability and shared detailed plans for the distribution of his wealth after his passing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/adani-stocks-drop-as-moodys-downgrades-outlook-for-7-entities-2640712-2024-11-26",
      "headline": "Adani stocks drop as Moody's downgrades outlook for 7 entitiesShares of Adani Group stocks dropped during Tuesday's session after Moody's downgraded the outlook for seven of its companies. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-donald-trump-trade-tariff-on-china-can-india-gain-import-duty-explained-experts-factors-exports-2640315-2024-11-26",
      "headline": "Will India gain as Trump points tariff bazooka at China?US President-elect Donald Trump has announced punitive tariff measures against China, Canada and Mexico. Will India be able to overcome its challenges and seize this opportunity? This is what experts say.   "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/youth-unemployment-in-india-at-102-percent-says-union-labour-minister-shobha-karandlaje-2640498-2024-11-26",
      "headline": "Youth unemployment in India at 10.2%, says Union Labour ministerA report by the International Labour Organisation's (ILO) Institute for Human Development (IHD) shows the worldwide youth unemployment rate was 15.6% in 2021. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ntpc-green-energy-listing-date-share-price-latest-gmp-market-debut-strong-or-muted-expert-view-2640484-2024-11-26",
      "headline": "NTPC Green Energy listing: What does latest GMP signal ahead of market debut? NTPC Green Energy listing: Shares of NTPC Green Energy Limited will make their debut on Dalal Sreet on Wednesday with investors eyeing a strong opening on the stock exchanges. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-end-marginally-lower-adani-green-shares-down-7-percent-moody-ratings-2640430-2024-11-26",
      "headline": "Sensex, Nifty end marginally lower; Adani Green shares down 7%The S&P BSE Sensex was down 105.79 points to 80,004.06, while the NSE Nifty50 lost 27.40 points to 24,194.50. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/moody-ratings-downgrade-negative-adani-group-7-firms-adani-green-apsez-2640389-2024-11-26",
      "headline": "More trouble for Adani Group as Moody's downgrades outlook for 7 firmsThe downgrade comes in the wake of legal troubles involving Gautam Adani, the chairman of Adani Group, and his associates after charges of bribery by US authorities. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-ceo-deepinder-goyal-forgoes-rs-35-crore-salary-till-fy26-2640358-2024-11-26",
      "headline": "Zomato CEO Deepinder Goyal forgoes Rs 3.5 crore salary till FY26Despite waiving his salary, Goyal will continue to serve as Zomato's Managing Director (MD) and CEO, fulfilling all his responsibilities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/byjus-under-scrutiny-again-government-launches-new-investigation-into-finances-2640327-2024-11-26",
      "headline": "Byju's under scrutiny again: Government launches new investigation into financesByjus News: The probe aims to determine if the company misrepresented its financial statements or if funds were improperly diverted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-group-global-deals-at-risk-countries-france-sri-lanka-bangladesh-kenya-reaction-bribery-charges-2640280-2024-11-26",
      "headline": "Adani Group deals at risk: How countries have reacted after bribery chargesAdani Bribery Case: The recent bribery charges by US authorities, made public last week, have led to several countries revisiting or cancelling deals with the group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-green-total-energies-france-oil-major-pauses-investment-clarifies-no-new-financial-commitment-talks-2640297-2024-11-26",
      "headline": "Adani Green clarifies on French oil major's 'pausing new funding' messageThe statement by Adani Green Energy came a day after TotalEnergies said it was pausing new investments into the Adani Group over US bribery charges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vodafone-idea-shares-jump-18-percent-today-mtnl-telecom-sector-stocks-bharti-airtel-bank-guarantees-waiver-2640201-2024-11-26",
      "headline": "Explained: Why Vodafone Idea shares jumped 18% todayVodafone Idea Share Price: Vodafone Idea, MTNL shares rise: An announcement from the Department of Telecommunications (DoT) to provide relief to telecom operators resulted in a surge for telecom sector stocks. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/adani-bribery-case-mukul-rohatgi-congress-parliament-rule-267-2640855-2024-11-27",
      "headline": "Congress repeats 'arrest Gautam Adani' call, BJP says 'Soros script'Will raise in Parliament: Congress on Mukul Rohatgi's remark on Adani case"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-green-clarification-no-bribery-charges-against-gautam-adani-nephew-in-us-indictment-2640796-2024-11-27",
      "headline": "No bribery charges against Gautam Adani, nephew in US indictment: Adani GreenGautam Adani Bribery Case: Adani Green Energy Ltd (AGEL) highlighted that the charges in the US Department of Justice (DOJ) indictment and the civil complaint by the US Securities and Exchange Commission (SEC) do not include allegations of bribery or corruption. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nsg-counter-terrorism-unit-special-task-forces-jammu-city-terror-attacks-security-ops-2640861-2024-11-27",
      "headline": "Counter-terrorism force NSG to be stationed in Jammu amid rising attacks: SourcesNSG's special task force will be stationed permanently in Jammu city so that they can reach any spot in case of an emergency or terror attack, according to sources."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/warren-buffett-money-net-worth-children-donates-usd-12-billion-unveils-plans-for-his-wealth-after-death-2640786-2024-11-27",
      "headline": "Warren Buffett donates $1.1 billion, reveals wealth distribution plan after deathWarren Buffett: In his latest letter to Berkshire Hathaway shareholders, the 94-year-old provided a deeply personal reflection on life's unpredictability and shared detailed plans for the distribution of his wealth after his passing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/who-is-chinmoy-krishna-das-bangladesh-hindu-monk-leader-sanatani-muhammad-yunus-government-profile-2640841-2024-11-27",
      "headline": "The Hindu monk who struck fear in the heart of Yunus government in BangladeshChinmoy Krishna Das Brahmachari rose from obscurity to become the undisputed leader of Hindus in Bangladesh. After getting lakhs to attend his rallies, the monk struck fear in the heart of the caretaker government, which has arrested him in a contentious sedition case. Here's more about the monk whom Iskcon Bangladesh found too hot to handle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/syed-mushtaq-ali-trophy-urvil-patel-rishabh-pant-fastest-hundred-2640877-2024-11-27",
      "headline": "Unsold in IPL auction, Gujarat's Urvil Patel hits second fastest T20 hundredSyed Mushtaq Ali Trophy: Urvil Patel broke Rishabh Pant's record for the fastest hundred by an Indian batter in T20 cricket. The right-hander hit a 28-ball hundred for Gujarat against Tripura on Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/bjp-devendra-fadnavis-eknath-shinde-sena-maharashtra-chief-minister-dillemma-mahayuti-mva-ajit-pawar-ncp-2640771-2024-11-27",
      "headline": "BJP firm on Devendra Fadnavis, Eknath Shinde may have to swallow bitter pillMaharashtra Election Results: Days after the Mahayuti secured a thumping win in Maharashtra, the alliance wasn't able to reach a consensus on the chief ministerial face yet. The BJP remained firm on Devendra Fadnavis for the top post, while Shiv Sena clamoured for Eknath Shinde."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-jay-bhattacharya-national-institutes-of-health-head-while-house-indian-kolkata-2640787-2024-11-27",
      "headline": "Meet Jay Bhattacharya, Kolkata-born Stanford academic, set to lead US health agencyDr Jay Bhattacharya, a Stanford professor and economist originally from Kolkata, is known for his controversial views on Covid policies, including his opposition to lockdowns and vaccine mandates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/video-camera-in-middle-of-indian-ocean-captures-starships-water-landing-2640865-2024-11-27",
      "headline": "SpaceX camera in Indian Ocean captures Starship's water landingThe flight culminated in a dramatic splashdown in the Indian Ocean, off the northwestern coast of Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/yoda-diagnostics-launches-beat-the-diabetes-campaign-to-raise-awareness-and-promote-personalized-diabetes-care-2636609-2024-11-20",
      "headline": "Yoda Diagnostics Launches 'Beat the Diabetes' Campaign to Raise Awareness and Promote Personalized Diabetes CareEmpowering Personalized Diabetes Care: Yoda Diagnostics' 'Beat the Diabetes' Campaign Promotes Genetic-Based Medication Plans"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/odisha/story/odisha-rejects-leave-extension-plea-former-bjd-leader-vk-pandian-bureaucrat-wife-ias-sujata-karthikeyan-2640776-2024-11-27",
      "headline": "Odisha rejects leave extension of ex-BJD leader VK Pandian's bureaucrat wifeThe Odisha government's move to reject Kartikeyan's plea came months after the Election Commission in May ordered her immediate transfer from the Department of Mission Shakti to a non-public dealing department after the BJP complained of allegedly misusing public office."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/udaipur-city-palace-clashes-lakshyaraj-singh-mewar-warns-bjp-mla-vishvaraj-singh-rajasthan-2640763-2024-11-27",
      "headline": "Udaipur royals' feud: Can't force themselves into our home, cousin warns BJP MLAAfter clashes in Udaipur, Lakshyaraj Singh Mewar warned his cousin and BJP MLA Vishvaraj Singh against misusing his power and position within the Rajasthan government to forcefully enter City Palace."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tom-cruise-intense-underwater-prep-for-mission-impossible-8-see-photo-video-2640847-2024-11-27",
      "headline": "Tom Cruise's intense underwater prep for Mission Impossible 8: From depths to skiesTom Cruise shared BTS photo and video from Mission: Impossible – The Final Reckoning, showcasing his underwater stunt training. The film, releasing in May 2025, marks the franchise's epic finale."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-pollution-air-quality-aqi-level-smog-health-emergency-politics-severe-swast-2640142-2024-11-27",
      "headline": "Millions breathe poison, but why public health isn't political priority in IndiaDelhi AQI: Air pollution is behind 7% of all daily deaths in 10 Indian cities, and reduction of life expectancy, and overwhelming of hospitals in Delhi. Despite the health emergency, it isn't a political priority. Is it we the people to blame for it?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashish-nehra-reveals-why-shami-was-released-he-was-part-of-gts-retention-plan-2640856-2024-11-27",
      "headline": "Ashish Nehra reveals why Shami was released: He was part of GT's retention planIPL 2025 mega auction: Ashish Nehra revealed why Mohammed Shami was released by the franchise. Shami was sold for Rs 10 crore to SunRisers Hyderabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/cyclone-fengal-expected-landfall-november-29-chennai-heavy-rains-tamil-nadu-coast-impact-2640842-2024-11-27",
      "headline": "Cyclone Fengal expected to make landfall on Nov 29, Tamil Nadu braces for impactA cyclonic storm named Cyclone Fengal is likely to make landfall along Tamil Nadu's northeastern coast on November 29. Authorities are keeping a close watch for further intensification or landfall."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/food/story/cocktail-scene-in-india-is-getting-bolder-think-ingredients-like-maggi-masala-wasabi-2639762-2024-11-27",
      "headline": "Cocktail scene in India is getting bolder (think ingredients like Maggi masala, wasabi)MSG, sweetened fish sauce, ramen soup, wasabi, and kimchi - mixologists in India are shaking up the cocktail scene with these unconventional ingredients. But what's behind this rising trend of experimental cocktails?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-ceasefire-hezbollah-ceasefire-deal-benjamin-netanyahu-warning-lebanon-us-france-take-effect-2640740-2024-11-26",
      "headline": "Israel-Hezbollah ceasefire comes into effect with a warning from NetanyahuIsrael Hezbollah War: After approval by Israel's security cabinet, French President Emmanuel Macron and his US counterpart issued a joint statement, committing both nations to work with Israel and Lebanon to ensure that the ceasefire deal gets fully implemented."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-perth-test-hundred-explained-minor-adjustments-game-aus-vs-ind-2640779-2024-11-27",
      "headline": "Sunil Gavaskar, Matthew Hayden dissect Virat Kohli's comeback knock in Perth TestBorder-Gavaskar Trophy: Virat Kohli silenced his critics with a masterful century in the Perth Test, showcasing his ability to adapt and overcome challenges. Minor technical tweaks, particularly in his stance and shot selection, helped him rediscover his vintage form and play a part in India's memorable victory. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/bihar/story/why-this-bihar-government-school-teacher-moonlights-as-zomato-delivery-executive-2640825-2024-11-27",
      "headline": "Why this Bihar school teacher moonlights as Zomato delivery executiveAmit Sinha, a physical education teacher at a government-run school in Bihar's Bhagalpur district, gets only Rs 8,000 as his monthly salary. To make ends meet, he has been working as a Zomato delivery executive for the past four months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/mahindra-be-6e-xev-9e-launched-in-india-complete-details-about-price-features-range-battery-2640653-2024-11-26",
      "headline": "Mahindra BE 6e, XEV 9e price: Meet the big, tech-loaded, affordable electric SUVsThe BE 6e and the XEV 9e are the maiden battery electric vehicles of Mahindra, based on the electric-only INGLO architecture. Being ground-up electric SUVs, these two models will not have internal combustion engine (petrol or diesel) versions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pushpa-2-runtime-allu-arjun-3-hours-21-minutes-allu-arjun-sukumar-rashmika-mandanna-2640800-2024-11-27",
      "headline": "Pushpa 2 runtime out: Allu Arjun-starrer to be one of the longest Indian films?Allu Arjun's Pushpa 2: The Rule will hit theatres on December 5. The film's runtime was recently unveiled on social media. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/sambhal-violence-mosque-survey-uttar-pradesh-autopsy-police-firing-postmortem-death-2640772-2024-11-27",
      "headline": "Sambhal deaths' autopsy hints at country-made guns, not police firing: Sources Sambhal Violence News: Normalcy is returning to Sambhal with schools reopening and essential shops resuming operations, though internet services in Sambhal remain suspended."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/jharkhand-election-result-jmm-kalpana-cabinet-final-decision-hemant-soren-swearing-in-ceremony-india-bloc-ranchi-2640789-2024-11-27",
      "headline": "Kalpana Soren joining Jharkhand Cabinet not ruled out, final call soon: SourcesKalpana Soren, who defeated BJP's Muniya Devi from Jharkhand's Gandey seat, is not keen to be a part of the state Cabinet, but such a possibility cannot be ruled out, sources told India Today TV."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/akshay-kumar-nana-patekar-abhishek-bachchan-housefull-5-cast-2640880-2024-11-27",
      "headline": "Akshay Kumar-Nana Patekar reunite, Abhishek Bachchan joins Housefull 5 castThe cast of Housefull 5 was unveiled today, and it has certainly gotten bigger. The film, directed by Tarun Mansukhani, is set for release on June 6, 2025."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tom-cruise-intense-underwater-prep-for-mission-impossible-8-see-photo-video-2640847-2024-11-27",
      "headline": "Tom Cruise's intense underwater prep for Mission Impossible 8: From depths to skiesTom Cruise shared BTS photo and video from Mission: Impossible – The Final Reckoning, showcasing his underwater stunt training. The film, releasing in May 2025, marks the franchise's epic finale."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/television/reality-tv/story/bigg-boss-18-shrutika-arjun-breaks-down-quit-show-chum-darang-shilpa-shirodkar-karan-veer-mehra-2640845-2024-11-27",
      "headline": "BB 18 Day 50: Shrutika wants to quit show after fallout with Chum In the latest episode of Bigg Boss 18, Shrutika Arjun and Chum Darang had an emotional fallout. Shrutika broke down and cried inconsolably. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jyotika-tirupati-temple-visit-photos-suriya-kanguva-temple-2640840-2024-11-27",
      "headline": "Video: Jyotika visits Tirupati temple, clicks photos with fansActor Jyotika was seen visiting the Tirumala Tirupati temple in the early hours of November 27. A few days ago, Jyotika and Suriya visited a temple in Udupi."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/syed-mushtaq-ali-trophy-urvil-patel-rishabh-pant-fastest-hundred-2640877-2024-11-27",
      "headline": "Unsold in IPL auction, Gujarat's Urvil Patel hits second fastest T20 hundredSyed Mushtaq Ali Trophy: Urvil Patel broke Rishabh Pant's record for the fastest hundred by an Indian batter in T20 cricket. The right-hander hit a 28-ball hundred for Gujarat against Tripura on Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-2025-phil-salt-virat-kohli-rcb-2640864-2024-11-27",
      "headline": "RCB have always had fiery personalities: Salt on playing with KohliIPL 2025: Phil Salt said that he's ready to play alongside Virat Kohli after Royal Challengers Bengaluru RCB) bought him for a price of INR 11.50 crore in the auction that took place in Saudi Arabia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ashish-nehra-reveals-why-shami-was-released-he-was-part-of-gts-retention-plan-2640856-2024-11-27",
      "headline": "Ashish Nehra reveals why Shami was released: He was part of GT's retention planIPL 2025 mega auction: Ashish Nehra revealed why Mohammed Shami was released by the franchise. Shami was sold for Rs 10 crore to SunRisers Hyderabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-new-zealand-vs-england-ben-stokes-jacob-bethell-test-debut-2640836-2024-11-27",
      "headline": "Jacob Bethell has got something very special: Ben Stokes NZ vs ENG: England skipper Ben Stokes backed Jacob Bethell's selection saying that the Three Lions picked him after taking into account all factors. Bethell will make his Test debut at the Hagley Oval in Christchurch. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/63-not-out-remembering-phil-hughes-on-10th-death-anniversary-2640814-2024-11-27",
      "headline": "63 not out: Remembering Phil Hughes on 10th death anniversary27 November marks the 10-year death anniversary of Australian cricketer Phil Hughes. His untimely death "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/atp-awards-2024-carlos-alcaraz-dominic-thiem-nominees-2640811-2024-11-27",
      "headline": "Carlos Alcaraz, Dominic Thiem amongst nominees for ATP Awards Carlos Alcaraz and Dominic Thiem are amongst the nominees for the Stefan Edberg Sportsmanship Award in the 2024 ATP Awards. Alcaraz won the French Open and Wimbledon earlier this year"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-ms-dhoni-shah-rukh-khan-brand-market-report-cricketers-bollywood-2640788-2024-11-27",
      "headline": "Cricketers are bigger than Bollywood stars in the brand marketVirat Kohli, MS Dhoni, and Sachin Tendulkar have ranked higher than popular Bollywood actors, including Shah Rukh Khan and Amitabh Bachchan, in a latest Brand Endorser Report 2024 by Hansa Research. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-perth-test-hundred-explained-minor-adjustments-game-aus-vs-ind-2640779-2024-11-27",
      "headline": "Sunil Gavaskar, Matthew Hayden dissect Virat Kohli's comeback knock in Perth TestBorder-Gavaskar Trophy: Virat Kohli silenced his critics with a masterful century in the Perth Test, showcasing his ability to adapt and overcome challenges. Minor technical tweaks, particularly in his stance and shot selection, helped him rediscover his vintage form and play a part in India's memorable victory. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-jasprit-bumrah-perth-test-ravi-shastri-2640774-2024-11-27",
      "headline": "Bumrah enjoys the responsibility of captaincy: Ravi Shastri AUS vs IND: Jasprit Bumrah drew praise from Wasim Akram and Ravi Shastri for his match-winning performance in the Perth Test which India won by 295 runs to take a 1-0 lead in the five-match series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-venkatesh-iyer-kkr-captaincy-conundrum-ipl-2025-mega-auction-2640770-2024-11-27",
      "headline": "Beyond Venkatesh Iyer: KKR face captaincy conundrum despite impressive IPL auctionDespite an impressive IPL 2025 Auction, KKR does seem to have a captaincy hole to fill in their new-look squad. While Venkatesh Iyer seems to be the main candidate, he may not be the only choice they have in their ranks. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/video/world-chess-championship-final-d-gukesh-ding-liren-game-two-draw-analysis-2640751-2024-11-27",
      "headline": "Analysis: How D Gukesh held Ding Liren to draw with black pieces in Game 2Indian Grandmaster D. Gukesh demonstrated resilience by securing a draw in the second game against reigning champion Ding Liren in the ongoing World Chess Championship on Tuesday. The game, largely uneventful, saw Gukesh, playing with black pieces, recover composure following his loss in the opening game due to a critical blunder in the French Defense. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-ms-dhoni-shah-rukh-khan-brand-market-report-cricketers-bollywood-2640788-2024-11-27",
      "headline": "Cricketers are bigger than Bollywood stars in the brand marketVirat Kohli, MS Dhoni, and Sachin Tendulkar have ranked higher than popular Bollywood actors, including Shah Rukh Khan and Amitabh Bachchan, in a latest Brand Endorser Report 2024 by Hansa Research. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-virat-kohli-perth-test-hundred-explained-minor-adjustments-game-aus-vs-ind-2640779-2024-11-27",
      "headline": "Sunil Gavaskar, Matthew Hayden dissect Virat Kohli's comeback knock in Perth TestBorder-Gavaskar Trophy: Virat Kohli silenced his critics with a masterful century in the Perth Test, showcasing his ability to adapt and overcome challenges. Minor technical tweaks, particularly in his stance and shot selection, helped him rediscover his vintage form and play a part in India's memorable victory. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-jasprit-bumrah-perth-test-ravi-shastri-2640774-2024-11-27",
      "headline": "Bumrah enjoys the responsibility of captaincy: Ravi Shastri AUS vs IND: Jasprit Bumrah drew praise from Wasim Akram and Ravi Shastri for his match-winning performance in the Perth Test which India won by 295 runs to take a 1-0 lead in the five-match series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-venkatesh-iyer-kkr-captaincy-conundrum-ipl-2025-mega-auction-2640770-2024-11-27",
      "headline": "Beyond Venkatesh Iyer: KKR face captaincy conundrum despite impressive IPL auctionDespite an impressive IPL 2025 Auction, KKR does seem to have a captaincy hole to fill in their new-look squad. While Venkatesh Iyer seems to be the main candidate, he may not be the only choice they have in their ranks. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/video/world-chess-championship-final-d-gukesh-ding-liren-game-two-draw-analysis-2640751-2024-11-27",
      "headline": "Analysis: How D Gukesh held Ding Liren to draw with black pieces in Game 2Indian Grandmaster D. Gukesh demonstrated resilience by securing a draw in the second game against reigning champion Ding Liren in the ongoing World Chess Championship on Tuesday. The game, largely uneventful, saw Gukesh, playing with black pieces, recover composure following his loss in the opening game due to a critical blunder in the French Defense. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/wrestling-bajrang-punia-slapped-with-4-year-ban-for-violation-of-anti-doping-code-2640742-2024-11-26",
      "headline": "Bajrang Punia slapped with 4-year ban for violation of anti-doping codeOlympics bronze medallist Bajrang Punia has been handed a 4-year suspension by the National Anti-Doping Agency (NADA) for refusing to provide a urine sample during the selection trials for the national team. Bajrang was given a provisional suspension in April this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-australia-vs-india-jasprit-bumrah-michael-atherton-nasser-hussain-2640727-2024-11-26",
      "headline": "Jasprit Bumrah is a nightmare, thank goodness I didn't face him: Michael AthertonMichael Atherton and Nasser Hussain heaped praise on Jasprit Bumrah and admitted that they were happy not to face the Indian pacer during their respective playing careers. Bumrah led from the front in India's Perth Test win. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-world-championship-d-gukesh-second-game-draw-ding-liren-2640678-2024-11-26",
      "headline": "World Chess Championship: D Gukesh hopeful of 'more good days' after drawIndian chess Grandmaster D Gukesh is hoping that more good days will follow as he was able to draw the second game of the World Chess Championship against Ding Liren on Tuesday, November 26.  "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/sri-lanka-tour-of-pakistan-cricket-team-leave-midway-political-protests-2640673-2024-11-26",
      "headline": "Sri Lanka A cricket team to leave Pakistan tour midway due to political protestsSri Lanka's A team will return home midway from their ongoing series against Pakistan Shaheens due to intense political protests in Islamabad. The 2nd one-day game of a three-match series was suspended on Tuesday, hours before the start of the game. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-west-indies-vs-bangladesh-antigua-test-score-wtc-standings-2640662-2024-11-26",
      "headline": "Bangladesh slip to last in WTC table after 201-run loss in Antigua TestWest Indies (WI) vs Bangladesh (BAN). 1st Test: West Indies hammered Bangladesh by 201 runs in the series opener in Antigua. With their 8th defea in 11 matches in this cycle, Bangladesh slipped to the last spot in the World Test Championship standings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-auction-mohammed-siraj-emotional-farewell-letter-rcb-fans-2640659-2024-11-26",
      "headline": "Siraj bids emotional goodbye to RCB: 'Thank you for believing in me'IPL 2025: After securing a Rs 12.25 crore deal with Gujarat Titans, Mohammed Siraj wrote a heartfelt letter to RCB and their fans. Siraj's seven-year-long association with RCB came to an end during the mega auction in Jeddah. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-south-africa-vs-sri-lanka-test-series-full-squads-schedule-live-streaming-details-2640629-2024-11-26",
      "headline": "South Africa vs Sri Lanka Test series: Squads, all you need to knowWith crucial World Test Championship points up for grabs, South Africa and Sri Lanka will start the 2-match series on Wednesday, November 27. Both teams will be going for the win as the race for the WTC Final heats up. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-auction-vaihav-suryavanshi-age-crorepati-teenager-sports-others-2640610-2024-11-26",
      "headline": "Vaibhav Suryavanshi bags Rs 1.1 crore at 13: Other teen crorepatis in sportsA 13-year-old from Bihar, Vaibhav Suryavanshi, earned Rs 1.10 crore at the IPL 2025 mega auction. Here's a look at other teen sports stars who earned a massive sum of money with their rookie contracts across the world.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-west-indies-vs-bangladesh-antigua-test-score-wtc-standings-2640662-2024-11-26",
      "headline": "Bangladesh slip to last in WTC table after 201-run loss in Antigua TestWest Indies (WI) vs Bangladesh (BAN). 1st Test: West Indies hammered Bangladesh by 201 runs in the series opener in Antigua. With their 8th defea in 11 matches in this cycle, Bangladesh slipped to the last spot in the World Test Championship standings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-auction-mohammed-siraj-emotional-farewell-letter-rcb-fans-2640659-2024-11-26",
      "headline": "Siraj bids emotional goodbye to RCB: 'Thank you for believing in me'IPL 2025: After securing a Rs 12.25 crore deal with Gujarat Titans, Mohammed Siraj wrote a heartfelt letter to RCB and their fans. Siraj's seven-year-long association with RCB came to an end during the mega auction in Jeddah. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-south-africa-vs-sri-lanka-test-series-full-squads-schedule-live-streaming-details-2640629-2024-11-26",
      "headline": "South Africa vs Sri Lanka Test series: Squads, all you need to knowWith crucial World Test Championship points up for grabs, South Africa and Sri Lanka will start the 2-match series on Wednesday, November 27. Both teams will be going for the win as the race for the WTC Final heats up. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-auction-vaihav-suryavanshi-age-crorepati-teenager-sports-others-2640610-2024-11-26",
      "headline": "Vaibhav Suryavanshi bags Rs 1.1 crore at 13: Other teen crorepatis in sportsA 13-year-old from Bihar, Vaibhav Suryavanshi, earned Rs 1.10 crore at the IPL 2025 mega auction. Here's a look at other teen sports stars who earned a massive sum of money with their rookie contracts across the world.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-mega-auction-unsold-xi-impact-player-david-warner-prithvi-shaw-headline-list-2640592-2024-11-26",
      "headline": "IPL mega auction unsold XI, impact player: David Warner, Prithvi Shaw headline listIPL 2025 mega auction: Here is how a playing XI from the top and unexpected unsold players in the auction would look like. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/crikcet-rishabh-pant-delhi-capitals-ipl-auction-parth-jindal-breaks-silence-2640589-2024-11-26",
      "headline": "Delhi co-owner explains Pant exit, reveals late change of heart in IPL auctionIPL 2025 auction: Delhi Capitals co-owner Parth Jindal revealed that the ownership group had respected Rishabh Pant's decision to leave the franchise and promised not to bid for him in the auction. However, Delhi decided to use the Right To Match card for the wicketkeeper-batter. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/badminton-satwik-chirag-withdraws-from-syed-modi-international-super-300-tournament-2640554-2024-11-26",
      "headline": "Satwik-Chirag withdraws from Syed Modi International Super 300 tournamentIndia's top men's doubles pair, Satwiksairaj Rankireddy and Chirag Shetty, have withdrawn from the Syed Modi International citing injury concerns. The duo, once world No. 1, recently returned to form at the China Masters but are prioritising recovery."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}