{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-ends-690-points-lower-nifty-settles-below-25200-tcs-falls-4-percent-hul-shares-gain-2754367-2025-07-11",
      "headline": "Sensex ends 690 points lower, Nifty settles below 25,200; TCS falls 4%The S&P BSE Sensex was down by 689.81 points to end at 82,500.47, while the NSE Nifty50 lost 205.40 points to close at 25,149.85. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-bank-licence-rbi-government-plan-likely-report-2754342-2025-07-11",
      "headline": "New banks coming soon? India eyes first permits since 2014, says reportThe government and central bank are said to be considering multiple steps to create more, larger and stronger banks that can support India's ambitious economic growth plans over the coming decades."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/got-rs-5-lakh-health-insurance-should-you-buy-a-top-up-or-higher-sum-insured-2754300-2025-07-11",
      "headline": "Got Rs 5 lakh health insurance? Should you buy a top-up or higher sum insuredWhen you file a claim, your base policy settles the expenses first. If the bill crosses that limit, the top-up steps in. Normally, your base plan pays up to its maximum, and then the top-up kicks in to handle the rest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-down-700-points-nifty-plunge-stock-market-crash-1-why-it-stocks-down-1-percent-hul-share-price-2754233-2025-07-11",
      "headline": "Sensex plunges 700 points: Why the stock market fell 1% today? The S&P BSE Sensex fell nearly 700 points to 82,509.59, while the NSE Nifty50 declined by nearly 200 points to 25,162.25 as of 12:21 pm. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-2-and-itr-3-excel-utilities-released-who-can-file-and-what-is-new-2754212-2025-07-11",
      "headline": "ITR-2 and ITR-3 excel utilities released: Who can file and what's new?ITR-2 is meant for individuals or Hindu Undivided Families (HUFs) who are not eligible to file ITR-1 (Sahaj). This form is meant for taxpayers who do not have any income from business or profession and do not earn any income like interest, salary, bonus, commission, etc. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bitcoin-breaks-117000-mark-reaches-all-time-high-crypto-prices-ethereum-altcoins-rise-dogecoin-gain-2754173-2025-07-11",
      "headline": "Bitcoin breaks $117,000 mark, reaches all-time highAt the time of writing at 11.00 am, the world's largest cryptocurrency is trading at $117,863.18, climbing by 6.13% over the last 24 hours. Crypto experts believe if the supportive policies continue, digital coins could see even more new money coming in."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-showroom-experience-center-mumbai-opening-july-15-elon-musk-entry-india-2754155-2025-07-11",
      "headline": "Tesla drives into India: Mumbai to get first experience centre on July 15The space will allow visitors to explore Tesla's electric cars and related technologies, though test drives and deliveries may not be offered at this stage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/tcs-share-price-fall-it-stocks-down-weak-q1-results-should-you-buy-expert-view-sensex-nifty-2754140-2025-07-11",
      "headline": "TCS falls 2% on Q1 results miss. Should you buy as IT stocks struggle?TCS share price: The IT giant has lost 2.74% over the past five days and declined 4.37% in the past month. Over a six-month period, the stock is down 22.63%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/hul-share-price-rise-4-percent-priya-nair-new-ceo-rohit-jawa-replacement-leadership-change-2754108-2025-07-11",
      "headline": "Explained: Why HUL shares rose 4% todayHUL shares were up 3.8%, trading at Rs 2,500 as of 9;25 am, compared to Thursday's closing price of Rs 2,409.05. The stock ended Thursday's session nearly 1% lower but has gained 3.58% in the past five days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-280-points-lower-nifty-below-25300-hul-up-3-percent-2754105-2025-07-11",
      "headline": "Sensex opens 280 points lower, Nifty below 25,300; HUL up 4%The S&P BSE Sensex was down 250.37 points to 82,939.91, while the NSE Nifty50 lost 64.95 points to 25,290.30 as of 9:32 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-sensex-nifty-today-trading-setup-tcs-q1-results-weak-trump-tariff-2754096-2025-07-11",
      "headline": "Stock market opening: Weak TCS Q1 results to hamper Sensex, Nifty?The Gift Nifty futures were trading at 25,295 as of 8:30 am, suggesting that the Nifty 50 could open below Thursday's closing mark of 25,355.25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/priya-nair-first-woman-ceo-hul-hindustan-unilever-92-year-history-education-work-experience-rohit-jawa-2754081-2025-07-11",
      "headline": "Who is Priya Nair, first woman CEO of Hindustan UnileverPriya Nair will take over from Rohit Jawa, who will step down on July 31, 2025. Nair's appointment will come into effect from August 1, 2025."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/blackpink-jump-single-comeback-hardstyle-world-tour-2754365-2025-07-11",
      "headline": "BLACKPINK returns with high-energy single Jump after three yearsBLACKPINK has made a powerful comeback with their new single Jump after a three-year group hiatus. The release coincides with the launch of their ambitious Deadline World Tour across multiple continents."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhadak-2-trailer-siddhant-chaturvedi-triptii-dimri-inter-cast-love-story-cursed-by-society-2754366-2025-07-11",
      "headline": "Dhadak 2 trailer: Siddhant, Triptii battle caste and conflict in important filmSiddhant Chaturvedi and Triptii Dimri starrer 'Dhadak 2' trailer is out. Directed by Shazia Iqbal, the film will release in theatres on August 1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sanjay-dutt-on-the-raja-saab-and-dhurandhar-clash-i-hope-they-dont-2754348-2025-07-11",
      "headline": "Sanjay Dutt on The Raja Saab and Dhurandhar clash: I hope they don'tSanjay Dutt, who is part of both 'The Raja Saab' and 'Dhurandhar', has expressed concern over the films releasing on the same day. While promoting 'KD – The Devil', the actor spoke about his roles, bonding with Prabhas, and his admiration for Telugu cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ajay-devgn-on-diljit-dosanjh-criticism-and-trolling-for-sardaar-ji-3-at-son-of-sardaar-2-trailer-launch-viral-video-2754334-2025-07-11",
      "headline": "I am not in his shoes: Ajay says conversation needed between Diljit and his criticsDuring the trailer launch of 'Son of Sardaar 2,' Ajay Devgn reacted to the criticism and trolling that Diljit Dosanjh is facing for his film 'Sardaar Ji 3', which features Pakistani actor Hania Aamir. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ajay-devgn-had-tough-time-doing-viral-finger-dance-from-son-of-sardaar-2-2754333-2025-07-11",
      "headline": "Ajay Devgn had tough time doing viral finger dance from Son of Sardaar 2At the trailer launch of 'Son of Sardaar 2', Ajay Devgn addressed the viral memes about his quirky dance step with a humble request for gratitude despite the criticism. The film, set in scenic Scotland and marking Mukul Dev's last appearance, releases on July 25, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/surya-sethupathi-vijay-sethupathi-advice-nepotism-teamwork-tamil-debut-phoenix-2754275-2025-07-11",
      "headline": "Vijay Sethupathi's son Surya shares his father's advice for him before debutVijay Sethupathi's son Surya Sethupathi debuted in Tamil cinema with 'Phoenix'. The young debutant shared two key pieces of advice he got from his father before the release of his film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/empuraan-controversy-it-all-started-janaki-vs-stat-of-kerala-producer-suresh-kumar-censorship-row-2754289-2025-07-11",
      "headline": "It all started with Empuraan: Malayalam producer on JSK censorship rowAccording to producer Suresh Kumar, the release of Mohanlal's 'L2: Empuraan' has made the Censor Board more vigilant, impacting other films. The latest case involves 'JSK' aka 'Janaki vs State of Kerala' facing title-related censorship issues"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/panchayats-ashok-pathak-on-being-typecast-nobody-really-wants-to-put-in-effort-2754256-2025-07-11",
      "headline": "Panchayat's Ashok Pathak on being typecast: Nobody really wants to put in effortIn an exclusive interaction with IndiaToday.in, 'Panchayat's Ashok Pathak opened up about being typecast in the series. The actor stated that nobody wants to put in the hard work. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kuberaa-on-ott-when-and-where-to-watch-dhanush-nagarjunas-gritty-telugu-thriller-2754290-2025-07-11",
      "headline": "Kuberaa on OTT: When and where to watch Dhanush, Nagarjuna's gritty Telugu thrillerSekhar Kammula's 'Kuberaa', starring Dhanush, Nagarjuna Akkineni, and Rashmika Mandanna, is all set to premiere on Prime Video. The film, praised for its gripping tale and strong performances, explores the dark alleys of Mumbai through a story of conspiracy, ambition, and redemption."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-is-shrewd-sharp-and-warm-says-shruti-haasan-on-coolie-2754262-2025-07-11",
      "headline": "Rajinikanth is shrewd, sharp, and warm, says Shruti HaasanShruti Haasan shared her experience of working with Rajinikanth in 'Coolie', calling him a unique blend of sharp intelligence and genuine warmth. The actor also reflected on how the legendary stars of the past remain unmatched."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/pakistani-actor-humaira-asghar-ali-died-9-months-ago-october-karachi-apartment-months-isolation-2754258-2025-07-11",
      "headline": "Pakistani actor Humaira Asghar Ali died in October, body found after 9 monthsPakistani actor Humaira Asghar Ali's body was discovered in Karachi, believed to have died in October 2024. Her body lay undiscovered due to being disconnected from utilities and vacant surroundings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/son-of-sardaar-2-trailer-review-ajay-devgn-mrunal-thakur-take-fun-to-scotland-jibe-on-pakistan-follows-2754266-2025-07-11",
      "headline": "Son of Sardaar 2 trailer: Ajay Devgn takes fun to Scotland, jibe on Pakistan followsSon of Sardaar 2 trailer: Ajay Devgn and Mrunal Thakur join a fun ensemble cast in Scotland as the trailer for 'Son of Sardaar 2' was released online. The film is the second part in the action-comedy franchise. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kareena-kapoor-flirts-with-husband-saif-ali-khan-in-london-calls-him-hot-2754213-2025-07-11",
      "headline": "Kareena Kapoor turns photographer for husband Saif Ali Khan, calls him hotKareena Kapoor shared a glimpse of her vacation in London. She turned photographer for husband Saif Ali Khan. Take a look at the picture. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/prajakta-koli-only-indian-on-time100-creators-list-2754257-2025-07-11",
      "headline": "Prajakta Koli only Indian on TIME100 creators listPrajakta Koli has become the first Indian creator to be featured in the TIME100 Creators List 2025. She has been recognised as one of the most influential digital voices globally. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/boney-kapoor-remembers-sridevi-calls-her-an-empress-2754187-2025-07-11",
      "headline": "Boney Kapoor remembers Sridevi, calls her an Empress. See picFilm producer Boney Kapoor shared an emotional post in memory of his late wife, Sridevi. Sharing a beautiful picture of her in a golden and black lehenga, he called her an empress. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/aap-jaisa-koi-movie-review-r-madhavan-fatima-sana-shaikh-love-story-dull-rocky-aur-rani-aur-rani-ki-prem-kahani-2754226-2025-07-11",
      "headline": "Aap Jaisa Koi review: Madhavan-Fatima's love story is a dull Rocky Aur Rani...Release Date:Fri Jul 11, 2025Aap Jaisa Koi wants to be bold, progressive, and conversation-starting. But somewhere between intent and execution, this R Madhavan and Fatima Sana Shaikh film loses its spark. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/madhavan-married-actors-fail-to-create-romantic-chemistry-2754223-2025-07-11",
      "headline": "Madhavan says married actors fail to create romantic chemistry on-screenActor R Madhavan opened up about the complexities of performing romantic scenes and the need for true emotional connection. He highlighted that no technical trick can replace genuine chemistry between co-actors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/yuva-rajkumar-on-shiva-rajkumars-towering-screen-presence-he-has-that-aura-2754198-2025-07-11",
      "headline": "Actor Yuva on uncle Shiva Rajkumar's towering screen presence: He has that auraDuring an exclusive interview with India Today Digital, Kannada actor Yuva Rajkumar, who is gearing up for the release of his upcoming film 'Ekka', candidly spoke about his uncle and superstar Shiva Rajkumar's powerful screen presence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shruti-haasan-opens-up-about-her-decision-to-avoid-marriage-is-terrified-of-it-2754200-2025-07-11",
      "headline": "Shruti Haasan opens up about her decision to avoid marriage, is terrified of itShruti Haasan opened up about her choice to stay unmarried despite believing in love and commitment, citing her fear of marriage as an institution and valuing self-love and personal growth. She also shared her desire for motherhood with a loving partner. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/mumbai-police-initiates-action-against-shinde-senas-sanjay-gaikwad-for-assaulting-canteen-staff-2754364-2025-07-11",
      "headline": "Case against Shinde Sena's Sanjay Gaikwad for assaulting canteen staffMumbai Police has initiated action against Shiv Sena (Eknath Shinde) MLA Sanjay Gaikwad for assaulting canteen staff over dal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ajit-dovals-dare-on-operation-sindoor-show-me-one-photo-of-any-damage-in-india-2754285-2025-07-11",
      "headline": "Ajit Doval dares foreign media on Op Sindoor: Show one photo of damage in IndiaNational Security Advisor Ajit Doval hailed Operation Sindoor as a precise, indigenous response to a Pakistan-backed terror attack in Jammu and Kashmir's Pahalgam. Speaking at IIT Madras, he dismissed critics' claims of collateral damage, demanding proof of wreckage in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/radhikas-father-spent-rs-25-crore-on-tennis-she-wanted-to-be-influencer-inspired-by-elvish-yadav-sources-2754318-2025-07-11",
      "headline": "Radhika was inspired by Elvish Yadav, father spent Rs 2.5 crore on tennis: SourcesRadhika Yadav, the young tennis player who was recently murdered, aspired to become a social media influencer inspired by Elvish Yadav, a popular content creator from her village."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-3rd-test-day-2-live-score-updates-lords-joe-root-stokes-gill-2754292-2025-07-11",
      "headline": "3rd Test, Day 2 Live: Bumrah removes Stokes after Root hits 100IND vs ENG, Lord's Test Day 2 Live Score: India have ensured a great start to Day 2 of the Lord's Test after Jasprit Bumrah dismissed England skipper Ben Stokes, only moments after Joe Root completed his 37th Test hundred."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/aap-jaisa-koi-movie-review-r-madhavan-fatima-sana-shaikh-love-story-dull-rocky-aur-rani-aur-rani-ki-prem-kahani-2754226-2025-07-11",
      "headline": "Aap Jaisa Koi review: Madhavan-Fatima's love story is a dull Rocky Aur Rani...Release Date:Fri Jul 11, 2025Aap Jaisa Koi wants to be bold, progressive, and conversation-starting. But somewhere between intent and execution, this R Madhavan and Fatima Sana Shaikh film loses its spark. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/odisha-detains-bangladeshi-nationals-trinamool-bengali-migrants-calcutta-high-court-2754352-2025-07-11",
      "headline": "Bangladeshis or Bengali migrants? Trinamool vs BJP over detention of 444 workersThe row started after the Odisha government detained 444 suspected Bangladeshi nationals. The Trinamool Congress claimed that most of them were Bengali-speaking migrant workers. The matter has also reached the Calcutta High Court."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-sem-verbeek-father-happy-birthday-mixed-doubles-title-katerina-siniakova-2754138-2025-07-11",
      "headline": "Wimbledon mixed champion Verbeek gets crowd to sing Happy Birthday to dadSem Verbeek marked his first Grand Slam title at Wimbledon 2025 with a special gesture, leading Centre Court in singing 'Happy Birthday' to his father moments after winning the mixed doubles final alongside Katerina Siniakova."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/west-bengal-bjp-samik-bhattacharya-muslim-outreach-communist-left-strategy-change-assembly-election-2754175-2025-07-11",
      "headline": "Why Bengal BJP's new chief has taken a new tone on Muslims, CommunistsBJP Rajya Sabha MP Samik Bhattacharya, an old RSS hand, has assumed charge as the party chief of West Bengal ahead of the crucial Assembly election in 2026. Bhattacharya has surprised many by his outreach to Muslims and Communists. Is there a lesson from 2019 and the Kaliganj bypoll behind this?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-superman-white-house-superman-avatar-tariff-storm-trolled-2754279-2025-07-11",
      "headline": "White House shows Trump as Superman amid tariff storm, gets trolledThe White House shared an AI-generated image of US President Donald Trump in a Superman avatar, calling the 79-year-old a \"symbol of hope\" for all Americans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/china-secret-biggest-medong-dam-brahmaputra-threat-arunachal-cm-pema-khandu-water-bomb-india-challenges-risks-explained-2753917-2025-07-11",
      "headline": "Chinese dam a ticking bomb, says Arunachal CM. Why secretive project is a concernChina's upcoming secretive mega-dam on the Yarlung Tsangpo, just 50 km from the Indian border, was termed a \"ticking time bomb\" by Arunachal Pradesh CM Pema Khandu. With a massive reservoir capacity and zero transparency on data, experts warn of ecological, strategic, and humanitarian risks downstream."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-goes-to-nations-without-invite-went-to-pak-cant-we-ask-him-questions-bhagwant-mann-after-centres-snub-2754220-2025-07-11",
      "headline": "PM goes to countries uninvited. Can't we question him? Bhagwant Mann doubles downPunjab Chief Minister Bhagwant Mann slammed PM Modi over uninvited foreign visits and questioned the Centre's stance on foreign policy and the Diljit Dosanjh film row. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/as-brics-debates-reducing-dollar-dependence-why-india-is-walking-a-fine-line-2753797-2025-07-10",
      "headline": "As BRICS debates reducing dollar dependence, why India is walking a fine lineNew Delhi's core demand: build alternatives that are interoperable and don't just replace the US dollar with another hegemon\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/jane-birkin-original-hermes-bag-sold-for-rs-85-crore-2754208-2025-07-11",
      "headline": "10 minutes. 9 bidders. And the OG Birkin sold for Rs 85 croreThe most coveted Hermes Birkin Bag, which was made for the late actress Jane Birkin, has been auctioned as the most valuable handbag sold so far. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/air-india-flight-ahmedabad-crash-report-reasons-behind-accident-2754271-2025-07-11",
      "headline": "A month on, we may finally know what crashed Air India jet this weekAir India crash report: On June 12, the London-bound Air India flight, a Boeing 787 Dreamliner, crashed into the BJ Medical College hostel building in Ahmedabad within seconds of take-off."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rss-chief-mohan-bhagwat-prime-minister-narendra-modi-retire-75-congress-jairam-ramesh-speculations-2754172-2025-07-11",
      "headline": "RSS chief says leaders should retire at 75, Congress's 'poor Prime Minister' digRSS chief Mohan Bhagwat said that leaders should retire at 75, triggering a dig from the Congress, who speculated about the remark's application to Prime Minister Narendra Modi, who will turn 75 in September."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/had-fever-was-resting-in-room-killed-tennis-players-mother-tells-cops-after-husbands-arrest-sources-2754278-2025-07-11",
      "headline": "What mother of tennis player Radhika Yadav, shot dead by father, told copsRadhika Yadav, a 25-year-old national-level tennis player, was allegedly shot dead by her father in Gurugram. Her mother, Manju Yadav, refused to give a formal police statement, citing illness at the time of the incident.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/gajar-ka-halwa-steals-the-show-in-shubhanshu-shuklas-space-party-astronauts-cant-get-enough-2754210-2025-07-11",
      "headline": "Gajar ka halwa from India steals the show at Space Station partyThe special treat, developed for space by ISRO and DRDO, was part of a small party held aboard the station, marking one of the most memorable evenings of the Axiom Mission 4 (Ax-4)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/heart-of-the-matter-when-a-hospital-queue-in-mysuru-taught-us-a-lesson-bengaluru-hassan-siddaramaiah-2754188-2025-07-11",
      "headline": "Heart of the matter: When a hospital queue in Mysuru taught us a lessonThey weren't sick but they were worried. Outside the Jayadeva hospital in Mysuru, people lined up not for treatment, but for clarity. In a world where heart disease can go unnoticed until it's too late, the quiet question persists: Should I be getting checked — even if I feel fine?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/pakistani-actor-humaira-asghar-ali-died-9-months-ago-october-karachi-apartment-months-isolation-2754258-2025-07-11",
      "headline": "Pakistani actor Humaira Asghar Ali died in October, body found after 9 monthsPakistani actor Humaira Asghar Ali's body was discovered in Karachi, believed to have died in October 2024. Her body lay undiscovered due to being disconnected from utilities and vacant surroundings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/radhika-yadav-tennis-player-murder-reason-music-video-instagram-reels-upset-father-2754179-2025-07-11",
      "headline": "Radhika Yadav's music video emerges, may have been trigger for tennis star's murderPolice said the primary trigger for the murder was a long-standing dispute between Radhika and her father over the tennis academy she was running."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/ragging-in-college-campus-psychology-power-dominance-2753911-2025-07-10",
      "headline": "Why ragging still thrives: A look at power, fear, and college campus cultureFrom ancient military drills to WhatsApp bullying, here's why ragging still haunts Indian colleges despite UGC rules, and what it says about human nature."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/basaveshwaranagar-police-arrest-woman-for-duping-kitty-party-friends-over-rs-30-crore-with-fake-investment-schemes-2754230-2025-07-11",
      "headline": "Woman arrested for duping 'kitty party' friends of over Rs 30 crore in BengaluruA woman in Bengaluru has been arrested for allegedly cheating over 20 women of Rs 30 crore by befriending them at kitty parties. She is said to have collected large sums under the guise of investment and gold deals, which she didn't return. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/alia-bhatt-vedika-shetty-leaked-confidential-data-united-states-syphoned-rs-77-lakh-2754202-2025-07-11",
      "headline": "Alia Bhatt's ex-assistant leaked data to US national, stole Rs 77 lakh: ProbeAlia Bhatt's ex-assistant Vedika Shetty allegedly leaked confidential data and syphoned Rs 77 lakh from the actress's accounts, leading to her arrest in Bengaluru after months on the run."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/coimbatore-police-beat-man-dragged-from-bmw-viral-video-controversy-tn-he-says-no-issue-with-cops-2754194-2025-07-11",
      "headline": "Man dragged out of car, beaten by Tamil Nadu cops, he says no issue with policeA video of Tamil Nadu police dragging a man out of a BMW car and hitting him with lathis in Coimbatore has gone viral. The man, however, in a video released later said that the incident was resolved and has no problem with the police. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhadak-2-trailer-siddhant-chaturvedi-triptii-dimri-inter-cast-love-story-cursed-by-society-2754366-2025-07-11",
      "headline": "Dhadak 2 trailer: Siddhant, Triptii battle caste and conflict in important filmSiddhant Chaturvedi and Triptii Dimri starrer 'Dhadak 2' trailer is out. Directed by Shazia Iqbal, the film will release in theatres on August 1. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sanjay-dutt-on-the-raja-saab-and-dhurandhar-clash-i-hope-they-dont-2754348-2025-07-11",
      "headline": "Sanjay Dutt on The Raja Saab and Dhurandhar clash: I hope they don'tSanjay Dutt, who is part of both 'The Raja Saab' and 'Dhurandhar', has expressed concern over the films releasing on the same day. While promoting 'KD – The Devil', the actor spoke about his roles, bonding with Prabhas, and his admiration for Telugu cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ajay-devgn-on-diljit-dosanjh-criticism-and-trolling-for-sardaar-ji-3-at-son-of-sardaar-2-trailer-launch-viral-video-2754334-2025-07-11",
      "headline": "I am not in his shoes: Ajay says conversation needed between Diljit and his criticsDuring the trailer launch of 'Son of Sardaar 2,' Ajay Devgn reacted to the criticism and trolling that Diljit Dosanjh is facing for his film 'Sardaar Ji 3', which features Pakistani actor Hania Aamir. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ajay-devgn-had-tough-time-doing-viral-finger-dance-from-son-of-sardaar-2-2754333-2025-07-11",
      "headline": "Ajay Devgn had tough time doing viral finger dance from Son of Sardaar 2At the trailer launch of 'Son of Sardaar 2', Ajay Devgn addressed the viral memes about his quirky dance step with a humble request for gratitude despite the criticism. The film, set in scenic Scotland and marking Mukul Dev's last appearance, releases on July 25, 2025."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-rishabh-pant-injury-dhruv-jurel-replace-lords-test-day-2-2754368-2025-07-11",
      "headline": "Dhruv Jurel continues as keeper on Day 2, Pant still recoveringIndia vice-captain Rishabh Pant suffered a finger injury on Day 1 of the Lord's Test, prompting Dhruv Jurel to take over wicketkeeping duties on Day 2 against England, as confirmed by the BCCI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/red-for-ruth-campaign-lords-lung-cancer-research-england-india-third-test-2754360-2025-07-11",
      "headline": "Lord's turns red on Day 2 to support Strauss Foundation and raise fundsLord's - the Home of Cricket - once again turned red for the Ruth Strauss Foundation's annual #RedforRuth day, held on the second day of the third Test between India and England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-joe-root-37th-hundred-rahul-dravid-lords-2753987-2025-07-11",
      "headline": "Lord's Test: With 37th century, Joe Root goes past Rahul Dravid and breaks into top 5Joe Root cracked into the top 5 list for the most Test hundreds with his 37th century against India on Day two of the match in Lord's. Root played 192 balls to get to his hundred. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mitchell-starc-pink-ball-day-night-test-sabina-park-australia-cricket-milestone-2754321-2025-07-11",
      "headline": "Starc wary of pink ball challenge ahead of day-night Test in West IndiesAustralian pacer Mitchell Starc acknowledged that bowlers might receive some assistance under lights with the pink ball. Starc will complete his 100th Test at Sabina Park against the West Indies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-vs-jannik-sinner-roger-wimbledon-2025-semifinal-roger-federer-prediction-2754315-2025-07-11",
      "headline": "Djokovic or Sinner: Federer reveals his prediction for Wimbledon semifinalRoger Federer has revealed his prediction for the Wimbledon 2025 semifinal, where he expects Novak Djokovic to take down top-seed Jannik Sinner. The Serbian eyes a 25th Grand Slam title and this could be the shot that extends his record. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-3rd-test-day-2-live-score-updates-lords-joe-root-stokes-gill-2754292-2025-07-11",
      "headline": "3rd Test, Day 2 Live: Bumrah removes Stokes after Root hits 100IND vs ENG, Lord's Test Day 2 Live Score: India have ensured a great start to Day 2 of the Lord's Test after Jasprit Bumrah dismissed England skipper Ben Stokes, only moments after Joe Root completed his 37th Test hundred."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-ollie-pope-england-slow-batting-bazball-lords-test-2754232-2025-07-11",
      "headline": "Not a surface to come out swinging: Pope on England's slow batting approachENG vs IND: Ollie Pope explained why England decided to opt for a slow batting approach in the opening day of the Lord's Test. He suggested that the surface used and India's bowling lengths resulted in the batters being unable to freely attack, resulting in a slow scoring day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dinesh-karthik-mcc-museum-tour-lords-cricket-history-kapil-dev-1983-world-cup-2754221-2025-07-11",
      "headline": "Dinesh Karthik takes fans on heartfelt tour of MCC Museum at Lord'sFormer Indian cricketer Dinesh Karthik recently gave fans a personal tour of the MCC Museum at Lord's. He highlighted the 1983 World Cup display, including Kapil Dev's jersey and a replica of the trophy, giving a close-up look at one of Indian cricket's most iconic moments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-bazball-classic-batting-jonathan-trott-reaction-lords-test-vs-india-2754177-2025-07-11",
      "headline": "England took a different approach: Trott credits hosts' classical battingJonathan Trott praised England's smart, disciplined approach as they hit pause on Bazball and adapted to the testing conditions at Lord's. Led by a patient 99 from Joe Root, it was a day marked by maturity and control rather than explosive strokeplay."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mitchell-starc-reaction-100-tests-australia-vs-west-indies-2754169-2025-07-11",
      "headline": "Mitchell Starc reflects on journey to 100 Tests: It makes me feel oldMitchell Starc joked that it makes him feel old as he reflected on the remarkable journey to his 100th Test. He is set to become just the second Australian fast bowler, after Glenn McGrath, to reach the milestone."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-nitish-kumar-reddy-anil-kumble-lords-test-opening-spell-2754158-2025-07-11",
      "headline": "India should persist with him: Kumble backs Nitish Reddy's all-round skillENG vs IND: Anil Kumble feels that India should give Nitish Kumar Reddy an extended run in Test cricket. He believes that there is a lot of talent in the 22-year-old and is more than capable of delivering with bat and ball in the longest format. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-ollie-pope-england-slow-batting-bazball-lords-test-2754232-2025-07-11",
      "headline": "Not a surface to come out swinging: Pope on England's slow batting approachENG vs IND: Ollie Pope explained why England decided to opt for a slow batting approach in the opening day of the Lord's Test. He suggested that the surface used and India's bowling lengths resulted in the batters being unable to freely attack, resulting in a slow scoring day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dinesh-karthik-mcc-museum-tour-lords-cricket-history-kapil-dev-1983-world-cup-2754221-2025-07-11",
      "headline": "Dinesh Karthik takes fans on heartfelt tour of MCC Museum at Lord'sFormer Indian cricketer Dinesh Karthik recently gave fans a personal tour of the MCC Museum at Lord's. He highlighted the 1983 World Cup display, including Kapil Dev's jersey and a replica of the trophy, giving a close-up look at one of Indian cricket's most iconic moments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-bazball-classic-batting-jonathan-trott-reaction-lords-test-vs-india-2754177-2025-07-11",
      "headline": "England took a different approach: Trott credits hosts' classical battingJonathan Trott praised England's smart, disciplined approach as they hit pause on Bazball and adapted to the testing conditions at Lord's. Led by a patient 99 from Joe Root, it was a day marked by maturity and control rather than explosive strokeplay."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mitchell-starc-reaction-100-tests-australia-vs-west-indies-2754169-2025-07-11",
      "headline": "Mitchell Starc reflects on journey to 100 Tests: It makes me feel oldMitchell Starc joked that it makes him feel old as he reflected on the remarkable journey to his 100th Test. He is set to become just the second Australian fast bowler, after Glenn McGrath, to reach the milestone."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-nitish-kumar-reddy-anil-kumble-lords-test-opening-spell-2754158-2025-07-11",
      "headline": "India should persist with him: Kumble backs Nitish Reddy's all-round skillENG vs IND: Anil Kumble feels that India should give Nitish Kumar Reddy an extended run in Test cricket. He believes that there is a lot of talent in the 22-year-old and is more than capable of delivering with bat and ball in the longest format. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}