{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-overtakes-japan-become-worlds-4th-largest-economy-in-world-niti-aayog-2730164-2025-05-25",
      "headline": "India overtakes Japan to become fourth-largest economy: Niti AayogIndia has overtaken Japan to become the world's 4th largest economy, with a GDP of $4 trillion. NITI Aayog projects India will become the 3rd largest economy in the next 2-3 years, surpassing Germany. Factors contributing to this growth include infrastructure development, Make in India initiative, GST implementation, and fiscal discipline during the COVID-19 pandemic. The country has reduced extreme poverty to less than 5% and is poised for rapid growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-becomes-fourth-largest-economy-ahead-of-japan-niti-aayog-ceo-2730153-2025-05-25",
      "headline": "India now fourth-largest economy, ahead of Japan: Niti Aayog CEOIndia's GDP has reached $4 trillion, placing it behind only the US, China, and Germany, according to IMF data cited by NITI Aayog CEO BVR Subrahmanyam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-samsung-mobiles-apple-iphone-tariffs-india-manufacturing-2729791-2025-05-24",
      "headline": "Trump targets Samsung after tax threat to Apple for India shift: Wouldn't be fairThe US President warned that Samsung, and not only Apple, would face a 25% import tax if its phones were not manufactured in America."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-proposes-50-tariff-on-eu-goods-from-june-1-2729562-2025-05-23",
      "headline": "Trump proposes 50% tariff on EU goods from June 1Trump criticised the EU for maintaining restrictive trade practices, levying high taxes, and taking legal action against US companies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-declares-rs-268-lakh-crore-dividend-to-support-government-fiscal-goals-2729528-2025-05-23",
      "headline": "RBI to pay Rs 2.69 lakh crore to government as dividend for FY25The RBI has approved a large dividend of Rs 2.69 lakh crore for the financial year 2025, which is higher than Rs 2.1 lakh crore given last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/not-india-or-anyplace-else-trump-warns-apple-of-25-tariff-if-iphones-not-manufactured-in-us-2729506-2025-05-23",
      "headline": "Not India or anyplace else: Trump's 25% tariff warning if iPhones not made in USDonald Trump's statement on levying 25% tariff on iPhones has caused Apple shares to fall by 2.5% in premarket trading, and US stock futures also slipped. However, it's still unclear whether Trump actually has the legal power to impose a tariff on one specific company."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/ipo-revival-primary-market-upcoming-public-listings-should-investors-put-money-leela-hotel-lg-ril-2729465-2025-05-23",
      "headline": "Fresh IPOs likely to flood Dalal Street: Time to ride the wave?Four IPOs are lined up to open in the last week of May. These include Scoda Tubes, Prostarm Info Systems, Leela Hotels (Schloss Bangalore Limited), and Aegis Vopak Terminals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rs-10-crore-for-child-education-edelweiss-ceo-and-md-radhika-gupta-maths-and-message-2729440-2025-05-23",
      "headline": "Rs 10 crore for child's education? Edelweiss' Radhika Gupta's maths and messageRadhika Gupta explained that the current cost of a full higher education in the US is around Rs 2.5 crore. Now, if you consider average inflation of 5% and currency depreciation of 4% every year, the value of that education will go up a lot over the next 16 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-closes-769-points-higher-nifty-above-24800-eternal-ends-with-3-percent-gain-fmcg-it-banking-2729441-2025-05-23",
      "headline": "Sensex, Nifty close higher over US-China trade hopes despite FII outflow fearsThe S&P BSE Sensex added 769.09 points to close at 81,721.08, while the NSE Nifty50 gained 243.45 points to end at 24,853.15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/microsoft-google-and-more-cut-over-61000-jobs-in-2025-here-is-why-2729361-2025-05-23",
      "headline": "Microsoft, Google and more cut over 61,000 jobs in 2025: Here's why?One of the biggest cuts came from Microsoft, which let go of 6,000 employees, its largest round of job losses since 2023. Nearly 2,000 of these were in Washington state alone. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/reliance-power-rpower-share-price-rise-18-percent-why-reason-should-you-buy-2729360-2025-05-23",
      "headline": "Reliance Power Ltd share price rises over 18%. Should you buy?Reliance Power has gained 20.77% in the last month, 51.98% over the last six months, and 99.13% over the past year. Over the last five years, it has gone up by a massive 2,820.56%."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/k3g-actor-malvika-raaj-and-husband-pranav-bagga-announce-pregnancy-2730315-2025-05-25",
      "headline": "K3G actor Malvika Raaj and husband Pranav Bagga announce pregnancy'Kabhie Khushi Kabhie Gham' actor Malvika Raaj and her husband Pranav Bagga are expecting their first child. She sharing the happy news with adorable photos on Instagram. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/crunchyroll-anime-awards-2025-full-winners-list-solo-leveling-bags-anime-of-the-year-2730314-2025-05-25",
      "headline": "Crunchyroll Anime Awards 2025 Full Winners List: Solo Leveling bags Anime of the yearThe 2025 Crunchyroll Anime Awards held in Tokyo celebrated the best in anime with Solo Leveling emerging as the biggest winner. The star-studded event also honoured Attack on Titan for its cultural impact and featured performances by popular artists, making it a grand celebration of anime's global influence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/preity-zinta-donates-rs-110-crore-to-help-army-widows-children-after-operation-sindoor-2730310-2025-05-25",
      "headline": "Preity Zinta donates Rs 1.10 crore to help Army widows, children after Op SindoorActor Preity Zinta donated Rs 1.10 crore to the Army Wives Welfare Association after India's Operation Sindoor. The actor made the generous donation at an event held in Jaipur on May 24. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kuberaa-teaser-dhanush-nagarjuna-rashmika-mandanna-jim-sarbh-power-and-wealth-2730289-2025-05-25",
      "headline": "Kuberaa teaser: Dhanush, Nagarjuna's film explores power and wealthThe teaser of 'Kuberaa' starring Dhanush and Rashmika Mandanna is finally out. Sekhar Kammula's pan-Indian directorial will release in theatres on June 20.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aankhen-dharmendra-mala-sinha-sankari-sky-saved-india-2730296-2025-05-25",
      "headline": "Ankhen: The sanskari spy who shunned martinis and saved India'Ankhen' remains a landmark spy thriller of 1968 Bollywood, blending patriotism, action, and strong female roles. The film's unique gadgets and nostalgic style made it a classic Indian cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-waves-at-fans-as-he-steps-out-for-weekend-outing-2730287-2025-05-25",
      "headline": "Allu Arjun waves at fans as he steps out for weekend outing. WatchActor Allu Arjun stepped out for a weekend outing on May 24. In a viral video, he is seen waving to fans as he exits a showroom."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ram-gopal-varma-triptii-dimri-will-be-next-big-thing-in-bollywood-after-spirit-prabhas-sandeep-reddy-vanga-2730281-2025-05-25",
      "headline": "Ram Gopal Varma says Triptii Dimri will be next big thing in Bollywood after SpiritFilmmaker Ram Gopal Varma shared a post on X and praised Sandeep Reddy Vanga for casting Triptii Dimri in 'Spirit.' The actor will be seen opposite Prabhas. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/shreya-ghoshals-tribute-to-armed-forces-with-maa-tujhe-salaam-rendition-at-mumbai-concert-2730255-2025-05-25",
      "headline": "Shreya Ghoshal's tribute to armed forces with 'Maa Tujhe Salaam' rendition. WatchShreya Ghoshal concluded her 'All Hearts Tour' in Mumbai with a tribute to the Indian armed forces, performing 'Maa Tujhe Salaam' as a mark of respect. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/urvashi-rautela-alia-bhatt-stun-in-viral-cannes-selfie-2730257-2025-05-25",
      "headline": "Bold meets beauty: Urvashi Rautela, Alia Bhatt stun in viral Cannes selfieUrvashi Rautela shared a picture with Alia Bhatt from their Cannes appearance. Fans were thrilled to see two beautiful actors in one frame. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-attends-friends-wedding-with-y-cover-after-security-breach-at-home-2730231-2025-05-25",
      "headline": "Salman Khan attends friend's wedding with Y+ cover after security breach at homeSalman Khan attended his friend Ayaz Khan's wedding in Mumbai under Y+ cover following a recent security breach at his Galaxy Apartments. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/papon-bows-back-to-fan-at-pune-concert-in-heart-winning-gesture-2730219-2025-05-25",
      "headline": "Singer Papon bows back to fan at concert in heart-winning gesture. WatchSinger Papon impressed the Pune crowd with his beautiful singing and a sweet gesture to a fan during his concert.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/metro-in-dino-first-look-anurag-basu-film-introduces-modern-love-relationships-2730210-2025-05-25",
      "headline": "Metro In Dino 1st look: Anurag Basu's film introduces modern love, relationships'Metro In Dino' first look was unveiled by the makers on social media. The film introduces the entire star cast, including Anupam Kher, Sara Ali Khan, Aditya Roy Kapur and Pankaj Tripathi, among others. \r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/paresh-rawal-reacts-to-akshay-kumar-lawsuit-hera-pheri-3-2730194-2025-05-25",
      "headline": "Paresh Rawal reacts to Akshay's lawsuit: My lawyer has sent an appropriate responseParesh Rawal has responded to Akshay Kumar's legal notice over his sudden exit from 'Hera Pheri 3', stating that his lawyer has sent a proper reply. The actor has also returned the signing amount with interest, but the legal dispute may delay the film's progress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anushka-sharma-virat-kohli-visit-ayodhya-ram-mandir-and-hanuman-garhi-2730182-2025-05-25",
      "headline": "Anushka Sharma, Virat Kohli visit Ayodhya's Ram Mandir and Hanuman GarhiAnushka Sharma and Virat Kohli offered prayers at Ayodhya's Ram Mandir and Hanuman Garhi after RCB vs SRH match in Lucknow on May 23. Pictures and videos of the couple's visit have gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/jane-fonda-admires-alia-bhatt-gucci-saree-look-in-candid-chat-cannes-film-festival-2730170-2025-05-25",
      "headline": "Cannes candids: Jane Fonda is all admiration for Alia Bhatt's Gucci-saree lookAlia Bhatt represented her culture at Cannes in a Gucci saree. The actor was joined by Hollywood icon Jane Fonda, who admired the Bollywood actor's ensemble. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/khushi-tdt-lashcurry-on-success-of-victory-anthem-politics-in-music-industry-exclusive-2729620-2025-05-25",
      "headline": "Khushi TDT-Lashcurry on success of Victory Anthem, politics in music industryVictory Anthem by Khushi TDT and Lashcurry is a powerful hip-hop track that has struck a chord with millions globally, inspiring listeners to overcome life's challenges. The hip-hop artists, in an exclusive interview, opens up about the process of making the song and its widespread success."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ikkis-dharmendra-agastya-nanda-jaideep-ahlawat-war-drama-gandhi-jayanti-sriram-raghavan-2730154-2025-05-25",
      "headline": "Ikkis: Dharmendra, Agastya Nanda's war-drama to release on Gandhi JayantiDharmendra and Agastya Nanda's upcoming war drama 'Ikkis' is set to release on October 2, 2025. The makers announced the news with a teaser. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/shiva-rajkumar-dedicates-song-for-kamal-haasan-recalls-best-mememories-thug-life-audio-launch-mani-ratnam-2730149-2025-05-25",
      "headline": "Actor Shiva Rajkumar dedicates song to Kamal Haasan, recalls best meeting with himActor Shiva Rajkumar was the chief guest for the 'Thug Life' audio launch in Chennai held on Saturday, May 24. He recalled his memorable meeting with him in Bengaluru. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/silambarasan-full-speech-thug-life-audio-launch-emotional-kamal-haasan-2730078-2025-05-24",
      "headline": "Actor Simbu breaks down thanking parents, addresses controversies at Thug Life eventActor Silambarasan aka Simbu was moved to tears while thanking his parents at 'Thug Life' audio launch. He addressed many controversies and thanked Kamal Haasan for being a guiding light for every cinema aspirant."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/tej-pratap-expelled-lalu-yadav-rjd-bihar-assembly-elections-tejashwi-yadav-2730278-2025-05-25",
      "headline": "Lalu Yadav removes son Tej Pratap from party, family after row over viral postOn Saturday, Tej Pratap Yadav declared his long-standing relationship with Anushka Yadav, saying that they have been in love and in a relationship for the past 12 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-nda-leaders-meeting-chief-ministers-delhi-operation-sindoor-controversy-2730312-2025-05-25",
      "headline": "No loose talk: PM to NDA leaders at Delhi meet after recent controversiesPM Modi, in a Delhi meeting with NDA leaders, urged leaders to avoid unnecessary statements. He also clarified that the Operation Sindoor ceasefire was initiated at Pakistan's request without third-party involvement.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-modernising-nuclear-arsenal-depends-china-economic-military-support-india-adversary-us-intel-report-2730262-2025-05-25",
      "headline": "Pak modernising nuclear arsenal, sees India as existential threat: US reportA recent US intelligence report reveals that Pakistan is actively modernising its nuclear arsenal, reflecting heightened strategic concerns in the region. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/congress-takes-vikas-overflows-dig-as-canopy-collapses-at-delhi-airport-amid-heavy-rain-2730318-2025-05-25",
      "headline": "Video: Delhi airport canopy collapses amid rain, Congress says 'vikas overflowing'The Kerala Congress shared a video of the incident, which showed that the canopy burst due to immense pressure of water amid heavy rain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/alia-bhatt-in-guccis-first-ever-saree-iconic-look-in-cannes-2730107-2025-05-25",
      "headline": "Gucci touches down in tradition and Alia Bhatt is the museAlia's final look on the Cannes carpet was an amalgamation of heritage and haute couture. Styled by Rhea Kapoor, the look is allegedly Gucci's first-ever interpretation of the Indian saree."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/translation-power-helps-world-discover-heart-lamp-banu-mushtaq-deepa-bhasthi-international-booker-prize-winner-geetanjali-shree-2728611-2025-05-25",
      "headline": "How power of translation helps world discover a Heart LampBanu Mushtaq's anthology in Kannada was unknown to Indians, let alone readers across the world. It was translator Deepa Bhasthi who shone the light on it as Heart Lamp. Both Mushtaq and Bhasthi have been awarded the International Booker Prize. Indian writing's global success is being penned in the language of translation, opening new chapters and challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-attacks-harvard-university-again-defends-ban-on-enrollment-of-foreign-students-2730239-2025-05-25",
      "headline": "Harvard has $52,000,000: Trump mounts attack, backs foreign student enrolment banTrump, in a post on Truth Social, claimed almost 31 per cent of students studying at Harvard are from foreign countries and the university administration is not forthcoming with details on these students despite repeated requests from his administration. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-live-score-gujarat-titans-vs-chennai-super-kings-today-match-updates-2730254-2025-05-25",
      "headline": "GT vs CSK Live: Noor gets Tewatia as Chennai set for big winIPL 2025, GT vs CSK Live Updates: Noor Ahmad has picked up another wicket as Chennai are all set to finish off on a high. This will be worrying signs for GT ahead of the playoffs as they appear to be losing steam before the business end of the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aankhen-dharmendra-mala-sinha-sankari-sky-saved-india-2730296-2025-05-25",
      "headline": "Ankhen: The sanskari spy who shunned martinis and saved India'Ankhen' remains a landmark spy thriller of 1968 Bollywood, blending patriotism, action, and strong female roles. The film's unique gadgets and nostalgic style made it a classic Indian cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/amazon-fashions-serve-store-offers-convenience-selection-and-value-to-gen-z-says-nikhil-sinha-director-amazon-fashion-2729633-2025-05-24",
      "headline": "Amazon Fashion's 'SERVE' Store Offers Convenience, Selection and Value to Gen Z, says Nikhil Sinha, Director, Amazon FashionIndia's first dedicated Gen Z fashion store democratizes style access across the country with 3X customer growth\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/russia-ukraine-war-massive-drone-and-missile-attack-drowned-kyiv-drones-putin-zelenskyy-2730245-2025-05-25",
      "headline": "Russia launches war's biggest air attack on Ukraine amid prisoner swap, 13 killedUkraine's air force downed 266 drones and 45 missiles, but damage was widespread, with apartment blocks and infrastructure heavily impacted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/ship-containing-calcium-carbide-sinks-off-kochi-how-bad-is-it-for-marine-world-2730267-2025-05-25",
      "headline": "Ship containing calcium carbide sinks off Kochi: How bad is it for marine world?While all 24 crew members were successfully rescued in a combined operation by the Indian Coast Guard (ICG) and Indian Navy, concerns have intensified over the risk of a large-scale oil and chemical spill. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/jane-fonda-admires-alia-bhatt-gucci-saree-look-in-candid-chat-cannes-film-festival-2730170-2025-05-25",
      "headline": "Cannes candids: Jane Fonda is all admiration for Alia Bhatt's Gucci-saree lookAlia Bhatt represented her culture at Cannes in a Gucci saree. The actor was joined by Hollywood icon Jane Fonda, who admired the Bollywood actor's ensemble. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/miss-england-quits-miss-world-pageant-harassment-kt-rama-rao-demands-probe-2730184-2025-05-25",
      "headline": "Miss England quits Miss World pageant over 'harassment', KTR demands probeTelangana minister KT Rama Rao has strongly condemned the alleged harassment faced by Miss England 2024, Milla Magee, during her visit to the state for the ongoing Miss World 2025 pageant."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-on-virat-kohli-and-rohit-sharma-captaincy-2730276-2025-05-25",
      "headline": "Virat's aggression, Rohit's calm: Shubman Gill reveals Test captaincy mantraShubman Gill has revealed his learnings from Virat Kohli and Rohit Sharma following his appointment as India's new Test captain following the retirement of Rohit Sharma."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-chairs-nda-chief-ministers-meet-caste-census-operation-sindoor-agenda-2730218-2025-05-25",
      "headline": "NDA Chief Ministers back caste census and Op Sindoor, hail counter-Naxal strategyThe meeting saw participation from around 20 Chief Ministers and 18 Deputy Chief Ministers from NDA-ruled states. Two key resolutions were passed during the meeting, one on Operation Sindoor and another on the caste census."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/yunus-selling-off-bangladesh-to-america-sheikh-hasinas-big-charge-amid-protests-2730183-2025-05-25",
      "headline": "'Militant leader' Yunus selling off Bangladesh to US: Sheikh Hasina's big chargeSheikh Hasina alleged that Yunus is running the government with the help of militants and slammed him for imposing a ban on her party, the Awami League."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/trending/weekly-quiz-486-23-05-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/kush-maini-monaco-grand-prix-f2-anand-mahindra-2730135-2025-05-25",
      "headline": "Kush Maini becomes first Indian to win F2 Monaco GPKush Maini became the first Indian to win the Formula 2 Sprint Race at the Monaco Grand Prix. After he won, business tycoon Anand Mahindra praised him for the stupendous achievement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/india-pakistan-war-the-new-red-lines-after-operation-sindoor-2730258-2025-05-25",
      "headline": "India-Pakistan war: The new red lines after Operation SindoorIndia draws a tough new normal for dealing with Pakistan over sponsoring terror, including resuming deadly retribution if Islamabad does not make amends\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-india-new-test-captain-feature-2730132-2025-05-25",
      "headline": "Shubman Gill, India's first accidental Test captain of the 21st century Shubman Gill's appointment as captain reflects a leadership vacuum in Indian cricket, driven more by circumstance than readiness. His inconsistent form and unproven credentials raise concerns about the team's direction during this transitional phase."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/delhi-ncr-what-fuelled-the-thunderous-storm-2730167-2025-05-25",
      "headline": "What fuelled the thunderous storm that battered Delhi?A powerful thunderstorm hit Delhi on Sunday, bringing heavy rain, strong winds, and widespread disruption, including flight delays and road flooding. The India Meteorological Department had issued a red alert the night before, warning of severe weather and advising residents to stay indoors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/how-punjab-kings-cracked-the-code-in-ipl-2025-shreyas-iyer-ricky-ponting-2730166-2025-05-25",
      "headline": "Iyer's heart, Ponting's vision: How Punjab Kings cracked the code in IPL 2025Punjab Kings were once a team lost in chaos and doubt. This season, they've found their groove. With a fresh strategy, strong leadership from Shreyas Iyer and Ricky Ponting, and a squad built on trust and flexibility, PBKS have transformed from perennial underachievers into genuine contenders in IPL 2025.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/battleground-tamil-nadu-why-stalins-dmk-appears-to-hold-the-pole-position-2730280-2025-05-25",
      "headline": "Battleground Tamil Nadu: Why Stalin's DMK appears to hold the pole positionA calculated mix of welfare, symbolism and federal resistance has taken the Tamil Nadu CM's imprint beyond the horizons of local administration and realpolitik\r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-india-test-captain-harbhajan-singh-england-tour-2730347-2025-05-25",
      "headline": "Shubman Gill will have to lead from front on tough England tour: Harbhajan SinghFormer India spinner Harbhajan Singh welcomed the appointment of Shubman Gill as captain, praising the move as a step toward building a future-ready team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-live-score-sunrisers-hyderabad-vs-kolkata-knightriders-today-match-updates-2730346-2025-05-25",
      "headline": "SRH vs KKR Live Score: Last season's finalists aim to finish on a highIPL 2025, SRH vs KKR Live Score: With nothing but pride to play for, the 2024 finalists, Sunrisers Hyderabad and Kolkata Knight Riders, will aim to finish their season on a high in Delhi. Kolkata have a five-match winning streak going over Hyderabad and will aim to extend it, while the Sunrisers will want a win to continue their momentum. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ms-dhonis-runs-have-come-in-losing-cause-hes-also-dropped-4-catches-aakash-chopra-2730337-2025-05-25",
      "headline": "Dhoni's runs have come in losing cause, he's dropped 4 catches: Aakash ChopraFormer India cricketer turned commentator Aakash Chopra has highlighted MS Dhoni's poor performances in the Indian Premier League 2025 (IPL 2025). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-first-round-aryna-sabalenka-elina-svitolina-results-roland-garros-2730336-2025-05-25",
      "headline": "French Open: Sabalenka, Svitolina cruise into 2nd round with easy winsAryna Sabalenka laid down the marker as she crushed Kamilla Rakhimova with a straight-sets win on Sunday, May 25. Elina Svitolina breezed past Zeynep Sonmez to make it to the second round. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-test-captain-england-seires-challenge-opportunity-cheteshwar-pujara-2730331-2025-05-25",
      "headline": "Shubman Gill faces a big challenge and opportunity in England series: PujaraWith India heading into a new Test era, Cheteshwar Pujara sees Shubman Gill's England challenge as both a test and a chance for early impact. The young skipper will look to lead a youthful side back to winning ways."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cheteshwar-pujara-on-sarfaraz-khans-snub-from-england-tour-squad-2730327-2025-05-25",
      "headline": "Cheteshwar Pujara reveals reason behind Sarfaraz Khan's absence from Test squadCheteshwar Pujara shared his views on Sarfaraz Khan's snub from the Indian Test team for the upcoming England tour. The 27-year-old didn't get a chance during the Australia tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dewald-brevis-fastest-fifty-csk-230-6-gujarat-titans-2730324-2025-05-25",
      "headline": "Dewald Brevis scores CSK's joint-second-fastest fifty vs Gujarat TitansDewald Brevis produced a blistering knock in Ahmedabad, scoring 57 off just 23 balls to register Chennai Super Kings' joint-second-fastest half-century in IPL history. Brevis's innings helped CSK post a formidable total of 230 for 6 against Gujarat Titans - their highest score of the season so far."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-pbks-faf-du-plessis-preity-zinta-viral-picture-2730307-2025-05-25",
      "headline": "Make it happen: Du Plessis' response to fan's suggestion on pic with ZintaDC's Faf du Plessis had a hilarious response to a fan who said he should be cast in a movie alongside Preity Zinta after the picture of the two went viral. DC beat PBKS in the match in Jaipur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-kl-rahul-batting-comeback-favourite-test-format-2730301-2025-05-25",
      "headline": "KL Rahul aims for India's batting comeback in his favourite Tests vs EnglandKL Rahul and India's young Test side aim to bounce back in England, embracing the challenge ahead. With Shubman Gill as captain, the team seeks to overcome recent setbacks and begin a new era of success in Test cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ayush-mhatre-rohit-sharma-arshad-khan-gt-vs-csk-2730293-2025-05-25",
      "headline": "Mini Rohit Sharma: Mhatre wows fans with 28-run over off Arshad KhanIPL 2025: Ayush Mhatre was severe on fast bowler Arshad Khan, scoring 28 runs off him in an over during CSK's match against GT on Sunday at the Narendra Modi Stadium in Ahmedabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-xabi-alonso-new-coach-carlo-ancelotti-florentino-perez-2730290-2025-05-25",
      "headline": "Real Madrid announce Xabi Alonso as new head coach after Ancelotti departureReal Madrid have confirmed the appointment of Xabi Alonso as the new head coach of the team after the departure of Carlo Ancelotti. Alonso returns to the club, having started his coaching career with the club. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dewald-brevis-fastest-fifty-csk-230-6-gujarat-titans-2730324-2025-05-25",
      "headline": "Dewald Brevis scores CSK's joint-second-fastest fifty vs Gujarat TitansDewald Brevis produced a blistering knock in Ahmedabad, scoring 57 off just 23 balls to register Chennai Super Kings' joint-second-fastest half-century in IPL history. Brevis's innings helped CSK post a formidable total of 230 for 6 against Gujarat Titans - their highest score of the season so far."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-pbks-faf-du-plessis-preity-zinta-viral-picture-2730307-2025-05-25",
      "headline": "Make it happen: Du Plessis' response to fan's suggestion on pic with ZintaDC's Faf du Plessis had a hilarious response to a fan who said he should be cast in a movie alongside Preity Zinta after the picture of the two went viral. DC beat PBKS in the match in Jaipur. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-kl-rahul-batting-comeback-favourite-test-format-2730301-2025-05-25",
      "headline": "KL Rahul aims for India's batting comeback in his favourite Tests vs EnglandKL Rahul and India's young Test side aim to bounce back in England, embracing the challenge ahead. With Shubman Gill as captain, the team seeks to overcome recent setbacks and begin a new era of success in Test cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ayush-mhatre-rohit-sharma-arshad-khan-gt-vs-csk-2730293-2025-05-25",
      "headline": "Mini Rohit Sharma: Mhatre wows fans with 28-run over off Arshad KhanIPL 2025: Ayush Mhatre was severe on fast bowler Arshad Khan, scoring 28 runs off him in an over during CSK's match against GT on Sunday at the Narendra Modi Stadium in Ahmedabad. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/real-madrid-xabi-alonso-new-coach-carlo-ancelotti-florentino-perez-2730290-2025-05-25",
      "headline": "Real Madrid announce Xabi Alonso as new head coach after Ancelotti departureReal Madrid have confirmed the appointment of Xabi Alonso as the new head coach of the team after the departure of Carlo Ancelotti. Alonso returns to the club, having started his coaching career with the club. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}