{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pothole-accident-monsoon-bad-roads-loss-of-life-legal-remedy-lawyers-cases-government-compensation-2787044-2025-09-14",
      "headline": "Potholes cost lives and money: How citizens can file for compensation in IndiaBeyond the headlines of tragedy lies a fundamental question that haunts every Indian who has suffered at the hands of negligent road maintenance: Can we actually hold the government accountable for these losses? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/scrapping-97-lakh-unfit-vehicles-can-fetch-rs-40000-crore-gst-says-nitin-gadkari-2786997-2025-09-14",
      "headline": "Scrapping 97 lakh unfit vehicles can fetch Rs 40,000 crore GST, says Nitin GadkariSpeaking at a recent event, Union Minister Nitin Gadkari said large-scale scrappage of unfit and polluting vehicles could create jobs, boost demand and cut costs, while giving the Centre and states a major GST windfall."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/retire-before-50-here-is-how-to-turn-that-dream-into-reality-early-retirement-tips-2786723-2025-09-13",
      "headline": "Retire before 50? Here's how to turn that dream into realityWant to hang up your boots before 50? It's not just for billionaires. With deliberate choices, a strong savings habit, and careful planning, financial freedom can come decades earlier than most people imagine."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/income-tax-return-filing-mandatory-income-above-rs-3-lakh-fy-2024-25-september-15-2786707-2025-09-13",
      "headline": "Only two days left: Why you should file ITR even if you earn under Rs 12 lakhWith two days left for FY 2024-25 ITR filing, experts stress the importance of filing for those earning under Rs 12 lakh. Neglecting this can lead to notices and penalties from the Income Tax Department."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/fmcg-firms-say-cant-lower-mrps-on-rs-5-20-packs-despite-gst-cut-2786698-2025-09-13",
      "headline": "FMCG firms say can't lower MRPs on Rs 5, 10, 20 packs despite GST cut: ReportInstead, companies said they will keep the same price but increase the quantity inside the pack. For example, a Rs 20 biscuit pack could now contain more grams of biscuits for the same price."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sebi-reclassifies-reits-as-equity-to-boost-mutual-fund-investments-2786680-2025-09-13",
      "headline": "Sebi reclassifies REITs as equity: What it means for MFs and investorsAs part of amendments to the Sebi (Mutual Funds) Regulations, 1996, REITs will now be reclassified as \"equity\" instruments, while InvITs will continue to be treated as \"hybrid\" products. Read to know what it means for investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-eases-ipo-norms-for-large-companies-what-it-means-for-investors-2786664-2025-09-13",
      "headline": "Sebi eases IPO norms for large firms: What it means for investorsUnder the revised norms, companies with post-issue market capital above Rs 1 lakh crore can gradually increase public shareholding to 25%. If public shareholding is below 15% at listing, it must rise to 15% within five years and to 25% within ten years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/save-up-to-rs-2-lakh-a-year-real-estate-tax-hacks-every-investor-should-know-2786345-2025-09-12",
      "headline": "Save up to Rs 2 lakh a year: Real estate tax hacks every investor should knowFor many Indians, property isn't just a place to live, it's a smart investment. But what often gets overlooked are the tax breaks that can make real estate even more rewarding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/retail-inflation-rises-marginally-to-207-in-august-from-155-in-july-2786334-2025-09-12",
      "headline": "Retail inflation rises marginally to 2.07% in August from 1.55% in JulyDespite edging up in August, inflation remains very low compared to recent years and well within the RBI's target range of 2–6%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/markets-rally-for-8th-straight-session-all-eyes-on-crucial-sebi-board-meet-2786322-2025-09-12",
      "headline": "Sebi board meeting decisions in focus as markets rally for eighth straight sessionBut the bigger story now is what comes next from Sebi. The regulator's crucial board meeting is expected to decide on sweeping changes to futures and options trading."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-356-points-higher-nifty-above-25100-bel-gains-4-percent-2786308-2025-09-12",
      "headline": "Sensex closes 356 points higher, Nifty above 25,100; BEL gains 4%The S&P BSE Sensex added 356 points to close at 81,904.70, while the NSE Nifty50 gained 108.50 points to end at 25,114.00. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/saving-money-genz-vs-millennials-spending-habit-money-tips-reports-research-2786294-2025-09-12",
      "headline": "Gen-Z vs millennial: Who is better at saving money?GenZ are painted as loud, brash spenders who splurge on gadgets, sneakers, and experiences over savings. But is that really true when it comes to accumulating savings? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sebi-meeting-expectations-today-ipo-investment-fpis-reforms-min-amount-stock-market-dalal-street-2786234-2025-09-12",
      "headline": "Sebi meeting today: What can stock market investors expect from meeting?The Securities and Exchange Board of India (Sebi) is expected to approve a set of reforms that aim to make the market more attractive for businesses and investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/giorgio-armanis-will-outlines-gradual-sale-or-ipo-of-fashion-empire-2786214-2025-09-12",
      "headline": "Giorgio Armani's will outlines gradual sale or IPO of fashion empireThe late Giorgio Armani has left behind more than just a fashion empire. His will reveals a carefully crafted plan for the future of his company. Here's what it says."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-hits-record-highs-3-key-reasons-behind-the-rally-2786181-2025-09-12",
      "headline": "Gold hits record highs. 3 key reasons behind the rallyThe shine of gold is brighter than ever. Prices have soared to record levels, with global and domestic markets witnessing a strong rally. So, what's driving this rise? Three major factors are at play."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-seniors-can-unlock-rs-15-lakh-a-month-from-their-home-explains-expert-2786140-2025-09-12",
      "headline": "How seniors can unlock Rs 1.5 lakh a month from their home, explains expertRising medical bills and everyday expenses often strain retirees who have no pension. But for those who own a house, there's a way out. An expert says reverse mortgage can turn property into a monthly pension of Rs 1.5 lakh."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-income-reporting-to-form-selection-7-key-checks-every-taxpayer-should-make-before-filing-itr-2786109-2025-09-12",
      "headline": "From income reporting to form selection: 7 must-do ITR stepsThis article outlines the key things taxpayers in India need to remember while filing their income tax return for the current assessment year, with a focus on accuracy, compliance, and timely processing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/infosys-shares-rally-2-percent-after-record-rs-18000-crore-buyback-will-investors-benefit-2786106-2025-09-12",
      "headline": "Infosys shares up 2% on record buyback plan. Will existing shareholders benefit?Infosys shares climbed over 2% after the IT firm announced a Rs 18,000 crore buyback, the largest in its history. The offer, priced at a 19% premium, could benefit existing shareholders, though experts caution on execution challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/stock-market-update-which-sectors-to-invest-auto-hotels-hospitals-fmcg-it-2786079-2025-09-12",
      "headline": "Dalal Street momentum: Top sectors to invest in todayExperts believe that from Q3 onwards, earnings should improve due to GST rationalisation and income tax cuts, which will start paying off."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/vacation-loans-india-gen-z-tier-2-cities-travel-debt-2786055-2025-09-12",
      "headline": "Thinking of borrowing for your next foreign trip? Here's why you shouldn'tA surge in Indians borrowing for foreign trips raises financial concerns. CoinSwitch's founder offers insights into prudent financial practices to prevent potential debt accumulation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-rises-200-points-nifty-above-25000-infosys-jumps-2-2786047-2025-09-12",
      "headline": "Markets open higher on Fed rate cut optimism; Infosys leads gainsThe S&P BSE Sensex was up 211.13 points to 81,759.86 at 9:16 am, while the NSE Nifty50 rose 66.665 points to trade at 25,072.15."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/mutual-fund-xirr-investment-metric-true-portfolio-returns-timing-impact-2786038-2025-09-12",
      "headline": "Explained: Why SIP investors on trading apps must check XIRR, not just returnsIn SIPs, investments enter the market at different times. Some stay for years, others only months. Absolute returns treat them alike, distorting the picture. XIRR offers a more accurate measure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/urban-company-ipo-closes-high-demand-investor-caution-gmp-listing-date-2786036-2025-09-12",
      "headline": "Urban Company IPO closes today. Is it a risky bet as GMP soars on last day?Urban Company's initial public offering ends its bidding phase today after strong investor interest and rising grey market premiums."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-touches-new-lifetime-high-of-rs-113-lakh-per-10-grams-in-delhi-2785898-2025-09-11",
      "headline": "Gold touches new lifetime high of Rs 1.13 lakh per 10 grams in DelhiGold prices surged to a new lifetime high of Rs 1,13,100 per 10 grams in Delhi on Thursday. The yellow metal has gained over 43% this year. Experts attribute the surge to central bank buying, exchange-traded funds inflows, and geopolitical tensions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zupee-lays-off-30-percent-of-staff-as-it-adapts-to-india-online-gaming-act-2785826-2025-09-11",
      "headline": "Zupee lays off 30% of staff as it adapts to India's Online Gaming ActZupee has rolled out a comprehensive relief package for employees affected by the layoffs. The support plan includes financial assistance beyond the standard notice period, with extra compensation based on years of service."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/will-diwali-light-up-dalal-street-for-investors-2785768-2025-09-11",
      "headline": "Will Diwali light up Dalal Street for investors?While the festival is often seen as a time for good fortune, experts say the stock market doesn't necessarily follow festive trends."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rupee-slides-to-all-time-low-as-us-tariffs-bite-2785745-2025-09-11",
      "headline": "Rupee slides to all-time low as US tariffs biteThe Indian rupee hit a record low of 88.44 against the US dollar on Thursday, pressured by US tariffs and heavy foreign investor outflows."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-nifty50-longest-winning-streak-us-india-trade-optimism-oil-gas-gains-2785730-2025-09-11",
      "headline": "Sensex, Nifty extend gains amid optimism over US-India trade dealThe NSE Nifty50 rose by 32.40 points to close at 25,005.5, while the BSE Sensex increased by 123.58 points, settling at 81,548.73."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/ups-to-nps-switch-now-allowed-but-rules-apply-unified-pension-scheme-national-pension-scheme-2785701-2025-09-11",
      "headline": "UPS to NPS switch now allowed, but rules applyCentral government employees who opted for the UPS can now switch back to the NPS, the government has announced. However, this flexibility comes with specific rules and conditions that employees must follow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/phone-buying-loan-rbi-new-lone-mobile-lock-small-lenders-bajaj-finance-emi-2785683-2025-09-11",
      "headline": "Buying a phone on loan? Non-payment may lock your deviceCurrently, over one-third of consumer electronics, including mobile phones, are purchased on small-ticket loans in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/should-you-pay-income-tax-with-credit-card-all-you-need-to-know-2785649-2025-09-11",
      "headline": "Should you pay income tax with credit card? All you need to knowAs the tax filing deadline approaches, many taxpayers scramble to pay their dues. While net banking and UPI are common, using a credit card is also an option, but it comes with costs and benefits you should know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/why-even-small-income-slips-can-trigger-big-tax-notices-explains-tax-advisor-2785585-2025-09-11",
      "headline": "Why even small income slips can trigger big tax notices, explains tax advisorThink a small slip in your tax return won't matter? Think again. Even missing Rs 5,000 bank interest has invited income tax notices. A tax advisor breaks down why AIS mismatches are a growing headache."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/pf-in-limbo-why-so-many-employees-struggle-to-access-their-savings-2785558-2025-09-11",
      "headline": "PF crisis: What makes withdrawing your own money so difficultFor decades, the Provident Fund has been seen as a loyal companion, quietly growing with every paycheque, waiting to support employees in tough times or after retirement. But when the time comes to withdraw it, many workers discover that accessing their savings is anything but simple."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/looking-to-invest-in-it-stocks-here-are-the-top-picks-2785577-2025-09-11",
      "headline": "Looking to invest in IT stocks? Here are the top picksDespite recent concerns around tariffs announced by US President Donald Trump in April, experts remain positive on the IT sector's future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/insurance-rejection-star-health-medical-emergency-claim-denied-series-2785009-2025-09-11",
      "headline": "Denied in crisis: Inside a family's year-long battle to claim health insuranceFor Vipin Vishnu Ajayan and his family, the year-long fight for his father's treatment was more than paperwork. It meant sleepless nights, borrowed money, and unanswered calls. What should have been a safety net in a medical crisis turned into a draining battle that tested their strength, faith and dignity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musk-usd-1-trillion-pay-tesla-targets-to-achieve-top-ceo-salary-world-economy-gdp-2785528-2025-09-11",
      "headline": "Elon Musk's $1 trillion salary vs the worldElon Musk's proposed $1 trillion compensation package from Tesla is drawing attention not only for its sheer size but also for the ambitious targets the world's richest person needs to fulfil. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musk-net-worth-world-richest-larry-elisson-oracle-open-ai-partnership-2785501-2025-09-11",
      "headline": "World's richest race: Elon Musk reclaims No.1 spot from Larry EllisonElon Musk has largely remained at the top of the global wealth chart since first claiming the position in 2021. Though he was overtaken briefly by LVMH's Bernard Arnault in 2021 and by Amazon founder Jeff Bezos in 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-narendra-modi-india-us-trade-tariff-trouble-avoid-masala-deal-2785495-2025-09-11",
      "headline": "Donald Trump's hot-and-cold tariff game: Why India must avoid a 'MASALA' dealDonald Trump is giving India mixed signals on trade and tariffs, hot one moment and cold the next. The risk? Falling for MASALA deals. Read to know what they are, and why India must resist."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-opens-flat-nifty-above-24950-eternal-adani-ports-among-top-gainers-2785464-2025-09-11",
      "headline": "Sensex, Nifty gain after flat opening amid US rate cut optimismThe S&P BSE Sensex gained over 100 points after a flat start, while the NSE Nifty50 briefly crossed the 25,000 mark."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/urban-company-dev-accelerator-shringar-house-of-mangalsutra-ipo-subscription-profit-gmp-today-2785445-2025-09-11",
      "headline": "3 IPOs in focus: Urban Company leads, but where's the bigger listing gain?Urban Company's was fully subscribed within a few hours, indicating high demand. Alongside Urban Company, two other IPOs, Dev Accelerator and Shringar House of Mangalsutra, are also open for bidding this week."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-meets-ladakh-governor-kavinder-gupta-battle-of-galwan-shoot-2787145-2025-09-14",
      "headline": "Salman Khan meets Ladakh governor Kavinder Gupta amid Battle of Galwan shootSalman Khan is currently shooting for his upcoming film 'Battle of Galwan'. Amid the schedule, the superstar met Ladakh governor Kavinder Gupta. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/mohanlal-condemns-homophobic-remarks-on-bigg-boss-malayalam-7-new-promo-video-2787082-2025-09-14",
      "headline": "Mohanlal condemns homophobic remarks on Bigg Boss Malayalam 7Actor Mohanlal, on this weekend's 'Bigg Boss Malayalam 7', called out a contestant for his homophobic remarks and told her to leave the house if she cannot stand same-sex relationships on the show.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-farah-khan-grills-contestants-baseer-ali-akshay-kumar-arshad-warsi-jolly-llb-3-2787116-2025-09-14",
      "headline": "Bigg Boss 19: Farah Khan grills contestants, Akshay and Arshad join inIn the latest episode of 'Bigg Boss 19', Farah Khan grilled contestants with Akshay Kumar and Arshad Warsi joining for a drama-filled, emotional and entertaining Weekend Ka Vaar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kartik-aaryan-ananya-panday-light-up-new-year-eve-tu-meri-main-tera-main-tera-tu-meri-preponed-release-2787088-2025-09-14",
      "headline": "Kartik, Ananya to light up New Year's Eve with Tu Meri Main Tera... early releaseThe New Year celebrations will double this year with Kartik Aaryan and Ananya Panday's 'Tu Meri Main Tera Main Tera Tu Meri' releasing in theatres on the special occasion. The film was earlier scheduled to release on February 13, 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/sonarika-bhadoria-husband-vikas-parashar-announce-pegnancy-first-child-2787063-2025-09-14",
      "headline": "Devon Ke Dev... actor Sonarika Bhadoria, husband Vikas Parashar announce pregnancyTelevision actor Sonarika Bhadoria is expecting her first child with husband Vikas Parashar. The couple announced the news in a special social media post. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mirai-box-office-teja-sajja-film-sees-growth-inches-close-to-rs-30-crore-2787050-2025-09-14",
      "headline": "Mirai box office Day 2: Teja Sajja film sees growth, inches close to Rs 30 croreActor Teja Sajja's film 'Mirai' roared at the box office. After witnessing a phenomenal opening, the film refused to slow down in theatres. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-praises-15-old-singer-jonas-conner-urges-not-to-exploit-similar-indian-talent-2787042-2025-09-14",
      "headline": "Salman Khan praises 15-year-old singer, urges not to exploit similar Indian talentSalman Khan is in awe of 15-year-old singer Jonas Conner. In a heartfelt social media post, the superstar praised the youngster and requested people to encourage and not exploit similar talents in India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-mk-stalin-honour-ilaiyaraaja-in-grand-ceremony-call-for-bharat-ratna-2787019-2025-09-14",
      "headline": "Rajinikanth, Stalin honour Ilaiyaraaja in grand ceremony, call for Bharat RatnaRajinikanth, Tamil Nadu chief minister MK Stalin, and Kamal Haasan, among others, honoured Ilaiyaraaja at a grand event in Chennai. They urged the government to honour the maestro with Bharat Ratna."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/fawad-khan-vaani-kapoor-abir-gulaal-to-release-in-india-government-fact-checks-reports-2787008-2025-09-14",
      "headline": "Fawad Khan's Abir Gulaal to release in India? Government fact checks reportsAmid several reports confirming Fawad Khan and Vaani Kapoor's 'Abir Gulaal' India release, the government fact-checked the reports and called it fake. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranveer-singh-deepika-padukone-enjoy-romantic-drive-in-hummer-viral-pics-2786988-2025-09-14",
      "headline": "Ranveer Singh-Deepika Padukone enjoy romantic drive in new Hummer, pics go viralRanveer Singh and Deepika Padukone were recently seen taking a drive in their luxury electric car. A video from their outing has gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-tamil-season-9-vijay-sethupathi-host-october-5-premiere-2786894-2025-09-13",
      "headline": "Bigg Boss Tamil 9 to premiere soon, Vijay Sethupathi's show gets launch date'Bigg Boss Tamil' Season 9 will begin in October, with Vijay Sethupathi resuming hosting duties. The official channel has released a new poster announcing the premiere date."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/zayed-khan-backs-india-unbeatable-ahead-asia-cup-2025-match-pakistan-2786871-2025-09-13",
      "headline": "Zayed Khan backs India as unbeatable ahead of Asia Cup 2025 clash with PakistanActor Zayed Khan voiced his support for India ahead of the Asia Cup 2025, calling the team unbeatable and highlighting the value of India-Pakistan clashes in fostering sportsmanship."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/ankita-lokhande-husband-vicky-jain-injured-accident-gets-45-stitches-2786847-2025-09-13",
      "headline": "Ankita Lokhande's husband Vicky Jain injured in accident, gets 45 stitchesActor Ankita Lokhande's husband Vicky Jain was hospitalised after a glass injury left him with 45 stitches. Ankita stayed by his side as he recovered in Mumbai.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karishma-sharma-recounts-train-mishap-after-discharge-2786830-2025-09-13",
      "headline": "Actor Karishma Sharma recounts train mishap after dischargeActor Karishma Sharma recalled her traumatic Mumbai train accident, shared a health update, and urged commuters to stay calm and avoid panic.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/homebound-film-release-26-september-2025-neeraj-ghaywan-ishaan-khatter-janhvi-kapoor-vishal-jethwa-karan-johar-2786776-2025-09-13",
      "headline": "Homebound: Janhvi Kapoor, Ishaan Khatter and Vishal's film gets global release dateAfter winning appreciation and standing ovations at various International film festivals, Karan Johar's 'Homebound' is set for a theatrical release. The movie stars Janhvi Kapoor, Vishal Jethwa, and Ishaan Khatter in key roles. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/disha-patani-father-defends-jagdish-patani-firing-bareilly-home-khushboo-remarks-premanand-maharaj-2786784-2025-09-13",
      "headline": "After firing at home, Disha Patani's father defends Khushboo's remarks on saintDisha Patani's father, Jagdish Patani, recently spoke about the firing incident at his Bareilly home. He even defended his daughter, Khusboo's remarks, which were connected to spiritual leader Premanand Ji Maharaj."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/requiem-for-hate-economy-box-office-bombing-of-the-bengal-files-tells-us-vivek-agnihotri-udaipur-files-2786741-2025-09-13",
      "headline": "Requiem for hate economy? What the box office bombing of Bengal Files tells usPropaganda-driven \"files\" franchise has hit a wall. With Bengal and Udaipur both flopping spectacularly, India's audience seems done subsidising the hate economy wrapped as cinematic history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-supports-anurag-kashyap-nishaanchi-before-release-poster-vedika-pinto-sonakshi-sinha-2786720-2025-09-13",
      "headline": "Salman Khan supports Anurag Kashyap's Nishaanchi before release, praises posterSalman Khan recently extended his luck to Anurag Kashyap's upcoming film 'Nishaanchi'. He shared a video along with a heartfelt note for the entire team. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-episode-20-farah-khan-schools-kunickaa-sadanand-baseer-ali-weekend-ka-vaar-salman-khan-2786701-2025-09-13",
      "headline": "Bigg Boss 19 episode 20: Farah Khan schools Kunickaa, Baseer in fiery exchangeFilmmaker-producer Farah Khan took Kunickaa Sadanand to task for taking puris off Zeeshan Quadri's plate, and also pulled up Baseer Ali for questioning the calibre of the housemates."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-pak-preview-dubai-pitch-predicted-xis-2786977-2025-09-14",
      "headline": "Lopsided battle, heightened tensions: India, Pakistan set to reignite rivalrySuper Sunday brings more than a cricket match: it's India vs Pakistan, a clash steeped in history, rivalry, and the pressure of politics and form. Here's your complete match preview: conditions, analysis, and predicted line-ups."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/india-prime-minister-narendra-modi-spared-china-xi-jinping-the-new-villain-in-donald-trumps-latest-tariff-post-2786985-2025-09-14",
      "headline": "India spared, China the new villain in Trump's latest tariff postAfter months of berating India as Moscow's enabler, Donald Trump has found a bigger villain in Beijing. In shifting his fury eastward, he spares New Delhi – but only to keep it from slipping deeper into Russia's embrace."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/uk-news/story/anti-immigration-protest-london-150000-rally-tommy-robinson-elon-musk-keir-starmer-2787020-2025-09-14",
      "headline": "Give our country back: How anti-immigration tsunami swept LondonOver 150,000 people joined far-right activist Tommy Robinson's anti-immigration rally in central London, promoting nationalist slogans, \"great replacement\" rhetoric, and opposition to migration. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/noida/story/greater-noida-tragedy-mother-son-jump-13th-floor-ace-city-suicide-note-2787074-2025-09-14",
      "headline": "Don't want to trouble you: Woman, special needs son jump off 13th floor in NoidaA 37-year-old woman, Sakshi Chawla, and her specially-abled 11-year-old son died by suicide after jumping from the 13th floor of a building in Greater Noida."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/youth-lead-movements-jp-movement-to-nepal-gen-z-bangladesh-protests-rebel-instagram-reels-tiktok-videos-2786897-2025-09-14",
      "headline": "Why there's rebellion in Gen Z DNAThat Gen Z protesters toppled the Oli government in Nepal shouldn't be surprising. From Bhagat Singh to Che Guevara, the face of rebellions has almost always been the young. But why do the young rebel, and what is it that drives them to the streets?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ed-summons-actress-urvashi-rautela-ex-mp-mimi-chakraborty-in-1xbet-betting-app-case-2787142-2025-09-14",
      "headline": "ED summons actress Urvashi Rautela, ex-MP Mimi Chakraborty in betting app caseBollywood actress Urvashi Rautela and Mimi Chakraborty were summoned by the ED in connection with the 1xBet betting case. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nitin-gadkari-denies-corruption-claims-ethanol-policy-honest-earnings-200-crore-brain-transport-minister-nagpur-2787095-2025-09-14",
      "headline": "My brain worth Rs 200 crore, I earn honestly: Nitin Gadkari amid E20 petrol rowUnion Minister Nitin Gadkari, seemingly brushing aside allegations of personal gain from the government's ethanol initiative, asserted that he earns honestly and claimed his intellect is worth Rs 200 crore a month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-vs-pakistan-live-score-updates-shubman-gill-shaheen-afridi-dubai-2787137-2025-09-14",
      "headline": "IND vs PAK Live: All set for controversial clash in DubaiIndia vs Pakistan, Asia Cup Live updates: Dubai is all set for the big rivalry clash between India and Pakistan, as the two sides gear up for their second clash in the Asia Cup and the excitement is up to the brim."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/video-uddhav-sena-leader-anand-dubey-smashes-tv-to-protest-india-pakistan-asia-cup-match-2787109-2025-09-14",
      "headline": "Video: Uddhav Sena leader smashes TV to protest India-Pak Asia Cup matchShiv Sena (UBT) staged statewide \"sindoor protests\" against the India-Pakistan Asia Cup match on Saturday, calling it an insult to soldiers' sacrifices. In Mumbai, party leader Anand Dubey smashed a TV set in protest as workers chanted anti-Pakistan slogans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modis-big-attack-in-assam-says-congress-stood-with-pakistan-army-during-operation-sindoor-2787098-2025-09-14",
      "headline": "Congress hand in glove with Pak terrorists, backs infiltrators: PM's big attackPrime Minister Narendra Modi, addressing the public meeting, hailed the BJP government's work in Assam, saying that they have begun to \"correct those wrongs and remove illegal claims\", as he accused the Congress party of encroaching on farmers' land and places of worship during their rule in the state."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/exclusive-nepal-genz-leaders-call-for-corruption-free-future-seek-closer-ties-with-india-2787056-2025-09-14",
      "headline": "Nepal Gen Z leaders call for corruption-free future, seek closer ties with IndiaIn an exclusive interview with India Today TV, Nepal Gen Z core committee members Tanaka Dhami and Arjun Shahi said the movement was aimed at pushing for a corruption-free political system and better opportunities for young Nepalese. Read what they have to say about the deadly protests and the future of the nation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-athletics-championships-day-2-indian-athletes-kushare-high-jump-gulveer-singh-10k-final-2787035-2025-09-14",
      "headline": "World Championship: Men's 100m takes centre stage, India's Gulveer in actionThe World Athletics Championships is set for its showpiece event – the men's 100m final. The top names of the current generation are participating, and it is expected to be a riveting encounter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-pakistan-cricket-rivalry-boosts-pakistan-tissue-industry-economy-2786984-2025-09-14",
      "headline": "Cancel it? No. Pakistan needs cricket beatings from IndiaIndia vs Pakistan isn't just cricket—it's humiliation as public service, therapy via sixes, and a spectacle where one side brings tears, the other brings tissues."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/uk-news/story/london-anti-immigration-rally-elon-musk-warns-britain-destruction-immigration-violence-political-change-2786978-2025-09-14",
      "headline": "Violence is coming: Elon Musk's fightback call at London anti-immigration rallyElon Musk, addressing a far-right anti-immigration rally in London, warned that \"violence is coming\" if uncontrolled migration continues, and called for a regime change in the UK."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/interviews/story/zorawar-kalra-interview-anything-but-father-jiggs-kalra-parenting-food-family-2787009-2025-09-14",
      "headline": "Like father, unlike father: Zorawar Kalra on family, food, and fatherhood his wayWe convince restaurateur Zorawar Kalra to take a rare pause from work to talk about marriage, growing up under his legendary father Jiggs Kalra, parenting, food at home, and fitness... basically, Anything But work."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/boss-shocked-as-fit-employee-dies-of-heart-attack-10-minutes-after-texting-for-sick-leave-2787089-2025-09-14",
      "headline": "Man, 40, dies 10 minutes after texting for sick leave. Boss shares heartbreaking postA healthy 40-year-old man died of cardiac arrest just 10 minutes after sending a sick-leave text to his boss, who later shared a heartbreaking post recalling the incident. Read on:"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/kartik-aaryan-ananya-panday-light-up-new-year-eve-tu-meri-main-tera-main-tera-tu-meri-preponed-release-2787088-2025-09-14",
      "headline": "Kartik, Ananya to light up New Year's Eve with Tu Meri Main Tera... early releaseThe New Year celebrations will double this year with Kartik Aaryan and Ananya Panday's 'Tu Meri Main Tera Main Tera Tu Meri' releasing in theatres on the special occasion. The film was earlier scheduled to release on February 13, 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-522-12-09-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rg-kar-student-dies-after-sudden-illness-boyfriend-arrested-in-malda-2787143-2025-09-14",
      "headline": "RG Kar student dies after sudden illness, mother accuses boyfriend of poisoning herThe medical student had travelled to meet Malda to meet her boyfriend. She fell ill and died soon after. Her mother accused her boyfriend of poisoning her."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/why-you-can-easily-buy-a-gun-in-the-us-and-why-you-cant-in-india-2787016-2025-09-14",
      "headline": "Why you can easily buy a gun in the US and why you can't in IndiaBoth owe their origin to the British colonisers, but in different ways. While America enshrined the right to bear arms in its Constitution, India inherited strict gun control from colonial-era laws."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-shubman-gill-virat-kohli-ind-vs-pak-dubai-2787018-2025-09-14",
      "headline": "Asia Cup: With King Kohli absent, Prince Gill must rise to the occasion vs PakistanWith Virat Kohli absent from the Asia Cup 2025, Shubman Gill faces his first T20I test against Pakistan. As vice-captain, his form and temperament could shape India's chances in the high-voltage Dubai showdown."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/asaduddin-owaisi-on-india-pak-match-money-more-important-than-lives-of-26-people-2787017-2025-09-14",
      "headline": "India-Pak match ad revenue price of 26 lives? Asaduddin Owaisi taunts BJPThe India-Pakistan Asia Cup showdown is no longer just about cricket – it has become a lightning rod for grief, nationalism, and political one-upmanship, with leaders from Asaduddin Owaisi to Arvind Kejriwal and Uddhav Thackeray demanding answers."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/who-is-tommy-robinson-far-right-activist-behind-londons-massive-rally-glbs-2786960-2025-09-14",
      "headline": "Who is Tommy Robinson, the far-right activist behind London anti-immigration rallyOver 100,000 joined Tommy Robinson's Unite the Kingdom rally in London, one of the UK's largest right-wing protests, with police reporting scuffles, assaults and counter-demonstrations.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/new-nepal-pm-sushila-karki-first-address-gen-z-protests-martyrs-economy-parliament-power-handover-2787049-2025-09-14",
      "headline": "Those killed in Gen Z protests to be declared martyrs: New Nepal PM's 1st addressNew Nepal Prime Minister Sushila Karki, vowing to serve only as a six-month caretaker after the Gen Z-led ouster of KP Sharma Oli, called for unity to rebuild the financially strained nation. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/satwiksairaj-rankireddy-chirag-shetty-lose-hong-kong-open-final-2024-2787140-2025-09-14",
      "headline": "Hong Kong Open: Satwik-Chirag falter under pressure, lose final to Chinese pairIndia's Satwiksairah Rankireddy and Chirag Shetty lost in the final of the Hong Kong Open on Sunday. Despite showing promise, the duo faded away after winning the first game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-vs-pakistan-live-score-updates-shubman-gill-shaheen-afridi-dubai-2787137-2025-09-14",
      "headline": "IND vs PAK Live: All set for controversial clash in DubaiIndia vs Pakistan, Asia Cup Live updates: Dubai is all set for the big rivalry clash between India and Pakistan, as the two sides gear up for their second clash in the Asia Cup and the excitement is up to the brim."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-pakistan-fans-pray-for-teams-success-ahead-of-asia-cup-group-stage-match-2787119-2025-09-14",
      "headline": "India vs Pakistan: Fans pray for team's success ahead of Asia Cup matchFans across the country offer prayers ahead of India's group stage match in the Asia Cup against Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/aman-sehrawat-disqualified-wrestling-worlds-overweight-17kgs-report-2787110-2025-09-14",
      "headline": "Aman Sehrawat fails weight test, disqualified from Wrestling Worlds: ReportIndian wrestler Aman was reportedly disqualified for being overweight at the Wrestling World Championships in Zagreb. This comes as a major setback to the Indian wrestling contingent. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-athletics-championships-day-2-live-results-gulveer-savesh-100m-sprint-2787092-2025-09-14",
      "headline": "Tokyo Day 2 Live: Sarvesh Kushare in action, track events begin with men's 400mWorld Athletics Championships 2025 Day 2 Live Updates: It is set to be an electrifying evening in Tokyo, with the fastest men in the world taking stage. The centre of the attraction will be the 100m sprint. For India, Sarvesh Kushare and Gulveer Singh will be participating in their respective events."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-virat-kohli-2787080-2025-09-14",
      "headline": "With Kohli missing, Pakistan have big opportunity against India: MisbahFormer Pakistan captain Misbah ul Haq believes that Pakistan will not have the mental block of Virat Kohli in their Asia Cup match. Misbah says that Salman Agha have a big opportunity against this new Indian team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-ind-vs-pak-kuldeep-yadav-fakhar-zaman-spin-struggles-2787071-2025-09-14",
      "headline": "Facing Kuldeep Yadav, you'll feel the heat: Uthappa on Fakhar Zaman's spin strugglesFormer India cricketer Robin Uthappa predicts Pakistan's Fakhar Zaman will struggle against Kuldeep Yadav's spin in Asia Cup 2025. This battle could prove decisive in the high-stakes India-Pakistan group match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-shubman-gill-virat-kohli-ind-vs-pak-dubai-2787018-2025-09-14",
      "headline": "Asia Cup: With King Kohli absent, Prince Gill must rise to the occasion vs PakistanWith Virat Kohli absent from the Asia Cup 2025, Shubman Gill faces his first T20I test against Pakistan. As vice-captain, his form and temperament could shape India's chances in the high-voltage Dubai showdown."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-suryakumar-yadav-poor-form-ind-vs-pak-2786955-2025-09-14",
      "headline": "Birthday battle for Suryakumar Yadav: Can India skipper rise against Pakistan?Asia Cup 2025: Suryakumar Yadav will enter India's much-awaited clash against Pakistan with a forgettable record against the arch-rivals. Will the India captain rise to the occasion in the biggest match of his captaincy tenure so far on his birthday?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-vs-pakistan-hype-viewership-number-surprise-2787047-2025-09-14",
      "headline": "India vs Pakistan: A cricketing mismatch, but one Asia Cup number could shock us allIndia might dominate on the field, Pakistan might struggle to keep up, but in the aftermath of the Pahalgam terror attack and Operation Sindoor, the real uncertainty of this Asia Cup isn't the scoreline. It could be the numbers off the screens—how many actually tune in to watch the rivalry unfold."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-ind-vs-pak-kuldeep-yadav-fakhar-zaman-spin-struggles-2787071-2025-09-14",
      "headline": "Facing Kuldeep Yadav, you'll feel the heat: Uthappa on Fakhar Zaman's spin strugglesFormer India cricketer Robin Uthappa predicts Pakistan's Fakhar Zaman will struggle against Kuldeep Yadav's spin in Asia Cup 2025. This battle could prove decisive in the high-stakes India-Pakistan group match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-shubman-gill-virat-kohli-ind-vs-pak-dubai-2787018-2025-09-14",
      "headline": "Asia Cup: With King Kohli absent, Prince Gill must rise to the occasion vs PakistanWith Virat Kohli absent from the Asia Cup 2025, Shubman Gill faces his first T20I test against Pakistan. As vice-captain, his form and temperament could shape India's chances in the high-voltage Dubai showdown."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-suryakumar-yadav-poor-form-ind-vs-pak-2786955-2025-09-14",
      "headline": "Birthday battle for Suryakumar Yadav: Can India skipper rise against Pakistan?Asia Cup 2025: Suryakumar Yadav will enter India's much-awaited clash against Pakistan with a forgettable record against the arch-rivals. Will the India captain rise to the occasion in the biggest match of his captaincy tenure so far on his birthday?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-vs-pakistan-hype-viewership-number-surprise-2787047-2025-09-14",
      "headline": "India vs Pakistan: A cricketing mismatch, but one Asia Cup number could shock us allIndia might dominate on the field, Pakistan might struggle to keep up, but in the aftermath of the Pahalgam terror attack and Operation Sindoor, the real uncertainty of this Asia Cup isn't the scoreline. It could be the numbers off the screens—how many actually tune in to watch the rivalry unfold."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}