{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-will-take-all-steps-to-protect-national-interests-piyush-goyal-on-us-tariffs-2764217-2025-07-31",
      "headline": "India will take all steps to protect national interests: Piyush Goyal on US tariffsThe minister's remarks come amid rising concerns over the broader implications of the US move, including potential delays to the ongoing trade deal talks and uncertainty in sectors heavily reliant on US markets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/women-had-to-work-twice-as-hard-pallavi-shroff-reflects-on-male-dominated-profession-2764126-2025-07-31",
      "headline": "Women had to work twice as hard: Pallavi Shroff reflects on male-dominated professionPallavi Shroff, Managing Partner at Shardul Amarchand Mangaldas & Co., spoke on her four-decade journey in a male-dominated legal profession. Shroff stated that when she began, women had to 'work twice as hard to prove that we are half as good as our male colleagues'. She recounted starting her practice in 1981, facing clients who refused to meet a woman lawyer and judges who were dismissive. A significant turning point came in 1991 when a client, for a matter in the Allahabad High Court, chartered a flight for her as she was unable to travel by train after a surgery. Shroff also discussed the challenges for women in the Indian judiciary, the existence of unconscious bias, the handling of an $11 billion deal by an all-women team, and her view that leadership means leading from the front with humility and compassion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/nsdl-mb-engineering-sri-lotus-ipo-best-listing-gains-latest-gmp-subscription-2764201-2025-07-31",
      "headline": "NSDL vs M&B Engineering vs Sri Lotus: Which one shows the best listing gains?While all three IPOs have seen investor interest, one of them appears to offer the highest possible listing gains based on current grey market premium (GMP) data."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-donald-trump-trade-tariff-blow-25-percent-india-what-is-at-stake-2764192-2025-07-31",
      "headline": "US trade tariff blow: How much can India really lose?Analysts say the direct hit could affect over $3 billion worth of annual shipments, though the broader impact on India's GDP is expected to be limited."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-296-points-lower-nifty-below-24800-hul-up-4-2764181-2025-07-31",
      "headline": "Sensex ends 296 points lower, Nifty below 24,800; HUL up 4%The S&P BSE Sensex was down by 296.28 points to end at 81,185.58, while the NSE Nifty50 lost 86.70 points to close at 24,768.35. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/ca-explains-how-avoiding-a-rs-5000-splurge-every-month-can-make-you-a-crorepati-2764129-2025-07-31",
      "headline": "CA explains how avoiding a Rs 5,000 splurge every month can make you a crorepatiYoung professionals often burn out chasing income, yet let their money idle. A Chartered Accountant suggests ditching one Rs 5,000 splurge a month and letting compounding turn it into crores."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-india-25-percent-tariff-sectors-risk-exports-business-strategy-oil-healthcare-auto-agriculture-donald-trump-import-duty-2764106-2025-07-31",
      "headline": "US tariff of 25% puts several sectors at risk, but what's the fix?Experts said that sectors like gems and jewellery, seafood exports, and auto components are likely to feel the immediate effects of the 25% tariffs announced by the US. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-indian-farm-market-is-coming-in-between-india-and-us-tariff-negotiations-2764038-2025-07-31",
      "headline": "Behind the delayed US-India trade deal: A standoff over farmsAt the centre of the friction is a long-standing issue that has repeatedly stalled negotiations between the two countries: agriculture."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/donald-trump-us-25-percent-tariff-on-india-impact-stock-market-sectors-explained-2764076-2025-07-31",
      "headline": "Trump's 25% tariffs: These stocks and sectors are in the firing lineBoth the main indices on Dalal Street fell sharply in early trade, and despite recovering by noon, the mood remains tense after Washington's move threatened to upend trade flows across key sectors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/6-indian-firms-sanctioned-by-us-all-you-need-to-know-2764015-2025-07-31",
      "headline": "Who are the 6 Indian firms sanctioned by the US and what's at stake?Six Indian firms have been sanctioned by the US for allegedly importing Iranian petrochemicals. Here's all you need to know about them."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-u-now-open-update-your-past-itr-mistakes-for-ay-2021-22-and-2022-23-2764013-2025-07-31",
      "headline": "ITR-U now open: Update your past ITR mistakes for AY 2021-22 and 2022-23The Income Tax Department has now made it possible to file updated returns (ITR-U) for Assessment Years (AY) 2021-22 and 2022-23 using the ITR-1 and ITR-2 forms. This move aims to help people fix any errors or income details they may have missed earlier."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-india-trade-deal-25-percent-tariff-which-sectors-most-impacted-gems-jewellery-2764005-2025-07-31",
      "headline": "Trump's 25% tariffs: Which sectors should brace for impact?US President Donald Trump announced a 25% tariff on Indian exports starting August 1.  An additional penalty was also announced for India's continued oil purchases from Russia, which has added more uncertainty for businesses."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/donald-trump-us-tariff-dual-hit-for-india-economy-stock-market-exporters-investors-2763992-2025-07-31",
      "headline": "Explained: Why Trump's 25% tariff is a double whammy for IndiaThe move comes at a time when Indian exports are already under pressure and global demand remains uneven. It also marks a sharp deterioration in bilateral negotiations that had, until recently, appeared to be progressing toward a limited trade understanding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-down-today-stock-market-fall-why-reasons-us-tariff-it-shares-ril-adani-port-decline-2763979-2025-07-31",
      "headline": "Sensex falls 500 points: Why is stock market down todayHeavyweight stocks fell in early trade. The S&P BSE Sensex fell over 575 points in early trade to 80,907.34, while the NSE Nifty50 dropped 185 points to 24,670.15 by 10 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-india-tariff-king-hypocrisy-donald-trump-american-duties-up-to-350-percent-2763962-2025-07-31",
      "headline": "US calls India the 'tariff king'. But its own duties go as high as 350%Donald Trump has called India tariff king, but the U.S. quietly charges 350% on milk, tobacco, and fruit.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-590-points-lower-nifty-below-24700-ril-shares-fall-2-percent-2763938-2025-07-31",
      "headline": "Sensex opens 590 points lower, Nifty below 24,700; RIL shares fall 2%The S&P BSE Sensex lost 536.92 points to 80,944.94, while the NSE Nifty50 lost 156.35 points to 24,698.70 as of 9:26 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-25-percent-tariff-india-us-trade-deal-not-confirmed-why-reason-dairy-agriculture-sector-import-duty-2763923-2025-07-31",
      "headline": "Trump announces 25% tariff: Why India and US still don't have a trade dealDespite several rounds of talks, the two nations have not managed to bridge key differences. Speaking at a press conference at the White House, Trump said that India remains one of the highest tariff-imposing countries in the world, but discussions are underway."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bse-nse-trading-setup-us-tariff-fed-rate-cut-sensex-nifty-today-2763912-2025-07-31",
      "headline": "US imposes 25% tariff on India. Will Sensex, Nifty crash today?The GIFT Nifty futures, which reflect early cues for the market, were trading 179 points lower at 24,675, down 0.73%, signalling a weak start for Dalal Street."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-imposes-25-percent-trump-tariff-on-india-what-it-means-for-exports-and-key-sectors-2763759-2025-07-30",
      "headline": "US imposes 25% tariff on India: What it means for exports and key sectorsThe newly announced duties target several of India's top-performing export sectors, like auto components, steel, aluminum, smartphones, gems and jewellery. Pharmaceuticals, semiconductors, and critical minerals, however, have been excluded."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-the-subscription-lifestyle-is-fuelling-a-new-wave-of-debt-emi-bpnl-schemes-2763577-2025-07-30",
      "headline": "How the subscription lifestyle is fuelling a new wave of debtFrom entertainment and food to wellness and shopping, subscription models are everywhere. While they promise convenience, they're also leading many into silent debt traps, especially the younger, digital-savvy crowd."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/urvashi-rautela-claims-her-jewellery-worth-rs-70-lakh-stolen-from-london-airport-2764216-2025-07-31",
      "headline": "Urvashi Rautela claims her jewellery worth Rs 70 lakh stolen from London airportActor Urvashi Rautela reported the theft of jewellery worth Rs 70 lakh from London airport. The incident raised concerns over airport security."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kpop-demon-hunters-directors-on-slaying-demons-surpassing-bts-blackpink-2764110-2025-07-31",
      "headline": "Exclusive: KPop Demon Hunters directors on slaying demons, surpassing BTS, BLACKPINK'KPop Demon Hunters', Netflix's most-watched animated film, brilliantly blends supernatural lore with K-pop energy, featuring fierce female demon hunters and a fictional boy band that topped global charts. The film's directors spoke to us about its unique animation that celebrates self-acceptance and sisterhood, and more. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/vikrant-massey-rani-mukerji-71st-national-awards-12th-fail-mrs-chatterjee-vs-norway-2764200-2025-07-31",
      "headline": "Rani Mukerji, Vikrant Massey frontrunners for 71st National AwardsVikrant Massey and Rani Mukerji are leading contenders for this year's National Awards. Their performances in '12th Fail' and 'Mrs Chatterjee vs Norway' have caught attention, while 'Rocky Aur Rani Kii Prem Kahaani' might earn the Best Film accolade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-lifetime-box-office-collection-prediction-detailed-report-biggest-love-story-of-2025-with-rs-400-crore-haul-starring-ahaan-panday-aneet-padda-2764194-2025-07-31",
      "headline": "Saiyaara lifetime box office: Biggest love story of 2025 with Rs 400 crore haulDespite the release of 'Son of Sardaar 2' and 'Dhadak 2', 'Saiyaara' will manage to continue its winning run at the box office. IndiaToday.in spoke to a trade expert to decode the film's lifetime business expectations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nithiin-vikram-kumar-sports-drama-to-begin-in-late-2025-2764189-2025-07-31",
      "headline": "Nithiin-Vikram Kumar's sports drama to begin in late 2025? Here's what we knowTelugu star Nithiin and filmmaker Vikram Kumar are collaborating after more than a decade to create a big-budget sports drama. The film promises a fresh, emotionally charged narrative with extensive physical preparation and a pan-India release planned for mid-2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/samay-raina-announces-comeback-tour-samay-raina-is-alive-and-unfiltered-after-indias-got-latent-controversy-2764130-2025-07-31",
      "headline": "Samay Raina announces comeback tour Alive And Unfiltered after Latent controversyComedian Samay Raina is set to return with his India tour 'Alive And Unfiltered', starting August 15 in Bengaluru, following the 'India's Got Latent' controversy. The tour has already seen massive demand, with 40,000 tickets sold within an hour of release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/exclusive-saiyaara-producer-akshaye-widhani-reacts-to-viral-clips-of-fans-fainting-crying-2764163-2025-07-31",
      "headline": "Exclusive: Saiyaara producer reacts to viral clips of fans fainting, crying'Saiyaara' makers - producer Akshaye Widhani and director Mohit Suri - spoke to India Today about the film's overwhelming reception. Widhani responded to the viral clips of emotional fans crying and fainting in theatres."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/son-of-sardaar-2-caught-in-crossfire-saiyaara-mahavatar-narishimha-rule-screens-2764118-2025-07-31",
      "headline": "Son of Sardaar 2 caught in crossfire as Saiyaara, Mahavatar Narishimha rule screensActor Ajay Devgn's 'Son of Sardaar 2' is struggling to secure screens as 'Saiyaara' and 'Mahavatar Narishimha' continue to perform well. The release strategy faces challenges amid a crowded market and audience-driven demand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/kingdom-movie-review-vijay-deverakonda-gowtam-tinnanuri-aims-high-settles-for-mediocrity-2764136-2025-07-31",
      "headline": "Kingdom review: Vijay Deverakonda's film aims high, but settles for mediocrityRelease Date:Thu Jul 31, 2025Kingdom movie review: Director Gowtam Tinnanuri's 'Kingdom', starring Vijay Deverakonda and Satyadev, is a spy action drama with a reincarnation trope. While the film is visually striking, it lacks emotional depth, especially when it touches on brotherhood and the purpose of life. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rasha-thadani-ibrahim-ali-khan-walk-together-for-jj-valayas-fashion-show-2764149-2025-07-31",
      "headline": "Rasha Thadani-Ibrahim Ali Khan walk hand-in-hand for JJ Valaya's fashion show. WatchOn the last day of India Couture Week 2025, Rasha Thadani and Ibrahim Ali Khan walked the ramp for designer JJ Valaya. Holding hands in Indian outfits, the two became the show stopper.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mohit-suri-calls-ahaan-panday-cringe-tiktoker-2764033-2025-07-31",
      "headline": "Mohit Suri calls Ahaan Panday cringe TikToker: Pulled down videos before SaiyaaraAhead of the release of his debut film 'Saiyaara', Ahaan Panday removed all his old videos from Instagram. Director Mohit Suri remarked that the world has yet to witness the kind of antics Ahaan is truly capable of."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/nishaanchi-first-look-poster-aaishvary-thackeray-double-role-anurag-kashyap-amazon-mgm-studios-2764070-2025-07-31",
      "headline": "Nishaanchi first look: Aaishvary Thackeray debuts in Anurag Kashyap's crime sagaAmazon MGM Studios India revealed the first-look poster of 'Nishaanchi', directed by Anurag Kashyap. The film features Aaishvary Thackeray in a gripping double role and promises intense action and drama."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kyunki-saas-bhi-kabhi-bahu-thi-reboot-episode-2-update-tulsi-gets-body-shamed-at-her-party-2764107-2025-07-31",
      "headline": "Kyunki Saas Bhi Kabhi Bahu Thi reboot Episode 2: Tulsi gets body-shamed at her partyIn the new episode of 'Kyunki Saas Bhi Kabhi Bahu Thi' reboot, Tulsi is body-shamed and age-shamed. She is told by her daughter that she doesn't take good care of her health, while the guests discuss how Mihir is way better looking than his partner. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/asha-parekh-waheeda-rehman-helen-dinner-outing-bollywood-friendship-2764071-2025-07-31",
      "headline": "Asha Parekh, Waheeda Rehman and Helen enjoy dinner dateAsha Parekh, Waheeda Rehman, and Helen, recently enjoyed a dinner outing in Mumbai. The 'Kati Patang' actor shared a picture from their dinner date on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/courtney-cox-calls-friends-co-star-lisa-kudrow-her-loot-in-touching-birthday-post-2764062-2025-07-31",
      "headline": "Courtney Cox calls Friends co-star Lisa Kudrow her loot in touching birthday postActor Courtney Cox shared the most touching birthday post for her \"loot\" Lisa Kudrow. The latter turned 62 on July 30. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kishore-kumar-four-marriages-love-betrayal-tragedy-madhubala-yogeeta-bali-leena-chandavarkar-2763700-2025-07-31",
      "headline": "Love, Money, Madness and Fame: The Enduring Philosophy of Kishore KumarOn August 4, 2025, we celebrate what would have been the 96th birthday of Kishore Kumar—the legendary singer, actor, and filmmaker whose unparalleled talent and eccentric charm left an indelible imprint on Indian cinema. In this series, we explore the multifaceted life of this enigmatic genius, delving into his complex relationships with love, marriage, money, madness, and fame. The first part of this special series traces Kishore's quest for love—a journey marked by passion, heartbreak, and resilience—tragically cut short by his sudden death in 1987."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/katrina-kaif-vicky-kaushal-ferry-ride-to-alibaug-viral-video-2764028-2025-07-31",
      "headline": "Katrina Kaif and Vicky Kaushal ferry-off to Alibaug together, video goes viralKatrina Kaif and Vicky Kaushal were recently seen heading to Alibaug. Katrina's outfit and their low-key appearance sparked fresh pregnancy rumours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-gen-z-rewinds-to-classic-bollywood-romances-veer-zaara-mohit-suri-ahaan-panday-aneet-padda-shah-rukh-khan-2763505-2025-07-31",
      "headline": "5 Bollywood romantic films Gen-Z will relate to if they liked Saiyaara so muchWhile the popularity of Mohit Suri's 'Saiyaara' refuses to slow down, Gen-Z is beginning to look back at a time when love unfolded through soulful songs and heartfelt monologues in Bollywood. As the 2000s romantic classics find new life through re-releases and streaming platforms, today's generation is rediscovering what it truly means to fall-and grow-in love.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-kingdom-team-meets-pawan-kalyan-on-ustaad-bhagat-singh-set-2764030-2025-07-31",
      "headline": "Vijay Deverakonda's Kingdom team meets Pawan Kalyan on Ustaad Bhagat Singh setVijay Deverakonda and the team of his upcoming movie 'Kingdom' met Pawan Kalyan on the sets of 'Ustaad Bhagat Singh'. 'Kingdom' hit theatres today. \r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-wont-retaliate-to-trumps-25-tariffs-sees-no-need-to-panic-sources-2764205-2025-07-31",
      "headline": "India won't retaliate to Trump's 25% tariffs, sees no need to panic: SourcesTrump on Wednesday announced imposing a 25% tariff along with additional penalties on Indian imports, effective August 1."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-backs-donald-trump-dead-economy-remark-questions-pm-narendra-modi-silence-us-tariff-2764089-2025-07-31",
      "headline": "Glad Trump stated facts: Rahul Gandhi backs 'dead economy' remark on IndiaRahul Gandhi backed Donald Trump's \"dead economy\" remark, accusing PM Modi of destroying India's economy. He questioned Modi's silence on the 25 percent US tariff and said the government has failed on the economic front.\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/a-for-akhilesh-yadav-b-for-babasaheb-lessons-at-samajwadi-party-run-school-in-up-2764191-2025-07-31",
      "headline": "A for Akhilesh Yadav, B for Babasaheb: Lessons at Samajwadi Party-run school in UPSP worker Faraz Alam Gada has started the first PDA Pathshaala — named after the Samajwadi Party's PDA - Pichhda (backward), Dalit, Alpsankhyak (minority) outreach in Ramnagar in Saharanpur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-5th-test-london-weather-day1-live-score-updates-2764064-2025-07-31",
      "headline": "5th Test, Day 1 Live: India lose KL Rahul, Yashasvi Jaiswal in morning sessionIndia (IND) vs England (ENG), 5th Test, Day 1 Live Updates: England pacers Gus Atkinson and Chris Woakes struck early to remove Indian openers Yashasvi Jaiswal and KL Rahul after stand-in captain Ollie Pope won the toss and chose to bowl in the final Test of the five-match series at The Oval. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/malegaon-blast-verdict-hindu-terror-congress-pragya-thakur-digvijay-singh-rss-chidambaram-sushilkumar-shinde-heres-how-2764072-2025-07-31",
      "headline": "When Congress leader, UPA-era NSA discussed Hindu terror with top US officialsAll seven accused in the 2008 Malegaon blast have been acquitted after 17 years of trial. The case was once used by Congress leaders to start a \"Hindu terror\" narrative, triggering years of political firestorms. Congress MP Rahul Gandhi discussed \"threats\" from \"Hindutva terrorism\" even with then US Ambassador to India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/no-proof-col-purohit-made-bomb-pragya-thakur-owned-bike-used-in-malegaon-blast-judge-while-reading-verdict-2764008-2025-07-31",
      "headline": "No evidence: All Malegaon blast accused, including Pragya Thakur, acquittedMalegaon blasts verdict: The blasts in Malegaon killed six people and injured over 100. Seventeen years later, all the seven accused have been acquitted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/partial-skeletal-remains-found-at-6th-site-in-dharmasthala-mass-burial-case-1st-location-to-provide-evidence-2764083-2025-07-31",
      "headline": "Dharmasthala case: Partial skeletal remains found at 6th site, first with evidencePartial skeletal remains have been found at the sixth site in Dharmasthala's mass burial probe as investigators intensify efforts to verify allegations made by a former sanitation worker about multiple burials in the temple town."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/jat-conundrum-jagdeep-dhankars-exit-bares-bjps-struggle-with-community-2763641-2025-07-30",
      "headline": "Jat conundrum: Jagdeep Dhankar's exit bares BJP's struggle with communityEngineering a Jat breakthrough for long, the BJP has instead built a fragile edifice of borrowed faces and paper alliances, just one defection or protest away from collapse"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kishore-kumar-four-marriages-love-betrayal-tragedy-madhubala-yogeeta-bali-leena-chandavarkar-2763700-2025-07-31",
      "headline": "Love, Money, Madness and Fame: The Enduring Philosophy of Kishore KumarOn August 4, 2025, we celebrate what would have been the 96th birthday of Kishore Kumar—the legendary singer, actor, and filmmaker whose unparalleled talent and eccentric charm left an indelible imprint on Indian cinema. In this series, we explore the multifaceted life of this enigmatic genius, delving into his complex relationships with love, marriage, money, madness, and fame. The first part of this special series traces Kishore's quest for love—a journey marked by passion, heartbreak, and resilience—tragically cut short by his sudden death in 1987."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ex-tamil-nadu-chief-minister-o-panneerselvam-exits-nda-hours-after-meeting-mk-stalin-during-morning-walk-2764120-2025-07-31",
      "headline": "OPS exits NDA ahead of polls, move comes hours after morning walk with StalinIn a significant political development in Tamil Nadu, expelled AIADMK leader O Panneerselvam announced his exit from the NDA, just hours after a morning meeting with Chief Minister MK Stalin."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-india-returned-haji-pir-pass-pakistan-after-capturing-1965-pm-modi-congress-explained-2763676-2025-07-31",
      "headline": "Why India returned Haji Pir Pass to Pakistan after capturing it in 1965India captured the Haji Pir Pass in 1965 in a big military achievement, but returned it to Pakistan just months later under the Tashkent Agreement. Critics argue that the move compromised long-term security in Kashmir. But why did India give control of Haji Pir Pass to Pakistan despite wresting the strategic site from it?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/parliament-monsoon-session-live-us-tariffs-bihar-roll-revision-to-dominate-house-proceedings-today-2763975-2025-07-31",
      "headline": "Live: Will take all steps for national interest, says Piyush Goyal on US tariffsUnion Commerce Minister Piyush Goyal said that the Indian government is examining the impact of US President Donald Trump's recent 25% tariff announcement on Indian exporters and the economy. He further said that India has risen from the 11th to the fifth-largest economy in the past decade due to the contributions of its farmers and MSMEs, and emphasised the need to protect their interests while negotiating any trade deal. The Opposition has pointed to the Prime Minister's repeated praise for his \"friend\" Donald Trump, questioning what that friendship has delivered amid rising economic pressure from Washington. India, in response, has said it remains committed to a fair and mutually beneficial trade agreement with the US - but emphasised that it would take all necessary steps to protect its farmers, MSMEs, and domestic entrepreneurs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/kingdom-movie-review-vijay-deverakonda-gowtam-tinnanuri-aims-high-settles-for-mediocrity-2764136-2025-07-31",
      "headline": "Kingdom review: Vijay Deverakonda's film aims high, but settles for mediocrityRelease Date:Thu Jul 31, 2025Kingdom movie review: Director Gowtam Tinnanuri's 'Kingdom', starring Vijay Deverakonda and Satyadev, is a spy action drama with a reincarnation trope. While the film is visually striking, it lacks emotional depth, especially when it touches on brotherhood and the purpose of life. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/kerala/story/they-will-kill-me-23-year-old-pregnant-womans-last-words-to-mother-dies-by-suicide-domestic-abuse-husband-mother-in-law-taken-into-custody-2764057-2025-07-31",
      "headline": "I'm dying or they'll kill me: Pregnant Kerala woman's text to mother before suicideA 23-year-old pregnant woman from Kerala's Thrissur died by suicide after sending her mother a chilling message: \"I am going to die, or they will kill me.\" Police have remanded her husband and mother-in-law under abetment to suicide and other relevant provisions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/jaya-bachchan-rebukes-priyanka-chaturvedi-during-operation-sindoor-discussion-rajya-sabha-2763990-2025-07-31",
      "headline": "Priyanka, don't control: Jaya Bachchan rebukes MP during Op Sindoor discussionSamajwadi Party MP and veteran actor Jaya Bachchan spoke in the Rajya Sabha on Wednesday during a discussion on the Pahalgam attack and subsequent military operation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-india-25-percent-tariff-sectors-risk-exports-business-strategy-oil-healthcare-auto-agriculture-donald-trump-import-duty-2764106-2025-07-31",
      "headline": "US tariff of 25% puts several sectors at risk, but what's the fix?Experts said that sectors like gems and jewellery, seafood exports, and auto components are likely to feel the immediate effects of the 25% tariffs announced by the US. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/jayanti-reddys-second-icw-outing-with-jahnvi-kapoor-nails-luxe-sustainability-2764087-2025-07-31",
      "headline": "Jayanti Reddy's second ICW outing nails luxe sustainabilityIn her collection Reclaimed Opulence, Jayanti Reddy explored what it means to carry forward India's sartorial legacy in a way that speaks to the modern, global Indian woman."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-chief-minister-rekha-gupta-pollution-water-logging-bhagwant-mann-kejriwal-2764138-2025-07-31",
      "headline": "Bhagwant Mann said he feels sidelined by Kejriwal: Rekha Gupta's big claimDelhi Chief Minister Rekha Gupta, speaking at the India Today Woman Summit 2025, said Bhagwant Mann was not being given full authority in running the affairs in Punjab."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/this-gift-was-offered-to-the-gods-2500-years-ago-we-now-know-what-it-is-2764119-2025-07-31",
      "headline": "Mystery of 2500-year-old gift offered to gods finally solvedThis breakthrough ends decades of debate among archaeologists and chemists, who, using less advanced techniques, had long assumed the substance was merely an animal fat or beeswax. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/jeera-water-vs-saunf-water-which-is-a-smarter-sip-to-start-your-morning-2764078-2025-07-31",
      "headline": "Jeera water vs Saunf water: Which is better to start your morning with?These are not trends, just some old-school tips and tricks to boost digestion, metabolism or weight management. While both jeera water and saunf water are common morning drinks, is there one which has more edge? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/private-school-fees-rise-169-percent-impact-middle-class-families-india-2764003-2025-07-31",
      "headline": "From dual incomes to debt: The silent struggle of parents paying private school feesMiddle-class Indian families struggle with sharply rising private school fees and related lifestyle changes. Despite existing fee regulations, poor enforcement leaves parents bearing heavy financial and emotional costs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/maybe-theyll-sell-to-india-trump-finalise-trade-deal-with-pakistan-to-develop-massive-oil-reserves-glbs-2763875-2025-07-31",
      "headline": "Maybe they'll sell to India: Trump strikes trade deal, oil partnership with PakDonald Trump announced a new US-Pakistan oil trade deal, hinting it could pave the way for future exports to India. The move follows Trump's declaration of a 25% tariff and extra penalties on goods imported from India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-india-tariff-king-hypocrisy-donald-trump-american-duties-up-to-350-percent-2763962-2025-07-31",
      "headline": "US calls India the 'tariff king'. But its own duties go as high as 350%Donald Trump has called India tariff king, but the U.S. quietly charges 350% on milk, tobacco, and fruit.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/can-take-their-dead-economies-down-together-trump-hits-out-at-india-russia-2763955-2025-07-31",
      "headline": "India, Russia can take their dead economies down together: Trump sharpens attackIn a fiery post on Truth Social, Trump doubled down on his long-standing gripe over India's trade practices, accusing the country of levying \"among the highest tariffs in the world\" and blaming New Delhi for what he claimed was \"very little business\" between the two nations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/urvashi-rautela-claims-her-jewellery-worth-rs-70-lakh-stolen-from-london-airport-2764216-2025-07-31",
      "headline": "Urvashi Rautela claims her jewellery worth Rs 70 lakh stolen from London airportActor Urvashi Rautela reported the theft of jewellery worth Rs 70 lakh from London airport. The incident raised concerns over airport security."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/vikrant-massey-rani-mukerji-71st-national-awards-12th-fail-mrs-chatterjee-vs-norway-2764200-2025-07-31",
      "headline": "Rani Mukerji, Vikrant Massey frontrunners for 71st National AwardsVikrant Massey and Rani Mukerji are leading contenders for this year's National Awards. Their performances in '12th Fail' and 'Mrs Chatterjee vs Norway' have caught attention, while 'Rocky Aur Rani Kii Prem Kahaani' might earn the Best Film accolade."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/saiyaara-lifetime-box-office-collection-prediction-detailed-report-biggest-love-story-of-2025-with-rs-400-crore-haul-starring-ahaan-panday-aneet-padda-2764194-2025-07-31",
      "headline": "Saiyaara lifetime box office: Biggest love story of 2025 with Rs 400 crore haulDespite the release of 'Son of Sardaar 2' and 'Dhadak 2', 'Saiyaara' will manage to continue its winning run at the box office. IndiaToday.in spoke to a trade expert to decode the film's lifetime business expectations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nithiin-vikram-kumar-sports-drama-to-begin-in-late-2025-2764189-2025-07-31",
      "headline": "Nithiin-Vikram Kumar's sports drama to begin in late 2025? Here's what we knowTelugu star Nithiin and filmmaker Vikram Kumar are collaborating after more than a decade to create a big-budget sports drama. The film promises a fresh, emotionally charged narrative with extensive physical preparation and a pan-India release planned for mid-2026."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-arshdeep-singh-kuldeep-yadav-2764212-2025-07-31",
      "headline": "Oval Test: Gautam Gambhir faces heat for Arshdeep, Kuldeep omissionGautam Gambhir was slammed on social media for his selection calls in the final Test against England at the Oval where the likes of Kuldeep Yadav and Arshdeep Singh were ignored. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-playing-xi-karun-nair-returns-jasprit-bumrah-rested-2764178-2025-07-31",
      "headline": "No Bumrah, Karun Nair gets 2nd chance as India make 4 changes for Oval TestJasprit Bumrah has been rested for the Oval Test while Karun Nair has got a second chance in England as India make four changes for the match. There was no debut for Arshdeep Singh and Kuldeep Yadav had to sit out of the game yet again. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/harsh-tyagi-exclusive-outer-delhi-warriors-vice-captaincy-ravindra-jadeja-2764100-2025-07-31",
      "headline": "Harsh Tyagi ready for Delhi Warriors's vice-captaincy, looks up to Ravindra JadejaOuter Delhi Warriors vice-captain Harsh Tyagi, in an exclusive interaction with IndiaToday.in, advised every young player in the DPL to treat pressure as a blessing and use it as an opportunity to showcase their true potential."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-ashes-tickets-cricket-australia-todd-greenberg-2764101-2025-07-31",
      "headline": "Intense ENG vs IND series will help sell more Ashes tickets: CA CEOCricket Australia CEO Todd Greenberg feels the aggressive India-England series will boost Ashes 2025 ticket sales. Greenberg is eager to welcome the England team to the Australian shorts in November. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/dpl-t20-siddhant-sharma-exclusive-ipl-star-studded-outer-delhi-warriors-squad-2764082-2025-07-31",
      "headline": "DPL T20: Siddhant Sharma ready to lead IPL star-studded Outer Delhi Warriors squadIn an exclusive interaction with IndiaToday.in, captain Siddhant Sharma expressed his excitement and gratitude at being entrusted with the responsibility of leading the team, adding that he is already learning a great deal under the mentorship of Parthiv Patel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-5th-test-london-weather-day1-live-score-updates-2764064-2025-07-31",
      "headline": "5th Test, Day 1 Live: Sai Sudharsan, KL Rahul look to rebuild at overcast OvalIndia (IND) vs England (ENG), 5th Test, Day 1 Live Updates: England pacer Gus Atkinson struck early, removing opener Yashasvi Jaiswal for just two after stand-in captain Ollie Pope won the toss and chose to bowl in the final Test of the five-match series at The Oval. Sai Sudharsan has walked in at No.3 to join the experienced KL Rahul at the crease."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pro-kabaddi-league-season-12-schedule-venues-cities-2764043-2025-07-31",
      "headline": "Titans vs Thalaivas in opener, Vizag, Jaipur, Chennai, Delhi return as venuesThe Pro Kabaddi League season 12 is all set to kickstart from August 29 in Vizag with the Telugu Titans taking on Tamil Thalaivas in the opening match. The PKL will take place across four cities this season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/brad-haddin-criticises-england-approach-vs-india-old-trafford-test-2764017-2025-07-31",
      "headline": "Brad Haddin slams England for Manchester Day 5 drama: I liked what India didFormer Australia wicketkeeper Brad Haddin has taken a swipe at England for their conduct during the closing stages of the fourth Test in Manchester, accusing Ben Stokes' side of attempting to call off the match prematurely once a win was no longer possible."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-dhruv-jurel-ms-dhoni-meme-london-2764016-2025-07-31",
      "headline": "Wicketkeeping first: Dhruv Jurel reacts to MS Dhoni meme ahead of Oval TestDhruv Jurel opened up on the memes he got after just being asked to do the wicketkeeper's job in the ongoing series against England. Jurel played the last two games as a substitute wicketkeeper and didn't get a chance to bat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/dpl-t20-siddhant-sharma-exclusive-ipl-star-studded-outer-delhi-warriors-squad-2764082-2025-07-31",
      "headline": "DPL T20: Siddhant Sharma ready to lead IPL star-studded Outer Delhi Warriors squadIn an exclusive interaction with IndiaToday.in, captain Siddhant Sharma expressed his excitement and gratitude at being entrusted with the responsibility of leading the team, adding that he is already learning a great deal under the mentorship of Parthiv Patel."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-5th-test-london-weather-day1-live-score-updates-2764064-2025-07-31",
      "headline": "5th Test, Day 1 Live: Sai Sudharsan, KL Rahul look to rebuild at overcast OvalIndia (IND) vs England (ENG), 5th Test, Day 1 Live Updates: England pacer Gus Atkinson struck early, removing opener Yashasvi Jaiswal for just two after stand-in captain Ollie Pope won the toss and chose to bowl in the final Test of the five-match series at The Oval. Sai Sudharsan has walked in at No.3 to join the experienced KL Rahul at the crease."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/pro-kabaddi-league-season-12-schedule-venues-cities-2764043-2025-07-31",
      "headline": "Titans vs Thalaivas in opener, Vizag, Jaipur, Chennai, Delhi return as venuesThe Pro Kabaddi League season 12 is all set to kickstart from August 29 in Vizag with the Telugu Titans taking on Tamil Thalaivas in the opening match. The PKL will take place across four cities this season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/brad-haddin-criticises-england-approach-vs-india-old-trafford-test-2764017-2025-07-31",
      "headline": "Brad Haddin slams England for Manchester Day 5 drama: I liked what India didFormer Australia wicketkeeper Brad Haddin has taken a swipe at England for their conduct during the closing stages of the fourth Test in Manchester, accusing Ben Stokes' side of attempting to call off the match prematurely once a win was no longer possible."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-dhruv-jurel-ms-dhoni-meme-london-2764016-2025-07-31",
      "headline": "Wicketkeeping first: Dhruv Jurel reacts to MS Dhoni meme ahead of Oval TestDhruv Jurel opened up on the memes he got after just being asked to do the wicketkeeper's job in the ongoing series against England. Jurel played the last two games as a substitute wicketkeeper and didn't get a chance to bat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-spinner-final-test-selection-debate-aakash-chopra-anderson-tendulkar-trophy-2764006-2025-07-31",
      "headline": "Aakash Chopra slams England's spin bowling choices for Oval TestAakash Chopra has questioned England's decision to enter the final Test of the Anderson-Tendulkar Trophy without a specialist spinner, calling it a surprising move ahead of a high-stakes decider. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/ruben-amorim-reaction-manchester-united-transfer-plans-benjamin-sesko-links-2764001-2025-07-31",
      "headline": "Ruben Amorim remains coy on Manchester United transfer plans, Sesko linksManchester United manager Ruben Amorim remained coy about potential transfer activity and links to Benjamin Sesko following his side's dominant 4-1 win over Bournemouth in the Premier League Summer Series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-divya-deshmukh-nagpur-return-world-cup-win-2763985-2025-07-31",
      "headline": "Divya Deshmukh gets grand reception after World Cup win, credits family for triumphDivya Deshmukh was overwhelmed as she received a grand welcome from her hometown of Nagpur on Wednesday, July 31 after her Women's World Cup win in Georgia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ben-stokes-shubman-gill-question-scheduling-gap-england-vs-india-test-series-2763970-2025-07-31",
      "headline": "Stokes, Gill question short 3-day gap between Tests in 5-match seriesBen Stokes and Shubman Gill on Wednesday called for longer gaps between matches, stating that a three-day break is too short for a five-Test series like the ongoing one, especially given the heavy workload on the bowlers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-oval-test-gautam-gambhir-india-ready-post-rohit-kohli-era-2763856-2025-07-31",
      "headline": "Oval Test: Gambhir's chance to show India's ready for post-Rohit-Kohli eraThe Oval Test presents Gautam Gambhir with a golden opportunity to prove he's the right man to lead India's next-gen Test team in the post-Rohit-Kohli era. With the series on the line, this could well be his defining red-ball moment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/football-fever-returns-imphal-trau-fc-neroca-fc-clash-durand-cup-opener-2763945-2025-07-31",
      "headline": "Football fever returns to Imphal as TRAU FC, NEROCA clash in Durand Cup openerNEROCA FC snatched a dramatic 1-1 draw against 10-man TRAU FC in their Group E opener at the 134th IndianOil Durand Cup in Imphal on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-u19-tour-of-australia-squad-announced-schedule-ayush-mhatre-vaibhav-suryavanshi-2763942-2025-07-31",
      "headline": "Mhatre to lead, Suryavanshi retained as India announce U19 squad for AUS tourAyush Mhatre will captain the India U19 side on their Australia tour starting September. The squad retains core players from the England tour, aiming to build on recent successes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-last-assist-helps-inter-miami-beat-atlas-2-1-in-league-cup-2763933-2025-07-31",
      "headline": "Messi's late assist helps Inter Miami beat Atlas 2-1 in Leagues Cup openerLionel Messi provided assists for both of Inter Miami's goals, including the stoppage-time winner, as the Herons edged past Atlas 2-1 in their Leagues Cup group-stage opener on Wednesday in Fort Lauderdale, Florida."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-oval-test-gautam-gambhir-india-ready-post-rohit-kohli-era-2763856-2025-07-31",
      "headline": "Oval Test: Gambhir's chance to show India's ready for post-Rohit-Kohli eraThe Oval Test presents Gautam Gambhir with a golden opportunity to prove he's the right man to lead India's next-gen Test team in the post-Rohit-Kohli era. With the series on the line, this could well be his defining red-ball moment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/football-fever-returns-imphal-trau-fc-neroca-fc-clash-durand-cup-opener-2763945-2025-07-31",
      "headline": "Football fever returns to Imphal as TRAU FC, NEROCA clash in Durand Cup openerNEROCA FC snatched a dramatic 1-1 draw against 10-man TRAU FC in their Group E opener at the 134th IndianOil Durand Cup in Imphal on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-u19-tour-of-australia-squad-announced-schedule-ayush-mhatre-vaibhav-suryavanshi-2763942-2025-07-31",
      "headline": "Mhatre to lead, Suryavanshi retained as India announce U19 squad for AUS tourAyush Mhatre will captain the India U19 side on their Australia tour starting September. The squad retains core players from the England tour, aiming to build on recent successes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lionel-messi-last-assist-helps-inter-miami-beat-atlas-2-1-in-league-cup-2763933-2025-07-31",
      "headline": "Messi's late assist helps Inter Miami beat Atlas 2-1 in Leagues Cup openerLionel Messi provided assists for both of Inter Miami's goals, including the stoppage-time winner, as the Herons edged past Atlas 2-1 in their Leagues Cup group-stage opener on Wednesday in Fort Lauderdale, Florida."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-gautam-gambhir-spat-indian-team-riled-up-2763724-2025-07-31",
      "headline": "Don't rile up India! When teams learned it hard way after going at Indian teamWhen riled up, India tends to answer back with a bit of spice and some great wins. The message is pretty clear when it comes to the Indian cricket team. Don't rile them up as they can hit back with a strong answer. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-5th-test-oval-shubman-gill-ollie-pope-gautam-gambhir-2763914-2025-07-31",
      "headline": "India ready for Oval showdown with pride, history and series on the lineENG vs IND, 5th Test: India are on the backfoot in the ongoing series as they need to beat England somehow at the Kennington Oval in London to avoid a series defeat. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-oval-test-london-weather-report-rain-2763908-2025-07-31",
      "headline": "Oval Test Weather report: Will rain end India's chances of levelling series?England and India are all set to battle it in the series finale at the Oval from Thursday, July 31. With the visitors looking to level things up, will rain spoil things for Shubman Gill and his men in London?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-5th-test-prediction-team-news-lords-pitch-playing-xi-2763845-2025-07-31",
      "headline": "ENG vs IND 5th Test: Can riled-up India land final punch to square series?Having secured a draw in Manchester, India have a great chance to level the series at the Oval against a depleted England side. Shubman Gill and his men have batted and bowled out of their skins time and again in the series so far, and now have a chance to punch above their weight in the finale."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-dale-steyn-makes-bold-prediction-for-mohammed-siraj-in-oval-2763858-2025-07-30",
      "headline": "ENG vs IND: Dale Steyn makes bold prediction for Indian bowler for Oval TestLegendary South Africa speedster Dale Steyn has made a bold prediction for Mohammed Siraj for the fifth Test against England at the Oval set to begin from July 31."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zim-vs-nz-1st-test-day-1-matt-henry-bulawayo-new-zealand-zimbabwe-2763842-2025-07-30",
      "headline": "ZIM vs NZ: Henry dominates as New Zealand blitz through Zimbabwe on Day 1Matt Henry ripped through Zimbabwe's batting with figures of 6 for 39, helping New Zealand bowl out the hosts for just 149 on Day 1. In addition, Conway's unbeaten fifty took the visitors to 92/0, putting them firmly in control."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-teams-owner-the-hundred-england-2763824-2025-07-30",
      "headline": "Four IPL team owners confirmed as \"strategic partners\" for The Hundred teamsOn Wednesday, the England and Wales Cricket Board (ECB) announced that four Indian Premier League franchise owners have been confirmed as \"strategic partners\" for teams in 'The Hundred'. These owners will assume operational control by October 1 this year.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/arshdeep-singh-england-vs-india-5th-test-debut-predicted-xi-2763811-2025-07-30",
      "headline": "5th Test Predicted XI: Will Arshdeep Singh make Test debut at The Oval?ENG vs IND, 5th Test: India might hand Arshdeep Singh his maiden Test cap at the Kennington Oval in London with Jasprit Bumrah uncertain for the game, starting July 31. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/manchester-united-benjamin-sesko-ollie-watkins-transfer-deal-2763799-2025-07-30",
      "headline": "Manchester United eye Sesko over Watkins as big striker signing: ReportManchester United have reportedly decided that they will go ahead and sign Benjamin Sesko should the club push to sign a striker in the ongoing transfer window. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/eng-vs-ind-5th-test-oval-shubman-gill-full-pre-match-press-conference-2763782-2025-07-30",
      "headline": "Levelling series will be a big achievement for our young side: Shubman GillIndia captain Shubman Gill has said that levelling the series in England will be a big achievement for their team, full of youngsters. India have a great chance to level the series 2-2 by winning the fifth Test at the oval set to begin from July 31."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/wwe/story/wwe-vince-mcmahon-reckless-driving-car-crash-connecticut-highway-2763772-2025-07-30",
      "headline": "Ex-WWE boss faces reckless driving charge after Connecticut crash: ReportVince McMahon has been cited for reckless driving after crashing his Bentley on a highway, damaging two other vehicles. The incident occurred hours before news broke of Hulk Hogan's death. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/parthiv-patel-to-mentor-youngsters-in-outer-delhi-warriors-dpl-season-2-2763769-2025-07-30",
      "headline": "Parthiv Patel ready for the challenge to mentor next-gen stars in DPL season 2Former India wicketkeeper batter Parthiv Patels is ready to challenge next-gen superstars for Outer Delhi Warriors in the Delhi Premier League (DPL) season 2."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}