{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/stock-market-tips-it-defence-psu-banking-sector-likely-to-see-growth-on-dalal-street-expert-advice-2788858-2025-09-17",
      "headline": "IT, defence or PSU banking? Which sector is likely to see growth on D-Street?PSU banking stocks have started gaining attention after a long period of underperformance, while the IT sector remains in a state of uncertainty. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-continue-winning-run-amid-india-us-trade-talk-optimism-2788829-2025-09-17",
      "headline": "Sensex, Nifty continue winning run amid India-US trade talk optimismThe S&P BSE Sensex rose 313.02 points to close at 82,693.71, while the NSE Nifty50 added 91.25 points to end at 25,330.25. Broader markets also held their ground, with midcap and smallcap indices finishing in the green."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pm-modi-birthday-wishes-business-leaders-ambani-kotak-mahindra-bill-gates-2788816-2025-09-17",
      "headline": "Business leaders extend heartfelt wishes to PM Modi on 75th birthdayProminent business leaders across India as he celebrated his 75th birthday on Tuesday, with several industrialists praising his transformational leadership and unwavering commitment to the nation's progress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/home-loan-easy-method-ai-tool-hom-i-basic-home-loan-fintech-atul-monga-2788796-2025-09-17",
      "headline": "Want a home loan without the headache? Here's how AI can help youFrom lengthy paperwork to long waiting periods, applying for a home loan often becomes a tedious process filled with red tape, but an AI tool can now make it easy for you. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/cotton-farmers-face-new-challenge-as-quality-issues-threaten-msp-2788758-2025-09-17",
      "headline": "Cotton farmers face new challenge as quality issues threaten MSPDuring this Kharif season, northern states such as Haryana, Punjab, and Rajasthan, and southern states including Andhra Pradesh and Telangana, experienced prolonged and abnormal rainfall."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-india-launch-siddharth-jain-first-india-inc-tesla-owner-boost-ev-adoption-2788714-2025-09-17",
      "headline": "Elon Musk congratulates Siddharth Jain, India Inc's 1st executive to own a TeslaElon Musk congratulated Siddharth Jain of INOX Group on owning the first Tesla in India Inc."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/blackbuck-startup-usd-1-billion-leaves-office-bengaluru-pothole-ceo-rajesh-kumar-yabaji-2788677-2025-09-17",
      "headline": "$1 billion startup BlackBuck leaves Bengaluru office, blames potholesBengaluru firm BlackBuck, worth over $1 billion has decided to move out of their office in the city due to worsening pothole conditions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/bel-share-price-new-order-should-you-buy-explained-2788588-2025-09-17",
      "headline": "BEL share price: Why is it rising today and should you buy?BEL shares rose during the trading session on strong Rs 712 crore order inflow, supported by robust backlog and bullish technicals, keeping investor sentiment positive and suggesting potential further upside in the near-term trading sessions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/urban-company-shares-list-at-58-premium-over-ipo-price-book-profit-or-hold-explained-2788567-2025-09-17",
      "headline": "Urban Company shares list at 58% premium: Should you book profit or hold?Urban Company share price: The strong debut reflects the high demand for Urban Company's IPO, which had been among the most closely watched offerings of 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/urban-company-share-price-bse-nse-58-percent-premium-2788559-2025-09-17",
      "headline": "Urban Company share price: Stock makes bumper debut at 58% premiumUrban Company listed at a 57.5% premium at Rs 162.25 on the NSE. On the BSE, the shares opened at Rs 161, marking a 56% gain over the Rs 103 issue price."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/experts-bet-big-financial-stock-bajaj-finance-record-high-psu-banking-sbi-defence-idea-forge-2788554-2025-09-17",
      "headline": "Experts bet big on this financial stock at record high. Should you buy?Experts recommend the financial stock as a strong buy for investors focusing on financial stocks, while also suggesting PSU banks, defence tech firms, and auto ancillary stocks as potential picks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/dreamfolks-share-price-tumble-5-today-why-is-it-under-pressure-2788555-2025-09-17",
      "headline": "DreamFolks share price tumble 5% today. Why is it under pressure?DreamFolks shares fell sharply in early trade after the company quit the domestic lounge business, a move that could reshape its position in India's fast-evolving airport services market."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/saiyaara-netflix-most-watched-non-english-film-global-debut-week-2788847-2025-09-17",
      "headline": "Saiyaara becomes Netflix's top non-English film worldwide in debut weekMohit Suri's 'Saiyaara' tops Netflix's global non-English film chart in debut week. The romantic drama surpasses German film 'Fall For Me' and the Hindi original 'Inspector Zende'.  Lead actors Ahaan Panday and Aneet Padda express gratitude for international audience support"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mirai-telugu-superhero-film-crosses-rs-100-crore-box-office-2788853-2025-09-17",
      "headline": "Mirai hits Rs 100 crore in six days, Teja Sajja-Manu Manoj celebrate milestoneTelugu superhero film 'Mirai' surpassed Rs 100 crore box office milestone in six days. Lead actors Teja Sajja and Manoj Manchu shared their gratitude for the achievement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/exclusive-has-the-bengal-files-locked-its-ott-deal-for-twice-its-budget-2788807-2025-09-17",
      "headline": "Exclusive: Has The Bengal Files locked its OTT deal for twice its budget?Director Vivek Agnihotri has sold the streaming rights for his political-thriller 'The Bengal Files' for twice its budget, according to reports. The film is based on Direct Action Day, 1946 and Noakhali riots."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/are-mirai-hanuman-and-folklore-films-creating-india-harry-potter-moment-2788690-2025-09-17",
      "headline": "Are Mirai, HanuMan and folklore films creating India's Harry Potter moment?The recent commercial hits from the Telugu film industry like 'Mirai', 'Mahavatar Narsimha', 'HanuMan' and 'Karthikeya 2' are slowly turning ancient texts and folklore into a new cinematic wave. Is their grand success the beginning of a new style of storytelling in Indian cinema? Does this also indicate that India's 'Harry Potter' moment has finally arrived? IndiaToday.in shares insights. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jr-ntr-hits-gym-for-prashanth-neels-film-intense-workout-video-goes-viral-2788761-2025-09-17",
      "headline": "Jr NTR hits gym for Prashanth Neel's film, intense workout video goes viralJr NTR's dedication to his craft is on full display as he sculpts a lean, defined physique for his upcoming collaboration with director Prashanth Neel, reportedly titled 'Dragon'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/malaika-arora-says-she-went-through-self-doubt-for-being-judged-over-boldness-2788821-2025-09-17",
      "headline": "Malaika Arora says she went through self doubt for being judged over her boldnessActor Malaika Arora recalled how she overcame public criticism by embracing her true self. She highlighted reclaiming her confidence despite going through self-doubt."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-shares-adorable-throwbacks-sweet-birthday-note-for-nick-jonas-2788695-2025-09-17",
      "headline": "Priyanka takes you through Nick Jonas' last 8 birthdays in romantic photo dumpPriyanka Chopra celebrated Nick Jonas's birthday with a heartfelt social media post, sharing unseen pictures and calling herself \"grateful to share life\" with him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/teja-sajja-mirai-stunning-rise-redefines-tollywoods-blockbuster-blueprint-2788795-2025-09-17",
      "headline": "Mirai's stunning rise redefines Tollywood's blockbuster blueprint. What's next?Tollywood is witnessing a significant shift as Teja Sajja's 'Mirai' breaks the traditional star system with its mythological fantasy and impressive VFX. This success signals a new era for Telugu cinema, where compelling stories rooted in Indian lore are becoming the real crowd-pullers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/homebound-trailer-neeraj-ghaywan-film-explores-caste-an-unlikely-friendship-2788823-2025-09-17",
      "headline": "Homebound trailer: Neeraj Ghaywan film speaks on caste divide, unlikely friendshipThe trailer of Neeraj Ghaywan's 'Homebound' is out. Starring Vishal Jethwa, Ishaan Khatter and Janhvi Kapoor, the film talks about friendship and caste system. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-nagma-mirajkar-denies-cheating-allegations-awez-darbar-2788675-2025-09-17",
      "headline": "Bigg Boss 19: Nagma Mirajkar reacts to rumours of Awez Darbar cheating on herAfter her elimination from 'Bigg Boss 19', influencer Nagma Mirajkar addressed the cheating allegations against her partner, Awez Darbar. She also reacted to Amaal Mallik's statement that the couple gets work because of him. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/sandiip-sikcand-criticises-amaal-mallik-prank-bigg-boss-19-2788774-2025-09-17",
      "headline": "BB 19: Sandiip Sikcand slams Amaal Mallik as dictator after prank causes chaosTelevision producer Sandiip Sikcand has publicly criticised Amaal Mallik for his involvement in a prank on Bigg Boss 19. Sikcand's comments have sparked discussion about leadership and behaviour within the show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aishwarya-rai-abhishek-bachchan-film-shelved-as-producer-was-wife-beater-director-prahlad-kakkar-2788793-2025-09-17",
      "headline": "Aishwarya-Abhishek film shelved as producer was wife-beater: Prahlad KakkarPrahlad Kakkar reveals why the film featuring Aishwarya Rai, Abhishek Bachchan, and Amitabh Bachchan was cancelled, sharing insights into the casting, production issues, and his long-standing association with Aishwarya Rai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anurag-kashyap-on-nishaanchi-not-sequel-or-launch-just-most-filmy-film-of-my-life-2788553-2025-09-17",
      "headline": "Anurag Kashyap on Nishaanchi: Not sequel or launch, just most filmy film of my lifeFrom rediscovering his filmy side in 'Nishaanchi' to mentoring fresh talent, Anurag Kashyap gets candid about cinema, crisis, and his uncompromising passion for filmmaking.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kavin-disappointing-performance-of-star-and-bloody-beggar-cannot-blame-audience-2788771-2025-09-17",
      "headline": "Actor Kavin discusses Bloody Beggar's disappointing run: Can't blame audienceTamil actor Kavin, in a recent interview, opened up about the disappointing performance of 'Star' and 'Bloody Beggar', his last two films. The actor also talked about the learnings from the films' performance in theatres."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kaun-banega-crorepati-17-amitabh-bachchan-moved-by-inspiring-ias-officer-ayushis-journey-2788756-2025-09-17",
      "headline": "KBC 17: Visually impaired IAS officer Ayushi's story leaves Big B emotionalIn the latest episode of 'Kuan Banega Crorepati 17', a visually-impaired contestant shared her inspiring journey. She also spoke about her mother's tireless support in raising her up. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kgf-and-salaar-composer-ravi-basrur-have-24tb-of-unused-music-2788720-2025-09-17",
      "headline": "KGF and Salaar composer Ravi Basrur: Have 24TB of unused musicRavi Basrur, the composer behind the powerful soundtracks of 'KGF' and 'Salaar', revealed that he created nearly 18 versions and about 24TB of unused music before arriving at the final scores for the three films."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/seth-rogen-the-studio-platonic-apple-tv-rose-byrne-2788194-2025-09-17",
      "headline": "Loved Seth Rogen in The Studio? You cannot miss Platonic on Apple TVWatched 'The Studio' and loved Seth Rogen's performance in it? You cannot skip 'Platonic' on Apple TV. The show is a beautiful representation of how a man and a woman can be \"just\" friends. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jolly-llb-3-advance-booking-day-1-latest-update-akshay-kumar-arshad-warsi-film-depends-heavily-on-word-on-mouth-2788691-2025-09-17",
      "headline": "Jolly LLB 3 advance booking: Akshay-Arshad's film depends heavily on word-on-mouth'Jolly LLB 3', starring Akshay Kumar and Arshad Warsi, opens with slow advance bookings but strong franchise goodwill. Check early box office collection, ticket sales, story highlights, and why spot bookings could turn the game."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/dipika-kakar-shares-health-update-opens-up-about-scary-hair-loss-amid-cancer-treatment-2788657-2025-09-17",
      "headline": "Dipika Kakar shares health update, opens up about scary hair loss amid treatmentTelevision actor Dipika Kakar, who is undergoing treatment for stage 2 liver cancer, shared that while she has adjusted to most side effects, severe hair fall continues to scare her."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/masood-azhar-jem-terrorist-implicated-delhi-mumbai-attacks-balakot-base-2788741-2025-09-17",
      "headline": "Masood Azhar behind Parliament attack, 26/11: Jaish leader's 2nd admission nails PakMasood Ilyas Kashmiri, a top Jaish commander, admitted in a video that Masood Azhar orchestrated deadly terror attacks in India from his base in Pakistan's Balakot, knocking Islamabad's denials of harbouring terror groups on its soil."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/coloured-candidate-photos-serial-numbers-on-evms-poll-body-issues-new-rules-beginning-with-bihar-2788874-2025-09-17",
      "headline": "Coloured candidate photos, serial numbers on EVMs: Poll body issues new rules, beginning with BiharColoured candidate photos, serial numbers on EVMs: Poll body issues new rules, beginning with Bihar"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/new-india-is-not-afraid-of-anyones-nuclear-threats-pm-cites-jaish-admitting-op-sindoor-losses-2788705-2025-09-17",
      "headline": "New India not afraid of nuclear threats: PM cites Jaish admitting Op Sindoor lossesPM Modi said the confession by a top Jaish commander of losses during Operation Sindoor was proof that New India not only responds firmly to terror but also fears no one's nuclear threats."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-athletics-championships-day-5-live-results-neeraj-arshad-animesh-kujur-2788748-2025-09-17",
      "headline": "Day 4 Live Updates: Neeraj, Weber, Wenger achieve direct qualificationWorld Athletics Championships Day 5 Live Updates: Neeraj Chopra qualifies for the final of the men's javelin event with his very first throw of the night. Sachin Yadav is still hunt for that magical 84.50m mark, which will help him qualify for the final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/the-lowdown/story/khalistan-movement-complex-journey-from-india-to-canada-the-lowdown-2788767-2025-09-17",
      "headline": "Khalistan Movement's Complex Journey From India to CanadaFrom its roots in colonial India to its deep entrenchment in Canada's Sikh diaspora, the Khalistan movement remains a complex and sensitive issue, marked by political tension, historical trauma, and transnational activism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-donald-trump-birthday-phone-call-social-media-narrative-india-us-ties-2788653-2025-09-17",
      "headline": "PM Modi got birthday call from Trump, but his post took the cakePM Modi, who turned 75 today, knows very well that Trump thrives on spectacle and loves dominating the news cycle. Thus, in a departure from the script, this time PM Modi beat Trump in posting about the call on social media."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/gaganpreet-kaur-accused-in-bmw-crash-that-killed-government-official-sent-to-judicial-custody-till-sept-27-2788812-2025-09-17",
      "headline": "DTC bus, ambulance also guilty: Delhi BMW crash accused to court; sent to jailDuring the hearing, Gaganpreet's lawyer argued that a DTC bus collided with the two-wheeler and that the ambulance that reportedly crossed by should also be named as the accused."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-narendra-modi-birthday-75-world-leaders-rare-video-messages-netanyahu-albanese-2788743-2025-09-17",
      "headline": "From Israel to Australia, leaders line up with rare video wishes for PMAs Prime Minister Narendra Modi celebrated his 75th birthday, a string of video messages from several world leaders flooded social media in a rare move."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/perimenopause-crippling-fatigue-weight-gain-mood-changes-low-hemoglobin-anemia-silent-struggles-menopause-2788610-2025-09-17",
      "headline": "Perimenopause: The silent midlife storm women quietly endureUnderstanding that perimenopause exists is the first point of change. It needs to be treated, managed, and nurtured by all — women, and especially their loved ones."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/the-80-gap-why-most-indians-are-underinsured-and-why-its-time-to-act-2787740-2025-09-15",
      "headline": "The 80% gap: Why most Indians are underinsured and why it's time to actThe solution lies in choosing a comprehensive life cover that reflects modern realities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/university-of-bath-school-of-management-where-careers-begin-with-confidence-2788009-2025-09-16",
      "headline": "University of Bath School of Management: Where Careers Begin With ConfidenceWith students from over 160 countries and a strong alumni network spanning 130 nations, the School creates a community that feels global in reach yet personal in experience. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/pappu-yadav-modi-purnea-airport-purnia-congress-mahagathbandhan-politics-strategy-seemanchal-bihar-2025-elections-2788575-2025-09-17",
      "headline": "Is this Yadav making a Pappu out of Congress?Purnia's Independent MP and Bihar strongman Pappu Yadav shared the stage with PM Modi. Yadav, who has vowed allegiance to Rahul Gandhi, might be making the most of his Independent status from both the NDA and the Mahagathbandhan. Is it his ploy to extract the most out of Congress ahead of the Bihar election?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aishwarya-rai-abhishek-bachchan-film-shelved-as-producer-was-wife-beater-director-prahlad-kakkar-2788793-2025-09-17",
      "headline": "Aishwarya-Abhishek film shelved as producer was wife-beater: Prahlad KakkarPrahlad Kakkar reveals why the film featuring Aishwarya Rai, Abhishek Bachchan, and Amitabh Bachchan was cancelled, sharing insights into the casting, production issues, and his long-standing association with Aishwarya Rai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjp-mumbai-chief-ameet-satam-khan-mayor-bmc-civic-elections-controversy-2788766-2025-09-17",
      "headline": "Don't let a Khan become mayor: BJP Mumbai chief's shocker ahead of pollsBJP's Ameet Satam made the controversial remarks at the Vijay Sankalp Melava, which was attended by Devendra Fadnavis and Union Minister Piyush Goyal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-75th-birthday-donald-trump-phone-call-social-media-post-tariff-trade-talks-russia-ukraine-war-2788680-2025-09-17",
      "headline": "Modi, Trump, message in 293 characters, and the unsaidAfter several missed calls from US President Donald Trump, he finally spoke to PM Narendra Modi on his 75th birthday, with both leaders calling each other \"my friend\". In just 293 characters, PM Modi managed to reaffirm Indo-US ties, signal India's balanced stance on Ukraine, and leave trade troubles unsaid."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/canada-news/story/india-canada-relations-khalistani-terrorist-group-sfj-threatens-siege-of-indian-consulate-in-vancouver-hardeep-singh-nijjar-2788781-2025-09-17",
      "headline": "Khalistanis threaten siege of Indian consulate in Canada over Nijjar killingUS-based Khalistani outfit Sikhs for Justice (SFJ) has announced a siege of the Indian Consulate in Vancouver, Canada, on September 18 over the killing of Hardeep Singh Nijjar. The terrorist group issued a poster showing the Indian High Commissioner to Canada as a marked man. These can reignite tensions in India-Canada ties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/gen-z-job-hopping-india-flexibility-growth-ethical-values-2788746-2025-09-17",
      "headline": "Why Gen Z can't stick to a job, and doesn't want toBlink and they're gone: Gen Z's office moves faster than your Wi-Fi. Work hard? Yes. Stay forever? Nah."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistans-fake-football-team-reaches-japan-for-tournament-deported-from-airport-2788802-2025-09-17",
      "headline": "Pakistan's fake football team reaches Japan for tournament, deported from airportAccording to FIA sources, the men travelled in full football gear, asserting links with the Pakistan Football Federation (PFF) and carrying forged no-objection certificates (NOCs) allegedly issued by the Ministry of Foreign Affairs.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/who-is-siddharth-jain-indias-first-business-leader-with-a-tesla-ev-cars-elon-musk-2788811-2025-09-17",
      "headline": "Who is Siddharth Jain, India's first business leader with a Tesla?Siddharth Jain, Executive Director of Inox Group, has become the first Indian business leader to own a Tesla, calling it a dream come true after waiting since his 2017 visit to the Tesla Fremont factory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/from-the-india-today-archives-2014-the-man-behind-narendra-modi-2788258-2025-09-16",
      "headline": "From the India Today archives (2014) | The man behind Narendra ModiNarendra Modi turning 75 is also time to remember Lakshmanrao Inamdar, the RSS veteran who perhaps had the most profound impact on the prime minister's early years"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/chennai-woman-chat-with-indigo-airhostess-is-about-life-little-things-video-viral-2788613-2025-09-17",
      "headline": "Chennai woman's chat with IndiGo airhostess is about life's little things. Video viralA Chennai woman's video of a heartwarming conversation with an IndiGo airhostess has gone viral, with social media users calling it the \"best thing\" online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bihar-purnea-narendra-modi-airport-hawai-chappal-udan-rcs-scheme-regional-connectivity-purnia-kolkata-flight-makhana-2788772-2025-09-17",
      "headline": "Hawai chappal at 25,000 feet: Munna takes hawai jahaj to KolkataAfter Prime Minister Narendra Modi inaugurated the airport in Bihar's Purnea, a meme showing a person in hawai chappal on a flight to Kolkata was widely shared on social media. \"Hawai chappal waley bhi hawai jahaj mei udega,\" said Modi in 2016. Beyond the reels and fun, the new airport under the UDAN scheme will boost regional connectivity, opportunities and a potential boom in makhana trade for eastern Bihar and beyond."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/on-75th-birthday-pm-modis-signature-outfit-shines-with-a-touch-of-madhya-pradesh-2788775-2025-09-17",
      "headline": "On 75th birthday, PM Modi's signature outfit shines with a touch of Madhya PradeshOn stage, Prime Minister Modi was presented with a traditional pink headgear (pagdi) along with a jacket that featured Lambani embroidery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/pm-modi-childhood-film-to-be-screened-in-schools-ministry-issues-directive-2788810-2025-09-17",
      "headline": "PM Modi childhood film to be screened in schools, ministry issues directiveThe Ministry of Education has directed CBSE, KVS, and NVS schools to screen Chalo Jeete Hain, a film inspired by Prime Minister Narendra Modi's childhood. The initiative is part of the Prerana experiential learning programme, promoting values, character, and social-emotional learning amongst students nationwide.\r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-vs-uae-asia-cup-2025-match-september-17-referee-uncertainty-2788861-2025-09-17",
      "headline": "Pakistan team informed UAE match will go ahead, but referee uncertainty remainsPakistan's Asia Cup 2025 match on September 17 will proceed as planned in Dubai. However, the identity of the official match referee remains uncertain, raising questions ahead of the Group A clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/neeraj-chopra-qualifies-men-javelin-final-world-athletics-championships-2788836-2025-09-17",
      "headline": "One and done: Neeraj Chopra qualifies for World Championships final in first attemptIndia's javelin superstar Neeraj Chopra made a powerful start to his World Championships title defence, securing qualification for the men's javelin final with just a single throw."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-record-hundred-india-women-vs-australia-women-fastest-2788830-2025-09-17",
      "headline": "Mandhana scripts double history with second fastest ODI hundred for India WomenINDW vs AUSW, 2nd ODI: Smriti Mandhana set multiple records after scoring her 12th ODI hundred in the second game of the three-match series against Australia on Wednesday, September 17 in Mullanpur. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/video/world-athletics-championships-neeraj-chopra-javelin-preview-toughest-test-2788826-2025-09-17",
      "headline": "Neeraj Chopra gears up for toughest test at World Athletics ChampionshipsNeeraj Chopra begins his World Athletics Championships 2025 title defence in the men's javelin throw qualifiers. His challenge includes rivals Arshad Nadeem, Julian Weber, Anderson Peters and Olympic champion Keshorn Walcott."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/varun-chakravarthy-no1-t20i-rankings-asia-cup-india-vs-oman-2788768-2025-09-17",
      "headline": "Varun Chakravarthy storms to No.1 T20I ranking ahead of Asia Cup clash vs OmanVarun Chakravarthy stormed to the top spot in the men's T20I rankings ahead of India's final Asia Cup group-stage match against Oman."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jemimah-rodrigues-ruled-out-odi-series-viral-fever-india-australia-world-cup-2788747-2025-09-17",
      "headline": "Jemimah ruled out of Australia ODIs, adds to India's concerns before World CupJemimah Rodrigues has been ruled out of the ongoing ODI series against Australia due to viral fever, adding to India's worries before the Women's World Cup to start on September 30."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/china-masters-satwik-chirag-shetty-round-one-result-2788738-2025-09-17",
      "headline": "Twice in 5 days: Sat-Chi hammer Arif-Yap, storm into Round 2 of China MastersIndia's Satwiksairaj Rankireddy and Chirag Shetty hammered Malaysia's Junaidi Arif and Roy King Yap to reach the second round of the China Masters. This was Sat-Chi's second win against the duo inside one week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-athletics-championships-day-5-live-results-neeraj-arshad-animesh-kujur-2788748-2025-09-17",
      "headline": "Day 4 Live Updates: Neeraj, Weber qualify for finalWorld Athletics Championships Day 5 Live Updates: Neeraj Chopra qualifies for the final of the men's javelin event with his very first throw of the night. Sachin Yadav is still hunt for that magical 84.50m mark, which will help him qualify for the final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/viswanathan-anand-bumps-r-viashali-chennai-airport-grand-swiss-chess-funny-post-2788725-2025-09-17",
      "headline": "Random bump 2.0: Viswanathan Anand welcomes back R Vaishali after Grand Swiss winViswanathan Anand bumped into R Vaishali, the two-time Grand Swiss winner, which sparked a fun social media post from the former. Viashali retruned home after defending her Grand Sweiss crown."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-michael-bracewell-captain-mitchell-santner-injury-chappell-hadlee-t20i-series-2788678-2025-09-17",
      "headline": "Santner ruled out, Jamieson returns in New Zealand squad for Australia T20IsNZ vs AUS T20I series: Mitchell Santner has been ruled out of the Chappell-Hadlee T20I series against Australia after abdominal surgery, with Michael Bracewell stepping in as captain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/china-masters-satwik-chirag-shetty-round-one-result-2788738-2025-09-17",
      "headline": "Twice in 5 days: Sat-Chi hammer Arif-Yap, storm into Round 2 of China MastersIndia's Satwiksairaj Rankireddy and Chirag Shetty hammered Malaysia's Junaidi Arif and Roy King Yap to reach the second round of the China Masters. This was Sat-Chi's second win against the duo inside one week."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-athletics-championships-day-5-live-results-neeraj-arshad-animesh-kujur-2788748-2025-09-17",
      "headline": "Day 4 Live Updates: Neeraj, Weber qualify for finalWorld Athletics Championships Day 5 Live Updates: Neeraj Chopra qualifies for the final of the men's javelin event with his very first throw of the night. Sachin Yadav is still hunt for that magical 84.50m mark, which will help him qualify for the final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/viswanathan-anand-bumps-r-viashali-chennai-airport-grand-swiss-chess-funny-post-2788725-2025-09-17",
      "headline": "Random bump 2.0: Viswanathan Anand welcomes back R Vaishali after Grand Swiss winViswanathan Anand bumped into R Vaishali, the two-time Grand Swiss winner, which sparked a fun social media post from the former. Viashali retruned home after defending her Grand Sweiss crown."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-michael-bracewell-captain-mitchell-santner-injury-chappell-hadlee-t20i-series-2788678-2025-09-17",
      "headline": "Santner ruled out, Jamieson returns in New Zealand squad for Australia T20IsNZ vs AUS T20I series: Mitchell Santner has been ruled out of the Chappell-Hadlee T20I series against Australia after abdominal surgery, with Michael Bracewell stepping in as captain."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}