{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/this-is-how-new-income-tax-bill-2025-brings-relief-for-salaried-and-small-taxpayers-2775991-2025-08-24",
      "headline": "How new Income Tax Bill 2025 brings relief for salaried and small taxpayersEndless forms and confusing jargon may soon be history. The New Income Tax Bill 2025 could be the game-changer salaried and small taxpayers have been waiting for."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/term-insurance-policy-duration-30-40-years-waste-money-how-to-choose-financial-planning-personal-savings-2775908-2025-08-24",
      "headline": "The hidden catch in 40-year term insurance policies and how to choose betterBuying a 40-year term insurance policy is like paying rent for a house you'll never live in that long. It feels safe, but often it's money that could be better used elsewhere. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-federal-reserve-chair-jerome-powell-signals-possible-september-rate-cut-cites-rising-job-market-risks-2775428-2025-08-22",
      "headline": "US Fed chair signals possible September rate cut, cites rising job market risksUS Federal Reserve Chair Jerome Powell's comments open the door to a rate cut at the Fed's September 16-17 meeting, but also put heavy weight on jobs and inflation reports that will be received before then."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/schengen-visa-price-hike-europe-trip-plan-costly-rise-hike-upset-trip-budget-2775365-2025-08-22",
      "headline": "Planning Europe trip? Schengen visa hike may upset your trip budgetThe Schengen visa allows travellers to visit 29 European countries for up to 90 days within a 180-day period. Applicants must submit standard documents, including travel plans, insurance, and financial proof."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/avadhut-sathe-sebi-raid-pune-finfluencer-karjat-trading-academy-2775356-2025-08-22",
      "headline": "Sebi strikes at finfluencer Avadhut Sathe's Karjat Trading AcademyThe action followed complaints that penny stocks were being promoted during his training sessions, allegedly presented as classroom examples while encouraging students to invest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/which-bank-offers-higher-1-year-fd-see-rates-from-hdfc-icici-sbi-and-3-others-2775342-2025-08-22",
      "headline": "Which bank offers higher 1-year FD? See rates from HDFC, ICICI, SBI and 3 othersMost lenders usually announce similar interest rates on one-year deposits, making it seem as if there isn't much of a difference in where you invest. However, a closer look at the latest rates reveals small but meaningful variations. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-694-points-lower-nifty-below-25000-asian-paints-down-2-percent-2775268-2025-08-22",
      "headline": "Sensex closes 694 points lower, Nifty below 25,000; Asian Paints down 2%The S&P BSE Sensex closed 694 points lower at 81.306.85 points, while the NSE Nifty50 declined by 213.65 points to end at 24,870.10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/this-investor-cut-his-rs-10-lakh-tax-bill-to-0-heres-the-trick-2775257-2025-08-22",
      "headline": "This investor cut his Rs 10 lakh tax bill to 0. Here's howMany taxpayers assume that once the financial year ends, their chance to save tax is gone.and Ramesh was no exception. But instead of rushing, he used a little-known route that brought his tax bill down to nothing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/upcoming-ipos-vikran-engineering-anlon-healthcare-market-listings-gmp-patel-vikram-solar-gem-shreeji-2775259-2025-08-22",
      "headline": "Dalal Street gears up for busy week with 5 market debuts, 2 IPOs in pipelineMangal Electrical Industries is set to debut on August 28 after finalising its allotment on August 25. Patel Retail, Vikram Solar, Gem Aromatics, and Shreeji Shipping Global will all list on August 26."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wealthy-asian-families-bet-big-on-crypto-report-2775211-2025-08-22",
      "headline": "Wealthy Asian families bet big on crypto: ReportThe growing interest comes as Bitcoin recently hit an all-time high of over $124,000. New rules, such as Hong Kong's stablecoin legislation and the United States' GENIUS Act, have further boosted confidence in the sector."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/money-based-gaming-ban-rocks-advertising-sports-sponsorships-whats-at-stake-2775202-2025-08-22",
      "headline": "Real-money gaming ban rocks advertising, sports sponsorships: What's at stake?The rise of money-based platforms created billions in advertising spend, now facing a sudden halt. This article examines how the ban on real-money gaming is reshaping India's advertising, sports sponsorships, and emerging e-sports opportunities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/cibil-credit-score-rating-how-to-improve-loans-emis-transparent-trans-union-personal-finance-2775191-2025-08-22",
      "headline": "Credit score confusion: Is CIBIL transparent enough in deciding your financial fate?The credit score by CIBIL can decide whether someone gets a car loan, a home loan, or even a credit card. Yet, very few actually know how CIBIL works or who controls it."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tannishtha-chatterjee-opens-up-on-cancer-battle-2776168-2025-08-24",
      "headline": "Tannishtha Chatterjee on cancer battle: It can't get worse than thisReflecting on her responsibilities, Tannishtha Chatterjee spoke about the difficulties of being a single mother while also caring for her own mother."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/who-is-tanya-mittal-bigg-boss-19-contestant-2776165-2025-08-24",
      "headline": "Who is Tanya Mittal, the Bigg Boss 19 contestant with 2.5 million Insta followers?Bigg Boss 19 welcomes a fresh line-up of contestants, including Tanya Mittal, a social media influencer who first went viral during the Maha Kumbh and later gained attention for speaking out on the Pahalgam attack."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tina-ahuja-breaks-silence-on-govinda-sunita-divorce-rumours-calls-them-baseless-2776134-2025-08-24",
      "headline": "Tina Ahuja breaks silence on Govinda-Sunita divorce rumours, calls them baselessAmid speculation surrounding Govinda and Sunita Ahuja's marriage, their daughter Tina Ahuja has spoken out, dismissing the separation rumours as unfounded. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shraddha-kapoor-urges-linkedin-to-fix-account-flagged-fake-2776067-2025-08-24",
      "headline": "Shraddha Kapoor urges LinkedIn to fix her account flagged as fakeActor Shraddha Kapoor shared that she set up a LinkedIn account to document her journey as an entrepreneur, but hasn't been able to make use of it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-season-19-grand-premiere-live-updates-salman-khan-contestants-list-jiohotstar-2775950-2025-08-24",
      "headline": "Bigg Boss 19 grand premiere: Gaurav Khanna enters BB house with Natalia JanoszekBigg Boss 19 Live: The wait is finally over as the much-anticipated season of Bigg Boss kicks off in just a few hours! With Salman Khan returning as host, fans can look forward to his signature wit, charm, and high-energy presence. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mini-mathur-slams-paparazzi-kajol-body-shaming-video-how-dare-you-2776013-2025-08-24",
      "headline": "Mini Mathur slams paparazzi for zooming in on Kajol's body: How dare youActor Mini Mathur defended fellow actor Kajol after a video body-shaming the actor surfaced online. She slammed the paparazzo for zooming in on Kajol's body. In the comments, Mathur wrote that Kajol doesn't owe them eternal youth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karan-johar-son-yash-nepo-baby-tshirt-priyanka-chopra-kareena-kapoor-react-2775995-2025-08-24",
      "headline": "Karan Johar's 'nepo baby' Yash refuses to be launched. Priyanka, Kareena reactA recent video of filmmaker Karan Johar's son Yash in a 'nepo baby' T-shirt has stirred up social media. His son can be seen saying in the video that he does not want to be launched. Several celebrities, including Priyanka Chopra, Kareena Kapoor and Ananya Panday, amongst others, reacted to the video. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/manish-malhotra-gustaakh-ishq-vijay-varma-fatima-sana-shaikh-november-release-debut-film-producer-first-glimpse-2775972-2025-08-24",
      "headline": "Manish Malhotra's Gustaakh Ishq with Vijay Varma and Fatima to release in NovemberFashion designer Manish Malhotra announced his first film as a producer on Sunday. Titled 'Gustaakh Ishq', the film stars Vijay Varma and Fatima Sana Shaikh in the lead roles. Slated for a November release this year, the first glimpse of the film will be out on Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/suniel-shetty-sanjay-dutt-nostalgia-the-great-indian-kapil-show-kapil-sharma-krushna-abhishek-kiku-sharda-2775956-2025-08-24",
      "headline": "Suniel Shetty, Sanjay Dutt to spark nostalgia on Great Indian Kapil Show. PicsActors Suniel Shetty and Sanjay Dutt recently shot for an episode of 'The Great Indian Kapil Show.' The actors not only reminisced about the good old days but also gave an insight into their strong friendship."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/govinda-manager-addresses-divorce-rumours-sunita-ahuja-everything-is-getting-settled-2775955-2025-08-24",
      "headline": "Govinda's manager addresses divorce rumours: Everything is getting settledGovinda's manager and lawyer have addressed new rumours about the actor and Sunita Ahuja's divorce. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kartik-aaryan-checks-off-bucket-list-attends-coldplays-london-concert-viral-video-2775909-2025-08-24",
      "headline": "Kartik Aaryan checks off bucket list as he attends Coldplay's London concert. WatchKartik Aryan's London trip just turned special after he attended the Coldplay concert. The actor shared a video from the grand event at Wembley Stadium and expressed his joy. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-team-backtracks-amid-confusion-over-actor-malaysia-meet-and-greet-event-coolie-2775905-2025-08-24",
      "headline": "Rajinikanth's team backtracks amid confusion over actor's meet and greet eventAfter Rajinikanth's team claimed that actor's Malaysia's meet and greet event as fake, they backtracked. This came after the organisers issued a statement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/mughal-e-azam-epic-clash-celebrating-indias-composite-culture-dilip-kumar-madhubala-2775610-2025-08-24",
      "headline": "Mughal-e-Azam: Epic clash celebrating India's composite cultureMughal-e-Azam remains an immortal cinematic masterpiece, blending epic father-son conflict, timeless romance, and iconic music with grand visuals that celebrate India's composite culture. Its powerful performances, unforgettable dialogues, and cultural resonance ensure its enduring legacy across generations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karan-johar-slams-podcasters-inviting-guests-disrespect-film-industr-lengthy-note-2775893-2025-08-24",
      "headline": "KJo slams podcasters inviting guests who disrespect film industry: Needs to stopKaran Johar shared a note criticising podcasters who, he said, invite guests to speak negatively about the 'hardworking' members of the film fraternity. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/emily-in-paris-assistant-director-diego-borella-dies-47-filming-italy-2775803-2025-08-23",
      "headline": "Emily in Paris assistant director dies at 47 while filming in ItalyDiego Borella, the Assistant Director of 'Emily in Paris', died on August 22, while working on the fifth season of the series in Venice, Italy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-mother-in-law-shows-off-dance-moves-fans-praise-her-confidence-2775782-2025-08-23",
      "headline": "SRK's mother-in-law shows-off dance moves, fans praise her confidence. WatchActor Shah Rukh Khan's mother-in-law was captured dancing with her son in a viral video. Fans says, now they understand where Gauri gets her confidence from."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-trial-2-trailer-kajol-jisshu-sengupta-tense-battle-takes-centre-stage-2775738-2025-08-23",
      "headline": "The Trial 2 trailer: Kajol and Jisshu Sengupta's marital battle takes centre stageActor Kajol returns with Season 2 of 'The Trial: Pyaar, Kanoon, Dhokha' on JioHotstar. The trailer teases more twists, courtroom clashes, and political intrigue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-bads-of-bollywood-lakshya-lalwani-sahher-bambba-chemistry-shines-in-badli-si-hawa-track-2775720-2025-08-23",
      "headline": "The Ba***ds of Bollywood: Lakshya, Sahher's chemistry shines in Badli Si Hawa trackThe first song from Aryan Khan's upcoming release 'The Ba***ds of Bollywood' is out. Titled 'Badli Si Hawa', the track highlights the chemistry between Lakshya and Sahher Bambba. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/daisy-shah-says-ex-partner-objected-to-her-working-with-male-co-stars-2775709-2025-08-23",
      "headline": "Daisy Shah says ex-partner objected to her working with male co-starsActor Daisy Shah recently spoke about having been in two relationships with toxic men. Here's what she shared."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/victims-mother-in-law-arrested-in-greater-noida-dowry-death-case-hours-after-accused-shot-in-police-encounter-2776110-2025-08-24",
      "headline": "UP dowry death: Mother-in-law arrested, victim's husband sent to 14-day custodyPolice in Greater Noida arrested Nikki Bhati's mother-in-law hours after her husband Vipin Bhati, accused of killing her over dowry, was shot while fleeing custody. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rss-coordination-meet-in-jodhpur-in-september-mohan-bhagwat-to-attend-new-bjp-chiefs-name-likely-to-be-discussed-2776128-2025-08-24",
      "headline": "New BJP chief to be finalised? Key 3-day RSS meet in Jodhpur next monthThe high-profile meeting will be attended by RSS chief Mohan Bhagwat, General Secretary Dattatreya Hosabale, the Sah Sarkaryavahs (joint general secretaries) and all members of the RSS National Executive committee, including the coordinators."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/video-youtuber-swept-away-while-filming-reels-at-waterfall-in-odisha-2776148-2025-08-24",
      "headline": "Caught on camera: YouTuber swept away while filming reels at waterfall in OdishaSagar Tudu, a YouTuber, was filming videos for his channel at Dduma Waterfall in Koraput when he was swept away by a strong current."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israeli-airstrikes-hit-multiple-areas-of-yemens-capital-sanaa-targeting-iran-backed-houthis-news-agency-ap-2776135-2025-08-24",
      "headline": "Videos: Israel strikes Houthi-held Sanaa; targets presidential palace, gas stationDays after Houthis fired a missile towards Israel, the Jewish nation launched airstrikes on Yemen's capital Sanaa, targeting the Iran-backed rebels and striking energy infrastructure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/real-money-gaming-blanket-ban-real-promotion-regulation-of-online-gaming-bill-2025-employment-lakhs-revenue-2775531-2025-08-24",
      "headline": "Jobless overnight, but families to feed: The human cost of India's gaming banThe ban on real-money online gaming is upending real lives. Thousands of professionals are desperately looking for jobs as their companies hit the dead end. The sector also sustained people earning from games of skills, like millions in India do from the stock market. This is the untold story of how the government's blanket ban on real money gaming platforms has hit lakhs of people."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-season-19-grand-premiere-live-updates-salman-khan-contestants-list-jiohotstar-2775950-2025-08-24",
      "headline": "Bigg Boss 19 grand premiere: Gaurav Khanna enters BB house with Natalia JanoszekBigg Boss 19 Live: The wait is finally over as the much-anticipated season of Bigg Boss kicks off in just a few hours! With Salman Khan returning as host, fans can look forward to his signature wit, charm, and high-energy presence. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jacob-joseph-from-kerala-forged-the-signatures-of-members-of-parliament-to-submit-nomination-without-their-knowledge-2776145-2025-08-24",
      "headline": "Kerala man forges signatures of MPs to file Vice President nomination, rejectedJacob Joseph's nomination carried the names and signatures of 22 proposers and 22 supporters, all Members of Parliament from the Lok Sabha and Rajya Sabha. The nomination was rejected after it was discovered that the names and signatures were included without the knowledge of the concerned MPs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-the-supreme-court-revised-its-stray-dog-judgment-2776050-2025-08-24",
      "headline": "How the Supreme Court revised its stray dog judgmentIn an interim order, a three-judge bench directed only \"aggressive dogs\" to be held back from the streets, while coming down hard on the street-feeding of dogs.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/hanuman-or-neil-armstrong-first-space-traveller-hamirpur-mp-anurg-thakur-bjp-himachal-answer-exposes-double-rot-2776124-2025-08-24",
      "headline": "Hanuman or Neil Armstrong? First space traveller answer exposes double rotBJP MP Anurag Thakur's interaction with students, where he suggested \"Hanumanji was the first man in space\", is problematic on multiple counts. The children said it was Neil Armstrong, and not Yuri Gagrin, who travelled to space first. The double rot is that the students were unaware of a basic fact while a parliamentarian was presenting mythology as history on National Space Day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/thrashed-by-bricks-rods-varanasi-teacher-killed-over-parking-dispute-3-arrested-2776163-2025-08-24",
      "headline": "Thrashed by bricks and rods: UP teacher killed over parking dispute, 3 arrestedThe victim, Praveen Jha, a teacher at a prominent private school in Varanasi, was attacked with bricks and iron rods by three men, including his neighbour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cheteshwar-pujara-reveals-retirement-decision-india-test-2776083-2025-08-24",
      "headline": "Was thinking about retirement for just a week: Cheteshwar Pujara breaks silenceCheteshwar Pujara broke his silence on his decision to retire from all formats of the game. Pujara decided to call time on his career on Sunday, August 24 after playing 103 Tests. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/ukraine-on-its-independence-day-launched-a-drone-attack-on-russia-strikes-nuclear-plant-amid-peace-talks-2776109-2025-08-24",
      "headline": "On Ukraine's Independence Day, Kyiv strikes Russian nuke plant amid peace talksDespite talk of peace by Russia and Ukraine, the deadliest European war since World War Two is continuing along the 2,000 km (1,250 mile) front line accompanied by missile and drone attacks deep into both Russia and Ukraine."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/man-kisses-hug-rahul-gandhi-on-bike-during-voter-adhikar-yatra-2776044-2025-08-24",
      "headline": "Video: Man kisses Rahul Gandhi on bike during Bihar rally; gets slapped by guardThe incident took place as the Lok Sabha Opposition leader, along with RJD leader Tejashwi Yadav, was leading a motorcycle rally as part of the yatra."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/this-is-how-new-income-tax-bill-2025-brings-relief-for-salaried-and-small-taxpayers-2775991-2025-08-24",
      "headline": "How new Income Tax Bill 2025 brings relief for salaried and small taxpayersEndless forms and confusing jargon may soon be history. The New Income Tax Bill 2025 could be the game-changer salaried and small taxpayers have been waiting for."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rahul-gandhi-tejashwi-yadav-bihar-india-bloc-chirag-paswan-marriage-remark-voter-adhikar-yatra-2776020-2025-08-24",
      "headline": "Tejashwi Yadav advises Chirag Paswan to marry, Rahul quips 'applies to me too'Rahul Gandhi and Tejashwi Yadav shared a light-hearted banter on marriage during a joint presser in Araria, while affirming INDIA bloc unity ahead of Bihar polls and slamming the Election Commission for allegedly aiding BJP. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/no-ayushman-bharat-services-till-all-dues-cleared-haryana-doctors-continue-strike-2776105-2025-08-24",
      "headline": "No Ayushman Bharat services till all dues cleared: Haryana doctors continue strikePrivate hospitals across the state, including those in Panipat, have been on strike since August 7, halting treatment under Ayushmat Bharat scheme over unpaid dues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/mughal-e-azam-epic-clash-celebrating-indias-composite-culture-dilip-kumar-madhubala-2775610-2025-08-24",
      "headline": "Mughal-e-Azam: Epic clash celebrating India's composite cultureMughal-e-Azam remains an immortal cinematic masterpiece, blending epic father-son conflict, timeless romance, and iconic music with grand visuals that celebrate India's composite culture. Its powerful performances, unforgettable dialogues, and cultural resonance ensure its enduring legacy across generations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-quiz-516-22-08-2025",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rajnath-singh-meets-kishtwar-cloudburst-victims-pm-modi-concerned-2776066-2025-08-24",
      "headline": "PM very concerned: Rajnath Singh meets people injured in Kishtwar cloudburstDefence Minister Rajnath Singh visited Jammu's Government Medical College Hospital to meet victims of the Kishtwar cloudburst. He said PM Modi is closely monitoring the situation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-the-kishtwar-tragedy-is-a-wake-up-call-2776027-2025-08-24",
      "headline": "Why the Kishtwar tragedy is a wake-up callThe recent flash flood in J&K is an urgent reminder of the need to address the impacts of climate change on fragile ecosystems in the mountains.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/renault-kiger-facelift-launched-at-rs-629-lakh-with-fresh-design-upgrades-2776099-2025-08-24",
      "headline": "Renault Kiger facelift launched at Rs 6.29 lakh with fresh design, upgradesThe Renault Kiger facelift debuts in India at Rs 6.29 lakh, featuring refreshed styling and added features strengthening its appeal in the competitive compact SUV segment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-carlos-alcaraz-jannik-sinner-no1-ranking-2776155-2025-08-24",
      "headline": "Carlos Alcaraz can reclaim No.1 ranking from Jannik Sinner. Here's howCarlos Alcaraz has a strong chance to reclaim the ATP No.1 ranking after the US Open 2025, with a title or deep run enough to overtake Jannik Sinner. Alcaraz had held the top spot in the rankings back in 2022 as a 19-year-old. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2025-day-1-updates-aryna-sabalenka-novak-djokovic-2776140-2025-08-24",
      "headline": "Day 1 LIVE: Shelton takes 1st set, Raducanu breezes past ShibaharaUS Open 2025 Day 1 Live Updates: Ben Shelton has taken the lead in his match against Ignacio Buse. Shelton won the first set 6-3. Emma Raducanu clinched an easy win against Japan's Ena Shibahara at the Louis Armstrong Stadium. Next up we have Ben Shelton facing off against Buse. Later in the day, Aryna Sabalenka, Novak Djokovic, and Jessica Pegula will be in action. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tina-ahuja-breaks-silence-on-govinda-sunita-divorce-rumours-calls-them-baseless-2776134-2025-08-24",
      "headline": "Tina Ahuja breaks silence on Govinda-Sunita divorce rumours, calls them baselessAmid speculation surrounding Govinda and Sunita Ahuja's marriage, their daughter Tina Ahuja has spoken out, dismissing the separation rumours as unfounded. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tannishtha-chatterjee-opens-up-on-cancer-battle-2776168-2025-08-24",
      "headline": "Tannishtha Chatterjee on cancer battle: It can't get worse than thisReflecting on her responsibilities, Tannishtha Chatterjee spoke about the difficulties of being a single mother while also caring for her own mother."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/tina-ahuja-breaks-silence-on-govinda-sunita-divorce-rumours-calls-them-baseless-2776134-2025-08-24",
      "headline": "Tina Ahuja breaks silence on Govinda-Sunita divorce rumours, calls them baselessAmid speculation surrounding Govinda and Sunita Ahuja's marriage, their daughter Tina Ahuja has spoken out, dismissing the separation rumours as unfounded. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shraddha-kapoor-urges-linkedin-to-fix-account-flagged-fake-2776067-2025-08-24",
      "headline": "Shraddha Kapoor urges LinkedIn to fix her account flagged as fakeActor Shraddha Kapoor shared that she set up a LinkedIn account to document her journey as an entrepreneur, but hasn't been able to make use of it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mini-mathur-slams-paparazzi-kajol-body-shaming-video-how-dare-you-2776013-2025-08-24",
      "headline": "Mini Mathur slams paparazzi for zooming in on Kajol's body: How dare youActor Mini Mathur defended fellow actor Kajol after a video body-shaming the actor surfaced online. She slammed the paparazzo for zooming in on Kajol's body. In the comments, Mathur wrote that Kajol doesn't owe them eternal youth. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-carlos-alcaraz-jannik-sinner-no1-ranking-2776155-2025-08-24",
      "headline": "Carlos Alcaraz can reclaim No.1 ranking from Jannik Sinner. Here's howCarlos Alcaraz has a strong chance to reclaim the ATP No.1 ranking after the US Open 2025, with a title or deep run enough to overtake Jannik Sinner. Alcaraz had held the top spot in the rankings back in 2022 as a 19-year-old. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/northeast-united-fc-durand-cup-double-rise-diamond-harbour-fc-underdogs-to-giants-2776154-2025-08-24",
      "headline": "From underdogs to giants: NorthEast United's stunning rise with Durand Cup doubleNorthEast United FC's 6-1 Durand Cup final demolition of Diamond Harbour marked a historic back-to-back triumph, cementing their rise from underdogs to Indian football heavyweights with swagger, collective brilliance, and a vision for long-term dominance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/kabaddi-bengaluru-bulls-pkl-season-12-squad-preview-bc-ramesh-2776146-2025-08-24",
      "headline": "PKL Season 12: Bengaluru Bulls aim to reclaim lost glory under new visionWith a new coach at the helm, Bengaluru Bulls will look to bounce back and recapture their lost glory in season 12 of the Pro Kabaddi League. Here's a look at the Bulls' squad, their strengths and weaknesses heading into the new campaign. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/us-open-2025-day-1-updates-aryna-sabalenka-novak-djokovic-2776140-2025-08-24",
      "headline": "Day 1 LIVE: Shelton takes 1st set, Raducanu breezes past ShibaharaUS Open 2025 Day 1 Live Updates: Ben Shelton has taken the lead in his match against Ignacio Buse. Shelton won the first set 6-3. Emma Raducanu clinched an easy win against Japan's Ena Shibahara at the Louis Armstrong Stadium. Next up we have Ben Shelton facing off against Buse. Later in the day, Aryna Sabalenka, Novak Djokovic, and Jessica Pegula will be in action. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/india-vs-bhutan-u17-saff-womens-championship-anushka-kumari-hattrick-2776123-2025-08-24",
      "headline": "Anuskha Kumari hat-trick leads India to 8–0 win over Bhutan in SAFF U17\fAnuskha Kumari's sensational hat-trick powered India to an 8–0 demolition of hosts Bhutan in the SAFF U17 Women's Championships, sealing a third straight win as the Young Tigresses edged closer to the title with 17 unanswered goals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sourav-ganguly-pretoria-capitals-head-coach-sa20-2026-2776114-2025-08-24",
      "headline": "Sourav Ganguly takes on 1st coaching role, named as Pretoria Capitals head coachSourav Gangluy is all set to embark on a new chapter as he has been appointed as the head coach of the Pretoria Capitals ahead of the SA20 2026 season. This will be the first time Ganguly will take on a coaching role. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cheteshwar-pujara-reveals-retirement-decision-india-test-2776083-2025-08-24",
      "headline": "Was thinking about retirement for just a week: Cheteshwar Pujara breaks silenceCheteshwar Pujara broke his silence on his decision to retire from all formats of the game. Pujara decided to call time on his career on Sunday, August 24 after playing 103 Tests. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/cheteshwar-pujara-india-retirement-new-test-era-safe-hands-exclusive-2776079-2025-08-24",
      "headline": "Pujara backs India Test team's new era post-retirement: Future in safe handsCheteshwar Pujara, after bidding farewell to international cricket, voiced his confidence in India's next generation of Test cricketers. Speaking exclusively to AajTak, he backed the new leadership to guide the team toward sustained success in the coming years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-south-africa-cooper-connolly-3rd-odi-record-2776071-2025-08-24",
      "headline": "Cooper Connolly breaks 20-year-old record with historic spell in 3rd ODICooper Connolly produced record-breaking figures of 6-0-22-5, the best ever by an Australian spinner in men's ODIs, to set up a crushing 276-run win in Mackay. Australia's 431/2, powered by Travis Head, Mitchell Marsh and Cameron Green, handed South Africa their heaviest ODI defeat.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/raja-jackson-attacks-pro-wrestler-california-event-rampage-jackson-response-2776062-2025-08-24",
      "headline": "Watch: UFC legend Rampage Jackson's son brutally assaults pro-wrestler at eventRaja Jackson, son of Quinton \"Rampage\" Jackson, attacked wrestler Syko Stu, aka Stuart Smith, at a Knokx Pro Wrestling event in California. Rampage later apologised, calling it a work gone wrong."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sourav-ganguly-pretoria-capitals-head-coach-sa20-2026-2776114-2025-08-24",
      "headline": "Sourav Ganguly takes on 1st coaching role, named as Pretoria Capitals head coachSourav Gangluy is all set to embark on a new chapter as he has been appointed as the head coach of the Pretoria Capitals ahead of the SA20 2026 season. This will be the first time Ganguly will take on a coaching role. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cheteshwar-pujara-reveals-retirement-decision-india-test-2776083-2025-08-24",
      "headline": "Was thinking about retirement for just a week: Cheteshwar Pujara breaks silenceCheteshwar Pujara broke his silence on his decision to retire from all formats of the game. Pujara decided to call time on his career on Sunday, August 24 after playing 103 Tests. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/cheteshwar-pujara-india-retirement-new-test-era-safe-hands-exclusive-2776079-2025-08-24",
      "headline": "Pujara backs India Test team's new era post-retirement: Future in safe handsCheteshwar Pujara, after bidding farewell to international cricket, voiced his confidence in India's next generation of Test cricketers. Speaking exclusively to AajTak, he backed the new leadership to guide the team toward sustained success in the coming years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-south-africa-cooper-connolly-3rd-odi-record-2776071-2025-08-24",
      "headline": "Cooper Connolly breaks 20-year-old record with historic spell in 3rd ODICooper Connolly produced record-breaking figures of 6-0-22-5, the best ever by an Australian spinner in men's ODIs, to set up a crushing 276-run win in Mackay. Australia's 431/2, powered by Travis Head, Mitchell Marsh and Cameron Green, handed South Africa their heaviest ODI defeat.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/raja-jackson-attacks-pro-wrestler-california-event-rampage-jackson-response-2776062-2025-08-24",
      "headline": "Watch: UFC legend Rampage Jackson's son brutally assaults pro-wrestler at eventRaja Jackson, son of Quinton \"Rampage\" Jackson, attacked wrestler Syko Stu, aka Stuart Smith, at a Knokx Pro Wrestling event in California. Rampage later apologised, calling it a work gone wrong."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}