{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-ola-electric-hero-motocorp-jsw-energy-reliance-power-2657071-2024-12-30",
      "headline": "Stocks to watch today: Ola Electric, Hero MotoCorp, JSW Energy, Reliance PowerSeveral stocks are in the spotlight due to key developments, such as Reliance Power, Ola Electric, Hero MotoCorp, JSW Energy, etc. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/octafx-ferox-firm-run-by-russian-national-dupes-crores-from-indian-investors-pavel-prozorov-exclusive-2656797-2024-12-29",
      "headline": "Exclusive: Firm run by Russian national dupes Rs 800 crore from Indian investorsThe ED filed a second chargesheet against Octafx India, its operating company overseas, OctaMarkets, its founder Pavel Prozorov, OctaFX CEO, who handled India operations, Anna Rudaia, and nine other individuals accused apart from a total of 41 companies and entities. Read this IndiaToday Exclusive. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/directorate-general-of-civil-aviation-suspends-akasa-air-officials-lapses-in-pilots-training-2656500-2024-12-27",
      "headline": "Aviation regulator suspends 2 Akasa Air officials for lapses in pilots trainingThe two senior executives of the airline have reportedly failed to ensure compliances with the civil aviation requirements, Directorate General of Civil Aviation said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zoho-ceo-sridhar-vembu-revives-debate-on-70-hour-work-week-advocated-by-infosys-founder-narayana-murthy-2656318-2024-12-27",
      "headline": "Zoho CEO Sridhar Vembu revives debate on 70-hour work weekZoho CEO Sridhar Vembu weighs in on the 70-hour work week debate initiated by Infosys founder Narayana Murthy. Here's his perspective."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/will-dearness-allowance-da-rise-again-in-2025-check-details-how-it-is-calculated-all-you-need-to-know-2656247-2024-12-27",
      "headline": "Will DA rise again in 2025? All you need to knowCentral government employees await a potential DA hike in January 2025, which could offer modest relief amid rising costs"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-rise-for-2nd-straight-day-as-auto-stocks-rally-2656246-2024-12-27",
      "headline": "Sensex, Nifty rise for 2nd straight day as auto stocks rally The S&P BSE Sensex settled 226.59 points higher at 78,690.07, while the NSE Nifty50 gained 63.20 points to end at 23,813.40."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/manmohan-singh-indian-economy-global-standing-key-reforms-1991-economic-liberalisation-2656166-2024-12-27",
      "headline": "How Manmohan Singh revitalised India's economy and global standingAs the chief architect of India's 1991 economic liberalisation, Manmohan Singh's policies helped steer India away from a severe financial crisis, positioning the country as one of the world's fastest-growing economies."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/osamu-suzuki-former-suzuki-motor-corporation-chairman-dies-at-94-2656153-2024-12-27",
      "headline": "Osamu Suzuki, former Suzuki Motor Corporation chairman, dies at 94Osamu Suzuki steered Suzuki Motor's rise, from pioneering Maruti 800 in India to building a global automotive legacy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-stock-market-benefitted-under-manmohan-singh-death-news-sensex-nifty-1991-2656149-2024-12-27",
      "headline": "How Indian stock market benefitted under Manmohan SinghManmohan Singh's policies, introduced during a time of economic crisis in the early 1990s, reshaped India's economy and transformed the Indian stock markets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/15-income-tax-changes-in-2024-what-you-need-to-know-for-filing-itr-in-2025-income-tax-rules-stmp-2656139-2024-12-27",
      "headline": "10 income tax changes in 2024: What you need to know for filing ITR in 2025The 2024 income tax reforms introduce revised tax slabs, higher deductions, and simplified TDS and capital gains rules, making tax filing easier and offering potential savings. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bumper-market-debut-for-mamata-machinery-should-you-book-profit-or-wait-2656140-2024-12-27",
      "headline": "Bumper stock market debut for Mamata Machinery: Should you book profit or wait? Mamata Machinery stock market listing: A 147% premium debut for Mamata Machinery leaves investors wondering: Is this the peak, or should they hold on?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dam-capital-advisors-ipo-stock-market-listing-long-term-bet-or-not-expert-views-2656116-2024-12-27",
      "headline": "DAM Capital Advisors makes strong market debut: Is it a long-term bet?DAM Capital Advisors market listing: The listing matched market predictions, as analysts and the grey market premium (GMP) had anticipated a 40%-50% premium, driven by robust demand and positive sentiment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sanathan-textiles-market-listing-31-percent-premium-over-ipo-price-hold-or-sell-2656091-2024-12-27",
      "headline": "Sanathan Textiles shares list at 31% premium over IPO price. Hold or sell? Sanathan Textiles stock market debut: The listing comes after the company's initial public offering (IPO) witnessed robust demand, with subscriptions exceeding 36 times the total shares on offer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mazagon-dock-strong-price-is-down-50-percent-on-some-trading-apps-today-explained-stmp-2656077-2024-12-27",
      "headline": "Explained: Why Mazagon Dock share price is down 50% on some trading apps todayMazagon Dock stock price: Certain trading apps may be displaying the unadjusted previous closing price, leading to the perception of a 50% fall. Adjusted for the split, Mazagon Dock shares were trading 2.13% lower on the Bombay Stock Exchange (BSE) at 11:09 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/transrail-lighting-ipo-share-price-listing-stock-open-at-36-percent-premium-dalal-street-debut-stmp-2656057-2024-12-27",
      "headline": "Transrail Lighting shares list at 36% premium on Dalal Street debut Transrail Lighting share price: The shares opened at Rs 585.15 per share on the Bombay Stock Exchange (BSE). The market debut aligns with market expectations, which was oversubscribed by 81 times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dam-capital-advisors-share-price-listing-strong-debut-39-percent-premium-nse-bse-rs-393-stmp-2656049-2024-12-27",
      "headline": "DAM Capital Advisors makes strong debut, shares list at 39% premium DAM Capital Advisors listing: On the BSE, the shares began trading at Rs 392.90, marking a 38.83% premium compared to the issue price."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mamata-machinery-listing-share-price-bumper-debut-147-percent-premium-rs-600-nse-bse-stmp-2656037-2024-12-27",
      "headline": "Mamata Machinery shares make bumper debut with 147% premium over IPO priceMamata Machinery listing: Shares of Mamata Machinery made a bumper debut and listed at Rs 600 per share on the NSE, a lot higher than the IPO issue price of Rs 243 per share. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-open-higher-auto-stocks-shine-tata-motors-bajaj-2656032-2024-12-27",
      "headline": "Sensex, Nifty open higher as auto stocks fuel early rally; Tata Motors up 2%The S&P BSE Sensex was up 323.12 points to 78,795.60, while the NSE Nifty50 gained 101.95 points to 23,852.15 as of 9:44 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/dam-capital-mamata-machinery-concord-transrail-sanathan-textiles-gmp-5-ipos-market-debut-today-2656022-2024-12-27",
      "headline": "Dam Capital to Mamata Machinery: GMPs of 5 IPOs ahead of D-Street debut todayThese initial public offerings (IPOs), which opened for subscription on December 19 and closed on December 23, collectively raised over Rs 2,900 crore."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/manmohan-singh-death-3-key-economic-reforms-liberalisation-licence-raj-mnrega-shaped-modern-india-2656013-2024-12-27",
      "headline": "Manmohan Singh's key reforms that shaped Indian economyDr Manmohan Singh's tenure as Finance Minister in the early 1990s and later as Prime Minister from 2004 to 2014 introduced policies that continue to influence India's growth. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bpsc-re-exam-protest-patna-prashant-kishor-case-filed-bihar-police-2657033-2024-12-29?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Case against Prashant Kishor for 'inciting' Bihar civil service aspirants' protestA case was filed against Prashant Kishor and others in connection with a protest by BPSC aspirants in Patna. Thousands of aspirants demanded a re-examination and a meeting with Chief Minister Nitish Kumar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/former-us-president-jimmy-carter-death-age-100-his-home-in-plains-georgia-says-report-2657060-2024-12-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Jimmy Carter, former US President and Nobel Peace laureate, dies at 100In recent years, Jimmy Carter, who served as the 39th US President from 1977 to 1981, experienced a range of health issues. He was the longest-lived President in US history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/suchir-balajis-death-elon-musk-backs-mother-says-not-suicide-glbs-2657055-2024-12-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Suchir Balaji's death: Elon Musk backs mother, says it doesn't seem like suicideFound dead in his San Francisco apartment on November 26, Suchir Balaji's death was ruled a suicide by the police, despite no evidence of foul play."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-aus-4th-test-live-score-day-5-live-scores-reactions-melbourne-updates-boxing-day-2657042-2024-12-30?utm_source=LiveBlog_hp&utm_medium=LiveBlog&utm_campaign=home_LiveBlog",
      "headline": "4th Test Day 5 Live: Pant joins Jaiswal after Lunch as India look to surviveAustralia (AUS) vs India (IND) 4th Test, Day 5 Live Updates: Rishabh Pant joins Yashasvi Jaiswal as India look to save the Boxing Day Test match. In the first session of the final day, Mitchell Starc removed Virat Kohli at the stroke of Lunch after Pat Cummins dismissed Rohit Sharma and KL Rahul."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/jimmy-carter-dies-longest-live-us-president-obit-texas-nobel-peanut-farmer-iran-hostage-public-service-2657073-2024-12-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Jimmy Carter: From peanut farmer to last Democratic President to win TexasJimmy Carter launched his presidential campaign in 1974 amidst the nation's disillusionment with politics after the Watergate scandal. \"I'm Jimmy Carter and I'm running for president. I will never lie to you,\" he pledged."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/south-korea-plane-crash-survivor-death-toll-jeju-air-crew-members-muan-airport-2657040-2024-12-29?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'What happened? Why am I here?' South Korea plane crash survivor asks doctorsThe two flight attendants, 32-year-old Lee and 25-year-old Kwon, miraculously survived the Jeju Air crash at Muan International Airport in South Korea, which claimed as many as 179 lives. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-poor-form-australia-mcg-test-day-5-cummins-rahul-2657064-2024-12-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rohit Sharma wastes patient start as poor Test run in Australia continuesBoxing Day Test: Rohit Sharma failed to capitalise on his patient start, again falling to Australian captain Pat Cummins. Rohit managed to score only 9 runs on Day 5 of the MCG Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/patna-bpsc-protest-bihar-civil-service-aspirants-seek-re-exam-clash-with-cops-break-barricades-2656999-2024-12-29?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bihar civil service aspirants seek re-exam in big protest, lathi-charged by copsThousands of Bihar Public Service Commission (BPSC) aspirants, seeking cancellation of BPSC prelims 2024, broke through two police barricades in Patna with some engaging in minor scuffles with the cops."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-4th-test-mcg-crowd-on-day-5-breaks-bradman-era-record-2657072-2024-12-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Australia vs India: Bumper MCG crowd on Day 5 breaks Bradman-era recordThe Boxing Day Test between Australia and India at the Melbourne Cricket Ground (MCG) entered the history books on Monday, the fifth and final day of the match. This Test holds the all-time attendance record at the MCG, surpassing the previous mark of 350,534 set during the 1936-37 Ashes series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-man-collapses-dies-first-day-sunburn-festival-goa-2657065-2024-12-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Delhi man, 26, collapses, dies on first day of Sunburn festival in GoaThe Goa Police spokesperson identified the deceased as Karan Kashyap (26), a resident of Rohini in West Delhi. The incident took place on Saturday night."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/defence-minister-rajnath-singh-in-madhya-pradesh-army-cantonment-mhow-stay-vigilant-against-enemies-2657046-2024-12-29?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Rajnath Singh says 'India not lucky on security', urges vigilance over threatsRajnath Singh also acknowledged the valuable contribution of the training institutions at Mhow cantonment in making their personnel proficient in military strategies and warfare skills."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-magnus-carlsen-to-play-in-jeans-after-return-to-world-blitz-championship-2657063-2024-12-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Magnus Carlsen returns to World Blitz Championship after jeans dispute resolvedMagnus Carlsen has confirmed his participation in the FIDE World Rapid and Blitz tournament and will play in jeans after a change in the rules. Carlsen had pulled out of the tournament after the sport's global governing body fined him for wearing jeans.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/rjd-congress-aap-nitish-kumar-government-police-action-bihar-public-service-commission-aspirants-2657058-2024-12-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Leave ego aside: Opposition slams Bihar government after aspirants lathi-chargedLeaders from the Rashtriya Janata Dal (RJD), the Congress and the Aam Aadmi Party (AAP) slammed the Bihar government for the use of force against thousands of protesting students."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/taliban-orders-construction-ban-on-windows-in-buildings-overlooking-womens-areas-2657070-2024-12-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Taliban orders construction ban on windows in buildings overlooking women's areasThe Taliban's supreme leader has decreed a ban on constructing windows overlooking areas used by Afghan women, citing the potential for 'obscene acts'. Municipal authorities are tasked with ensuring compliance.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/maharashtra-saffron-wall-repainted-green-in-pune-by-bjp-mp-medha-kulkarni-shiv-sena-ubt-reacts-2657035-2024-12-29?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Saffron makeover of green wall in Pune by BJP MP sparks political rowA saffron makeover of a green wall in Pune by BJP MP Medha Kulkarni has ignited a political row, drawing sharp criticism from the Shiv Sena (UBT). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/china-unveils-world-fastest-bullet-train-prototype-450-kmph-shanghai-beijing-railway-2657045-2024-12-29?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "China unveils world's fastest bullet train prototype capable of hitting 450 kmphThe new CR450 prototype reached a test speed of 450 kmph, with key performance indicators - operational speed, energy consumption, interior noise and braking distance, setting a new international benchmark."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-4th-test-jasprit-bumrah-5-wicket-haul-mcg-test-2657062-2024-12-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Workhorse Bumrah picks 13th 5-wicket haul after hardest toil in MCG TestBoxing Day Test: Jasprit Bumrah returned with excellent figures of 5 for 57 to help India bowl out Australia for 234. Bumrah bowled 53.2 overs in the ongoing MCG Test, the most he has ever bowled in his career.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/meerut-class-students-kills-school-friend-transfer-private-photos-videos-girlfriend-arrested-2657021-2024-12-29?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Class 12 student kills friend for stealing girlfriend's photos, videos in MeerutThe victim, a Class 11 student, was accused of transferring some private photos and videos of the accused, a Class 12 student, and his girlfriend on his phone in Uttar Pradesh's Meerut."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kerala-congress-mla-uma-thomas-injured-falls-off-stadium-gallery-in-kochi-condition-stable-2657049-2024-12-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kerala Congress MLA injured after falling off stadium gallery, condition stableThrikkakkara MLA Uma Thomas was attending an official event at the stadium when the accident took place, in which she sustained head injuries and was hospitalised for emergency treatment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wtc-2025-final-indias-qualification-scenario-aus-vs-ind-border-gavaskar-trophy-2024-25-2656992-2024-12-29?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "WTC 2025 final scenario: How India can join South Africa in title matchAfter South Africa became the first team to qualify for the WTC 2025 final, here's how India can join them in the summit clash."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/akhilesh-yadav-jibe-surveys-uttar-pradesh-says-shivling-under-chief-minister-residence-must-be-excavated-2656987-2024-12-29?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Shivling under UP Chief Minister's residence, should be excavated: Akhilesh YadavAmid heightened political tensions over archaeological surveys in Uttar Pradesh, Samajwadi Party chief Akhilesh Yadav claimed there was a 'Shivling' under Chief Minister's official residence in Lucknow"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/syrian-elections-new-constitution-ahmed-al-sharaa-rebel-leader-bashar-al-assad-ouster-damascus-2657028-2024-12-29?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Syria's new leader says polls could take 4 years, constitution draft in 3 yearsWeeks after autocratic Syrian President Bashar al-Assad's ouster, new leader Ahmed al-Sharaa said holding elections in the country could take four years while drafting a new constitution could happen in three years."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bjp-biju-janata-dal-barbs-vehicles-found-parked-on-odishas-kalinga-stadium-running-track-2657053-2024-12-30?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Vehicles parked on Odisha's Kalinga stadium running track, political row eruptsOdisha's Mohan Charan Manjhi government clarified that the two four-wheelers were parked on the athletics track due to \"unavoidable circumstances\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/diljit-dosanjh-guwahati-concert-manmohan-singh-man-of-grace-watch-2657083-2024-12-30",
      "headline": "Diljit Dosanjh dedicates concert to Manmohan Singh, calls him 'man of grace'Diljit Dosanjh dedicated his Guwahati concert to former PM Manmohan Singh, lauding his dignity and simplicity. Singh, 92, a renowned economist and leader, died on Thursday after a prolonged illness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-gauri-khan-abram-arrive-at-jamnagar-new-year-2025-2657067-2024-12-30",
      "headline": "Video: SRK, Gauri Khan and AbRam arrive in Jamnagar to celebrate New YearShah Rukh Khan and Gauri Khan, along with their son, AbRam, arrived in Jamnagar to celebrate New Year. Suhana and Aryan are yet to join their family in Jamnagar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/celebrity/story/srishty-rode-health-update-pneumonia-diagnosis-2657006-2024-12-29",
      "headline": "Srishty Rode gives health update after pneumonia diagnosis: Will be fine soonActor Srishty Rode, who opened up about her pneumonia diagnosis in Europe, shared her health update. She thanked her fans and loved ones for their support."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/prime-minister-narendra-modi-remembers-raj-kapoor-mohammed-rafi-mann-ki-baat-legends-ktb-bharat-hai-hum-2657000-2024-12-29",
      "headline": "PM Modi remembers 'legends' Raj Kapoor, Mohammed Rafi on Mann ki BaatPrime Minister Narendra Modi on December 29 remembered Raj Kapoor and Mohammed Rafi on Mann Ki Baat. He also highlighted the success of the popular children's animation series KTB Bharat Hai Hum. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-4th-test-mcg-crowd-on-day-5-breaks-bradman-era-record-2657072-2024-12-30",
      "headline": "Australia vs India: Bumper MCG crowd on Day 5 breaks Bradman-era recordThe Boxing Day Test between Australia and India at the Melbourne Cricket Ground (MCG) entered the history books on Monday, the fifth and final day of the match. This Test holds the all-time attendance record at the MCG, surpassing the previous mark of 350,534 set during the 1936-37 Ashes series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-poor-form-australia-mcg-test-day-5-cummins-rahul-2657064-2024-12-30",
      "headline": "Rohit Sharma wastes patient start as poor Test run in Australia continuesBoxing Day Test: Rohit Sharma failed to capitalise on his patient start, again falling to Australian captain Pat Cummins. Rohit managed to score only 9 runs on Day 5 of the MCG Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chess-magnus-carlsen-to-play-in-jeans-after-return-to-world-blitz-championship-2657063-2024-12-30",
      "headline": "Magnus Carlsen returns to World Blitz Championship after jeans dispute resolvedMagnus Carlsen has confirmed his participation in the FIDE World Rapid and Blitz tournament and will play in jeans after a change in the rules. Carlsen had pulled out of the tournament after the sport's global governing body fined him for wearing jeans.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-4th-test-jasprit-bumrah-5-wicket-haul-mcg-test-2657062-2024-12-30",
      "headline": "Workhorse Bumrah picks 13th 5-wicket haul after hardest toil in MCG TestBoxing Day Test: Jasprit Bumrah returned with excellent figures of 5 for 57 to help India bowl out Australia for 234. Bumrah bowled 53.2 overs in the ongoing MCG Test, the most he has ever bowled in his career.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-aus-4th-test-live-score-day-5-live-scores-reactions-melbourne-updates-boxing-day-2657042-2024-12-30",
      "headline": "4th Test Day 5 Live: Pant joins Jaiswal after Lunch as India look to surviveAustralia (AUS) vs India (IND) 4th Test, Day 5 Live Updates: Rishabh Pant joins Yashasvi Jaiswal as India look to save the Boxing Day Test match. In the first session of the final day, Mitchell Starc removed Virat Kohli at the stroke of Lunch after Pat Cummins dismissed Rohit Sharma and KL Rahul."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/zim-vs-afg-hashmatullah-shines-with-179-as-draw-looms-after-rain-marred-day-4-2657039-2024-12-29",
      "headline": "ZIM vs AFG: Hashmatullah shines with 179* as draw looms after rain-marred Day 4Rain played spoilsport on Day 4 in Bulawayo, allowing only 31 overs of play as Afghanistan trailed Zimbabwe by 71 runs. With heavy downpours and interruptions expected on the final day, the Test is heading towards a draw."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/james-anderson-reflects-on-early-retirement-couldve-made-it-till-ashes-2025-2657036-2024-12-29",
      "headline": "James Anderson reflects on early retirement: Could've made it till Ashes 2025James Anderson reflects on his early retirement, expressing confidence he could have played until the 2025 Ashes. With 704 Test wickets, England's bowling legend leaves a lasting legacy while continuing to contribute as a mentor for the team."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/aus-vs-ind-pundits-slam-rohit-sharma-yashasvi-jaiswal-catch-drops-melbourne-test-2657032-2024-12-29",
      "headline": "Pundits slam Rohit Sharma for angry reactions on Yashasvi Jaiswal's catch dropsSeveral experts slammed the India captain Rohit Sharma for his angry reactions on Yashasvi Jaiswal's catch drops on Day 4 of the fourth Test vs Australia in Melbourne.                                                                                                                                                                                                                                                                                   "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-genie-sanjay-manjrekar-aus-vs-ind-border-gavaskar-trophy-2024-25-2657024-2024-12-29",
      "headline": "Jasprit Bumrah is a genie that Indian cricket have brought as a gift: ManjrekarFormer India cricketer turned commentator Sanjay Manjrekar has called Jasprit Bumrah, the genie of Indian cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/i-was-sulking-in-toilet-temba-bavuma-reveals-nervy-hideout-during-tricky-chase-2657025-2024-12-29",
      "headline": "I was sulking in toilet: Temba Bavuma reveals nervy hideout during tricky chaseTemba Bavuma revealed that he spent the nervy moments in South Africa's chase inside the washroom and came outside only when the Proteas needed 15 runs to win. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/zim-vs-afg-hashmatullah-shines-with-179-as-draw-looms-after-rain-marred-day-4-2657039-2024-12-29",
      "headline": "ZIM vs AFG: Hashmatullah shines with 179* as draw looms after rain-marred Day 4Rain played spoilsport on Day 4 in Bulawayo, allowing only 31 overs of play as Afghanistan trailed Zimbabwe by 71 runs. With heavy downpours and interruptions expected on the final day, the Test is heading towards a draw."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/james-anderson-reflects-on-early-retirement-couldve-made-it-till-ashes-2025-2657036-2024-12-29",
      "headline": "James Anderson reflects on early retirement: Could've made it till Ashes 2025James Anderson reflects on his early retirement, expressing confidence he could have played until the 2025 Ashes. With 704 Test wickets, England's bowling legend leaves a lasting legacy while continuing to contribute as a mentor for the team."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/aus-vs-ind-pundits-slam-rohit-sharma-yashasvi-jaiswal-catch-drops-melbourne-test-2657032-2024-12-29",
      "headline": "Pundits slam Rohit Sharma for angry reactions on Yashasvi Jaiswal's catch dropsSeveral experts slammed the India captain Rohit Sharma for his angry reactions on Yashasvi Jaiswal's catch drops on Day 4 of the fourth Test vs Australia in Melbourne.                                                                                                                                                                                                                                                                                   "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-genie-sanjay-manjrekar-aus-vs-ind-border-gavaskar-trophy-2024-25-2657024-2024-12-29",
      "headline": "Jasprit Bumrah is a genie that Indian cricket have brought as a gift: ManjrekarFormer India cricketer turned commentator Sanjay Manjrekar has called Jasprit Bumrah, the genie of Indian cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/i-was-sulking-in-toilet-temba-bavuma-reveals-nervy-hideout-during-tricky-chase-2657025-2024-12-29",
      "headline": "I was sulking in toilet: Temba Bavuma reveals nervy hideout during tricky chaseTemba Bavuma revealed that he spent the nervy moments in South Africa's chase inside the washroom and came outside only when the Proteas needed 15 runs to win. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/some-people-doubted-on-me-i-just-wanted-to-prove-them-wrong-nitish-reddy-2657016-2024-12-29",
      "headline": "Some people doubted on me, I just wanted to prove them wrong: Nitish ReddyIndia all-rounder Nitish Kumar Reddy revealed that he wanted to prove his naysayers wrong who questioned his selection for the Border Gavaskar Trophy."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/felt-like-australia-are-ahead-in-the-game-all-the-way-marnus-labuschagne-2657017-2024-12-29",
      "headline": "Felt like Australia are ahead in the game all the way: Marnus LabuschagneAUS vs IND 4th Test: Marnus Labuschagne, while addressing the press conference at the end of the day's play, pointed out that he felt Australia have been ahead in the game most of the time. Australia already have a mammoth lead of 333 runs going into the Day 5 of the Melbourne Test as India set for a record chase."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-ind-mcg-test-how-pitch-and-weather-can-impact-day-5-2657011-2024-12-29",
      "headline": "Aus vs IND, MCG Test: How pitch and weather can impact Day 5 A thrilling finish awaits as Day 5 promises uninterrupted action in the 4th Test. With all three results possible, India's chase and Australia's bowling will decide the fate of the Border-Gavaskar Trophy in Melbourne's ideal cricketing conditions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/sunil-gavaskar-rohit-sharma-aus-vs-ind-melbourne-test-border-gavaskar-trophy-2024-25-2657009-2024-12-29",
      "headline": "Sunil Gavaskar backs Rohit Sharma to give India Sehwag-esque start in MCG chaseLegendary India cricketer Sunil Gavaskar has backed India captain Rohit Sharma to give the team Virender Sehwag-like start on Day 5 of the ongoing Melbourne Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wtc-2025-final-indias-qualification-scenario-aus-vs-ind-border-gavaskar-trophy-2024-25-2656992-2024-12-29",
      "headline": "WTC 2025 final scenario: How India can join South Africa in title matchAfter South Africa became the first team to qualify for the WTC 2025 final, here's how India can join them in the summit clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-ind-nitish-kumar-reddy-virat-kohli-border-gavaskar-trophy-2024-25-2656966-2024-12-29",
      "headline": "Had always dreamt about Virat Kohli appreciating me: Nitish Kumar ReddyIndia all rounder Nitish Kumar Reddy revealed that he had always dreamt about Virat Kohli praising him after his maiden Test century vs Australia in Melbourne."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-qualify-for-wtc-final-with-thrilling-2-wicket-win-vs-pakistan-2656972-2024-12-29",
      "headline": "South Africa qualify for WTC final with thrilling 2-wicket win vs PakistanSouth Africa have qualified for their maiden World Test Championship final. Kagiso Rabada and Marco Jansen's ninth wicket stand ensured South Africa chased down the tricky target of 148 runs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-womens-odi-cricketer-of-the-year-smriti-mandhana-named-as-nominee-2656960-2024-12-29",
      "headline": "ICC Women's ODI Cricketer of the Year: Smriti Mandhana named as nomineeSmriti Mandhana's stellar 2024, featuring 743 runs and key performances, earned her a nomination for ICC Women's ODI Cricketer of the Year. Competing alongside Wolvaardt, Athapaththu, and Sutherland, her consistency and match-winning efforts set her apart."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wtc-2025-final-indias-qualification-scenario-aus-vs-ind-border-gavaskar-trophy-2024-25-2656992-2024-12-29",
      "headline": "WTC 2025 final scenario: How India can join South Africa in title matchAfter South Africa became the first team to qualify for the WTC 2025 final, here's how India can join them in the summit clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-ind-nitish-kumar-reddy-virat-kohli-border-gavaskar-trophy-2024-25-2656966-2024-12-29",
      "headline": "Had always dreamt about Virat Kohli appreciating me: Nitish Kumar ReddyIndia all rounder Nitish Kumar Reddy revealed that he had always dreamt about Virat Kohli praising him after his maiden Test century vs Australia in Melbourne."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-qualify-for-wtc-final-with-thrilling-2-wicket-win-vs-pakistan-2656972-2024-12-29",
      "headline": "South Africa qualify for WTC final with thrilling 2-wicket win vs PakistanSouth Africa have qualified for their maiden World Test Championship final. Kagiso Rabada and Marco Jansen's ninth wicket stand ensured South Africa chased down the tricky target of 148 runs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-womens-odi-cricketer-of-the-year-smriti-mandhana-named-as-nominee-2656960-2024-12-29",
      "headline": "ICC Women's ODI Cricketer of the Year: Smriti Mandhana named as nomineeSmriti Mandhana's stellar 2024, featuring 743 runs and key performances, earned her a nomination for ICC Women's ODI Cricketer of the Year. Competing alongside Wolvaardt, Athapaththu, and Sutherland, her consistency and match-winning efforts set her apart."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-marnus-labuschagne-cheteshwar-pujara-mcg-test-india-2656949-2024-12-29",
      "headline": "Labuschagne does a Pujara mode to take Indian win out of equation AUS vs IND, Boxing Day Test: Marnus Labuschagne scored half-centuries in the Melbourne Test and gave glimpses of how Cheteshwar Pujara played on the tours of 2018-19 and 2020-21. Australia had a lead of 333 runs at Stumps on Day 4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/why-australia-didnt-declare-on-day-4-at-mcg-marnus-labuschagne-reveals-reason-2656943-2024-12-29",
      "headline": "Why Australia didn't declare on Day 4 at MCG: Marnus Labuschagne reveals reasonAustralia extended their lead to 333 on Day 4 at the MCG, prioritising caution over an early declaration. Marnus Labuschagne credited the lower-order fightback and explained how India's relentless bowling shaped their decision to bat longer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-kl-rahul-rohit-sharma-sanjay-manjrekar-mcg-test-opening-2656936-2024-12-29",
      "headline": "Rahul should open, Rohit at No.3 for Day 5 in MCG Test: Sanjay Manjrekar IND vs AUS: Sanjay Manjrekar was of the opinion that India should send back KL Rahul at the top of the order with Rohit Sharma at No.3 for the final day of the Boxing Day Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-australia-4th-test-day-5-message-ravi-shastri-draw-gabba-inspiration-2656911-2024-12-29",
      "headline": "How can India script MCG miracle? Show courage and character, says Ravi ShastriAustralia vs India, 4th Test: Former head coach Ravi Shastri said India have it in them to snatch a draw, but stressed it would be a test of character for their batters. India need more than 333 -- a record chase to win the Test on Monday, December 30. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}