{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/financial-clarity-money-management-wealth-mindset-abhishek-walia-2743570-2025-06-20",
      "headline": "CA explains how Rs 80,000 per month income can beat Rs 2 lakhThe CA's insights suggest that intentional financial management is key to wealth building. A clear financial purpose can transform how resources are allocated, leading to sustainable growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/rbi-eases-infrastructure-financing-norms-sensex-nifty-rise-2743540-2025-06-20",
      "headline": "Sensex jumps over 700 points: Why is the stock market rising today?The primary catalyst for this rally was the RBI's announcement concerning infrastructure financing. The central bank has implemented new norms that relax provisioning requirements for under-construction infrastructure projects."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/power-finance-corporation-share-price-rise-jumps-6-percent-today-reason-why-rbi-update-project-finance-2743503-2025-06-20",
      "headline": "Power Finance Corporation share price jumps 6% today. Here's whyWhile PFC has faced some pressure in recent months, with its stock falling 9.14% in the last six months and 14.44% over the past year, Friday's gain marks a strong rebound following the regulatory update."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-opens-228-points-higher-nifty-above-24800-nestle-gains-1-percent-2743481-2025-06-20",
      "headline": "Sensex opens 228 points higher, Nifty above 24,800; Nestle gains 1%The S&P BSE Sensex was up 160.43 points to 81,522.30, while the NSE Nifty50 gained 36.45 points to 24,829.70 as of 9:23 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-open-lower-geopolitical-tensions-market-volatility-2743468-2025-06-20",
      "headline": "Sensex, Nifty opening: Will stock market open higher? Check key levelsAs of 8:00 am, Gift Nifty futures were trading at 24,800. This suggests that the Nifty50 may open near its previous closing level of 24,793.25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-june-20-oswal-pumps-biocon-united-spirits-sai-life-sciences-nestle-india-2743464-2025-06-20",
      "headline": "Stocks to watch today: Oswal Pumps, Biocon, United Spirits, Sai Life SciencesShares of Nestle India could be in focus after the company announced that its Board of Directors will meet on June 26. They will consider a proposal to issue bonus shares."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indian-funds-swiss-banks-triple-banking-routes-see-sharpest-surge-2743425-2025-06-20",
      "headline": "Indian funds in Swiss banks triple, banking routes see sharpest surgeIndian funds in Swiss banks surged over threefold to CHF 3.5 billion (Rs 37,600 crore) in 2024, mainly due to a massive rise in holdings through financial institutions and banking channels. However, customer deposits rose by just 11%, making up only one-tenth of the total funds, which remain under tax scrutiny despite regular data sharing with Indian authorities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hardeep-singh-puri-oil-prices-israel-iran-conflict-situation-under-control-interview-2743301-2025-06-19",
      "headline": "Oil prices stable, situation not alarming: Union Minister amid Middle East tensionsUnion Petroleum Minister Hardeep Singh Puri allayed concerns about a spike in oil prices amid the Israel-Iran conflict, saying the situation was manageable and energy rates were under control."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/crashed-dreamliner-well-maintained-next-major-check-was-due-in-dec-air-india-ceo-2743296-2025-06-19",
      "headline": "Crashed Dreamliner well-maintained, next major check was due in Dec: Air India CEOAir India CEO Campbell Wilson on Thursday said that the Boeing 787-8 Dreamliner, that crashed in Ahmedbad on June 12, was well maintained."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-council-may-replace-compensation-cess-with-new-levies-july-meeting-2743163-2025-06-19",
      "headline": "GST Council may replace compensation cess with 2 new levies: ReportIf approved, the dual cess structure could redefine how India funds health and green goals, but only if the Centre and states agree on who pays, who gains, and who decides."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rbi-gold-loan-rules-cash-flow-assessment-nbfc-challenges-stricter-ltv-norms-2743130-2025-06-19",
      "headline": "Explained: How India's new gold loan rules will impact lendersThe RBI's directive requires a move towards cash flow-based credit assessments. This means lenders must go beyond just considering the gold's value as collateral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-ends-83-points-lower-nifty-below-24800-adani-ports-down-3-percent-titan-mahindra-2743129-2025-06-19",
      "headline": "Sensex ends 83 points lower, Nifty below 24,800; Adani Ports down 3%The S&P BSE Sensex was down by 82.79 points to end at 81,361.87, while the NSE Nifty50 lost 18.80 points to close at 24,793.25. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shikhar-pahariya-gaze-at-janhvi-kapoor-stealing-food-is-all-kinds-of-adorable-2743583-2025-06-20",
      "headline": "Shikhar Pahariya's gaze at Janhvi Kapoor stealing food is all kinds of adorableJanhvi Kapoor is enjoying a fun-filled getaway in London with her boyfriend, Shikhar Pahariya, and sister, Khushi Kapoor. A video from their holiday is going viral, capturing the couple looking smitten and absolutely adorable together.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/deepti-sadhwani-beauty-standards-in-south-they-dont-want-skinny-actors-2743221-2025-06-20",
      "headline": "Actor Deepti Sadhwani on beauty standards in South: They don't want skinny actorsActor Deepti Sadhwani recently spoke about the beauty standards in the industry and how it is different from the South cinema. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-traitors-new-episodes-maheep-kapoor-raftaar-ashish-vidyarthi-voted-out-karan-johar-2743542-2025-06-20",
      "headline": "The Traitors: Maheep Kapoor, Raftaar, Ashish Vidyarthi eliminated from the showThe innocents did not manage to catch the traitors yet again in the new episodes of 'The Traitors'. As a result, Maheep Kapoor, Raftaar and Ashish Vidyarthi were eliminated from the show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sitaare-zameen-par-x-twitter-reviews-fans-call-aamir-khan-film-a-masterpiece-2743546-2025-06-20",
      "headline": "Sitaare Zameen Par X reviews: Fans call Aamir's film a masterpiece, wins heartsAamir Khan makes a powerful comeback with 'Sitaare Zameen Par', a heartfelt film that's winning praise across social media. Fans on X are calling it a masterpiece, applauding its emotional depth, performances, and meaningful message."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/priyanka-chopra-teaches-jimmy-fallon-pack-a-punch-on-the-tonight-show-2743515-2025-06-20",
      "headline": "Priyanka Chopra teaches Jimmy Fallon how to pack a punch on The Tonight ShowActor Priyanka Chopra recently made an appearance on 'The Tonight Show Starring Jimmy Fallon'. In a promo video from the show, the global icon can be seen teaching Jimmy Fallon how to pack a punch. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/lauren-gottlieb-marries-tobias-jones-in-italy-2743518-2025-06-20",
      "headline": "ABCD actor Lauren Gottlieb marries boyfriend Tobias Jones in Italy. See picsActor-dancer Lauren Gottlieb got married to her longtime partner, Tobias Jones, on June 11. The intimate wedding took place in Tuscany, Italy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/sitaare-zameen-par-movie-review-aamir-khan-film-is-a-warm-hug-laughter-pill-for-soul-2743490-2025-06-20",
      "headline": "Sitaare Zameen Par review: Aamir Khan's film is a warm hug, laughter pill for soulReleased-Fri Jun 20, 2025With 'Sitaare Zameen Par', Aamir Khan doesn't just return to the screens, he returns you to yourself, one heartfelt laugh at a time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kuberaa-x-twitter-reviews-dhanush-nagarjuna-rashmika-mandanna-film-impresses-fans-call-it-fireworks-2743489-2025-06-20",
      "headline": "Kuberaa X reviews: Dhanush, Nagarjuna's film impresses fans, call it fireworksDhanush, Nagarjuna and Rashmika Mandanna's 'Kuberaa' has received positive reviews from fans on X, praising its storytelling, performances and gripping narrative. The film hit theatres on June 20. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-aamir-khans-funny-exchange-steals-the-show-at-sitaare-zameen-par-screening-2743472-2025-06-20",
      "headline": "Salman Khan, Aamir Khan's funny exchange steals the show at Sitaare BashAt the star-studded 'Sitaare Zameen Par' premiere last night, Salman Khan playfully revealed that Aamir Khan had first offered him the film. The event also saw the presence of Shah Rukh Khan, adding to the glamour of the evening. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-sitaare-zameen-par-screening-meets-actors-aamir-khan-gauri-spratt-2743461-2025-06-20",
      "headline": "Shah Rukh Khan lights up Sitaare Zameen Par screening, hugs and poses with actorsShah Rukh Khan attended the screening of Aamir Khan's 'Sitaare Zameen Par' in Mumbai on Thursday. He was seen interacting and taking pictures with the actors of the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/china-uses-ai-to-revive-100-classic-kung-fu-films-glbs-2743434-2025-06-20",
      "headline": "China uses AI to revive 100 classic Kung Fu filmsChina is launching an AI-driven project to revive 100 classic martial arts films, including works by Bruce Lee and Jackie Chan, blending restoration with innovation for modern audiences and global appeal.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/anna-camp-goes-public-with-girlfriend-jade-whipkey-at-bride-hard-premiere-glbs-2743429-2025-06-20",
      "headline": "Anna Camp goes public with girlfriend Jade Whipkey at Bride Hard premiereAnna Camp made her red carpet debut with girlfriend Jade Whipkey at the Bride Hard premiere, confirming their relationship after months of speculation and celebrating her new film in Los Angeles.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/kajol-gets-candid-on-trolling-and-the-scrutiny-of-star-kids-no-one-can-touch-my-children-exclusive-2743293-2025-06-19",
      "headline": "No one can touch my children: Kajol on trolling and public scrutinyActor Kajol opened up about the social media trolling faced by star kids today. The actor, in an exclusive interview with IndiaToday.in, highlighted the importance of love and emotional strength in parenting amid constant criticism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sunil-grover-mimics-salman-khan-kapil-sharma-says-itna-attitude-in-the-great-indian-kapil-show-season-3-2743278-2025-06-19",
      "headline": "Sunil Grover mimics Salman Khan, Kapil Sharma says itna attitude. WatchSalman Khan will be the first guest on 'The Great Indian Kapil Show' Season 3, premiering June 21 on Netflix. A hilarious new promo featuring the superstar, Kapil Sharma, and Sunil Grover promises a laughter-packed start to the season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karisma-kapoor-kareena-kapoor-saif-ali-khan-sunjay-kapur-funeral-in-delhi-2743269-2025-06-19",
      "headline": "Karisma Kapoor, Kareena-Saif at Sunjay Kapur's funeral in DelhiKarisma Kapoor, along with sister Kareena and Saif Ali Khan, were clicked at Lodhi crematorium in New Delhi for Sunjay Kapur's funeral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-rashmika-mandanna-avoid-paps-at-mumbai-airport-2743249-2025-06-19",
      "headline": "Vijay Deverakonda, Rashmika avoid paps as they arrive together at airport. WatchActors Vijay Deverakonda and Rashmika Mandanna avoided paparazzi as they returned to Mumbai on June 19. A video of the two exiting airport has emerged online. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/sonali-bendre-says-pati-patni-aur-panga-is-like-a-page-of-my-marriage-2743242-2025-06-19",
      "headline": "Host Sonali Bendre says Pati, Patni Aur Panga is like a page of my marriageSonali Bendre is making a comeback as a TV host for the upcoming reality show 'Pati, Patni Aur Panga', featuring real-life celebrity couples in fun relationship challenges. Calling it a reflection of her own marriage, she said the show celebrates everyday moments that make love real."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kajol-on-working-equation-with-husband-ajay-devgn-we-are-not-civilised-2743203-2025-06-19",
      "headline": "Kajol on working equation with husband Ajay Devgn: We are not civilisedKajol opened up about working with husband Ajay Devgn, sharing how they openly call each other out on set but never cross boundaries. She also said she keeps a polite and professional attitude while shooting to maintain a comfortable work environment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nani-to-reunite-with-hi-nanna-director-shouryuv-for-pan-india-rom-com-2743180-2025-06-19",
      "headline": "Nani to reunite with Hi Nanna director Shouryuv for pan-India rom-com: ReportNani is set to reunite with 'Hi Nanna' director Shouryuv for a light-hearted romantic comedy. The shooting for the film is expected to begin in 2026."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/kerala/story/kpcc-chief-sunny-joseph-says-shashi-tharoor-on-star-campaigner-list-for-nilambur-bypoll-after-wasnt-invited-revelation-2743566-2025-06-20",
      "headline": "Tharoor on star campaigner list for bypoll: Congress rebuts 'no invite' claimKerala Pradesh Congress Committee chief Sunny Joseph said Shashi Tharoor was included in the party's star campaigner list for the Nilambur bypoll and blamed his absence on other commitments abroad. This comes a day after Tharoor claimed he wasn't invited to campaign. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-crash-parliament-panel-poor-funding-air-crash-probes-bureau-aviation-security-2743478-2025-06-20",
      "headline": "Weeks before Air India crash, parliament panel flagged aviation security fundingThe Parliament standing committee report said budgetary allocation of Rs 35 crore for security infrastructure and accident investigation capabilities was insufficient."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/karnataka/story/congress-mla-br-patil-alleges-bribes-in-rajiv-gandhi-housing-corporation-house-allotments-warns-of-government-shake-up-in-leaked-audio-2743539-2025-06-20",
      "headline": "Government will shake: Karnataka MLA on housing scheme corruption in leaked audioKarnataka Congress MLA BR Patil, in a leaked audio clip, can be heard accusing officials of taking bribes for allotting houses under the Rajiv Gandhi Housing Corporation. He warned that details exposed could shake the government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-iran-war-us-donald-trump-two-week-deadline-deceive-tehran-attack-diplomacy-2743520-2025-06-20",
      "headline": "Bid to deceive Iran before attack? Decoding Trump's 2-week deadlineIran-Israel Conflict: Unpredictable as he is, Donald Trump's move has sparked speculation if the deadline was a carefully thought-out ploy to hoodwink Iran and get it to let its guard down or genuinely give diplomacy a chance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/environment/story/the-big-fat-indian-wedding-is-quietly-triggering-a-climate-chaos-2743215-2025-06-20",
      "headline": "The big fat Indian wedding is quietly triggering a climate chaosIn India, much of the wedding-related food waste is due to oversized buffets, inaccurate guest estimates, and a general lack of awareness about food donation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/uddhav-thackeray-dare-come-kill-me-foundation-day-eknath-shinde-devendra-fadnavis-2743589-2025-06-20",
      "headline": "Come, kill me, Uddhav Thackeray dares rivals. Shinde Sena says already finishedCome, kill me, Uddhav Thackeray dares rivals. Shinde Sena says already finished"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/disaster-after-disaster-who-is-accountable-air-india-plane-crash-bengaluru-stampede-pune-bridge-collapse-2743307-2025-06-20",
      "headline": "Disaster after disaster: Who is accountable?Building a Viksit Bharat by 2047, as envisaged by the Modi government, is a noble aim. Yet, the grim reality on the ground often doesn't match the dreams being spun in the air in a nation of 1.4 billion people. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-1st-test-preview-team-news-leeds-weather-prediction-2743428-2025-06-20",
      "headline": "New era. No mercy. Trial by Bazball awaits Shubman Gill's new-look IndiaEngland vs India, 1st Test preview: Shubman Gill will lead a new-look Indian side at Headingley, facing the daunting task of challenging a Bazballing England in their own backyard. The transition has been swift, offering no time to ease in. Can the young Indian side spring a surprise in Leeds?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/khamenei-fatwa-against-nukes-rouhani-iran-sell-lie-israel-attacks-iraq-war-2003-what-happened-history-nuclear-weapons-2743381-2025-06-20",
      "headline": "Khamenei's fatwa against nukes: Did Iran sell a lie to the world?More than two decades ago, Hassan Rouhani, a top Iranian negotiator, told global powers that Iran's Supreme Leader, Ayatollah Ali Khamenei, had issued a fatwa against nuclear weapons. Rouhani later admitted that the idea came to him during the 2004 talks. Amid the Israel-Iran conflict over nukes, a look at if the fatwa exists or is a bid at deception."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/israel-iran-war-updates-tehran-under-attack-operation-rising-lion-tel-aviv-missile-attack-donald-trump-ceasefire-nuclear-deal-2742822-2025-06-19",
      "headline": "Live: Israel claims it struck dozens of military, nuclear sites in IranIsrael-Iran Conflict Live Updates: Israel and Iran continued to launch several missiles at each other as their conflict stretched into its eighth day. Israel claims it conducted overnight airstrikes in Tehran, targeting missile production sites and Iran's alleged nuclear weapons research headquarters. The attack comes as Iran appoints a new intelligence chief for the Revolutionary Guards following the killing of his predecessor in a strike last week, according to state media. Meanwhile, the White House said Trump will decide within two weeks on possible US military action against Iran, indicating that diplomacy remains an option for now. Follow indiatoday.in for live updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/launch-of-indian-astronaut-shubhanshu-shukla-postponed-for-the-7th-time-heres-why-2743536-2025-06-20",
      "headline": "Why Nasa has postponed the launch of Indian astronaut for the 7th timeThe 14-day mission was scheduled to liftoff on Sunday before Nasa announced an indefinite delay to the mission. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/india-hit-our-airbases-pakistan-deputy-pms-big-admission-on-operation-sindoor-glbs-2743418-2025-06-20",
      "headline": "India hit our airbases: Pakistan Deputy PM's big admission on Operation SindoorPakistan's Deputy PM Ishaq Dar confirmed that India struck key military bases -- Nur Khan and Shorkot -- during Operation Sindoor, in response to the Pahalgam terror attack. Dar also revealed that Saudi Arabia tried to calm tension by contacting India on Pakistan's behalf."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sherlock-holmes-virat-kohli-2743326-2025-06-20",
      "headline": "Gavaskar, Sachin, Dravid or Kohli: Who's India's best? Sherlock Holmes investigatesCricket meets mystery in this puzzle for the ages. Virat Kohli has just retired from Test cricket and touched off a debate on who's the best Test batter ever from the short list of Gavaskar, Tendulkar, Dravid and Kohli. It's a debate wrapped inside a mystery that has layers and layers of facts, data and emotions. So, the writer summons the Sherlok Holmes inside him to crack Open the case of the #FabFourDebate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-fires-missiles-with-cluster-munitions-as-conflict-with-israel-enters-day-eight-glbs-2743445-2025-06-20",
      "headline": "Iran fires missiles with cluster bombs as conflict with Israel enters day eightTensions continued to rise on Friday as Israel struck Iranian nuclear sites and Tehran responded with missiles armed with cluster munitions. Netanyahu says Israel is ahead in its campaign, while Trump weighs US support amid nuclear fears."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/what-is-doomsday-plane-e-4b-landed-in-washington-dc-why-worry-world-amid-iran-israel-war-trump-2743345-2025-06-20",
      "headline": "What is Doomsday Plane E-4B, and why has it landed in DC?The Doomsday Plane, a US Air Force E-4B aircraft, designed to serve as an airborne command centre during a nuclear war or national catastrophe, landed in Washington, DC. The rare sight of the mysterious plane triggered both curiosity and panic. What might this mean amid a turbulent global climate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/16-billion-passwords-allegedly-leaked-in-massive-data-breach-experts-warn-no-service-is-safe-2743486-2025-06-20",
      "headline": "16 billion passwords allegedly leaked in massive data breachA massive data breach has exposed over 16 billion passwords online, making it one of the biggest security leaks in internet history. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/sitaare-zameen-par-movie-review-aamir-khan-film-is-a-warm-hug-laughter-pill-for-soul-2743490-2025-06-20",
      "headline": "Sitaare Zameen Par review: Aamir Khan's film is a warm hug, laughter pill for soulReleased-Fri Jun 20, 2025With 'Sitaare Zameen Par', Aamir Khan doesn't just return to the screens, he returns you to yourself, one heartfelt laugh at a time. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-israel-war-barabanki-to-tehran-ayatolla-khomeini-up-roots-iran-revolution-2743441-2025-06-20",
      "headline": "Barabanki to Tehran: Khomeini's UP roots in spotlight amid Israel-Iran tensionsKintoor, a village in Uttar Pradesh, India, with ancestral links to Ayatollah Khomeini, responds to the Israel-Iran conflict with calls for peace, reminding the world of its quiet yet powerful connection to Iranian history."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/us-quietly-pulled-military-jets-from-qatar-airbase-satellite-images-show-glbs-2743433-2025-06-20",
      "headline": "US quietly pulled military jets from Qatar airbase, satellite images showSatellite images show that the US removed most of its aircraft from Al Udeid Air Base in Qatar between June 5 and 19, amid rising tensions with Iran. Only three aircraft remained visible by June 19."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-mohammed-siraj-bowling-attack-bumrah-workload-test-cricket-2743531-2025-06-20",
      "headline": "Can Mohammed Siraj lead India's attack amid Jasprit Bumrah workload concerns?A renaissance in the IPL and prior success in England have primed Mohammed Siraj to take on a leadership role in a new-look Indian team. With Jasprit Bumrah's workload being carefully managed, the 31-year-old is set to play a key role as the constant in India's bowling line-up during the England tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/worry-window-mental-health-tips-to-manage-anxiety-stress-2742676-2025-06-20",
      "headline": "It's worry'o clock, time to manage anxiety in 5 stepsWhen worries pop into your head in the middle of a workday, don't silence them completely. Instead, block time on your calendar for later and let them feel heard. It's expert-approved."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/iran-israel-conflict-ayatollah-khamenei-khaybar-tweet-benjamin-netanyahu-2743292-2025-06-20",
      "headline": "Khamenei's Khaybar tweet: A sword, a signal, a storyIran's Supreme Leader Ayatollah Khamenei's tweet featured a digitally-illustrated painting: a luminous warrior gripping a double-bladed sword, flanked by two lions, striding toward a burning fortress under a rain of fire. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/benjamin-netanyahu-son-avner-wedding-delay-personal-cost-of-war-israel-iran-conflict-viral-video-backlash-2743526-2025-06-20",
      "headline": "On camera, Netanyahu says son's wedding delay personal cost of war; faces backlashIsraeli Prime Minister Benjamin Netanyahu has said the postponement of his son's wedding, due to the ongoing conflict with Iran, is a \"personal cost\" that his family paid, inviting fierce backlash online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bazball-england-test-cricket-explained-joe-root-mccullum-success-india-series-2743479-2025-06-20",
      "headline": "What is Bazball and should India be scared of it?England's fearless Bazball approach, pioneered by Brendon McCullum and Ben Stokes, has redefined modern Test cricket. Now, Shubman Gill's young Indian side faces the stern test of taking on this aggressive English outfit at Headingley."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/vir-das-returns-with-fool-volume-netflix-special-to-premiere-in-july-2743553-2025-06-20",
      "headline": "Vir Das returns With Fool Volume: Netflix special to premiere in JulyActor-comedian Vir Das is all set to return to his forte with the upcoming standup show 'Fool Volume'. Netflix India announced the streaming date of the new series featuring Das on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shikhar-pahariya-gaze-at-janhvi-kapoor-stealing-food-is-all-kinds-of-adorable-2743583-2025-06-20",
      "headline": "Shikhar Pahariya's gaze at Janhvi Kapoor stealing food is all kinds of adorableJanhvi Kapoor is enjoying a fun-filled getaway in London with her boyfriend, Shikhar Pahariya, and sister, Khushi Kapoor. A video from their holiday is going viral, capturing the couple looking smitten and absolutely adorable together.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/deepti-sadhwani-beauty-standards-in-south-they-dont-want-skinny-actors-2743221-2025-06-20",
      "headline": "Actor Deepti Sadhwani on beauty standards in South: They don't want skinny actorsActor Deepti Sadhwani recently spoke about the beauty standards in the industry and how it is different from the South cinema. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sitaare-zameen-par-x-twitter-reviews-fans-call-aamir-khan-film-a-masterpiece-2743546-2025-06-20",
      "headline": "Sitaare Zameen Par X reviews: Fans call Aamir's film a masterpiece, wins heartsAamir Khan makes a powerful comeback with 'Sitaare Zameen Par', a heartfelt film that's winning praise across social media. Fans on X are calling it a masterpiece, applauding its emotional depth, performances, and meaningful message."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dwayne-bravo-appointed-head-coach-trinbago-knight-riders-cpl-2025-2743559-2025-06-20",
      "headline": "Trinbago Knight Riders appoint Dwayne Bravo as new head coachDwayne Bravo has been appointed head coach of the Trinbago Knight Riders for the 2025 Caribbean Premier League season, marking a new chapter as TKR aims to clinch a fifth CPL title under his leadership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/sai-sudharsan-abhimanyu-easwaran-selected-for-india-england-tour-2743138-2025-06-20",
      "headline": "Sudharsan or Easwaran: Ex-cricketers back experience over potentialFormer cricketers Mohammed Kaif and WV Raman have backed experienced domestic stalwart Abhimanyu Easwaran to start in the upcoming Test series in England, citing his consistent performances over the years in domestic cricket as a stronger case for selection compared to the promise shown by someone like Sai Sudharsan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/karun-nair-ready-for-test-comeback-in-england-tour-2743543-2025-06-20",
      "headline": "Life has come full circle: Karun Nair ready for Test comeback in England seriesA matured and improved Karun Nair will look to make use of the learnings from his grind in the domestic setup as he aims to impress in the upcoming Test series against England. He reflected on how he was dropped from the side and ended up making a comeback in England, the place where he was last with the Test team in 2018."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-mohammed-siraj-bowling-attack-bumrah-workload-test-cricket-2743531-2025-06-20",
      "headline": "Can Mohammed Siraj lead India's attack amid Jasprit Bumrah workload concerns?A renaissance in the IPL and prior success in England have primed Mohammed Siraj to take on a leadership role in a new-look Indian team. With Jasprit Bumrah's workload being carefully managed, the 31-year-old is set to play a key role as the constant in India's bowling line-up during the England tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/indian-cricket-test-debuts-ganguly-dravid-kohli-june-20-legends-2743510-2025-06-20",
      "headline": "OTD: Rahul Dravid, Virat Kohli and Sourav Ganguly make Test debuts for IndiaJune 20 marks a special date in Indian cricket history — the day three stalwarts of the game began their journeys in Test cricket. Sourav Ganguly, Rahul Dravid, and Virat Kohli all took their first steps in the longest format of the game on this day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/tim-paine-appointed-australia-a-head-coach-2743501-2025-06-20",
      "headline": "Tim Paine reveals appointment as Australia A coach for Sri Lanka seriesFormer Test captain Tim Paine has announced his appointment as head coach of Australia A. The former wicketkeeper-batter is expected to play a key role in grooming the next generation of talent destined for the senior national team.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jofra-archer-eager-test-comeback-ben-stokes-england-india-series-2743496-2025-06-20",
      "headline": "Jofra Archer desperate for England Test return, says captain Ben StokesEngland captain Ben Stokes has said that Jofra Archer is \"absolutely desperate\" to reignite his Test career and is targeting a return to red-ball cricket during the forthcoming five-match series at home against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fifa-club-world-cup-lionel-messi-freekick-inter-miami-botafogo-psg-2743482-2025-06-20",
      "headline": "Club World Cup: Vintage Messi leads Inter Miami's win vs Porto, Botafogo stuns PSGLionel Messi showed that class is well and truly permanent with a magical free-kick to give Inter Miami a historic win over FC Porto. Botafogo followed it up with the stunning upset over PSG, while Atletico Madrid returned to winning ways with a 3-1 win over Seattle Sounders. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bazball-england-test-cricket-explained-joe-root-mccullum-success-india-series-2743479-2025-06-20",
      "headline": "What is Bazball and should India be scared of it?England's fearless Bazball approach, pioneered by Brendon McCullum and Ben Stokes, has redefined modern Test cricket. Now, Shubman Gill's young Indian side faces the stern test of taking on this aggressive English outfit at Headingley."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-loses-alexander-bublik-halle-open-upset-2743471-2025-06-20",
      "headline": "Jannik Sinner's Halle defence over after shocking loss to Alexander BublikWorld No.1 Jannik Sinner was stunned by Alexander Bublik 3-6, 6-3, 6-4 in the second round at the Halle grass-court tournament on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jofra-archer-eager-test-comeback-ben-stokes-england-india-series-2743496-2025-06-20",
      "headline": "Jofra Archer desperate for England Test return, says captain Ben StokesEngland captain Ben Stokes has said that Jofra Archer is \"absolutely desperate\" to reignite his Test career and is targeting a return to red-ball cricket during the forthcoming five-match series at home against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fifa-club-world-cup-lionel-messi-freekick-inter-miami-botafogo-psg-2743482-2025-06-20",
      "headline": "Club World Cup: Vintage Messi leads Inter Miami's win vs Porto, Botafogo stuns PSGLionel Messi showed that class is well and truly permanent with a magical free-kick to give Inter Miami a historic win over FC Porto. Botafogo followed it up with the stunning upset over PSG, while Atletico Madrid returned to winning ways with a 3-1 win over Seattle Sounders. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bazball-england-test-cricket-explained-joe-root-mccullum-success-india-series-2743479-2025-06-20",
      "headline": "What is Bazball and should India be scared of it?England's fearless Bazball approach, pioneered by Brendon McCullum and Ben Stokes, has redefined modern Test cricket. Now, Shubman Gill's young Indian side faces the stern test of taking on this aggressive English outfit at Headingley."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-loses-alexander-bublik-halle-open-upset-2743471-2025-06-20",
      "headline": "Jannik Sinner's Halle defence over after shocking loss to Alexander BublikWorld No.1 Jannik Sinner was stunned by Alexander Bublik 3-6, 6-3, 6-4 in the second round at the Halle grass-court tournament on Thursday."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}