{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-cuts-repo-rate-again-by-50-bps-to-550-percent-5-key-takeaways-you-must-know-home-loans-may-get-cheaper-2736602-2025-06-06",
      "headline": "RBI cuts repo rate again: 5 key takeaways you must knowSince February 2025, the RBI has slashed the repo rate by a full 100 basis points. With this sharp reduction, it believes there's now less room left to cut rates further to support growth. So, the RBI has changed its policy stance from \"accommodative\" to \"neutral\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/rbi-slashes-repo-rate-by-50-basis-points-to-55-third-consecutive-cut-2736588-2025-06-06",
      "headline": "RBI slashes repo rate by 50 basis points to 5.5%, third consecutive cutThe Reserve Bank of India (RBI) has reduced the repo rate by 50 basis points to 5.5%, marking the third consecutive rate cut. This decision comes amid a sharp drop in retail inflation to 3.16% in April and strong economic growth of 7.4% in the January-March quarter. The move is expected to make loans cheaper, benefiting borrowers, especially home buyers. The RBI has also changed its stance from accommodative to neutral, indicating a data-driven approach moving forward."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rally-sensex-up-500-points-rbi-repo-rate-cut-50-bps-nifty-gain-nse-bse-rise-2736592-2025-06-06",
      "headline": "Sensex jumps 700 points: Why RBI's bumper rate cut has Dalal Street buzzingStock market today: The S&P BSE Sensex was up by 731.61 points to 82,173.65, while the NSE Nifty rallied by 236.30 points to 24,987.20 as of 11:21 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbis-bumper-rate-cut-to-lower-home-auto-loan-emis-what-it-means-for-you-2736562-2025-06-06",
      "headline": "RBI's bumper rate cut to lower home, auto loan EMIs: What it means for youThe decision was announced after RBI Governor Sanjay Malhotra and the six-member Monetary Policy Committee (MPC) wrapped up their three-day review on Friday. This is the third consecutive rate cut, following back-to-back reductions earlier this year, including a 25-basis point cut in April."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-slashes-key-lending-rate-for-3rd-consecutive-time-brings-it-down-to-55-2736557-2025-06-06",
      "headline": "RBI slashes key lending rate for 3rd consecutive time, brings it down to 5.5%The decision was announced after the central bank's Monetary Policy Committee (MPC), led by Governor Sanjay Malhotra, concluded its three-day meeting that began on June 4."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-opening-bell-rbi-mpc-sensex-falls-over-100-points-nifty-below-24800-tata-steel-gains-1-percent-2736530-2025-06-06",
      "headline": "Sensex down over 200 points, Nifty below 24,800; Tata Steel gains 1%The S&P BSE Sensex was down by 197.18 points to 81,244.86, while the NSE Nifty50 lost 50.70 points to 24,700.20 as of 9:55 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-june-6-rbi-mpc-decision-today-sensex-nifty-open-higher-likely-rate-cut-trading-setup-nse-bse-2736515-2025-06-06",
      "headline": "Sensex and Nifty likely to rise on RBI rate cut hopesAnalysts predict a rate cut in RBI's MPC announcement. Gift Nifty futures were trading at 24,849.50 as of 8:30 am, indicating that Nifty50 will open above Thursday's close of 24,750.90."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-shares-in-news-june-6-rbi-mpc-rate-cut-ireda-coal-india-ntpc-green-energy-spicejet-2736505-2025-06-06",
      "headline": "Stocks to watch on June 6 as RBI rate cut anticipatedInvestors will have several stocks in focus as the Reserve Bank of India is expected to announce a rate cut, potentially boosting the market."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/tesla-stock-share-price-crashes-14-percent-usd-152-billion-loss-biggest-single-day-elon-musk-donald-trump-fallout-2736494-2025-06-06",
      "headline": "Tesla's worst day ever: $152 billion wiped out after Musk-Trump falloutTesla's market capitalisation fell below the $1 trillion mark and ended the day at $916 billion, its biggest single-day loss in value ever."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-shares-fall-as-trump-musk-rift-sparks-investor-jitters-glbs-2736458-2025-06-06",
      "headline": "Tesla shares fall 14% as Musk-Trump feud rattles investorsTesla shares plunged 14% as the Elon Musk–Donald Trump bromance ended and their feud spilled into the open, wiping out $150 billion in market value and weighing on Wall Street despite optimism over tariff talks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/india-could-become-third-largest-economy-in-the-world-this-year-borge-brende-2736444-2025-06-05",
      "headline": "India could become third largest economy in the world this year: Borge BrendeIn an exclusive interview with India Today, World Economic Forum President and CEO Borge Brende talked about India's strong economic performance and projected it could become the world's third-largest economy this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tariffs-wars-ai-wef-ceo-breaks-down-whats-next-for-global-economy-2736451-2025-06-05",
      "headline": "Tariffs, wars, AI: WEF chief breaks down what's next for global economyFrom rising tariffs and geopolitical risks to AI-driven productivity leaps, WEF CEO Borge Brende reveals how resilience, innovation, and cautious optimism could shape the future of the global economy beyond 2025"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-is-the-global-bright-spot-set-to-overtake-japan-wef-ceo-borge-brende-2736441-2025-06-05",
      "headline": "India is world's bright spot, set to overtake Japan: WEF chief Borge BrendeWEF CEO Borge Brende said India is the world's bright spot but added that to stay ahead, it must double down on reforms, infrastructure, and coordination across states."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/delhi-airport-gives-seed-balls-to-flyers-merges-green-goals-with-social-impact-2736399-2025-06-05",
      "headline": "Delhi Airport gives seed balls to flyers, merges green goals with social impactLed by GMR Aero's Delhi International Airport Limited (DIAL), the campaign invites passengers to plant seed balls containing species like Lemon, Tamarind, Gooseberry, Neem, and Peepal, all chosen for their ecological and medicinal value. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rbi-kyc-norms-credit-card-email-update-india-2736273-2025-06-05",
      "headline": "Want to update your credit card email? Follow these stepsA guide to updating your registered email address for credit cards in India, highlighting the new RBI KYC norms and simplification by banks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/apple-hands-over-iphone-macbook-repairs-to-tata-in-india-report-2736220-2025-06-05",
      "headline": "Tata to handle iPhone and MacBook repairs in India for Apple: ReportAs the US tech giant continues to diversify its manufacturing footprint beyond China, Tata has emerged as a key ally. The group already assembles iPhones at three facilities in southern India, with one also manufacturing certain components."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/energy-electrons-currency-zerodha-nikhil-kamath-ai-data-centres-india-2736212-2025-06-05",
      "headline": "Will energy replace currency? Zerodha's Nikhil Kamath thinks soNikhil Kamath believes energy could replace money in the next decade. Here's why he thinks so."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-sensex-ends-over-400-points-higher-nifty-above-24700-eternal-gains-5-percent-2736178-2025-06-05",
      "headline": "Sensex ends over 400 points higher, Nifty above 24,700; Eternal gains 5%The S&P BSE Sensex was up by 443.79 points to end at 81,442.04, while the NSE Nifty50 gained 130.70 points to close at 24,750.90. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/want-eli-scheme-benefits-make-sure-your-uan-and-aadhaar-are-linked-by-this-date-2736138-2025-06-05",
      "headline": "Want ELI scheme benefits? Make sure your UAN and Aadhaar are linked by this dateThe Employees' Provident Fund Organisation has extended the deadline for UAN activation and Aadhaar linking to bank accounts under the ELI scheme until 30 June 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/are-you-a-freelancer-5-things-to-know-while-filing-your-itr-without-form-15-explains-tax-expert-2736113-2025-06-05",
      "headline": "Are you a freelancer? 5 things to know while filing your ITRFreelancers can claim deductions for expenses directly related to their work. These include internet bills, rent for a co-working space, cost of software tools, professional fees, marketing and advertising costs, and travel expenses related to business, etc."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-council-may-remove-12-percent-slab-shift-items-to-5-and-18-percent-2736092-2025-06-05",
      "headline": "GST Council may remove 12% slab, shift items to 5% and 18% tax ratesThe GST Council is considering eliminating the 12% tax slab as part of efforts to streamline the tax structure, potentially moving these items to either the 5% or 18% brackets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/dr-reddys-shares-rise-alvotech-keytruda-biosimilar-collaboration-2736067-2025-06-05",
      "headline": "Dr Reddy's shares jump over 3% today. Here's whyDr Reddy's shares soar 3.54% after Alvotech partnership for Keytruda biosimilar, enhancing global reach in cancer immunotherapy and signaling growth potential in competitive biosimilar market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/department-of-posts-launches-digipin-precise-digital-addressing-system-new-digital-address-system-in-india-2736018-2025-06-05",
      "headline": "What is DIGIPIN? India's new digital address system explainedThe Department of Posts has launched DIGIPIN, a geocoded digital address system aiming to improve location accuracy and service delivery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/eternal-shares-rise-4-percent-morgan-stanley-maintains-rs-320-target-2735974-2025-06-05",
      "headline": "Eternal shares continue to rally, jumps over 4%. Should you buy?By approximately 10:06 am, the company's shares had risen 4.42% to Rs 256.35 on the Bombay Stock Exchange (BSE). This marks a 12% rise over the past five trading sessions and a 6% increase over the past month. However, year-to-date, the stock remains down by over 7%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/why-is-stock-market-rising-today-sensex-rally-400-points-nifty-up-ril-eternal-adani-ports-shares-gain-2735970-2025-06-05",
      "headline": "Sensex rallies 800 points: Why is stock market rising today?As of 12:24 pm, the S&P BSE Sensex had jumped 770.31 points to reach 81,768.56. The NSE Nifty50 was also up by 230.50 points at 24,850.60."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-opening-bell-sensex-opens-111-points-higher-nifty-above-24600-eternal-shares-rise-over-1-percent-2735958-2025-06-05",
      "headline": "Sensex, Nifty rise as RBI rate cut hopes lift market; pharma stocks rallyThe S&P BSE Sensex was up 273 points to 81,271.25, while the NSE Nifty50 gained 86.55 points to 24,706.75 as of 9:29 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-today-expectation-sensex-nifty-rally-trading-setup-nse-bse-2735939-2025-06-05",
      "headline": "Stock market opening: Sensex, Nifty to rally today? Check key levelsGift Nifty futures were trading at 24,733.5 as of 8:00 am, signalling a strong start above Nifty50's previous close of 24,620.2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-june-5-nse-bse-reliance-infra-yes-bank-bel-hal-rec-power-grid-2735933-2025-06-05",
      "headline": "Stocks to watch on June 5: Reliance Infra, Yes Bank, BEL, HAL, REC, Power GridAn overview of stock movements on Dalal Street today, including updates on Adani Airports, Reliance Infrastructure, and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/volkswagen-to-trim-35000-jobs-in-germany-by-2030-german-carmakers-plans-layoffs-2735697-2025-06-04",
      "headline": "Volkswagen to trim 35,000 jobs in Germany by 2030Volkswagen is planning to cut 35,000 jobs in Germany by the year 2030. To make the transition easier, Volkswagen is preparing severance packages for affected employees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-ends-261-points-higher-nifty-above-24600-eternal-gains-over-3-percent-2735618-2025-06-04",
      "headline": "Sensex ends 261 points higher; Nifty above 24,600; Eternal gains over 3%The S&P BSE Sensex added 261 points to end at 80,998.25, while the NSE Nifty50 was up by 77.70 points to close at 24,620.20. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/india-green-steel-production-energy-costs-green-hydrogen-incentives-2735598-2025-06-04",
      "headline": "Government seeks lower energy costs for backing green steel incentives: ReportIndia's finance ministry calls for lower energy prices to facilitate incentives for green steel production, amidst concerns over high green hydrogen costs and inflation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-ay-2025-26-itr-1-and-itr-4-enabled-on-e-filing-portal-who-can-file-online-check-eligibility-2735586-2025-06-04",
      "headline": "ITR-1, ITR-4 filing begins for AY 2025–26: Are you eligible?The Income Tax Department has enabled online filing of ITR-1 and ITR-4 forms for the assessment year 2025-26. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/rbi-mpc-rate-cut-sector-stock-market-news-trading-tips-expert-recommendation-buy-shares-2735591-2025-06-04",
      "headline": "RBI policy meet begins today: These stocks could rally if rate cut happensThe market is expecting a cut of 25 to 50 basis points (bps), mainly because inflation has been coming down and there are growing worries about slower economic growth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/china-rare-earth-export-controls-disrupt-global-supply-chains-2735550-2025-06-04",
      "headline": "Why China's rare earth export curbs are shaking global supply chainsChina's recent restrictions on rare earth exports are causing global industry disruptions, prompting urgent diplomatic and economic responses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/grse-stock-jumps-10-percent-mou-kongsberg-polar-research-vessel-2735536-2025-06-04",
      "headline": "GRSE shares jump 10% today: What's fuelling the rally?GRSE shares surged by up to 10% after sealing a partnership with Norway's Kongsberg for India's first Polar Research Vessel, highlighting a pivotal moment in deep-sea research and defence shipbuilding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/1-crore-salary-mumbai-cost-living-wealth-perception-2735511-2025-06-04",
      "headline": "Is Rs 1 crore salary still a big deal? Depends on where you live and who you askAn alumnus of IIM Ahmedabad has raised questions about the real value of a 1 crore annual salary in Mumbai. He pointed out that in areas like Borivali or Thane, a Rs 1 crore salary might still make one stand out, but in South Mumbai's boardrooms, where finance and tech executives frequently earn between Rs 1 crore and Rs 5 crore, this income is seen as average."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-steel-aluminium-tariffs-50-percent-double-impact-india-donald-trump-2735508-2025-06-04",
      "headline": "Trump doubles metal tariffs to 50% but skips UK. What it means for IndiaUS President Donald Trump plans to double tariffs on imported steel and aluminium, affecting global trade dynamics. The UK's exemption contrasts with challenges for India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/coforge-stock-split-shares-drop-80-percent-explained-2735506-2025-06-04",
      "headline": "Did Coforge shares drop 80% today? Here's all you need to knowInvestors might have initially mistaken this adjustment for a loss. Despite the apparent drop, the stock actually opened higher at Rs 1,720.05 on Wednesday, with a 0.60% increase. It was up 1.4% on the BSE at 12:18 pm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pm-kisan-20th-instalment-june-2025-e-kyc-eligibility-aadhaar-linkage-check-date-beneficiary-list-and-full-scheme-details-2735475-2025-06-04",
      "headline": "Are you eligible for PM-Kisan yojana? Check 20th instalment and requirementsThe upcoming 20th instalment is anticipated to be disbursed in the first or second week of June 2025. Under this scheme, farmers can receive the annual financial aid of Rs 6,000, distributed in three equal instalments of Rs 2,000 every four months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stop-sudden-tax-demands-raghuram-rajan-on-fixing-indias-business-environment-2735480-2025-06-04",
      "headline": "Stop sudden tax demands: Raghuram Rajan on fixing India's business environmentRaghuram Rajan says India must fix its business environment, starting with killing off surprise tax shocks that are scaring investors and strangling the country's shot at global supply chain glory."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tom-felton-returns-as-draco-malfoy-for-broadway-harry-potter-and-the-cursed-child-2736606-2025-06-06",
      "headline": "Tom Felton returns as Draco Malfoy for Broadway's Harry Potter and the Cursed ChildActor Tom Felton is all set to make his Broadway debut in 'Harry Potter and the Cursed Child.' He will reprise his role of Draco Malfoy in the play set 19 years after the events of the final book."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nagarjuna-son-akhil-akkineni-zainab-ravdjee-married-2736628-2025-06-06",
      "headline": "Nagarjuna's son Akhil Akkineni and Zainab Ravdjee are married. First pics outNagarjuna and Amala Akkineni's youngest son, Akhil Akkineni, married his fiancée, Zainab Ravdjee, in an intimate wedding on June 6. Their photos from the traditional wedding ceremony are doing the rounds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/abhishek-bachchan-garmi-hook-step-housefull-5-bts-amitabh-bachchan-reacts-2736583-2025-06-06",
      "headline": "Abhishek Bachchan nails Garmi hook step in Housefull 5 BTS, Big B reactsAbhishek Bachchan showed off his moves with Nora Fatehi's Garmi hook step in a fun 'Housefull 5' BTS video. Amitabh Bachchan watched the clip and reacted with amusement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/housefull-5-x-reviews-fans-call-it-entertaining-yet-illogical-bollywood-masala-2736611-2025-06-06",
      "headline": "Housefull 5 X reviews: Fans call it entertaining yet illogical Bollywood masalaAkshay Kumar's 'Housefull 5' has received positive reviews from fans on X, praising its comedy, star performances, and thrilling murder mystery twist. Audiences are eagerly waiting for the release of the second part to see how the story unfolds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/virat-kohli-sister-bhawna-kohli-rubbishes-speculations-rift-with-anushka-sharma-2736596-2025-06-06",
      "headline": "Virat Kohli's sister rubbishes speculations of rift between her and Anushka SharmaVirat Kohli's sister Bhawna Kohli has shut down speculations of any rift between her brother and Anushka Sharma. Bhawna set the record straight in a now-deleted post. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/tom-cruise-sets-guinness-world-record-for-parachute-stunt-in-mission-impossible-8-2736565-2025-06-06",
      "headline": "Tom Cruise sets Guinness World Record for parachute stunt in Mission Impossible 8Tom Cruise has been awarded a Guinness World Record for performing burning parachute jumps in 'Mission: Impossible – The Final Reckoning'. He jumped out of a helicopter 16 times with a flaming, fuel-soaked parachute with a 50-pound camera rig on his body."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/chiranjeevi-sobhita-naga-chaitanya-ram-charan-akhil-akkineni-zainab-ravdjee-nagarjuna-wedding-festivities-2736581-2025-06-06",
      "headline": "Chiranjeevi, Sobhita-Naga Chaitanya, celebs at Akhil-Zainab's wedding festivitiesNagarjuna's younger son, Akhil Akkineni, is all set to get married to Zainab Ravdjee today, June 6, in Hyderabad. Ahead of the grand day, wedding festivities began at the Akkineni house with several celebs in attendance. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/a-big-bold-beautiful-journey-trailer-margot-robbie-colin-farrell-2736537-2025-06-06",
      "headline": "A Big Bold Beautiful Journey trailer: Margot-Colin revisit past in dreamy love storyThe trailer of 'A Big Bold Beautiful Journey' introduces a magical love story starring Margot Robbie and Colin Farrell as two strangers who travel through their past memories. Full of love, old memories, and emotions, the film promises a heart-touching and dreamy journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/malayalam-actor-shine-tom-chacko-admitted-to-hospital-after-accident-in-tamil-nadu-2736551-2025-06-06",
      "headline": "Shine Tom Chacko's father dies in car accident, actor, his mother severely injuredMalayalam actor Shine Tom Chacko has been admitted to hospital after a car accident in Tamil Nadu. His father, Sibi Chacko, aged 70, died on the spot. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rana-daggubati-angry-at-paparazzi-video-reacts-2736548-2025-06-06",
      "headline": "Rana Daggubati reacts to viral video of him getting angry at paps | ExclusiveActor Rana Daggubati was caught on camera confronting paparazzi at Mumbai airport, sparking debate about celebrity privacy. In an exclusive chat with India Today, he expressed his discomfort with invasive filming and called for respectful content creation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-tiger-shroff-bike-entry-video-viral-before-housefull-5-release-2736518-2025-06-06",
      "headline": "Akshay-Tiger's stylish bike entry goes viral, ahead of Housefull 5 release. WatchActors Akshay Kumar and Tiger Shroff made a grand entry on a bike at an event, leaving fans thrilled with their stylish appearance. The moment went viral just ahead of the release of 'Housefull 5', which is already generating massive buzz and strong advance bookings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranbir-kapoor-new-clean-shave-look-sends-internet-into-frenzy-2736504-2025-06-06",
      "headline": "Ranbir Kapoor's new clean-shaven look sends Internet into frenzy. WatchActor Ranbir Kapoor's new clean-shaven and slim look is going viral, and he is looking different from his 'Animal' appearance. He also won hearts by being sweet to fans and paparazzi, ahead of his role as Lord Ram in 'Ramayana'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/exclusive-jackson-wang-is-finally-coming-to-india-on-june-10-details-inside-2736507-2025-06-06",
      "headline": "Exclusive: Jackson Wang is finally coming to India on June 10; details insideGlobal pop icon Jackson Wang is all set to visit Mumbai on June 10 for a week-long promotional tour and cultural immersion. Read exclusive details. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thug-life-box-office-collection-day-1-kamal-haasan-rs-17-crore-india-fails-to-beat-indian-2-vikram-2736495-2025-06-06",
      "headline": "Thug Life box office Day 1: Kamal Haasan's film fails to beat Indian 2, VikramDirector Mani Ratnam's 'Thug Life', starring Kamal Haasan and Silambarasan, opened at the box office on a solid note. However, the film failed to surpass the Day 1 collection of Haasan's previous films, 'Indian 2' and 'Vikram'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/panchayat-season-4-release-date-arrive-early-manju-devi-vs-kranti-devi-promo-suggests-so-2736353-2025-06-05",
      "headline": "Panchayat Season 4 to arrive early? Manju Devi vs Kranti Devi promo suggests soThe rivalry between Manju Devi and Kranti Devi takes a new twist in the rally cry song of 'Panchayat Season 4'. The video hints at the show releasing ahead of the July 2 launch date."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ayushmann-khurrana-sooraj-barjatya-next-film-to-go-on-floors-in-november-2736296-2025-06-05",
      "headline": "Ayushmann Khurrana's next with Sooraj Barjatya to go on floors in November: ReportAyushmann Khurrana will play the lead role of 'Prem' in Sooraj Barjatya's next family drama, which begins shooting in November 2025. The film, also starring Sharvari, is expected to release in the second half of 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/farah-khan-cook-dilip-first-international-trip-2736359-2025-06-05",
      "headline": "Farah Khan's cook Dilip shares chocolates with paps before first foreign trip. WatchFarah Khan's in-house cook Dilip is now a social media sensation. He was seen at the airport ahead of his first international trip.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranjeet-shares-birthday-fun-from-housefull-5-sets-2736346-2025-06-05",
      "headline": "Ranjeet shares birthday fun from Housefull 5 sets: Can't stop missing these momentsVeteran actor Ranjeet recently shared a throwback clip of his birthday celebrations from the sets of Housefull 5. Akshay Kumar, Riteish Deshmukh, Abhishek Bachchan, and others were seen celebrating with him.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/akshay-kumar-not-first-choice-jaanwar-suneel-darshan-2736265-2025-06-05",
      "headline": "Akshay Kumar wasn't the first choice for Jaanwar: Suneel DarshanFilmmaker Suneel Darshan revealed that Akshay Kumar was not the original lead for Jaanwar. The director had initially considered two other Bollywood actors before casting Akshay during a low point in his career."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-inaugurates-worlds-highest-rail-bridge-over-river-chenab-that-will-link-kashmir-valley-to-rest-of-countr-2736622-2025-06-06",
      "headline": "PM opens landmark Chenab Bridge, flags off Vande Bharat in massive Kashmir pushThe bridge surpasses the height of the Eiffel Tower and forms a critical part of the Udhampur-Srinagar-Baramulla Rail Link (USBRL) project."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/modi-kashmir-visit-chenab-railway-bridge-live-updates-pahalgam-jammu-vande-bharat-2736523-2025-06-06",
      "headline": "Live: After record-setting Chenab Bridge, PM flags off Srinagar-Katra Vande BharatPM Modi J&K Visit Live Updates: Prime Minister Narendra Modi inaugurated the Chenab Railway Bridge, a record-setting structure that now stands as the tallest railway arch bridge in the world. Towering 359 metres above the Chenab River in Jammu and Kashmir, the bridge is taller than the Eiffel Tower and a key segment of the ambitious Udhampur-Srinagar-Baramulla Rail Link (USBRL) project, aimed at bolstering connectivity in the region. This is PM Modi's first visit to Jammu and Kashmir after the deadly April 22 Pahalgam terror attack which killed 26 civilians. During his visit, PM Modi will also flag off two specially designed Vande Bharat trains connecting Srinagar with Katra. Stay with IndiaToday.in for live updates.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-musk-blowup-public-spat-spending-bill-doge-cuts-tesla-shares-spacex-threat-2736477-2025-06-06",
      "headline": "When unstoppable ego met immovable megalomaniac: Trump-Musk breakup in 4 ActsMusk bankrolled Trump's return to power, stood by him on election night, and was crowned a 'super genius' from the inaugural podium. But in just six months, Musk went from kingmaker to enemy number one — as ego clash led to a breakup that rocked Washington and Wall Street alike."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/cricket-body-ksca-approaches-ktaka-hc-to-quash-fir-case-over-bengaluru-chinnaswamy-stadium-rcb-victory-parade-stampede-2736647-2025-06-06",
      "headline": "Karnataka cricket body moves High Court to cancel case in Bengaluru stampedeThe Karnataka State Cricket Association (KSCA) has moved the High Court, seeking to quash the case against it in connection with the stampede outside Bengaluru's Chinnaswamy Stadium, in which eleven people died."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/operation-sindoor-united-abroad-divided-at-home-2736389-2025-06-06",
      "headline": "Operation Sindoor: United abroad, divided at homeWhen an all-party meeting is called to discuss Operation Sindoor, the prime minister doesn't even attend it. Now, when a special session is demanded on the post-Pahalgam situation, the government ignores the plea. When debate is strangulated, democracy is weakened. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/supreme-court-allows-medical-exam-body-reschedule-neet-pg-exam-2736642-2025-06-06",
      "headline": "Supreme Court allows medical exam body to reschedule NEET PG to August 3The Supreme Court allowed NBE to reschedule the NEET PG exam to August 3, citing technical constraints. The court said no further extension would be granted.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-cuts-repo-rate-again-by-50-bps-to-550-percent-5-key-takeaways-you-must-know-home-loans-may-get-cheaper-2736602-2025-06-06",
      "headline": "RBI cuts repo rate again: 5 key takeaways you must knowSince February 2025, the RBI has slashed the repo rate by a full 100 basis points. With this sharp reduction, it believes there's now less room left to cut rates further to support growth. So, the RBI has changed its policy stance from \"accommodative\" to \"neutral\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/ktaka-bjp-says-cold-blooded-murderers-punishing-police-slams-congress-government-over-commissioner-dayanand-suspension-after-bengaluru-stampede-2736610-2025-06-06",
      "headline": "Murderers punishing police: BJP slams Congress over top cop's suspensionThe Karnataka BJP has accused the Congress government of targeting Bengaluru Commissioner B Dayanand and suspending him to deflect blame after the stadium stampede that killed eleven people."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/in-trump-vs-musk-battle-nasa-is-the-biggest-loser-2736631-2025-06-06",
      "headline": "In Trump vs Musk battle, Nasa is the biggest loserWhile Trump has certain plans for Nasa, the American space agency is heavily dependent on Musk's SpaceX for most of its operations in the Low Earth Orbit. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ksca-wrote-karnataka-govt-for-victory-felicitation-celebration-permission-at-vidhana-soudha-on-june-3-2736550-2025-06-06",
      "headline": "Bengaluru stampede: Government sat on options, shows damning letterIn a letter accessed exclusively by India Today, the Karnataka State Cricket Association had written to the government on June 3 asking for approval for a victory ceremony in case RCB wins the IPL 2025 final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/elon-musk-donald-trump-feud-doge-argument-epstein-files-national-secret-new-bill-tesla-spacex-2736601-2025-06-06",
      "headline": "We're 4-5 tweets away from national secrets: Internet grabs popcorn as Trump, Musk sparThe dramatic fallout between Donald Trump and Elon Musk has captivated global attention, with their escalating feud playing out online. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rally-sensex-up-500-points-rbi-repo-rate-cut-50-bps-nifty-gain-nse-bse-rise-2736592-2025-06-06",
      "headline": "Sensex jumps 700 points: Why RBI's bumper rate cut has Dalal Street buzzingStock market today: The S&P BSE Sensex was up by 731.61 points to 82,173.65, while the NSE Nifty rallied by 236.30 points to 24,987.20 as of 11:21 am."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/japans-resilience-lander-crashes-on-the-moon-heres-what-went-wrong-2736656-2025-06-06",
      "headline": "Why did Japanese ispace's Resilience lander crash on the Moon?Hours after the spacecraft crashed on the Moon, ispace revealed the initial findings from data it received moments before the spacecraft had a hard landing on the Moon. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/tesla-stock-share-price-crashes-14-percent-usd-152-billion-loss-biggest-single-day-elon-musk-donald-trump-fallout-2736494-2025-06-06",
      "headline": "Tesla's worst day ever: $152 billion wiped out after Musk-Trump falloutTesla's market capitalisation fell below the $1 trillion mark and ended the day at $916 billion, its biggest single-day loss in value ever."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/virat-kohli-sister-bhawna-kohli-rubbishes-speculations-rift-with-anushka-sharma-2736596-2025-06-06",
      "headline": "Virat Kohli's sister rubbishes speculations of rift between her and Anushka SharmaVirat Kohli's sister Bhawna Kohli has shut down speculations of any rift between her brother and Anushka Sharma. Bhawna set the record straight in a now-deleted post. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ed-raids-dino-morea-residence-in-maharashtra-kerala-mumbai-in-mithi-river-desilting-scam-2736595-2025-06-06",
      "headline": "ED raids actor Dino Morea's residence in Maharashtra in River Mithi cleaning scamDino Morea had previously been questioned twice by the Economic Offences Wing (EOW) of the Mumbai Police, which initially registered the case."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/housefull-5-x-reviews-fans-call-it-entertaining-yet-illogical-bollywood-masala-2736611-2025-06-06",
      "headline": "Housefull 5 X reviews: Fans call it entertaining yet illogical Bollywood masalaAkshay Kumar's 'Housefull 5' has received positive reviews from fans on X, praising its comedy, star performances, and thrilling murder mystery twist. Audiences are eagerly waiting for the release of the second part to see how the story unfolds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbis-bumper-rate-cut-to-lower-home-auto-loan-emis-what-it-means-for-you-2736562-2025-06-06",
      "headline": "RBI's bumper rate cut to lower home, auto loan EMIs: What it means for youThe decision was announced after RBI Governor Sanjay Malhotra and the six-member Monetary Policy Committee (MPC) wrapped up their three-day review on Friday. This is the third consecutive rate cut, following back-to-back reductions earlier this year, including a 25-basis point cut in April."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shashi-tharoor-china-technology-operation-sindoor-india-pakistan-conflict-2736580-2025-06-06",
      "headline": "How India beat Chinese tech used by Pak during conflict? Shashi Tharoor explainsSpeaking in Washington DC, Shashi Tharoor said India recalibrated its military strategy in real-time during Operation Sidoor to counter threats from Chinese-supplied systems used by Pakistan, including integrated radar and missile networks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/trump-musk-clash-delay-indian-astronaut-shubhanshu-shukla-space-launch-2736511-2025-06-06",
      "headline": "Musk vs Trump: Will it affect Indian astronaut's launch to space?Elon Musk briefly threatened to decommission SpaceX's Dragon spacecraft after a public spat with Donald Trump over federal contracts, raising concerns over ISS missions and US-India space collaboration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/why-arbitrary-versary-might-be-killing-the-romance-in-your-relationship-2736209-2025-06-06",
      "headline": "Why arbitrary-versary might be killing the romance in your relationshipRelationship experts believe that remembering an anniversary isn't strictly necessary. What is of more importance is genuine care, attention and understanding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-shubhman-gill-captaincy-press-conference-gautam-gambhir-2736561-2025-06-06",
      "headline": "Not even in my dreams I thought I would lead India in Tests: Shubman GillShubman Gill claimed that he never dreamed about leading India one day in Tests ahead of heading to England ahead of the five-match Test series. Gill replaced Rohit Sharma as the captain of the Test team before the England tour. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/musk-to-retire-spacex-dragon-spacecraft-after-trump-threatens-contracts-glbs-2736469-2025-06-06",
      "headline": "Musk says SpaceX to decommission Dragon spacecraft amid Trump feud, then a U-turnElon Musk announced SpaceX will retire its Dragon spacecraft after President Trump threatened to cut government contracts. The move follows Trump's public criticism of Musk and growing tensions over political differences, marking a sharp break between the former allies amid a heated feud."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rcb-marketing-head-nikhil-sosale-on-way-to-mumbai-arrested-at-bengaluru-airport-in-case-of-stampede-2736502-2025-06-06",
      "headline": "RCB marketing head arrested, event firm officials detained over killer stampedeBengaluru police have arrested RCB marketing head Nikhil Sosale and detained three officials of event organising in connection with the stampede that killed 11 people. The action comes after the Karnataka government suspended top police officers amid criticism of mismanagement. "
    }
  ],
  "sports": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/rohit-sharma-father-was-disappointed-with-his-test-retirement-2736649-2025-06-06",
      "headline": "Rohit's father was disappointed with his Test retirement, India batter revealsStar India batter Rohit Sharma has revealed that his father was left disappointed following his retirement from Tests. Rohit called time on his Test career ahead of the all-important tour of England."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-league-t20-world-club-championship-ecb-bcci-2736641-2025-06-06",
      "headline": "Champions League T20 to return as World Club Championship? ECB chief reactsThe ECB are exploring the idea to have a World Club Championship for T20 cricket, more than a decade after the Champions League T20 became defunct. The CLT20 became defunct in 2014. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-rcb-vs-pbks-yuzvendra-chahal-injury-rj-mahvash-2736603-2025-06-06",
      "headline": "RJ Mahvash reveals Chahal played through injury in IPL 2025: Had 3 fracturesRJ Mahvash revealed that Yuzvendra Chahal played through injury during the IPL 2025 season for Punjab Kings after their loss in the final to RCB. Chahal had missed three games during the season due to a wrist injury. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/fan-asks-rishabh-pant-about-rohit-sharma-india-star-gives-hilarious-garden-reference-2736600-2025-06-06",
      "headline": "Fan asks Rishabh Pant about Rohit Sharma, India star gives hilarious garden referenceIndia wicketkeeper batter Rishabh Pant gave a hilarious answer when asked by a fan about Rohit Sharma's whereabouts at the airport. India left for England on Thursday, June 5."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/world-cup-qualifiers-brazil-vs-ecuador-carlo-ancelotti-argentina-2736584-2025-06-06",
      "headline": "Carlo Ancelotti's debut as Brazil coach ends in lacklustre draw against EcuadorCarlo Ancelotti's debut as the new Brazil coach was a lacklustre one as his side were held to a 0-0 draw by Ecuador in the World Cup qualifiers on Thursday, June 5. Argentina continued their fine run at the top of the standings with a 1-0 win over Chile. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/india-tour-of-england-gautam-gambhir-shubman-gill-full-press-conference-2736573-2025-06-06",
      "headline": "I am always under pressure, even after winning Champions Trophy: Gautam GambhirIndian cricket team head coach Gautam Gambhir said that he is always under pressure irrespective of the results he's achieved with the team. Gambhir's next assignment will be the five-match Test series against England, set to begin from June 20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/aryna-sabalenka-hungry-for-maiden-french-open-title-2736563-2025-06-06",
      "headline": "Aryna Sabalenka hungry for maiden French Open title: 'It would mean the world'Aryna Sabalenka said that it would mean the world to her if she goes on to win the French Open 2025 title. Sabalenka has won all three of her Grand Slam titles on hard courts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-shubhman-gill-captaincy-press-conference-gautam-gambhir-2736561-2025-06-06",
      "headline": "Not even in my dreams I thought I would lead India in Tests: Shubman GillShubman Gill claimed that he never dreamed about leading India one day in Tests ahead of heading to England ahead of the five-match Test series. Gill replaced Rohit Sharma as the captain of the Test team before the England tour. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-2025-day-13-schedule-novak-djokovic-jannik-sinner-carlos-alcaraz-2736549-2025-06-06",
      "headline": "French Open Day 13 schedule: Djokovic takes on Sinner, Alcaraz faces Musetti testThe men's singles semi-finals will take centre stage on Friday, June 6 as Novak Djokovic will square off against World No.1 Jannik Sinner, while defending champion Carlos Alcaraz will face the in-form Lorenzo Musetti. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohlis-test-retirement-was-driven-by-mental-fatigue-says-greg-chappell-2736529-2025-06-06",
      "headline": "Kohli's Test retirement driven by mental fatigue, not poor form: Greg ChappellFormer Australia cricketer Greg Chappell has revealed the real reason behind Virat Kohli's Test retirement, saying that the star batter bid adieu to the longest format due to lack of clarity and not poor form."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-team-new-head-coach-rob-walter-gary-stead-2736512-2025-06-06",
      "headline": "New Zealand name former South Africa coach Rob Walter as Gary Stead replacementRob Walter has been named as the new New Zealand head coach of the men's national team after Gary Stead left after his 7-year tenure came to an end. Walter worked as the head coach of the South Africa team till April this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/aryna-sabalenka-hungry-for-maiden-french-open-title-2736563-2025-06-06",
      "headline": "Aryna Sabalenka hungry for maiden French Open title: 'It would mean the world'Aryna Sabalenka said that it would mean the world to her if she goes on to win the French Open 2025 title. Sabalenka has won all three of her Grand Slam titles on hard courts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-shubhman-gill-captaincy-press-conference-gautam-gambhir-2736561-2025-06-06",
      "headline": "Not even in my dreams I thought I would lead India in Tests: Shubman GillShubman Gill claimed that he never dreamed about leading India one day in Tests ahead of heading to England ahead of the five-match Test series. Gill replaced Rohit Sharma as the captain of the Test team before the England tour. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-2025-day-13-schedule-novak-djokovic-jannik-sinner-carlos-alcaraz-2736549-2025-06-06",
      "headline": "French Open Day 13 schedule: Djokovic takes on Sinner, Alcaraz faces Musetti testThe men's singles semi-finals will take centre stage on Friday, June 6 as Novak Djokovic will square off against World No.1 Jannik Sinner, while defending champion Carlos Alcaraz will face the in-form Lorenzo Musetti. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohlis-test-retirement-was-driven-by-mental-fatigue-says-greg-chappell-2736529-2025-06-06",
      "headline": "Kohli's Test retirement driven by mental fatigue, not poor form: Greg ChappellFormer Australia cricketer Greg Chappell has revealed the real reason behind Virat Kohli's Test retirement, saying that the star batter bid adieu to the longest format due to lack of clarity and not poor form."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-team-new-head-coach-rob-walter-gary-stead-2736512-2025-06-06",
      "headline": "New Zealand name former South Africa coach Rob Walter as Gary Stead replacementRob Walter has been named as the new New Zealand head coach of the men's national team after Gary Stead left after his 7-year tenure came to an end. Walter worked as the head coach of the South Africa team till April this year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/shubman-gill-will-be-reborn-as-test-batter-at-virat-kohlis-position-deep-dasgupta-2736506-2025-06-06",
      "headline": "Shubman Gill will be reborn as Test batter at Virat Kohli's position: Deep DasguptaFormer India cricketer-turned commentator Deep Dasgupta has backed Shubman Gill to be reborn as a Test batter at Virat Kohli's batting position in the upcoming tour of England. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kl-rahuls-red-ball-return-in-focus-in-final-unofficial-test-vs-england-lions-2736490-2025-06-06",
      "headline": "KL Rahul's red-ball return in focus in final unofficial Test vs England LionsKL Rahul will aim to make the most of his first red-ball game in months ahead of the Test series against England. India A will take on England Lions in the second and final unofficial Test starting in Northampton on Friday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/french-open-2025-novak-djokovic-vs-jannik-sinner-2736489-2025-06-06",
      "headline": "Novak Djokovic vs Jannik Sinner: All you need to know about semis French Open 2025: 24-time Grand Slam champion Novak Djokovic will be up against World No.1 Jannik Sinner in the semi-final of the clay-court major on June 6 at Court Philippe-Chatrier. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-coco-gauff-vs-lois-bosson-aryna-sabalenka-iga-swiatek-2736452-2025-06-05",
      "headline": "Gauff ends French wildcard's fairytale, sets up final vs Swiatek-slayer SabalenkaWorld No. 2 Coco Gauff brought an end to French wildcard Lois Bosson's dream run with a commanding win in their women's singles semi-final on Thursday. Earlier in the day in Paris, Aryna Sabalenka stunned Iga Swiatek, snapping the Polish star's 26-match unbeaten streak on the red clay."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-pacer-brydon-carse-reveals-he-considered-toe-amputation-amid-injury-woes-2736453-2025-06-05",
      "headline": "England pacer Brydon Carse reveals he considered toe amputation amid injury woesEngland pacer Brydon Carse has said he contemplated amputating a toe to overcome a persistent and painful injury that kept him out of action for months.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/iga-swiatek-reaction-sabalenka-loss-french-open-semi-final-2736437-2025-06-05",
      "headline": "Swiatek fortunate for dominant French Open run after rare loss vs SabalenkaIga Swiatek's 26-match winning streak at the French Open came to a screeching halt as her title defence ended on Thursday, but the Pole said she was happy to have enjoyed a glorious run at the claycourt Grand Slam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-india-test-captaincy-style-england-bazball-challenge-2736429-2025-06-05",
      "headline": "Not fazed by Bazball, Shubman Gill aims to craft own Test captaincy styleSpeaking in Mumbai on the eve of India's departure to England, new Test captain Shubman Gill said he will be focussed on maintaining clairty and comfort in the dressing room. Gill will lead India in a five-Test series, starting June 20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-novak-djokovic-vs-jannik-sinner-semifinal-live-streaming-2736340-2025-06-05",
      "headline": "Novak Djokovic vs Jannik Sinner: When and where to watch semifinalFrench Open 2025: 24-time Grand Slam champion Novak Djokovic and World No.1 Jannik Sinner will lock horns in the second men's singles semi-finals on Friday, June 6 at Court Philippe-Chatrier. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-pacer-brydon-carse-reveals-he-considered-toe-amputation-amid-injury-woes-2736453-2025-06-05",
      "headline": "England pacer Brydon Carse reveals he considered toe amputation amid injury woesEngland pacer Brydon Carse has said he contemplated amputating a toe to overcome a persistent and painful injury that kept him out of action for months.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/iga-swiatek-reaction-sabalenka-loss-french-open-semi-final-2736437-2025-06-05",
      "headline": "Swiatek fortunate for dominant French Open run after rare loss vs SabalenkaIga Swiatek's 26-match winning streak at the French Open came to a screeching halt as her title defence ended on Thursday, but the Pole said she was happy to have enjoyed a glorious run at the claycourt Grand Slam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-india-test-captaincy-style-england-bazball-challenge-2736429-2025-06-05",
      "headline": "Not fazed by Bazball, Shubman Gill aims to craft own Test captaincy styleSpeaking in Mumbai on the eve of India's departure to England, new Test captain Shubman Gill said he will be focussed on maintaining clairty and comfort in the dressing room. Gill will lead India in a five-Test series, starting June 20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-novak-djokovic-vs-jannik-sinner-semifinal-live-streaming-2736340-2025-06-05",
      "headline": "Novak Djokovic vs Jannik Sinner: When and where to watch semifinalFrench Open 2025: 24-time Grand Slam champion Novak Djokovic and World No.1 Jannik Sinner will lock horns in the second men's singles semi-finals on Friday, June 6 at Court Philippe-Chatrier. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jofra-archer-luke-wright-england-vs-india-leeds-test-2736415-2025-06-05",
      "headline": "Jofra Archer could return for second Test vs India: Luke WrightENG vs IND: England national selector Luke Wright said that Jofra Archer is gradually recovering from his thumb injury and could be available for the Edgbaston Test against India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/iga-swiatek-aryna-sabalenka-semi-final-french-open-2736397-2025-06-05",
      "headline": "Aryna Sabalenka ends Iga Swiatek's dream run, through to maiden finalFrench Open 2025: Aryna Sabalenka stormed into the final of the clay-court major after beating four-time champion Iga Swiatek in three sets on Thursday on Centre Court. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pataudi-trophy-renamed-tendulkar-anderson-trophy-for-india-vs-england-tests-report-2736395-2025-06-05",
      "headline": "Pataudi Trophy renamed Tendulkar-Anderson Trophy for India vs England Tests: ReportThe India and England Test series will reportedly be played for a new trophy named after two cricketing legends, Sachin Tendulkar and James Anderson. Earlier, the winner of the bilateral Test series between India and England was awarded the Pataudi Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-jasprit-bumrah-test-series-gambhir-gambhir-no-4-batting-spot-2736385-2025-06-05",
      "headline": "Haven't yet decided on No. 4, Bumrah's workload in England Tests: Gautam GambhirIndia head coach Gautam Gambhir said that no final decision has been made yet regarding Jasprit Bumrah's workload or the No. 4 batting position for the upcoming five-match Test series against England, which begins on June 20.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/atiqa-mir-akcel-gp-10-year-old-indian-racing-prodigy-2736388-2025-06-05",
      "headline": "After F1, 10-year-old Indian racing prodigy gets backing from UAE-based AKCEL GP10-year-old racing prodigy, Atiqa Mir, received a big boost in her fast-growing racing career. AKCEL GP is a high-performance motorsport squad competing in FIA F4 and Formula Regional Middle East Championship besides FIA F3."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-tour-of-england-karun-nair-gautam-gambhir-press-conference-2736381-2025-06-05",
      "headline": "Gautam Gambhir hints at Karun Nair's Test return on England tour with extended runGautam Gambhir has hinted at Karun Nair's return to the Indian Test side during the England tour. Karun hit a double hundred while playing for India A against England Lions in a four-day practice game in Canterbury in June.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-on-bengaluru-stampede-rcb-victory-parade-2736362-2025-06-05",
      "headline": "Gambhir on Bengaluru stampede: Never believed we needed roadshows to celebrateIndia head coach Gautam Gambhir called the Bengaluru stampede, which claimed 11 lives and injured nearly 50, a tragic event and said he has always believed that such open-road celebrations are unnecessary.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kapil-dev-bengaluru-stampede-rcb-ipl-bash-celebration-2736319-2025-06-05",
      "headline": "Kapil Dev on stampede during RCB IPL bash: Lives more important than celebrationFormer India captain Kapil Dev said both organisers and the public should exercise caution, urging them to prioritise safety over celebration. Eleven were killed and over 40 were injured in a stampede outside the M Chinnaswamy Stadium on Wednesday, June 4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/satwik-rankireddy-chirag-shetty-indonesia-open-pv-sindhu-loss-2736315-2025-06-05",
      "headline": "Satwik and Chirag storm into Indonesia Open quarters as Sindhu exitsSatwiksairaj Rankireddy and Chirag Shetty kept India's hopes alive at the Indonesia Open with a gritty comeback win, entering the quarterfinals. However, it was a mixed day for the contingent, as PV Sindhu suffered a second-round exit following a hard-fought three-game loss in Jakarta."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-semifinals-aryna-sabalenka-iga-swiatek-coco-gauff-live-updates-2736305-2025-06-05",
      "headline": "Semi-finals Highlights: Gauff ends Boisson dream, sets up Sabalenka finalFrench Open 2025 Live Updates: It's all over for Iga Swiatek. The four-time champion has lost a match at Roland Garros for the first time since 2021. She has been beaten in three sets by World No. 1 Aryna Sabalenka. Coco Gauff is currently taking on Lois Boisson, the wildcard, in the second semi-final.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-india-test-captaincy-england-series-ricky-ponting-reaction-2736293-2025-06-05",
      "headline": "Shubman Gill won't find Test captaincy easy, needs to work on batting: PontingAustralian great Ricky Ponting believes Shubman Gill still has work to do on his Test batting and, with the added responsibility of leading India on the upcoming tour of England, he would be better off moving down to number four in the batting order.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/video/firooza-amiri-afghanistan-women-cricket-exclusive-interview-taliban-2736248-2025-06-05",
      "headline": "From fear to fight: Firooza Amiri stands tall for Afghan women's cricketIn an exclusive interview, Firooza Amiri opened up on the challenges faced by the Afghanistan women's cricketers after the Taliban takeover in 2021 and how they fled their motherland and took exile in Australia. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}