{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/gautam-adani-fresh-scrutiny-us-prosecutors-iranian-oil-imports-report-2734610-2025-06-02",
      "headline": "Adani faces US scrutiny over Iran LPG 'links', denies role, says unaware of probeGautam Adani's firms are under scrutiny from US prosecutors for reportedly importing Iranian LPG into India through Mundra port. A spokesperson denied the company's involvement and said it was not aware of such a probe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/40-and-earning-rs-25-lakh-per-month-here-is-how-you-can-save-rs-1-crore-in-just-5-years-2734520-2025-06-02",
      "headline": "Rs 1 crore in 5 years: Check this guide for 40-year-olds earning Rs 2.5 lakh/monthIf you're earning Rs 2.5 lakh a month, building a corpus of Rs 1 crore in just five years may sound ambitious, but it's certainly achievable with the right planning, discipline, and smart investments. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-likely-to-become-a-30-trillion-dollar-economy-by-2047-says-amitabh-kant-former-niti-aayog-ceo-2734534-2025-06-02",
      "headline": "India likely to become a $30 trillion economy by 2047, says Amitabh KantAt present, India's economy is valued at around $4 trillion. It recently became the fourth largest economy in the world. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/tesla-not-coming-india-union-minister-hd-kumaraswamy-report-2734482-2025-06-02",
      "headline": "Tesla not ready to Make in India, says Union Minister: ReportThe Union Minister said that Tesla is not expected to begin manufacturing vehicles in India in the near future. He mentioned that the company is currently interested only in opening showrooms in the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/market-closing-bell-sensex-closes-77-points-lower-nifty-below-24700-adani-ports-gains-2-percent-2734450-2025-06-02",
      "headline": "Sensex closes 77 points lower, Nifty below 24,700; Adani Ports gains 2%The S&P BSE Sensex was down by 77.26 points to close at 81,373.75, while the NSE Nifty50 lost 34.10 points to end at 24,716.60. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-extends-uan-aadhaar-linking-deadline-for-eli-scheme-to-june-30-check-steps-2734401-2025-06-02",
      "headline": "EPFO extends UAN-Aadhaar linking deadline for ELI scheme to June 30. Check stepsAs per a recent circular issued by the EPFO, the new last date to activate your UAN and link your Aadhaar-linked bank account is June 30, 2025. This deadline has already been pushed back several times, giving employees extra time to complete the process."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/reliance-power-price-rise-today-8-percent-gradual-increase-what-should-investors-know-2734379-2025-06-02",
      "headline": "Reliance Power shares surge 8% today, 23% in last week. Should you buy?Reliance Power share price: Over the last six months, it has gone up by 59.92%. The stock has more than doubled in a year with a 141.40% rise. Over the last five years, the rise has been massive; 2,602.61%."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/living-paycheck-to-paycheck-analyst-says-india-has-worst-family-financial-planning-2734347-2025-06-02",
      "headline": "Living paycheck to paycheck: Analyst says India has worst family financial planningAn analyst said that in 2025 we need to teach kids not just how to earn money but how to manage it. He pointed out a common but dangerous mindset, the one with no room for budgeting, risk awareness, or financial learning. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-mpc-meeting-expectation-june-2025-rate-cut-on-card-25-bps-2734327-2025-06-02",
      "headline": "RBI MPC: 25 bps rate cut on the cards? Here's all you need to knowSo far in 2025, the RBI has already cut the repo rate twice, once in February and then in April, by 25 bps each time. These cuts brought the key lending rate down to 6%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/nps-pensioners-to-get-more-benefits-under-unified-pension-scheme-ups-details-here-2734290-2025-06-02",
      "headline": "NPS pensioners to get more benefits under Unified Pension Scheme. Details hereEligible NPS retirees can either get a one-time payment based on their last drawn Basic Pay and Dearness Allowance (DA) for every six months of service, or receive a monthly top-up if their current pension is less than what they'd get under UPS with Dearness Relief."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/leela-hotels-listing-opening-share-price-discount-7-percent-nse-bse-market-debut-2734250-2025-06-02",
      "headline": "Leela Hotels share price: Stock lists at 7% discount on Dalal StreetThe company's stock opened at Rs 406 on the NSE, which is Rs 29 below the issue price of Rs 435. On the BSE, it opened slightly higher at Rs 406.50, still lower by Rs 28.50, or about 6.55%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-crash-today-why-is-sensex-and-nifty-falling-gdp-growth-global-cues-us-china-2734224-2025-06-02",
      "headline": "Sensex tumbles 700 points. Why is stock market falling despite strong GDP growth?The BSE Sensex was down 732.71 points to 80,718.30 around 9:25 am, while the NSE Nifty50 traded 197.45 points lower at 24,553.25. Most of the broader market indices also fell sharply amid a surge in volatility."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/disney-lays-off-hundreds-globally-as-part-of-ongoing-restructuring-plan-glbs-2734752-2025-06-03",
      "headline": "Disney lays off hundreds globally as part of ongoing restructuring planDisney has laid off several hundred employees globally across departments as part of CEO Bob Iger's restructuring plan to reduce costs and pivot towards streaming, continuing efforts to optimize operations and boost profitability.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jonathan-joss-king-of-the-hill-actor-fatally-shot-by-neighbor-in-san-antonio-glbs-2734751-2025-06-03",
      "headline": "Jonathan Joss, 'King of the Hill' actor, fatally shot by neighbor in San AntonioActor Jonathan Joss, known for King of the Hill, was fatally shot by a neighbor during an argument in San Antonio. The suspect was arrested and charged with murder. Investigation is ongoing.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ram-gopal-varma-deletes-post-supporting-kamal-haasan-in-thug-life-row-2734647-2025-06-02",
      "headline": "RGV criticises backlash against Kamal Haasan's Thug Life, deletes tweet laterFilmmaker Ram Gopal Varma deleted his post where he supported actor Kamal Haasan amid threats to ban 'Thug Life' in Karnataka. Varma questioned democracy over rising intolerance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/rapper-cardi-b-confirms-relationship-with-footballer-stefon-diggs-ex-offset-reacts-2734597-2025-06-02",
      "headline": "Rapper Cardi B confirms relationship with footballer Stefon Diggs, ex Offset reactsAmerican rapper Cardi B's ex-husband Offset subtly reacted to her public romance with NFL star Stefon Diggs. The singer-rapper later deleted his cryptic post."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ishaan-khatter-grooves-to-bts-mic-drop-fans-praise-miss-world-2025-2734527-2025-06-02",
      "headline": "Fans praise Ishaan Khatter as he grooves to BTS' MIC DropActor Ishaan Khatter shared a clip from his Miss World 2025 performance where he performed on BTS' MIC Drop. Fans compared his dance moves to American singer-musician Bruno Mars."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/rekha-film-umrao-jaan-set-to-re-release-in-theatres-2734609-2025-06-02",
      "headline": "Rekha's cult classic Umrao Jaan set to return to theatresBollywood classic 'Umrao Jaan', starring Rekha, is returning to theatres on June 27 in a newly restored 4K version. The re-release is accompanied by a special coffee table book offering rare behind-the-scenes insights.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sonali-bendre-duplicate-shah-rukh-khan-disappointment-hum-saath-saath-hain-salman-khan-2734365-2025-06-02",
      "headline": "Sonali Bendre on disappointment with Duplicate: Grey role became one-dimensionalActor Sonali Bendre shared her disappointment with her role in 'Duplicate', saying it turned out to be very one-dimensional. She also recalled fun memories with Salman Khan during 'Hum Saath Saath Hain' and spoke about the struggles of shooting in heavy costumes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dhanush-confirms-vada-chennai-2-to-go-on-floors-2026-2734560-2025-06-02",
      "headline": "Dhanush confirms Vada Chennai 2 filming to begin next yearAfter years of speculation and fan anticipation, Dhanush has officially announced the sequel to his acclaimed gangster drama 'Vada Chennai'. The project will reunite him with director Vetrimaaran, with production to start next year.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bhool-chuk-maaf-ott-release-rajkummar-rao-wamiqa-gabbi-film-2734566-2025-06-02",
      "headline": "Bhool Chuk Maaf OTT release: When and where to watch Rajkummar-Wamiqa starrer filmRajkummar Rao and Wamiqa Gabbi's 'Bhool Chuk Maaf' will premiere on Prime Video on June 6, just two weeks after its theatrical release. Originally planned for a direct OTT debut, the film hit cinemas on May 23. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sooraj-pancholi-bollywood-self-destruction-industry-rivalry-unity-issues-2734493-2025-06-02",
      "headline": "Actor Sooraj Pancholi says Bollywood is caught in a vicious cycleActor Sooraj Pancholi spoke about Bollywood's vicious cycle and self-destruction. He urged kindness and unity to save the industry from further downfall."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kartik-aaryan-ananya-panday-hint-at-youthful-love-story-in-tu-meri-main1st-look-2734578-2025-06-02",
      "headline": "Kartik Aaryan, Ananya Panday tease youthful romance in Tu Meri Main…first lookKartik Aaryan and Ananya Panday hinted at a youthful love story in the first look poster from their upcoming film, 'Tu Meri Main Tera, Main Tera Tu Meri'. The film is slated to hit the screens in February 2026. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/anushka-shetty-ghaati-set-for-july-2025-theatrical-release-poster-out-2734528-2025-06-02",
      "headline": "Anushka Shetty's Ghaati to release in theatres in July 2025, new poster outAfter facing multiple delays, 'Ghaati', the much-awaited action-crime drama starring actor Anushka Shetty is set for a release on July 11. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/pratik-shah-likely-to-exit-sourav-ganguly-biopic-amid-sexual-harassment-row-report-2734398-2025-06-02",
      "headline": "Cinematographer Pratik to exit Ganguly biopic amid sexual misconduct row: ReportCinematographer Pratik Shah, who has been accused of sexual harassment based on testimonies of multiple women, is likely to be dropped from the Sourav Ganguly biopic, suggested reports. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/bts-countdown-2025-discharge-dates-comeback-clues-ot7-reunion-buzz-2734503-2025-06-02",
      "headline": "BTS countdown 2025: Discharge dates, comeback clues, OT7 reunion buzzBTS begins their reunion as members complete military service this June. A comeback is expected soon, with 2025 full-group plans underway. Their FESTA skit revealed the theme Twelve O'Clock, symbolising new beginnings for ARMY."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shabana-azmi-farhan-akhtar-adorable-throwback-moment-2734504-2025-06-02",
      "headline": "Shabana Azmi shares adorable throwback with betu Farhan AkhtarVeteran actor Shabana Azmi shared a heartwarming throwback photo with Farhan Akhtar. The photo was from Farhan's wedding with Shibani Dandekar in 2022. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/neeraj-ghaywan-homebound-inspired-by-a-powerful-pandemic-era-true-story-new-york-times-cannes-2025-2734513-2025-06-02",
      "headline": "Neeraj Ghaywan shares Homebound was inspired by powerful pandemic-era true storyDirector Neeraj Ghaywan shared a series of posts on X and revealed that his film 'Homebound' is inspired by a powerful pandemic-era true story. He even thanked the entire team for their efforts behind the film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/radhika-apte-on-how-industry-isnt-conducive-to-new-mothers-its-really-difficult-2734348-2025-06-02",
      "headline": "Radhika Apte on how industry isn't conducive to new mothers: It's really difficultRadhika Apte recently opened up about the challenges faced by new mothers in the Indian film industry and navigating family time amid her work schedule."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/why-mahesh-babus-khaleja-is-finally-getting-the-love-it-missed-15-years-ago-2734442-2025-06-02",
      "headline": "Why Mahesh Babu's Khaleja is finally getting the love it missed 15 years agoFifteen years after its original release, Khaleja is winning hearts with its re-release. The film's unique story and memorable performances have finally found the appreciation they deserve."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/virat-kohli-confession-about-anushka-sharma-in-cute-dubai-ad-makes-fans-blush-2734456-2025-06-02",
      "headline": "Virat Kohli's cute confession about Anushka Sharma in Dubai ad makes fans blushAnushka Sharma and Virat Kohli have teamed for a new campaign promoting Dubai Tourism. While the couple highlight the city's attractions through the promotional film, their chemistry is just unmissable. \r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/government-to-launch-portal-for-registration-of-waqf-properties-on-june-6-2734695-2025-06-02",
      "headline": "Government to launch portal for registration of Waqf properties on June 6The portal, which stands for 'Unified Waqf Management, Empowerment, Efficiency, and Development', will serve as a centralised platform for registering Waqf properties nationwide, sources said."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/sharmishtha-panoli-case-man-who-filed-complaint-against-instagram-influencer-missing-claims-his-father-2734585-2025-06-02",
      "headline": "Man who filed case against Sharmistha Panoli missing, claims his fatherWajahat Khan, the complainant in the case that led to Panoli's arrest, has reportedly gone missing. His father, Saadat Khan, in an interview with Aaj Tak, India Today's sister channel, claimed that his son had not been seen since Sunday night. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/vladimir-putin-ukraine-russia-war-drone-strikes-ian-bremmer-donald-trump-peace-overtures-2734691-2025-06-02",
      "headline": "Putin thought time was on his side, Ukraine proved him wrong: Ian BremmerIn an exclusive interview with India Today TV, geopolitical expert Ian Bremmer said that Russia's Vladimir Putin had been unwilling to take any meaningful steps that would bring him to the table for a peace deal with Ukraine."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/west-bengal/story/eid-al-adha-namaaz-prayers-red-road-kolkata-indian-army-eastern-command-calcutta-khilafat-committee-2734608-2025-06-02",
      "headline": "How Eid prayers at Kolkata's Red Road saw a flip-flop-flipThere was uncertainty over Eid al-Adha prayers at Red Road, a defence property passing through Kolkata's Maidan area. Now, the Army has decided to tweak its engagements to allow the century-old namaaz tradition near its Eastern Command Headquarters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/fact-check/story/ukraine-zelenskyy-spiders-web-russia-360-view-earth-sky-2734615-2025-06-02",
      "headline": "How Zelenskyy's spiders spit fire on Russia — a 360 view from Earth & skyOperation Spider's Web, Ukraine's Sunday assault on Russia, has been hailed worldwide as a grand espionage success story. Here's how it unfolded at the five target locations. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/salman-khurshid-congress-tweet-all-party-delegations-op-sindoor-pak-terrorism-2734480-2025-06-02",
      "headline": "Salman Khurshid drops cryptic post amid Op Sindoor outreach duty; jab at Congress?Senior Congress leader Salman Khurshid questioned why it was difficult to be patriotic when the all-party delegations were on a mission to convey India's anti-terrorism stance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/dmk-mp-kanimozhi-all-party-delegation-in-spain-replies-to-indias-national-language-question-2734735-2025-06-03",
      "headline": "In Spain, Kanimozhi's 'diversity' reply to India's national language questionKanimozhi was questioned by the members of the Indian Diaspora on the National Language of India, to which she replied, 'Unity in Diversity'. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/gautam-adani-fresh-scrutiny-us-prosecutors-iranian-oil-imports-report-2734610-2025-06-02",
      "headline": "Adani faces US scrutiny over Iran LPG 'links', denies role, says unaware of probeGautam Adani's firms are under scrutiny from US prosecutors for reportedly importing Iranian LPG into India through Mundra port. A spokesperson denied the company's involvement and said it was not aware of such a probe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/video-italys-mount-etna-erupts-spews-ash-thousands-of-feet-in-air-2734580-2025-06-02",
      "headline": "Watch: Mount Etna's gigantic eruption caught on cameraThe eruption produced a significant pyroclastic flow—a fast-moving current of hot gas, ash, and volcanic rock—emanating from the central crater."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-delegation-brief-pm-outreach-meeting-likely-2734509-2025-06-02",
      "headline": "Op Sindoor delegations to meet PM next week, brief him about outreachThe delegations, comprising Members of Parliament from across the political spectrum, senior political leaders, and seasoned diplomats, were tasked with engaging the international community to present India's position and garner global support for its fight against terrorism."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/russia-ukraine-peace-talks-conclude-pearl-harbour-moment-2734587-2025-06-02",
      "headline": "Russia-Ukraine peace talks end within an hour day after Moscow aircraft hitThe mood in Russia was angry as the talks kicked off, with influential war bloggers calling on Moscow to deliver a fearsome retaliatory blow against Kyiv after Ukraine on Sunday launched one of its most ambitious attacks of the war, targeting Russian nuclear-capable long-range bombers in Siberia and elsewhere."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/as-upbeat-indian-economy-closes-gap-with-japan-germany-the-real-test-will-be-at-the-podium-2734414-2025-06-02",
      "headline": "As upbeat Indian economy closes gap with Japan, Germany, the real test will be at the podiumCan India use its growing economic weight to build enduring competitiveness, create wide-scale jobs and avoid the middle-income trap?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/ajay-devgn-kajol-and-mansplaining-in-full-view-it-wasnt-his-question-to-answer-2734422-2025-06-02",
      "headline": "Ajay Devgn, Kajol and mansplaining in full view: It wasn't his question to answerIn the full view of the media, actor Ajay Devgn answered a question which was addressed to Kajol, at the trailer launch of 'Maa'. Here's just saying that when a woman is asked about her experience, let her speak. Don't take the mic, or her moment!"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/bangladesh-muhammad-yunus-interim-government-tax-free-status-for-july-warriors-same-as-liberation-war-1971-2734535-2025-06-02",
      "headline": "Anti-Hasina warriors get tax relief like 1971 freedom fightersBangladesh's interim government of Muhammad Yunus has granted personal tax exemption for income of up to 5.25 lakh taka to wounded 'July Warriors' — the protesters who took part in the agitation against Prime Minister Sheikh Hasina. The war-wounded freedom fighters of the 1971 Bangladesh Liberation War will also get a similar tax exemption."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-rcb-vs-pbks-shreyas-iyer-rajat-patidar-press-conference-2734664-2025-06-02",
      "headline": "Relaxed and ready: Shreyas Iyer, Rajat Patidar share laughs before big finalIPL 2025 Final: On the eve of a high-stakes IPL final with history on the line, captains Shreyas Iyer and Rajat Patidar kept the mood light, trading laughs and banter in a surprisingly relaxed press conference in Ahmedabad's Narendra Modi Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-fpv-drones-future-wars-expert-ukraine-operation-spider-web-russian-airbases-strikes-2734465-2025-06-02",
      "headline": "India preparing for similar scenarios: Expert on Ukraine's drone strikes on RussiaReacting to Ukraine's Operation Spider's Web, in which Kyiv targeted Russian airbases, ammunition, explosives and UAV expert Col Devesh Singh (retd) said India was preparing for future conflicts in similar scenarios with FPV drones, counter drones and air defence innovations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/are-you-wearing-cancerous-chemicals-in-branded-clothes-2734410-2025-06-02",
      "headline": "Are you wearing cancerous chemicals in branded clothes?A new research has flagged latent health risks to men, women and children from wide-ranging use of deadly Nonylphenol and Nonylphenol Ethoxylates in garment production\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ranchi-bound-indigo-flight-suffers-bird-hit-at-4000-feet-makes-emergency-landing-2734529-2025-06-02",
      "headline": "Ranchi-bound IndiGo flight suffers bird hit at 4,000 feet, makes emergency landingAn IndiGo flight coming from Patna to Ranchi had to make an emergency landing after it was hit by a vulture midair. All passengers and crew on-board are safe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/emmanuel-macrons-wax-statue-stolen-from-paris-museum-report-2734617-2025-06-02",
      "headline": "Emmanuel Macron's wax statue stolen from Paris museum: ReportThe wax statue of French President Emmanuel Macron was allegedly taken away by several people claiming to be Greenpeace environmental activists."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/chirag-paswan-bihar-assembly-election-pressure-tactic-on-bjp-or-strategy-to-replace-nitish-kumar-2734446-2025-06-02",
      "headline": "Chirag Paswan's Bihar bid: Pressure tactic on BJP or strategy to replace Nitish?Chirag Paswan's growing push to contest the Bihar assembly elections from a general seat signals his ambition to shift from national to state politics, potentially eyeing the Chief Minister's post. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/ukraine-russia-drone-strike-spiders-web-modern-pearl-harbour-original-world-war-attack-harvard-japan-us-2734367-2025-06-02",
      "headline": "How a Harvard-educated Admiral planned Pearl Harbour attack on USUkraine covertly transported drones deep inside Russian territory and used them to destroy over 40 bomber planes. It was branded the \"modern Pearl Harbour\" moment by Russian media and experts. This is all about the original Pearl Harbour attack by the Japanese on the US fleet that changed the course of WWII, and history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/environment/story/summer-ended-before-it-began-in-2025-whats-behind-the-dramatic-shift-2734425-2025-06-02",
      "headline": "Why did summer end before it began in 2025?As May 2025 unfolded, instead of the expected peak summer heat, large parts of India experienced comparatively cooler temperatures, and less number of heatwave days marked by unseasonal rains and thunderstorms. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/5-takeaways-from-ukraines-operation-spiders-web-2734253-2025-06-02",
      "headline": "Russia's Pearl Harbour moment: 5 takeaways from Ukraine's stunning attackUkrainian special forces executed one of the largest and most complex drone-based special operations in modern warfare, destroying 41 Russian aircraft across multiple airbases using over 100 drones launched from disguised shipping containers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/neet-pg-2025-postponed-after-supreme-court-directs-exam-to-be-held-in-single-shift-2734579-2025-06-02",
      "headline": "NEET PG 2025 postponed after Supreme Court directs exam to be held in single shiftNEET PG 2025 has been postponed after the Supreme Court directed that the exam must be held in a single shift. The decision was made to ensure transparency and fairness for all candidates. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/magnus-carlsen-on-d-gukesh-norway-chess-fighting-spirit-2734734-2025-06-03",
      "headline": "Calm after the storm, Magnus Carlsen praises Gukesh's fighting skillsMagnus Carlsen acknowledged D Gukesh's energy and fighting qualities after his shock loss to the world champion in Round 6 of Norway Chess 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-pbks-vs-rcb-predicted-xi-team-news-injury-list-2734713-2025-06-02",
      "headline": "IPL final predicted XI, team news: Will RCB get Tim David boost?IPL 2025 final, RCB vs PBKS: Royal Challengers Bengaluru will hope to have their big-hitting finisher TIm David back for the big clash. Yuzvendra Chahal, meanwhile, is a doubtful starter for Punjab Kings due to a wrist injury.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-punjab-kings-coach-virat-kohli-crowd-ahmedabad-2734704-2025-06-02",
      "headline": "Pro-Kohli crowd in IPL final: PBKS coach ready for tough battle in AhmedabadPunjab's fast-bowling coach James Hopes said his team would be \"recovering and getting mentally prepared\" for what he expects will be \"a pretty big crowd, and a pretty big pro-Kohli crowd as well, in the IPL 2025 final in Ahmedabad.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-a-vs-england-lions-1st-unofficial-test-draw-jurel-yashasvi-karun-abhimanyu-sarfaraz-2734693-2025-06-02",
      "headline": "India A batters shine, bowlers struggle vs England Lions in drawn unofficial TestAfter the England Lions posted 587 in reply to India A's 557, Yashasvi Jaiswal, Abhimanyu Easwaran, Dhruv Jurel and Nitish Kumar Reddy made the most of batting-friendly conditions with fluent half-centuries, gaining valuable confidence ahead of the second unofficial Test in Northampton on June 6."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-lois-boisson-madison-keys-mirra-andreeva-zverev-quarterfinals-2734685-2025-06-02",
      "headline": "Boisson lowest-ranked quarterfinalist in 40 years, Zverev rolls onFrench Open 2025: Loïs Boisson stunned world No. 3 Jessica Pegula to become the lowest-ranked player to reach the Roland Garros quarterfinals in 40 years. Fellow American Madison Keys held off a late challenge from Hailey Baptiste, while teenager Mirra Andreeva became the youngest player in nearly 30 years to reach back-to-back French Open quarterfinals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-2025-day-9-results-novak-djokovic-cameron-norrie-roland-garros-2734684-2025-06-02",
      "headline": "French Open: Djokovic breezes into quarters, secures 100th win at Roland GarrosNovak Djokovic secured his 100th win at Roland Garros and made it to his 19th quarter-final at the French Open with a straight-sets win over Cameron Norrie on Monday, June 2. Djokovic joined Nadal in an elite list with his win on Monday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-rcb-vs-pbks-shreyas-iyer-on-ricky-ponting-man-manager-2734665-2025-06-02",
      "headline": "Monk-like Ricky Ponting amazing man manager: Shreyas IyerIPL 2025: Captain Shreyas Iyer credited Ricky Ponting's calm leadership and equal treatment of players as a key reason behind Punjab Kings' resurgence in IPL 2025, as they prepare to face RCB in the historic final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-rcb-vs-pbks-shreyas-iyer-rajat-patidar-press-conference-2734664-2025-06-02",
      "headline": "Relaxed and ready: Shreyas Iyer, Rajat Patidar share laughs before big finalIPL 2025 Final: On the eve of a high-stakes IPL final with history on the line, captains Shreyas Iyer and Rajat Patidar kept the mood light, trading laughs and banter in a surprisingly relaxed press conference in Ahmedabad's Narendra Modi Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-rcb-vs-pbks-shreyas-iyer-sleep-press-conference-2734656-2025-06-02",
      "headline": "I couldn't sleep: Shreyas Iyer keeps fire burning bright ahead of IPL 2025 finalShreyas Iyer said he barely slept after Punjab Kings' dramatic win over Mumbai Indians, a result that sealed their place in the IPL 2025 final. Iyer, however, admitted he remains restless as Punjab prepares to face Royal Challengers Bangalore in the title clash in Ahmedabad.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-number-18-jersey-retirement-tests-mukesh-kumar-2734654-2025-06-02",
      "headline": "Will BCCI retire Virat Kohli's No.18 jersey from Tests after retirement?The Indian Test team won't have anyone wearing Virat Kohli's No.18 jersey in the near future after the star batter announced his retirement from the format in May. Mukesh Kumar was seen wearing the jersey number during India A's match against England Lions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-rcb-vs-pbks-head-to-head-key-player-battles-2734620-2025-06-02",
      "headline": "RCB vs PBKS: Head-to-head and key player battles to watch out forIPL 2025 Final, RCB vs PBKS: Royal Challengers Bengaluru (RCB) will take on Punjab Kings (PBKS) at the Narendra Modi Stadium in Ahmedabad on Tuesday, June 3, in the final of the Indian Premier League 2025. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-rcb-vs-pbks-shreyas-iyer-on-ricky-ponting-man-manager-2734665-2025-06-02",
      "headline": "Monk-like Ricky Ponting amazing man manager: Shreyas IyerIPL 2025: Captain Shreyas Iyer credited Ricky Ponting's calm leadership and equal treatment of players as a key reason behind Punjab Kings' resurgence in IPL 2025, as they prepare to face RCB in the historic final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-rcb-vs-pbks-shreyas-iyer-rajat-patidar-press-conference-2734664-2025-06-02",
      "headline": "Relaxed and ready: Shreyas Iyer, Rajat Patidar share laughs before big finalIPL 2025 Final: On the eve of a high-stakes IPL final with history on the line, captains Shreyas Iyer and Rajat Patidar kept the mood light, trading laughs and banter in a surprisingly relaxed press conference in Ahmedabad's Narendra Modi Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-rcb-vs-pbks-shreyas-iyer-sleep-press-conference-2734656-2025-06-02",
      "headline": "I couldn't sleep: Shreyas Iyer keeps fire burning bright ahead of IPL 2025 finalShreyas Iyer said he barely slept after Punjab Kings' dramatic win over Mumbai Indians, a result that sealed their place in the IPL 2025 final. Iyer, however, admitted he remains restless as Punjab prepares to face Royal Challengers Bangalore in the title clash in Ahmedabad.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-number-18-jersey-retirement-tests-mukesh-kumar-2734654-2025-06-02",
      "headline": "Will BCCI retire Virat Kohli's No.18 jersey from Tests after retirement?The Indian Test team won't have anyone wearing Virat Kohli's No.18 jersey in the near future after the star batter announced his retirement from the format in May. Mukesh Kumar was seen wearing the jersey number during India A's match against England Lions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-final-rcb-vs-pbks-head-to-head-key-player-battles-2734620-2025-06-02",
      "headline": "RCB vs PBKS: Head-to-head and key player battles to watch out forIPL 2025 Final, RCB vs PBKS: Royal Challengers Bengaluru (RCB) will take on Punjab Kings (PBKS) at the Narendra Modi Stadium in Ahmedabad on Tuesday, June 3, in the final of the Indian Premier League 2025. \r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}