{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-sensex-opens-168-points-lower-nifty-below-24800-hul-gains-4-percent-2764538-2025-08-01",
      "headline": "Sensex opens 168 points lower, Nifty below 24,800; HUL gains 4%Sensex opens 168 points lower, Nifty below 24,800; HUL gains 4%"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-new-tariff-rate-69-countries-august-7-us-news-trade-deal-india-syria-eu-china-canada-2764532-2025-08-01",
      "headline": "Trump's new tariffs hit 69 nations: See who pays most and least from August 7The new order on tariffs will take effect from August 7 and will range from 10% to 41%, depending on the country, while others not mentioned in the list will face a default import duty of 10%."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/enforcement-directorate-summons-anil-ambani-on-august-5-a-week-after-raids-at-several-locations-linked-to-him-2764516-2025-08-01",
      "headline": "ED summons Anil Ambani on August 5 amid fresh raids in Odisha, BengalAnil Ambani has been asked to appear before officials on August 5 at the ED headquarters in New Delhi."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/indian-refiners-halt-russian-oil-buys-amid-shrinking-deals-report-glbs-2764501-2025-08-01",
      "headline": "Indian state refiners halt Russian oil imports as US threatens penalty: ReportState-run refiners in India have halted Russian oil purchases in the past week due to shrinking discounts and mounting pressure from former US President Donald Trump's threats of tariffs and sanctions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/womens-workforce-participation-is-very-low-kalpana-viswanath-ceo-safetipin-2764307-2025-07-31",
      "headline": "Women's workforce participation is very low; Kalpana Viswanath, CEO SafetipinIn a powerful discussion on women's rights and safety, a call was made for systemic change over waiting for patriarchal mindsets to shift. 'We just need the right to walk safely without looking over our shoulders,' one speaker emphasised, highlighting that safety is a right, not a form of protection. The conversation revealed that women hold less than 2% of jobs in the burgeoning gig economy, a stark contrast to their participation in the traditional economy. The panel also explored how urban infrastructure and product design often have a male-as-norm bias, from the height of bus handrails to the lack of pockets in women's clothing. The dialogue touched upon the 'pink tax' in transportation, where trip-chaining results in higher travel costs for women. The need for an enabling environment, including better public transport and services, was stressed as crucial for women's economic and social participation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/fenesta-cmo-susmita-nag-discusses-gender-bias-in-hiring-within-professional-workspaces-2764268-2025-07-31",
      "headline": "Fenesta CMO Susmita Nag discusses gender bias in hiring within professional workspacesA discussion highlights the stark reality for women in India's corporate sector, where they make up only 18% of the workforce in top NSE-listed companies. A woman leader recounted her early career in the late 90s, where she was told the company 'don't hire girls' and faced a lack of basic facilities like restrooms and proper safety gear in a factory setting. Another speaker addressed the issue of tokenism on corporate boards, suggesting that having three or more women in a group forms a cohort, whereas one is mere tokenism. The conversation delved into unconscious biases in hiring, noting that women's resumes are scrutinised for marital status more often than men's. The speakers emphasised that while policies like flexi-working exist, they can lead to subtle penalties and that a fundamental mindset shift, beyond just policy changes, is crucial for true gender equity in the workplace."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/itr-refund-delayed-check-your-status-in-these-2-easy-ways-2764267-2025-07-31",
      "headline": "ITR refund delayed? Check your status in these 2 easy waysUsually, if your return is e-verified, the refund is credited within four to five weeks. But if you're still waiting, you can easily check your refund status online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/lead-from-the-front-pallavi-shroff-on-breaking-barriers-building-legacies-2764235-2025-07-31",
      "headline": "Lead from the front: Pallavi Shroff on breaking barriers, building legaciesSpeaking at the India Today Woman Summit 2025, Pallavi S Shroff, Managing Partner, Shardul Amarchand Mangaldas said that when she began her practice in 1981, there were barely four or five women arguing cases in court. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-will-take-all-steps-to-protect-national-interests-piyush-goyal-on-us-tariffs-2764217-2025-07-31",
      "headline": "India set to be 3rd largest economy: Minister after Trump's 'dead economy' jabThe minister's remarks come amid rising concerns over the broader implications of the US move, including potential delays to the ongoing trade deal talks and uncertainty in sectors heavily reliant on US markets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/women-had-to-work-twice-as-hard-pallavi-shroff-reflects-on-male-dominated-profession-2764126-2025-07-31",
      "headline": "Women had to work twice as hard: Pallavi Shroff reflects on male-dominated professionPallavi Shroff, Managing Partner at Shardul Amarchand Mangaldas & Co., spoke on her four-decade journey in a male-dominated legal profession. Shroff stated that when she began, women had to 'work twice as hard to prove that we are half as good as our male colleagues'. She recounted starting her practice in 1981, facing clients who refused to meet a woman lawyer and judges who were dismissive. A significant turning point came in 1991 when a client, for a matter in the Allahabad High Court, chartered a flight for her as she was unable to travel by train after a surgery. Shroff also discussed the challenges for women in the Indian judiciary, the existence of unconscious bias, the handling of an $11 billion deal by an all-women team, and her view that leadership means leading from the front with humility and compassion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/nsdl-mb-engineering-sri-lotus-ipo-best-listing-gains-latest-gmp-subscription-2764201-2025-07-31",
      "headline": "NSDL vs M&B Engineering vs Sri Lotus: Which one shows the best listing gains?While all three IPOs have seen investor interest, one of them appears to offer the highest possible listing gains based on current grey market premium (GMP) data."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-donald-trump-trade-tariff-blow-25-percent-india-what-is-at-stake-2764192-2025-07-31",
      "headline": "US trade tariff blow: How much can India really lose?Analysts say the direct hit could affect over $3 billion worth of annual shipments, though the broader impact on India's GDP is expected to be limited."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranbir-kapoor-arjun-kapoor-bromance-shines-step-out-for-outing-viral-videos-2764548-2025-08-01",
      "headline": "Ranbir and Arjun Kapoor's bromance shines as they step out for outing. WatchRanbir Kapoor and Arjun Kapoor stepped out for an outing together on July 31. Videos of the two posing for the paparazzi with their friends have gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/vaibhav-raj-gupta-on-breaking-the-gullak-annu-bhaiya-mould-in-vikram-singh-mandala-murders-exclusive-2764243-2025-08-01",
      "headline": "Actor Vaibhav Raj Gupta on breaking the Gullak mould in Mandala MurdersVaibhav Raj Gupta, best known as the lovable Annu Bhaiya from TVF's 'Gullak', took a bold leap into darker territory with Netflix's 'Mandala Murders'. In an exclusive interview, the actor opened up about breaking out of typecasting, navigating life as an outsider in Mumbai, and the process behind bringing his latest role to life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhadak-2-review-siddhant-chaturvedi-triptii-dimri-casteism-brave-hesitates-to-roar-2764526-2025-08-01",
      "headline": "Dhadak 2 review: Siddhant-Triptii's film on casteism is brave but hesitates to roarRelease Date:Fri Aug 01, 2025Siddhant Chaturvedi and Triptii Dimri's 'Dhadak 2' released in theatres today. The film is a bold attempt at the caste system in India, but pulls back from a full roar. Read our review to know more. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bakaiti-review-rajesh-tailang-sheeba-chaddha-middle-class-family-drama-2764469-2025-08-01",
      "headline": "Bakaiti review: Bickering never stops in this familiar yet heartwarming seriesRelease Date:Fri Aug 01, 2025Bakaiti series review: 'Bakaiti', starring Sheeba Chaddha and Rajesh Tailang, follows the Kataria family's everyday struggles in old Ghaziabad. The series highlights sibling rivalry and financial challenges with warmth and humour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/top-films-and-shows-to-watch-on-netflix-this-weekend-2764375-2025-07-31",
      "headline": "Top films and shows to watch on Netflix this weekendNetflix's new weekend lineup is loaded with variety. From romance to drama and documentary, here's what you can add to your binge-watch list."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-recalls-working-with-sanjay-leela-bhansali-in-ram-leela-2764355-2025-07-31",
      "headline": "Priyanka Chopra recalls working with Bhansali in Ram Leela, says was inspired by himPriyanka Chopra shared how working on a song with filmmaker Sanjay Leela Bhansali was a tough but inspiring choice. She recalled memories from the shoot in an Instagram post."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/parineeti-chopra-raghav-chadha-bring-laughter-and-love-the-great-indian-kapil-sharma-show-2764115-2025-07-31",
      "headline": "Parineeti Chopra-Raghav Chadha bring laughter and love to Kapil Sharma's showActor Parineeti Chopra and her politician-husband Raghav Chadha will feature in the upcoming episode of 'The Great Indian Kapil Show' season 3. The newly released promo shows Raghav and Parineeti playfully roasting each other. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-premiere-august-24-longer-season-salman-khan-hosting-2764323-2025-07-31",
      "headline": "Bigg Boss 19: What to expect from Salman Khan's new seasonBigg Boss 19 is set to premiere on August 24 with an extended season and new streaming format. Salman Khan returns as host, but an alternate host may join due to his busy schedule."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mohit-suri-on-ahaan-panday-aneet-padda-overnight-stardom-feels-like-a-career-reset-for-me-2764305-2025-07-31",
      "headline": "Mohit Suri on Ahaan Panday-Aneet Padda's stardom: Feels like a career reset for meIn an exclusive conversation with India Today, Mohit Suri opened up about the overnight stardom of 'Saiyaara' stars Ahaan Panday and Aneet Padda. He expressed his joy in witnessing their journey and the fresh energy their success has brought to his own career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hansal-mehta-supports-sitaare-zameen-par-pay-per-view-model-2764327-2025-07-31",
      "headline": "Hansal Mehta supports Sitaare Zameen Par's pay-per-view model, calls it smart moveFilmmaker Hansal Mehta praised Aamir Khan's decision to release 'Sitaare Zameen Par' on YouTube as a pay-per-view title. He called it a smart and progressive move. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/salman-khan-bigg-boss-19-teaser-gharwalon-ki-sarkaar-twist-jiohotstar-colorstv-2764320-2025-07-31",
      "headline": "Bigg Boss 19 teaser: Salman Khan returns with a new twist, premiere date outActor Salman Khan launched the teaser for Bigg Boss 19 introducing the 'Gharwalon ki Sarkaar' twist. This new format promises a house run by collective decisions, adding fresh dynamics to the popular reality show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sidharth-malhotra-mushy-birthday-wish-for-his-love-kiara-advani-is-all-heart-2764294-2025-07-31",
      "headline": "My favourite face, in any place: Sidharth Malhotra's birthday wish for Kiara AdvaniKiara Advani celebrated her 34th birthday on July 31. To mark the joyous occasion, her actor-husband Sidharth Malhotra showered love on her, with the most heartwarming post. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sonu-sood-to-open-old-age-home-for-500-on-his-birthday-2764113-2025-07-31",
      "headline": "Sonu Sood announces old age home for 500 seniors on his birthdayOn his 52nd birthday, Sonu Sood announced the launch of an old age home to provide shelter and care for 500 senior citizens without family support."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rajkummar-rao-gets-bail-in-8-year-old-case-after-he-surrenders-before-court-2764292-2025-07-31",
      "headline": "Rajkummar Rao granted bail in 8-year-old case after surrendering in courtActor Rajkummar Rao was recently granted bail in an eight-year-old case after he surrendered before the Jalandhar court. His lawyers cited wrong address of delivery "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/conversations-with-a-killer-the-son-of-sam-tapes-delves-into-a-serial-killer-sinister-mindset-2764143-2025-07-31",
      "headline": "The Son of Sam Tapes delves into a serial killer's sinister mindsetNetflix's new offering, 'Conversations with a Killer: The Son of Sam Tapes', takes a deep dive into the disturbing psyche of an infamous serial killer. With rare tapes and firsthand accounts, the docu-series reflects on what turned a seemingly normal man, David Berkowitz, into a monster."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shefali-shah-bhumi-pednekar-on-pay-parity-ott-fairer-to-women-2764257-2025-07-31",
      "headline": "Shefali Shah, Bhumi Pednekar on pay parity: OTT fairer to womenActors Shefali Shah and Bhumi Pednekar shared their views on pay gaps and praised OTT platforms for bringing more fairness and better roles for women. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-spends-a-day-on-indian-navy-destroyer-2764148-2025-07-31",
      "headline": "Amitabh Bachchan spends a day on warship, calls it life-changing experienceAmitabh Bachchan spent a day aboard an Indian Navy Destroyer and shared a heartfelt tribute to the armed forces, praising their silent and selfless service. He shared his detailed experience in his blog and expressed pride in being an Indian and saluted the dedication of the nation's defenders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rashmika-mandanna-vijay-deverakonda-sweet-message-kingdom-release-mixed-reviews-2764238-2025-07-31",
      "headline": "We've done it: Rashmika's message for Kingdom wins Vijay Deverakonda's heartRashmika Mandanna showed support and excitement for Vijay Deverakonda's 'Kingdom'. She shared a sweet message for her rumoured boyfriend."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/mohit-suri-reacts-to-sidharth-anands-demand-for-a-saiyaara-sequel-2764195-2025-07-31",
      "headline": "Exclusive: Mohit Suri reacts to Sidharth Anand's demand for a Saiyaara sequelMohit Suri clarifies there are no plans for a 'Saiyaara' sequel despite Sidharth Anand's interest. He emphasises the film was made organically without franchise goals, reflecting a unique filmmaking approach."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/russian-oil-point-of-irritation-for-the-us-but-not-the-only-point-as-with-india-firmly-resisting-opening-up-its-agriculture-and-dairy-sectors-for-us-goods-2764444-2025-07-31",
      "headline": "India buying Russian oil not the only point of irritation, says Marco RubioOne of the biggest points of contradiction that has stopped India and the US from signing a trade deal is India's firm resistance to opening up its agriculture and dairy sectors for US goods. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/enforcement-directorate-summons-anil-ambani-on-august-5-a-week-after-raids-at-several-locations-linked-to-him-2764516-2025-08-01",
      "headline": "ED summons Anil Ambani on August 5 amid fresh raids in Odisha, BengalAnil Ambani has been asked to appear before officials on August 5 at the ED headquarters in New Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-signed-executive-order-modifying-reciprocal-tariff-rates-ranging-from-10-to-41-white-house-glbs-2764492-2025-08-01",
      "headline": "Trump hits dozens of countries with tariffs, increases Canada's levies to 35%Donald Trump signed an executive order imposing reciprocal tariffs ranging from 10% to 41% on imports from more than 70 countries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhadak-2-review-siddhant-chaturvedi-triptii-dimri-casteism-brave-hesitates-to-roar-2764526-2025-08-01",
      "headline": "Dhadak 2 review: Siddhant-Triptii's film on casteism is brave but hesitates to roarSiddhant Chaturvedi and Triptii Dimri's 'Dhadak 2' released in theatres today. The film is a bold attempt at the caste system in India, but pulls back from a full roar. Read our review to know more. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/modi-nehru-fixation-what-explains-it-by-rajdeep-sardesai-2764370-2025-08-01",
      "headline": "Why Modi feels the need to demolish NehruAt the Lok Sabha, while Modi punched hard at his critics on the government's handling of Operation Sindoor, there was a familiar name from the past that kept recurring throughout his speech. On 14 occasions, the prime minister referred to the 'sins' of one of his predecessors, Jawaharlal Nehru. Which leads one to ask: what explains Modi's Nehru fixation? "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bsf-jawan-goes-missing-from-battalion-headquarters-in-srinagar-search-underway-pantha-chowk-2764550-2025-08-01",
      "headline": "BSF jawan goes missing from battalion headquarters in Srinagar, search underwayA BSF jawan went missing from the Panthachowk headquarters in Srinagar on July 31, prompting a search operation and police investigation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-mohammed-siraj-heavy-workload-jasprit-bumrah-2764509-2025-08-01",
      "headline": "India shield Bumrah, but is Siraj carrying the real burden?ENG vs IND: Jasprit Bumrah is being managed for his workload, but what about Mohammed Siraj, who has been a key part of India's fast bowling setup in the purest format?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/we-look-up-each-time-a-plane-takes-off-inside-ground-zero-of-air-india-crash-2764211-2025-07-31",
      "headline": "'We look up each time a plane takes off': Inside Ground Zero of Air India crashHow students and faculty at Ahmedabad's Byramjee Jeejeebhoy Medical College are coping with the trauma"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/photo-essay/kamchatka-earthquake-ring-of-fire-explained-volcano-tsunami-pacific-ocean-279-01-08-2025",
      "headline": "Inside Earth's fury: Decoding the deadly Ring of FireEarth's hidden engines are churning deep beneath the oceans and mountains, and the Ring of Fire is at the heart of this churning - a constant reminder that our world is alive and breathing. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/boy-13-brutally-killed-after-being-kidnapped-in-bengaluru-2764480-2025-08-01",
      "headline": "13-year-old kidnapped in Bengaluru for ransom, burnt body found next dayNischith, 13, was kidnapped on Wednesday while returning home from tuition and was found dead on Thursday in a deserted area in Bengaluru. Two accused have been arrested following a police encounter. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/trumps-dead-economy-india-25-per-cent-tariff-jibe-triggers-russian-nuke-warning-dmitry-medvedev-dead-hand-dangerous-2764414-2025-07-31",
      "headline": "After 'dead economies' insult, Trump and Putin aide's clash turns nuclearThe showdown between Trump and former Russian President Dmitry Medvedev on Thursday was triggered by the US President imposing 25 percent tariffs on India over its purchase of energy from Russia."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/maharashtra-minister-manikrao-kokate-caught-playing-rummy-assembly-removed-agriculture-minister-sports-2764506-2025-08-01",
      "headline": "Maharashtra Agriculture Minister removed after rummy row, gets sports portfolioMaharashtra's Manikrao Kokate has been removed as Agriculture Minister after a video showed him playing rummy during an assembly session. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/chhota-samosa-bada-samosa-bjp-mp-ravi-kishan-seeks-law-to-regulate-food-prices-2764363-2025-07-31",
      "headline": "BJP MP Ravi Kishan seeks regulation of food prices, uses samosa to make his caseRavi Kishan questioned inconsistent food pricing and portions across India, citing examples like samosas served on small and big plates for the same price. He called for regulation 'in a market serving crores without clear rules.'"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/indian-refiners-halt-russian-oil-buys-amid-shrinking-deals-report-glbs-2764501-2025-08-01",
      "headline": "Indian state refiners halt Russian oil imports as US threatens penalty: ReportState-run refiners in India have halted Russian oil purchases in the past week due to shrinking discounts and mounting pressure from former US President Donald Trump's threats of tariffs and sanctions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karisma-kapoor-arrives-in-delhi-with-children-amid-ex-husbands-property-feud-2763984-2025-07-31",
      "headline": "Karisma in Delhi with children amid Sanjay Kapur's Rs 30,000 crore estate battleActor Karisma Kapoor arrived in Delhi with her children, Kiaan and Samaira, amid her late ex-husband Sunjay Kapur's property feud. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mussoorie-uttarakhand-tourists-registration-process-aadhaar-card-details-2764543-2025-08-01",
      "headline": "Planning a trip to Mussoorie? Tourist registration kicks off todayThe move comes amid ever-surging tourist arrivals at the popular hill station, with footfall having almost doubled between 2022 and 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/bakaiti-review-rajesh-tailang-sheeba-chaddha-middle-class-family-drama-2764469-2025-08-01",
      "headline": "Bakaiti review: Bickering never stops in this familiar yet heartwarming seriesRelease Date:Fri Aug 01, 2025Bakaiti series review: 'Bakaiti', starring Sheeba Chaddha and Rajesh Tailang, follows the Kataria family's everyday struggles in old Ghaziabad. The series highlights sibling rivalry and financial challenges with warmth and humour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/apple-to-boost-ai-spending-tim-cook-says-difficult-to-see-a-world-where-iphone-is-not-living-in-it-2764535-2025-08-01",
      "headline": "Apple to boost AI spending, Tim Cook says difficult to see a world without iPhoneWhile Apple is taking its sweet time to launch its AI features, CEO Tim Cook has reassured that the company has big plans for it. Moreover, he said that while there is no future without iPhones, Apple is also thinking about other AI devices.    "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/omar-abdullah-visits-gujarat-pm-modi-hails-it-as-message-of-unity-2764475-2025-08-01",
      "headline": "I firmly believe that...: Omar Abdullah after PM praises Statue of Unity visitJammu & Kashmir Chief Minister Omar Abdullah visited Gujarat for a tourism event and shared his experience on social media. His post caught the attention of Prime Minister Narendra Modi, who praised his visit."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-tariffs-penalty-india-neither-truth-nor-social-indian-exports-us-oil-russia-china-fta-uk-energy-defence-2764180-2025-07-31",
      "headline": "Trump's tariffs and penalty on India: Neither truth nor socialUS President Donald Trump used his Truth social platform to declare the tariff-penalty on India. But his arguments for the punitive measure are far from truth and distant from social. Trump is a tragedy on both counts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-safety-dignity-worries-keep-indian-women-out-of-work-2764204-2025-07-31",
      "headline": "How safety, dignity worries keep Indian women out of work\"Urban infra to workplaces, it's all designed by men for men,\" says Pooja Sharma Goyal, CEO of Udaiti Foundation, whose survey of blue-grey collar workers threw up grim stats\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/donald-trump-united-states-reciprocal-tariffs-countries-full-list-2764515-2025-08-01",
      "headline": "Trump rejigs tariff rates for 70 countries. Pak, Bangladesh to be taxed at...Trump tariffs: Some of the world's poorest and war-torn countries were hit with punitive rates by the Trump administration. Syria faces one of the steepest tariffs at 41%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/patna-horror-burnt-bodies-of-2-minor-siblings-found-at-home-family-alleges-murder-2764304-2025-07-31",
      "headline": "Patna horror: Burnt bodies of 2 minor siblings found at home, family alleges murderThe family members of the victims said that someone first killed the boys and then set their bodies on fire to hide their crime."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/fbi-intel-bill-clinton-george-soros-link-trump-to-russia-declassified-documents-indicate-glbs-2764479-2025-08-01",
      "headline": "FBI had intel on Hillary Clinton plot to link Trump to Russia, files showThe declassified documents reveal the FBI knew about a plan by Hillary Clinton to spread Trump-Russia collusion claims through George Soros-linked channels."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ranbir-kapoor-arjun-kapoor-bromance-shines-step-out-for-outing-viral-videos-2764548-2025-08-01",
      "headline": "Ranbir and Arjun Kapoor's bromance shines as they step out for outing. WatchRanbir Kapoor and Arjun Kapoor stepped out for an outing together on July 31. Videos of the two posing for the paparazzi with their friends have gone viral. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/dhadak-2-review-siddhant-chaturvedi-triptii-dimri-casteism-brave-hesitates-to-roar-2764526-2025-08-01",
      "headline": "Dhadak 2 review: Siddhant-Triptii's film on casteism is brave but hesitates to roarRelease Date:Fri Aug 01, 2025Siddhant Chaturvedi and Triptii Dimri's 'Dhadak 2' released in theatres today. The film is a bold attempt at the caste system in India, but pulls back from a full roar. Read our review to know more. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/top-films-and-shows-to-watch-on-netflix-this-weekend-2764375-2025-07-31",
      "headline": "Top films and shows to watch on Netflix this weekendNetflix's new weekend lineup is loaded with variety. From romance to drama and documentary, here's what you can add to your binge-watch list."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-recalls-working-with-sanjay-leela-bhansali-in-ram-leela-2764355-2025-07-31",
      "headline": "Priyanka Chopra recalls working with Bhansali in Ram Leela, says was inspired by himPriyanka Chopra shared how working on a song with filmmaker Sanjay Leela Bhansali was a tough but inspiring choice. She recalled memories from the shoot in an Instagram post."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mca-honours-sunil-gavaskar-sharad-pawar-statues-wankhede-cricket-museum-2764546-2025-08-01",
      "headline": "Sunil Gavaskar, Sharad Pawar to be honoured with life-size statues at MCA museumLegendary India batter Sunil Gavaskar and veteran cricket administrator Sharad Pawar will be immortalised with life-size statues at the entrance of the upcoming Mumbai Cricket Association (MCA) museum."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-seamer-chris-woakes-injured-shoulder-oval-injury-replacement-debate-2764525-2025-08-01",
      "headline": "England seamer Woakes injured; Stokes unlikely to get replacementIndia vs England 5th Test: England will be sweating over Chris Woakes' injury going into the Day 2 of the final Test match at The Oval. Will Woakes be allowed a replacement?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/chris-woakes-shoulder-injury-final-test-oval-gus-atkinson-key-wickets-2764514-2025-08-01",
      "headline": "Not looking good: England sweat on Chris Woakes' injury in Oval TestENG vs IND, 5th Test: Gus Atkinson shared an update on Chris Woakes, who walked off the park in the Oval Test after injuring his shoulder while trying to stop the ball from going to the boundary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-mohammed-siraj-heavy-workload-jasprit-bumrah-2764509-2025-08-01",
      "headline": "India shield Bumrah, but is Siraj carrying the real burden?ENG vs IND: Jasprit Bumrah is being managed for his workload, but what about Mohammed Siraj, who has been a key part of India's fast bowling setup in the purest format?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-ryan-ten-doeschate-jasprit-bumrahs-workload-oval-2764477-2025-08-01",
      "headline": "Bumrah isn't picking and choosing games, team's managing his body: Ten DoeschateEngland vs India: India's assistant coach Ryan Ten Doeschate revealed that fast bowler Jasprit Bumrah isn't picking and choosing games, and the team management is managing his workload to respect his body condition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-karun-nair-ends-8-year-wait-for-half-century-2764465-2025-08-01",
      "headline": "ENG vs IND: Karun Nair ends 8-Year wait for fifty, breathes life into career revivalIndia batter Karun Nair ended his eight-year wait for a half-century on Day 1 of the fifth Test against England at the Oval. He scored an unbeaten 52* to help India survive a challenging day under overcast conditions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-oval-karun-nair-shubman-gill-sai-sudharsan-josh-tongue-2764431-2025-08-01",
      "headline": "Oval Test: Karun Nair's fighting fifty helps India survive challenging Day 1Being asked to bat first under overcast conditions on a green top at the Oval, India managed to survive through the day as Sai Sudharsan and Karun Nair played gritty knocks. Gus Atkinson and Josh Tongue picked two wickets each for England as the hosts managed to scalp six wickets in the day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zimbabwe-vs-new-zealand-1st-test-day-2-devon-conway-daryl-mitchell-bulawayo-report-2764447-2025-07-31",
      "headline": "Zimbabwe fight on but Conway, Mitchell fifties keep New Zealand in frontNew Zealand maintained their advantage on Day 2 of the second Test against Zimbabwe, with fifties from Devon Conway and Daryl Mitchell securing a valuable first-innings lead. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/holger-rune-andre-agassi-training-toronto-open-2764405-2025-07-31",
      "headline": "He makes things simple on the court: Rune delighted to work with AgassiWorld No. 9 Holger Rune described his three-day training camp with Andre Agassi as \"insane\" and eye-opening, praising the legend for simplifying the game and offering a fresh perspective."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lucas-paqueta-west-ham-united-gambling-betting-charges-2764401-2025-07-31",
      "headline": "Lucas Paqueta cleared of alleged gambling charges, West Ham confirmsWest Ham's Lucas Paqueta has been cleared of four serious betting rule breaches after an independent FA panel found the charges \"not proven.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-karun-nair-ends-8-year-wait-for-half-century-2764465-2025-08-01",
      "headline": "ENG vs IND: Karun Nair ends 8-Year wait for fifty, breathes life into career revivalIndia batter Karun Nair ended his eight-year wait for a half-century on Day 1 of the fifth Test against England at the Oval. He scored an unbeaten 52* to help India survive a challenging day under overcast conditions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-oval-karun-nair-shubman-gill-sai-sudharsan-josh-tongue-2764431-2025-08-01",
      "headline": "Oval Test: Karun Nair's fighting fifty helps India survive challenging Day 1Being asked to bat first under overcast conditions on a green top at the Oval, India managed to survive through the day as Sai Sudharsan and Karun Nair played gritty knocks. Gus Atkinson and Josh Tongue picked two wickets each for England as the hosts managed to scalp six wickets in the day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/zimbabwe-vs-new-zealand-1st-test-day-2-devon-conway-daryl-mitchell-bulawayo-report-2764447-2025-07-31",
      "headline": "Zimbabwe fight on but Conway, Mitchell fifties keep New Zealand in frontNew Zealand maintained their advantage on Day 2 of the second Test against Zimbabwe, with fifties from Devon Conway and Daryl Mitchell securing a valuable first-innings lead. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/holger-rune-andre-agassi-training-toronto-open-2764405-2025-07-31",
      "headline": "He makes things simple on the court: Rune delighted to work with AgassiWorld No. 9 Holger Rune described his three-day training camp with Andre Agassi as \"insane\" and eye-opening, praising the legend for simplifying the game and offering a fresh perspective."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/lucas-paqueta-west-ham-united-gambling-betting-charges-2764401-2025-07-31",
      "headline": "Lucas Paqueta cleared of alleged gambling charges, West Ham confirmsWest Ham's Lucas Paqueta has been cleared of four serious betting rule breaches after an independent FA panel found the charges \"not proven.\""
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}