{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-price-today-yellow-metal-shines-record-high-will-it-keep-rising-in-near-future-2695046-2025-03-18",
      "headline": "Gold prices at record high: Will it keep rising in near future?Investors are flocking to gold as escalating trade tensions, U.S. tariff measures, and global uncertainties boost demand for the safe-haven asset. With prices soaring to record levels, the key question remains: Will gold continue its upward trajectory in the near future?\r\n\r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rally-key-factors-sensex-nifty-gain-will-positive-run-continue-2695029-2025-03-18",
      "headline": "Sensex jumps over 800 points: Why is the stock market rising today?Stock market rally: By 10:11 am, the Sensex was up 776.26 points at 74,946.21, while the Nifty gained 232.45 points to trade at 22,741.20. Banking, auto, and financial stocks led the rally, pushing benchmark indices higher."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-bell-today-sensex-rises-over-400-points-nifty-above-22600-indusind-bank-bajaj-finserv-gain-2695009-2025-03-18",
      "headline": "Sensex, Nifty open higher as banking stocks rally; ICICI, Zomato lead gainsThe S&P BSE Sensex initially rose above 400 points and was trading 326.28 points higher at 74,496.23 at around 9:22 am. The NSE Nifty 50 also gained 107.50 points to trade above 22,600. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bajaj-finserv-to-buy-out-allianzs-stake-in-insurance-joint-ventures-after-24-years-2695006-2025-03-18",
      "headline": "Bajaj to buy out Allianz's stake in insurance joint ventures after 24 yearsThe two firms have had a joint venture in the insurance sector for 24 years, and the partnership will officially come to an end once the first tranche of at least 6.1% is acquired and Allianz is reclassified from a promoter to an investor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-on-march-17-what-to-expect-from-stock-market-today-ireda-indusind-bank-bajaj-finserv-2695002-2025-03-18",
      "headline": "Stock market opening on March 17: Will Sensex, Nifty continue positive run?Stock market opening prediction on March 17: Sensex and Nifty are expected to open today's session on a positive note. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-bajaj-finserv-tata-motors-swiggy-indusind-bank-ireda-2694994-2025-03-18",
      "headline": "Stocks to watch today: Bajaj Finserv, Tata Motors, Swiggy, IndusInd Bank, IREDAStocks to watch on March 18: Bajaj Finserv, Swiggy, IndusInd Bank, IREDA, and IRCON International are among the stocks likely to remain in focus today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/looking-for-tax-saving-options-check-out-these-5-post-office-savings-schemes-ppf-nsc-ssy-2694760-2025-03-18",
      "headline": "Looking for tax-saving options? Check out these 5 post office savings schemesAmong various tax-saving methods, post office savings schemes are considered one of the safest investment options since they are backed by the government. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-holds-steadier-following-weeks-of-scary-swings-glbs-2694935-2025-03-17",
      "headline": "Wall Street holds steadier following weeks of scary swingsThe S&P 500 was 0.1% higher after falling for four consecutive weeks amid Donald Trump's tariff threats to overseas markets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stagflation-fears-grow-as-us-fed-prepares-key-interest-rate-decision-glbs-2694903-2025-03-17",
      "headline": "'Stagflation' fears grow as US Fed prepares key interest rate decisionThe Federal Reserve faces rising inflation concerns and economic uncertainty ahead of its meeting. Potential stagflation complicates rate-cut plans, while higher tariffs and consumer inflation fears add pressure on policymakers and financial markets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-witnesses-modest-gains-as-investors-await-fed-rate-decision-2694859-2025-03-17",
      "headline": "Wall Street witnesses modest gains as investors await Fed's rate decisionAt the opening bell, the S&P 500 increased 27.46 points, or 0.49%, to 5,666.40 and the Nasdaq Composite rose 59.43 points, or 0.33%, to 17,813.51. The Dow Jones Industrial Average climbed 203.34 points, or 0.50%, to 41,695.55."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/banking-operations-may-be-hit-on-march-24-and-25-here-is-why-2694736-2025-03-17",
      "headline": "Banking operations may be hit on March 24 and 25. Here's whyThe UFBU, a group representing nine major bank unions, announced the strike after failing to reach an agreement with the Indian Banks' Association (IBA)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/got-credit-card-reward-points-4-ways-to-use-them-2694698-2025-03-17",
      "headline": "Got credit card reward points? 4 ways to use themWhile most people use credit card reward points for shopping rewards, travel benefits, or cashback, they can also be used as a handy means to pay bills, including bill payments."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/hania-aamir-farhan-saeed-mere-humsafar-back-on-tv-2695015-2025-03-18",
      "headline": "Hania Aamir, Farhan Saeed's Mere Humsafar back on TV: When, where to watchThe popular Pakistani romance drama Mere Humsafar, starring Hania Aamir and Farhan Saeed, is making a comeback. Find out when and where you can watch this beloved series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/alka-yagnik-reacts-to-osama-bin-laden-being-her-fan-2695010-2025-03-18",
      "headline": "Alka Yagnik reacts to Osama bin Laden being her fan: Is it my fault?Alka Yagnik's old interview reacting to Osama bin Laden being her fan has resurfaced. She also spoke about industry politics, revealing how she lost songs to senior singers. Her remarks are now viral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/charanjit-singh-channi-celebrates-sidhu-moosewala-brother-shubhdeep-first-birthday-in-punjab-2694987-2025-03-18",
      "headline": "Former Punjab Chief Minister attends Sidhu Moosewala's brother's 1st birthday bashFormer Punjab Chief Minister Charanjit Singh Channi visited Sidhu Moosewala's home to celebrate the first birthday of the late singer's brother, Shubhdeep. The event, held at Musa village, saw Channi participating in the cake-cutting ceremony.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/malaika-arora-scolds-contestant-inappropriate-dance-mother-number-hip-hop-india-season-2-2694829-2025-03-17",
      "headline": "Malaika Arora scolds contestant for inappropriate danceActor Malaika Arora recently scolded a 16-year-old contestant for his inappropriate dance moves. Malaika asked for the contestant's mother's number. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/hina-khan-emotional-boyfriend-rocky-jaiswal-calls-her-brave-soul-amid-cancer-battle-2694800-2025-03-17",
      "headline": "Hina Khan emotional as boyfriend Rocky calls her a 'brave soul' amid cancer battleActor Hina Khan's boyfriend Rocky Jaiswal recently appeared on Celebrity MasterChef. Rocky spoke about Hina;s cancer battle and called her a 'braveheart.' "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/salman-khan-nephew-ayaan-agnihotri-agni-fighting-nepotism-tag-2694701-2025-03-17",
      "headline": "Salman Khan's nephew Ayaan on stage name Agni and fighting the nepotism tagBollywood superstar Salman Khan's nephew, Ayaan Agnihotri, recently made his music debut. In an exclusive conversation with India Today Digital, the actor opened up about his stage name and battling the nepotism tag. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/exclusive-tayme-thapthimthong-on-the-white-lotus-s3-lisa-of-blackpink-asian-representation-2694643-2025-03-17",
      "headline": "Exclusive: Tayme on The White Lotus S3, Lisa of Blackpink, Asian representationTayme Thapthimthong's journey from a real-life security guard to a celebrated actor in The White Lotus Season 3 is truly remarkable. Paired with Blackpink's Lisa, Tayme, in an exclusive chat with India Today speaks about his journey, Asian representation and more. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/kim-kardashian-vs-kanye-west-rapper-fights-with-ex-wife-over-daughter-north-name-2694645-2025-03-17",
      "headline": "Kim Kardashian vs Kanye West: Rapper fights with ex-wife over daughter's nameKanye West released a song featuring daughter North, despite Kim Kardashian's objections. She took legal action, but Kanye leaked their private chat and refused to back down, escalating their feud."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/after-cid-crime-patrol-begins-to-stream-on-netflix-fans-react-2694589-2025-03-17",
      "headline": "After CID, Crime Patrol begins to stream on Netflix, fans reactCrime Patrol, the iconic true-crime series on Sony TV, is now available to stream on Netflix. Fans reacted to the announcement. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-kim-soo-hyun-and-kim-sae-ron-controversy-why-its-not-okay-to-be-okay-2694514-2025-03-17",
      "headline": "Kim Soo-hyun and Kim Sae-ron controversy: Exposing Korean industry's double standardsThe controversy involving South Korean actors Kim Soo-hyun and the late Kim Sae-ron has opened a Pandora's box of issues within the entertainment industry, from age-gap relationships to the treatment of disgraced celebrities. As the public grapples with these revelations, the debate continues to rage on about ethics, consent, and gender double standards. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kim-soo-hyun-agency-gold-medalist-theatens-indian-blogger-for-unauthorised-content-2694525-2025-03-17",
      "headline": "Kim Soo-hyun's agency acts against Indian blogger for unauthorised contentIn a dramatic turn of events, actor Kim Soo-hyun's agency has initiated legal proceedings against an Indian influencer. The influencer shared emails from the agency, revealing that he was threatened for posting 'unauthorised' content.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/hina-khan-performs-umrah-amid-cancer-battle-see-photos-videos-2694558-2025-03-17",
      "headline": "Hina Khan performs Umrah amid cancer battle, says she's 'overwhelmed, speechless'Actor Hina Khan performed Umrah amid her cancer battle. She shared emotional moments from Mecca on Instagram. Accompanied by her brother, the actor expressed gratitude and prayed for strength while documenting her journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kim-soo-hyun-scenes-cut-from-good-day-following-kim-sae-ron-controversy-2694544-2025-03-17",
      "headline": "Kim Soo-hyun's scenes cut from 'Good Day' following Kim Sae-ron controversyK-drama actor Kim Soo-hyun's scenes from MBC's variety program 'Good Day' were edited after Kim Sae-ron controversy. The production house shared a statement and confirmed the same. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/erica-fernandes-opens-up-past-physical-abuse-reveals-impact-of-do-patti-movie-2694425-2025-03-17",
      "headline": "TV actor Erica Fernandes says Do Patti triggered memories of abusive relationshipActor Erica Fernandes shared her experience of physical abuse in a past relationship, highlighting how films like Do Patti resurfaced painful memories. Despite the challenges, she opened up about her journey towards healing and the societal pressures that kept her silent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/sidhu-moose-wala-little-brother-holi-pic-2694313-2025-03-16",
      "headline": "Sidhu Moose Wala's little brother's Holi pic goes viral. Seen yet?A viral photo of Sidhu Moose Wala's little brother, Shubhdeep, dressed in traditional attire with Holi colours on his cheeks, has captured the hearts of fans on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/all-of-us-are-dead-actor-lomon-on-india-i-think-of-taj-mahal-and-bengal-tigers-2694255-2025-03-16",
      "headline": "All Of Us Are Dead actor Lomon on India: I think of Taj Mahal and Bengal TigersSouth Korean actor Lomon, known for his role in All of Us Are Dead, discussed his latest project Family Matters and shared insights on his career and inspirations in an exclusive interview with India Today Digital."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/hina-khan-discoloured-nails-not-nailpaint-sideeffect-of-chemotherapy-2694210-2025-03-16",
      "headline": "Hina Khan shares pic of discoloured nails: Most common side effect of chemotherapyTelevision actor Hina Khan opened up about the side effects of chemotherapy on her nails, sharing a glimpse of the discolouration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/saira-banu-says-she-shouldnt-be-called-ar-rahmans-ex-wife-were-not-divorced-only-separated-2694208-2025-03-16",
      "headline": "Saira Banu says she shouldn't be called AR Rahman's ex-wife: We're not divorcedSaira Banu, wife of AR Rahman, clarifies that they are separated but not divorced, addressing recent rumours. She cites her health issues as a reason and wishes Rahman well."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/priyanka-chahar-choudhary-ankit-gupta-unfollow-each-other-stmp-2694198-2025-03-16",
      "headline": "Priyanka Chahar Choudhary-Ankit Gupta unfollow each other, fans speculate break-upTelevision actors Priyanka Chahar Choudhary and Ankit Gupta, known for their chemistry on Udaariyaan, have unfollowed each other on Instagram, sparking rumours about their relationship status."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/sunita-williams-undock-from-space-station-today-return-home-after-nine-months-2694904-2025-03-18#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sunita Williams begins her long-awaited journey back home Live UpdatesSunita Williams is returning aboard SpaceX Dragon spacecraft with astronaut Butch Willmore and two other Crew-9 members. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nagpur-violence-how-it-started-aurangzeb-tomb-row-holy-book-desecration-2694989-2025-03-18#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How Nagpur violence broke out amid row over Aurangzeb's tombNagpur violence: Several vehicles were torched in large-scale arson and vandalism as two communities clashed in Nagpur. The administration has banned large gatherings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-launches-extensive-airstrikes-on-gaza-palestine-claims-over-100-killed-2694980-2025-03-18#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Israel launches extensive airstrikes on Gaza, Palestine claims over 200 killedAt least 200 people were killed as Israeli airstrikes hit Gaza, breaking a fragile ceasefire since January. The attacks targeted Gaza City, Deir al-Balah, Khan Younis, and Rafah in the most intense bombardment since the truce began."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/white-house-shares-trumps-photo-after-lebanese-doctor-rasha-alawieh-deported-2694974-2025-03-18#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Bye-bye, Rasha: White House shares Trump's photo after Lebanese doctor deportedThe White House sparked controversy on Monday by resharing a Department of Homeland Security post on Lebanese doctor Rasha Alawieh's deportation, adding \"bye-bye Rasha\" and a photo of Trump waving."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/reality-of-trio-friendships-can-they-last-forever-2694986-2025-03-18#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "The reality of trio friendships: Can they last forever?It can get difficult to maintain a trio friendship. But is it impossible to do so? Certainly not."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/curfew-imposed-in-manipurs-churachandpur-after-hmar-tribe-leader-assaulted-2694816-2025-03-17#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Curfew imposed in Manipur's Churachandpur after tribal leader assaultedTensions rose in Manipur's Churachandpur after a Hmar tribe leader was assaulted by unidentified individuals. The Hmar Inpui demanded swift justice and warned of action if its demands were not fulfilled."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-bell-today-sensex-rises-over-400-points-nifty-above-22600-indusind-bank-bajaj-finserv-gain-2695009-2025-03-18#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sensex, Nifty open higher as banking stocks rally; ICICI, Zomato lead gainsThe S&P BSE Sensex initially rose above 400 points and was trading 326.28 points higher at 74,496.23 at around 9:22 am. The NSE Nifty 50 also gained 107.50 points to trade above 22,600. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/clashes-in-nagpur-after-muslim-groups-allege-holy-book-burnt-at-aurangzeb-tomb-protest-2694889-2025-03-17#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Nagpur violence pre-planned: BJP after 30 injured in clashes amid Aurangzeb rowBJP claimed that the violence that erupted in Nagpur over Aurangzeb row was \"pre-planned\" and alleged that houses belonging to Hindus were targetted as 30 people were injured in clashes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/looking-for-an-affordable-suv-here-are-5-options-under-rs-10-lakh-2695041-2025-03-18#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Looking for an affordable SUV? Here are 5 options under Rs 10 lakhThe Tata Punch, Hyundai Exter, Maruti Suzuki Fronx, Skoda Kylaq, and Kia Syros are available for under Rs 10 lakh (ex-showroom)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/the-diplomat-box-office-collection-day-4-john-abraham-film-struggles-on-monday-2694995-2025-03-18#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "The Diplomat box office: John Abraham film struggles on Monday after steady weekendJohn Abraham's The Diplomat earned Rs 1.50 crore on its first Monday, seeing a sharp dip from Sunday. Meanwhile, Chhaava earned Rs 2.65 crore on its fifth Monday, bringing its total to Rs 565.3 crore."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/south-sudan-airforce-airstrike-kill-clash-ethiopia-border-white-army-2694965-2025-03-18#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "South Sudan airstrike kills 19, clashes escalate near Ethiopia borderA South Sudanese airstrike in Nasir killed at least 19 people, escalating tensions with the White Army militia and raising fears of renewed civil war. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sourav-ganguly-on-rohit-sharma-in-test-cricket-2695004-2025-03-18#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India are not good in Tests, Rohit Sharma should take responsibility: Sourav GangulyFormer India cricketer Sourav Ganguly has said that captain Rohit Sharma should take responsibility of turning things around in Test cricket. India haven't had a good run in Test cricket in recent times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/alka-yagnik-reacts-to-osama-bin-laden-being-her-fan-2695010-2025-03-18#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Alka Yagnik reacts to Osama bin Laden being her fan: Is it my fault?Alka Yagnik's old interview reacting to Osama bin Laden being her fan has resurfaced. She also spoke about industry politics, revealing how she lost songs to senior singers. Her remarks are now viral."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/bihar-lalu-prasad-rabri-devi-tej-pratap-issued-fresh-summons-by-ed-in-land-for-jobs-case-2695034-2025-03-18#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "ED issues summons to Lalu Prasad, Rabri Devi, Tej Pratap in land-for-jobs caseThe ED has summoned RJD chief Lalu Prasad Yadav, his wife Rabri Devi, and son Tej Pratap for questioning in the land-for-jobs case. Rabri and Tej Pratap must appear on Tuesday, while Lalu is summoned on Wednesday in Patna.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/israel-consulted-us-before-bombing-gaza-confirms-white-house-2694993-2025-03-18#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Israel consulted US before bombing Gaza, confirms White HouseIsrael consulted President Donald Trump's administration before its deadly Gaza strikes, White House press secretary Karoline Leavitt told Fox News."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/charanjit-singh-channi-celebrates-sidhu-moosewala-brother-shubhdeep-first-birthday-in-punjab-2694987-2025-03-18#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Former Punjab Chief Minister attends Sidhu Moosewala's brother's 1st birthday bashFormer Punjab Chief Minister Charanjit Singh Channi visited Sidhu Moosewala's home to celebrate the first birthday of the late singer's brother, Shubhdeep. The event, held at Musa village, saw Channi participating in the cake-cutting ceremony.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/what-are-the-signals-from-abhishek-banerjees-comeback-meet-2694639-2025-03-17#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "What are the signals from Abhishek Banerjee's 'comeback' meetThe virtual gathering helmed by the TMC leader focused on revamping the party organisation and a head start on checking alleged electoral manipulation by its main rival.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/maharashtra-students-climb-onto-water-tank-in-palghar-die-after-it-collapses-2694946-2025-03-18#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "2 students climb onto water tank in Maharashtra, die after it collapsesTwo students, aged 12 years, died after they climbed onto a water tank that collapsed on them in Maharashtra's Palghar district. Another student suffered critical injuries."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-meets-tulsi-gabbard-us-spy-chief-water-maha-kumbh-prayagraj-2694819-2025-03-17#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "PM Modi meets Tulsi Gabbard, says India, US committed to combating terrorismPrime Minister Narendra Modi met US Director of National Intelligence Tulsi Gabbard in New Delhi on Monday and presented her with Ganga water from the Maha Kumbh, which attracted over 660 million people in Prayagraj.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pm-narendra-modi-christopher-luxon-champions-trophy-joke-delhi-meet-2694861-2025-03-17#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Watch: New Zealand PM's Champions Trophy final quip leaves PM Modi in splitsNew Zealand Prime Minister Christopher Luxon joked that cricket was off the table during his meeting with Prime Minister Narendra Modi in Delhi on Monday. India defeated Zealand in the Champions Trophy final on March 09.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-students-oppose-a-400-acre-green-lungs-auction-in-hyderabad-2694684-2025-03-17#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why students oppose a 400-acre green lung's auction in HyderabadThe University of Hyderabad students and green activists claim the move will disrupt the city's ecological balance.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/tulsi-gabbard-us-spy-chief-india-visit-donald-trump-tariff-threat-india-interview-2694802-2025-03-17#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Direct dialogue happening at very top: Tulsi Gabbard on US's India tariffs threatIndia and the US have established a \"direct dialogue at the very top\" on the issue of tariffs, US Director of National Intelligence Tulsi Gabbard said while reacting to US President Donald Trump's tariff threat on India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/ranya-rao-gold-smuggling-case-husband-jatin-hukkeri-says-married-in-november-separated-in-december-arrest-exemption-2694694-2025-03-17#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Married Ranya Rao in November, separated month later, husband tells courtRanya Rao's husband Jatin Hukkeri applied for exemption from arrest in the gold smuggling case saying the couple separated a month after getting married in November. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/nagpur-clash-opposition-parties-attack-bjp-government-shiv-sena-conngress-2694963-2025-03-18#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'State law and order has collapsed': Nagpur clash sparks opposition outrageViolent clashes in Nagpur have sparked criticism from opposition leaders, who blame the BJP-led Maharashtra government for a collapse in law and order."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karan-johar-mother-hiroo-johar-82nd-birthday-emotional-note-2695048-2025-03-18",
      "headline": "KJo wishes his 'galaxy' Hiroo Johar on 82nd birthday with emotional noteFilmmaker Karan Johar wished his mother Hiroo Johar on her 82nd birthday with an emotional note. Also sharing throwback photos, he called her his 'galaxy, world'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rajinikanth-first-person-to-watch-empuraan-trailer-prithviraj-sukumaran-fanboy-moment-2695033-2025-03-18",
      "headline": "Rajinikanth 1st to watch Empuraan trailer, Prithviraj describes his fanboy momentSuperstar Rajinikanth is the first person to watch the trailer of L2: Empuraan. Director Prithviraj Sukumaran was ecstatic meeting his idol. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hansal-mehta-defends-ibrahim-amid-harsh-nadaaniyan-backlash-blames-filmmakers-2695027-2025-03-18",
      "headline": "Hansal Mehta defends Ibrahim amid 'harsh' Nadaaniyan backlash, blames filmmakersHansal Mehta calls criticism of Nadaaniyan stars Ibrahim Ali Khan and Khushi Kapoor \"harsh\" but blames filmmakers for casting unprepared debutants. He also criticises advisors for pushing young actors into conventional roles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/hania-aamir-farhan-saeed-mere-humsafar-back-on-tv-2695015-2025-03-18",
      "headline": "Hania Aamir, Farhan Saeed's Mere Humsafar back on TV: When, where to watchThe popular Pakistani romance drama Mere Humsafar, starring Hania Aamir and Farhan Saeed, is making a comeback. Find out when and where you can watch this beloved series."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-player-replacement-rules-new-explained-2695038-2025-03-18",
      "headline": "IPL 2025: How does revamped player replacement rule work ahead of new season?With 4 replacements happening before the start of the new season, we have a look at the revamped rules for IPL 2025 in which a team can replace an unavailable member of their roster with a new player. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-lsg-mayank-yadav-starts-bowling-at-bcci-centre-of-excellence-2695026-2025-03-18",
      "headline": "Watch: Mayank Yadav starts bowling at BCCI Centre of Excellence ahead of IPL 2025Lucknow Super Giants fast bowler Mayank Yadav has started bowling at the BCCI Centre of Excellence ahead of Indian Premier League 2025 (IPL 2025). Mayank has been undergoing rehabilitation since November 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sourav-ganguly-on-rohit-sharma-in-test-cricket-2695004-2025-03-18",
      "headline": "India are not good in Tests, Rohit Sharma should take responsibility: Sourav GangulyFormer India cricketer Sourav Ganguly has said that captain Rohit Sharma should take responsibility of turning things around in Test cricket. India haven't had a good run in Test cricket in recent times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ajinkya-rahane-on-kkr-captaincy-ready-for-challenge-2694988-2025-03-18",
      "headline": "Honoured to captain KKR, ready for the challenge that lies ahead: Ajinkya RahaneKolkata Knight Riders' (KKR) new captain Ajinkya Rahane said that it's an honour for him to lead the team in Indian Premier League 2025 (IPL 2025) and mentioned that he's ready for the challenge to defend the title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/what-if-virat-kohli-was-signed-by-delhi-capitals-in-2008-2694969-2025-03-18",
      "headline": "IPL Multiverse: What if Virat Kohli was signed by Delhi Capitals in 2008Delhi Capitals in 2008 passed on the chance to sign hometown hero Virat Kohli and the star batter went on to be snapped up by Royal Challengers Bengaluru. The IPL Multiverse takes a look at what would have happened if Delhi signed Kohli instead of Bengaluru.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/iona-cuts-ties-with-tobin-anderson-after-two-seasons-at-the-helm-glbs-2694933-2025-03-17",
      "headline": "Iona Cuts Ties with Tobin Anderson After Two Seasons at the HelmAnderson's brief tenure ends amid struggles to sustain the program's momentum following Rick Pitino's departure. \r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/ncaa-tournament-massive-tv-rating-and-attendance-for-womens-basketball-glbs-2694929-2025-03-17",
      "headline": "NCAA Tournament: Massive TV rating and attendance for Women's basketballThere was concern that attendance and overall interest in women's college basketball would drop this year with the departure of Caitlin Clark, Angel Reese and other stars for the WNBA. However, there is a strong rating and attendance seen for women's basketball. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/f1-teams-set-for-stricter-tests-to-avoid-flexi-wing-loophole-glbs-2694924-2025-03-17",
      "headline": "F1 teams set for stricter tests to avoid flexi-wing loopholeFormula 1's governing body, the FIA will implement tougher wing tests from the Chinese GP to prevent teams from exploiting flexible rear wings to gain an advantage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/rory-mcilroy-secures-second-players-championship-title-glbs-2694920-2025-03-17",
      "headline": "Rory McIlroy secures second Players Championship titleRory Mcllory clinches his second players' championship title and builds momentum for the masters.  McIlroy delivered an early knockout against J.J. Spaun with his best drive of the week that set up a simple birdie."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/lionel-messi-injury-argentina-fifa-world-cup-qualifiers-vs-uruguay-brazil-2694916-2025-03-17",
      "headline": "Lionel Messi ruled out of World Cup qualifiers due to injuryArgentine talisman Lionel Messi has been ruled out of the FIFA World Cup qualifiers due to an indisclosed injury. Messi will be missing two crucial matches against Uruguay and Argentina in the coming days."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/iona-cuts-ties-with-tobin-anderson-after-two-seasons-at-the-helm-glbs-2694933-2025-03-17",
      "headline": "Iona Cuts Ties with Tobin Anderson After Two Seasons at the HelmAnderson's brief tenure ends amid struggles to sustain the program's momentum following Rick Pitino's departure. \r\n\r\n\r\n\r\n\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/ncaa-tournament-massive-tv-rating-and-attendance-for-womens-basketball-glbs-2694929-2025-03-17",
      "headline": "NCAA Tournament: Massive TV rating and attendance for Women's basketballThere was concern that attendance and overall interest in women's college basketball would drop this year with the departure of Caitlin Clark, Angel Reese and other stars for the WNBA. However, there is a strong rating and attendance seen for women's basketball. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/f1-teams-set-for-stricter-tests-to-avoid-flexi-wing-loophole-glbs-2694924-2025-03-17",
      "headline": "F1 teams set for stricter tests to avoid flexi-wing loopholeFormula 1's governing body, the FIA will implement tougher wing tests from the Chinese GP to prevent teams from exploiting flexible rear wings to gain an advantage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/rory-mcilroy-secures-second-players-championship-title-glbs-2694920-2025-03-17",
      "headline": "Rory McIlroy secures second Players Championship titleRory Mcllory clinches his second players' championship title and builds momentum for the masters.  McIlroy delivered an early knockout against J.J. Spaun with his best drive of the week that set up a simple birdie."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/lionel-messi-injury-argentina-fifa-world-cup-qualifiers-vs-uruguay-brazil-2694916-2025-03-17",
      "headline": "Lionel Messi ruled out of World Cup qualifiers due to injuryArgentine talisman Lionel Messi has been ruled out of the FIFA World Cup qualifiers due to an indisclosed injury. Messi will be missing two crucial matches against Uruguay and Argentina in the coming days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/ncaa-tournament-who-won-and-lost-in-selection-sunday-glbs-2694911-2025-03-17",
      "headline": "NCAA Tournament: Who won and Lost in Selection Sunday?The 2025 NCAA Men's and Women's Basketball tournament selections were unveiled on Sunday, March 16, with the field of 68 teams now set to compete for the trophy."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-anthony-davis-assigned-to-g-league-as-mavericks-star-eyes-return-from-injury-glbs-2694910-2025-03-17",
      "headline": "NBA: Anthony Davis assigned to G League as Mavericks star eyes return from InjuryThe Dallas Mavericks have sent Anthony Davis to the G-league, Texas Legends, in a major step towards his return from a strained left adductor. Davis is set to attend 5-on-5 scrimmages as he builds up for his NBA return."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/la-olympics-2028-boxing-included-2694901-2025-03-17",
      "headline": "IOC Board approves boxing for inclusion in 2028 Los Angeles Olympic GamesThe International Olympic Committee's (IOC) executive board approved the inclusion of boxing in the 2028 Los Angeles Olympics. Boxing returns for its third straight Olympics despite the IOC derecognising IBA In 2023."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/swiss-open-badminton-live-streaming-when-and-where-to-watch-2694898-2025-03-17",
      "headline": "Swiss Open Badminton Live Streaming: When and where to watch Lakshya Sen, PV SindhuThe Swiss Open badminton is set to start from March 18. A host of Indian players are participating in the tournament. But will the Indian fans be able to watch the broadcast of the tournament?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-age-fitness-chennai-super-kings-harbhajan-singh-2694895-2025-03-17",
      "headline": "Met MS Dhoni recently at a wedding, asked about his IPL readiness at 43: HarbhajanIPL 2025: Former India spinner Harbhajan Singh said MS Dhoni is as hungry as ever to play in the IPL and enjoy his cricket. Dhoni, 43, will return to play for the Chennai Super Kings in the new season, starting March 22. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/new-zealand-vs-pakistan-2nd-t20i-live-streaming-when-and-where-to-watch-2694888-2025-03-17",
      "headline": "New Zealand vs Pakistan 2nd T20I Live Streaming: When and where to watchNew Zealand take on Pakistan in the 2nd T20I match in Dunedin on Tuesday, March 18. The match will start early in the morning for the cricket fans from India and Pakistan.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/march-madness-2025-staten-island-vs-kentucky-the-battle-over-who-created-the-march-madness-bracket-glbs-2694882-2025-03-17",
      "headline": "March madness 2025: Staten Island vs. Kentucky, the battle over who created the March Madness bracketA bar in Staten Island, Ireland, and a Kentucky postal worker claim to have invented the March Madness bracket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nhl-standings-stanley-cup-playoff-format-and-how-tiebreakers-work-glbs-2694879-2025-03-17",
      "headline": "NHL Standings: Stanley Cup, playoff format and how tiebreakers workCurrent NHL Standings, Playoff format and how the tiebreakers are calculated.  With teams fighting for the postseason spots, expect a thrilling finish to the regular season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ms-dhoni-age-fitness-chennai-super-kings-harbhajan-singh-2694895-2025-03-17",
      "headline": "Met MS Dhoni recently at a wedding, asked about his IPL readiness at 43: HarbhajanIPL 2025: Former India spinner Harbhajan Singh said MS Dhoni is as hungry as ever to play in the IPL and enjoy his cricket. Dhoni, 43, will return to play for the Chennai Super Kings in the new season, starting March 22. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/new-zealand-vs-pakistan-2nd-t20i-live-streaming-when-and-where-to-watch-2694888-2025-03-17",
      "headline": "New Zealand vs Pakistan 2nd T20I Live Streaming: When and where to watchNew Zealand take on Pakistan in the 2nd T20I match in Dunedin on Tuesday, March 18. The match will start early in the morning for the cricket fans from India and Pakistan.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/march-madness-2025-staten-island-vs-kentucky-the-battle-over-who-created-the-march-madness-bracket-glbs-2694882-2025-03-17",
      "headline": "March madness 2025: Staten Island vs. Kentucky, the battle over who created the March Madness bracketA bar in Staten Island, Ireland, and a Kentucky postal worker claim to have invented the March Madness bracket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nhl-standings-stanley-cup-playoff-format-and-how-tiebreakers-work-glbs-2694879-2025-03-17",
      "headline": "NHL Standings: Stanley Cup, playoff format and how tiebreakers workCurrent NHL Standings, Playoff format and how the tiebreakers are calculated.  With teams fighting for the postseason spots, expect a thrilling finish to the regular season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-its-a-big-win-banchero-says-as-orlando-snaps-cavaliers-16-game-winning-streak-glbs-2694871-2025-03-17",
      "headline": "NBA: It's a big win, Banchero says as Orlando snaps Cavaliers' 16-game winning streakOrlando Magic snaps Cavaliers' 16-game winning streak. Banchero says it's a big win for the team. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/are-stephen-curry-and-nikola-jokic-playing-tonight-nba-injury-updates-nuggets-vs-warriors-glbs-2694866-2025-03-17",
      "headline": "Are Stephen Curry and Nikola Jokic playing tonight? NBA Injury Updates: Nuggets vs WarriorsStephen curry and Nikola Jokic are listed as questionable for tonight's game, as both teams looking forward to going into the playoffs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pm-narendra-modi-christopher-luxon-champions-trophy-joke-delhi-meet-2694861-2025-03-17",
      "headline": "Watch: New Zealand PM's Champions Trophy final quip leaves PM Modi in splitsNew Zealand Prime Minister Christopher Luxon joked that cricket was off the table during his meeting with Prime Minister Narendra Modi in Delhi on Monday. India defeated Zealand in the Champions Trophy final on March 09.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-rajat-patidar-captain-virat-kohli-message-rcb-unbox-2694848-2025-03-17",
      "headline": "Virat Kohli addresses fans at RCB Unbox, makes special Rajat Patidar requestRajat Patidar was officially introduced as the captain of the RCB at the Unboxing event on Monday. During the event, Virat Kohli sent a message to the fans, asking them to give a lot of love to the new skipper.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-sunil-gavaskar-stupid-stupid-comment-viral-advertisement-2694839-2025-03-17",
      "headline": "Watch: Rishabh Pant recreates Sunil Gavaskar's 'stupid stupid' critical remarks in ad shootAhead of IPL 2025, Rishabh Pant was seen trying to mimic a piece of Sunil Gavaskar's critical commentary during the Border-Gavaskar Trophy. Gavaskar had lashed out at Pant's dismissal during a Test match in Melbourne last year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-betting-fans-deserve-better-cricket-apps-2694818-2025-03-17",
      "headline": "No more bets: India's sporting fans deserve betterIndia's online world is booming. And cricket is placed exactly in the epicentre. As the digital economy grows, it is crucial that the guardrails around consumer protection and responsible entertainment grow with it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/how-to-watch-ipl-2025-jio-hotstar-free-2694797-2025-03-17",
      "headline": "Watch IPL 2025 for free: Reliance announces new JioHotstar subscription offersReliance Jio, India's largest telecom company by user base announced special tariff plans that will allow cricket fans to watch the Indian Premier League for free on JioHotstar. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-prithvi-shaw-comeback-shashank-singh-pbks-2694777-2025-03-17",
      "headline": "If Prithvi Shaw can go back to basics, he can achieve anything: PBKS starPunjab Kings star Shashank Singh feels that if Prithivi Shaw can return to basics, then he can achieve anything in cricket. Shaw has endured a rough period in the past few years as he has been frozen out of the Indian team contention. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-pbks-azmatullah-omarzai-arrival-delayed-personal-reasons-2694758-2025-03-17",
      "headline": "PBKS all-rounder Azmatullah Omarzai's arrival delayed due to personal reasonsAfghanistan all-rounder Azmatullah Omarzai's arrival at the Punjab Kings has been delayed due to personal reasons. India Today has learnt that Omarzai is expected to join the camp on March 21, a day before the IPL opener in Kolkata.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-kagiso-rabad-dale-steyn-shane-bond-2694750-2025-03-17",
      "headline": "Bumrah, Rabada are gold, 70 percent bowlers don't know what they're doing: BondFormer fast bowlers Dale Steyn and Shane Bond believe that 70 per cent of the current crop of bowlers do not know what they are doing. Both pacers have stated that Jasprit Bumrah and Kagiso Rabada stand out amongst the rest of the current generation.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2024-lsg-captain-rishabh-pant-vows-to-back-his-players-2694710-2025-03-17",
      "headline": "Captain Rishabh Pant vows to back his players to the hilt ahead of IPL 2025Lucknow Super Giants (LSG) captain Rishabh Pant vowed to back his players to the hilt in the pre-season pep talk ahead of Indian Premier League 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/tara-prasad-figure-skater-online-death-threats-2694711-2025-03-17",
      "headline": "Indian-American skater blasts trolls after receiving death threatsIndian-American figure skater Tara Prasad has hit back at online trolls sending death threats. Despite facing setbacks, she continues to pursue her Olympic dreams, earning praise for her perseverance from prominent figures."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}