{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-bounces-back-after-wild-week-fueled-by-tariff-war-2707818-2025-04-12",
      "headline": "Wall Street bounces back after wild week fueled by tariff warAll three major US indexes ended the session sharply higher after assurances from Boston Federal Reserve President Susan Collins that the Fed is prepared to keep financial markets functioning should the need arise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-pushing-trade-deals-with-us-eu-with-high-urgency-s-jaishankar-trump-tariffs-2707776-2025-04-11",
      "headline": "India pushing for trade deals with US, EU with high urgency: JaishankarOn Wednesday, Trump announced a 90-day pause on his sweeping tariffs on all countries, except China as countries around the world wilted under the impact of the seismic action."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-trump-tariffs-could-make-iphones-cars-and-clothes-in-the-us-2707519-2025-04-11",
      "headline": "How Trump tariffs could make iPhones, cars, and clothes costlier in the USTrump's latest plan includes a massive 145% tax on goods coming from China. Experts say this could end the long run of cheap, imported goods that Americans have enjoyed for decades. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-ends-1300-points-higher-nifty-above-22500-tata-steel-up-5-percent-metal-stocks-gain-2707506-2025-04-11",
      "headline": "Sensex ends 1,300 points higher, Nifty above 22,500; Tata Steel up 5%The S&P BSE Sensex jumped 1,310.11 points to close at 75,157.26, while the NSE Nifty50 added 429.40 points to end at 22,828.55. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mutual-fund-sip-vs-ppf-what-rs-1-lakh-a-year-can-earn-in-15-years-2707471-2025-04-11",
      "headline": "Mutual fund SIP vs PPF: What Rs 1 lakh a year can earn in 15 yearsPPF is a government scheme with a current interest rate of around 7.1% per annum. On the other hand, SIPs typically offer higher interest when invested over the long term, especially in equity mutual funds. But they carry some risk, as returns depend on the market."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/muthoot-finance-share-price-fall-over-8-percent-today-manappuram-finance-iifl-finance-stock-low-rbi-rules-2707451-2025-04-11",
      "headline": "Explained: Why Muthoot Finance shares fell over 8% todayMuthoot Finance stock price: Muthoot Finance, one of India's largest gold loan companies, has seen its share price decline by 14% in the past five trading sessions. The stock is also down 7% over the past month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mutual-fund-amfi-data-march-2025-sips-decrease-reason-trump-tariff-global-uncertainty-2707415-2025-04-11",
      "headline": "Mutual fund inflows hit in March. Trump tariffs to blame?The largest outflows were seen in debt mutual funds, where investors pulled out Rs 2.02 lakh crore, possibly due to end-of-year financial needs by institutions and ongoing global uncertainty."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zerodha-ceo-nithin-kamath-money-advice-no-shortcuts-to-getting-rich-it-takes-good-habits-and-patience-2707411-2025-04-11",
      "headline": "Zerodha CEO Nithin Kamath's money advice: 'No shortcuts to getting rich'Nithin Kamath shared a video with a powerful message—earning more doesn't mean you're saving more. In fact, higher income often leads to more spending on gadgets, clothes, dining out, or things meant just to impress others."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/trump-tariff-us-china-trade-war-lower-loan-emis-repo-rate-rbi-explained-2707412-2025-04-11",
      "headline": "Trump tariffs, trade war fears could bring your loan EMIs down further this yearBorrowers could emerge as the unexpected winners if global headwinds linger and domestic growth slows further, with the RBI likely to step in again to lower the key interest rates. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/share-market-rally-today-sensex-nifty-defy-wall-street-crash-key-reasons-retail-investors-need-to-know-2707375-2025-04-11",
      "headline": "Wall Street crashes, Dalal Street rallies: 5 things investors should knowStock market today: Dalal Street's leading indices rallied sharply, defying a global sell-off sparked by Wall Street's overnight crash. Here are the key factors behind today's stock market rally. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/amfi-data-mutual-fund-inflows-drop-march-2025-rs-4221-crore-global-uncertainty-2707374-2025-04-11",
      "headline": "Mutual fund inflows fall for March by Rs 4,221 crore, shows AMFI dataEquity mutual fund inflows dropped by Rs 4,221 crore in March, falling to Rs 25,082 crore from Rs 29,303 crore in February 2025, as per data released by the Association of Mutual Funds in India (AMFI). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tcs-share-price-down-q4-results-brokerage-ratings-price-targets-key-details-2707333-2025-04-11",
      "headline": "TCS shares fall after disappointing Q4. Check latest price targetsTCS share price: Despite a muted Q4, brokerages back TCS with revised targets, betting on deal wins, margin levers, and recovery prospects to drive medium-term gains."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/gaurav-khanna-wins-celebrity-masterchef-nikki-tamboli-tejasswi-prakash-runner-ups-2707767-2025-04-11",
      "headline": "Gaurav Khanna wins Celebrity MasterChef, Nikki Tamboli, Tejasswi Prakash runner-upsActor Gaurav Khanna lifted the 'Celebrity MasterChef' trophy. Nikki Tamboli and Tejasswi Prakash bagged first and second runner-up spots, respectively. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/prakash-raj-shares-pic-with-kunal-kamra-asks-how-to-reach-tamil-nadu-shiv-sena-2707747-2025-04-11",
      "headline": "Prakash Raj shares pic with Kunal Kamra, asks 'how to reach Tamil Nadu'Veteran actor Prakash Raj met comedian Kunal Kamra. However, it was the actor's caption that caught the attention of all. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshan-meets-priyanka-chopra-nick-jonas-in-us-krrish-4-casting-2707739-2025-04-11",
      "headline": "Hrithik Roshan meets Priyanka Chopra, Nick Jonas in USHrithik Roshan recently revealed that he met Priyanka Chopra and Nick Jonas in the US. Their meet-up comes amid rumours of Chopra's casting reports in Krrish 4. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/banijay-asia-exits-khatron-ke-khiladi-rohit-shetty-orry-munawar-faruqui-2707719-2025-04-11",
      "headline": "Exclusive: Banijay exits Khatron Ke Khiladi, future of new season uncertainKhatron Ke Khiladi 15's future looks uncertain as producer Banijay exited the show. This latest development has upset director Rohit Shetty. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/puratawn-the-ancient-review-sharmila-tagore-rituparna-sengupta-suman-ghosh-2707696-2025-04-11",
      "headline": "Puratawn review: Sharmila Tagore's comeback film flows like a poemReleased-Fri Apr 11, 2025Puratawn review: Sharmila Tagore's comeback Bengali film explores the intertwining of past and present memories in an octogenarian's life. It also focusses on an intricate mother-daughter relationship. Read the full review here."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/actor-chahatt-khanna-reveals-harrowing-childhood-molestation-memory-2707693-2025-04-11",
      "headline": "Actor Chahatt Khanna shares disturbing childhood memory of being molestedActor Chahatt Khanna recently shared a disturbing childhood memory of being molested by an elderly neighbour.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/agnyathavasi-review-slow-and-steady-thriller-about-dark-choices-producer-hemanth-rao-2707586-2025-04-11",
      "headline": "Agnyathavasi review: Slow and steady thriller about dark choicesReleased-Fri Apr 11, 2025Agnyathavasi film review: Produced by Hemanth Rao, this Kannada thriller is an interesting ride with its engaging story and technical brilliance. It has been directed by Janardhan Chikkanna and features Rangayana Raghu in the lead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/kumar-shanus-daughter-shannon-k-to-perform-at-coachella-2025-2707622-2025-04-11",
      "headline": "Singer Kumar Shanu's daughter Shannon K to perform at Coachella 2025Singer Kumar Shanu's daughter Shannon K is set to make her Coachella 2025 debut. The singer will be the first indie Indian-origin singer to perform at the global event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/from-k-idol-to-screen-icon-spotlight-on-iu-illustrious-career-2707597-2025-04-11",
      "headline": "From K-idol to screen icon, a spotlight on IU's illustrious careerKorean icon IU is both an accomplished actor and a K-pop star. The artiste is currently seen in Netflix's When Life Gives You Tangerines. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/superstar-rajinikanth-attapady-kerala-jailer-2-shoot-nelson-dilipkumar-2707532-2025-04-11",
      "headline": "Viral: Superstar Rajinikanth arrives in Kerala for Jailer 2 shootSuperstar Rajinikanth arrived in Kerala's Attappadi to take part in the shooting of 'Jailer 2'. Directed by Nelson Dilipkumar, the current shooting schedule is expected to go on for about 20 days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-reunites-with-hrithik-roshan-for-krrish-4-aditya-chopra-yrf-2707525-2025-04-11",
      "headline": "Priyanka Chopra reunites with Hrithik Roshan for Krrish 4: ReportPriyanka Chopra is reportedly believed to have joined forces with Hrithik Roshan again for Krrish 4. The next part of the franchise will be directed by Hrithik. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nushrratt-bharuccha-meets-pm-modi-thanks-him-for-rescuing-her-from-israel-2707502-2025-04-11",
      "headline": "Nushrratt Bharuccha meets PM Modi, thanks him for rescuing her from IsraelNushrratt Bharuccha shared a post and thanked Prime Minister Narendra Modi for bringing her back from war-torn Israel during the recent conflicts. This comes after the actor met PM Modi at a recent event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/akshay-kumar-reacts-to-political-row-over-sankaran-nair-kesari-2-rajeev-chandrasekhar-2707487-2025-04-11",
      "headline": "I'm just an actor: Akshay Kumar reacts to political row over Sankaran NairAkshay Kumar distanced himself from political comments linked to his upcoming film 'Kesari 2' in which he portarys a pre-Independence president of the Indian National Congress. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-reacts-to-jaya-bachchan-criticism-toilet-ek-prem-katha-flop-2707486-2025-04-11",
      "headline": "Akshay Kumar reacts to Jaya Bachchan's criticism of Toilet: Ek Prem KathaAkshay Kumar addressed Jaya Bachchan's criticism of his film 'Toilet: Ek Prem Katha' during 'Kesari 2' trailer launch, stating that if she believes the title is inappropriate, she must be right."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/empuraan-box-office-mohanlal-prithvirajs-film-storms-past-rs-100-crore-in-india-2707476-2025-04-11",
      "headline": "Empuraan box office: Mohanlal, Prithviraj's film storms past Rs 100 crore in IndiaMohanlal and Prithviraj Sukumaran's L2: Empuraan zoomed past Rs 100 crore at the domestic box office. On Day 15, the film witnessed a decline, earning only Rs 0.70 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/sushmita-sen-sister-in-law-charu-asopa-leaves-mumbai-is-now-selling-clothes-online-2707450-2025-04-11",
      "headline": "Sushmita Sen's sister-in-law Charu leaves Mumbai, is now selling clothes onlineSushmita Sen's ex sister-in-law, Charu Asopa, leaves Mumbai after facing a financial crisis. The actor even sold off her clothes online for extra money. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sunny-deol-on-evolution-of-indian-cinema-2707447-2025-04-11",
      "headline": "Indian, not pan-Indian: Sunny Deol on evolution of Indian cinemaJaat star Sunny Deol has been busy promoting his new film. During a recent media event, the actor spoke about the growing trend of pan-Indian films. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/emraan-hashmi-on-his-sons-cancer-diagnosis-my-entire-world-flipped-in-12-hours-2707440-2025-04-11",
      "headline": "Emraan Hashmi on his son's cancer diagnosis: My entire world flipped in 12 hoursActor Emraan Hashmi recounted the harrowing day his son, Ayaan, was diagnosed with cancer. The life-changing event occurred unexpectedly during a family brunch in 2014."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/emraan-hashmi-on-singer-kk-2707424-2025-04-11",
      "headline": "Emraan Hashmi on singer KK: No substitute for certain talentActor Emraan Hashmi recently remembered the late singer KK and said that his voice was godsent. KK died in May in 2022. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/piyush-goyal-india-usa-trade-deal-2707652-2025-04-11",
      "headline": "No deal at gunpoint, India First approach: Piyush Goyal on trade talks with USMinister Piyush Goyal emphasised that India and the US are progressing on a bilateral trade agreement, aiming to double trade to USD 500 billion by 2030. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/vanishing-daughters-haryana-sex-determination-abortion-decoy-beti-bachao-beti-padhao-raid-2707741-2025-04-11",
      "headline": "Vanishing Daughters, Part 3: Being a decoy in a Beti Bachao Beti Padhao raidA journalist-turned-decoy narrates harrowing sting operation exposing India's illegal sex determination industry, where doctors moonlight as law enforcers, informers risk everything, and bureaucratic turf wars often let the culprits slip through the cracks. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/mob-throws-stone-at-train-vandalise-station-in-bengals-murshidabad-2707714-2025-04-11",
      "headline": "Waqf protest turns violent in Bengal: Mob throws stones at train, cops injuredAt least two trains have been cancelled, and another five have been diverted in the wake of the incident."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/meta-worked-hand-in-glove-with-china-censorship-betrayed-us-values-shared-user-data-whistleblower-sarah-wynn-williams-2707845-2025-04-12",
      "headline": "Meta worked 'hand in glove' with China on censorship, betrayed US: WhistleblowerMeta whistleblower Sarah Wynn-Williams testified before the Senate judiciary subcommittee that the tech titan helped the Chinese government build censorship tools and also allowed it access to user data."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-kkr-ms-dhoni-reaction-defeat-powerplay-batting-2707777-2025-04-11",
      "headline": "MS Dhoni reacts to CSK's horror defeat to KKR, defends powerplay styleIPL 2025, CSK vs KKR: MS Dhoni defended CSK's style in the powerplay, but urged the batters to be more responsible and build partnerships. CSK did not hit a single six in the powerplay on Friday and managed just 31 runs in the first six overs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-judge-allows-mahmoud-khalil-deportation-cites-national-security-risk-glbs-2707813-2025-04-12",
      "headline": "US judge allows Mahmoud Khalil's deportation, cites national security riskMahmoud Khalil, a legal US resident, was taken into custody and flown to an immigration detention facility in Jena, Louisiana, far from his legal team and his wife."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/s-jaishankar-tahawwur-rana-extradition-marco-rubio-mumbai-attack-2707780-2025-04-12",
      "headline": "Big step towards justice: Jaishankar on 26/11 plotter Tahawwur Rana's extraditionS Jaishankar lauded the extradition of 26/11 accused Tahawwur Rana, calling it a major step toward justice. Rana was extradited to India form the US on a special flight on Thursday evening\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-issues-stern-warning-to-iran-all-hell-to-pay-if-nuclear-program-continues-glbs-2707827-2025-04-12",
      "headline": "Trump's stern warning to Iran: All hell to pay if nuclear programme continuesSpeaking to reporters, White House press secretary Karoline Leavitt emphasised that President Donald Trump's top priority is preventing Iran from ever acquiring a nuclear weapon. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/tahawwur-rana-extradition-indias-first-extradition-battle-daughter-avantika-maken-forgave-father-killer-ranjit-gill-kuki-2707421-2025-04-11",
      "headline": "India's first extradition battle: When a daughter forgave her father's killerIndia's first extradition battle to get custody of Khalistani separatist Ranjit Singh 'Kuki' Gill lasted 12 years. Gill was among the three who killed Congress MP Lalit Maken, his wife and bodyguard in Delhi in 1985. Gill, extradited in 2000, walked free in 2009, after their daughter, Avantika Maken, forgave him for the murders."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/punjab-haryana-sex-determination-racket-case-female-foeticide-arrested-for-2707771-2025-04-11",
      "headline": "FIR against three in Punjab after India Today expose on sex determination racketPunjab Police registered an FIR against three individuals after an operation, in which India Today played a key role, caught them running an illegal sex determination facility."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/watch-smoke-fills-sky-as-plane-crashes-near-florida-highway-killing-3-on-board-glbs-2707806-2025-04-12",
      "headline": "Watch: Smoke fills sky as plane crashes near Florida highway, killing 3 on boardA Cessna 310 crashed near Florida's I-95 shortly after takeoff, killing all three aboard and severely injuring a motorist. The fiery crash triggered panic, damaged a car, and caused road and rail closures. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/k-annamalai-tamil-nadu-bjp-amit-shah-national-role-new-president-nainar-nagendran-2707615-2025-04-11",
      "headline": "Annamalai likely to get national role in BJP, signals Amit ShahUnion Home Minister Amit Shah hinted at a national-level role for outgoing Tamil Nadu BJP chief K Annamalai, following his withdrawal from the race for the party's state unit president."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/lsg-vs-gt-preview-ipl-2025-predicted-11s-pitch-report-lucknow-weather-2707636-2025-04-12",
      "headline": "Gujarat aim to tighten top spot grip against confident LucknowIPL 2025, LSG vs GT: Gujarat Titans have won four matches on the trot and will be looking to build on their momentum when they face Rishabh Pant's Lucknow Super Giants in the first of Saturday's doubleheader. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/3-terrorists-including-jaish-commando-killed-in-kishtwar-on-day-2-of-army-ops-2707790-2025-04-12",
      "headline": "3 terrorists, including Jaish commando killed in Kishtwar on day 2 of Army opsThree terrorists, including Jaish-e-Mohammad commander Saifullah, were killed in Kishtwar, Jammu and Kashmir. The Army and police launched a joint operation. Surveillance continues across hilly regions amid rising summer infiltration risks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/amit-shah-eps-meet-bjp-aiadmk-alliance-2026-tamil-nadu-polls-2707571-2025-04-11",
      "headline": "BJP, AIADMK to fight 2026 Tamil Nadu polls under EPS's leadership: Amit ShahUnion Home Minister Amit Shah confirmed AIADMK and BJP will jointly contest the 2026 Tamil Nadu Assembly elections. He announced that the alliance will be led by Edappadi K Palaniswami in Tamil Nadu and Prime Minister Narendra Modi nationally."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/kia-syros-achieves-5-star-safety-rating-at-bharat-ncap-2707638-2025-04-11",
      "headline": "Kia Syros achieves 5-star safety rating at Bharat NCAPKia Syros is the most feature-loaded sub-4 metre compact SUV in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/sir-c-sankaran-nair-lawyer-who-took-on-british-over-jallianwala-bagh-massacre-2707727-2025-04-11",
      "headline": "Who was Sir C Sankaran Nair, the 'forgotten patriot' played by Akshay Kumar?Sir C Sankaran Nair, a civil rights advocate from the time of Indian freedom movement, will be played by Akshay Kumar on the big screen. Sankaran Nair was not just a fiery nationalist and civil rights advocate, he was also a former Indian National Congress president who was a forgotten hero, up until now. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/man-caught-filming-woman-bathing-in-ayodhya-guest-house-obscene-videos-found-on-phone-2707837-2025-04-12",
      "headline": "Man caught filming woman bathing in Ayodhya; obscene videos found on phonePolice examined the accused's mobile phone and recovered ten videos of women bathing, along with several obscene photos and videos. The matter is under investigation and the police are currently interrogating the accused."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-envoy-witkoff-meets-putin-amid-trumps-fury-over-slow-progress-in-peace-talks-glbs-2707823-2025-04-12",
      "headline": "US envoy Witkoff meets Putin amid Trump's fury over slow progress in peace talksUS envoy Steve Witkoff met Russian President Vladimir Putin in St. Petersburg to push for Ukraine ceasefire, as Donald Trump urged Moscow to \"get moving.\" Talks lasted over four hours, but peace efforts remain stalled amid major disagreements."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-kkr-ravichandran-ashwin-aakash-chopra-2707791-2025-04-12",
      "headline": "R Ashwin hasn't bowled well at all, he adds salt to CSK's wounds: Aakash ChopraIPL 2025, CSK vs KKR: Aakash Chopra slammed R Ashwin, saying the senior off-spinner's struggles have only added salt to CSK's wounds. Ashwin has taken 6 wickets in five matches while conceding at 9.90 runs per over. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/puratawn-the-ancient-review-sharmila-tagore-rituparna-sengupta-suman-ghosh-2707696-2025-04-11",
      "headline": "Puratawn review: Sharmila Tagore's comeback film flows like a poemReleased-Fri Apr 11, 2025Puratawn review: Sharmila Tagore's comeback Bengali film explores the intertwining of past and present memories in an octogenarian's life. It also focusses on an intricate mother-daughter relationship. Read the full review here."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/who-is-shawn-monper-butler-man-arrested-for-threatening-to-kill-donald-trump-elon-musk-glbs-2707816-2025-04-12",
      "headline": "Who is Shawn Monper, US man arrested for threatening to kill Trump, Elon MuskA Pennsylvania man, Shawn Monper, has been charged with threatening to kill Donald Trump, Elon Musk, and other officials online. He was taken into custody, with a hearing set for April 14."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/us-vice-president-jd-vance-likely-to-visit-india-between-april-21-24-2707725-2025-04-11",
      "headline": "US Vice President JD Vance likely to visit India between April 21-24US Vice President JD Vance and US National Security Advisor Mike Waltz will visit India from April 21-24, with key meetings and trade talks expected. Usha Vance will accompany him on her first visit to India as Second Lady.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/gaurav-khanna-wins-celebrity-masterchef-nikki-tamboli-tejasswi-prakash-runner-ups-2707767-2025-04-11",
      "headline": "Gaurav Khanna wins Celebrity MasterChef, Nikki Tamboli, Tejasswi Prakash runner-upsActor Gaurav Khanna lifted the 'Celebrity MasterChef' trophy. Nikki Tamboli and Tejasswi Prakash bagged first and second runner-up spots, respectively. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-matthew-hayden-ms-dhoni-csk-powerplay-approach-2707847-2025-04-12",
      "headline": "CSK conservative in powerplay: MS Dhoni's viewpoint criticised by Matthew HaydenMatthew Hayden doesn't agree with MS Dhoni's viewpoint that CSK has to be conservative in the powerplay after their loss to KKR. CSK suffered a big loss at home to remain in the 9th spot on the points table. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-kkr-mike-hussey-ms-dhoni-2707831-2025-04-12",
      "headline": "Michael Hussey defends CSK's experience mantra despite heavy defeat to KKRIPL 2025, CSK vs KKR: Michael Hussey showed faith in the Chennai Super Kings veterans to do well later in the tournament, backing them after the heavy defeat to Kolkata Knight Riders at Chepauk."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-quinton-de-kock-sunil-narine-csk-vs-kkr-press-conference-2707800-2025-04-12",
      "headline": "Narine prides himself on accuracy, his batting is an X factor: De KockIPL 2025, CSK vs KKR: Quinton de Kock praised his teammates Varun Chakravarthy and Sunil Narine after Kolkata Knight Riders thrashed Chennai Super Kings on Friday at the MA Chidambaram Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/lsg-vs-gt-preview-ipl-2025-predicted-11s-pitch-report-lucknow-weather-2707636-2025-04-12",
      "headline": "Gujarat aim to tighten top spot grip against confident LucknowIPL 2025, LSG vs GT: Gujarat Titans have won four matches on the trot and will be looking to build on their momentum when they face Rishabh Pant's Lucknow Super Giants in the first of Saturday's doubleheader. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-kkr-ravichandran-ashwin-aakash-chopra-2707791-2025-04-12",
      "headline": "R Ashwin hasn't bowled well at all, he adds salt to CSK's wounds: Aakash ChopraIPL 2025, CSK vs KKR: Aakash Chopra slammed R Ashwin, saying the senior off-spinner's struggles have only added salt to CSK's wounds. Ashwin has taken 6 wickets in five matches while conceding at 9.90 runs per over. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/srh-vs-pbks-daniel-vettori-press-conference-ipl-2025-2707804-2025-04-12",
      "headline": "SRH batters are usually at their best if they dominate the powerplay: VettoriIPL 2025, SRH vs PBKS: Daniel Vettori, in the pre-match press conference, backed the Sunrisers Hyderabad batters to make a strong comeback in their upcoming clash against Punjab Kings at the Rajiv Gandhi International Stadium. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/kelsie-whitmore-eyes-history-in-mexican-baseball-league-with-el-aguila-de-veracruz-glbs-2707802-2025-04-12",
      "headline": "Kelsie Whitmore eyes history in Mexican Baseball League with El Águila de VeracruzKelsie Whitmore, the trailblazing pitcher and outfielder who became the first woman to play in an MLB-partnered league, is on the verge of making history once again, this time in Mexico."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-kkr-powerplay-test-match-kris-srikkanth-2707787-2025-04-11",
      "headline": "One of CSK's worst defeats; powerplay felt like Test match practice: SrikkanthIPL 2025, CSK vs KKR: Former cricketer Kris Srikkanth wasn't a happy man after the Chennai Super Kings were hammered by the Kolkata Knight Riders in the clash on Friday at the Chepauk. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-kkr-chennai-super-kings-memes-ms-dhoni-2707786-2025-04-11",
      "headline": "Pretending to be a cricket team: CSK memes viral after humiliating KKR lossFans decided to have some fun at the expense of the Chennai Super Kings as memes went viral on social media after their humbling loss to Kolkata Knight Riders at the Chepauk on Friday, April 11. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-kkr-ms-dhoni-reaction-defeat-powerplay-batting-2707777-2025-04-11",
      "headline": "MS Dhoni reacts to CSK's horror defeat to KKR, defends powerplay styleIPL 2025, CSK vs KKR: MS Dhoni defended CSK's style in the powerplay, but urged the batters to be more responsible and build partnerships. CSK did not hit a single six in the powerplay on Friday and managed just 31 runs in the first six overs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-kkr-ms-dhoni-stat-pack-ms-dhoni-2707770-2025-04-11",
      "headline": "CSK's worst on MS Dhoni's return to captaincy: Stat PackIPL 2025, CSK vs KKR: Chennai Super Kings had a rough time on Friday after Kolkata Knight Riders handed them an eight-wicket defeat at the MA Chidambaram Stadium. The Super Kings also made some embarrassing records following their huge loss. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/kelsie-whitmore-eyes-history-in-mexican-baseball-league-with-el-aguila-de-veracruz-glbs-2707802-2025-04-12",
      "headline": "Kelsie Whitmore eyes history in Mexican Baseball League with El Águila de VeracruzKelsie Whitmore, the trailblazing pitcher and outfielder who became the first woman to play in an MLB-partnered league, is on the verge of making history once again, this time in Mexico."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-kkr-powerplay-test-match-kris-srikkanth-2707787-2025-04-11",
      "headline": "One of CSK's worst defeats; powerplay felt like Test match practice: SrikkanthIPL 2025, CSK vs KKR: Former cricketer Kris Srikkanth wasn't a happy man after the Chennai Super Kings were hammered by the Kolkata Knight Riders in the clash on Friday at the Chepauk. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-kkr-chennai-super-kings-memes-ms-dhoni-2707786-2025-04-11",
      "headline": "Pretending to be a cricket team: CSK memes viral after humiliating KKR lossFans decided to have some fun at the expense of the Chennai Super Kings as memes went viral on social media after their humbling loss to Kolkata Knight Riders at the Chepauk on Friday, April 11. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-kkr-ms-dhoni-reaction-defeat-powerplay-batting-2707777-2025-04-11",
      "headline": "MS Dhoni reacts to CSK's horror defeat to KKR, defends powerplay styleIPL 2025, CSK vs KKR: MS Dhoni defended CSK's style in the powerplay, but urged the batters to be more responsible and build partnerships. CSK did not hit a single six in the powerplay on Friday and managed just 31 runs in the first six overs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-csk-vs-kkr-ms-dhoni-stat-pack-ms-dhoni-2707770-2025-04-11",
      "headline": "CSK's worst on MS Dhoni's return to captaincy: Stat PackIPL 2025, CSK vs KKR: Chennai Super Kings had a rough time on Friday after Kolkata Knight Riders handed them an eight-wicket defeat at the MA Chidambaram Stadium. The Super Kings also made some embarrassing records following their huge loss. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}