{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-rises-over-100-points-nifty-above-24400-grasim-gains-2-2769299-2025-08-11",
      "headline": "Sensex rises over 100 points, Nifty above 24,400; Grasim gains 2%The S&P BSE Sensex was trading 157.26 points higher at 80,015.05 at 9:26 am, while the NSE Nifty50 rose 43.60 points to trade at 24,406.90. Most of the other broader market indices were mixed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/nsdl-share-price-multibagger-stock-market-gains-investors-rally-explained-2769295-2025-08-11",
      "headline": "NSDL turns into a multibagger for investors: Will it continue to gain?Issued at Rs 800, the stock opened at Rs 880 and has raced to Rs 1,300.30, minting massive gains for early institutional investors and retail shareholders alike.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/icici-bank-hikes-minimum-balance-to-rs-50000-metro-urban-areas-penalty-charges-2768696-2025-08-09",
      "headline": "ICICI Bank hikes minimum savings balance to Rs 50,000: What it means for youThe change applies to all new accounts opened after that date, setting a new benchmark in the industry for the highest MAB requirement among domestic banks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/union-minister-piyush-goyal-swiss-firm-land-problem-maharashtra-ease-of-business-endress-hauser-2768661-2025-08-09",
      "headline": "Ease of doing business: Piyush Goyal resolves Swiss firm's land issue in hoursUnion Minister Piyush Goyal resolved a complex land allocation issue for a major Swiss company during a live business conference, highlighting the ease of business in India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/trumps-tariff-war-is-this-indias-1991-moment-montek-singh-ahluwalia-exclusive-2768555-2025-08-08",
      "headline": "Trump's tariff war: Is this India's 1991 moment? Montek Singh Ahluwalia exclusiveAt the Business Today India@100 Summit, Montek Singh Ahluwalia, former Deputy Chairman of the Planning Commission, discusses if the 2025 Trump tariff war presents a 1991-like moment for India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/piyush-goyal-exclusive-whole-world-recognises-india-as-fastest-growing-economy-2768534-2025-08-08",
      "headline": "Piyush Goyal exclusive: Whole world recognises India as fastest-growing economyUnion Minister Piyush Goyal hailed the Indian economy and said the whole world recognises us as the fastest-growing large economy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/a-win-for-india-piyush-goyal-on-clinching-uk-free-trade-deal-2768506-2025-08-08",
      "headline": "'A win for India': Piyush Goyal on clinching UK free trade dealUnion Minister Piyush Goyal, speaking at the Business Today India@100 Summit, called the India-UK free trade deal a big win for the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cabinet-approves-rs-30000-crore-compensation-for-oil-marketing-companies-to-maintain-lpg-price-stability-2768365-2025-08-08",
      "headline": "Cabinet approves Rs 30,000 crore subsidy to oil companies to keep LPG prices stableThe decision aims to protect consumers from changes in global LPG prices and support the financial health of the public sector oil companies. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-nifty-donald-trump-trade-talk-dalal-street-2768343-2025-08-08",
      "headline": "Sensex cracks below 80,000 as tariff fears rattle stock marketsThe S&P BSE Sensex fell 765.47 points to close below the psychological 80,000 mark, while the NSE Nifty50 dropped 232.85 points to settle at 24,363.30. Midcap and smallcap stocks witnessed deeper cuts, reflecting growing investor unease over the evolving global trade scenario."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-not-a-dead-economy-set-to-become-3rd-largest-in-world-amitabh-kant-2768334-2025-08-08",
      "headline": "India not a dead economy, poised to become 3rd-largest in world: Amitabh KantAfter Donald Trump's 'dead economy' jibe, Amitabh Kant calls India a resilient, reform-driven powerhouse on track to become the world's third-largest economy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-tariff-surge-could-stall-indias-manufacturing-momentum-warns-moodys-2768326-2025-08-08",
      "headline": "US tariff surge could stall India's manufacturing momentum, warns Moody'sOn Thursday, US President Donald Trump signed an Executive Order that adds a 25% tariff on Indian goods. This move comes in response to India's continued import of oil from Russia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-fuel-bill-may-rise-by-9-billion-in-fy26-and-12-billion-in-fy27-if-it-stops-russian-oil-import-sbi-2768284-2025-08-08",
      "headline": "How much will India's fuel bill rise if it stops buying oil from Russia?Russia currently provides 10% of the world's crude supply. If multiple countries stop buying from Russia at once, crude oil prices could rise by around 10%, as per the report. That would affect everyone, not just India."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-reacts-malti-hit-by-bag-hyderabad-airport-2769283-2025-08-11",
      "headline": "Priyanka Chopra reacts as daughter Malti is hit by bag at airportActor Priyanka Chopra was seen with her daughter at Hyderabad airport, where fans captured Malti enjoying a ride on a trolley. The actor was in the city for the shooting of SS Rajamouli and Mahesh Babu's film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-cisf-mask-removal-mumbai-airport-viral-video-2769276-2025-08-11",
      "headline": "Allu Arjun asked to remove mask at airport, fans react to viral videoActor Allu Arjun was seen having a conversation with the CISF official at an airport recently. He was asked to remove his mask for identification and a video of the same has gone viral on social media. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-family-denies-mistreatment-allegations-by-brother-faissal-khan-2769284-2025-08-11",
      "headline": "Distressed Aamir Khan's family denies mistreatment allegations by brother FaissalAamir Khan's family has responded to Faissal Khan's allegations, firmly denying any mistreatment. They stated that all decisions were taken out of concern for his well-being and based on medical advice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshan-praises-ntr-dedication-war-2-hyderabad-event-2769253-2025-08-11",
      "headline": "Hrithik Roshan praises Jr NTR at War 2 event: He is a one-take actor, learnt a lotHrithik Roshan commended Jr NTR's dedication as they promoted 'War 2' in Hyderabad. The Bollywood actor called Jr NTR a 'one-take final-take actor'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/janhvi-kapoor-shines-in-red-lehenga-for-masaba-gupta-bridal-collection-2769183-2025-08-10",
      "headline": "Janhvi Kapoor shines in red lehenga for Masaba Gupta's bridal collection. VideoJanhvi Kapoor impressed fans with her beautiful bridal look for designer Masaba Gupta's new collection. She wore a bright red lehenga with detailed embroidery and traditional designs, paired with big earrings, a maang teeka, and delicate kaleeras."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/music-composer-dony-hazarikas-mother-dies-in-car-accident-in-mumbai-2769172-2025-08-10",
      "headline": "Music composer Dony Hazarika's mother dies in car accident in MumbaiMusic composer Dony Hazarika's mother, Sultana Kishore Ahmed Hazarika, died when their Uber car hit a crane in Mumbai's Vikhroli area. Dony and the caretaker were also hurt, and the police have filed a case against the Uber driver."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/deepika-padukone-steps-away-from-acting-in-the-intern-remake-2769158-2025-08-10",
      "headline": "Deepika Padukone steps away from acting in The Intern remake: ReportDeepika Padukone has stepped away from acting in 'The Intern' remake to concentrate on producing it. The project, co-starring Amitabh Bachchan, has faced multiple delays since it was announced in 2020."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shoojit-sircar-on-shah-rukh-khan-the-kerala-story-national-awards-winning-controversy-2769125-2025-08-10",
      "headline": "You can't question the jury: Shoojit Sircar on SRK, Kerala Story National Awards rowAmid the debate over Shah Rukh Khan winning Best Actor and 'The Kerala Story' bagging Best Film at the National Film Awards, filmmaker Shoojit Sircar said the jury's decision should be final and beyond question. He added that while opinions may differ, it's the sensibilities of the appointed jury that ultimately matter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/chinmayi-sripada-stands-with-chennai-sanitation-workers-seeking-permanent-jobs-2769113-2025-08-10",
      "headline": "Singer Chinmayi Sripada stands with Chennai sanitation workers seeking permanent jobsSinger Chinmayi Sripaada visited protesting sanitation workers in Chennai, offering them water and biscuits. She also urged the government to provide the workers with the jobs and salaries they were promised."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ahaan-panday-aneet-paddas-chemistry-turns-heads-at-saiyaara-success-bash-2769100-2025-08-10",
      "headline": "Ahaan Panday, Aneet Padda's chemistry turns heads at Saiyaara success bashThe success bash for Mohit Suri's romantic blockbuster 'Saiyaara' in Mumbai celebrated the film's impressive Rs 500 crore worldwide earnings. The lead pair, Ahaan Panday and Aneet Padda's chemistry, stole the spotlight. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sooraj-barjatya-confirms-ayushmann-khurrana-as-prem-in-his-next-family-drama-2769098-2025-08-10",
      "headline": "Sooraj Barjatya confirms Ayushmann Khurrana as Prem in his next family dramaSooraj Barjatya's next film will star Ayushmann Khurrana as the new 'Prem' in a Mumbai-set family drama.\r\nThe director praised Ayushmann as a \"dedicated and fine\" actor and aims to recreate the honesty and warmth his films are known for."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/brothers-ram-charan-varun-tej-sai-tej-flaunt-rugged-look-in-viral-sunday-gym-pic-2769075-2025-08-10",
      "headline": "Brothers Ram Charan, Varun Tej, Sai Tej flaunt rugged look in viral Sunday gym picRam Charan and his cousins, Varun Tej and Sai Tej, hit the gym on Sunday. They shared the picture via a joint post on Instagram. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ahaan-panday-mother-deanne-shares-note-thanks-saiyaara-mohit-suri-aneet-padda-and-team-2769089-2025-08-10",
      "headline": "Ahaan Panday's mother Deanne shares note for son, thanks Saiyaara director and teamAhaan Panday's debut film 'Saiyaara' became a superhit, earning Rs 500 crore worldwide without any promotions. His mother, Deanne Panday, shared an emotional Instagram post thanking the film's team and expressing how proud she is of her son."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saiyaara-actors-ahaan-panday-aneet-padda-turn-camera-on-paps-2769052-2025-08-10",
      "headline": "Saiyaara actors Ahaan Panday-Aneet Padda turn camera on paps, video goes viralAfter 'Saiyaara' became a huge hit, newcomers Ahaan Panday and Aneet Padda had fun with Mumbai paparazzi by recording them, and the video quickly went viral."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/war-2-advance-booking-begins-hrithik-roshan-and-jr-ntr-shine-in-new-promo-2769065-2025-08-10",
      "headline": "War 2 advance booking begins, Hrithik Roshan and Jr NTR shine in new promo'War 2', starring Hrithik Roshan and Jr NTR, has opened advance bookings in India with a high-action promo showcasing their spy showdown. Directed by Ayan Mukerji, the film is set for a massive August 14, 2025 release on 5,000 screens in Hindi alone."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/hina-khan-says-people-were-hesitant-to-cast-after-her-cancer-diagnosis-2769048-2025-08-10",
      "headline": "Hina Khan says people were hesitant to cast after her cancer diagnosisHina Khan made a strong comeback with 'Pati Patni Aur Panga' a year after her breast cancer diagnosis, though she feels some hesitation from the industry in casting her. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shekhar-kapur-recalls-being-thrown-out-from-barsaat-replaced-by-rajkumar-santoshi-2769031-2025-08-10",
      "headline": "Shekhar Kapur recalls being thrown out from Barsaat, replaced by Rajkumar SantoshiShekhar Kapur has clarified that he didn't walk out of Bobby Deol's debut film 'Barsaat' but was replaced by Rajkumar Santoshi after creative differences with Dharmendra. Despite the change, the film went on to become a commercial success and launch Bobby's Bollywood career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/amaal-mallik-opens-up-on-rift-with-bhushan-kumar-says-it-began-over-remix-refusal-2769018-2025-08-10",
      "headline": "Amaal Mallik opens up on rift with Bhushan Kumar, says it began over remix refusalAmaal Mallik opened up about his strained professional ties with T-Series head Bhushan Kumar, sharing that refusing to compose remixes led to their fallout. Despite creative differences, he described Bhushan as his \"industry father\" and credited him for shaping his career."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anupam-kher-shares-hilarious-confusion-over-modern-public-toilet-signs-2769007-2025-08-10",
      "headline": "Anupam Kher shares hilarious confusion over modern public toilet signsAnupam Kher shared a humorous video on social media expressing his confusion over the complicated symbols used for public toilet signs."
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/well-take-half-the-world-down-pak-army-chiefs-nuclear-threat-to-india-from-us-glbs-2769228-2025-08-10",
      "headline": "Will take half the world down with us: Asim Munir threatens nuke wipeout from USPakistan Army chief Asim Munir issued nuclear threat against India during his US visit, warning of severe retaliation over conflicts. Munir also met senior US military and political leaders, following a rare June visit with President Trump."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-mp-shares-harrowing-experience-after-air-india-flight-diverted-to-chennai-says-saved-by-luck-and-skill-2769236-2025-08-11",
      "headline": "Congess MP claims runway scare after Air India flight diverted, airline clarifiesCongress MP KC Venugopal said that the passengers on board AI 2455 operating from Thiruvananthapuram to Delhi were saved by sheer luck and skill of the pilots after the flight was diverted to Chennai following a reported technical glitch.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/tejashwi-yadav-2-voter-ids-epic-number-bihar-elections-vijay-kumar-sinha-bjp-2769054-2025-08-10",
      "headline": "Poll body sends notice to Bihar Deputy Chief Minister over dual voter ID chargeTejashwi Yadav accused Bihar Deputy Chief Minister Vijay Kumar Sinha of holding two voter IDs from different constituencies. Sinha denied wrongdoing, citing administrative error, and insisted he votes from only one place."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/anas-al-sharif-four-al-jazeera-journalists-killed-israeli-strike-gaza-glbs-2769242-2025-08-11",
      "headline": "5 Al Jazeera journalists killed in Gaza strike, Israel calls one Hamas terroristAl Jazeera journalist Anas Al Sharif was killed in an Israeli strike on Gaza City moments after posting videos of intense bombardment. Four other Al Jazeera journalists also died in the attack near al-Shifa Hospital."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/relationship/story/why-urban-hobosexuality-is-quite-a-thing-in-india-or-at-least-becoming-one-2768431-2025-08-10",
      "headline": "Why urban hobosexuality is quite a thing in India now (or at least becoming one)Hobosexuality refers to a pattern where someone enters a romantic relationship primarily for housing or financial support, often under the guise of a deep emotional connection."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/congress-leader-p-chidambaram-says-election-commission-not-a-court-and-should-not-behave-like-one-2769260-2025-08-11",
      "headline": "Not a court: P Chidambaram's swipe at poll body over notice to Rahul GandhiChidambaram said that the Election Commission is not a court but an administrative body with responsibility for holding free and fair elections across the country. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/beaten-bite-marks-on-body-video-shows-assault-on-toddler-at-noida-day-care-2769264-2025-08-11",
      "headline": "Beaten, bite marks on body: Video shows assault on toddler at Noida day careA 15-month-old girl was assaulted by a maid at a day care centre in Noida after she was crying continuously. The incident was caught on CCTV."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-attack-on-christian-priests-nuns-in-odisha-feeds-into-a-wider-trend-2768903-2025-08-10",
      "headline": "How attack on Christian priests, nuns in Odisha feeds into a wider trendEarlier, two Catholic nuns from Kerala were arrested in Chhattisgarh for alleged human trafficking and forced religious conversions, sparking nationwide outrage"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/bandipur-tiger-reserve-elephant-attack-karnataka-chamarajanagar-kerala-tourist-viral-video-2769273-2025-08-11",
      "headline": "Video: Tourist's miraculous escape after elephant chases, treads on him in KeralaA tourist from Kerala was charged at, knocked down, and pinned under an elephant's foot in Karnataka's Bandipur Tiger Reserve."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/roger-federer-doubles-shanghai-masters-2025-comeback-2769212-2025-08-10",
      "headline": "Roger Federer returns: Swiss legend to play in Shanghai Masters 202520-time Grand Slam champion Roger Federer is making a memorable comeback at the 2025 Shanghai Masters by playing in the \"Roger & Friends\" celebrity doubles event on October 10. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/eu-nato-back-zelenskyy-bid-join-trump-putin-peace-talks-alaska-glbs-2769245-2025-08-11",
      "headline": "EU and Nato back Zelenskyy's bid to join Trump-Putin peace talksZelenskyy says any decisions taken without Ukraine will be \"stillborn\" and unworkable. On Saturday, the leaders of Britain, France, Germany, Italy, Poland, Finland and the European Commission said any diplomatic solution must protect the security interests of Ukraine and Europe."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nitin-gadkari-dadagiri-jibe-amid-uss-tariff-offensive-against-india-2769180-2025-08-10",
      "headline": "Nitin Gadkari's 'dadagiri' jibe amid US's tariff offensive against IndiaNitin Gadkari urged India to boost exports, cut imports, and harness science and technology to achieve self-reliance. His remarks come amid the nation's recent trade showdown with the US."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-family-denies-mistreatment-allegations-by-brother-faissal-khan-2769284-2025-08-11",
      "headline": "Distressed Aamir Khan's family denies mistreatment allegations by brother FaissalAamir Khan's family has responded to Faissal Khan's allegations, firmly denying any mistreatment. They stated that all decisions were taken out of concern for his well-being and based on medical advice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-moves-portrait-of-obama-and-bush-out-of-visitors-sight-glbs-2769244-2025-08-11",
      "headline": "Art of concealment? Trump tucks Obama, Bush portraits far from public viewPresident Trump relocated Barack Obama's official White House portrait to a restricted area, breaking tradition, as tensions with Obama and other predecessors, including both Bushes, continue to shape decisions."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/british-f35-emergency-landing-kagoshima-japan-joint-military-exercise-2769187-2025-08-10",
      "headline": "Another British F-35 jet makes emergency landing in Japan weeks after India snagA British F-35 fighter jet was forced to make an emergency landing at Kagoshima Airport in Japan following a malfunction, temporarily disrupting commercial flights. Just weeks after a similar incident in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-bcci-odi-future-2769184-2025-08-10",
      "headline": "Virat Kohli-Rohit Sharma comeback: BCCI in no hurry to take a call on futureSpeculation surrounds the ODI futures of Virat Kohli and Rohit Sharma, but the BCCI has no immediate plans to decide their retirement. With India's next ODI series set for October, the board prefers a cautious approach given the players' huge fan base and ongoing team priorities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/hrithik-roshan-praises-ntr-dedication-war-2-hyderabad-event-2769253-2025-08-11",
      "headline": "Hrithik Roshan praises Jr NTR at War 2 event: He is a one-take actor, learnt a lotHrithik Roshan commended Jr NTR's dedication as they promoted 'War 2' in Hyderabad. The Bollywood actor called Jr NTR a 'one-take final-take actor'."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/devendra-fadnavis-slams-sharad-pawars-2-men-guaranteed-maharashtra-poll-win-claim-2769185-2025-08-10",
      "headline": "Sharad Pawar claims he got 160-seat win offer for MVA, Devendra Fadnavis retortsOn Saturday, NCP (SP) chief Sharad Pawar claimed two men met him in Delhi, guaranteeing victory in the 2024 Maharashtra Assembly polls. Pawar also said he took them to Rahul Gandhi, who refused the offer, saying the Opposition shouldn't indulge in such activities."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/shimla-school-children-missing-search-for-class-6-students-underway-no-trace-after-24-hours-2769209-2025-08-10",
      "headline": "Three Class 6 students go missing during Shimla school outing, found a day laterThe boys left the campus around 12:10 pm with a gate pass to visit Mall Road, along with other students, as part of the school's routine weekend outing. They were expected to return by 5 pm, but did not come back with the group."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/provide-relevant-docs-poll-body-to-rahul-gandhi-on-karnataka-voter-fraud-charge-2769128-2025-08-10",
      "headline": "Provide relevant docs: Poll body to Rahul Gandhi on Karnataka voter fraud chargeCongress MP Rahul Gandhi recently shared \"proof\" of duplicate voting, with the image showing two entries for a voter named Shakun Rani with slightly different photos and spellings, both marked as having voted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/photo/odisha-government-afi-contiental-tour-best-photos-2769233-2025-08-11",
      "headline": "In Pics: How Odisha aced the 1st Indian Continental TourOdisha successfully hosted the first ever Continental Tour in India. Here's how the entire event came together and how the Odisha government delivered an exceptional show on Sunday, August 10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/air-india-begins-retrofitting-boeing-787-8-dreamliners-in-400-million-fleet-revamp-2769192-2025-08-10",
      "headline": "Air India begins retrofitting Boeing 787-8 Dreamliners in $400-million fleet revampAir India's retrofitting programme includes cabin overhauls, avionics upgrades, and maintenance to boost comfort, reliability and reduce disruptions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/earthquake-of-magnitude-60-jolts-western-turkey-no-casualties-reported-so-far-2769216-2025-08-10",
      "headline": "Earthquake of magnitude 6.1 jolts western Turkey, killing oneEmergency teams from Turkey's Disaster and Emergency Management Authority (AFAD) were immediately deployed to assess the situation in affected areas. So far, officials have not reported casualties or significant damage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/36-billion-times-the-size-of-sun-biggest-black-hole-ever-discovered-2769177-2025-08-10",
      "headline": "36 billion times the size of Sun: Biggest black hole ever discoveredThis ultramassive black hole, weighing in at an astonishing 36 billion times the mass of our Sun, dwarfs the black hole at the centre of the Milky Way by a factor of 10,000."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/priyanka-chopra-reacts-malti-hit-by-bag-hyderabad-airport-2769283-2025-08-11",
      "headline": "Priyanka Chopra reacts as daughter Malti is hit by bag at airportActor Priyanka Chopra was seen with her daughter at Hyderabad airport, where fans captured Malti enjoying a ride on a trolley. The actor was in the city for the shooting of SS Rajamouli and Mahesh Babu's film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/allu-arjun-cisf-mask-removal-mumbai-airport-viral-video-2769276-2025-08-11",
      "headline": "Allu Arjun asked to remove mask at airport, fans react to viral videoActor Allu Arjun was seen having a conversation with the CISF official at an airport recently. He was asked to remove his mask for identification and a video of the same has gone viral on social media. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-family-denies-mistreatment-allegations-by-brother-faissal-khan-2769284-2025-08-11",
      "headline": "Distressed Aamir Khan's family denies mistreatment allegations by brother FaissalAamir Khan's family has responded to Faissal Khan's allegations, firmly denying any mistreatment. They stated that all decisions were taken out of concern for his well-being and based on medical advice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/video/hrithik-roshan-awestruck-seeing-jr-ntrs-fans-at-war-2-hyderabad-event-watch-2769265-2025-08-11",
      "headline": "Hrithik Roshan awestruck seeing Jr NTR's fans at War 2 Hyderabad event. WatchHrithik Roshan was awestruck to see thousands of Jr NTR's fans cheering for them at the 'War 2' audio launch event in Hyderabad on August 10. The film will release in theatres on August 14."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/india-u20-womens-football-afc-asian-cup-2026-qualification-reward-aiff-2769296-2025-08-11",
      "headline": "AIFF announces cash prize for U-20 women's team after Asia Cup qualificationIndia's U20 women's football team secured their first AFC U-20 Women's Asian Cup qualification since 2006, topping Group D unbeaten. The AIFF have decided to reward the team for their effort by giving a cash prize to the players. \r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/west-indies-vs-pakistan-2nd-odi-2025-chase-rutherford-win-2769270-2025-08-11",
      "headline": "WI vs PAK 2nd ODI: Roston Chase's all-round effort sees West Indies level seriesAn all-round effort from Roston Chase and Sherfane Rutherford's blitz helped West Indies secure a five-wicket win in the second ODI on Sunday, August 10. The win in the rain-marred match helped the hosts to level the series heading into the decider. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/photo/odisha-government-afi-contiental-tour-best-photos-2769233-2025-08-11",
      "headline": "In Pics: How Odisha aced the 1st Indian Continental TourOdisha successfully hosted the first ever Continental Tour in India. Here's how the entire event came together and how the Odisha government delivered an exceptional show on Sunday, August 10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/chennai-grand-masters-nihal-sarin-arjun-erigaisi-vincent-keymer-2769218-2025-08-10",
      "headline": "Chennai Grand Masters: Nihal downs Erigaisi, Keymer extends leadVincent Keymer extends his lead at Chennai Grand Masters as Arjun Erigaisi is defeated by Nihal Sarin. Abhimanyu Puranik takes Challengers' lead with a win over Vaishali Rameshbabu."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/roger-federer-doubles-shanghai-masters-2025-comeback-2769212-2025-08-10",
      "headline": "Roger Federer returns: Swiss legend to play in Shanghai Masters 202520-time Grand Slam champion Roger Federer is making a memorable comeback at the 2025 Shanghai Masters by playing in the \"Roger & Friends\" celebrity doubles event on October 10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-sourav-ganguly-retirement-2769201-2025-08-10",
      "headline": "Kohli, Rohit Sharma to retire after Australia ODIs? Ganguly weighs inSourav Ganguly dismissed rumours of Virat Kohli and Rohit Sharma retiring from ODIs after the Australia tour, saying he has no information on this. He emphasised that their future should depend solely on their performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fa-community-shield-crystal-palace-beat-liverpool-wembley-penalty-shootout-mohammed-salah-2769203-2025-08-10",
      "headline": "FA Community Shield: Crystal Palace's nerves of steel sink Liverpool at WembleyCrystal Palace once again weaved their magic at the Wembley Stadium as they took down the Premier League champions, Liverpool in a dramatic by holding their nerves in a dramatic penalty shootout. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/animesh-kujur-annu-rani-indian-continental-tour-bhubaneshwar-2769188-2025-08-10",
      "headline": "Annu Rani, Animesh Kujur steal the show in electrifying Indian Continental TourThe 1st Indian Continental Tour lit up the Kalinga Stadium on Sunday, August 10. Annu Rani and Animesh Kujur stole the show, while the men's javelin contingent disappointed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-trolled-west-indies-vs-pakistan-reactions-2769189-2025-08-10",
      "headline": "Missed century by 100 runs: Babar Azam trolled after duck in 2nd ODIWI vs PAK, 2nd ODI: Babar Azam got out for a three-ball duck after Jayden Seales castled him in the second ODI on Sunday at the Brian Lara Stadium in Tarouba, Trinidad. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/continental-tour-bhubaneshwar-rumesh-pathirage-men-javelin-sachin-yadav-2769186-2025-08-10",
      "headline": "Rumesh Pathirage stuns Sachin Yadav to secure World Championship qualificationSri Lanka's Rumesh Pathirage secured direct qualification for the World Championships with a massive 86.50m throw in men's javelin. He beat India's Sachin Yadav, considered the favourite to win this event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-bcci-odi-future-2769184-2025-08-10",
      "headline": "Virat Kohli-Rohit Sharma comeback: BCCI in no hurry to take a call on futureSpeculation surrounds the ODI futures of Virat Kohli and Rohit Sharma, but the BCCI has no immediate plans to decide their retirement. With India's next ODI series set for October, the board prefers a cautious approach given the players' huge fan base and ongoing team priorities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/fa-community-shield-crystal-palace-beat-liverpool-wembley-penalty-shootout-mohammed-salah-2769203-2025-08-10",
      "headline": "FA Community Shield: Crystal Palace's nerves of steel sink Liverpool at WembleyCrystal Palace once again weaved their magic at the Wembley Stadium as they took down the Premier League champions, Liverpool in a dramatic by holding their nerves in a dramatic penalty shootout. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/animesh-kujur-annu-rani-indian-continental-tour-bhubaneshwar-2769188-2025-08-10",
      "headline": "Annu Rani, Animesh Kujur steal the show in electrifying Indian Continental TourThe 1st Indian Continental Tour lit up the Kalinga Stadium on Sunday, August 10. Annu Rani and Animesh Kujur stole the show, while the men's javelin contingent disappointed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-trolled-west-indies-vs-pakistan-reactions-2769189-2025-08-10",
      "headline": "Missed century by 100 runs: Babar Azam trolled after duck in 2nd ODIWI vs PAK, 2nd ODI: Babar Azam got out for a three-ball duck after Jayden Seales castled him in the second ODI on Sunday at the Brian Lara Stadium in Tarouba, Trinidad. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/continental-tour-bhubaneshwar-rumesh-pathirage-men-javelin-sachin-yadav-2769186-2025-08-10",
      "headline": "Rumesh Pathirage stuns Sachin Yadav to secure World Championship qualificationSri Lanka's Rumesh Pathirage secured direct qualification for the World Championships with a massive 86.50m throw in men's javelin. He beat India's Sachin Yadav, considered the favourite to win this event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-bcci-odi-future-2769184-2025-08-10",
      "headline": "Virat Kohli-Rohit Sharma comeback: BCCI in no hurry to take a call on futureSpeculation surrounds the ODI futures of Virat Kohli and Rohit Sharma, but the BCCI has no immediate plans to decide their retirement. With India's next ODI series set for October, the board prefers a cautious approach given the players' huge fan base and ongoing team priorities."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}