{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-may-9-sensex-nifty-crash-today-indo-pak-tension-war-like-trading-bse-nse-2721928-2025-05-09",
      "headline": "Stock market opening: Will Sensex, Nifty crash today amid Indo-Pak tension?Gift Nifty futures were trading at 23,987 as of 6:46 am, which suggests that the Nifty50 could open nearly 1.2% below Thursday's close of 24,273.8."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-shares-in-news-may-9-hal-swiggy-titan-zee-mcx-bharat-forge-lt-india-pakistan-war-2721914-2025-05-09",
      "headline": "Stocks to watch today: HAL, Swiggy, Titan, Zee, MCX, Bharat Forge, L&TDefence sector stocks such as Hindustan Aeronautics Ltd (HAL), Bharat Forge, and Bharat Dynamics Ltd (BDL) are likely to remain in focus. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/epfo-to-speed-up-higher-pension-applications-payouts-likely-by-year-end-report-2721644-2025-05-08",
      "headline": "EPFO to speed up higher pension applications, payouts likely by year-end: ReportThe EPFO has received about 1.75 million applications from pensioners who want to get a higher pension based on their actual wages, out of a total of 7.8 million pensioners. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-why-sensex-nifty-fell-sharply-before-today-market-closing-explained-2721626-2025-05-08",
      "headline": "Explained: Why Sensex, Nifty fell sharply moments before stock market closingBy market close, the BSE Sensex had dropped 411.97 points to 80,334.81, while the Nifty 50 fell 140.60 points to 24,273.80. The India VIX, often seen as the market's fear gauge, spiked over 10 per cent to cross the 21 mark—its highest since early April."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/reliance-industries-withdraws-operation-sindoor-trademark-says-it-was-filed-inadvertently-2721608-2025-05-08",
      "headline": "Reliance withdraws 'Operation Sindoor' trademark, says it was filed inadvertentlyOn May 7, four different applications were made to trademark the phrase 'Operation Sindoor' under Class 41 of the Nice Classification. This category includes services like films, shows, online content, education, cultural events and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/kamikaze-suicide-drone-makers-stock-jumps-after-operation-sindoor-details-here-2721607-2025-05-08",
      "headline": "Kamikaze 'suicide' drone maker's stock jumps after 'Operation Sindoor'. Details hereListed on the NASDAQ under the ticker ESLT, Elbit's stock rose 3.62% over two sessions, jumping from $400.00 on May 6 to $414.47 by May 8. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-falls-412-points-nifty-below-24300-as-indo-pak-tensions-hit-dalal-street-2721578-2025-05-08",
      "headline": "Sensex, Nifty end in red as panic grows over India-Pak tensionsThe S&P BSE Sensex had fallen over 700 points just a few minutes before closing. However, it bounced back to end 412 points lower at 80,334.81, while the NSE Nifty50 lost 140.60 points to close at 24,273.80."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pakistan-stock-exchange-trading-halted-after-7-per-cent-crash-post-operation-sindoor-2721546-2025-05-08",
      "headline": "Pakistan's Karachi Stock Exchange crashes 7%, trading haltedAccording to the official notification from the exchange, trading was paused after the benchmark index plunged 6.3% in a short period. The sharp fall triggered automatic circuit breakers to stop further decline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-2025-what-is-itr-form-3-check-eligibility-documents-and-deadlines-all-details-explained-2721527-2025-05-08",
      "headline": "ITR Filing 2025: What is ITR Form 3, check eliigibility, documents and deadlinesYou should file ITR-3 if you run a business or work as a self-employed professional, regardless of whether a tax audit is needed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/avic-chengdu-aircraft-co-ltd-share-price-india-pak-tensions-chinese-jet-maker-j-17-stock-by-36-percent-in-2-days-2721520-2025-05-08",
      "headline": "India-Pak tensions lift Chinese jet maker's stock by 36% in 2 daysAs of Thursday, the company's share price rose by 16.37% to reach 80.68 yuan. This was after a 17% jump on Wednesday. In total, the stock has gained 36.21% in two days and has gone up 44% in the past one month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/retirement-age-is-moving-from-60-to-45-an-investment-banker-sarthak-ahuja-explains-why-2721482-2025-05-08",
      "headline": "'Retirement age is moving from 60 to 45': An investment banker explains whyUnlike lawyers or doctors, where experience adds value, senior professionals in corporate roles like sales, marketing, operations, product, and tech, are seen as costly and sometimes out of touch, said the investment banker."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-india-pakistan-tension-should-investors-on-dalal-street-panic-2721478-2025-05-08",
      "headline": "Why stock market investors shouldn't panic amid rising Indo-Pak tensionsWhile 'Operation Sindoor' led to worries about increased market volatility and losses, the main indices on Dalal Street actually managed to end in green in the previous session. Even today, the stock markets are trading in positive territory. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pakistan-economy-going-down-forex-reserve-overflight-fees-airspace-ban-india-border-tension-2721445-2025-05-08",
      "headline": "Pakistan's forex is slipping fast. More trouble ahead for already debt-ridden economy?A bailout by the International Monetary Fund (IMF), including a loan of $2 billion in March this year, gave Pakistan some breathing room. But the current situation could undo much of that progress."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/you-can-now-automate-strategies-zerodha-founder-and-ceo-nithin-kamath-on-nse-new-algo-rules-2721437-2025-05-08",
      "headline": "'You can now automate strategies': Zerodha's Nithin Kamath on NSE's new algo rulesZerodha's founder and CEO, Nithin Kamath, hailed NSE's new rules to ease algo trading for retail users and explained the main update in simple terms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/india-pakistan-rising-tension-war-impact-on-economy-foreign-investments-2721404-2025-05-08",
      "headline": "Will rising Indo-Pak tensions dent foreign investment inflows to India?India's economy, which recently crossed the $4 trillion mark, has minimal direct trade with Pakistan. As a result, cross-border missile strikes carried out by India had limited immediate impact on domestic equities, currencies, or bonds."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/google-layoffs-cuts-200-jobs-in-latest-round-of-restructuring-2721392-2025-05-08",
      "headline": "Google cuts 200 jobs in latest round of restructuring: ReportGoogle described the changes as \"small\" adjustments meant to foster \"greater collaboration\" and improve how quickly teams can serve customers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-opens-80-points-higher-nifty-above-24400-tata-motors-up-2-percent-india-pakistan-tension-war-2721383-2025-05-08",
      "headline": "Sensex, Nifty erase early gains as market reacts to India-Pakistan tensionThe S&P BSE Sensex was trading down by 56.88 points to 80,689.90, while the NSE Nifty50 lost 32.25 points to 24,382.15 as of 9:30 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-today-sensex-nifty-opening-dalal-street-to-go-down-amid-india-pakistan-tension-sindoor-2721374-2025-05-08",
      "headline": "Sensex, Nifty opening: Stock market to go down amid India-Pakistan tension?At 8:40 am, Gift Nifty futures were trading at 24,451. This suggests that the Nifty50 index may open marginally higher or close to Wednesday's closing level of 24,414.4 as investors are expected to be cautious. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stocks-to-watch-today-may-8-shares-in-focus-titan-dabur-lt-asian-paints-pnb-2721366-2025-05-08",
      "headline": "Stocks to watch on May 8: Titan, Dabur, L&T, Asian Paints, PNBStocks to watch on Thursday, May 8, include several well-known companies such as Titan, Dabur, L&T, Asian Paints and PNB. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/government-letter-of-intent-elon-musks-satellite-internet-venture-starlink-2721230-2025-05-07",
      "headline": "Government issues Letter of Intent to Musk's satellite internet venture StarlinkPrior to this, the government had issued licences to Eutelsat OneWeb and Jio Satellite Communications."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/ulips-mutual-funds-or-stocks-what-is-the-best-for-long-term-wealth-creation-2721078-2025-05-07",
      "headline": "ULIPs, mutual funds or stocks: What's the best for long-term wealth creation?Mutual funds, ULIPs, and stocks offer different paths to wealth. While ULIPs mix insurance with investment, mutual funds offer flexibility and professional management. Stocks offer high returns but carry more risk and demand expertise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/new-nps-rules-how-to-close-your-account-after-renouncing-indian-citizenship-2721011-2025-05-07",
      "headline": "New NPS rules: How to close your account after renouncing Indian citizenshipAny Indian citizen aged between 18 and 70 years can open an NPS account. Additionally, Non-Resident Indians (NRIs) and Overseas Citizens of India (OCIs) can also open an NPS account, as long as they meet the necessary requirements set by the PFRDA."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-106-points-higher-nifty-above-24400-tata-motors-jumps-5-2720999-2025-05-07",
      "headline": "Sensex ends 106 points higher, Nifty above 24,400; Tata Motors jumps 5%The BSE Sensex was up 105.71 points higher to 80,746.78 at the closing bell, while the NSE Nifty50 rose 34.80 points to settle at 24,414.40. Most of the broader market indices also recovered after falling in early trade. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/hdfc-bank-trims-these-lending-rates-mclr-from-may-7-will-your-emis-go-down-2720970-2025-05-07",
      "headline": "HDFC Bank trims these lending rates from May 7. Will your EMIs go down?This move comes shortly after the Reserve Bank of India (RBI) cut the repo rate by 25 bps in April, taking the total cut to 50 bps since February 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/operation-sindoor-how-will-stock-markets-react-to-rising-indo-pak-tensions-2720948-2025-05-07",
      "headline": "Operation Sindoor: Should Dalal Street investors worry about what's next?There was no sell-off, no bloodbath, just a bit of volatility. For many retail investors, the calm felt unusual — shouldn't a military flare-up between nuclear neighbours spook the markets? But past data suggests otherwise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/taking-a-personal-loan-for-wedding-here-are-6-key-tips-to-keep-in-mind-2720932-2025-05-07",
      "headline": "Taking a personal loan for a wedding? Here are 6 key tips to keep in mindWeddings can tempt us to go overboard, but it's best to plan a realistic budget. See where you can cut costs or use your savings first. Borrow just the amount you really need, don't take a bigger loan just because you're eligible for it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/filing-itr-heres-how-to-choose-the-right-tax-regime-old-tax-regime-new-tax-regime-standard-deduction-2720891-2025-05-07",
      "headline": "Filing ITR? Here's how to choose the right tax regimeWhile the new regime offers reduced tax slabs, it doesn't let you claim the usual deductions available under the old regime. It's lower rates, but with fewer tax-saving options."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-uk-free-trade-agreement-benefits-impact-goods-cheaper-costlier-decoded-2720888-2025-05-07",
      "headline": "Whisky, cars, and jobs: Inside India's game-changing UK free trade pactThe India-UK trade deal holds significance in a world drifting back toward trade barriers and tariff wars. With Trump-era protectionism rearing its head again, the timing of this pact couldn't be better."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/pwc-to-lay-off-2-percent-of-us-workforce-report-2720852-2025-05-07",
      "headline": "PwC to cut 1,500 jobs in the US: ReportLast year, PwC was in the news for possibly cutting half of its auditing staff in China's financial services sector. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/pakistan-karachi-stock-exchange-crashes-nearly-6-percent-operation-sindoor-military-strike-impact-2720824-2025-05-07",
      "headline": "Pakistan's Karachi Stock Exchange crashes nearly 6% after 'Operation Sindoor'The Karachi Stock Exchange 100 index (KSE-100) plunged 6,272 points in early trade, sliding to 107,296.64 — a sharp drop from Tuesday's close of 113,568.51."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/info-edge-share-price-down-80-percent-bse-trading-apps-reason-explained-2720820-2025-05-07",
      "headline": "Explained: Why Info Edge shares look like they've crashed 80% todayInfo Edge shares traded ex-split today after the company carried out a 1:5 stock split, its first since its 2006 listing. As a result, each share with a face value of Rs 10 has been subdivided into five shares of Rs 2 each."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/why-foreign-portfolio-investors-are-buying-indian-financial-stocks-explained-2720810-2025-05-07",
      "headline": "Explained: Why foreign portfolio investors are buying Indian financial stocksData from the National Securities Depository shows FPIs bought Rs 18,409 crore ($2.18 billion) worth of shares in the sector last month, propelling the Nifty Financial Services index to a 4.1% gain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/scotch-whisky-prices-set-to-drop-after-india-uk-trade-deal-details-here-2720803-2025-05-07",
      "headline": "Scotch whisky prices set to drop after India-UK trade deal. Details hereThe reduction is expected to bring premium and mid-range Scotch whiskies within reach of a larger section of Indian consumers. A bottle that typically costs Rs 5,000 could soon be priced between Rs 3,500 and Rs 4,000 following the initial tariff cut."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-today-why-didnt-markets-crash-after-operation-sindoor-2720786-2025-05-07",
      "headline": "Sensex, Nifty today: Why stock market didn't crash after 'Operation Sindoor'While markets remain extremely volatile, swinging between green and red, there was no major crash. Here are three reasons why Dalal Street remained calm after 'Operation Sindoor'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-open-lower-as-dalal-street-investors-react-to-operation-sindoor-2720768-2025-05-07",
      "headline": "Sensex, Nifty rebound as markets stay calm after 'Operation Sindoor'The Sensex fell sharply in pre-opening, but recovered as soon as the markets opened at 9:15 am. At around 9:30 am, Sensex was trading 143.08 points higher at 80,784.15, while the NSE Nifty50 rose 56.60 points to trade at 24,432."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-nears-full-profitability-revenue-grows-to-rs-1911-crore-2720453-2025-05-06",
      "headline": "Paytm nears full profitability; revenue grows to Rs 1,911 crorePaytm's revenue increased by 5% quarter-on-quarter, reaching Rs 1,911 crore, reflecting the company's steady performance and continued momentum in its core businesses. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/need-a-personal-loan-unlock-rs-5-lakh-instantly-using-just-your-pan-card-2720405-2025-05-06",
      "headline": "Need a personal loan? Unlock Rs 5 lakh instantly using just your PAN cardTo apply online, you simply visit the bank or lender's website and fill out the application form. You'll need to provide your name, date of birth, mobile number, and PAN number."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-156-points-lower-nifty-below-24400-adani-enterprises-falls-4-2720369-2025-05-06",
      "headline": "Sensex ends 156 points lower, Nifty below 24,400; Adani Enterprises falls 4%The BSE Sensex ended 155.77 points lower at 80,641.07, while the NSE Nifty50 fell 81.55 points to settle at 24,379.60. Most of the broader market indices also declined during the trading session due to high selling pressure. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/yes-bank-denies-reports-of-stake-sale-to-japans-smbc-calls-it-speculative-2720360-2025-05-06",
      "headline": "Yes Bank denies reports of stake sale to Japan's SMBC, calls it 'speculative'The private sector lender clarified that while it regularly explores business opportunities, there is nothing material to disclose under current regulatory norms."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/saying-yes-to-a-joint-loan-here-is-how-it-can-affect-your-credit-score-2720344-2025-05-06",
      "headline": "Saying yes to a joint loan? Here's how it can affect your credit scoreEvery time an EMI is paid on time, it reflects positively on both borrowers' credit profiles. Over time, this builds your credit score. If you were added as a co-applicant to help someone get a loan because your own score was low, this is your chance to improve it."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kantara-makers-junior-artiste-dies-by-drowning-not-on-film-set-2721936-2025-05-09",
      "headline": "Kantara makers say junior artiste did not die on film set, offer condolencesThe makers of Rishab Shetty's 'Kantara: Chapter 1' cleared the air surrounding the death of junior artiste MF Kapil. In a statement, they offered condolences to his family and friends."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/samay-raina-salutes-indian-armed-forces-late-night-call-from-his-father-in-jammu-2721910-2025-05-09",
      "headline": "Samay Raina salutes armed forces as he recalls call from his father in JammuStand-up comedian Samay Raina described his late-night call with his father in Jammu as 'calm'. He also expressed his admiration and respect for the Indian Armed Forces."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/country-star-cody-johnson-announces-baby-no-3-at-2025-acm-awards-glbs-2721905-2025-05-09",
      "headline": "Country star Cody Johnson announces Baby No. 3 at 2025 ACM AwardsCountry singer Cody Johnson announced at the 2025 ACM Awards that he and wife Brandi are expecting their third child — a boy — sharing the news during a gender reveal onstage.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/doja-cat-sabrina-carpenter-and-luke-combs-to-perform-at-acl-festival-2025-glbs-2721900-2025-05-09",
      "headline": "Doja Cat, Sabrina Carpenter and Luke Combs to perform at ACL Festival 2025Austin City Limits Festival 2025 returns to Zilker Park with a stellar lineup including Doja Cat and Hozier. Three-day GA passes sold out fast; premium ticket options remain available.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/acm-awards-2025-how-to-stream-the-show-live-on-amazon-prime-video-and-twitch-glbs-2721896-2025-05-09",
      "headline": "ACM Awards 2025: How to stream the show live on Amazon Prime Video and TwitchThe ACM Awards 2025, hosted by Reba McEntire, will feature star-studded performances, including Rascal Flatts with Backstreet Boys and Chris Stapleton. Stream it live for free on Amazon Prime Video and Twitch.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jennifer-aniston-stalker-ordered-to-undergo-mental-evaluation-after-gate-crash-glbs-2721887-2025-05-09",
      "headline": "Jennifer Aniston stalker ordered to undergo mental evaluation after gate crashA man accused of stalking Jennifer Aniston and ramming his car into her Bel Air gate has been ordered to undergo a mental evaluation after years of alleged harassment and felony charges.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/from-austin-to-stockholm-full-schedule-for-2025-ultrasound-world-tour-glbs-2721879-2025-05-09",
      "headline": "From Austin to Stockholm: Full schedule for 2025 Ultrasound world tourPop star Lorde returns with her album Virgin on June 27, 2025, followed by the Ultrasound Tour across North America, the UK, and Europe. Tickets go on sale May 16.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/gram-chikitsalay-review-tvf-series-rural-doctor-trust-local-quack-jharkhand-healthcare-challenges-2721716-2025-05-09",
      "headline": "Gram Chikitsalay review: Amol Parashar adds life to this tale of healing and hopeReleased-Fri May 09, 2025Gram Chikitsalay series review: The TVF series set in rural Jharkhand, features a young doctor's earnest struggle to win the trust of villagers who prefer a local quack. With sincere performances and authentic storytelling, the show beautifully captures the challenges and hope. It also highlights the real need for a change in the neglected healthcare sector."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sonu-nigam-and-arijit-singh-to-recreate-song-sandese-aate-hai-for-border-2-2721779-2025-05-08",
      "headline": "Sonu Nigam, Arijit Singh to recreate Sandese Aate Hai song  for Border 2: ReportSonu Nigam and Arijit Singh will recreate the patriotic song 'Sandese Aate Hai' for 'Border 2.' T-Series has acquired the rights of the iconic song for Rs 10 crore, making it the most expensive Bollywood song remake to date."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ameesha-patel-calls-pay-disparity-justified-but-wants-less-gap-exclusive-2721778-2025-05-08",
      "headline": "Ameesha Patel: Pay disparity is justified, but there shouldn't be a wide gapAmeesha Patel candidly addresses key issues in Bollywood, including pay disparity, ageism, and rising film budgets, emphasising the need for balance and fairness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/satyajit-rays-aranyer-din-ratri-to-be-screened-at-cannes-film-festival-2025-2721731-2025-05-08",
      "headline": "Satyajit Ray's Aranyer Din Ratri to be screened at Cannes Film Festival 2025Satyajit Ray's classic 'Aranyer Din Ratri' will be screened at the Cannes Film Festival 2025 in the classic section. The film's screening will be attended by veteran actor Sharmila Tagore and filmmaker Wes Anderson, among other presenters."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/virat-kohli-brother-vikas-kohli-slams-rahul-vaidyas-comments-avneet-kaur-2721720-2025-05-08",
      "headline": "Virat Kohli's brother slams Rahul Vaidya's comments: What a loserCricketer Virat Kohli's brother, Vikas Kohli, has reacted to Rahul Vaidya's comments where he called him a 'joker'. Vikas, in his note, emphasised the nation's current situation and mentioned how Rahul is using the cricketer's name to gain followers. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kannada-director-k-ramnarayan-on-replacing-sonu-nigam-songs-saying-sorry-will-not-cut-it-2721650-2025-05-08",
      "headline": "Kannada director on replacing Sonu Nigam's songs: He must pay a priceKannada director, who replaced two Sonu Nigam songs in his upcoming film 'Kuladalli Keelyavudo' following the singer's concert controversy, said that his apology is not enough. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/1-film-every-3-years-why-are-young-telugu-directors-delaying-film-productions-2721616-2025-05-08",
      "headline": "1 film every 3 years: Why are young Telugu directors delaying film productions?Once celebrated for rapid, inventive filmmaking, new directors of the Telugu cinema now take two-three years between projects. Rising budgets, cautious OTT deals and a shrinking writing pool have forced even proven talents into lengthy pauses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/nawazuddin-siddiqui-reveals-training-ranveer-singh-for-his-debut-film-2721577-2025-05-08",
      "headline": "Was Nawazuddin Siddiqui Ranveer Singh's acting coach? Costao actor revealsNawazuddin Siddiqui revealed he trained Ranveer Singh ahead of his debut in Band Baaja Baaraat, during his days as an acting workshop mentor. While he guided many aspiring actors, Siddiqui credited Ranveer's success to his own talent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/pawandeep-rajan-indian-idol-12-winner-out-of-icu-friend-shares-pic-from-hospital-2721611-2025-05-08",
      "headline": "Singer Pawandeep Rajan out of ICU, friend shares pic from hospitalIndian Idol 12 winner Pawandeep Rajan recently met with a serious car accident near Moradabad, has been shifted from the ICU to a private room. His friend Govind Digari shared the update. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/suriya-donates-rs-10-crore-from-retro-profits-to-agaram-foundation-2721542-2025-05-08",
      "headline": "Suriya donates Rs 10 crore from Retro profits to Agaram FoundationActor Suriya, along with Retro director Karthik Subbaraj, donated Rs 10 crore to the Agaram Foundation, funding education for underprivileged children. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rishab-shetty-begins-kantara-2-last-schedule-after-junior-artiste-death-2721486-2025-05-08",
      "headline": "Rishab Shetty begins last schedule of Kantara 2 after death of junior artisteRishab Shetty's 'Kantara: Chapter 1', a prequel to the 2022 blockbuster film, is among the most highly-anticipated Indian films of the year. Despite several setbacks during production, the makers have now entered the final schedule of shoots for the film."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/photo/munawar-faruqui-shehnaaz-gill-kubbra-sait-celebs-attend-acting-workshop-saurabh-sachdeva-2721573-2025-05-08",
      "headline": "Munawar Faruqui, Shehnaaz Gill, and celebs take acting class from Saurabh SachdevaShehnaaz Gill, Karan Veer Mehra, Munawar Faruqui, Kubbra Sait, and others participated in a workshop conducted by veteran actor Saurabh Sachdeva. Take a look at the pictures here. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-pakistan-tensions-live-update-operation-sindoor-blackout-india-pak-war-missile-drone-attack-pahalgam-terror-attack-air-strike-2721927-2025-05-09",
      "headline": "Live: Rajnath Singh to meet chiefs of armed forces shortly to review border situation Operation Sindoor, India Pakistan Tension News Live Updates: On Thursday, Pakistan launched a series of missiles and drone attacks targeting several regions in India, including Jammu, Rajasthan, and Punjab. All incoming threats were successfully thwarted by India's defence forces, preventing large-scale damage and loss of life.\r\nThe provocation came just a day after India carried out precision strikes on terror camps located in Pakistan and Pakistan-occupied Kashmir, in retaliation to the Pahalgam terror attack. As tensions flared, Pakistan attempted to strike back by launching a barrage of missiles and deploying drones across the Line of Control and international borders.\r\nIndia's response was swift and effective. The country's air defence systems intercepted at least eight incoming missiles, while fighter jets shot down a Pakistani F-16 and possibly two JF-17 aircraft."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indian-army-pakistan-drone-missile-attacks-jammu-kashmir-rajasthan-punjab-s-400-shot-down-indian-army-operation-sindoor-2721911-2025-05-09",
      "headline": "Gave befitting reply: Army after Pakistan's drone-missile attacks in IndiaThe Indian Army neutralised over 50 swarm drones launched by Pakistan during a large-scale counter-drone operation in the areas of Udhampur, Samba, Jammu, Akhnoor, Nagrota (all in Jammu and Kashmir) and Pathankot (Punjab)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pakistan-attack-india-missile-drone-strike-operation-sindoor-army-kashmir-2721926-2025-05-09",
      "headline": "India repels Pak's overnight missile barrage, hits hard in pre-dawn responseIndia's coordinated counterstrikes and air defence neutralised Pakistan's second wave of drone and missile attacks in 24 hours, targeting over 15 cities. Blackouts were enforced across multiple states amid heightened alert."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/us-secretary-of-state-de-escalation-s-jaishankar-shezbaz-sharif-jammu-drone-attack-2721826-2025-05-08",
      "headline": "Will counter any escalation attempt: S Jaishankar to Marco Rubio amid Pak attackThe US Secretary of State called for immediate de-escalation amid India-Pakistan tensions in calls with S Jaishankar, Pakistan Prime Minister Shehbaz Sharif."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-pakistans-islamist-army-chief-asim-munir-is-such-a-dangerous-foe-2721637-2025-05-08",
      "headline": "Why Pakistan's Islamist army chief Asim Munir is such a dangerous foeMunir emerged as one of the most powerful army chiefs of Pakistan without having to topple the civilian dispensation but overplayed his hand with the Pahalgam attack\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/foreign-ministry-to-brief-media-today-as-india-foils-pak-missile-drone-attacks-2721917-2025-05-09",
      "headline": "Foreign Ministry briefing at 9 am as Pak's missile, drone attacks foiled: SourcesOn Thursday, Pakistan launched a series of missiles and drone attacks targeting several regions in India, including Jammu, Rajasthan, and Punjab. All incoming threats were successfully thwarted by India's defence forces, preventing large-scale damage and loss of life. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/operation-sindoor-pakistan-escalates-with-drone-missile-strikes-india-retaliates-lahore-attack-war-2721845-2025-05-08",
      "headline": "Pakistan escalates, India retaliatesPakistan escalated the tensed situation to a dangerous level by firing a swarm of drones and missiles into India. Areas in Jammu and Kashmir, Punjab and Rajasthan saw attacks and blackouts. Pakistan has lost fighter jets and an AWACS as India activated its air defence system."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/rocket-fired-jammu-air-raid-sirens-airport-blackout-mock-drill-pakistan-op-sindoor-2721795-2025-05-08",
      "headline": "Pakistan drone hits Jammu airport, S-400 defence system intercepts 8 missilesIn a major escalation following India's strikes on terror camps, eight rockets launched from Pakistan targeted multiple locations in Jammu on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-shoots-down-pakistan-air-forces-awac-all-about-the-surveillance-jet-2721855-2025-05-08",
      "headline": "India shoots down Pakistan Air Force's AWAC: All about the surveillance jetA Pakistan AWACS was shot down inside Punjab province and three Pakistani fighter jets, F-16 fighter jet and two JF-17 fighter jets, were downed on Thursday night, sources told India Today.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/airports-closed-alert-security-check-pakistan-attack-india-jammu-rajasthan-punjab-2721854-2025-05-08",
      "headline": "24 airports closed, security heightened as India-Pak tension escalatesIndia has temporarily closed at least 24 airports near its western border and heightened nationwide airport security. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-dc-special-train-dharamshala-delhi-bcci-2721827-2025-05-08",
      "headline": "IPL 2025: Special train arranged to get PBKS, DC players from Dharamshala to DelhiA special train has been arranged by the BCCI to get the Punjab Kings and Delhi Capitals players and staff from Dharamshala to Delhi after the match between the two teams in the city was cancelled after attacks from Pakistan in various parts of India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/video-swarm-of-pak-drones-neutralised-by-army-air-defence-unit-jammu-akhnoor-pathankot-operation-sindoor-2721929-2025-05-09",
      "headline": "Video: Swarm of Pak drones populating Indian skies neutralised by armed forcesIn a large-scale counter-drone operation last night, the Indian Army neutralised over 50 swarm drones launched from Pakistan across various locations along the Line of Control (LoC) and International Borders."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/war-gaming-delivers-how-india-outplayed-pakistan-on-escalation-matrix-2721840-2025-05-08",
      "headline": "War-gaming delivers: How India outplayed Pakistan on escalation matrixThe first phase of India's strike mission targeted Pakistan's air defence radars and missile batteries, which Islamabad had spent over a decade building into a seemingly impregnable shield. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/centre-bans-visitor-entry-mandates-checks-for-all-flyers-amid-pak-attack-sources-2721841-2025-05-08",
      "headline": "Arrive 3 hours early: Airlines as Centre steps up security amid Pak attackAccording to sources in the Ministry of Civil Aviation, every passenger at all airports will now be subjected to a Secondary Ladder Point Check (SLPC) before boarding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/jd-vance-says-us-will-not-intervene-in-india-pak-dispute-none-of-our-business-glbs-2721892-2025-05-09",
      "headline": "JD Vance says US will not intervene in India-Pak dispute: 'None of our business'US Vice President JD Vance said America won't intervene in the India-Pakistan conflict, calling it \"none of our business.\" He urged de-escalation through diplomacy, while President Trump said he hopes the hostilities end quickly and offered help."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pak-f-16-down-drone-swarm-attack-foiled-indian-akash-mrsam-zu-23-in-action-2721828-2025-05-08",
      "headline": "Pak F-16 down, drone attack foiled: Indian Akash, MRSAM in actionThe integrated grid, activated across 1,800 km of airspace, intercepted swarms of drones and missiles targeting 15 military installations, including bases in Jammu, Srinagar, Pathankot, and Bhuj."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/who-is-robert-francis-prevost-first-american-pope-to-lead-the-catholic-church-glbs-2721865-2025-05-09",
      "headline": "Who is Robert Francis Prevost, first American pope to lead the Catholic ChurchRobert Prevost, a missionary who spent his career ministering in Peru and leads the Vatican's powerful office of bishops, was elected the first American pope in the 2,000-year history of the Catholic Church."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/amazon-indias-great-summer-sale-2025-is-here-transform-your-garden-with-upto-60-off-on-lawn-garden-essentials-2718704-2025-05-02",
      "headline": "Amazon India's Great Summer Sale 2025 is here: Transform your garden with upto 60% off on lawn & garden essentialsMake your Garden and Lawn summer ready with Amazon India's Great Summer Sale 2025 that is live now. Enjoy Up to 60% off on Lawn & Garden Essentials such as Plants, Solar Lights and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-downs-pakistan-f-16-jammu-attacks-drone-missiles-pahalgam-op-sindoor-2721810-2025-05-08",
      "headline": "Pakistani F-16 jet, 2 JF-17s downed by Indian air defence: SourcesIn a major escalation, Pakistan launched missile and drone attacks at multiple locations in India which were swiftly intercepted by the air defence system. India shot down Pakistan's F-16 and JF-17 aircrafts, sources said."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistans-us-envoy-says-new-delhi-islamabad-have-had-contacts-at-nsc-level-glbs-2721898-2025-05-09",
      "headline": "New Delhi, Islamabad have had contacts at NSC level, says Pakistan's US envoyPakistan's US envoy Rizwan Sheikh told CNN that India and Pakistan have had contacts at the NSC level, amid rising tensions. As cross-border attacks intensify, the US has urged both nations to de-escalate and resume direct dialogue.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/gram-chikitsalay-review-tvf-series-rural-doctor-trust-local-quack-jharkhand-healthcare-challenges-2721716-2025-05-09",
      "headline": "Gram Chikitsalay review: Amol Parashar adds life to this tale of healing and hopeReleased-Fri May 09, 2025Gram Chikitsalay series review: The TVF series set in rural Jharkhand, features a young doctor's earnest struggle to win the trust of villagers who prefer a local quack. With sincere performances and authentic storytelling, the show beautifully captures the challenges and hope. It also highlights the real need for a change in the neglected healthcare sector."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/x-blocks-8000-accounts-in-india-under-government-order-glbs-2721846-2025-05-08",
      "headline": "X blocks over 8,000 accounts in India, says 'following government orders'X has blocked over 8,000 accounts in India following government orders, citing threats of fines and jail. The platform criticizes the move as censorship and urges legal action by users.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/cash-row-delhi-high-court-judge-home-justice-yashwant-varma-refuses-resign-process-remove-start-soon-2721761-2025-05-08",
      "headline": "Justice Yashwant Varma refuses to resign, impeachment process to start soon: SourcesJustice Yashwant Varma has refused to resign from the Delhi High Court despite a Supreme Court-appointed panel confirming a large cash recovery from his residence. The process to impeach him is set to start soon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/punjab-rajasthan-jammu-and-kashmir-schools-close-india-pakistan-tension-rise-pahalgam-attack-2721851-2025-05-08",
      "headline": "Punjab, Rajasthan, J&K schools shut after Pak's offensiveSchools and colleges across multiple Indian states, especially in border areas, have been shut amid rising India-Pakistan tensions following the Pahalgam attack. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-rcb-pacer-yash-dayal-press-conference-lsg-clash-2721935-2025-05-09",
      "headline": "RCB pacer Yash Dayal follows his process to reap rewards as death bowlerRoyal Challengers Bengaluru (RCB) medium pacer Yash Dayal has established himself as one of the top death-over bowlers in the Indian Premier League (IPL). Dayal owes his achievement in death-over to sticking to his approach and avoiding thoughts about circumstances beyond his control."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-rcb-vs-lsg-mayank-yadav-injur-return-no-change-in-strategy-2721932-2025-05-09",
      "headline": "LSG's Mayank Yadav explains injury return : No changes in my strategyLSG pace sensation Mayank Yadav says he's stuck to his strengths in IPL 2025 after returning from a long injury layoff that sidelined him since the 2024 season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-super-league-moved-to-the-uae-amid-india-pakistan-tensions-2721922-2025-05-09",
      "headline": "Pakistan Super League moved to UAE amid India-Pakistan tensionsThe remainder of the tenth edition of the Pakistan Super League has been moved to the UAE amid rising tensions between Pakistan and India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-sai-kishore-gujarat-titans-interview-india-call-up-rashid-khan-2721735-2025-05-09",
      "headline": "With a scientist's mind and tricks up his sleeve, Sai Kishore eyes India call-upIPL 2025: Speaking to the press, Gujarat Titans spinner Sai Kishore reflected on his successful season, offering insights into his variations and mindset when it comes to outfoxing batters as a finger spinner in Twenty20 cricket. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2024-rcb-vs-lsg-yash-dayal-virat-kohli-advice-2023-horror-2721909-2025-05-09",
      "headline": "Virat Kohli advice, RCB backing: How Yash Dayal recovered from IPL 2023 horrorYash Dayal revealed how Virat Kohli's advice, RCB's backing and sticking to his own process has helped him bounce back from the IPL 2023 horror. Dayal has enjoyed a sensational turnaround after being hit for 5 sixes by Rinku Singh in IPL 2023. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/neeraj-chopra-to-compete-at-ostrava-golden-spike-2025-2719187-2025-05-09",
      "headline": "Neeraj Chopra to compete at Ostrava Golden Spike 2025Neeraj Chopra is set to finally compete at the prestigious Ostrava Golden Spike 2025 in the Czech Republic on June 24, after missing the last two editions due to injury setbacks."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-europa-league-results-manchester-united-tottenham-hotspur-final-2721891-2025-05-09",
      "headline": "Manchester United set up Europa League final with Tottenham after thumping BilbaoManchester United thumped Athletic Bilbao 4-1 at Old Trafford to secure their spot in the final of the UEFA Europa League on Thursday, May 8. Tottenham Hotspur will face United in the final as they overcame Bodo/Glimt in the other semi-final clash. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/abhinav-bindra-extends-gratitude-to-indian-army-as-pakistan-escalates-border-tensions-2721880-2025-05-09",
      "headline": "Abhinav Bindra extends gratitude to Indian army as Pakistan escalates tensionsLegendary Indian shooter and Olympic gold medallist Abhinav Bindra has extended gratitude to the Indian armed forces amid the rising border tensions with Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ambati-rayudu-on-india-pakistan-escalation-prayers-virender-sehwag-2721876-2025-05-09",
      "headline": "An eye for eye makes world blind: Ambati Rayudu amid escalating India-Pak tensionFormer India cricketer Ambati Rayudu shared his thoughts on the escalating tensions between India and Pakistan, praying for peace and safety in 'Jammu and Kashmir, Punjab and other parts of India along the border'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-dc-match-called-off-stadium-evacuation-dharamshala-2721864-2025-05-09",
      "headline": "Evacuation without panic: How fans exited Dharamsala stadium after IPL match called offThe security officials did a splendid job during the evacuation process at the Himachal Pradesh Cricket Association Stadium after the PBKS vs DC game was called off on Thursday, May 7 after the attacks from Pakistan in various parts of India. A fan present at the game spoke to India Today about the evacuation process and how the incidents transpired on Thursday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-arun-dhumal-lsg-vs-rcb-pakistan-attack-2721857-2025-05-08",
      "headline": "Friday's IPL game on as of now, we are reviewing the situation: DhumalIPL 2025: IPL chairman Arun Dhumal said that the match between Lucknow Super Giants and Royal Challengers Bengaluru will go ahead as scheduled. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-europa-league-results-manchester-united-tottenham-hotspur-final-2721891-2025-05-09",
      "headline": "Manchester United set up Europa League final with Tottenham after thumping BilbaoManchester United thumped Athletic Bilbao 4-1 at Old Trafford to secure their spot in the final of the UEFA Europa League on Thursday, May 8. Tottenham Hotspur will face United in the final as they overcame Bodo/Glimt in the other semi-final clash. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/abhinav-bindra-extends-gratitude-to-indian-army-as-pakistan-escalates-border-tensions-2721880-2025-05-09",
      "headline": "Abhinav Bindra extends gratitude to Indian army as Pakistan escalates tensionsLegendary Indian shooter and Olympic gold medallist Abhinav Bindra has extended gratitude to the Indian armed forces amid the rising border tensions with Pakistan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ambati-rayudu-on-india-pakistan-escalation-prayers-virender-sehwag-2721876-2025-05-09",
      "headline": "An eye for eye makes world blind: Ambati Rayudu amid escalating India-Pak tensionFormer India cricketer Ambati Rayudu shared his thoughts on the escalating tensions between India and Pakistan, praying for peace and safety in 'Jammu and Kashmir, Punjab and other parts of India along the border'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-pbks-vs-dc-match-called-off-stadium-evacuation-dharamshala-2721864-2025-05-09",
      "headline": "Evacuation without panic: How fans exited Dharamsala stadium after IPL match called offThe security officials did a splendid job during the evacuation process at the Himachal Pradesh Cricket Association Stadium after the PBKS vs DC game was called off on Thursday, May 7 after the attacks from Pakistan in various parts of India. A fan present at the game spoke to India Today about the evacuation process and how the incidents transpired on Thursday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-arun-dhumal-lsg-vs-rcb-pakistan-attack-2721857-2025-05-08",
      "headline": "Friday's IPL game on as of now, we are reviewing the situation: DhumalIPL 2025: IPL chairman Arun Dhumal said that the match between Lucknow Super Giants and Royal Challengers Bengaluru will go ahead as scheduled. \r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}