{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/epfo-3-0-launch-date-announced-check-atm-withdrawal-feature-other-details-2660427-2025-01-06",
      "headline": "EPFO 3.0 launch date announced: Check ATM withdrawal feature, other detailsEPFO 3.0, launching by June 2025, will offer ATM-based withdrawals, flexible contributions, and improved features, transforming retirement fund management."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/it-giant-infosys-delays-annual-salary-hikes-to-q4-3-reasons-why-stmp-2660403-2025-01-06",
      "headline": "IT giant Infosys defers annual salary hikes to Q4. 3 reasons whyInfosys postpones annual salary hike: The ongoing macroeconomic uncertainty has left IT companies grappling with subdued discretionary spending, delayed client budgets, and rising cost pressures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-slides-1200-points-as-hmpv-virus-scare-derails-dalal-street-2660396-2025-01-06",
      "headline": "Sensex slides 1,200 points as HMPV scare derails Dalal StreetThe S&P BSE Sensex slipped 1258.12 points to close at 77,964.99, while the NSE Nifty50 nosedived 388.70 points to end at 23,616.05. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/table-space-co-founder-amit-banerji-dies-of-heart-attack-2660393-2025-01-06",
      "headline": "Table Space co-founder Amit Banerji dies of heart attackAmit Banerji, founder and CEO of Table Space, passed away suddenly at 44, leaving a lasting impact on the startup ecosystem and his company's growth."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-couple-stays-to-family-hotels-founder-ritesh-agarwal-on-changing-oyo-brand-image-2660388-2025-01-06",
      "headline": "Ritesh Agarwal explains how OYO is shifting focus to family-friendly staysKnown for being couple-friendly, even for unmarried couples, OYO has been working over the past few months to rebrand itself as a more family-oriented platform."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/budget-2025-will-salaried-class-get-any-tax-relief-increased-disposable-income-affordable-housing-inflation-control-healthcare-and-welfare-support-2660332-2025-01-06",
      "headline": "Budget 2025: Will salaried class get any tax relief?With Budget 2025 approaching, the salaried class eagerly anticipates a budget that acknowledges their contributions and eases financial burdens."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/standard-glass-lining-ipo-day-1-subscribe-skip-review-good-bad-latest-subscription-gmp-details-2660326-2025-01-06",
      "headline": "Standard Glass Lining IPO fully booked on Day 1: Should you subscribe or skip?Standard Glass Lining IPO Day 1: Investors have shown huge interest in the Standard Glass Lining IPO and on its opening day, the IPO was subscribed 7.43 times overall as of latest update. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/why-did-sensex-nifty-crash-today-5-reasons-why-stock-market-is-down-2660316-2025-01-06",
      "headline": "Why did Sensex, Nifty crash today? 5 reasons why stock market is down Share market crash today: Sensex and Nifty tumbled sharply during the trading session as Dalal Street saw a massive spike in volatility. Below are the key factors that have negatively impacted the stock market today. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/union-bank-share-price-tumbles-7-percent-after-q3-update-key-reasons-explained-stmp-2660295-2025-01-06",
      "headline": "Explained: Why Union Bank share price tumbled 7% after Q3 updateUnion Bank stock price: The decline followed a weak quarter-on-quarter (Q-o-Q) performance in its Q3 update. By 1:09 pm, the stock was trading 6.69% lower at Rs 115.75 on the BSE."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/capital-infra-trust-invit-ipo-latest-gmp-price-band-and-key-dates-stmp-2660288-2025-01-06",
      "headline": "Capital Infra Trust IPO: Check latest GMP, price band, and key datesCapital Infra Trust InvIT IPO: The IPO allotment is scheduled for January 10, 2025, with refunds expected to be processed by January 13. Shares will likely be credited to demat accounts on the same day, and the listing is anticipated on January 14 on the BSE and NSE."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/itr-filing-5-new-tax-regime-features-every-taxpayer-must-know-revised-tax-slabs-standard-deduction-2660279-2025-01-06",
      "headline": "ITR filing: 5 new tax regime features every taxpayer must knowBudget 2024's revamped tax regime offers simplified slabs, higher deductions, and savings up to Rs 17,500 annually, enhancing flexibility and easing tax compliance for taxpayers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/saregama-india-stock-price-surges-20-percent-in-5-days-should-you-buy-or-avoid-stmp-2660277-2025-01-06",
      "headline": "Saregama India share price surges over 20% in 5 days. Should you buy or avoid?Saregama India stock price opened at Rs 537.95 on the Bombay Stock Exchange (BSE) and climbed to an intraday high of Rs 593 before stabilising around Rs 568 at 12:27 PM, up 3% for the day. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/budget/story/budget-2025-7-ways-government-can-boost-employment-2660250-2025-01-06",
      "headline": "Budget 2025: 7 ways government can boost employmentAs the budget approaches, several measures have been proposed to boost job creation and improve productivity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/easy-trip-planners-easemytrip-share-price-jump-today-nishant-pitti-explained-stmp-2660240-2025-01-06",
      "headline": "Explained: Why Easy Trip Planners share price jumped up to 17% todayEasy Trip Planners' stock price hit an intraday high of Rs 17.84 on the Bombay Stock Exchange, reflecting a 17.67% jump from its previous close. At 11:23 am, the stock traded at Rs 16.56, up 6.70%."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-falls-700-points-reason-behind-dalal-street-tumble-nifty-down-2660236-2025-01-06",
      "headline": "Sensex nosedives 1,200 points: 3 key reasons behind bloodbath on Dalal StreetStock market crash: The S&P BSE Sensex was down 1165.74 points to 78,057.37, while the NSE Nifty50 lost 366.85 points to 23,637.90 as of 12:02 PM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/axis-securities-paytm-infosys-muthoot-finance-hdfc-bank-2025-top-stock-picks-with-gains-up-to-46-percent-2660099-2025-01-06",
      "headline": "Top stock picks for 2025: Paytm, Infosys in focus with gains of up to 46%From IT giant Infosys to fintech leader Paytm, the brokerage firm has outlined stocks that could deliver good returns. If you've been waiting for the next big idea to boost your portfolio, this list might just be your guide."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/itc-share-price-hotel-business-demerger-special-pre-opening-session-key-details-review-stmp-2660219-2025-01-06",
      "headline": "Explained: Why ITC share price fell by 6% todayITC stock price: ITC hotels demerger process begins. A special pre-open session was conducted on the stock exchanges between 9:00 AM and 9:45 AM to determine ITC Hotels' share price."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/what-are-unclaimed-deposits-bank-owe-you-money-check-via-udgam-portal-rbi-2660211-2025-01-06",
      "headline": "Do banks owe you money? Check unclaimed deposits via UDGAM portalRBI (Reerve Bank of India) launched the Unclaimed Deposits – Gateway to Access Information (UDGAM) portal in August 2023. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-open-higher-driven-by-it-stocks-titan-gains-2-percent-2660201-2025-01-06",
      "headline": "Sensex, Nifty open higher driven by IT stocks; Titan gains 2% The S&P BSE Sensex was up 254.19 points to 79,477.30, while NSE Nifty50 gained 61.50 points to 24,066.25 as of 9:23 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/standard-glass-lining-ipo-open-for-bidding-today-check-latest-gmp-price-band-issue-size-details-review-2660185-2025-01-06",
      "headline": "Standard Glass Lining IPO opens today: Check latest GMP, price band, key detailsStandard Glass Lining IPO price band is set at Rs 133-140 per share, with a lot size of 107 shares. Retail investors must invest at least Rs 14,980."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/chhattisgarh/story/naxals-blow-up-vehicle-carrying-security-personnel-in-chhattisgarhs-bijapur-casualties-feared-2660375-2025-01-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "9 killed as Naxals blow up vehicle carrying security personnel in ChhattisgarhNaxals on Monday blew up a vehicle carrying District Reserve Guard (DRG) personnel on Kutru Road in Chhattisgarh's Bijapur district. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/baby-detected-with-hmpv-in-bengaluru-hospital-citys-first-case-karnataka-government-says-not-aware-of-strain-2660205-2025-01-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Karnataka's 'mask in public' HMPV advisory after 2 cases in Bengaluru, 1 in Gujarat  Live UpdatesThree babies, a three-month-old and an eight-month-old, in Bengaluru and a two-month-old boy in Ahmedabad have been detected with respiratory distress-causing HMPV."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/prashant-kishor-sitting-on-fast-unto-death-for-cancellation-of-bpsc-exam-detained-2660149-2025-01-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Prashant Kishor sent to judicial custody after he refuses conditional bailA team of Patna Police \"forcibly removed\" strategist-turned-politician Prashant Kishor from Patna's Gandhi Maidan, where he was sitting on a fast unto death over the BPSC exam cancellation demand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-government-h1b-visa-renew-pilot-programme-indians-specialty-occupation-workers-renew-visa-without-leaving-country-2660351-2025-01-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Indians can soon renew H-1B visas without returning to IndiaThe US Department of State has successfully completed a pilot programme to renew H-1B visas in the United States and is set to set up a US-based visa rewewal programme this year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/will-hmpv-cause-new-pandemic-after-covid-19-what-you-should-know-2660387-2025-01-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Will HMPV cause new pandemic after Covid-19? What you should knowIndia has detected three cases of Human Metapneumovirus (HMPV), a respiratory virus similar to Covid-19 that spreads through droplets and affects vulnerable groups."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/delhi-chief-minister-atishi-breaks-down-slams-bjps-ramesh-bidhuri-over-offensive-changed-her-father-remark-2660369-2025-01-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Atishi gets emotional, slams BJP's Ramesh Bidhuri over 'changed her father' remarkDelhi Chief Minister Atishi broke down during a press briefing over BJP leader Ramesh Bidhuri's remark that \"she changed her father\". Bidhuri, the BJP's candidate for the Kalkaji Assembly constituency, made the remark on Sunday.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/canada-news/story/justin-trudeau-canada-prime-minister-might-resign-liberal-party-call-within-what-next-chrystia-freeland-jagmeet-singh-2660408-2025-01-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Justin Trudeau to resign? How did Canada get here?Canadian PM Justin Trudeau is under growing pressure from within his own Liberal Party to step down as its leader. Speculation is swirling that Trudeau could announce his resignation as early as this week. But how did Justin Trudeau and Canada come to this point?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/iim-bengaluru-student-dies-falling-hostel-building-floor-birthday-celebration-2660361-2025-01-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "IIM-Bangalore student falls to death from hostel after celebrating 29th birthdayA 29-year-old IIM-Bangalore student fell to his death from the second floor of his hostel building hours after he celebrated his birthday with his friends. A case of unnatural death was registered."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/did-zendaya-just-confirm-her-engagement-to-tom-holland-at-golden-globes-2660412-2025-01-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Did Zendaya just confirm her engagement to Tom Holland at Golden Globes? Actor Zendaya flaunted a stunning diamond ring during her recent appearance at the Golden Globes. Following the circulation of her pictures and videos online, fans began speculating about her possible engagement to boyfriend Tom Holland.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/elections/assembly/story/congress-aap-cash-assistance-women-delhi-assembly-polls-arvind-kejriwal-dk-shivakumar-2660285-2025-01-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Congress's 'Pyari Didi' scheme for women to counter AAP ahead of Delhi pollsDelhi Election: The Congress has announced a women-oriented scheme called Pyari Didi Yojana and promised to give Rs 2,500 to the women of Delhi if it wins the upcoming Assembly polls."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tamil-nadu-winter-session-assembly-drama-governor-rn-ravi-leaves-aiadmk-evicted-bjp-stages-walkout-2660255-2025-01-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Governor Ravi vs MK Stalin again, now over 'insulting national anthem, assembly'The Tamil Nadu assembly's winter session began with Governor RN Ravi walking out over alleged disrespect to the National Anthem. Chief Minister MK Stalin, DMK leaders condemned Ravi's action, saying this had become a habit with the Governor. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/delhi/story/delhi-assembly-election-pm-modi-bjp-seeshmahal-attack-narrative-response-aap-arvind-kejriwal-cm-atishi-2660293-2025-01-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "With PM Modi's 'aapda' jibe, BJP has joined the Delhi dangal against AAPAAP convenor Arvind Kejriwal, the master of narrative building, is now facing a narrative set by PM Modi and the BJP. Kejriwal and the AAP have been cornered by the BJP over allegations of mismanagement in the \"extravagant renovation\" of the former Delhi CMs bungalow."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/woman-daughter-fall-from-safari-jeep-in-front-of-rhinos-in-kaziranga-national-park-video-2660312-2025-01-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Video: Woman, daughter fall from safari jeep in front of rhinos in KazirangaA major accident was averted in Kaziranga National Park when a mother and daughter fell from a moving jeep during a safari and two rhinos charged towards them.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/test-cricket-2-tier-format-jay-shah-icc-president-ind-vs-aus-sa-vs-pak-2660261-2025-01-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "2-tier Test cricket in the works, ICC chief Jay Shah leading the charge: ReportA 2-tier Test cricket structure might be in the works, reported an Australian media outlet on Monday, 6 December. The report suggested that ICC chief Jay Shah is leading the charge with Australia, India and England to incorporate a system where top teams play more often."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/it-giant-infosys-delays-annual-salary-hikes-to-q4-3-reasons-why-stmp-2660403-2025-01-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "IT giant Infosys defers annual salary hikes to Q4. 3 reasons whyInfosys postpones annual salary hike: The ongoing macroeconomic uncertainty has left IT companies grappling with subdued discretionary spending, delayed client budgets, and rising cost pressures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/prayagraj-chalo-khalistani-terrorist-gurpatwant-singh-pannun-threatens-to-disrupt-mahakumbh-2025-magh-mela-2660303-2025-01-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Prayagraj chalo: Khalistani terrorist Pannun threatens to disrupt MahakumbhThis is Pannun's second threat, targeting the Mahakumbh within ten days. In an earlier video, he threatened to disrupt key bathing dates of the religious event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/emergency-trailer-kangana-ranaut-release-date-anupam-kher-2660226-2025-01-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Emergency trailer: Kangana Ranaut channels Indira Gandhi with precisionA new trailer of Kangana Ranaut's political drama, Emergency, was released on Monday. The film, based on the life of India's first female Prime Minister, Indira Gandhi, will hit the theatres on January 17. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/why-did-sensex-nifty-crash-today-5-reasons-why-stock-market-is-down-2660316-2025-01-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why did Sensex, Nifty crash today? 5 reasons why stock market is down Share market crash today: Sensex and Nifty tumbled sharply during the trading session as Dalal Street saw a massive spike in volatility. Below are the key factors that have negatively impacted the stock market today. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/chhattisgarh/story/suresh-chandrakar-main-accused-in-chhattisgarh-journalist-mukesh-chandrakar-murder-case-arrested-hyderabad-2660197-2025-01-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Chhattisgarh journalist's heart was ripped out, shows autopsy; accused arrestedSuresh Chandrakar, a contractor, who was exposed by Chhattisgarh-based journalist Mukesh Chandrakar, was arrested in Hyderabad for allegedly indulging in corruption, was arrested in Hyderabad. He had been on the run for the past few days."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/old-practice-to-blame-neighbours-india-condemns-pak-airstrikes-on-afghanistan-2660420-2025-01-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Old practice to blame neighbours: India condemns Pak airstrikes on AfghanistanPakistan carried out airstrikes in certain areas in Afghanistan in what it said was aimed at targeting some terrorist hideouts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/nikki-glaser-golden-globes-2025-roasts-rapper-sean-diddy-ben-affleck-watch-2660267-2025-01-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Nikki Glaser opens Golden Globes 2025 with digs at rapper Diddy, Ben AffleckStandup comedian Nikki Glaser's Golden Globes 2025 monologue tackled Hollywood controversies and stars like Diddy, Zendaya, and Ben Affleck. Fans praised her wit as she dazzled in nine outfit changes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-to-care-for-your-hair-without-breast-cancer-fears-2659408-2025-01-03?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How to care for your hair without breast cancer fearsA study says chemicals in lab-made haircare products and heat treatments can significantly increase the risk. Experts recommend natural alternatives"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/border-gavaskar-trophy-australia-vs-india-sam-konstas-jasprit-bumrah-intimidation-remark-brad-hogg-2660422-2025-01-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India intimidated Sam Konstas: Brag Hogg says Australia remark 'a bit too far'Brad Hogg has claimed that the remark made by Australia coach Andrew McDonald about India intimidating Sam Konstas was a bit far-fetched. Konstas was involved in an altercation with the Indian team and Jasprit Bumrah during the Sydney Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/gk-current-affairs/story/5-empires-that-dominated-the-indian-sub-continent-for-over-a-century-2659305-2025-01-06?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "From Mauryans to the Mughals: 5 empires that dominated India in 2500 yearsFrom India's original inhabitants, the Mauryans, to the British, who came as traders but stayed to reshape its history, this is a land that absorbed everyone, even those who tried to dominate it. From Mauryans to the Mughals, here are 5 empires that dominated India in 2500 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/music/story/ar-rahman-birthday-58-years-old-grammy-oscar-music-maestro-achievement-award-stmp-2660406-2025-01-06",
      "headline": "AR Rahman birthday: Grammy to Oscar, music maestro's achievements and awardsAR Rahman turned 58 on January 6. From Grammys to Oscars, the music maestro has won several awards throughout his career. Let's take a look.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/did-zendaya-just-confirm-her-engagement-to-tom-holland-at-golden-globes-2660412-2025-01-06",
      "headline": "Did Zendaya just confirm her engagement to Tom Holland at Golden Globes? Actor Zendaya flaunted a stunning diamond ring during her recent appearance at the Golden Globes. Following the circulation of her pictures and videos online, fans began speculating about her possible engagement to boyfriend Tom Holland.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/vin-diesel-shoutout-dwayne-johnson-golden-globes-2025-watch-2660374-2025-01-06",
      "headline": "Hey, Dwayne: Vin Diesel's shout-out to The Rock at Golden Globes 2025The 82nd Golden Globes saw Vin Diesel light-heartedly address Dwayne Johnson during his speech, invoking laughter. Once embroiled in a feud, the two actors appear to have reconciled."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/did-you-know-junaid-khan-auditioned-for-laapataa-ladies-but-couldnt-crack-the-role-2660371-2025-01-06",
      "headline": "Junaid Khan says he auditioned for Laapataa Ladies but couldn't crack the roleJunaid Khan, son of Aamir Khan, auditioned for Laapataa Ladies, but the role went to Sparsh Shrivastava. Despite not securing the role, Junaid maintained a positive relationship with director Kiran Rao."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/michael-vaughan-and-usman-khawaja-praise-jaiswal-in-instagram-comments-2660432-2025-01-06",
      "headline": "Michael Vaughan and Usman Khawaja praise Yashasvi Jaiswal in Instagram commentsYashasvi Jaiswal's stellar debut tour of Australia earned praise from legends Michael Vaughan and Usman Khawaja. With 391 runs, including a stunning century in Perth, the young Indian batter showcased his grit and emerged as a future star.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/border-gavaskar-trophy-australia-vs-india-sam-konstas-jasprit-bumrah-intimidation-remark-brad-hogg-2660422-2025-01-06",
      "headline": "India intimidated Sam Konstas: Brag Hogg says Australia remark 'a bit too far'Brad Hogg has claimed that the remark made by Australia coach Andrew McDonald about India intimidating Sam Konstas was a bit far-fetched. Konstas was involved in an altercation with the Indian team and Jasprit Bumrah during the Sydney Test. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rashid-khans-career-best-helps-afghanistan-register-series-win-vs-zimbabwe-2660404-2025-01-06",
      "headline": "Rashid Khan's career-best helps Afghanistan register series win vs ZimbabweRashid Khan's 11-wicket masterclass and crucial centuries from Rahmat Shah and Ismat Alam powered Afghanistan to a historic Test series win against Zimbabwe, showcasing their resilience and growing depth in the longest format of the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nitish-kumar-reddy-consistent-number-6-batter-india-test-team-irfan-pathan-border-gavaskar-trophy-2660372-2025-01-06",
      "headline": "Nitish Kumar Reddy could be consistent number 6 for India: Irfan PathanIrfan Pathan sees 21-year-old Nitish Kumar Reddy as India's potential No. 6 batter in Tests, following his stellar debut in the Border-Gavaskar Trophy. Reddy's maiden century and all-round promise have ignited hopes for Indian cricket's future."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/wwe/story/wwe-raw-on-netflix-debut-match-card-streaming-details-all-you-need-to-know-roman-reigns-john-cena-2660370-2025-01-06",
      "headline": "WWE RAW on NetFlix debut: Match card, streaming details and all you need to knowWWE Monday Night RAW is all set to enter a new era as it moves to NetFlix with the January 6 episode. Here's a look at all you need to know about this week's episode of RAW which will be featuring Roman Reigns and John Cena on the show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-aus-jasprit-bumrah-record-wickets-bgt-usman-khawaja-2660345-2025-01-06",
      "headline": "Thank God I don't have to play Jasprit Bumrah: Usman KhawajaAustralia opener Usman Khawaja is relieved that he does not have to face Jasprit Bumrah anymore. In a hilarious video, Khawaja said that he was Bumrah'd throughout the Border-Gavaskar Trophy 2024/25 and found it incredibly hard to play against him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mitchell-johnson-border-gavaskar-trophy-2024-25-aus-vs-ind-sam-konstas-jasprit-bumrah-2660339-2025-01-06",
      "headline": "India's efforts to isolate Australian batters in middle didn't pay off: JohnsonFormer Australia fast bowler Mitchell Johnson revealed how India's tactics to make the Australian batters feel isolated in the middle didn't work during the recent Test series between the two teams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/border-gavaskar-trophy-australia-vs-india-yashasvi-jaiswal-performance-sunil-gavaskar-2660327-2025-01-06",
      "headline": "Had a slight doubt if Yashasvi Jaiswal will score in Australia: Sunil GavaskarSunil Gavaskar admitted that he was bit skeptical of Yashasvi Jaiswal performing well in Australia and praised the young opener for his consistency during the Border-Gavaskar Trophy. Jaiswal was India's best batter during the recently-concluded series. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-harbhajan-singh-aus-vs-ind-border-gavaskar-trophy-2024-25-2660275-2025-01-06",
      "headline": "Virat or Rohit, no player is bigger than the game: Harbhajan fumes at star cultureFormer India cricketer Harbhajan Singh questioned team India's star culture after their series loss against Australia and suggested Rohit Sharma and Virat Kohli to play county cricket ahead of England tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-city-wants-treble-winner-jack-grealish-back-in-side-pep-guardiola-2660286-2025-01-06",
      "headline": "Manchester City wants 'treble-winner' Jack Grealish back in side: Pep GuardiolaPep Guardiola has claimed that Manchester City want the 'treble-winner' version of Jack Grealish back in the side as the England midfielder's struggles have continued this season. Grealish hasn't scored a goal in more than a year for City. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mitchell-johnson-border-gavaskar-trophy-2024-25-aus-vs-ind-sam-konstas-jasprit-bumrah-2660339-2025-01-06",
      "headline": "India's efforts to isolate Australian batters in middle didn't pay off: JohnsonFormer Australia fast bowler Mitchell Johnson revealed how India's tactics to make the Australian batters feel isolated in the middle didn't work during the recent Test series between the two teams."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/border-gavaskar-trophy-australia-vs-india-yashasvi-jaiswal-performance-sunil-gavaskar-2660327-2025-01-06",
      "headline": "Had a slight doubt if Yashasvi Jaiswal will score in Australia: Sunil GavaskarSunil Gavaskar admitted that he was bit skeptical of Yashasvi Jaiswal performing well in Australia and praised the young opener for his consistency during the Border-Gavaskar Trophy. Jaiswal was India's best batter during the recently-concluded series. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-rohit-sharma-harbhajan-singh-aus-vs-ind-border-gavaskar-trophy-2024-25-2660275-2025-01-06",
      "headline": "Virat or Rohit, no player is bigger than the game: Harbhajan fumes at star cultureFormer India cricketer Harbhajan Singh questioned team India's star culture after their series loss against Australia and suggested Rohit Sharma and Virat Kohli to play county cricket ahead of England tour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-city-wants-treble-winner-jack-grealish-back-in-side-pep-guardiola-2660286-2025-01-06",
      "headline": "Manchester City wants 'treble-winner' Jack Grealish back in side: Pep GuardiolaPep Guardiola has claimed that Manchester City want the 'treble-winner' version of Jack Grealish back in the side as the England midfielder's struggles have continued this season. Grealish hasn't scored a goal in more than a year for City. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-womens-squad-for-ireland-odi-series-harmanpreet-kaur-renuka-singh-thakur-india-women-vs-ireland-women-2660284-2025-01-06",
      "headline": "Harmanpreet Kaur rested as India announce squad for Ireland ODIsThe BCCI announced a 15-member India women's squad for the upcoming three-match ODI series against Ireland. Captain Harmanpreet Kaur has been rested from the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-melbourne-airport-trauma-covid-19-memory-australian-open-2660266-2025-01-06",
      "headline": "Djokovic says he gets stressed at Melbourne airport, recalls COVID-19 'trauma'Novak Djokovic admitted Melbourne airport still brings back traumatic memories of his 2022 deportation over vaccination issues. As he gears up for the 2024 Australian Open with Andy Murray as coach, Djokovic eyes redemption and a record-breaking 25th Grand Slam."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/test-cricket-2-tier-format-jay-shah-icc-president-ind-vs-aus-sa-vs-pak-2660261-2025-01-06",
      "headline": "2-tier Test cricket in the works, ICC chief Jay Shah leading the charge: ReportA 2-tier Test cricket structure might be in the works, reported an Australian media outlet on Monday, 6 December. The report suggested that ICC chief Jay Shah is leading the charge with Australia, India and England to incorporate a system where top teams play more often."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-jasprit-bumrah-back-spasms-injury-rest-reports-2660256-2025-01-06",
      "headline": "Jasprit Bumrah to be rested for majority white-ball series vs England: ReportsWith Champions Trophy participation in mind, Jasprit Bumrah is likely to be rested for the majority of the England white-ball series, which will begin on January 22. Bumrah sustained back spasms during the Sydney Test against Australia. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-ind-jasprit-bumrah-harbhajan-singh-border-gavaskar-trophy-2660249-2025-01-06",
      "headline": "India would've lost 5-0 to Australia without Jasprit Bumrah: Harbhajan SinghFormer India cricketer turned commentator Harbhajan Singh feels India would've lost the Border Gavaskar Trophy by 0-5 without Jasprit Bumrah."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-aus-5th-test-rohit-sharma-sydney-interview-dinesh-karthik-2660248-2025-01-06",
      "headline": "Rohit Sharma gave Sydney interview to calm public down: Dinesh KarthikFormer India cricketer Dinesh Karthik believes that Rohit Sharma gave an unprecedented interview midway through the Sydney Test match to calm the public down. Karthik expects Rohit Sharma to take a few big calls during his brief rest before the England ODIs.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/trent-alexander-arnold-liverpool-vs-manchester-united-arne-slot-not-real-madrid-transfer-rumour-2660244-2025-01-06",
      "headline": "Slot rubbishes Real Madrid reason for Alexander Arnold's poor United showLiverpool manager Arne Slot dismissed claims that transfer rumors impacted Trent Alexander-Arnold's focus after his struggles against Manchester United. Slot credited United's attacking quality for Trent's performance and reaffirmed the defender's importance to Liverpool's plans despite speculation about his future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-australia-sunil-gavaskar-border-gavaskar-trophy-aus-vs-ind-ind-vs-aus-2660229-2025-01-06",
      "headline": "Cricket Australia breaks silence on not inviting Gavaskar for trophy presentationInd vs Aus: Cricket Australia (CA) broke their silence on not inviting legendary India cricketer Sunil Gavaskar to present Border Gavaskar Trophy (BGT) to Australia who beat India by 3-1 in the Test series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-ind-jasprit-bumrah-harbhajan-singh-border-gavaskar-trophy-2660249-2025-01-06",
      "headline": "India would've lost 5-0 to Australia without Jasprit Bumrah: Harbhajan SinghFormer India cricketer turned commentator Harbhajan Singh feels India would've lost the Border Gavaskar Trophy by 0-5 without Jasprit Bumrah."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-aus-5th-test-rohit-sharma-sydney-interview-dinesh-karthik-2660248-2025-01-06",
      "headline": "Rohit Sharma gave Sydney interview to calm public down: Dinesh KarthikFormer India cricketer Dinesh Karthik believes that Rohit Sharma gave an unprecedented interview midway through the Sydney Test match to calm the public down. Karthik expects Rohit Sharma to take a few big calls during his brief rest before the England ODIs.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/trent-alexander-arnold-liverpool-vs-manchester-united-arne-slot-not-real-madrid-transfer-rumour-2660244-2025-01-06",
      "headline": "Slot rubbishes Real Madrid reason for Alexander Arnold's poor United showLiverpool manager Arne Slot dismissed claims that transfer rumors impacted Trent Alexander-Arnold's focus after his struggles against Manchester United. Slot credited United's attacking quality for Trent's performance and reaffirmed the defender's importance to Liverpool's plans despite speculation about his future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/cricket-australia-sunil-gavaskar-border-gavaskar-trophy-aus-vs-ind-ind-vs-aus-2660229-2025-01-06",
      "headline": "Cricket Australia breaks silence on not inviting Gavaskar for trophy presentationInd vs Aus: Cricket Australia (CA) broke their silence on not inviting legendary India cricketer Sunil Gavaskar to present Border Gavaskar Trophy (BGT) to Australia who beat India by 3-1 in the Test series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-australia-gautam-gambhir-coach-indian-team-virat-kohli-problems-yograj-singh-2660222-2025-01-06",
      "headline": "Gambhir needed to tell Virat Kohli 'don't play that shot': Yograj SinghYuvraj Singh's father Yograj has commented on the Indian management after their series loss against Australia. Yograj has hinted that Gautam Gambhir and others needed better man-managers which could have made a big difference in the series."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/babar-azam-sa-vs-pak-cape-town-test-south-africa-vs-pakistan-2nd-test-2660213-2025-01-06",
      "headline": "Babar Azam 'disappointed' with not finishing his innings well in Cape Town TestStar Pakistan batter Babar Azam revealed that he was left disappointed after not being able to finish his innings well during the second Test against South Africa in Cape Town."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-series-defeat-transition-virat-kohli-rohit-sharma-test-future-2660210-2025-01-06",
      "headline": "Rohit Sharma-Virat Kohli conundrum: Can India afford to delay tough calls? India's Border-Gavaskar Trophy defeat raises urgent questions about the Test futures of stalwarts Rohit Sharma and Virat Kohli. While coach Gautam Gambhir downplays the need for immediate change, can India afford to delay tough decisions ahead of the crucial England tour?\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/all-rounder-rishi-dhawan-announces-retirement-from-indian-white-ball-cricket-2660193-2025-01-06",
      "headline": "All Rounder Rishi Dhawan announces retirement from Indian white-ball cricketIndia and Himachal Pradesh all-rounder Rishi Dhawan announced his retirement from Indian white ball cricket. His last appearance in limited overs cricket came in the Vijay Hazare Trophy 2024-25."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}