{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-bribery-case-sp-lowers-outlook-on-3-adani-units-raises-funding-concerns-2637623-2024-11-22",
      "headline": "Adani bribery case: S&P lowers outlook on 3 Adani units, raises funding concernsGautam Adani Case: S&P expressed concerns that the accusations could erode investor confidence, impair funding access, and escalate borrowing costs for the group."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zinka-logistics-listing-stock-market-debut-investors-hold-or-exit-2637602-2024-11-22",
      "headline": "Zinka Logistics makes tepid market debut: Should investors hold or exit?Zinka Logistics listing: Shares listed at Rs 280.90 on the National Stock Exchange (NSE), a 2.89% premium to the issue price of Rs 273. On the Bombay Stock Exchange (BSE), the stock opened at Rs 279.05, reflecting a 2.22% premium."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-layoffs-500-employees-restructuring-drive-sales-profitability-2637591-2024-11-22",
      "headline": "Ola Electric layoffs: 500 employees likely to lose jobs amid restructuringThe move aims to streamline operations, eliminate redundant roles, and enhance profitability. The restructuring process, which began months ago, is expected to conclude by December 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-silver-price-today-november-22-2024-precious-metals-record-hike-on-mcx-2637583-2024-11-22",
      "headline": "Gold, silver price today, November 22, 2024: Precious metals record hike on MCXGold Price Today: Both gold and silver are trading on the higher side of the Multi Commodity Exchange (MCX) on Friday. Check the latest city-wise prices here.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-group-stocks-fall-second-straight-day-bribery-charges-check-top-losers-2637582-2024-11-22",
      "headline": "Adani Group stocks extend slide amid bribery charges. Details hereAdani Group stocks: This marks the second consecutive session of heavy losses for the conglomerate, with Thursday's rout wiping out Rs 2.25 lakh crore from the group's market capitalisation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-sagar-adani-gautam-adani-group-bribery-case-bribe-notes-indictment-solar-energy-corruption-2637574-2024-11-22",
      "headline": "How Sagar Adani's 'bribe notes' unravelled $250 million schemeAdani Bribery Case: At the heart of the complex bribery scheme for which Gautam Adani and his associates have been indicted are the industrialist's nephew Sagar Adani and the detailed \"bribe notes\" he kept on his mobile phone."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/paytm-share-price-jump-3-percent-today-after-brokerage-bernsteins-update-should-you-buy-2637570-2024-11-22",
      "headline": "Paytm shares jump 3% today after brokerage Bernstein's update. Should you buy?Paytm share price: With shares up 34% this year and 136% in six months, Paytm's growth potential continues to attract investor interest, although challenges remain."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-opening-bell-sensex-nifty-bounce-back-despite-adani-stocks-enterprises-green-ports-triggering-sell-off-2637558-2024-11-22",
      "headline": "Sensex, Nifty bounce back; Adani Energy shares down 5%Stock Market Today: The S&P BSE Sensex was up 496.10 points to 77,651.89, while the NSE Nifty50 gained 72.25 points to 23,422.15 "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-enterprises-adani-green-airtel-lti-jsw-zinka-stocks-to-watch-today-2637523-2024-11-22",
      "headline": "Adani Enterprises, Adani Green, Airtel, LTI, JSW, Zinka: Stocks to watch todayBroader market indices also faced selling pressure, with volatility surging across sectors. As trading opens today, several stocks are expected to remain in focus due to recent developments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/kenya-cancels-700-million-deal-with-adani-group-after-us-charges-2637344-2024-11-21",
      "headline": "Kenya cancels $700 million deal with Adani Group after US chargesKenya has terminated a $700 million agreement with the Adani Group following a US indictment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/kenya-cancels-proposed-deals-with-adani-group-after-us-indictment-over-bribery-2637298-2024-11-21",
      "headline": "Kenya cancels $730 million proposed deals with Adani Group after US indictmentKenyan President William Ruto has ordered the cancellation of several proposed deals with the Adani Group after the US indicted industrialist Gautam Adani in a bribery case."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/sensex-ends-over-400-points-lower-nifty-dips-as-adani-shares-crash-2637166-2024-11-21",
      "headline": "Sensex ends over 400 points lower, Nifty dips as Adani shares crashThe S&P BSE Sensex declined 422.59 points to close at 77,155.79, while the NSE Nifty50 shed 168.60 points to settle at 23,349."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/will-the-us-indictment-hurt-adani-group-international-fund-raising-plan-2637154-2024-11-21",
      "headline": "Will the US indictment hurt Adani Group's international fund raising plan?Gautam Adani and seven others have been accused of paying Rs 2,029 crore in bribes to secure solar power contracts between 2020 and 2024. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gautam-adani-net-worth-declines-by-usd-12-billion-forbes-amid-bribery-case-2637106-2024-11-21",
      "headline": "Gautam Adani's net worth declines by $12 billion amid bribery caseAdani Bribery Row: The decline in net worth comes after allegations of bribery and has also dented the companies listed under the huge conglomerate, wiping out Rs 2 lakh crore in investor wealth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/adani-denies-us-prosecutors-bribery-charges-calls-them-baseless-2637086-2024-11-21",
      "headline": "Adani denies US prosecutors' bribery charges, calls them baseless  The Adani Group has denied allegations of bribery and securities fraud made by U.S. prosecutors against its chairman, Gautam Adani, and other top executives. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-group-first-statement-denies-us-indictment-bribery-fraud-allegations-legal-recourse-baseless-2637074-2024-11-21",
      "headline": "Adani Group rejects US bribery charge as baseless, assures stakeholdersAdani Group Bribery Charges: The Adani Group has dismissed the charges levelled by the US prosecutors as \"baseless\" and maintained that it operates with the highest standards of integrity and compliance. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-group-market-cap-falls-lose-rs-2-lakh-crore-stocks-see-worst-day-since-hindenburg-crisis-2637034-2024-11-21",
      "headline": "Adani Group stocks see worst day since Hindenburg crisis, lose Rs 2 lakh croreAdani Group market cap falls: The bribery allegations caused panic selling across Adani Group stocks, marking their worst trading day since the Hindenburg Research report in early 2023."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-group-conglomerate-share-price-rs-2-lakh-crore-wiped-out-bribary-charge-gautam-adani-2637030-2024-11-21",
      "headline": "Adani Group shares in free fall today. What should investors do?Adani Group Stocks: US authorities have levelled serious charges against Gautam Adani, his nephew Sagar Adani, and former Adani Green Energy CEO Vneet Jaain, accusing them of securities fraud, bribery, and conspiracy."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-group-shares-crash-bribery-allegations-gautam-adani-stock-price-impact-2637001-2024-11-21",
      "headline": "Adani Green, Adani Ports, Adani Transmission: Why Adani group shares are fallingAdani Group Stock Price: Adani Enterprises bore the brunt of the sell-off, falling 23% during the session. Adani Ports and Special Economic Zone (APSEZ) dropped 21%, Adani Power lost 14%, while Adani Energy Solutions and Adani Transmission both declined by 20%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gautam-adani-faces-bribery-charges-us-indictment-5-things-you-need-to-know-adani-group-shares-fall-2636998-2024-11-21",
      "headline": "Gautam Adani faces bribery charges, stocks plunge up to 23%. 5 things to knowAdani Bribery Row: Gautam Adani and seven others have been accused of paying Rs 2,029 crore in bribes to secure solar power contracts between 2020 and 2024.\r\n\r\n\r\n\r\n\r\n"
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/canada-government-justin-trudeau-clarification-media-report-pm-modi-jaishankar-ajit-doval-hardeep-singh-nijjar-killing-plot-2637544-2024-11-22",
      "headline": "Canada rubbishes media report claiming PM Modi knew of Nijjar murder plotIn the midst of strained diplomatic ties, the Canadian government issued a statement to clarify that there is no evidence linking PM Modi and top Indian leaders to the killing of Khalistani terrorist Hardeep Singh Nijjar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jagan-reddy-ysrcp-agreement-adani-group-solar-power-us-bribery-charges-2637600-2024-11-22",
      "headline": "Adani met Jagan Reddy in 2021, promised Rs 1,750 crore bribe, says US agencyNo direct deal with Adani Group: Jagan Reddy's party on US bribery charges"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-live-score-perth-test-day-1-updates-reactions-border-gavaskar-trophy-pat-cummins-jasprit-bumrah-2637484-2024-11-22",
      "headline": "1st Test, Day 1 Live Updates: Nitish-Pant fight as India go past 100Border-Gavaskar Trophy, 1st Test Day 1 Live: Nitish Kumar Reddy and Rishabh Pant are fighting in the middle as India have gone past the 100-run mark in the second session. Nitish is playing some lovely shots against Nathan Lyon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/elon-musk-denies-time-magazine-cover-page-checklist-2637568-2024-11-22",
      "headline": "Elon Musk denies checklist shared by TIME magazine: Not done any interviewsElon Musk: Among other things, the TIME magazine checklist included future goals like 'Slash $2 trillion' and 'Fly to Mars'. Elon Musk clarified that he did not give any media interviews."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-sagar-adani-gautam-adani-group-bribery-case-bribe-notes-indictment-solar-energy-corruption-2637574-2024-11-22",
      "headline": "How Sagar Adani's 'bribe notes' unravelled $250 million schemeAdani Bribery Case: At the heart of the complex bribery scheme for which Gautam Adani and his associates have been indicted are the industrialist's nephew Sagar Adani and the detailed \"bribe notes\" he kept on his mobile phone."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/canada-indian-travellers-extra-screening-measure-withdraws-transport-minister-anita-anand-announces-2637599-2024-11-22",
      "headline": "In U-turn, Canada withdraws extra screening for travellers to IndiaCanadian government withdraws extra screening measure for Indian travellers: Report"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-australia-kl-rahul-unhappy-contentious-drs-call-perth-test-2637569-2024-11-22",
      "headline": "Out or not out? KL Rahul unhappy after contentious DRS call in Perth TestAustralia vs India, Perth Test: KL Rahul's controversial dismissal of Mitchell Starc's bowling in the morning session of the series opener has sparked debate. \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/chhattisgarh-naxals-killed-sukma-district-security-forces-encounter-weapons-recovered-2637631-2024-11-22",
      "headline": "10 Naxals killed in encounter with security forces in Chhattisgarh's SukmaThe gunfight erupted early Friday morning in the forested area of Bhandarpadar when the security personnel were conducting a search operation for Naxals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/i-want-to-talk-movie-review-shoojit-sircar-abhishek-bachchan-rating-2637545-2024-11-22",
      "headline": "I Want To Talk review: Abhishek Bachchan lets silence do the talkingReleased-Fri Nov 22, 2024I Want To Talk movie review: Shoojit Sircar's latest film, starring Abhishek Bachchan, tells the story of Arjun Sen, a marketing genius facing a life-changing cancer diagnosis and how he braves it, and all other curveballs thrown at him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/yoda-diagnostics-launches-beat-the-diabetes-campaign-to-raise-awareness-and-promote-personalized-diabetes-care-2636609-2024-11-20",
      "headline": "Yoda Diagnostics Launches 'Beat the Diabetes' Campaign to Raise Awareness and Promote Personalized Diabetes CareEmpowering Personalized Diabetes Care: Yoda Diagnostics' 'Beat the Diabetes' Campaign Promotes Genetic-Based Medication Plans"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/indians-abroad/story/gun-mishap-kills-telangana-student-in-georgia-us-body-to-arrive-in-india-2637565-2024-11-22",
      "headline": "23-year-old Telangana student dies after gun misfires on birthday in US A 23-year-old student from Telangana, lost his life in a gun misfire incident on his birthday. His body is expected to arrive in Telangana tonight."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/bjp-congress-letter-vs-letter-spat-over-president-droupadi-murmu-intervention-manipur-ethnic-violence-2637594-2024-11-22",
      "headline": "BJP, Congress in letter vs letter spat over President's intervention in ManipurThe latest BJP-Congress spat comes as Manipur is witnessing a fresh spate of violence triggered by the killing of a woman from the Hmar community, who was set ablaze at her home in Jiribam district on November 7."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/bgt-2024-india-vs-australia-virat-kohli-wicket-video-josh-hazlewood-mitchell-starc-2637630-2024-11-22",
      "headline": "WTC Final to Perth Test: Have Australia found chink in Kohli's armour?Australia pacer Josh Hazlewood trapped Virat Kohli to slips for just 5 runs on Day 1 of the Perth Test. Have Australia found a chink in Virat Kohli's armour?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ola-electric-layoffs-500-employees-restructuring-drive-sales-profitability-2637591-2024-11-22",
      "headline": "Ola Electric layoffs: 500 employees likely to lose jobs amid restructuringThe move aims to streamline operations, eliminate redundant roles, and enhance profitability. The restructuring process, which began months ago, is expected to conclude by December 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/elon-musk-wants-spacex-to-produce-one-starship-super-heavy-every-eight-hours-2637616-2024-11-22",
      "headline": "Elon Musk wants SpaceX to produce a Starship every eight hoursThis accelerated production schedule is part of SpaceX's broader strategy to make space travel more accessible and frequent."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/amazon-employee-dies-heart-attack-collapses-stage-friend-wedding-andhra-pradesh-kurnool-2637456-2024-11-21",
      "headline": "Amazon employee dies of heart attack while giving gift at friend's weddingA man suffered a heart attack after presenting a gift to his friend at his wedding in Andhra Pradesh's Kurnool. The man, who worked at Amazon in Bengaluru, had travelled for his friend's wedding."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nagarjuna-on-arranging-chaitanya-sobhita-dhulipala-wedding-they-want-to-do-it-their-way-2637613-2024-11-22",
      "headline": "Nagarjuna on arranging Chaitanya-Sobhita's wedding: They want to do it their wayTelugu actor Nagarjuna shared more details about the upcoming nuptials of his son Naga Chaitanya with Sobhita Dhulipala. He confirmed that the wedding is going to be fully traditional and an extremely guarded affair in December. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/imtiaz-ali-fired-crew-member-highway-set-alia-bhatt-2637564-2024-11-22",
      "headline": "Imtiaz Ali fired a crew member from Highway set: He was trying to be around AliaImtiaz Ali recently shared that he fired a crew member from Highway for misconduct towards Alia Bhatt. He praised the industry's progress on women's safety, recalling another incident from the set of Jab We Met."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/beauty/story/how-safe-are-facial-wipes-for-your-skin-dermats-weigh-in-2637259-2024-11-22",
      "headline": "How safe are facial wipes for your skin? Dermats weigh inWhether it's for removing makeup or refreshing a sweaty face, facial wipes are our go-to for their sheer convenience. But is there a danger lurking behind this ease?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/varun-dhawan-makes-his-linkedin-debut-here-is-what-his-bio-says-2637516-2024-11-22",
      "headline": "Varun Dhawan makes his LinkedIn debut. Here's what his bio saysBollywood actor Varun Dhawan joined LinkedIn to connect with professionals beyond the entertainment industry. Fans welcomed the actor on the platform. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/ukraine-russia-war-gaza-palestine-conflict-trauma-children-reshapes-dna-2637617-2024-11-22",
      "headline": "War reshapes children's DNA, study reveals dramatic consequencesA study reveals that war-related trauma alters children's DNA, potentially affecting their mental and physical health for life."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/gautam-adani-group-associated-bribe-row-energy-contract-white-house-biden-admin-reaction-india-us-relations-2637515-2024-11-22",
      "headline": "Strong ties will help weather Adani storm, says White HouseAdani Bribery Case: The White House expressed confidence in the resilience of India-US ties despite allegations against industrialist Gautam Adani and his associates of orchestrating a $265 million bribery scheme to secure state energy contracts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-dates-2025-announced-window-next-three-seasons-2637566-2024-11-22",
      "headline": "IPL 2025 to begin on March 14, window for next three seasons announced: SourcesThe Indian Premier League is all set to begin early next year. The BCCI has finalised a window between March and May for the next three seasons. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-us-courts-bribery-indictment-is-a-huge-credibility-crisis-for-adani-group-2637332-2024-11-21",
      "headline": "Why US court's 'bribery' indictment is a huge credibility crisis for Adani GroupShares of the 11 listed Adani firms fell over 20 per cent after US authorities indicted Gautam Adani and some of his senior executives in an alleged multi-million-dollar bribery case"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/nagarjuna-on-arranging-chaitanya-sobhita-dhulipala-wedding-they-want-to-do-it-their-way-2637613-2024-11-22",
      "headline": "Nagarjuna on arranging Chaitanya-Sobhita's wedding: They want to do it their wayTelugu actor Nagarjuna shared more details about the upcoming nuptials of his son Naga Chaitanya with Sobhita Dhulipala. He confirmed that the wedding is going to be fully traditional and an extremely guarded affair in December. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ar-rahman-wins-hollywood-music-in-media-award-best-background-score-adujeevitham-the-goat-life-2637624-2024-11-22",
      "headline": "AR Rahman makes first post after divorce news, shares his Hollywood award winAR Rahman won the Best Background Score (Foreign Language) at the Hollywood Music In Media Award for the film Aadujeevitham - The Goat Life. He also shared a post, the first after reacting to his separation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kanguva-box-office-collection-day-8-detailed-report-suriya-film-wraps-up-a-slow-first-week-2637590-2024-11-22",
      "headline": "Kanguva box office Day 8: Suriya's film wraps up a slow first weekSuriya's Kanguva collected around Rs 64 crore nett in its first week at the domestic box office. The film had a moderate week and now, all eyes remain on its second-weekend performance. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/bts-v-announces-duet-with-park-hyo-shin-winter-ahead-2637587-2024-11-22",
      "headline": "BTS's V announces duet with Park Hyo Shin, set for November releaseBTS's V announced his upcoming jazz-pop duet Winter Ahead with Park Hyo Shin, set for release on November 29, 2024. The song reflects on companionship. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-kl-rahuls-controversial-dismissal-ex-india-cricketers-fume-at-decision-in-perth-2637633-2024-11-22",
      "headline": "KL Rahul's controversial dismissal: Ex India cricketers fume at decision in PerthMany former India cricketers were left fuming after KL Rahul's controversial dismissal on Day 1 of the 1st Test. Rahul's dismissal sparked huge debate across the cricketing world. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/bgt-2024-india-vs-australia-virat-kohli-wicket-video-josh-hazlewood-mitchell-starc-2637630-2024-11-22",
      "headline": "WTC Final to Perth Test: Have Australia found chink in Kohli's armour?Australia pacer Josh Hazlewood trapped Virat Kohli to slips for just 5 runs on Day 1 of the Perth Test. Have Australia found a chink in Virat Kohli's armour?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-to-honour-phillip-hughes-on-10th-anniversary-of-tragic-death-2637605-2024-11-22",
      "headline": "Cricket Australia to honour Phillip Hughes on 10th anniversary of tragic deathCricket Australia will observe a sombre tribute to mark the 10th anniversary of Phillip Hughes' tragic death. Flags will be flown at half-mast, and players will wear black armbands as a sign of respect and remembrance for the late cricketer.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-india-vs-australia-kl-rahul-unhappy-contentious-drs-call-perth-test-2637569-2024-11-22",
      "headline": "Out or not out? KL Rahul unhappy after contentious DRS call in Perth TestAustralia vs India, Perth Test: KL Rahul's controversial dismissal of Mitchell Starc's bowling in the morning session of the series opener has sparked debate. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-dates-2025-announced-window-next-three-seasons-2637566-2024-11-22",
      "headline": "IPL 2025 to begin on March 14, window for next three seasons announced: SourcesThe Indian Premier League is all set to begin early next year. The BCCI has finalised a window between March and May for the next three seasons. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/aus-vs-ind-perth-test-virat-kohli-fails-bold-move-hype-border-gavaskar-trophy-2637560-2024-11-22",
      "headline": "Perth Test: After all the hype, Virat Kohli fails as brave move backfiresBorder-Gavaskar Trophy 2024: Virat Kohli did not look comfortable in the first innings of the Perth Test. The former captain, who was batting well outside the crease, was dismissed by a short delivery from Josh Hazlewood on Friday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/starc-hazlewood-became-first-australian-new-ball-pair-to-take-400-test-wickets-2637548-2024-11-22",
      "headline": "Starc-Hazlewood became first Australian new-ball pair to take 400 Test wickets Border-Gavaskar Trophy: Mitchell Starc and Josh Hazlewood removed Yashasvi Jaiswal and Devdutt Padikkal to become the first Australian new-ball attack to claim 400 Test wickets during Day 1 of the first Test against India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/first-2021-gabba-india-play-test-without-ravindra-jadeja-r-ashwin-2637530-2024-11-22",
      "headline": "First since 2021 Gabba, India play Test without Ravindra Jadeja and R AshwinPerth Test, India vs Australia: For the first time since the historic Gabba victory in January 2021, neither Ravichandran Ashwin nor Ravindra Jadeja, two premier spinners, are part of India's Test playing XI. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/perth-test-india-vs-australia-playing-xi-rana-ashwin-padikkal-nitish-bumrah-sundar-bgt-2637510-2024-11-22",
      "headline": "India pick Washington Sundar as lone spinner ahead of Ashwin, JadejaBorder-Gavaskar Trophy: India have handed Test debuts to Harshit Rana and Nitish Reddy while Washington Sundar has taken the lone spinner spot, benching the experienced duo of R Ashwin and Ravindra Jadeja."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/bgt-ind-vs-aus-playing-xi-perth-test-match-nitish-reddy-harshit-rana-debut-2637507-2024-11-22",
      "headline": "Nitish Reddy, Harshit Rana make Test debuts in PerthNitish Kumar Reddy and Harshit Rana made their Test debuts for India in the Perth Test match. Nitish's remarkable 2024 continued as the 21-year-old all-rounder, who stepped into the spotlight amidst key absences in a high-stakes clash for India's World Test Championship ambitions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/starc-hazlewood-became-first-australian-new-ball-pair-to-take-400-test-wickets-2637548-2024-11-22",
      "headline": "Starc-Hazlewood became first Australian new-ball pair to take 400 Test wickets Border-Gavaskar Trophy: Mitchell Starc and Josh Hazlewood removed Yashasvi Jaiswal and Devdutt Padikkal to become the first Australian new-ball attack to claim 400 Test wickets during Day 1 of the first Test against India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/first-2021-gabba-india-play-test-without-ravindra-jadeja-r-ashwin-2637530-2024-11-22",
      "headline": "First since 2021 Gabba, India play Test without Ravindra Jadeja and R AshwinPerth Test, India vs Australia: For the first time since the historic Gabba victory in January 2021, neither Ravichandran Ashwin nor Ravindra Jadeja, two premier spinners, are part of India's Test playing XI. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/perth-test-india-vs-australia-playing-xi-rana-ashwin-padikkal-nitish-bumrah-sundar-bgt-2637510-2024-11-22",
      "headline": "India pick Washington Sundar as lone spinner ahead of Ashwin, JadejaBorder-Gavaskar Trophy: India have handed Test debuts to Harshit Rana and Nitish Reddy while Washington Sundar has taken the lone spinner spot, benching the experienced duo of R Ashwin and Ravindra Jadeja."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/bgt-ind-vs-aus-playing-xi-perth-test-match-nitish-reddy-harshit-rana-debut-2637507-2024-11-22",
      "headline": "Nitish Reddy, Harshit Rana make Test debuts in PerthNitish Kumar Reddy and Harshit Rana made their Test debuts for India in the Perth Test match. Nitish's remarkable 2024 continued as the 21-year-old all-rounder, who stepped into the spotlight amidst key absences in a high-stakes clash for India's World Test Championship ambitions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ind-vs-aus-bgt-2025-steve-waugh-virat-kohli-out-2637508-2024-11-22",
      "headline": "Want to dismiss Virat Kohli early? Tell him how great he looks: WaughFormer Australia captain Steve Waugh has advised an unconventional approach for the hosts to dismiss Virat Kohli early. Waugh has advised that Australian players should be as friendly with Kohli as possible."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-australia-vs-india-live-score-perth-test-day-1-updates-reactions-border-gavaskar-trophy-pat-cummins-jasprit-bumrah-2637484-2024-11-22",
      "headline": "1st Test, Day 1 Live Updates: Nitish-Pant fight as India go past 100Border-Gavaskar Trophy, 1st Test Day 1 Live: Nitish Kumar Reddy and Rishabh Pant are fighting in the middle as India have gone past the 100-run mark in the second session. Nitish is playing some lovely shots against Nathan Lyon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virender-sehwag-son-aaryavir-double-century-delhi-u-19-cooch-behar-trophy-2637467-2024-11-21",
      "headline": "Virender Sehwag's son Aaryavir hits double century in Cooch Behar TrophyAaryavir Sehwag's remarkable double century in the Cooch Behar Trophy highlighted his exceptional talent, setting the stage for Delhi U-19's commanding performance against Meghalaya, with strong partnerships ensuring dominance on the second day of the prestigious tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/sachin-tendulkar-special-message-rafael-nadal-retirement-tennis-davis-cup-warrior-on-court-2637453-2024-11-21",
      "headline": "Warrior on court, gentleman off it: Sachin's special retirement message to NadalIndian cricket legend Sachin Tendulkar paid a heartfelt tribute to Rafael Nadal, celebrating the tennis star's extraordinary career and gentlemanly demeanour, as the Spaniard bid an emotional farewell to professional tennis at the Davis Cup Finals in Malaga."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-australia-vs-india-perth-test-pat-cummins-jasprit-bumrah-captaincy-2637401-2024-11-21",
      "headline": "In series named after batters, Bumrah-Cummins steal limelight as fast-bowling captainsBorder-Gavaskar Trophy: Pat Cummins and Jasprit Bumrah will be captaining their respective sides in the Perth Test match. In a series named after legendary batters, Cummins and Bumrah have carved a fandom of their own."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/arjun-erigaisi-chess-olympiad-double-gold-elo-ranking-jump-season-focus-2637400-2024-11-21",
      "headline": "Olympiad glory, 2800 ELO: Arjun Erigaisi recalls thumping 2024 season Arjun Erigaisi's stellar 2024 saw him dominate the chess world with record-breaking performances, including Chess Olympiad golds and achieving the 2800 ELO milestone, marking him as a rising legend in Indian and global chess."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/video/arjun-erigaisi-approach-one-tournament-at-a-time-chess-olympiad-candidates-chess-2637348-2024-11-21",
      "headline": "Focused on one tournament at a time: Erigaisi recalls his 2024 approachIn an exclusive chat with India Today's sister group Sports Today, Indian chess grandmaster Arjun Erigaisi reflected on his 2024 season, emphasising a \"one tournament at a time\" approach. The 21-year-old shared insights into navigating the year's highs and lows while embracing valuable learning."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-perth-test-kl-rahul-form-sunil-gavaskar-2637334-2024-11-21",
      "headline": "KL Rahul will have no issue with scoring in Australia: Sunil GavaskarSunil Gavaskar feels that KL Rahul will not have an issue with scoring runs in Australia as the batter gets ready to open for India in the Perth Test. Rahul is expected to fill the spot left by Rohit Sharma's absence from the match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-australia-vs-india-perth-test-pat-cummins-jasprit-bumrah-captaincy-2637401-2024-11-21",
      "headline": "In series named after batters, Bumrah-Cummins steal limelight as fast-bowling captainsBorder-Gavaskar Trophy: Pat Cummins and Jasprit Bumrah will be captaining their respective sides in the Perth Test match. In a series named after legendary batters, Cummins and Bumrah have carved a fandom of their own."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/arjun-erigaisi-chess-olympiad-double-gold-elo-ranking-jump-season-focus-2637400-2024-11-21",
      "headline": "Olympiad glory, 2800 ELO: Arjun Erigaisi recalls thumping 2024 season Arjun Erigaisi's stellar 2024 saw him dominate the chess world with record-breaking performances, including Chess Olympiad golds and achieving the 2800 ELO milestone, marking him as a rising legend in Indian and global chess."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/video/arjun-erigaisi-approach-one-tournament-at-a-time-chess-olympiad-candidates-chess-2637348-2024-11-21",
      "headline": "Focused on one tournament at a time: Erigaisi recalls his 2024 approachIn an exclusive chat with India Today's sister group Sports Today, Indian chess grandmaster Arjun Erigaisi reflected on his 2024 season, emphasising a \"one tournament at a time\" approach. The 21-year-old shared insights into navigating the year's highs and lows while embracing valuable learning."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-perth-test-kl-rahul-form-sunil-gavaskar-2637334-2024-11-21",
      "headline": "KL Rahul will have no issue with scoring in Australia: Sunil GavaskarSunil Gavaskar feels that KL Rahul will not have an issue with scoring runs in Australia as the batter gets ready to open for India in the Perth Test. Rahul is expected to fill the spot left by Rohit Sharma's absence from the match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-border-gavaskar-trophy-perth-test-virat-kohli-form-deep-dasgupta-exclusive-2637310-2024-11-21",
      "headline": "Hope Virat Kohli finds 'aggressive, combative' zone vs Australia: Deep DasguptaIn an exclusive interview with Indiatoday.in, Deep Dasgupta hopes that Virat Kohli finds his aggressive and combative zone during the Border-Gavaskar Trophy. Dasgupta also said that Kohli could return to form during the series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/border-gavaskar-trophy-why-world-class-r-ashwin-could-be-indias-trump-card-vs-aus-2637307-2024-11-21",
      "headline": "IND vs AUS: Why 'world-class' R Ashwin could be India's trump card vs AustraliaBorder-Gavaskar Trophy: Ravichandran Ashwin had a forgettable home series against New Zealand but the veteran spinner has been a true-match winner and could turn out to be India's trump card in the Australia Tests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/rohit-is-laidback-bumrah-is-smiley-bloke-vaughan-on-india-missing-aggression-in-bgt-2637303-2024-11-21",
      "headline": "Rohit is laidback, Bumrah is smiley bloke: Vaughan on India missing aggression Michael Vaughan has highlighted India lacking the aggressive leadership in the lead-up to the Border Gavaskar Trophy series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/australia-vs-india-sourav-ganguly-prediction-tight-contest-never-rule-out-border-gavaskar-trophy-2637296-2024-11-21",
      "headline": "Will never rule India out: Ganguly predicts tight Border Gavaskar TrophySourav Ganguly backs India's depth and resilience for the Border-Gavaskar Trophy, dismissing doubts over recent struggles, and highlights their history of triumph in adversity, as they gear up for a high-stakes series opener in Perth."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}