{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/why-middle-class-indians-prefer-dubai-over-india-for-buying-property-explains-ca-2745533-2025-06-24",
      "headline": "Why middle-class Indians prefer Dubai to India for buying property, explains CAIn Dubai, many middle-class Indian couples have managed to purchase two to three properties by saving meticulously over the years. These properties, which offer rental yields of 6–7%, are financed at an interest rate of just 5%, creating sustainable assets that serve as both income sources and retirement plans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/oman-becomes-first-gulf-nation-to-introduce-income-tax-from-2028-2745491-2025-06-24",
      "headline": "Oman becomes first Gulf nation to introduce income tax from 2028The International Monetary Fund (IMF) has already hinted that other Gulf nations may eventually need to introduce income tax too, especially as global demand for fossil fuels continues to decline."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-ends-158-points-higher-nifty-settles-above-25000-adani-ports-down-3-percent-2745482-2025-06-24",
      "headline": "Sensex ends 158 points higher, Nifty settles above 25,000; Adani Ports down 3%The S&P BSE Sensex added 158.32 points to close at 82,055.11, while the NSE Nifty50 added 72.45 points to end at 25,044.35. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-down-why-reason-sensex-nifty-fall-iran-israel-missile-attack-us-president-donald-trump-2745451-2025-06-24",
      "headline": "Stock market down 1%: Why did Sensex, Nifty fall after early gains?The S&P BSE Sensex was up 261.25 points to 82,158.04, while the NSE Nifty50 was up 96.85 points to 25,068.75 as of 2:33 pm. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/labubu-mania-how-a-quirky-doll-made-pop-mart-a-global-giant-ceo-wang-ning-among-china-top-10-richest-2745398-2025-06-24",
      "headline": "Labubu mania: How a quirky doll made Pop Mart a global giantAt the heart of this success is Pop Mart's 38-year-old founder Wang Ning, now one of China's top 10 richest people. As of June 2025, he's worth $22.7 billion, all thanks to Labubu."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-agm-2025-gautam-adani-unveils-big-investment-plans-2745344-2025-06-24",
      "headline": "Adani AGM 2025: Gautam Adani denies US bribery charges, asserts group's clean recordAhead of its AGM, Adani Airports Holdings Limited (AAHL) on Tuesday confirmed securing $1 billion in project finance for Mumbai International Airport Ltd (MIAL), which operates the Chhatrapati Shivaji Maharaj International Airport (CSMIA)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/your-ctc-is-lying-to-you-ca-on-salary-illusions-most-people-miss-2745338-2025-06-24",
      "headline": "Your CTC is lying to you: CA points out salary details most people overlookThe post is part caution and part financial literacy reminder. It challenges employees to take ownership of their earnings and not just celebrate the illusion of a big CTC."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/oil-prices-dip-after-iran-israel-ceasefire-indian-stocks-mixed-gains-rbi-rate-cut-2745313-2025-06-24",
      "headline": "Explained: Why are oil sector stocks rising today?The ceasefire announcement made by US President Donald Trump triggered a decline in oil prices, which had experienced a prior surge due to geopolitical tensions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/explained-why-enviro-infra-engineers-share-price-jumped-11-in-early-trade-2745296-2025-06-24",
      "headline": "Explained: Why Enviro Infra Engineers share price jumped 11% in early tradeAt around 9:48 am, the company's stock was trading at Rs 233.50 apiece on the Bombay Stock Exchange (BSE), up 10.43% from the previous close."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sensex-jumps-900-points-why-is-the-stock-market-rising-today-2745287-2025-06-24",
      "headline": "Sensex jumps 900 points: Why is the stock market rising today?At around 9:22 am, the S&P BSE Sensex was up 869.86 points at 82,766.65, while the NSE Nifty50 jumped 262.75 points to 25,234.65. Broader markets also mirrored the upbeat sentiment, with volatility declining across the board."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-opening-bell-rally-sensex-jumps-800-points-nifty-goes-past-25200-adani-ports-up-4-percent-2745277-2025-06-24",
      "headline": "Sensex jumps 800 points. Nifty goes past 25,200; Adani Ports up 4%The S&P BSE Sensex was up 576.42 points to 82,473.21, while the NSE Nifty50 gained 194.05 points to 25,165.95 as of 9:35 am. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-open-higher-iran-israel-ceasefire-oil-prices-indian-markets-2745257-2025-06-24",
      "headline": "Sensex and Nifty to open higher as Iran-Israel ceasefire eases oil pricesThe Gift Nifty futures were trading at 25,297.50 as of 8:10 a.m., indicating that the Nifty50 will open above its previous close of 24,971.9."
    }
  ],
  "entertainment": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shruti-haasan-x-account-hacked-2745545-2025-06-24",
      "headline": "Shruti Haasan's X account hacked, actor alerts fansActor Shruti Haasan's X account got hacked earlier today. The actor warns fans of the cyberattack."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kim-soo-hyun-sues-kim-sae-ron-family-defamation-case-2745368-2025-06-24",
      "headline": "Kim Soo-hyun sues Kim Sae-ron's family over defamation caseActor Kim Soo-hyun has filed a criminal complaint against late actor Kim Sae-ron's family to clear his name and protect his reputation. This follows the late actor's ex-manager's defamation suit against another YouTuber."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-hosts-special-screening-sitaare-zameen-par-for-president-murmu-2745526-2025-06-24",
      "headline": "Aamir Khan hosts special screening of Sitaare Zameen Par for President MurmuAamir Khan recently hosted a special screening of his sports-drama 'Sitaare Zameen Par' for President Droupadi Murmu at Rashtrapati Bhavan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/arijit-singh-surprises-fans-with-virtual-performance-at-metro-in-dino-music-launch-2745492-2025-06-24",
      "headline": "Arijit Singh surprises fans with virtual performance at Metro In Dino music launchSinger Arijit Singh couldn't attend the album launch of 'Metro In Dino' in Mumbai on Tuesday, but he managed to entertain his fans virtually. The singer gave a live virtual performance at the event. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/amitabh-bachchan-response-to-trolls-accusing-him-of-smoking-weed-2745528-2025-06-24",
      "headline": "Amitabh Bachchan's response to trolls accusing him of smoking weedAmitabh Bachchan gave sassy replies to trolls who reacted to his trolling about the cybercrime awareness call tune. The veteran actor was accused by a troll of smoking weed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vikrant-massey-enjoys-spanish-getaway-with-wife-sheetal-thakur-and-son-2745440-2025-06-24",
      "headline": "Vikrant Massey enjoys Spanish getaway with wife Sheetal Thakur and son. See picsVikrant Massey and Sheetal Thakur shared adorable pictures from their family holiday in Mallorca, Spain. The couple spent some fun and quality time with their baby boy."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ajith-kumar-new-tonsured-look-viral-pics-2745495-2025-06-24",
      "headline": "Ajith Kumar's new look takes internet by storm. Viral picsActor Ajith Kumar took everyone by surprise with his new look. He seems to have opted for a buzz cut as he gears up for the next leg of his upcoming car race."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/fight-like-sita-but-dont-use-her-name-why-janaki-makes-censor-board-uncomfortable-2745457-2025-06-24",
      "headline": "Fight like Sita but don't use her name: Why Janaki makes censor board uncomfortable?Who gets to carry Sita's name, and who decides that? Why has a film unsettled the censor board just because the protagonist is named Janaki? As mythology, memory and modern storytelling collide, we discuss if a woman in today's India can't reclaim her story if she's named 'Janaki' - after a Goddess who herself stands as a symbol of resilience and fighting back. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/mithoon-highest-paid-label-glad-fraternity-is-opening-up-to-new-avenues-saiyaara-2745481-2025-06-24",
      "headline": "Mithoon reacts to highest-paid label: Glad fraternity is opening up to new avenuesSinger and composer Mithoon opened up about claims of demanding Rs 25 crore for an album. In an exclusive chat with India Today, the composer did not deny the claims, instead, he appreciated the industry for understanding the worth of the musicians. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/naga-babu-daughter-niharika-konidela-divorce-chaitanya-jonnalagadda-marriage-was-our-mistake-2745474-2025-06-24",
      "headline": "Actor Naga Babu discusses daughter Niharika's divorce: Her marriage was our mistakeActor Naga Babu recently opened about his daughter Niharika Konidela's divorce from Chaitanya Jonnalagadda. He said that his daughter's marriage was a mistake on their part."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kriti-sanon-chasing-aanand-l-rai-tere-ishk-mein-finally-ticked-that-box-2745366-2025-06-24",
      "headline": "Kriti Sanon on chasing Aanand L Rai for Tere Ishk Mein: Finally ticked that boxActor Kriti Sanon recently expressed excitement about working with director Aanand L Rai in the upcoming love story 'Tere Ishk Mein' (2025). The film is considered to be a spiritual sequel to Rai's romance-drama 'Raanjhana' (2013). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-family-man-3-manoj-bajpayee-returns-srikant-tiwari-fresh-mission-raj-and-dk-2745468-2025-06-24",
      "headline": "The Family Man 3: Manoj Bajpayee returns as Srikant Tiwari with fresh missionManoj Bajpayee is set to return as Srikant Tiwari in Prime Video's popular series, 'The Family Man 3'. The makers shared the first-look poster today, June 24. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/ram-charan-game-changer-45-hours-long-producer-dil-raju-on-film-flopping-2745446-2025-06-24",
      "headline": "Game Changer producer blames himself for film's failure: I have 100 per cent regretTelugu producer Dil Raju opened up about the missteps behind Ram Charan's 'Game Changer'. He cited the film's extended runtime as the reason and expressed his regret over not delivering a success for Ram Charan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/brad-pitt-fitness-driving-skills-f1-film-joseph-kosinski-2745430-2025-06-24",
      "headline": "What did Brad Pitt do to look fit for F1? Director Joseph Kosinski answersHollywood star Brad Pitt demonstrated exceptional fitness and driving skills for the 'F1' film. His dedication impressed director Joseph Kosinski and co-producer Lewis Hamilton, raising expectations for the movie's release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shabana-azmi-shares-pic-with-javed-akhtar-2745417-2025-06-24",
      "headline": "Shabana Azmi shares pic with Javed Akhtar, says he's oblivious to the scenic beautyShabana Azmi shared a candid photo of Javed Akhtar deeply focused on writing, playfully hinting at being the \"scenic beauty\" he missed. Fans loved the sweet moment and praised the couple's strong bond."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/rachel-zegler-snow-white-backlash-says-i-dont-choose-victim-mindset-2745411-2025-06-24",
      "headline": "Rachel Zegler on Snow White backlash: I don't choose victim mindset'Snow White' actor Rachel Zegler opens up about the recent online backlash, the pressures of the industry, and her stance on global humanitarian issues. She believes happiness is a choice, and chooses to focus on positivity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/suniel-shetty-athiya-praises-kl-rahul-as-he-hits-century-at-headingley-2745394-2025-06-24",
      "headline": "Suniel Shetty, Athiya praises KL Rahul as he hits century at HeadingleyKL Rahul's century at Headingley earned him praise from wife Athiya Shetty and father-in-law Suniel Shetty. Both shared photos of him on their Instagram Stories along with heartfelt messages."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aditya-roy-kapur-surprises-fans-live-singing-metro-in-dino-album-launch-2745350-2025-06-24",
      "headline": "Aditya Roy Kapur channels Aashiqui 2 vibes at Metro In Dino album launch. WatchAditya Roy Kapur made his singing debut at the 'Metro In Dino' album launch. He performed 'Ishq Hai Ya Tharak' live on stage. The song is expected to be released soon. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ram-kapoor-removed-from-mistry-promotions-for-making-offensive-remarks-source-2745401-2025-06-24",
      "headline": "Ram Kapoor dropped from Mistry promotions over offensive remarks: SourceActor Ram Kapoor has been removed from all the promotional activities of his upcoming project 'Mistry'. The series will premiere on JioHostar on June 27. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-says-iran-violated-ceasefire-sirens-go-off-vows-forceful-response-in-heart-of-tehran-2745421-2025-06-24",
      "headline": "Blasts heard in Tehran minutes after Trump asks Israel not to bomb Iran Live UpdatesIsraeli Prime Minister Benjamin Netanyahu told Trump that he could not 'cancel the attack' and some response was needed after he claimed that Iran violated the ceasefire."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/trump-says-both-iran-and-israel-violated-ceasefire-as-missiles-were-fired-hours-after-he-brokered-truce-2745496-2025-06-24",
      "headline": "Trump insists ceasefire is on, says Israeli jets will do 'friendly wave' to IranUS President Donald Trump, who said he brokered a ceasefire between Israel and Iran, stressed that the truce was in effect, minutes after he blamed the long-time foes for violating the agreement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/dgca-airports-surveillance-inspection-finds-major-safety-lapses-defects-2745562-2025-06-24",
      "headline": "Faded runway markings, worn-out tyres: Watchdog flags safety lapses at airportsThe Directorate General of Civil Aviation conducted surveillance of major airports and found \"ineffective monitoring and inadequate rectification action on the defects\" by airport authorities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-live-cricket-score-1st-test-day-5-leeds-weather-updates-2745436-2025-06-24",
      "headline": "Day 5 Live: Lunch called, England dominate morning sessionEngland (ENG) vs India (IND), 1st Test Day 5 Live Score and Updates: Ben Duckett and Zak Crawley have done exceedingly well to keep England ahead in the 1st Test match. 96 runs have been scored in the morning session of Day 5. India pacers have gone wicketless and are looking slightly toothless on the Leeds deck."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/us-stealth-b2-bombers-video-taking-off-iran-nuclear-sites-fordow-natanz-2745536-2025-06-24",
      "headline": "Video shows US B-2 bombers taking off to strike Iran's nuclear sitesSeven B-2 stealth bombers dropped 'bunker-buster' bombs on three key Iranian nuclear facilities - Fordow, Natanz, and Isfahan - as part of Operation Midnight Hammer."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/rajasthan/story/udaipur-man-invites-french-tourist-to-go-sightseeing-then-rapes-her-at-his-flat-2745538-2025-06-24",
      "headline": "Will show you beautiful sights, Udaipur man told French tourist, then raped herDuring the party, the accused approached the French woman and said, \"Let's go out for a smoke and I will show you the beautiful sights around.\" He then took her to his flat and raped her."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-iran-war-us-president-donald-trump-swears-breaking-ceasefire-f-bomb-cussword-2745557-2025-06-24",
      "headline": "Trump drops the F-bomb on Iran and IsraelQuestioned about the fighting between Iran and Israel despite an announced ceasefire, a furious Donald Trump used the f-cussword. This is a rare moment when a sitting US President used the forbidden F-word in public while addressing the media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-iran-war-move-400-kg-uranium-stockpile-secret-location-enough-10-nuclear-bombs-before-us-strikes-2745479-2025-06-24",
      "headline": "Did Iran move 400 kg of uranium, enough to make 10 N-bombs, before US strikes?Even as Israel and Iran scramble through a shaky ceasefire brokered by the US, there are reports that Tehran may have outsmarted America and moved 400 kg of uranium, enough to make nine to 10 atomic bombs, to a secret location before the weekend bombing of its nuke sites - Fordow, Natanz, and Isfahan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/tense-truce-the-fragility-of-the-israel-iran-ceasefire-2745432-2025-06-24",
      "headline": "Tense truce: The fragility of the Israel-Iran ceasefireThe ceasefire agreement came after Iran's response to US airstrikes against its nuclear programme led Tehran to launch missiles towards Al Udeid air base in Qatar, the largest American military facility in the Middle East."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/meril-launches-myclip-indias-first-transcatheter-edge-to-edge-repair-teer-system-for-treatment-of-severe-mitral-regurgitation-2745354-2025-06-24",
      "headline": "Meril Launches MyClip, India's First Transcatheter-Edge-to-Edge Repair (TEER) System for Treatment of Severe Mitral RegurgitationThe launch of MyClip TEER System marks a transformative moment for structural heart therapy in India."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/israel-iran-war-strait-of-hormuz-crude-price-india-energy-security-oil-reserves-underground-rock-cavern-2745302-2025-06-24",
      "headline": "How India uses underground caves to store crude oil for crisisThere's fear that Iran might try to choke the Strait of Hormuz, through which 20% of global crude oil is traded. India, however, is said to be in a pretty comfortable position. This is how India stores crude oil in underground rock caverns in Visakhapatnam, Mangalore and Padur for emergency situations."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/donald-trump-peacemaker-fragile-israel-iran-ceasefire-india-pakistan-truce-boast-2745497-2025-06-24",
      "headline": "Trump's penchant for 'peacemaking' sees another messy ceasefire boastIt's no secret that, ever since assuming the presidency, Trump has positioned himself as a peacemaker. That fixation seems to have led Trump to jump the gun in unilaterally declaring ceasefires in some recent conflicts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/standpoint/story/fight-like-sita-but-dont-use-her-name-why-janaki-makes-censor-board-uncomfortable-2745457-2025-06-24",
      "headline": "Fight like Sita but don't use her name: Why Janaki makes censor board uncomfortable?Who gets to carry Sita's name, and who decides that? Why has a film unsettled the censor board just because the protagonist is named Janaki? As mythology, memory and modern storytelling collide, we discuss if a woman in today's India can't reclaim her story if she's named 'Janaki' - after a Goddess who herself stands as a symbol of resilience and fighting back. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/iran-israel-conflict-live-updates-donald-trump-benjamin-netanyahu-nuclear-sites-air-strikes-in-tehran-tel-aviv-2744689-2025-06-23",
      "headline": "Live: Israel strikes radar site in Tehran minutes after Trump insists 'truce in place'Israel-Iran War News Live: The hostilities between Israel and Iran continued as Tel Aviv has now alleged that Tehran has violated the ceasefire, which both parties agreed upon earlier on Tuesday. The IDF said that Iran launched two ballistic missiles hours after the ceasefire deal. However, Iran denied the allegations of disrespecting the truce. Earlier too, Israel claimed that Iran launched continuous missile attacks despite US President Donald Trump announcing that the two countries had reached a ceasefire agreement early on Tuesday."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/how-india-born-engineer-noshir-gowadia-in-b-2-bomber-project-ended-up-as-china-spy-iran-h-20-stealth-bomber-2745382-2025-06-24",
      "headline": "How India-born engineer in B-2 bomber project ended up as China spyIndia-born engineer Noshir Gowadia, who played a key role in developing the B-2 bomber's stealth propulsion system, was sentenced to 32 years in prison for leaking classified US military secrets to China and other countries. His disclosures reportedly helped China develop stealth cruise missile technology."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-russia-medvedev-putin-boss-nuclear-word-use-nuclear-submarines-tomhawks-us-arsenal-2745464-2025-06-24",
      "headline": "Way ahead of the pack: Trump warns Russia of US arsenal after Putin aide's N-wordUS President Donald Trump reacted sharply to former Russian President Dmitry Medvedev's remarks that some countries were willing to supply nuclear warheads to Iran after the American airstrikes. Trump condemned the remark, warning against casual nuclear threats and boasting of the US military's superiority."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/fashion/story/kolhapuri-chappal-prada-show-labour-shortage-artisans-dying-craft-2745389-2025-06-24",
      "headline": "Kolhapuris walk Prada ramp (without credit?), while also losing ground in IndiaCurrently a topic of discussion, thanks to Prada's Milan fashion show, Kolhapuri chappals face a bevy of challenges in their own country, with many insiders fearing that the actual craft might soon die out."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/meet-joy-the-fifth-astronaut-travelling-with-indias-shubhanshu-shukla-2738659-2025-06-24",
      "headline": "Meet the fifth astronaut travelling with India's Shubhanshu ShuklaA tiny plush toy with a mighty mission—this adorable swan is more than just a zero-gravity indicator. It's a symbol of unity, culture, and the emotional heart of the Axiom-4 crew heading to space."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nehru-papers-letters-carted-away-by-sonia-gandhi-might-see-legal-battle-between-gandhi-family-pmml-museum-administration-2745467-2025-06-24",
      "headline": "Nehru papers, carted away on Sonia Gandhi's orders, might see a legal battleThe Prime Ministers Museum and Library (PMML) might take the legal route to retrieve the papers of Jawaharlal Nehru, including his letters to Edwina Mountbatten. The Nehru papers, which were donated to the NMML by Indira Gandhi but carted away by Sonia Gandhi, were the focus of the meeting headed by PM Modi, say reports."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/serving-op-sindoor-wont-give-immunity-supreme-court-to-commando-accused-of-dowry-death-2745480-2025-06-24",
      "headline": "Serving Op Sindoor won't give immunity: Top court to commando accused of dowry deathWhen the bench expressed disinclination from granting an exemption, the petitioner's counsel said he had been serving in the Rashtriya Rifles for 20 years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/truth-about-dark-underarms-its-a-health-issue-not-a-beauty-fad-2745490-2025-06-24",
      "headline": "Truth about dark underarms: It's a health issue not a beauty fadBefore you reach for another \"whitening cream,\" ask yourself: is it a skin problem or a signal from within?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/poll-panel-rejects-rahul-gandhis-rigging-allegation-invites-him-for-discussion-2745503-2025-06-24",
      "headline": "Poll panel rejects Rahul Gandhi's rigging allegation, invites him for discussionIn a letter emailed to Rahul Gandhi on June 12, the Election Commission responded to his allegations that the poll panel failed to ensure free and fair elections in Maharashtra. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/novo-nordisk-launches-wegovy-weight-loss-drug-india-obesity-how-it-works-and-who-should-take-it-2745429-2025-06-24",
      "headline": "Wegovy weight-loss drug in India: How it works, who should take itNovo Nordisk has introduced Wegovy, a once-weekly weight-loss injection, in India. The drug aims to manage obesity and reduce heart risks amid the country's growing obesity crisis."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/features/story/tesla-robotaxi-off-to-a-rocky-start-musks-driverless-cabs-not-fully-autonomous-swerves-on-wrong-side-of-road-2745465-2025-06-24",
      "headline": "Tesla Robotaxi swerves on wrong side of road, they are not fully autonomous yetTesla's driverless Robotaxis are now live in Austin, but videos reveal traffic glitches and safety concerns, raising questions about Elon Musk's bold promises of full autonomy in the near future."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-headingley-crowd-boo-shubman-gill-shardul-thakur-ball-change-2745546-2025-06-24",
      "headline": "Headingley crowd boos India over repeated ball change plea on Day 5India's tough morning at Headingley turned tense when repeated ball-change appeals from Shubman Gill and Shardul Thakur were met with rejection — and a chorus of boos from the Leeds crowd during England's strong opening partnership."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dilip-doshi-passes-away-tributes-indian-spinner-cricket-legacy-2745499-2025-06-24",
      "headline": "Dilip Doshi dies: India, England players wear black armbands in Leeds tributeFormer Indian spinner Dilip Doshi passed away on June 23 at age 77. India and England players observed a minute's silence while wearing black armbands in a tribute to the spinner on Tuesday, June 24. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-live-cricket-score-1st-test-day-5-leeds-weather-updates-2745436-2025-06-24",
      "headline": "Day 5 Live: Lunch called, England dominate morning sessionEngland (ENG) vs India (IND), 1st Test Day 5 Live Score and Updates: Ben Duckett and Zak Crawley have done exceedingly well to keep England ahead in the 1st Test match. 96 runs have been scored in the morning session of Day 5. India pacers have gone wicketless and are looking slightly toothless on the Leeds deck."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/emma-raducanu-wimbledon-blocks-stalker-ticket-purchase-2745428-2025-06-24",
      "headline": "Emma Raducanu thanks Wimbledon for blocking stalker's ticket purchaseBriton Emma Raducanu said she felt reassured about her safety after Wimbledon organisers prevented a man who had been stalking her from purchasing tickets for the Grand Slam, which begins on Monday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/austrian-grand-prix-2025-all-you-need-to-know-2745420-2025-06-24",
      "headline": "Austrian GP preview: Verstappen seeks redemption, as McLaren look to extend leadThe 2025 Austrian Grand Prix takes place at Red Bull Ring with McLaren leading the championship. The race could reshape the title fight as Verstappen aims for a fifth win at his favourite track."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-icc-code-of-conduct-breach-umpire-decision-dissent-eng-vs-ind-2745387-2025-06-24",
      "headline": "ICC punishes Rishabh Pant for showing dissent at umpire's decisionIndia's wicket-keeper-batter Rishabh Pant has been handed an official reprimand for breaching Level 1 of the ICC Code of Conduct during the Headingley Test.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dropped-catches-leeds-test-slope-dark-stands-impact-india-england-fielding-2745363-2025-06-24",
      "headline": "Explained: Why are so many catches being dropped at Headingley?IND vs ENG 1st Test: India and England struggled with multiple dropped catches in the Leeds Test match. Former England captain Alastair Cook explained why both teams were dropping chances at slips."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/neeraj-chopra-ostrava-golden-spike-live-streaming-all-you-need-to-know-2745351-2025-06-24",
      "headline": "Neeraj Chopra targets Ostrava win ahead of Tokyo World ChampionshipsAhead of his homecoming in Bengaluru with the Neeraj Chopra Classic on July 5, the Indian ace will look to make a mark at the Ostrava Golden Spike event as he enters as the favourite.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-kl-rahul-on-rishabh-pant-batting-mantra-leeds-test-2745342-2025-06-24",
      "headline": "Let Pant be Pant: Rahul explains India keeper's method after twin centuriesIndia batter KL Rahul admitted on Monday that trying to understand Rishabh Pant's mindset is nearly impossible - and perhaps unnecessary. Pant became only the second wicketkeeper to hit two centuries in one Test match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rain-threat-headingley-test-india-england-final-day-2745333-2025-06-24",
      "headline": "Leeds weather report: Rain set to play big part in thrilling final dayLeeds weather forecast: Rain is expected to impact the final day of the 1st Test between India and England at Headingley. Both teams aim to force a result despite tricky weather and pitch conditions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-icc-code-of-conduct-breach-umpire-decision-dissent-eng-vs-ind-2745387-2025-06-24",
      "headline": "ICC punishes Rishabh Pant for showing dissent at umpire's decisionIndia's wicket-keeper-batter Rishabh Pant has been handed an official reprimand for breaching Level 1 of the ICC Code of Conduct during the Headingley Test.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dropped-catches-leeds-test-slope-dark-stands-impact-india-england-fielding-2745363-2025-06-24",
      "headline": "Explained: Why are so many catches being dropped at Headingley?IND vs ENG 1st Test: India and England struggled with multiple dropped catches in the Leeds Test match. Former England captain Alastair Cook explained why both teams were dropping chances at slips."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/neeraj-chopra-ostrava-golden-spike-live-streaming-all-you-need-to-know-2745351-2025-06-24",
      "headline": "Neeraj Chopra targets Ostrava win ahead of Tokyo World ChampionshipsAhead of his homecoming in Bengaluru with the Neeraj Chopra Classic on July 5, the Indian ace will look to make a mark at the Ostrava Golden Spike event as he enters as the favourite.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-kl-rahul-on-rishabh-pant-batting-mantra-leeds-test-2745342-2025-06-24",
      "headline": "Let Pant be Pant: Rahul explains India keeper's method after twin centuriesIndia batter KL Rahul admitted on Monday that trying to understand Rishabh Pant's mindset is nearly impossible - and perhaps unnecessary. Pant became only the second wicketkeeper to hit two centuries in one Test match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rain-threat-headingley-test-india-england-final-day-2745333-2025-06-24",
      "headline": "Leeds weather report: Rain set to play big part in thrilling final dayLeeds weather forecast: Rain is expected to impact the final day of the 1st Test between India and England at Headingley. Both teams aim to force a result despite tricky weather and pitch conditions."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}