{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-gains-ground-after-shaking-off-four-week-losing-streak-glbs-2698435-2025-03-24",
      "headline": "Wall Street gains ground after shaking off four-week losing streakThe New York Stock Exchange showed positive signs on Monday after weeks of decline ahead of a potentially softening stance on tariffs by the Trump administration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tesla-shares-jump-as-investors-eye-possible-tariff-leeway-lower-price-2698414-2025-03-24",
      "headline": "Tesla shares jump 10% as investors eye possible tariff leeway, lower priceTesla shares surged 10% on Monday amid reports of tariff exclusions under the Trump administration. Investors saw an opportunity after a steep decline this year. The rally lifted Wall Street, with tech stocks pushing indexes to two-week highs.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/boeing-lays-off-employees-bengaluru-technology-centre-under-global-workforce-reduction-2698349-2025-03-24",
      "headline": "180 Boeing employees laid off in India under global workforce reduction: ReportAs part of the global workforce reduction, up to 180 staff at the Boeing India Engineering Technology Center in Bengaluru were laid off in the December quarter of 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-bull-run-sensex-reclaims-78000-after-1100-point-rally-nifty-ends-above-23600-2698202-2025-03-24",
      "headline": "Sensex reclaims 78,000 after 1,100-point rally, Nifty ends above 23,600The S&P BSE Sensex surged 1,078.87 points to close at 77,984.38, while the NSE Nifty50 added 323.55 points to end at 23,673.95. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/donald-trump-united-states-exclude-sector-specific-reciprocal-tariffs-scale-back-april-2-2698189-2025-03-24",
      "headline": "US planning to scale back April 2 reciprocal tariffs for specific sectors: ReportsUS President Donald Trump's administration may exclude a set of sector-specific tariffs while applying reciprocal levies on April 2, Bloomberg News and the Wall Street Journal reported, citing officials."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/japanese-stock-market-zensho-holdings-co-share-fall-unexpected-rodent-incident-report-2698187-2025-03-24",
      "headline": "A rat did it: Japanese stock tanks after unexpected rodent incidentThe stock of the Japanese firm Zensho Holdings Co fell 7.1% in one of its biggest declines since February 13 due to an incident involving a rodent. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-zerodha-founder-and-ceo-nithin-kamath-left-a-lasting-impression-on-a-customer-they-won-my-trust-for-life-2698143-2025-03-24",
      "headline": "How Zerodha's Nithin Kamath left a lasting impression on a customerNithin Kamath not only acknowledged the customer's concern but also took immediate action. Zerodha's team quickly looked into the compliance issue and assured the customer that they were working on resolving it. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-rally-dalal-street-green-flags-what-investors-should-know-2698127-2025-03-24",
      "headline": "Red flags turn green on Dalal Street: Will the stock market bull run continue?Stock market rally today: With today's rebound, both indices have nearly erased most of the losses suffered in the first two months of 2025. It may be noted that the total market capitalisation of all BSE-listed firms swelled by over Rs 5 lakh crore."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/volkswagen-tax-case-why-government-doesnt-want-to-quash-14-billion-demand-2698086-2025-03-24",
      "headline": "Volkswagen tax case: Why government stands firm on $1.4 billion demandThe government's tax demand is against Skoda Auto Volkswagen India, which is accused of wrongly classifying imported parts for some Audi, VW and Skoda cars to avoid paying higher import taxes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/bull-run-continues-on-dalal-street-as-sensex-surges-1000-points-2698085-2025-03-24",
      "headline": "Sensex surges 1,000 points as FIIs chase Dalal Street rallyBull run on Dalal Street: The S&P BSE Senses added 1,003.06 points to 77,908.57, while the NSE Nifty50 gained 286.95 points to 23,637.35 as of 12:37 pm. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-middle-class-under-pressure-cautions-saurabh-mukherjea-what-are-its-key-challenges-2698060-2025-03-24",
      "headline": "Is India's middle class losing momentum? See what this expert saysThe rise of automation is a growing threat to jobs. Machines are replacing traditional roles in both factories and offices. The next phase of automation, powered by generative AI, is expected to accelerate job displacement across multiple sectors, Saurabh Mukherjea said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/fii-selling-stop-return-to-dalal-street-why-comeback-on-sensex-nifty-key-reasons-2698064-2025-03-24",
      "headline": "Why foreign investors are rushing back to bet on Dalal Street FIIs returning to Dalal Street has given a sharp boost to domestic investors, with the main indices extending gains for the sixth consecutive session. The S&P BSE Sensex was up 950 points and Nifty rose 273 points."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/singer-songwriter-lizzo-to-portray-sister-rosetta-tharpe-in-upcoming-mgm-biopic-rosetta-2698496-2025-03-25",
      "headline": "Singer Lizzo to portray Sister Rosetta Tharpe in upcoming biopicAmazon MGM Studios casts Lizzo as Sister Rosetta Tharpe in a biopic highlighting the musician's legacy. The film aims to showcase Tharpe's influence on rock music, often overlooked in history."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/chhaava-in-parliament-prime-minister-narendra-modi-attend-special-screening-of-vicky-kaushal-film-2698480-2025-03-24",
      "headline": "Chhaava in Parliament: PM Modi to attend special screening of Vicky Kaushal's filmChhaava, featuring Vicky Kaushal and based on the life of Chhatrapati Sambhaji Maharaj, will be screened in Parliament. Prime Minister Narendra Modi, Home Minister Amit Shah, and other key leaders are expected to attend this special event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-white-lotus-season-3-full-episode-schedule-streaming-details-glbs-2698475-2025-03-24",
      "headline": "'The White Lotus' Season 3: Full episode schedule & streaming detailsThe White Lotus Season 3 is wrapping up with two episodes left. Airing Sundays on HBO and Max, the Thailand-set drama reaches its finale on April 6.  \r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/grimes-opens-up-about-adhd-autism-and-privacy-concerns-over-musks-kids-glbs-2698454-2025-03-24",
      "headline": "Grimes opens up about ADHD, autism, and privacy concerns over Musk's kidsGrimes revealed her ADHD and autism diagnosis, criticised online mental health discourse, and expressed concerns over her children's privacy, urging legal protections against public exposure. She also emphasised reading's impact on ADHD.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/selena-gomez-benny-blanco-on-planning-their-wedding-jay-shetty-podcast-2698437-2025-03-24",
      "headline": "Selena Gomez-Benny Blanco on planning their wedding: There's just so much going onSelena Gomez and Benny Blanco opened up about their wedding plans on Jay Shetty's podcast. The couple is taking a relaxed approach due to their hectic schedules."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/actor-aasif-sheikh-collapsed-during-bhabiji-ghar-par-hain-shoot-heres-the-truth-exclusive-2698416-2025-03-24",
      "headline": "Actor Aasif Sheikh collapsed during Bhabiji shoot? Here's the truthActor Aasif Sheikh's health sparked concerns after rumours of hospitalisation emerged. However, sources clarify that the reports are exaggerated, and the actor is in good health."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bhabiji-ghar-par-hai-writer-manoj-santoshi-dies-at-49-due-to-liver-ailment-2698395-2025-03-24",
      "headline": "Bhabiji Ghar Par Hai writer Manoj Santoshi dies at 49 due to liver ailmentRenowned TV writer Manoj Santoshi, known for his work on popular sitcoms, died at 49 due to liver complications. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dragon-director-ashwath-marimuthu-meets-thalapathy-vijay-calls-it-dream-come-true-2698370-2025-03-24",
      "headline": "Dragon director Ashwath Marimuthu meets Thalapathy Vijay, calls it a dream come trueDirector Ashwath Marimuthu met his idol, Tamil superstar Thalapathy Vijay, and shared the emotional significance of the encounter with fans. The meeting was a dream come true for Marimuthu, who was deeply moved by Vijay's praise for his work."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/athiya-shetty-kl-rahul-welcome-baby-girl-2698388-2025-03-24",
      "headline": "Athiya Shetty, KL Rahul become parents to baby girlBollywood star Athiya Shetty and cricketer KL Rahul have become parents to a baby girl. The couple, married since January 2023, shared the happy news online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/jr-ntr-dances-his-heart-out-to-devara-song-ahead-of-its-japan-release-2698351-2025-03-24",
      "headline": "Jr NTR dances his heart out to Devara song ahead of its Japan release. WatchTelugu star Jr NTR has been busy promoting his last release, Devara, in Japan. The movie, also starring Janhvi Kapoor and Saif Ali Khan, will soon release in the country."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jonas-brothers-announce-jonas20-living-the-dream-tour-see-full-dates-glbs-2698365-2025-03-24",
      "headline": "Jonas Brothers announce JONAS20: Living the Dream tour – See full datesThe Jonas Brothers announced their JONAS20: Living the Dream Tour, celebrating 20 years of music. The 43-date North American tour kicks off August 10, featuring Marshmello, The All-American Rejects, and Boys Like Girls.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/jennifer-lopez-emme-shine-at-othello-broadway-premiere-in-matching-black-outfits-glbs-2698353-2025-03-24",
      "headline": "Jennifer Lopez & Emme shine at Othello Broadway premiere in matching black outfitsJennifer Lopez and Emme attended Broadway's Othello premiere in stylish black outfits. The event featured star guests, including Joe Biden. Lopez reflected on motherhood while celebrating Emme's 17th birthday.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-residence-review-uzo-aduba-randall-park-giancarlo-esposito-shine-in-netflix-whodunnit-2698324-2025-03-24",
      "headline": "The Residence review: Uzo Aduba, Randall Park shine in sharp whodunnitReleased-Thu Mar 20, 2025Shondaland's latest offering - The Residence - is a gripping murder mystery set in the iconic White House. Led by Uzo Aduba as detective Cordelia Cupp, the series combines satire and social commentary with suspenseful storytelling."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/suits-la-episode-5-review-no-harvey-spector-but-ted-black-finally-delivers-sass-swag-and-story-worth-the-wait-2698336-2025-03-24",
      "headline": "Suits LA finally delivers as episode 5 brings sass, swag, and story worth the waitAfter the wait of four episodes, we get the one justifying what the 'Suits' franchise stands for. Ted Black is making you sit up and notice his world, and you are finally into it. Check out a no-spoiler commentary on the latest episode. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/bollywood/story/emraan-hashmi-reacts-after-pakistani-actor-javed-sheikh-calls-him-rude-2698297-2025-03-24",
      "headline": "Emraan Hashmi reacts after Pakistani actor Javed Sheikh calls him rudeActor Emraan Hashmi has reacted to veteran Pakistani actor Javed Sheikh's claims that he was rude to him during the shoot of Jannat. Hashmi said that the claims are false. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/thalapathy-vijay-jana-nayagan-to-be-a-grand-pongal-release-check-announcement-2698306-2025-03-24",
      "headline": "Thalapathy Vijay's Jana Nayagan to be a grand Pongal release. Check announcementThalapathy Vijay shared the new poster of his film 'Jana Nayagan' online. The poster revealed the release date of the film, which is supposed to be his last. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/ott/story/oscar-winner-christoph-waltz-joins-only-murders-in-the-building-season-5-2698257-2025-03-24",
      "headline": "Oscar winner Christoph Waltz joins Only Murders in the Building Season 5Two-time Oscar winner Christoph Waltz is set to appear in Season 5 of Hulu's Only Murders in the Building. The Austrian actor will join a cast that includes Keegan-Michael Key."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-says-sikandar-will-earn-rs-100-200-crore-irrespective-of-its-content-2698291-2025-03-24",
      "headline": "Salman Khan says Sikandar will earn Rs 100-200 crore irrespective of its contentActor Salman Khan was speaking to the media at the trailer launch of 'Sikandar' when he commented on the expected box office performance of the film. The actor shared that it will end up collecting at least Rs 200 crore irrespective of whether it is good or bad. Watch the video inside. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sunny-deol-says-high-time-deols-got-work-in-bollywood-we-were-waiting-for-it-2698262-2025-03-24",
      "headline": "Sunny Deol says 'high time' Deols got work in Bollywood: We were waiting for itActor Sunny Deol commented on the success enjoyed by him, his brother, Bobby Deol, and father, Dharmendra with newfound popularity in the industry. He spoke at the trailer launch of 'Jaat'. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/the-habitat-kunal-kamra-khar-mumbai-studio-ransacking-eknath-shinde-row-2698459-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Not against law to poke fun at leaders: Kunal Kamra amid Eknath Shinde joke rowComedian Kunal Kamra, responding to the controversy over his remarks on Eknath Shinde, asserted that no political party controls his comedy and what he has to say. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/donald-trump-tariff-threat-venezuela-crude-oil-imports-india-impact-reciprocal-levies-2698464-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump's fresh 25% tariff threat linked to Venezuelan oil. Trouble for India?US President Donald Trump's \"secondary tariff\" on countries buying Venezuelan oil will come into effect on April 2, the same day when reciprocal tariffs on US's trading partners, including India, will be imposed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/canada-election-india-interference-meddle-china-mark-carney-intelligence-report-2698514-2025-03-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Canada claims India may seek to meddle in election: 'Has intent to interfere'Canada is set to hold its general election on April 24 after newly appointed Prime Minister Mark Carney called for a snap poll on April 28. Ottawa has alleged that New Delhi may attempt to interfere in the elections, as relations between the two nations have hit an all-time low."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-lsg-score-ashutosh-sharma-vipraj-vizag-thriller-2698470-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "DC vs LSG: Ashutosh Sharma finishes in style for Delhi in IPL 2025's first thrillerIPL 2025, Delhi vs Lucknow: Ashutosh Sharma did his reputation of a finisher no harm as he single-handedly helped Delhi Capitals steal victory from the jaws of defeat in the season's first thriller. Rishabh Pant's Lucknow lost despite posting 209 on the board. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/athiya-shetty-kl-rahul-welcome-baby-girl-2698388-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Athiya Shetty, KL Rahul become parents to baby girlBollywood star Athiya Shetty and cricketer KL Rahul have become parents to a baby girl. The couple, married since January 2023, shared the happy news online."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-awami-league-revival-plan-is-deepening-rift-in-bangladesh-2698171-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How Awami League revival 'plan' is deepening rift in BangladeshThe political landscape is abuzz even as the army refutes its chief Gen. Waker-uz-Zaman brought up the matter with key leaders of the new National Citizen Party\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-yemen-war-plan-journalist-the-atlantic-white-house-defence-secretary-leak-2698517-2025-03-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Top Trump officials mistakenly share US war plans with journalistThe Trump administration accidentally sent its war plans to a group chat that included a journalist, an incident that Democrats labelled a major national security concern."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/happened-in-flow-of-show-i-realise-i-was-wrong-samay-raina-to-cops-on-latent-row-2698455-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Happened in flow of show, I realise I was wrong: Samay Raina to cops on Latent rowComedian Samay Raina appeared before Maharashtra Cyber Police over the India's Got Latent case, expressing regret for his remarks. He admitted his mistake, promised caution, and said the controversy affected his mental state.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/kunal-kamra-comic-timing-gone-wrong-for-bitter-or-verse-eknath-shinde-controversy-2698309-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "For bitter or verse, Kamra's comic timing gone wrongComics have a way with words and of telling the bitter truth. But once personal bitterness takes full control, comedy shrinks in size and becomes politics in disguise. For a comic, politics is a terrific slave but a terrible master."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/allahabad-high-court-gives-centre-4-weeks-to-file-status-report-on-rahul-gandhis-citizenship-2698303-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Centre given 4 weeks for status report on plea over Rahul Gandhi's citizenshipIn 2019, BJP leader Subramanian Swamy had alleged that Rahul Gandhi had declared himself a British citizen in documents submitted to British authorities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-lsg-who-is-vipraj-nigam-uttar-pradesh-all-rounder-2698503-2025-03-25#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Who is Vipraj Nigam? Uttar Pradesh all-rounder new star for Delhi CapitalsDelhi Capitals' young all-rounder Vipraj Nigam made a stunning IPL debut, playing a crucial role in their thrilling 1-run win over Lucknow Super Giants, showcasing his batting and bowling prowess in a high-pressure match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/judges-are-caesars-wife-allahabad-bar-wants-justice-varma-impeached-in-cash-row-2698289-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Judges are Caesar's wife: Allahabad Bar wants Justice Varma impeached in cash rowThe Allahabad High Court Bar Association demanded a review of Delhi High Court judge Justice Yashwant Varma's rulings and his impeachment following a cash discovery at his Delhi residence. The association argued that judicial integrity was at stake following the incident."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/adolescence-breathtaking-third-episode-netflix-stephen-graham-owen-cooper-2698174-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "In praise of Adolescence's breathtaking third episode: A perfect stormStephen Graham and Jack Thorne's Adolescence is a masterclass in filmmaking. However, its pivotal third episode deserves a special appreciation note. The show, starring Owen Cooper in the lead, is streaming on Netflix. (Spoilers ahead). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-nitishs-national-anthem-gaffe-triggered-a-battle-of-perception-in-bihar-poll-season-2698175-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How Nitish's national anthem gaffe triggered a battle of perception in Bihar poll seasonThe RJD wants his resignation, ally BJP dismisses it as a mere ''coincidence' while the Bihar CM's party JD(U) reads deeper political motives into the row\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/cctv-meerut-murder-case-victim-bike-friend-chilling-murder-wife-lover-police-visuals-2698279-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "CCTV shows Meerut man on bike with friend hours before wife, her lover killed himCCTV footage showed Saurabh Rajput and his friend on a bike entering a street to get food at 11.49 pm on March 3 before he was murdered by his wife Muskan Rastogi and her lover Sahil after a few hours."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/kunal-kamra-to-abusive-eknath-shinde-supporter-in-viral-call-tamil-nadu-shinde-sena-mumbai-studio-2698361-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "I stay in Tamil Nadu: Clip of 'Kunal Kamra-Shinde supporter' call goes viralComedian Kunal Kamra was threatened in a purported call over his jokes mocking Deputy Chief Minister Eknath Shinde. India Today cannot verify the authenticity of the viral clip. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bryan-johnson-face-sexual-allegation-confidentiality-agreement-blueprint-2698141-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Walked naked, discussed erection at work: Bryan Johnson faces sensational chargesTech entrepreneur Bryan Johnson faces allegations of inappropriate workplace behaviour, including nudity and sexual conversations, with former employees challenging his confidentiality agreements.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/boeing-lays-off-employees-bengaluru-technology-centre-under-global-workforce-reduction-2698349-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "180 Boeing employees laid off in India under global workforce reduction: ReportAs part of the global workforce reduction, up to 180 staff at the Boeing India Engineering Technology Center in Bengaluru were laid off in the December quarter of 2024."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/news/story/12-year-old-us-boy-builds-nuclear-fusion-reactor-gets-visit-from-fbi-2697413-2025-03-22#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "12-year-old builds nuclear fusion reactor, gets visit from FBI12-year-old Jackson Oswalt, from Memphis, US, has built a nuclear fusion reactor in his bedroom and made a Guinness World Record for the youngest person to achieve fusion. Later on, he got a visit from the FBI to make sure all was good. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/salary-daily-allowance-pension-hike-of-mps-parliament-april-2023-2698249-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Centre notifies 24% hike in salaries, pensions for MPs and ex-ParliamentariansSitting MPs will receive a monthly salary of Rs 1.24 lakh as against Rs 1 lakh they received earlier. The pension for former MPs was hiked from Rs 25,000 per month to Rs 31,000 per month."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/perplexity-ai-ceo-aravind-srinivas-explains-why-he-never-explored-bengaluru-nikhil-kamath-podcast-2698282-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Perplexity AI CEO explains why he never explored Bengaluru on Nikhil Kamath's podcastPerplexity AI CEO Aravind Srinivas explained why he never explored Bengaluru on Nikhil Kamath's podcast. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/karnataka-school-student-religious-remark-science-exhibition-probe-2698383-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Short clothes lead to…' Karnataka student's project at science fair sparks probeA viral video of a Karnataka school student making a controversial religious remark during a science exhibition has sparked outrage, raising concerns over education and prompting a government investigation.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kunal-kamra-eknath-shinde-controversy-karma-is-a-bitch-kangana-ranaut-bungalow-demolition-shiv-sena-sanjay-raut-2698212-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kamra's Kangana karma comes back to bite himJokes on Shiv Sena leader Eknath Shinde have landed stand-up comic Kunal Kamra in a spot. As people defended his right to free speech, some were quick to point out how he cheered on the BMC as it demolished actor Kangana Ranaut's bungalow in 2020. Though karma might have returned to bite Kamra, his right to free speech should be defended by all."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/dk-shivakumar-bjp-spar-over-constitution-change-remarks-2698221-2025-03-24#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "DK Shivakumar says his 'Constitution change' remark misquoted: What's the row?As BJP claims DK Shivakumar hinted at changing the Constitution for religion-based reservations, the Karnataka Deputy Chief Minister vehemently denied the charge. He called it the Centre's political ploy to take the focus away from more pressing matters. Here's what has happened so far.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/chhaava-in-parliament-prime-minister-narendra-modi-attend-special-screening-of-vicky-kaushal-film-2698480-2025-03-24",
      "headline": "Chhaava in Parliament: PM Modi to attend special screening of Vicky Kaushal's filmChhaava, featuring Vicky Kaushal and based on the life of Chhatrapati Sambhaji Maharaj, will be screened in Parliament. Prime Minister Narendra Modi, Home Minister Amit Shah, and other key leaders are expected to attend this special event."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/hollywood/story/grimes-opens-up-about-adhd-autism-and-privacy-concerns-over-musks-kids-glbs-2698454-2025-03-24",
      "headline": "Grimes opens up about ADHD, autism, and privacy concerns over Musk's kidsGrimes revealed her ADHD and autism diagnosis, criticised online mental health discourse, and expressed concerns over her children's privacy, urging legal protections against public exposure. She also emphasised reading's impact on ADHD.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dragon-director-ashwath-marimuthu-meets-thalapathy-vijay-calls-it-dream-come-true-2698370-2025-03-24",
      "headline": "Dragon director Ashwath Marimuthu meets Thalapathy Vijay, calls it a dream come trueDirector Ashwath Marimuthu met his idol, Tamil superstar Thalapathy Vijay, and shared the emotional significance of the encounter with fans. The meeting was a dream come true for Marimuthu, who was deeply moved by Vijay's praise for his work."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/athiya-shetty-kl-rahul-welcome-baby-girl-2698388-2025-03-24",
      "headline": "Athiya Shetty, KL Rahul become parents to baby girlBollywood star Athiya Shetty and cricketer KL Rahul have become parents to a baby girl. The couple, married since January 2023, shared the happy news online."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-lsg-who-is-vipraj-nigam-uttar-pradesh-all-rounder-2698503-2025-03-25",
      "headline": "Who is Vipraj Nigam? Uttar Pradesh all-rounder new star for Delhi CapitalsDelhi Capitals' young all-rounder Vipraj Nigam made a stunning IPL debut, playing a crucial role in their thrilling 1-run win over Lucknow Super Giants, showcasing his batting and bowling prowess in a high-pressure match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ipl-2025-gt-vs-pbks-shubman-gill-press-conference-2698498-2025-03-25",
      "headline": "Mohammed Siraj needs to be himself, don't need him to replace Shami: GillGujarat Titans Shubman Gill said that Mohammed Siraj is not here to replace Mohammed Shami in the line-up. The GT captain argued that Siraj needs to be true to his identity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-ashutosh-sharma-vipraj-nigam-dc-vs-lsg-2698494-2025-03-24",
      "headline": "Watch: Pietesen jumps out in joy as Ashutosh hits winning six in Vizag thrillerDelhi Capitals coaches Hemang Badani and Kevin Pietersen jumped out of their chairs as Ashutosh Sharma pulled off an epic chase against Lucknow on Monday, March 24. Senior batter Faf du Plessis also had high praise reserved for the players."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nhl-kings-surge-past-bruins-with-five-straight-goals-glbs-2698472-2025-03-24",
      "headline": "NHL: Kings surge past bruins with five straight goalsTrailing early, the Los Angeles Kings erupted for five straight goals to defeat the Boston Bruins, extending their winning streak and solidifying their playoff positioning in a dominant performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-dc-vs-lsg-score-ashutosh-sharma-vipraj-vizag-thriller-2698470-2025-03-24",
      "headline": "DC vs LSG: Ashutosh Sharma finishes in style for Delhi in IPL 2025's first thrillerIPL 2025, Delhi vs Lucknow: Ashutosh Sharma did his reputation of a finisher no harm as he single-handedly helped Delhi Capitals steal victory from the jaws of defeat in the season's first thriller. Rishabh Pant's Lucknow lost despite posting 209 on the board. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/titans-sign-veteran-kicker-joey-slye-in-bid-for-stability-glbs-2698463-2025-03-24",
      "headline": "NFL: Titans sign veteran kicker Joey Slye in bid for stabilityThe Tennessee Titans have agreed to a deal with kicker Joey Slye, aiming to solidify their special teams. Slye, a veteran with multiple teams, brings experience and reliability to Tennessee."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/ncaa-tournament-minnesota-set-to-hire-colorado-states-niko-medved-glbs-2698456-2025-03-24",
      "headline": "NCAA Tournament: Minnesota set to hire Colorado state's Niko MedvedReports indicate Minnesota is finalizing a deal with Niko Medved, bringing the successful Colorado State coach back to his home state to lead the Gophers basketball program."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/power-conferences-dominate-sweet-16-features-no-mid-majors-for-first-time-2698452-2025-03-24",
      "headline": "Sweet 16 belongs to power conferences for first time everFor the first time in NCAA Tournament history, only power conference teams remain in the Sweet 16, marking a significant shift as mid-majors are completely shut out."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kl-rahul-athiya-shetty-baby-girl-congratulations-wishes-2698446-2025-03-24",
      "headline": "KL Rahul and Athiya Shetty welcome baby girl, Delhi Capitals lead wishesIPL 2025: KL Rahul and Athiya Shetty became parents to a baby girl on Monday. Rahul took a break from the Indian Premier League to be with his wife during the birth of their first child. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nikola-jokic-nba-injury-updates-expected-to-return-during-homestand-glbs-2698430-2025-03-24",
      "headline": "Nikola Jokic NBA injury updates: Expected to return during homestandMichael Malone, the head coach of the Denver Nuggets confirmed the return of the star center Nikola Jokic during the team's five-game homestand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-jos-buttler-not-a-problem-shubman-gill-gujarat-titans-vs-punjab-kings-2698426-2025-03-24",
      "headline": "No team will have a problem with Jos Buttler: Gujarat's Shubman GillShubman Gill backs Jos Buttler as a key asset for Gujarat Titans in IPL 2025, dismissing concerns over his recent form and uncertain batting position ahead of their opening clash against Punjab Kings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/ncaa-tournament-minnesota-set-to-hire-colorado-states-niko-medved-glbs-2698456-2025-03-24",
      "headline": "NCAA Tournament: Minnesota set to hire Colorado state's Niko MedvedReports indicate Minnesota is finalizing a deal with Niko Medved, bringing the successful Colorado State coach back to his home state to lead the Gophers basketball program."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/power-conferences-dominate-sweet-16-features-no-mid-majors-for-first-time-2698452-2025-03-24",
      "headline": "Sweet 16 belongs to power conferences for first time everFor the first time in NCAA Tournament history, only power conference teams remain in the Sweet 16, marking a significant shift as mid-majors are completely shut out."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-kl-rahul-athiya-shetty-baby-girl-congratulations-wishes-2698446-2025-03-24",
      "headline": "KL Rahul and Athiya Shetty welcome baby girl, Delhi Capitals lead wishesIPL 2025: KL Rahul and Athiya Shetty became parents to a baby girl on Monday. Rahul took a break from the Indian Premier League to be with his wife during the birth of their first child. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nikola-jokic-nba-injury-updates-expected-to-return-during-homestand-glbs-2698430-2025-03-24",
      "headline": "Nikola Jokic NBA injury updates: Expected to return during homestandMichael Malone, the head coach of the Denver Nuggets confirmed the return of the star center Nikola Jokic during the team's five-game homestand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-jos-buttler-not-a-problem-shubman-gill-gujarat-titans-vs-punjab-kings-2698426-2025-03-24",
      "headline": "No team will have a problem with Jos Buttler: Gujarat's Shubman GillShubman Gill backs Jos Buttler as a key asset for Gujarat Titans in IPL 2025, dismissing concerns over his recent form and uncertain batting position ahead of their opening clash against Punjab Kings."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}