{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-slashes-import-duty-on-bourbon-whiskey-to-50-per-cent-pm-modi-donald-trump-talks-2680358-2025-02-15",
      "headline": "India slashes import duty on bourbon whisky to 100% after Trump's criticismThe reduction in customs duty on bourbon whisky was notified on February 13 just ahead of Prime Minister Narendra Modi's talks with US President Donald Trump."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/what-is-digital-lending-5-key-benefits-you-should-know-2680169-2025-02-14",
      "headline": "What is digital lending? 5 key benefits you should know Digital lending platforms make use of advanced technology, thereby making the loan process faster, simpler and more efficient."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-has-it-really-been-simplified-for-taxpayers-2680087-2025-02-14",
      "headline": "New Income Tax bill: Has it really been simplified for taxpayers?The proposed income tax bill seeks to simplify and revamp the Income Tax Act of 1961, which has often been criticised for its complexity, making it challenging for ordinary taxpayers to navigate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/upi-transactions-changes-from-february-15-all-you-need-to-know-2680055-2025-02-14",
      "headline": "New UPI transaction rule: All you need to know about auto chargeback processThe changes are primarily regarding auto acceptance and rejection of chargebacks, thereby making the system more efficient."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-nifty-end-lower-fiis-continue-to-exit-dalal-street-2680072-2025-02-14",
      "headline": "Sensex, Nifty end lower as FIIs continue to exit Dalal StreetThe S&P BSE Sensex lost 199.76 points to end at 75,939.21, while the NSE Nifty50 lost 102.15 points to close at 22,929.25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vodafone-idea-stock-price-tumbles-6-today-what-triggered-the-slide-2680054-2025-02-14",
      "headline": "Explained: Why Vodafone Idea share price tumbled nearly 6%VI shares were down 5.09% to Rs 8.22 at around 3:15 pm. Earlier during the trading session, shares of the telecom operator fell as much as 6%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ambanis-top-asias-rich-list-here-are-other-indians-who-made-it-mistry-birla-bajaj-hinduja-2680007-2025-02-14",
      "headline": "Ambani family richest in Asia. Check which Indian families made the top 20The Ambani family tops Bloomberg's list of Asia's 20 richest families. The family's flagship company, Reliance Industries, is presently headed by Mukesh Ambani, son of late industrialist Dhirubhai Ambani. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-curbs-on-new-india-co-operative-bank-how-does-it-impact-customers-what-to-do-2680031-2025-02-14",
      "headline": "RBI curbs on New India Co-operative Bank: How does it impact customers?New India Co-operative Bank has been struggling with financial losses in recent years. According to its annual report, the bank recorded a loss of Rs 22.78 crore in the financial year ending March 2024, following a loss of Rs 30.75 crore in the previous year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/new-india-co-operative-banks-financial-operations-halted-after-notice-from-rbi-2680025-2025-02-14",
      "headline": "New India Co-operative Bank's financial operations halted after notice from RBIThe Reserve Bank of India (RBI) has restricted Mumbai-based New India Co-operative Bank from issuing loans, accepting deposits, or permitting withdrawals for six months. The move comes amid concerns over the bank's financial health and liquidity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/not-trump-tariffs-but-this-is-whats-making-stock-market-investors-anxious-fii-selling-stock-market-fall-2680000-2025-02-14",
      "headline": "Not Trump's tariffs, but this is what's making stock market investors anxiousThe stock market jitters have occurred despite government measures, including tax relief and the Reserve Bank of India's (RBI) decision to reduce the repo rate by 25 basis points."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/rbi-issues-notice-to-halt-all-financial-operations-of-new-india-co-operative-bank-2679968-2025-02-14",
      "headline": "RBI issues notice to halt all financial operations of New India Co-operative BankRBI's move comes after what it called 'recent material developments' at the bank. Although the central bank did not provide specific details, it stated that these directions were issued to protect depositors' interests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-all-your-questions-answered-2679917-2025-02-14",
      "headline": "New income tax bill: All you questions answeredThe new income tax bill, compared to the Income Tax Act, 1961, is nearly half the size, containing 259,676 words, 23 chapters, 536 sections, 57 tables and 46 formulae."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-down-500-points-nifty-falls-3-things-you-need-to-know-2679965-2025-02-14",
      "headline": "Sensex tanks over 600 points: Why is the stock market down today?The Sensex and Nifty fell sharply after rising in early trade. Here are three things you need to know about today's stock market weakness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/explained-why-senco-gold-share-price-crashed-20-percent-after-q3-results-2679889-2025-02-14",
      "headline": "Explained: Why Senco Gold shares crashed 20% after Q3 results Senco Gold share price: In the third quarter, Senco Gold reported a nearly 70% drop in consolidated net profit to Rs 33 crore, compared to Rs 109 crore in the same period last year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jiocinema-disney-hotstar-merge-to-launch-jiohotstar-what-it-means-for-you-subscription-plans-ott-2679869-2025-02-14",
      "headline": "JioCinema, Disney+ Hotstar merge to launch JioHotstar: What it means for youReliance Industries and Walt Disney's India business finalised their merger in November 2024, creating a joint venture with Viacom18 Media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-bell-sensex-nifty-gain-as-us-india-trade-talks-show-positive-signs-2679851-2025-02-14",
      "headline": "Sensex, Nifty gain as US-India trade talks show positive signsThe S&P BSE Sensex was up 86.75 points to 76,225.72, while the NSE Nifty50 added 12.50 points to 23,043.90 as of 9:46 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-stock-market-nasdaq-rises-1-percent-on-inflation-relief-tesla-soars-6-nvidia-up-4-2679839-2025-02-14",
      "headline": "Nasdaq rises over 1% on inflation relief; Tesla soars 6%, Nvidia up 4%The Nasdaq Composite jumped 1.5%, the S&P 500 gained 1.04%, and the Dow Jones Industrial Average rose 0.77%"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-explained-tabled-parliament-what-is-changing-and-what-is-not-2679826-2025-02-14",
      "headline": "New Income Tax bill explained: What's changing and what's notNew Income Tax bill: It aims to simplify the existing Income Tax Act, 1961, by making it more structured and easier to understand. If passed, the new law will come into effect from April 1, 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/epfo-likely-to-maintain-825-percent-interest-rate-on-pf-depsoits-2679563-2025-02-13",
      "headline": "EPFO likely to maintain 8.25% interest rate on PF deposits EPFO interest rate: In 2024-25, EPFO processed over 50.8 million claims worth Rs 2.05 lakh crore when compared to 44.5 million claims amounting to Rs 1.82 lakh crore settled in the previous year, as per the official data."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-green-energy-exits-sri-lanka-wind-power-deal-stock-down-1-percent-2679469-2025-02-13",
      "headline": "Adani Green Energy exits Sri Lanka wind power deal; stock down 1%Adani Green Energy shares: As per the agreement with Sri Lanka, Adani Green was to construct two wind power projects in Mannar town and Pooneryn village, both located in the northern province of the country. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-erase-gains-to-end-lower-as-it-stocks-weigh-in-adani-enterprises-down-5-percent-2679429-2025-02-13",
      "headline": "Sensex, Nifty erase gains to end lower as IT stocks weigh in on stock marketsThe S&P BSE Sensex was down by 32.11 points to close at 76,138.97, while the NSE Nifty50 lost 13.85 points to end at 23,031.40. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/finance-minister-nirmala-sitharaman-introduces-new-income-tax-bill-in-lok-sabha-2679394-2025-02-13",
      "headline": "Finance Minister Nirmala SItharaman introduces new Income Tax Bill in Lok SabhaFinance Minister Nirmala Sitharaman tabled the new Income Tax bill in Lok Sabha amid the huge uproar by the opposition MPs. The bill will now be referred to the Select Committee of Lok Sabha for further review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/finance-minister-nirmala-sitharaman-introduces-new-income-tax-bill-in-lok-sabha-overhaul-2679363-2025-02-13",
      "headline": "New Income Tax Bill tabled in Lok Sabha, faces select panel reviewThe government, in a bid to simplify the present Income Tax Act, 1961, has introduced a new income tax bill in Parliament today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/explained-why-are-large-cap-mutual-funds-back-in-demand-stock-market-volatility-2679356-2025-02-13",
      "headline": "Explained: Why are large-cap mutual funds back in demandWith small-cap and mid-cap stocks experiencing corrections, investors are moving towards large-cap funds, which are considered safer and more stable in volatile times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/quality-power-ipo-10-things-investors-must-know-before-subscribing-2679309-2025-02-13",
      "headline": "Quality Power IPO: 10 things investors must know before subscribing Quality Power Electrical Equipments Limited offers high-voltage electrical equipment and solutions for grid connectivity and energy transition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-how-will-it-make-taxpayers-lives-simpler-2679254-2025-02-13",
      "headline": "New Income Tax Bill: How will it make taxpayers' lives simpler?The new income tax bill would be almost half of the current law, as the existing Income Tax Act,1961 contained 880 pages when it came into existence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-gains-450-points-3-reasons-why-stock-market-is-rising-today-inflation-data-pm-modi-us-visit-2679218-2025-02-13",
      "headline": "Sensex gains 500 points: 3 reasons why stock market is rising todayAs of 10:48 AM, the S&P BSE Sensex was up 47.85 points at 76,644.93, while the NSE Nifty50 gained 137.75 points to 23,183.00."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/opening-bell-sensex-nifty-up-as-cooling-inflation-boosts-market-sentiment-share-market-today-2679189-2025-02-13",
      "headline": "Sensex, Nifty open higher as cooling inflation boosts market sentimentShare Market Today: The S&P BSE Sensex was up 163.21 points to 76,334.39, while the NSE Nifty50 gained 46.25 points to 23,091.50 as of 9:30 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ajax-engineering-ipo-check-allotment-status-online-guide-listing-date-latest-gmp-2679171-2025-02-13",
      "headline": "Ajax Engineering IPO: Check allotment status, listing date and latest GMPAjax Engineering IPO allotment status: The IPO price band was set at Rs 599 to Rs 629 per share. The minimum lot size for the application was 23 shares. For retail investors, the minimum investment required was Rs 13,777."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-2025-to-be-tabled-today-parliament-heres-what-you-can-expect-2679153-2025-02-13",
      "headline": "New Income Tax Bill to be tabled today: Here's what you can expectNew Income Tax Bill is expected to come into effect on April 1, 2026. The bill aims to simplify tax laws, remove outdated provisions, and make compliance easier for taxpayers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/can-a-married-couple-save-more-taxes-using-both-old-and-new-tax-regime-2678890-2025-02-13",
      "headline": "Can a married couple save more taxes using both old and new tax regime?Married couples need to determine which tax regime offers lower tax liability for each spouse considering their income structure and deductions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-retail-inflation-dips-to-431-percent-in-january-2678907-2025-02-12",
      "headline": "India's retail inflation dips to 4.31% in January, hits a five-month lowThe country's retail inflation witnessed a drop in January majorly due to declining food prices, according to data released by the National Statistics Office on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-sensex-nifty-dalal-street-2678823-2025-02-12",
      "headline": "Sensex, Nifty recover sharply but end in red; M&M falls 3%The S&P BSE Sensex settled 122.52 points lower at 76,171.08. Earlier in the day, the 30-share index had plunged 850 points. Nifty, too, recovered strongly to end 26.55 points lower at 23,045.25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mutual-fund-inflows-see-slight-dip-in-january-heres-why-2678801-2025-02-12",
      "headline": "Mutual fund inflows see slight dip in January. Here's whyThe flows declined 3.6% month-on-month to 396.88 billion rupees ($4.57 billion) from 411.56 billion rupees in December 2024, according to data by the Association of Mutual Funds in India (AMFI)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-to-be-simpler-and-clearer-likely-to-be-presented-tomorrow-2678762-2025-02-12",
      "headline": "New Income Tax Bill to introduce simpler 'tax year' concept: All you need to knowWhen the Income Tax Act of 1961 came into being it had 880 pages. Over the years, the act contained several amendments introduced in the various budgets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-trading-strategy-what-should-investors-do-key-things-to-know-2678731-2025-02-12",
      "headline": "Stock market bloodbath: Should buy the dip, exit or stay invested? The stock market correction has particularly hit retail investors, many of whom are contemplating selling their holdings at a loss. But is that the right move? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/after-90-hour-workweek-remark-l-and-t-chief-stirs-wfh-debate-2678704-2025-02-12",
      "headline": "After 90-hour workweek remark, L&T chief stirs work-from-home debateThis is not the first time that the L&T Chairman's remarks have sparked a debate.  Earlier, he advocated a 90-hour workweek, which drew huge criticism. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/will-retail-inflation-cool-down-further-in-january-here-is-all-you-need-to-know-2678656-2025-02-12",
      "headline": "Will retail inflation cool down further in January? Here's all you need to know The RBI mentioned continued reduction in rice prices and sharp corrections in the prices of vegetables, especially in the prices of onions, potatoes and tomatoes, in its January 2025 Bulletin. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/larsen-and-toubro-cmd-sn-subrahmanyan-raises-alarm-over-labour-shortage-blames-welfare-schemes-2678648-2025-02-12",
      "headline": "L&T chief stirs fresh row with remark on labour crisis: Workers unwilling to moveSpeaking at CII's Mystic South Global Linkages Summit 2025 in Chennai, Subrahmanyan spoke about the difficulties faced by the construction industry in hiring and mobilising workers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-down-over-700-points-nifty-falls-4-factors-behind-stock-market-crash-2678623-2025-02-12",
      "headline": "Sensex falls 700 points: 4 reasons why stock market is falling todayStock market crash: The S&P BSE Sensex plunged over 850 points before trimming some losses, trading 748.13 points lower at 75,545.47 by 10:23 am. The NSE Nifty50 also slipped nearly 1%, reflecting weakness across broader markets."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/south-korean-actor-kim-sae-ron-found-dead-at-24-2680949-2025-02-16",
      "headline": "South Korean actor Kim Sae-ron, 24, found deadSouth Korean actor Kim Sae-ron, known for her roles in Bloodhounds and The Man from Nowhere, was found dead at her home in Seoul. She was 24. Authorities are investigating the circumstances of her death, with no signs of foul play reported yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-white-lotus-season-3-review-lisa-parker-posey-and-jason-isaacs-show-is-predictable-but-entertaining-2680925-2025-02-16",
      "headline": "The White Lotus S3 review: Predictable? Yes. Addictive? Also, yesReleased-Mon Feb 17, 2025The White Lotus Season 3 review: The White Lotus returns with a new season set in Thailand, offering a fresh cultural backdrop while retaining its biting satire on the ultra-rich. The series continues to entertain with its dark humour and ensemble cast, though its formula is starting to feel familiar. Read our full review. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/kanye-west-says-he-fought-5-hours-for-grammy-tickets-amid-guest-list-confusion-2680934-2025-02-16",
      "headline": "Kanye West says he fought 5 hours for Grammy tickets amid guest list confusionRapper Kanye West, in a post on X, revealed that he fought for five hours to secure Grammy tickets amid guest list chaos. This comes amid claims that Kanye arrived at the event uninvited. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/comedian-anubhav-singh-bassi-lucknow-show-cancelled-by-cops-law-and-order-concern-2680788-2025-02-16",
      "headline": "Comedian Anubhav Bassi's Lucknow show cancelled after warning over foul languageThe shows of comedian Anubhav Singh Bassi in Lucknow were cancelled due to concerns over inappropriate content, following a complaint by the UP Women's Commission vice-chairperson. Authorities cited potential law and order issues as reasons for the cancellation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/chum-darang-blushes-karan-veer-mehra-confesses-love-valentine-day-bigg-boss-18-2680773-2025-02-16",
      "headline": "Watch: Chum Darang blushes as Karan Veer confesses love on Valentine's DayKaran Veer Mehra confessed his love for Chum Darang on Valentine's Day. Chum shared a post from their romantic outing on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ed-sheeran-pauses-delhi-concert-for-fan-wears-team-india-dream-11-jersey-2680728-2025-02-16",
      "headline": "Watch: Ed Sheeran pauses Delhi concert as fan faints, wears Team India jerseyEd Sheeran wrapped up his India tour in Gurugram on February 15. He paused his concert briefly to help a fan who fainted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shalin-bhanot-reacts-to-indias-got-latent-row-advocates-self-discipline-2680673-2025-02-16",
      "headline": "Shalin Bhanot reacts to India's Got Latent Row, advocates self-disciplineTV actor Shalin Bhanot has reacted to the controversy surrounding YouTuber Ranveer Allahbadia's comment on India's Got Latent during the FDCI's India Men's Weekend in Jaipur. He emphasised self-discipline and responsibility.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/jay-z-reacts-after-rape-lawsuit-against-him-dropped-2680571-2025-02-15",
      "headline": "Today is a victory: Jay-Z reacts after rape lawsuit against him droppedIn a significant legal victory, rapper Jay-Z has seen a sexual assault lawsuit against him dismissed. The rapper and entrepreneur expressed relief and satisfaction over the court's decision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/mahabharat-actor-saurav-gurjar-threatens-ranveer-allahbadia-samay-raina-controversy-indias-got-latent-stmp-2680542-2025-02-15",
      "headline": "No one can save him: Mahabharat actor threatens Ranveer Allahbadia Actor Saurav Gurjar openly threatened Ranveer Allahbadia over his recent remarks on India's Got Latent. In a video message, the actor requested the government to take strict action against the podcaster. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/drake-releases-new-album-amid-feud-with-kendrick-lamar-fails-to-impress-fans-2680481-2025-02-15",
      "headline": "Drake releases new album amid feud with Kendrick Lamar, fails to impress fansDrake appears to have ended his feud with Kendrick Lamar in his latest album, but fans remain unimpressed. Released on Valentine's Day, the album in collaboration with PartyNextDoor marks his first new work since the Super Bowl halftime show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bharti-singh-supports-samay-raina-indias-got-latent-controversy-ranveer-allahbadia-good-talented-guy-2680407-2025-02-15",
      "headline": "Bharti Singh supports Samay Raina amid India's Got Latent controversyComedian Bharti Singh supported Samay Raina amid the India's Got Latent controversy. The comedian praised Samay and said that he is very sweet, and anyone can become his fan once they get to meet him. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-18-chum-darang-elvish-yadav-racist-remarks-2680401-2025-02-15",
      "headline": "Women's panel summons Elvish Yadav over remarks against Chum Darang on Feb 17YouTuber Elvish Yadav has been summoned by a women's panel following his racist remarks against Chum Darang. Yadav criticised her name and nationality, sparking courage among northeastern citizens. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/apoorva-mukhija-aka-rebel-kid-removed-from-official-iifa-ambassador-list-indias-got-latent-controversy-2680258-2025-02-14",
      "headline": "Apoorva Mukhija aka Rebel Kid removed from official IIFA ambassador listApoorva Mukhija, known as Rebel Kid, has been removed from the IIFA ambassador list following controversy over her appearance in Samay Raina's show, India's Got Latent. The decision follows threats from Karni Sena to disrupt her upcoming shoot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/fighting-zombies-to-playing-a-psychopath-the-many-faces-of-choi-woo-shik-2680124-2025-02-14",
      "headline": "Fighting zombies to playing a psychopath: The many faces of Choi Woo-shikLong before Choi Woo-shik became a household name thanks to Parasite, he had already amassed an impressive filmography. On this week's K-Fix, we'll have a closer look at his notable works, crafted long before his Oscar-winning turn in Parasite."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/the-potato-lab-trailer-kang-tae-oh-is-set-to-headline-upcoming-rom-com-2680071-2025-02-14",
      "headline": "The Potato Lab trailer: Kang Tae-oh is set to headline upcoming rom-comThe trailer for The Potato Lab, a romantic comedy-drama starring Kang Tae-oh and Lee Sun-bin, has been released. The series, set in a rural potato research institute, promises a blend of romance, comedy, and workplace drama."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/dhoom-dhaam-review-yami-gautam-pratik-gandhi-2679912-2025-02-14",
      "headline": "Dhoom Dhaam review: Romance meets thrill in this Yami Gautam-Pratik Gandhi filmReleased-Fri Feb 14, 2025Dhoom Dhaam movie review: Dhoom Dhaam blends romance with action and comedy, offering a refreshing alternative to traditional Valentine's Day films. Starring Yami Gautam and Pratik Gandhi, the movie delivers a thrilling and entertaining experience perfect for a cosy night in."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/selena-gomez-benny-blanco-song-scared-of-loving-you-released-new-album-i-said-i-love-you-first-2679975-2025-02-14",
      "headline": "Scared of Loving You: Selena Gomez's new song for her Valentine Benny Blanco out Lovebirds Selena Gomez and Benny Blanco have now collaborated for a new album titled I Said I Love You First. On the occasion of Valentine's Day 2025, Selena released the first single from the album, Scared of Loving You.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/music-composer-ilayaraja-madras-high-court-dispute-with-music-master-over-his-compositions-2679766-2025-02-14",
      "headline": "Ilaiyaraaja appears in Court in dispute with music company over his compositionsIn 2010, Music Master filed a lawsuit seeking a ban on the use of these songs on YouTube and social media platforms, calling it \"unauthorised\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/are-k-drama-men-written-by-women-too-good-to-be-true-valentine-day-special-2679923-2025-02-14",
      "headline": "Are K-Drama men written by women too good to be true? | Valentine Special K-drama male leads have captivated audiences with their idealised traits, offering a romantic fantasy of the perfect partner. These characters, crafted by female screenwriters, challenge traditional portrayals. This Valentine's Day we analyse if they are too good to be true. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/prime-videos-rings-of-power-renewed-for-third-season-2679924-2025-02-14",
      "headline": "Prime Video's Rings of Power renewed for third seasonPrime Video's Rings of Power has been renewed for the third installment, the makers announced recently. Its second season was released last year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/mrs-director-arati-kadav-on-backlash-over-missing-credits-great-indian-kitchen-2679432-2025-02-14",
      "headline": "Mrs director Arati Kadav on backlash over missing credits: Glad it was called outDirector Arati Kadav addresses the backlash over Mrs not crediting The Great Indian Kitchen in the trailer, stressing the need for proper recognition. Mrs, starring Sanya Malhotra, is streaming on Zee5. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kanan-gill-asking-same-question-as-ranveer-allahbadia-video-2679865-2025-02-14",
      "headline": "Viral video: Kanan Gill made same remark as Ranveer Allahbadia years agoAs Ranveer Allahbadia faces backlash for his India's Got Latent remark, an old video of Kanan Gill asking the same question resurfaces on the internet. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/kanye-west-bianca-censori-heading-for-divorce-team-clarifies-2679842-2025-02-14",
      "headline": "Kanye West, Bianca Censori heading for divorce? Team clarifiesIt was previously reported that singer-rapper Kanye West and his wife, Bianca Censori, had split and were headed for divorce. However, a recent development has refuted these claims, labelling them as \"tabloid rumours.\"\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/sanya-malhotras-mrs-makes-questions-on-marital-rape-mechanical-sex-personal-2679613-2025-02-14",
      "headline": "Sanya Malhotra's Mrs. makes questions on marital rape, mechanical sex personalImagine a woman bleeding for five days in a month, and those five days being the most peaceful in her life because she can finally refuse sex to her husband. He can't assert his power over her. That's how Sanya Malhotra's 'Mrs.' unsettles you and makes you think. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/vishal-dadlani-meets-with-accident-undergoing-treatment-2679715-2025-02-13",
      "headline": "Singer-composer Vishal Dadlani meets with an accident, undergoes treatmentVishal Dadlani of the Vishal-Sheykhar duo is undergoing treatment after an accident, leading to the postponement of their upcoming concert scheduled for March 2."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/samay-raina-unfiltered-india-tour-shows-across-nation-cancelled-indias-got-latent-controversy-2679669-2025-02-13",
      "headline": "Not just Gujarat, all Samay Raina shows cancelled amid India's Got Latent rowSamay Raina's shows in India have been cancelled following controversy around India's Got Latent, with Gujarat shows being the first to be affected."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/singer-jonita-gandhi-to-perform-at-lollapalooza-india-will-open-for-shawn-mendes-2679497-2025-02-13",
      "headline": "Singer Jonita Gandhi to perform at Lollapalooza India, will open for Shawn MendesJonita Gandhi will perform at Lollapalooza India on March 8, opening for Shawn Mendes. Her latest single Channa has also been nominated for a Juno Award."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/twilight-star-taylor-lautner-to-return-as-werewolf-in-self-aware-werewolf-series-2679572-2025-02-13",
      "headline": "Twilight star Taylor Lautner to return as werewolf in self-aware werewolf seriesTwilight star Taylor Lautner is returning to portray a werewolf in the self-aware Amazon series. Details of the show are yet to be revealed. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/photo/anupamaa-actor-rupali-ganguly-seeks-blessings-at-maha-kumbh-2679484-2025-02-13",
      "headline": "Anupamaa actor Rupali Ganguly seeks blessings at Maha KumbhActor Rupali Ganguly visited Maha Kumbh in Prayagraj with her family. She shared moments from her spiritual visit, including performing aarti, attending a hawan, and meeting a saint. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/nawazuddin-siddiqui-begins-raat-akeli-hai-2-shooting-in-lucknow-2679426-2025-02-13",
      "headline": "Nawazuddin Siddiqui begins Raat Akeli Hai 2 shooting in LucknowActor Nawazuddin Siddiqui has begun Raat Akeli Hai 2 shooting in Lucknow. The actor will be seen sharing screen space with Chitragandha Singh. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/video/olivia-swann-on-ncis-sydney-her-characters-growth-challenges-2679301-2025-02-13",
      "headline": "Olivia Swann on NCIS: Sydney, her character's growth & challenges In this exclusive interview with India Today's Bhavna Agarwal, Olivia Swann dives deep into her role in NCIS: Sydney, sharing insights into her character's journey, development, and challenges throughout the series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/rozlyn-khan-sues-ankita-lokhande-for-defamation-over-cheap-remark-2679295-2025-02-13",
      "headline": "Rozlyn Khan sues Ankita Lokhande for defamation over 'cheap' remark TV actor Rozlyn Khan took legal action against Ankita Lokhande's recent comments. Ankita had called her 'cheap', for her claims about Hina Khan's cancer battle. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/jackson-wang-makes-a-powerful-comeback-with-high-alone-from-magic-man-2-2679273-2025-02-13",
      "headline": "Jackson Wang makes a powerful comeback with High Alone from Magic Man 2Jackson Wang drops a new single, High Alone, that marks the beginning of his new album, MAGIC MAN 2. The album promises a deep dive into themes of identity and personal transformation, set against a backdrop of atmospheric production and introspective lyrics."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/john-lithgow-approached-to-play-albus-dumbledore-in-harry-potter-series-2679264-2025-02-13",
      "headline": "Actor John Lithgow approached to play Albus Dumbledore in Harry Potter seriesAward-winning American actor John Lithgow has reportedly been approached to play the iconic character of Hogwarts principal Albus Dumbledore in HBO's Harry Potter series. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/rupali-ganguly-stepdaughter-esha-verma-calls-her-evil-step-lady-issues-clarification-2679232-2025-02-13",
      "headline": "Rupali Ganguly's stepdaughter calls her 'evil step lady', issues clarificationRupali Ganguly's stepdaughter, Esha Verma, clarified her viral social media post against the actor. Esha requested privacy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ranveer-allahbadia-cries-loss-of-work-indias-got-latent-controversy-viral-video-truth-2679217-2025-02-13",
      "headline": "Truth behind viral video of Ranveer Allahbadia crying over 'loss of work'Amid backlash over India's Got Latent, an old video of Ranveer Allahbadia crying resurfaces. In the video, the podcaster is seen breaking down over 'loss of work'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/jonas-brother-hint-at-big-change-for-2025-shocked-fans-ask-another-breakup-2679190-2025-02-13",
      "headline": "Jonas Brothers hint at big change for 2025, shocked fans ask, 'another breakup?'The Jonas Brothers shared a letter on social media that briefly sent fans into a panic. In it, they hinted at their 2025 lineup and expressed gratitude to their fans for supporting them throughout their musical journey."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kapil-sharma-ma-baap-ki-kabaddi-joke-viral-ranveer-allahbadia-remark-2679097-2025-02-12",
      "headline": "Kapil Sharma's 'Maa Baap ki Kabaddi' joke goes viral amid Ranveer Allahbadia rowAmid the controversy over Ranveer Allahbadia's comment on Samay Raina's show India's Got Latent, an old clip of Kapil Sharma joking about kids watching \"maa baap ki kabaddi\" is going viral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/did-ar-rahman-refer-to-ranveer-allahbadia-row-at-chhaava-music-launch-vicky-kaushal-2679084-2025-02-12",
      "headline": "Watch: Did AR Rahman refer to Ranveer Allahbadia row at Chhaava music launch?AR Rahman made a humorous remark at the Chhaava music launch that has led to speculation about its connection to the recent controversy involving Ranveer Allahbadia and Samay Raina. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/photo/ed-sheeran-india-dump-football-with-john-abraham-2679075-2025-02-12",
      "headline": "Ed Sheeran's India dump features photo from football match with John AbrahamSinger Ed Sheeran shared his India dump, which also featured a glimpse of his football match with Bollywood actor John Abraham. Sheeran is in India for his Mathematics Tour."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/another-flight-carrying-indian-deportees-us-lands-amritsar-2680981-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "US flight carrying third batch of 112 Indian deportees lands in AmritsarA US Air Force C-17 Globemaster landed in Amritsar, carrying 112 Indians deported from the US for illegal residency. This marks the third such arrival in 10 days amid US immigration crackdowns."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/new-delhi-railway-station-stampede-death-girl-rush-prayagraj-kumbh-mela-train-2680974-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Man trying to exit station due to overcrowding lost 7-year-old in Delhi stampedeSeven-year-old Riya was among the 18 people killed in the stampede at New Delhi Railway Station on Saturday. She was trying to leave the station with her parents after they decided to call off their journey due to the rush."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-chief-minister-name-legislative-party-meeting-monday-bjp-government-2680929-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Delhi Chief Minister oath likely on February 18: SourcesThe BJP is set to finalise its Chief Minister soon, with several contenders, including Parvesh Verma, Vijender Gupta, and potential women candidates, under consideration. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-full-schedule-kkr-vs-rcb-opener-final-may-25-2680913-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "IPL schedule: KKR vs RCB in opener on March 22, final in Kolkata on May 25IPL 2025: The BCCI announced the full schedule for the new season. KKR will take on RCB in the opening match on March 22 while the final will be in Kolkata on May 25. A total of 13 venues to host 74 matches in the 2025 season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/new-delhi-railway-station-stampede-prayagraj-mahakumbh-pilgrims-mob-2680948-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "The state of the mob and the failure of the stateAt the New Delhi railway station on Saturday night, a \"sea of humanity\" travelling for a Kumbh dip was waiting for the train to Prayagraj. A platform-change announcement triggered a tsunami in that sea. Faith, fate, and a whole lot of frantic feet. India has a mob problem.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/us-flights-indians-deportation-women-children-not-shackled-amritsar-2680978-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Women, children not restrained on 2nd US flight that landed in Amritsar: SourcesA plane carrying 116 Indian deportees from the US landed in Amritsar. This is the second such deportation under US immigration policies. The flight followed a meeting between Prime Minister Modi and President Trump in Washington."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/bafta-awards-2025-all-we-imagine-as-light-falls-short-to-emilia-perez-2681015-2025-02-17?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "BAFTA Awards 2025: All We Imagine As Light falls short to Emilia PerezThe Spanish musical Emilia Perez clinched the Best Film Not in the English Language award at the 78th BAFTAs, surpassing the Indian film, All We Imagine As Light. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/yamuna-river-cleaning-delhi-bjp-government-lg-vk-saxena-election-promise-2680906-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Yamuna clean-up begins under Lt Governor's order week after BJP win in DelhiDelhi Lieutenant Governor VK Saxena has launched Yamuna River clean-up efforts, deploying machinery and enforcing oversight, despite the absence of a new state government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/video-man-flung-off-bike-after-head-on-collision-with-car-in-lucknow-2681005-2025-02-17?utm_source=Videos_hp&utm_medium=Videos&utm_campaign=home_Videos",
      "headline": "Video: Man flung off bike after head-on collision with car in LucknowA speeding bike crashed into a car in Lucknow on February 12, throwing the rider into the air before he hit the ground."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/beyond-budget-2025-not-cities-create-50-circuits-of-developed-tourism-2680931-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Beyond Budget 2025: Not cities, create 50 circuits of developed tourismThe goal, industry experts say, should be to offer tourist packages because travellers, unlike local day-trippers, don't visit just one location\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-priya-mishra-ashleigh-gardner-gujarat-giants-vs-up-warriorz-2680989-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "WPL 2025: Priya Mishra, Gardner guide Gujarat to 1st win of season vs UP WarriorzGujarat Giants registered their first win of the season as they beat UP Warriorz in the third match of the Women's Premier League 2025. Ashleigh Gardner was once again top scorer for Gujarat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/ranveer-allahbadia-indias-got-latent-controversy-samay-raina-profanity-vulgarity-expletives-part-of-indian-culture-bihar-up-2680365-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Our sanskari swear words, profanity paramparaFrom abuses in Gaari Geet and Holi meetings, to profanities hurled at the deity at a temple fest in Kerala and expletives being used as conjunctions in everyday life, Indians need no primer on bawdy jokes and cuss words. And that's culture too. A look at that culture even as Indians outrage over Ranveer Allahbadia and Samay Raina."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/chhaava-vicky-kaushal-period-drama-audience-in-tears-akshaye-khanna-rashmika-mandanna-2680845-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Chhaava: Audience in tears after watching Vicky Kaushal's period drama. WatchVicky Kaushal's period drama, Chhaava, has earned appreciation from all quarters. A video of fans getting emotional after watching the film has emerged online. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/jammu-and-kashmir-brief-exchange-of-fire-near-pakistan-border-in-poonch-2680957-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Brief exchange of fire near Pakistan border in Jammu and Kashmir's PoonchThe Indian Army stated that it remains uncertain whether the gunfire originated from the Pakistan Army or was the work of terrorists concealed in the forests, lying in wait for an opportunity to infiltrate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/shows/story/the-buzz-colombian-superstar-shakira-hospitalized-in-peru-cancels-lima-concert-amid-health-scare-glbs-2681010-2025-02-17?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Colombian superstar Shakira hospitalized in Peru, cancels Lima concert amid health scareShakira canceled her Lima concert after being hospitalized with an abdominal condition. She expressed sadness but assured fans a rescheduled date. Her Las Mujeres Ya No Lloran tour continues across Latin America, Canada, and the U.S. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/new-delhi-railway-station-stampede-death-bihar-family-members-kumbh-mela-prayagraj-2680953-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "11-year-old, grandparents on way to Kumbh among those killed in Delhi stampedeVijay Saha and Krishna Devi were on their way to Prayagraj along with granddaughter Suruchi. However, all three of them were killed in the deadly stampede in New Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/pakistani-man-dances-to-nimbooda-nimbooda-in-viral-video-2680823-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Pakistani man dances to Nimbooda Nimbooda in viral video. Internet loves his graceA video of a Pakistani man dancing effortlessly to Aishwarya Rai Bachchan's hit song 'Nimbooda Nimbooda' has gone viral on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-450-14-02-2025?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shashi-tharoor-praise-modi-us-visit-trump-meeting-congress-bjp-2680952-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Spoke in national interest: Shashi Tharoor on why he praised PM Modi's US visitA video of Shahi Tharoor's rare praise of Prime Minister Narendra Modi for his US visit and meeting with Donald Trump went viral on social media, with many BJP supporters appreciating his remarks."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/new-delhi-railway-station-stampede-cops-say-similar-train-names-with-prayagraj-led-to-mayhem-railways-disputes-2680835-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Delhi cops say similar train names caused confusion, led to deadly stampedeThe Delhi Police said that two trains - Prayagraj Express and Prayagraj Special, and the announcement of the latter arriving at platform 16 caused confusion. This is because Prayagraj Express was already standing on platform 14."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-white-lotus-season-3-review-lisa-parker-posey-and-jason-isaacs-show-is-predictable-but-entertaining-2680925-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "The White Lotus S3 review: Predictable? Yes. Addictive? Also, yesReleased-Mon Feb 17, 2025The White Lotus Season 3 review: The White Lotus returns with a new season set in Thailand, offering a fresh cultural backdrop while retaining its biting satire on the ultra-rich. The series continues to entertain with its dark humour and ensemble cast, though its formula is starting to feel familiar. Read our full review. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-schedule-csk-vs-mi-double-header-hardik-pandya-ban-2680965-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "CSK vs MI double returns after a year, no Hardik Pandya in 1st matchIPL 2025: Chennai Super Kings and Mumbai Indians will face twice in the IPL season for the first time since 2023. Hardik Pandya, Mumbai Indians' captain, will miss their first meeting in Chennai on March 23. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/us-migrant-flight-illegal-indian-immigrants-deportee-claims-legs-chained-hands-cuffed-military-plane-amrtisar-2680787-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Legs chained, hands cuffed: Indian deportee on 2nd US flight recounts ordealThe US military C-17 aircraft, that landed in Amritsar late Saturday night, carried the second batch of illegal Indian immigrants as part of President Donald Trump's massive crackdown against undocumented aliens in America."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/united-states-cancels-21m-funding-for-voter-turnout-in-india-29m-for-bangladesh-2680727-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Elon Musk's DOGE cancels $21 million US funding for voter turnout in IndiaElon Musk's Department of Government Efficiency (DOGE) has announced a decision to cut $723 million in foreign aid funding as part of its broader budget overhaul plans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/bafta-awards-2025-all-we-imagine-as-light-falls-short-to-emilia-perez-2681015-2025-02-17",
      "headline": "BAFTA Awards 2025: All We Imagine As Light falls short to Emilia PerezThe Spanish musical Emilia Perez clinched the Best Film Not in the English Language award at the 78th BAFTAs, surpassing the Indian film, All We Imagine As Light. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pushpa-kannada-actor-daali-dhananjaya-marries-dr-dhanyatha-gauraklar-mysore-first-pics-out-2680960-2025-02-16",
      "headline": "Pushpa actor Daali Dhananjaya marries Dhanyatha Gauraklar, first pics outKannada actor Daali Dhananjaya got married to Dr Dhanyatha Gauraklar in a close-knit ceremony, attended by friends and family. The first pictures from their wedding are finally out. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/abhishek-bachchan-poses-picture-amy-jackson-ed-westwick-british-asian-trust-gala-2680950-2025-02-16",
      "headline": "Abhishek Bachchan poses for a pic with Amy Jackson-Ed Westwick at British galaActor Abhishek Bachchan, who was among the other stars at At British Asian Trust Gala, posed for a picture with Amy Jackson and Ed Westwick. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-white-lotus-season-3-review-lisa-parker-posey-and-jason-isaacs-show-is-predictable-but-entertaining-2680925-2025-02-16",
      "headline": "The White Lotus S3 review: Predictable? Yes. Addictive? Also, yesReleased-Mon Feb 17, 2025The White Lotus Season 3 review: The White Lotus returns with a new season set in Thailand, offering a fresh cultural backdrop while retaining its biting satire on the ultra-rich. The series continues to entertain with its dark humour and ensemble cast, though its formula is starting to feel familiar. Read our full review. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-james-maddison-tottenham-vs-manchester-united-premier-league-2681006-2025-02-17",
      "headline": "James Maddison earns Tottenham 1-0 victory over Manchester UnitedTottenham Hotspur midfielder James Maddison starred with an early goal against Manchester United which helped his team register a 1-0 victory in the Premier League on Sunday, February 16."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-india-to-play-on-fresh-pitches-in-dubai-rohit-sharma-gautam-gambhir-2681001-2025-02-16",
      "headline": "Champions Trophy 2025: India to play on fresh pitches in Dubai The Indian cricket team is set to play their matches of the ICC Champions Trophy 2025 on two fresh pitches in Dubai specially kept aside for the tournament. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-priya-mishra-ashleigh-gardner-gujarat-giants-vs-up-warriorz-2680989-2025-02-16",
      "headline": "WPL 2025: Priya Mishra, Gardner guide Gujarat to 1st win of season vs UP WarriorzGujarat Giants registered their first win of the season as they beat UP Warriorz in the third match of the Women's Premier League 2025. Ashleigh Gardner was once again top scorer for Gujarat."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/carlos-alcaraz-reaction-jannik-sinner-wada-doping-settlement-2680977-2025-02-16",
      "headline": "Carlos Alcaraz reacts to Jannik Sinner's doping settlement, eyes No. 1 spotWhile Jannik Sinner's agreement with the World Anti-Doping Agency for a reduced doping ban has created a stir in the tennis community, Carlos Alcaraz seemed uninterested in the debate surrounding his arch-rival. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-mohammed-shami-works-hard-with-coach-morkel-pant-recovers-from-freak-injury-2680971-2025-02-16",
      "headline": "Shami's workout, Pant's injury scare: India's 1st training highlights in DubaiThe Indian cricket team took part in their first practice session after landing in Dubai for the Champions Trophy 2025 as Mohammed Shami was seen working along with bowling coach Morne Morkel. Rishabh Pant was hit by a shot from Hardik Pandya but recovered quickly after being attended by the team's physio."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-schedule-csk-vs-mi-double-header-hardik-pandya-ban-2680965-2025-02-16",
      "headline": "CSK vs MI double returns after a year, no Hardik Pandya in 1st matchIPL 2025: Chennai Super Kings and Mumbai Indians will face twice in the IPL season for the first time since 2023. Hardik Pandya, Mumbai Indians' captain, will miss their first meeting in Chennai on March 23. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dinesh-karthik-t20-record-ms-dhoni-ipl-2025-sa20-2680959-2025-02-16",
      "headline": "Sure MS Dhoni will overtake me in T20s, not fascinated by records: Dinesh KarthikDinesh Karthik recently surpassed MS Dhoni on the list of batters with the most runs in T20s. The wicketkeeper-batter reflected on his memorable SA20 stint, describing his experience of rubbing shoulders with Joe Root at Paarl Royals as fantastic."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-2025-team-wise-full-schedule-csk-schedule-mi-ipl-schedule-rcb-match-list-kkrs-matches-2680946-2025-02-16",
      "headline": "IPL 2025 team-wise full schedule: Key matches of CSK, MI, RCB, KKR and othersThe schedule for the Indian Premier League 2025 (IPL 2025) was unveiled by the BCCI (Board of Control for Cricket in India) on Sunday, February 16. Here's the team-wise schedule of all the IPL teams such as CSK, MI, RCB and KKR amongst others."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-2025-schedule-venues-double-headers-details-dates-2680935-2025-02-16",
      "headline": "IPL 2025 schedule announced: 13 venues, 12 double-headers in new seasonA total of 13 venues will be used for the new season of the IPL in 2025 as the tournament starts on March 22. The 2025 season will see 12 double headers take place as the 10 teams battle it out for the title. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-rishabh-pant-suffers-injury-scare-after-being-hit-on-his-knee-during-practice-2680919-2025-02-16",
      "headline": "Watch: India suffer injury scare as Pant gets hit on his knee during practiceIndia wicketkeeper-batter Rishabh Pant was seen in excruciating pain after being hit on his knee during the team's first practice session in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/dinesh-karthik-t20-record-ms-dhoni-ipl-2025-sa20-2680959-2025-02-16",
      "headline": "Sure MS Dhoni will overtake me in T20s, not fascinated by records: Dinesh KarthikDinesh Karthik recently surpassed MS Dhoni on the list of batters with the most runs in T20s. The wicketkeeper-batter reflected on his memorable SA20 stint, describing his experience of rubbing shoulders with Joe Root at Paarl Royals as fantastic."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-2025-team-wise-full-schedule-csk-schedule-mi-ipl-schedule-rcb-match-list-kkrs-matches-2680946-2025-02-16",
      "headline": "IPL 2025 team-wise full schedule: Key matches of CSK, MI, RCB, KKR and othersThe schedule for the Indian Premier League 2025 (IPL 2025) was unveiled by the BCCI (Board of Control for Cricket in India) on Sunday, February 16. Here's the team-wise schedule of all the IPL teams such as CSK, MI, RCB and KKR amongst others."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-2025-schedule-venues-double-headers-details-dates-2680935-2025-02-16",
      "headline": "IPL 2025 schedule announced: 13 venues, 12 double-headers in new seasonA total of 13 venues will be used for the new season of the IPL in 2025 as the tournament starts on March 22. The 2025 season will see 12 double headers take place as the 10 teams battle it out for the title. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-rishabh-pant-suffers-injury-scare-after-being-hit-on-his-knee-during-practice-2680919-2025-02-16",
      "headline": "Watch: India suffer injury scare as Pant gets hit on his knee during practiceIndia wicketkeeper-batter Rishabh Pant was seen in excruciating pain after being hit on his knee during the team's first practice session in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-full-schedule-kkr-vs-rcb-opener-final-may-25-2680913-2025-02-16",
      "headline": "IPL schedule: KKR vs RCB in opener on March 22, final in Kolkata on May 25IPL 2025: The BCCI announced the full schedule for the new season. KKR will take on RCB in the opening match on March 22 while the final will be in Kolkata on May 25. A total of 13 venues to host 74 matches in the 2025 season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pakistan-cricket-team-haris-fauf-cleared-opening-match-new-zealand-2680890-2025-02-16",
      "headline": "Pakistan get big Champions Trophy boost as star pacer cleared for opener: ReportPakistan have received a big boost ahead of their Champions Trophy 2025 opening match against New Zealand as star pacer Haris Rauf has been cleared for the match. Rauf was injured during the recent tri-series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-pakistan-overhyped-harbhajan-singh-dubai-2680889-2025-02-16",
      "headline": "India vs Pakistan is overhyped: Harbhajan sends Champions Trophy warning to fans Champions Trophy 2025: Former India cricketer Harbhajan Singh cautioned fans against expecting a close contest in the India vs Pakistan match, predicting a one-sided victory for Rohit Sharma's side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-pakistan-cricket-team-is-like-their-country-both-go-up-and-down-says-aakash-chopra-2680877-2025-02-16",
      "headline": "Pakistan cricket team is like their country, both go up and down: Aakash ChopraFormer India cricketer turned commentator has compared the Pakistan cricket team's inconsistency with their country, mentioning how both have a volatile nature."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-united-amad-diallo-injury-2680853-2025-02-16",
      "headline": "Premier League: Manchester United confirm injury blow for forward Amad DialloManchester United have confirmed that Amad Diallo will be out of action for several weeks after sustaining an ankle injury during training. Amad will miss United's away trip to Tottenham Hotspur on Sunday, February 16, "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-pakistan-match-tickets-online-sold-out-dubai-2680852-2025-02-16",
      "headline": "Extra tickets for India vs Pakistan match in Dubai sold out within hoursChampions Trophy 2025: The ICC announced the sale of additional tickets for India's matches in Dubai on February 16. The India vs Pakistan tickets were gone in hours. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-kane-williamson-wearing-dhoti-karachi-squad-viral-video-2680849-2025-02-16",
      "headline": "Watch: New Zealand's Williamson spotted wearing a dhoti in KarachiKane Williamson delighted fans by embracing local culture in Karachi, donning a traditional dhoti ahead of New Zealand's Champions Trophy opener clash against hosts Pakistan on February 19."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-tim-southee-delighted-with-kane-williamsons-comeback-in-tri-series-2680848-2025-02-16",
      "headline": "Tim Southee delighted with Kane Williamson's comeback ahead of Champions TrophyFormer New Zealand cricketer Tim Southee praised Kane Williamson on his remarkable comeback to ODI cricket ahead of the ICC Champions Trophy 2025."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-united-amad-diallo-injury-2680853-2025-02-16",
      "headline": "Premier League: Manchester United confirm injury blow for forward Amad DialloManchester United have confirmed that Amad Diallo will be out of action for several weeks after sustaining an ankle injury during training. Amad will miss United's away trip to Tottenham Hotspur on Sunday, February 16, "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-pakistan-match-tickets-online-sold-out-dubai-2680852-2025-02-16",
      "headline": "Extra tickets for India vs Pakistan match in Dubai sold out within hoursChampions Trophy 2025: The ICC announced the sale of additional tickets for India's matches in Dubai on February 16. The India vs Pakistan tickets were gone in hours. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-kane-williamson-wearing-dhoti-karachi-squad-viral-video-2680849-2025-02-16",
      "headline": "Watch: New Zealand's Williamson spotted wearing a dhoti in KarachiKane Williamson delighted fans by embracing local culture in Karachi, donning a traditional dhoti ahead of New Zealand's Champions Trophy opener clash against hosts Pakistan on February 19."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-tim-southee-delighted-with-kane-williamsons-comeback-in-tri-series-2680848-2025-02-16",
      "headline": "Tim Southee delighted with Kane Williamson's comeback ahead of Champions TrophyFormer New Zealand cricketer Tim Southee praised Kane Williamson on his remarkable comeback to ODI cricket ahead of the ICC Champions Trophy 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/jannik-sinner-doping-ban-daniil-medvedev-wada-2680847-2025-02-16",
      "headline": "Jannik Sinner doping ban: Daniil Medvedev hopes everyone can negotiate dealDaniil Medvedev is hoping that Jannik Sinner's deal with the World Anti-Doping Agency will set a precedent going forward. Medvedev hopes that other players will be given the chance to negotiate similar deals. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/shikhar-dhawan-son-zorovar-divorce-wife-aesha-blocked-2680836-2025-02-16",
      "headline": "Blocked from speaking to my son, haven't seen him in 2 years: Shikhar DhawanFormer India cricketer Shikhar Dhawan expressed his longing to meet and embrace his son. The Champions Trophy winner said it has been two years since he last saw Zoravar and a year since they last spoke."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-yashasvi-jaiswal-ruled-out-ranji-trophy-semi-final-mumbai-vs-vidarbha-injury-2680819-2025-02-16",
      "headline": "Yashasvi Jaiswal ruled out of Mumbai's Ranji semi-final due to injuryYashasvi Jaiswal faces a double setback as an ankle injury ruled him out of Mumbai's Ranji Trophy semi-final against Vidarbha, days after his exclusion from India's Champions Trophy squad in a last-minute selection change."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-haris-rauf-injury-pakistan-squad-mohammad-amir-new-zealand-game-2680813-2025-02-16",
      "headline": "If Haris Rauf has a side strain, he cannot play Champions Trophy: Mohammad AmirFormer pacer Mohammad Amir has expressed his doubts about Haris Rauf's fitness and feels he may not be able to play the Champions Trophy if he has got a side strain. Rauf got injured during the opening match of the tri-series but was deemed to be fit in time for the Champions Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/football-laliga-jude-bellingham-red-card-real-madrid-vs-osasuna-explained-2680806-2025-02-16",
      "headline": "What went wrong in Bellingham's red card in Madrid vs Osasuna: ExplainedJude Bellingham faces a potential lengthy ban after receiving a controversial red card against Osasuna, with Real Madrid boss Carlo Ancelotti insisting it was a misunderstanding and criticising referee José Luis Munuera's officiating decisions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/cricket-mumbai-indians-sign-mujeeb-ur-rahman-allah-ghazanfar-replacement-2680796-2025-02-16",
      "headline": "IPL 2025: Mumbai Indians sign Mujeeb Ur Rahman as Allah Ghazanfar replacementMumbai Indians have announced the signing of Mujeeb ur Rahman as the replacement for the injured Allah Ghazanfar for the upcoming IPL 2025 season on Sunday, February 16. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-additional-tickets-india-matches-semifinal-one-go-on-sale-dubai-2680780-2025-02-16",
      "headline": "Champions Trophy: Additional tickets for India matches in Dubai to go on saleAdditional tickets for India's matches in Dubai during the ICC Champions Trophy will go on sale on Sunday, February 16. Apart from the India matches, semi-final 1 will also be played in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-classics-hardik-pandya-india-vs-pakistan-2017-final-ravindra-jadeja-run-out-2680779-2025-02-16",
      "headline": "Champions Trophy Classics: When Hardik Pandya's flair couldn't stop PakistanWhen Hardik Pandya's fiery knock in the 2017 Champions Trophy final gave India hope, only for a mix-up with Ravindra Jadeja to cut it short, leaving fans wondering what could have been."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-rashid-khan-bigger-cricketer-than-wasim-akram-afghanistan-rashid-latif-2680760-2025-02-16",
      "headline": "Rashid Khan bigger cricketer than Wasim Akram: Rashid Latif makes bold claimFormer Pakistan skipper Rashid Latif has made a huge statement that Rashid Khan is a bigger cricketer than Wasim Akram. Rashid has been one of the star players for Afghanistan in the last decade. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/chess-d-gukesh-alexandra-andrea-botez-sisters-hostage-picture-fun-post-freestyle-grand-slam-2680747-2025-02-16",
      "headline": "First Vishy Anand, now Botez sisters take Gukesh 'hostage' in funny postCanadian chess stars Alexandra and Andrea Botez shared a hilarious \"hostage\" photo with Indian world champion D Gukesh, delighting fans with their trademark humour after a similar viral post featuring Viswanathan Anand."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/fih-pro-league-india-vs-spain-harmanpreet-singh-reaction-kalinga-stadium-2680744-2025-02-16",
      "headline": "Harmanpreet Singh not 'too disappointed' with Spain loss, eyes finishing improvementIndia captain Harmanpreet Singh said that he wasn't too disappointed with the loss to Spain in the FIH Pro League on Saturday, February 15. India lost the match 1-3 despite taking the lead in the match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-omar-marmoushs-hat-trick-doesnt-surprise-manchester-city-boss-pep-guardiola-2680732-2025-02-16",
      "headline": "Omar Marmoush's hat-trick doesn't surprise Manchester City boss Pep GuardiolaOmar Marmoush's hat-trick against Newcastle United didn't surprise Manchester City boss Pep Guardiola as he felt it was just a matter of time before the Egyptian forward would find form in the Premier League. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}