{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/warner-bros-discovery-splits-in-two-as-streaming-takes-the-lead-ceo-david-zaslav-will-lead-the-new-company-that-focuses-on-streaming-and-film-studios-2738089-2025-06-09",
      "headline": "Warner Bros Discovery to become two separate companies: ReportThe decision comes as more people stop watching traditional TV and move to streaming platforms. This shift has forced many media companies to rethink how they work."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/currency-devaluation-wealth-erosion-property-value-drop-investment-timing-your-rs-1-crore-flat-is-now-rs-90-lakh-investor-explains-why-value-is-shrinking-2738044-2025-06-09",
      "headline": "Your Rs 1 crore flat is now Rs 90 lakh: Investor explains why value is shrinkingA financial influencer warns that unchecked money printing and currency devaluation could be reducing the real value of properties and other assets, urging investments in inflation-resistant assets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pakistan-economy-set-to-grow-27-percent-in-fy25-says-report-2738039-2025-06-09",
      "headline": "Pakistan's economy set to grow 2.7% in FY25: ReportPakistan's central bank, in a bid to encourage growth, cut its policy rate by more than 1,000 basis points in the current fiscal year. Its latest cut last month brought the key rate to 11%, resuming an easing cycle that had brought rates down from 22% after a brief pause in March."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-settles-over-200-points-nifty-above-25100-kotak-bank-gains-3-percent-2738004-2025-06-09",
      "headline": "Sensex settles over 200 points; Nifty above 25,100; Kotak Bank gains 3%The S&P BSE Sensex was up 256.22 points to close at 82,445.21, while the NSE Nifty50 added 100.20 points to end at 25,103.20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/who-is-sashidhar-jagdishan-hdfc-bank-ceo-fir-mehta-family-lilavati-trust-hospital-2737948-2025-06-09",
      "headline": "Who is Sashidhar Jagdishan? HDFC Bank CEO under financial fraud lensSashidhar Jagdishan has been a part of HDFC Bank since 1996. He joined as a manager in the finance division and quickly rose through the ranks. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/shein-reliance-aim-to-sell-india-made-clothes-globally-within-a-year-2737928-2025-06-09",
      "headline": "Shein, Reliance aim to sell India-made clothes globally within a year: ReportThe aim is to make Shein-branded clothes in India not just for local sales but also for international markets, starting with the US and UK, within the next 6 to 12 months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gautam-adani-salary-fy25-rs-1041-crore-who-earned-more-corporate-networth-2737922-2025-06-09",
      "headline": "Gautam Adani earned Rs 10.41 crore in FY25: Who earned more than him?Gautam Adani earned Rs 10.41 crore in the financial year 2024–25, which is much less than several leading business heads in India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-bumper-rate-cut-leaves-rupee-exposed-to-fresh-depreciation-2737907-2025-06-09",
      "headline": "RBI's bumper rate cut leaves rupee exposed to fresh depreciation riskThe rupee has already lagged behind its Asian peers in 2025, weighed down by tepid capital inflows. Now, with the RBI easing faster than the US Federal Reserve, the narrowing interest rate differential is expected to keep the rupee on the back foot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/rbi-repo-rate-cut-bob-hdfc-lending-rate-reduction-2025-2737895-2025-06-09",
      "headline": "HDFC Bank and BoB cut lending rates after RBI repo rate slashBorrowers can expect EMIs on home loans, personal loans, and other credit products to come down slightly, offering a bit of breathing space amid rising living costs. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/income-tax-department-high-value-transactions-monitoring-tds-rules-large-cash-withdrawals-2737861-2025-06-09",
      "headline": "Income Tax ramps up checks on big transactions with new filing and TDS rulesThe Income Tax Department has ramped up efforts to spot individuals who spend heavily but may be hiding their real income, using data analytics and tighter links with financial institutions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-rupee-currency-devaluation-wealth-reduction-tax-printing-money-real-estate-crypto-stocks-fd-2737820-2025-06-09",
      "headline": "Currency devaluation is quietly eating into your wealth, expert warnsYour money or assets might look the same in your account, but its real value could be slipping away every year, warns expert. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-80-billion-dollar-coal-power-boom-is-running-short-of-water-2737810-2025-06-09",
      "headline": "India's $80 billion coal-power boom is running short of water: ReportThirty-seven of the 44 new projects named in the undated power ministry shortlist of future operations are located in areas that the government classifies as either suffering from water scarcity or stress."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/salman-srk-tiger-vs-pathaan-on-hold-as-yrf-revamps-spy-universe-report-2738120-2025-06-09",
      "headline": "Salman-SRK's Tiger vs Pathaan on hold as YRF revamps spy universe: ReportSalman Khan and Shah Rukh Khan's 'Tiger Vs Pathaan' has not been shelved but put on hold as YRF seeks to revamp its spy universe, suggested media reports. The makers are trying to add a fresh direction and innovative storytelling styles to the film. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kuberaa-producer-ott-rejected-july-date-suggested-rs-10-crore-cut-over-delay-2737998-2025-06-09",
      "headline": "They decide the date, not us: Kuberaa producer slams OTT's growing control'Kuberaa' producer Suniel Narang revealed that when a July release date was requested, the OTT platform insisted on the original date of June 20, warning that any delay would result in a Rs 10 crore cut from the agreed amount."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/director-manish-gupta-denies-stabbing-driver-with-knife-how-can-there-be-no-blood-2738126-2025-06-09",
      "headline": "Director Manish Gupta denies stabbing driver with knife: How can there be no blood?Director Manish Gupta said in a statement that the driver had made false allegations against him with the intention to extort money. He submitted the CCTV footage asking how the driver could walk as if nothing had happened after claiming to be stabbed with a knife. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/meet-khushi-girl-with-aspergers-syndrome-in-pankaj-tripathis-criminal-justice-4-2738094-2025-06-09",
      "headline": "Meet Khushi, girl with Asperger's syndrome in Pankaj Tripathi's Criminal Justice 4Actor Khushi Bharadwaj, who began her acting career with 'Balveer', plays the role of Ira Nagpal, a girl living with Asperger's syndrome, in 'Criminal Justice Season 4'. In an exclusive interview with IndiaToday.in, she talks about maintaining the sensibility of the character, and why the industry needs to be inclusive enough to cast someone living with the same condition to play the role. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/20-years-on-sonali-bendre-reacts-to-rumours-of-raj-thackeray-crush-on-her-2738037-2025-06-09",
      "headline": "20 years on, Sonali Bendre reacts to rumours of Raj Thackeray's crush on herActor Sonali Bendre reacted to reports of MNS (Maharashtra Navnirman Sena) politician Raj Thackerey having a crush on her 20 years ago. The actor said that the reports are not in good taste, since families are involved. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/aamir-khan-reveals-why-nephew-imran-khan-struggled-to-fit-into-bollywood-2738040-2025-06-09",
      "headline": "Aamir Khan shares why nephew Imran Khan struggled to fit into BollywoodBollywood superstar Aamir Khan has shared why his nephew Imran Khan did not fit into Bollywood. The actor said Imran was offered mainstream films, but he is not comfortable with 'herogiri'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vishnu-manchu-dream-cast-kichcha-sudeep-mohanlal-suriya-aamir-khan-2738087-2025-06-09",
      "headline": "Actor Vishnu Manchu reveals dream cast for a pan-India action film | ExclusiveTelugu actor-producer Vishnu Manchu expressed his wish to make pan-Indian action movie featuring top stars from various film industries. In a chat with India Today, he listed his dream cast."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/parineeti-chopra-raghav-chadha-romantic-evening-at-french-open-final-in-paris-2738065-2025-06-09",
      "headline": "Parineeti-Raghav's romantic evening at French Open Final in ParisParineeti Chopra and Raghav Chadha enjoyed a romantic outing at the French Open final in Paris, where they watched Carlos Alcaraz clinch the title"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actor-suriya-lands-in-hyderabad-with-daughter-diya-ahead-of-venky-atluri-film-shoot-2737967-2025-06-09",
      "headline": "Actor Suriya in Hyderabad with daughter Diya ahead of Venky Atluri's film shoot'Retro' actor Suriya was seen in Hyderabad airport, making a rare public appearance with his daughter Diya. Reports suggest that he is in Hyderabad to shoot for his upcoming project with 'Lucky Bhaskar' director Venky Atluri. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/ekta-kapoor-calls-anurag-kashyap-classist-for-saas-bahu-jibe-on-netflix-ceo-2737929-2025-06-09",
      "headline": "Ekta Kapoor calls Anurag Kashyap classist for saas-bahu jibe on Netflix CEOFilmmaker Anurag Kashyap recently criticised Netflix CEO Ted Sarandos' statement, mentioning that he should have started with more populist content instead of 'Sacred Games' in India. Producer Ekta Kapoor responded to Kashyap, calling him a classist for referring to the saas-bahu dramas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/anurag-kashyap-daughter-aaliyah-kashyap-admires-black-friday-2737949-2025-06-09",
      "headline": "No bigger reward: Anurag Kashyap on daughter's reaction to Black FridayFilmmaker Anurag Kashyap opened up about his daughter's admiration for his cult classic Black Friday. He reflected on the lasting impact of his work and shares insights on his journey and collaborations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/edagaiye-apaghatakke-karana-trailer-promises-quirky-crime-comedy-starring-diganth-2737920-2025-06-09",
      "headline": "Edagaiye Apaghatakke Karana trailer promises quirky crime comedy starring DiganthThe recently released trailer of the upcoming Kannada film, 'Edagaiye Apaghatakke Karana' starring Diganth, Nidhi Subbaiah and Dhanu Harsha in the lead, presents a black comedy thriller packed with situational comedy and four murders. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vairamuthu-calls-out-tamil-filmmakers-use-of-verses-as-film-titles-2737955-2025-06-09",
      "headline": "Lyricist Vairamuthu calls out Tamil filmmakers for using his verses as film titlesLyricist Vairamuthu criticised Tamil filmmakers for using his verses as Tamil film titles. His post on X drew mixed responses as many X users pointed out that the lyrics feature words that have been in Tamil scripture for eons."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/paresh-rawal-reacts-to-fan-calling-him-hero-of-hera-pheri-a-month-after-his-exit-from-the-film-2737942-2025-06-09",
      "headline": "A month after his exit, Paresh Rawal reacts to fan calling him hero of Hera PheriActor Paresh Rawal answered a fan on X who called him the 'hero' of the 'Hera Pheri' franchise. He responded with a humble gesture, adding a folded-hands emoji. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/ranbir-kapoor-alia-bhatt-to-move-into-their-new-home-soon-check-video-2737876-2025-06-09",
      "headline": "Ranbir Kapoor, Alia Bhatt's Rs 250 crore dream home is ready. Check videoRanbir Kapoor and Alia Bhatt's new home in Mumbai is almost ready to move in. Once the finishing touches are completed in a month, the couple will find an auspicious time to conduct the grah pravesh puja."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/navjot-singh-singh-comeback-on-great-indian-kapil-show-archana-puran-singh-in-shock-2737923-2025-06-09",
      "headline": "Navjot Singh Sidhu re-enters Kapil Sharma Show, Archana Puran Singh in shock. WatchNavjot Singh Sidhu is set to make a comeback on 'The Great Indian Kapil Show.' Makers released a new video and announced the news. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kamal-haasan-mani-ratnam-thug-life-failure-what-went-wrong-2737898-2025-06-09",
      "headline": "What went wrong with Kamal Haasan and Mani Ratnam's Thug Life?Kamal Haasan and director Mani Ratnam's 'Thug Life' had all the ingredients for a gripping gangster saga. It marked the reunion of legendary collaborators, featured a powerful cast, and stunning technical craft, yet, it faltered by trying to juggle too many themes and underdeveloped storylines."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/govinda-wife-sunita-feels-actor-not-getting-work-because-of-chaplus-circle-2737857-2025-06-09",
      "headline": "Govinda's wife Sunita feels actor not getting work because of chaplus circleActor Govinda's wife, Sunita Ahuja, recently said he had not been getting work for the past 17 years because of his circle. Sunita stated that the actor seeks feedback from people who would give him wrong piece of advice."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/photo/smriti-irani-amar-upadhyay-to-mouni-roy-celebs-at-ektaa-kapoor-birthday-bash-2737819-2025-06-09",
      "headline": "Smriti Irani, Amar Upadhyay to Mouni Roy, celebs at Ektaa Kapoor's birthday bashProducer Ektaa Kapoor celebrated her 50th birthday with the who's of who of Bollywood and the Indian television industry on June 7. However, it was the reunion of 'Kyunki Saas Bhi Kabhi Bahu Thi' starcast, including actor turned politician Smriti Irani and actor Amar Upadhyay, that created excitement among the fans. Karan Johar, Manish Malhotra, Krystle DSouza, Anita Hassanandani, Jeetendra and Tusshar Kapoor also attended the party."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/meghalaya-honeymoon-murder-victim-autopsy-sonam-raja-raghuwanshi-indore-hitmen-affair-2738023-2025-06-09",
      "headline": "Meghalaya honeymoon murder: Husband had 2 sharp head wounds, shows autopsyDays after a couple from Madhya Pradesh went missing in Meghalaya, the husband, Raja Raghuvanshi, was found dead in a forest. His wife Sonam, who was earlier reported missing, has now emerged as the one who allegedly hired hitmen for Raja's murder."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/video-indian-student-handcuffed-pinned-to-ground-at-us-airport-deported-2738074-2025-06-09",
      "headline": "Viral video: Indian student pinned to ground at US airport, handcuffed, deportedA social media user shared pictures and videos of an Indian student being deported by US authorities."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangladesh-muhammad-yunus-interim-government-bans-rallies-protests-demonstration-secretariat-jamuna-2738077-2025-06-09",
      "headline": "Trapped in tight spot, Yunus govt bans rallies in Dhaka's power centreThe interim government of Bangladesh has imposed a sweeping ban on rallies and protests in Dhaka's power centre, which includes the residence of Muhammad Yunus and the Secretariat, a site where civil servants have been protesting for weeks. The ban comes even as the Yunus regime faces mounting protests from government officials, teachers, and pushback from the BNP and the army."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/law-news/story/ktaka-hc-hearing-bengaluru-chinnaswamy-stadium-stampede-case-event-management-firm-dna-accuses-cm-for-open-invitation-2738133-2025-06-09",
      "headline": "Chief Minister invited people, event firm tells court after Bengaluru stampedeDuring the hearing of petitions in Karnataka High Court involving the Bengaluru stampede case, the event management firm denied inviting people and blamed the Chief Minister for the open invitation. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/tiktok-says-no-to-skinnytok-does-it-mean-a-win-for-mental-health-2737855-2025-06-09",
      "headline": "TikTok says no to #SkinnyTok. Does it mean a win for mental health?A recent study highlights that social media majorly contributes to the rise in eating disorders. This comes around the time when TikTok banned #SkinnyTok."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/meghalaya-honeymoon-murder-case-raja-raghuvanshi-sonam-kushwaha-indore-couple-2738078-2025-06-09",
      "headline": "Missing on honeymoon, then a big twist: Timeline of Meghalaya tourist's murderThe murder of 26-year-old Raja Raghuvanshi, who had gone missing along with his wife Sonam during a trip to Shillong, was not an accident in the remote hills, but a planned execution orchestrated by his own wife, allegedly in collusion with her lover."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/almost-45-degrees-recorded-in-several-parts-of-delhi-ncr-heatwave-alert-summer-season-2738140-2025-06-09",
      "headline": "Nearly 45 degrees in several parts of Delhi today, heatwave alert for next 3 daysAccording to official readings, Safdarjung registered 43.4 degrees Celsius, Palam recorded 44.3 degrees, Lodi Road saw 43.3 degrees, Ridge stood at 44.9 degrees, and Aya Nagar experienced the highest temperature at 45.3 degrees Celsius."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/automatic-closing-doors-mumbai-locals-big-move-announced-after-train-accident-2738075-2025-06-09",
      "headline": "Automatic closing doors in Mumbai locals: Big move announced after train accidentAn official said that after the tragedy in Maharashtra, the Railway Ministry has decided to have automatic door closure facilities on all local trains under manufacturing for the Mumbai Suburban."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/20-years-on-sonali-bendre-reacts-to-rumours-of-raj-thackeray-crush-on-her-2738037-2025-06-09",
      "headline": "20 years on, Sonali Bendre reacts to rumours of Raj Thackeray's crush on herActor Sonali Bendre reacted to reports of MNS (Maharashtra Navnirman Sena) politician Raj Thackerey having a crush on her 20 years ago. The actor said that the reports are not in good taste, since families are involved. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/odisha-ias-officer-sub-collector-dhiman-chakma-arrested-taking-rs-10-lakh-bribe-red-handed-2738083-2025-06-09",
      "headline": "Odisha IAS officer caught accepting Rs 10 lakh bribe, half of amount demandedIAS officer Chakma, posted in Odisha's Kalahandhi, allegedly threatened a local businessman to pay Rs 20 lakh as bribe, a part of which he was caught accepting by the state vigilance department. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/shubhanshu-shuklas-father-recalls-the-moment-pm-modi-gave-him-astronaut-wings-2738082-2025-06-09",
      "headline": "Shubhanshu Shukla's father recalls the moment PM gave him astronaut wingsThe ceremony in Trivandrum, where Prime Minister Modi awarded the astronaut wings to the four selected astronauts, was a moment of national celebration and personal triumph. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/russia-ukraine-war-prisoners-of-war-under-age-25-return-home-as-russia-ukraine-carry-out-exchange-2738102-2025-06-09",
      "headline": "Prisoners of war under age 25 return home as Russia, Ukraine carry out exchangeThe June 2 Istanbul talks resulted in an agreement to conduct an exchange of at least 1,200 POWs on each side - focusing on the youngest and most severely wounded - and to repatriate thousands of bodies of those killed in the war."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/the-lowdown/story/the-silent-ascent-how-lal-bahadur-shastri-became-india-prime-minister-the-lowdown-2738091-2025-06-09",
      "headline": "The Silent Ascent: How Lal Bahadur Shastri became India's Prime MinisterOn this day in 1964, Kamaraj's deft manoeuvring secured Lal Bahadur Shastri's rise amid a fierce succession battle."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kamal-haasan-mani-ratnam-thug-life-failure-what-went-wrong-2737898-2025-06-09",
      "headline": "What went wrong with Kamal Haasan and Mani Ratnam's Thug Life?Kamal Haasan and director Mani Ratnam's 'Thug Life' had all the ingredients for a gripping gangster saga. It marked the reunion of legendary collaborators, featured a powerful cast, and stunning technical craft, yet, it faltered by trying to juggle too many themes and underdeveloped storylines."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/elon-musk-endorses-post-by-us-president-donald-trump-on-los-angeles-riot-2737978-2025-06-09",
      "headline": "After deleting Epstein post, Elon Musk endorses Trump post. Signs of patch-up?Trump, in his post, has called for an apology from Governor Gavin Newsom and Mayor Karen Bass over the recent violence in the city as protestors took to the streets following the US President's sweeping crackdown on undocumented immigrants. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/andhra-pradesh/story/police-register-case-against-jagan-reddys-sakshi-tv-journalists-kommineni-srinivas-vv-krishnam-raju-for-derogatory-comments-on-women-2738086-2025-06-09",
      "headline": "Case against Jagan Reddy-owned news channel for derogatory remarks on womenAndhra Pradesh Police have filed a case against Telugu news channel, Jagan Mohan Reddy-owned Sakshi TV, and two journalists for alleged derogatory remarks against Amaravati women. One journalist has been arrested and taken into custody."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/video-australian-journalist-at-la-protests-shot-by-cops-with-rubber-bullet-2738062-2025-06-09",
      "headline": "Video: Australian journalist at LA protests shot by police with rubber bulletLauren Tomasi, US correspondent for Nine News, was covering demonstrations against immigration raids near the Metropolitan Detention Centre in downtown LA when she was struck with a rubber bullet."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/bengaluru-woman-murdered-by-alleged-lover-in-oyo-hotel-room-police-investigate-case-2737952-2025-06-09",
      "headline": "Bengaluru woman allegedly killed by techie boyfriend in hotel roomA 33-year-old woman was allegedly murdered by a 25-year-old techie in a Bengaluru hotel. The two were close, but she had been distancing herself, said police. Angered by this, he reportedly stabbed her to death."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-lbw-controversy-tnpl-dindigul-dragons-tiruppur-tamizhans-collapse-2738090-2025-06-09",
      "headline": "TNPL: R Ashwin slammed for arguing with umpire, storming off the field in angerTNPL 2025: R Ashwin drew criticism for his outburst at an on-field umpire after being given out LBW. His side, Dindigul Dragons, went on to lose to iDream Tiruppur Tamizhans on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/meghalaya-murder-case-indore-couple-man-killed-sonam-surrender-top-highlights-updates-2737812-2025-06-09",
      "headline": "Honeymoon murder, wife caught, 'lover' arrested: What we know about Meghalaya caseAccording to Raja's brother, Vipul, and sources, Sonam's alleged lover, Raj Kushwaha, was an employee at her father's plywood factory. Raj Kushwaha, who is reportedly five years younger, has been arrested by the Indore Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/currency-devaluation-wealth-erosion-property-value-drop-investment-timing-your-rs-1-crore-flat-is-now-rs-90-lakh-investor-explains-why-value-is-shrinking-2738044-2025-06-09",
      "headline": "Your Rs 1 crore flat is now Rs 90 lakh: Investor explains why value is shrinkingA financial influencer warns that unchecked money printing and currency devaluation could be reducing the real value of properties and other assets, urging investments in inflation-resistant assets."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/delhi-humidity-soar-on-sunday-to-seventy-percent-jammu-undergoes-heatwave-2737761-2025-06-09",
      "headline": "45 degrees likely in Delhi-NCR tomorrow, heatwave alert for next three daysThe yellow warning regarding a heat wave prevailing in Delhi for the next three days, has now been upgraded to an orange one. The humidity levels were also as high as 70 per cent in the national capital on Sunday night. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/pakistan-army-asim-munir-back-foot-buzz-of-ex-pm-imran-khan-pti-protest-release-on-june-11-rawalpindi-2737878-2025-06-09",
      "headline": "Will Pak army blink? Buzz of ex-PM Imran Khan's release on June 11A claim by a senior leader of the PTI, Gohar Ali Khan, that Imran Khan may walk free on June 11 has ignited speculation that Army Chief Asim Munir is caving under pressure. The claim comes after Imran Khan last week vowed to lead a nationwide agitation from behind bars, at a time when the Munir-led army appears to be on the back foot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/who-is-chennai-techie-indian-origin-ashok-elluswamy-lead-tesla-optimus-humanoid-robot-project-elon-musk-2737886-2025-06-09",
      "headline": "Who is Chennai techie Ashok Elluswamy, set to lead Tesla's humanoid projectIndian-American engineer, Ashok Elluswamy, the director of Tesla Autopilot Software, will now lead the company's Optimus Humanoid Robot Programme following the exit of its former head, Milan Kovac. The Chennai-educated engineer, who has been with Tesla for over 11 years, is an expert in artificial intelligence."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wtc-final-venue-change-pat-cummins-australia-vs-south-africa-2738110-2025-06-09",
      "headline": "WTC final should be hosted by winners of previous edition: Pat CumminsAustralia captain Pat Cummins has proposed that World Test Championship final should be held in the previous winner's country. The idea challenges England's long-standing role as the permanent host, stirring debate over future venues."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/r-ashwin-lbw-controversy-tnpl-dindigul-dragons-tiruppur-tamizhans-collapse-2738090-2025-06-09",
      "headline": "TNPL: R Ashwin slammed for arguing with umpire, storming off the field in angerTNPL 2025: R Ashwin drew criticism for his outburst at an on-field umpire after being given out LBW. His side, Dindigul Dragons, went on to lose to iDream Tiruppur Tamizhans on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-tour-of-england-matthew-hayden-backs-kuldeep-yadav-key-spinner-test-series-2738022-2025-06-09",
      "headline": "Kuldeep Yadav could be a key bowler for India during England tour: Matthew HaydenMatthew Hayden believes Kuldeep Yadav will play a crucial role for India in the upcoming England Test series. Hayden emphasises the need for a reliable spinner in the side, highlighting the series as a tough challenge for India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/world-test-championship-final-australia-vs-south-africa-josh-hazlewood-hazlegod-nickname-ipl-2025-reaction-starc-lyon-comments-2737995-2025-06-09",
      "headline": "HazleGod: Josh Hazlewood and Australian teammates react to pacer's new nicknameJosh Hazlewood reacts to his new nickname 'HazleGod' after a stellar IPL 2025 season. Mitchell Starc and Nathan Lyon also commented on Hazlewood's new nickname ahead of the WTC final. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-trainining-london-australia-wtc-final-england-series-controversy-2737985-2025-06-09",
      "headline": "India train at Lord's, Aussies turned away before WTC final in fresh row: ReportAustralia were initially denied permission to train at Lord's on Saturday, just four days before their World Test Championship final against South Africa. Australian media reported that the Indian team, led by Shubman Gill, were granted access to train at the venue on the same day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-nations-league-final-spain-vs-portugal-cristiano-ronaldo-lamine-yamal-2737915-2025-06-09",
      "headline": "Cristiano Ronaldo defends Lamine Yamal after Nations League win: Leave him aloneCristiano Ronaldo has jumped to the defence of Lamine Yamal, saying that the Spanish sensation should be left alone and given his space. Yamal had a lacklustre outing in the final of the Nations League against Portugal. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-home-season-revised-schedule-delhi-test-november-pollution-2737890-2025-06-09",
      "headline": "Pollution problems? BCCI shifts November Test out of Delhi in fixtures overhaulThe Indian cricket board announced a revised home season schedule for the Test series against West Indies and South Africa later this year. A Test match in Delhi, which was originally scheduled for November, has been moved to Kolkata. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/world-test-championship-final-cameron-green-jasprit-bumrah-message-australia-vs-south-africa-2737862-2025-06-09",
      "headline": "When Jasprit Bumrah gave Cameron Green confidence with special message before surgeryCameron Green revealed that Jasprit Bumrah reached out to the Australian all-rounder before he underwent back surgery late last year. Green is all set to make a return to the Australia lineup for the World Test Championship final against South Africa. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-2025-carlos-alcaraz-jannik-spain-uefa-nations-league-final-2737836-2025-06-09",
      "headline": "After French Open win, Carlos Alcaraz left sad as Spain lose Nations League finalCarlos Alcaraz was left distraught after Spain lost their UEFA Nations League final against Portugal on Sunday, June 9. Alcaraz secured a comeback win against Jannik Sinner while Spain were beaten on penalties. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-nations-league-final-cristiano-ronaldo-spain-vs-portugal-injury-reaction-2737805-2025-06-09",
      "headline": "For Portugal, would have broken my leg: Cristiano Ronaldo on Nations League final injuryCristiano Ronaldo revealed that he played through pain in the final of the UEFA Nations League against Spain on Sunday, June 8. Ronaldo scored the equaliser in the game as Portugal won their second Nations League title with a win on penalties. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-2025-final-carlos-alcaraz-jannik-sinner-roger-federer-post-roland-garros-2737797-2025-06-09",
      "headline": "3 winners in Paris: Federer's heartwarming post after epic French Open finalRoger Federer posted a heartwarming message for Carlos Alcaraz and Jannik Sinner after their epic French Open final on Sunday, June 8. Alcaraz staged a stunning comeback to beat Sinner in five sets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-home-season-revised-schedule-delhi-test-november-pollution-2737890-2025-06-09",
      "headline": "Pollution problems? BCCI shifts November Test out of Delhi in fixtures overhaulThe Indian cricket board announced a revised home season schedule for the Test series against West Indies and South Africa later this year. A Test match in Delhi, which was originally scheduled for November, has been moved to Kolkata. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/world-test-championship-final-cameron-green-jasprit-bumrah-message-australia-vs-south-africa-2737862-2025-06-09",
      "headline": "When Jasprit Bumrah gave Cameron Green confidence with special message before surgeryCameron Green revealed that Jasprit Bumrah reached out to the Australian all-rounder before he underwent back surgery late last year. Green is all set to make a return to the Australia lineup for the World Test Championship final against South Africa. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-2025-carlos-alcaraz-jannik-spain-uefa-nations-league-final-2737836-2025-06-09",
      "headline": "After French Open win, Carlos Alcaraz left sad as Spain lose Nations League finalCarlos Alcaraz was left distraught after Spain lost their UEFA Nations League final against Portugal on Sunday, June 9. Alcaraz secured a comeback win against Jannik Sinner while Spain were beaten on penalties. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/uefa-nations-league-final-cristiano-ronaldo-spain-vs-portugal-injury-reaction-2737805-2025-06-09",
      "headline": "For Portugal, would have broken my leg: Cristiano Ronaldo on Nations League final injuryCristiano Ronaldo revealed that he played through pain in the final of the UEFA Nations League against Spain on Sunday, June 8. Ronaldo scored the equaliser in the game as Portugal won their second Nations League title with a win on penalties. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/french-open-2025-final-carlos-alcaraz-jannik-sinner-roger-federer-post-roland-garros-2737797-2025-06-09",
      "headline": "3 winners in Paris: Federer's heartwarming post after epic French Open finalRoger Federer posted a heartwarming message for Carlos Alcaraz and Jannik Sinner after their epic French Open final on Sunday, June 8. Alcaraz staged a stunning comeback to beat Sinner in five sets. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}