{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-israel-seal-investment-agreement-39-billion-trade-in-focus-2783951-2025-09-08",
      "headline": "India–Israel seal investment agreement, $3.9 billion trade in focusExperts believe the new deal could help push those numbers higher by making cross-border investments more secure and attractive."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/conclave-south-2025/story/can-coimbatore-become-indias-next-big-business-powerhouse-2783889-2025-09-08",
      "headline": "Can Coimbatore become India's next big business powerhouse?Mithun Ramdas, President of the Southern India Engineering Manufacturers Association, said Coimbatore enjoys strong natural advantages, being geographically well-placed, safe from major calamities, and well-connected across Tamil Nadu."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/is-coimbatore-ready-to-emerge-as-indias-next-business-powerhouse-2783892-2025-09-08",
      "headline": "Is Coimbatore ready to emerge as India's next business powerhouse?At the India Today Conclave South 2025, business leaders debated whether Coimbatore could rise as India's next big business hub. Already among the fastest-growing tier-2 cities, it is increasingly viewed as a strong rival to metros like Chennai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/festive-season-shopping-urban-india-spending-diwali-dussehra-ecommerce-online-gst-rate-cut-boost-2783853-2025-09-08",
      "headline": "Urban India set to spend Rs 2.19 lakh crore this festive season post GST boost: ReportUrban India is expected to spend around Rs 2.19 lakh crore during the upcoming festive period, reflecting a strong recovery in consumer sentiment, with GST rate cuts boosting sentiment. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-77-points-higher-nifty-above-24750-tata-motors-up-4-percent-2783801-2025-09-08",
      "headline": "Sensex closes 77 points higher, Nifty above 24,750; Tata Motors up 4%The S&P BSE Sensex gained 76.54 points to close at 80,787.30, while the NSE Nifty50 added 32.15 points to end at 24,773.15. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-tops-global-crypto-adoption-rankings-again-in-2025-report-2783757-2025-09-08",
      "headline": "India tops global crypto adoption rankings again in 2025: ReportMajor markets like India, Vietnam, and Pakistan drove APAC's crypto surge, pushing transaction volume from $1.4 trillion to $2.36 trillion in a year, according to the report."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-a-fake-loan-dropped-a-credit-score-overnight-explains-sebi-registered-analyst-2783725-2025-09-08",
      "headline": "How a fake loan dropped a credit score overnight, explains Sebi-registered analystA Sebi-registered analyst has shared a real-life story of how a single fake loan caused a credit score to crash overnight, showing just how vulnerable personal finances can be to fraud."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/conclave-south-2025/story/andhra-pradesh-nara-lokesh-trump-tariff-seafood-hosiery-industry-rajdeep-sardesai-south-conclave-2025-2783719-2025-09-08",
      "headline": "How is Andhra Pradesh dealing with Trump tariffs? Nara Lokesh answersWhen asked about the impact of Trump tariffs on Andhra Pradesh's growth plans, Nara Lokesh described the situation as a challenge but also an opportunity to reform."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/no-gst-on-life-and-health-insurance-how-much-will-you-really-save-2783695-2025-09-08",
      "headline": "No GST on life and health insurance: How much will you really save?Under the proposal, premiums for life and health insurance could be completely exempt from GST. You would pay only the base premium quoted by your insurer, without the 18% tax. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-much-will-trump-tariffs-hurt-india-here-is-what-top-adviser-said-2783671-2025-09-08",
      "headline": "How much will Trump tariffs hurt India? Here's what top adviser saidTrump doubled tariffs on Indian goods last month, arguing that New Delhi's imports of Russian oil were helping to fund Moscow's war in Ukraine."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/ups-to-nps-government-fixes-september-30-deadline-here-is-what-it-means-2783652-2025-09-08",
      "headline": "UPS to NPS: Government fixes September 30 deadline, here's what it meansThe government has given central employees under the Unified Pension Scheme (UPS) a one-time chance to shift back to the National Pension System (NPS), with 30 September 2025 set as the deadline."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/donald-trump-us-russian-oil-sanctions-tariffs-second-phase-impact-on-india-2783649-2025-09-08",
      "headline": "Trump warns of fresh Russia oil sanctions: Should India worry?Russian barrels have been critical to India's energy needs. At one point, nearly 40% of crude imports came from Russia. The discounted supply saved billions of dollars and kept petrol prices under control. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/anurag-kashyap-bandar-premiere-tiff-2025-india-flawed-prison-system-2783984-2025-09-08",
      "headline": "Anurag Kashyap's Bandar, on India's flawed prison system, premieres at TIFF 2025Director Anurag Kashyap's new film Bandar premiered at the 50th Toronto International Film Festival. The prison drama sheds light on India's slow judicial process and misuse of laws, sparking discussions on reform."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shehbaz-badesha-bigg-boss-19-entry-sidharth-shukla-would-want-me-to-win-shenaaz-gill-2783987-2025-09-08",
      "headline": "Shehbaz Badesha on Bigg Boss entry: Sidharth Shukla would want me to winShehbaz Badesha, in an interview, spoke about manifesting 'Bigg Boss 19.' He even recalled how once Sidharth Shukla predicted his stint on the show. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/conclave-south-2025/story/narain-karthikeyan-confirms-biopic-on-racing-journey-casting-underway-script-2783936-2025-09-08",
      "headline": "Narain Karthikeyan confirms biopic on racing journey: Script looks excitingIndia's first Formula One driver Narain Karthikeyan confirmed his biopic at the India Today Conclave South 2025 on Monday. The film will capture his early life and journey to Formula 2. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/k-pop-band-treasure-reflect-new-album-love-pulse-love-for-srk-bollywood-2783910-2025-09-08",
      "headline": "K-pop band TREASURE reflect on new album LOVE PULSE, love for SRK, BollywoodK-pop group TREASURE marks five years with their new mini album 'Love Pulse'. In an exclusive interview with IndiaToday.in, the boy band spoke about their new album, love for Bollywood and growing Indian fan base."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-zeishan-quadri-kunickaa-sadanand-son-ayaan-laal-puri-snatching-incident-weekend-ka-vaar-live-feed-2783806-2025-09-08",
      "headline": "Bigg Boss 19: Zeishan reacts to Kunickaa getting emotional over puris with sonBigg Boss 19 contestant Zeishan Quadri has declared he will not communicate with his co-contestant Kunickaa Sadanand for one week. The decision follows Kunickaa's son discussing the puri matter during 'Weekend Ka Vaar'. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/salman-khan-shuts-down-claims-of-ruining-careers-bigg-boss-19-didnt-build-or-break-anyone-2783871-2025-09-08",
      "headline": "Salman Khan shuts down claims of ruining careers: Didn't build or break anyoneSalman Khan recently addressed claims about ruining careers in cinema.  The actor stated that he can never ruin anyone's career. If at all it will happen, it will be his own. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/salman-khan-silence-over-kunickaa-sadanand-zeishan-quadri-puri-clash-exposes-bias-on-bigg-boss-19-2783900-2025-09-08",
      "headline": "Salman Khan's silence over Kunickaa-Zeishan's puri clash exposes bias on BB 19Why did Salman Khan stay silent on Kunickaa Sadanand-Zeishan Quadri's Chhole-Puri clash in 'Big Boss 19'? On Weekend Ka Vaar, Khan schooled contestants on food fights and even invoked the Punjab floods, but his silence on Kunickaa and Zeishan's controversial 'Puri' clash raises questions of bias in the show.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/bad-girl-varsha-bharath-anjali-sivaraman-heartbreak-healing-2783692-2025-09-08",
      "headline": "How Bad Girl celebrates female friendships that lift you upDirector Varsha Bharath's 'Bad Girl' is a coming-of-age film about a woman from a Brahmin family and her search for freedom. The film truly stands out in portraying the female friendships that uplift women. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ek-tha-tiger-only-hindi-film-at-us-spy-museum-wall-of-fame-kabir-khan-reacts-2783833-2025-09-08",
      "headline": "Ek Tha Tiger only Hindi film at US Spy Museum's Wall of Fame, Kabir Khan reactsActor Salman Khan's 'Ek Tha Tiger' has been recognised as the only Hindi film in the International Spy Museum's prestigious films' section. Director Kabir Khan reacted to the news and admitted that he was unaware of it."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kareena-kapoor-khan-birmingham-visit-sparks-chaos-as-fan-collapses-in-crowd-2783828-2025-09-08",
      "headline": "Kareena's Birmingham visit sparks chaos as fan collapses in crowdActor Kareena Kapoor recently attended a grand event in the United Kingdom. The event turned chaotic after a fan collapsed, creating panic. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/navya-nair-fined-aud-1980-australia-undeclared-jasmine-flowers-2783818-2025-09-08",
      "headline": "Actor Navya Nair fined over Rs 1 lakh for carrying Jasmine flowers to AustraliaMalayalam actor Navya Nair was fined AUD 1,980 (Rs 1.14 lakh) for carrying jasmine flowers to Australia. The actor shared a video of her wearing the jasmine flowers and called this experience a learning moment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/video/k-pop-group-treasure-ace-srks-pose-speak-about-india-3rd-mini-album-love-pulse-2783821-2025-09-08",
      "headline": "K-pop group TREASURE ace SRK's pose, speak about India, 3rd mini album LOVE PULSEIn this India-exclusive interview with India Today's Bhavna Agarwal, K-pop group TREASURE, the 10-member K-pop group that debuted in 2020 under YG Entertainment, open up about their journey from debut days to their latest comeback with the 3rd mini album Love Pulse. Known for their powerful performances and playful energy, the members reflect on how far they've come, what advice they would give to their younger debut selves, and how their bond has only grown stronger over the years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/sanjay-dutt-says-he-formed-a-theatre-group-in-jail-with-murder-convicts-2783704-2025-09-08",
      "headline": "Sanjay Dutt says he formed a theatre group in jail with murder convictsActor Sunjay Dutt recently opened up on Kapil Sharma's show about his time in prison. He shared that he ran a radio station, and directed a theatre group with convicts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/aryan-khan-the-bads-of-bollywood-trailer-promises-starry-cameos-shah-rukh-khan-aamir-khan-2783802-2025-09-08",
      "headline": "Aryan Khan's The Ba***ds of Bollywood trailer promises starry cameos, big dramaAryan Khan's 'The Ba***ds of Bollywood' trailer is finally out. Directed by Aryan Khan, the seven-episode series, promises starry cameos and a whole lot of drama. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/narain-karthikeyan-ajith-kumar-asian-le-mans-series-2783792-2025-09-08",
      "headline": "Narain Karthikeyan on teaming up with Ajith Kumar for Asian Le Mans SeriesNarain Karthikeyan and Tamil superstar Ajith Kumar are partnering to race in the Asian Le Mans Series. At the India Today Conclave South 2025, India's first-ever Formula One driver praised Ajith and opened up about their collaboration. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/a-silent-voice-anime-most-powerful-exploration-of-bullying-and-mental-health-2783650-2025-09-08",
      "headline": "A Silent Voice, anime's most powerful exploration of bullying and mental healthIn this week's Animania, we discuss how, in a world of flashy battles, 'A Silent Voice' won hearts by confronting bullying, disability and mental health with raw honesty and unforgettable emotion."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/rukmini-vasanth-defends-sandalwood-against-comparisons-with-other-indian-film-industries-2783763-2025-09-08",
      "headline": "Rukmini Vasanth defends Sandalwood against comparisons with other film industriesActor Rukmini Vasanth defended Sandalwood against the perception that it does not measure up to Bollywood, Kollywood, Mollywood, and Tollywood. At the India Today Conclave South 2025, she cited the massive success of 'KGF' and 'Kantara' to support her point."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/urmila-matondkar-dances-to-rangeela-at-51-fans-celebrate-her-queen-energy-2783726-2025-09-08",
      "headline": "Urmila Matondkar dances to Rangeela at 51, fans celebrate her queen energy. WatchActor Urmila Matondkar recreated her iconic dance track 'Rangeela Re' from Rangeela. In her recent post she spoke about how the 90s musical honours the Navrasas of Indian literature and poetry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahesh-babu-wife-namrata-shirodkar-children-sitara-gautam-ghatamaneni-enjoy-lady-gaga-new-york-concert-2783782-2025-09-08",
      "headline": "Namrata Shirodkar, children Sitara and Gautam enjoy Lady Gaga's New York concertMahesh Babu's wife, Namrata Shirodkar, had a great time with children, Sitara and Gautam Ghatamaneni, as they enjoyed Lady Gaga's New York concert. She shared  pictures from the memorable evening on social media. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/gen-z-protests-nepal-kp-sharma-oli-corruption-social-media-restrictions-2783683-2025-09-08",
      "headline": "20 killed in huge Nepal Gen Z protests over social media ban, Home Minister quitsAt least 20 people were killed and over 250 were injured in Nepal as thousands of Gen Z protesters, angered by corruption and a government ban on 26 social media platforms, have launched a massive agitation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-aide-navarro-fumes-x-fact-checks-attacks-on-india-fail-glbs-2783985-2025-09-08",
      "headline": "Bull****: Trump aide Navarro fumes at X fact-checks after attacks on India failThe White House trade adviser has now turned on X over its community notes, accusing the platform of foreign interference, while X repeatedly fact-checked him, stressing that India's energy trade is legal and sovereign."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/why-ex-election-commissioners-believe-poll-body-chief-gyanesh-kumar-is-wrong-on-rahul-gandhi-vote-chori-allegations-2783796-2025-09-08",
      "headline": "Why ex-ECs believe poll body chief is wrong on Rahul GandhiThree former Election Commissioners said at the India Today South Conclave that CEC Gyanesh Kumar's affidavit demand and combative tone in response to Congress leader Rahul Gandhi's \"vote chori\" claim weren't right. They said the EC should have probed the matter instead to preserve public trust in the electoral process."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/economic-practices-should-be-fair-transparent-benefit-everyone-jaishankar-at-brics-meet-amid-trump-tariffs-2783997-2025-09-08",
      "headline": "Economic practices should be fair: S Jaishankar at Brics meet amid Trump tariffsSpeaking at the virtual Brics virtual meeting, Jaishankar said the group should focus on building a more resilient supply chain, especially at a time when multiple disruptions are affecting international trade."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/nepal-gen-z-protests-kathmandu-social-media-trend-nepo-kids-nepo-baby-corruption-reasons-demands-explained-2783822-2025-09-08",
      "headline": "Behind Nepal's Gen Z protests is a nepo-kid triggerIt isn't just the sweeping social media ban that has made Nepal's Gen Z take to the streets against the KP Sharma Oli government. Anger over systemic corruption and privilege for elites, especially the political nepokids, was brewing. Such has been the outburst that at least 16 people have been killed in the protester-police clashes. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/nepal-gen-z-protest-live-updates-curfew-in-kathmandu-oli-government-in-emergency-huddle-security-forces-use-tear-gas-2783755-2025-09-08",
      "headline": "Live: Nepal Home Minister quits as protests swells beyond KathmanduNepal protest Live: 20 people were killed and over 250 were injured in Nepal as tens of thousands protested in Kathmandu on Monday against a government ban on major social media platforms, including Facebook, X and YouTube, for not registering under state rules. Demonstrators stormed barricades in New Baneswar, surrounded Parliament and forced riot police to retreat. Security forces responded with tear gas and water cannons. One person was killed and 80 injured, including two journalists. Follow indiatoday.in for live updates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/organise-fairs-tell-traders-about-gst-20-benefits-promote-make-in-india-campaign-pm-to-mps-in-key-meet-2783911-2025-09-08",
      "headline": "Organise fairs, educate traders on GST 2.0, promote 'Make in India': PM to MPsPM Modi instructed all NDA MPs to conduct meetings with local traders and shopkeepers to explain the benefits of GST 2.0, and promote the \"Make in India\" campaign, the sources said. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/gst-20-as-narendra-modi-govt-bets-on-consumption-to-power-growth-mind-the-bumps-too-2783948-2025-09-08",
      "headline": "GST 2.0: As Modi govt bets on consumption to power growth, mind the bumps tooThe GST revamp, paired with income-tax relief earlier, aims to unleash middle-class spending. But state revenue risks, private investment stagnation and global headwinds loom as pain points"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/the-lowdown/story/rajasthan-si-exam-2021-scam-the-big-fish-in-the-pond-2783824-2025-09-08",
      "headline": "When dreams were sold: The big fish in Rajasthan's SI-exam scam pondThe 2021 Rajasthan Sub-Inspector recruitment exam, revealed a rotten system where power, politics, and greed conspired to crush dreams. Beyond the leaked papers and fake candidates lies a deeper story about how corruption festers when oversight fails, and how justice finally struck a decisive blow—cancelling the entire exam and shattering numerous lives. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/vice-president-election-nda-radhakrishnan-vs-india-bloc-sudershan-reddy-2783854-2025-09-08",
      "headline": "NDA's CP Radhakrishnan vs INDIA's Sudershan Reddy: Stage set for Veep pollsThe election for Vice President of India will unfold on Tuesday, as MPs choose between NDA nominee CP Radhakrishnan and opposition candidate B Sudershan Reddy. The poll, held through secret ballot, will decide who succeeds Jagdeep Dhankhar to the constitutional post."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/probe-dont-dare-chidambaram-as-ex-ecs-say-poll-body-chief-wrong-on-rahul-gandhi-2783970-2025-09-08",
      "headline": "Chidambaram questions poll chief as ex-ECs call his anger on Rahul Gandhi unjustP Chidambaram hit out at Chief Election Commissioner Gyanesh Kumar, citing rare criticism from three former poll officials who faulted his response to Rahul Gandhi's \"vote chori\" charge. Chidambaram said it was the Election Commission's duty to probe such complaints, not challenge the Leader of Opposition with demands for affidavits or apologies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tn-annamalai-backs-aiadmk-bjp-alliance-calls-it-a-pragmatic-move-high-command-2783955-2025-09-08",
      "headline": "Reality is BJP can't win 2026 solo: Annamalai on tying up with AIADMK in Tamil NaduAt the India Today South Conclave 2025, ex-Tamil Nadu BJP chief K Annamalai said the party has always aimed to grow on its own, but admitted it cannot form power alone in 2026. With new players like Vijay entering the fray, he said the priority was to throw DMK out of power."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/why-nepal-banned-social-media-whatsapp-tiktok-facebook-genz-revolution-2783741-2025-09-08",
      "headline": "Why Nepal banned social media? All about the move that sparked GenZ revolutionNepal's sweeping ban on major social media platforms has triggered a massive youth-led uprising, with thousands of Gen Z protesters flooding the streets of Kathmandu. Clashes with security forces have left one dead, dozens injured, and the army deployed as the government scrambles to contain the unrest."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/why-mp-need-training-presidential-vice-president-election-cp-radhakrishnan-b-sudershan-reddy-jagdeep-dhankhar-complicated-explained-2783832-2025-09-08",
      "headline": "Why MPs need training for Vice-Presidential election? It's complicatedThe Vice-President election is scheduled for September 9, and MPs from both the Lok Sabha and Rajya Sabha are undergoing training to understand the complex voting process. Here's a closer look at how both Presidential and Vice Presidential elections are conducted and why MPs need training."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/haryana-man-shot-dead-california-stopping-public-urination-2783677-2025-09-08",
      "headline": "Haryana man, 26, shot dead in US after stopping another from urinating in publicA man from Haryana's Jind was fatally shot in California after he objected to a person urinating in public. Kapil had gone to the US through the illegal Dunki route, and the authorities are yet to arrest his killer."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/indian-woman-caught-shoplifting-us-target-store-breaks-down-cops-interrogation-video-bodycam-footage-2783662-2025-09-08",
      "headline": "Indian woman caught shoplifting in US, breaks down as cops interrogate. Video viralIn a viral video, an Indian woman was seen sitting in an interrogation room with folded hands as police officers questioned her. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/arunachal-activist-bhanu-tatak-stopped-delhi-airport-siang-dam-protests-2783858-2025-09-08",
      "headline": "Arunachal activist stopped from travelling abroad at Delhi airport. Here's whyEnvironment activist Bhanu Tatak was stopped from boarding a flight to Ireland at Delhi airport on September 7 over a lookout circular issued by the Arunachal Pradesh Police. She was set to begin a three-month short course at Dublin City University.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/law-news/story/aadhaar-will-count-as-id-for-bihar-voter-list-revision-but-not-as-citizenship-proof-poll-body-to-supreme-cou-2783779-2025-09-08",
      "headline": "Aadhaar valid ID for voter list, but not citizenship: Supreme Court to poll bodyThe court ordered that Aadhaar be treated as the 12th document in the list of acceptable identity proofs under the voter registration framework in Bihar. Authorities may verify Aadhaar like other documents with additional proof, and the Election Commission will issue instructions by September 9."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/aryan-khan-the-bads-of-bollywood-trailer-promises-starry-cameos-shah-rukh-khan-aamir-khan-2783802-2025-09-08",
      "headline": "Aryan Khan's The Ba***ds of Bollywood trailer promises starry cameos, big dramaAryan Khan's 'The Ba***ds of Bollywood' trailer is finally out. Directed by Aryan Khan, the seven-episode series, promises starry cameos and a whole lot of drama. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/from-the-india-today-archives-2010-indian-hockey-a-victory-off-the-field-2783918-2025-09-08",
      "headline": "From the India Today archives (2010) | Indian hockey: A victory off the fieldCelebrating India's Asia Cup 2025 title victory, we rewind to 2010 when the men's hockey team had notched a rare triumph over officialdom"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/upsc-success-rates-age-factor-persistence-civil-services-exam-2783844-2025-09-08",
      "headline": "UPSC age factor: Start at 21 or later, who has a better chance?Ansar Shaikh and Ira Singhal showcase contrasting UPSC success stories at different ages. Their journeys highlight how age influences but does not determine exam outcomes in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/three-soldiers-injured-one-critical-during-encounter-with-terrorists-in-jks-kulgam-gunbattle-on-2783528-2025-09-08",
      "headline": "Top Lashkar terrorist, 1 other killed in gunfight with security forces in J&KA top Lashkar-e-Taiba terrorist was among the two terrorists killed in a gunfight with security forces in Jammu and Kashmir's Kulgam. Three Army personnel also sustained injuries in the encounter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/british-vlogger-praises-india-says-country-does-not-deserve-online-negativity-2783843-2025-09-08",
      "headline": "British vlogger's 'India doesn't deserve the hate it gets online' video goes viralA British traveller and content creator has drawn attention online after posting a video in which he praised India while challenging the negativity the country often faces on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/donald-trump-incredulous-idea-nobel-peace-prize-department-of-war-film-apocalypse-now-lt-col-bill-kilgore-iran-venezuela-2783680-2025-09-08",
      "headline": "America's Absurdocalypse NowUS President Donald Trump, who campaigned as a \"Peace President\", has escalated military actions abroad and on US soil, and even rebranded the Defence Department the Department of War. His pursuit of the Nobel Peace Prize stands in sharp contrast to a war-lover persona, American airstrikes on Iran, and threats to California."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/cafa-nations-cup-india-finish-3rd-beat-oman-khalid-jamil-2784008-2025-09-08",
      "headline": "India edge Oman on penalties to finish 3rd in CAFA Nations CupIndia ended a challenging stretch on a high, beating Oman 3-2 on penalties to claim third in the CAFA Nations Cup. Gurpreet Singh Sandhu's heroics and Jamil's attacking plan sparked renewed hope for Indian football."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/video/hockey-asia-cup-tokyo-2020-medal-shut-critics-hardik-singh-exclusive-2783964-2025-09-08",
      "headline": "Not Hockey Asia Cup 2025, Tokyo 2020 medal was enough to shut critics: Hardik SinghIndia Hockey star Hardik Singh believes that the side's bronze medal win in the Tokyo 2020 Olympics had shut their critics up already, even before their recent Asia Cup 2025 triumph in Rajgir. India defeated Korea 4-1 in the Hockey Asia Cup final in Rajgir to win their fourth title and secure a World Cup spot."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-will-miss-rohit-sharmas-t20-world-cup-winning-strategy-in-asia-cup-mohammad-kaif-2783942-2025-09-08",
      "headline": "India will miss Rohit's T20 World Cup-winning strategy in Asia Cup: Mohammad KaifMohammad Kaif believes India's Asia Cup 2025 campaign will miss Rohit Sharma's T20 World Cup-winning strategy. India start their campaign against the UAE on September 10."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/hockey-asia-cup-manpreet-singh-dedicates-win-punjab-flood-victims-exclusive-2783965-2025-09-08",
      "headline": "Manpreet Singh dedicates India's Asia Cup hockey triumph to Punjab flood victimsIndia's Asia Cup 2025 triumph carries emotion as Manpreet Singh, speaking exclusively to India Today, dedicated the victory to Punjab flood victims. The 4-1 final win over Korea also secures direct qualification for the 2026 FIH World Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-2025-arshdeep-singh-biggest-challenge-lack-of-match-practice-bharat-arun-2783913-2025-09-08",
      "headline": "Lack of match practice to be biggest challenge for Arshdeep Singh: Bharat ArunFormer India bowling coach Bharat Arun believes that Arshdeep Singh's might struggle in the Asia Cup 2025. Bharat Arun points out Arshdeep's lack of match practice ahead of the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/chris-gayle-on-sarfaraz-khans-place-in-the-indian-test-team-2783863-2025-09-08",
      "headline": "Sarfaraz Khan should be in Indian Test team, no issues with his weight: GayleChris Gayle has said that middle order batter Sarfaraz Khan deserves to be a part of the Indian Test team. The vintage West Indian opener advocates for a consistent run for Khan in the longest format, applauding his performance in domestic cricket."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/conclave-south-2025/video/narayan-karthikeyan-conclave-south-indian-racing-ajith-le-mans-2783777-2025-09-08",
      "headline": "India's motorsport scene will soon be back on track: Narain KarthikeyanSpeaking at India Today's South Conclave on Monday, September 8, India's first-ever Formula One driver and Padma Shri awardee Narain Karthikeyan said interest in racing is growing, fuelled by the popularity of shows like Drive to Survive, which put F1 on the global map and made motorsport more accessible to the public."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-siraj-icc-player-month-august-2025-england-series-performance-2783837-2025-09-08",
      "headline": "Siraj nominated for ICC Player of the Month for August after England heroicsMohammed Siraj has been nominated as ICC Player of the Month for August 2025 after a brilliant England Test series. He's been shortlisted alongside New Zealand's Matt Henry and West Indies' Jayden Seales in the men's category."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/video/vishal-tk-kalaivani-boxer-push-up-challenge-india-today-conclave-2783823-2025-09-08",
      "headline": "Watch: Vishal TK, Kalaivani get into push-up challenge at South Conclave400m national record holder Vishal TK and boxer Kalaivani Srinivasan got into a fun push-up contest at the India Today South Conclave. Before that, the duo passionately spoke about the changing landscape of athletics in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/vishal-tk-india-running-revolution-schools-conclave-south-2783816-2025-09-08",
      "headline": "Indian schools need to play big part in country's sporting revolution: Vishal TKIndia's 400m specialist Vishal TK believes that schools need to play a big part in promoting sports culture in India. Speaking at the India Today South Conclave, Vishal said that India has a lot of potential in the world of athletics."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/wasim-jaffer-on-suryakumar-yadavs-poor-form-asia-cup-2025-2783798-2025-09-08",
      "headline": "Suryakumar Yadav not scoring runs while leading India is a concern: Wasim JafferWasim Jaffer has expressed concern over Suryakumar Yadav's poor batting form while leading India's T20I side. The Asia Cup 2025 will be a crucial test for Surya's captaincy and batting in a major event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/conclave-south-2025/video/narayan-karthikeyan-conclave-south-indian-racing-ajith-le-mans-2783777-2025-09-08",
      "headline": "India's motorsport scene will soon be back on track: Narain KarthikeyanSpeaking at India Today's South Conclave on Monday, September 8, India's first-ever Formula One driver and Padma Shri awardee Narain Karthikeyan said interest in racing is growing, fuelled by the popularity of shows like Drive to Survive, which put F1 on the global map and made motorsport more accessible to the public."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/mohammed-siraj-icc-player-month-august-2025-england-series-performance-2783837-2025-09-08",
      "headline": "Siraj nominated for ICC Player of the Month for August after England heroicsMohammed Siraj has been nominated as ICC Player of the Month for August 2025 after a brilliant England Test series. He's been shortlisted alongside New Zealand's Matt Henry and West Indies' Jayden Seales in the men's category."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/video/vishal-tk-kalaivani-boxer-push-up-challenge-india-today-conclave-2783823-2025-09-08",
      "headline": "Watch: Vishal TK, Kalaivani get into push-up challenge at South Conclave400m national record holder Vishal TK and boxer Kalaivani Srinivasan got into a fun push-up contest at the India Today South Conclave. Before that, the duo passionately spoke about the changing landscape of athletics in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/vishal-tk-india-running-revolution-schools-conclave-south-2783816-2025-09-08",
      "headline": "Indian schools need to play big part in country's sporting revolution: Vishal TKIndia's 400m specialist Vishal TK believes that schools need to play a big part in promoting sports culture in India. Speaking at the India Today South Conclave, Vishal said that India has a lot of potential in the world of athletics."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/wasim-jaffer-on-suryakumar-yadavs-poor-form-asia-cup-2025-2783798-2025-09-08",
      "headline": "Suryakumar Yadav not scoring runs while leading India is a concern: Wasim JafferWasim Jaffer has expressed concern over Suryakumar Yadav's poor batting form while leading India's T20I side. The Asia Cup 2025 will be a crucial test for Surya's captaincy and batting in a major event."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}