{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/us-tariffs-will-not-have-significant-adverse-impact-on-indian-economy-sources-2764783-2025-08-01",
      "headline": "US tariffs will not have significant adverse impact on Indian economy: SourcesThe 25% tariff announced by US President Donald Trump will not have a significant adverse impact on the Indian economy, government sources said."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/elon-musk-starlink-monthly-plan-cost-spacex-telecom-satellite-launch-jyotiraditya-scindia-2764764-2025-08-01",
      "headline": "Elon Musk's Starlink to operate soon in India. Check monthly plansUnion Telecom Minister Jyotiraditya Scindia confirmed that Starlink has been awarded a Unified Licence to launch its satellite internet operations in India. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-586-points-lower-nifty-below-25600-infosys-ends-3-percent-down-2764795-2025-08-01",
      "headline": "Sensex closes 586 points lower, Nifty below 25,600; Infosys ends 3% downThe S&P BSE Sensex lost 585.67 points to close at 80,599.91, while the NSE Nifty50 was down by 203 points to end at 24,565.35. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/fd-tips-loss-emergency-fund-mistake-insurance-fund-personal-finance-money-saving-2764639-2025-08-01",
      "headline": "CA explains why you should not use FDs as an emergency fundAccording to RBI guidelines, banks can charge up to 0.5% to 1.0% of the interest rate as a penalty if FDs are broken before their maturity period."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/no-compromise-on-agriculture-dairy-farmers-interest-government-sources-on-us-tariff-2764724-2025-08-01",
      "headline": "Indian interests top priority, no chance of compromising due to US tariffs: SourcesAn official said that the government is closely watching the developments but sees no reason for alarm after the US imposed a 25% tariff on India. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/jane-street-news-probe-not-cooperating-staff-income-tax-department-books-outside-india-report-2764710-2025-08-01",
      "headline": "Jane Street not cooperating in probe with income tax department: ReportThe firm's servers are located outside India, and officials said they are unable to access them. Additionally, accounts books are also being maintained overseas, even though company law requires them to be kept in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/planning-to-buy-a-car-without-taking-loan-heres-how-you-can-do-it-2764705-2025-08-01",
      "headline": "Planning to buy a car without taking loan? Here's how you can do itThink you need a big salary or bank loan to own a car? Think again. A thoughtful plan, regular savings, and side gigs helped one man save Rs 7.1 lakh in three years, all without borrowing a rupee. Here's how you can do it too."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/pnb-housing-finance-ltd-share-crash-18-percent-today-4-month-low-reason-md-ceo-resign-girish-kousgi-2764659-2025-08-01",
      "headline": "Explained: Why PNB Housing Finance Ltd shares crashed 18% todayPNB Housing Finance Ltd share crash: The steep fall followed days of weak performance. Over the past five days, the stock has lost 19.59%, and in the last month, it has dropped 26.53%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/new-tax-rules-coming-soon-how-the-income-tax-bill-2025-could-impact-you-2764621-2025-08-01",
      "headline": "New tax rules coming soon. How the Income Tax Bill 2025 could impact youThe new law aims to make income tax rules easier to understand, reduce legal disputes, and help people comply with tax rules more easily. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/sebi-upcoming-ipo-proposal-equity-dilution-25-percent-rule-report-2764605-2025-08-01",
      "headline": "Sebi may relax IPO float norms for big firms to just 2.5% equity: ReportAt present, Sebi rules say that any company with a post-issue capital of more than Rs 1 lakh crore must offer 5% equity and raise at least Rs 5,000 crore. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/ed-investigates-anil-ambani-in-loan-fraud-case-summoned-on-august-5-2764523-2025-08-01",
      "headline": "ED investigates Anil Ambani in loan fraud case, summoned on August 5The Enforcement Directorate (ED) has summoned Anil Ambani for questioning on August 5 in the national capital. This is in connection with an investigation into an alleged loan fraud of Rs 12,500 crore. The development follows multiple searches the ED carried out at 35 locations in Mumbai, targeting business entities linked to the Anil Ambani group under the Prevention of Money Laundering Act (PMLA). The probe agency's action is also based on findings from a separate investigation by the Securities and Exchange Board of India (SEBI). A key point in the investigation is an alleged diversion of funds, with the transcript stating, \"The development actually came after the SEBI shared with the enforcement directorate the findings of a separate probe that launched into the alleged diversion of 10,000 crore by the Reliant infrastructure.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/anil-ambani-ed-summon-loan-fraud-news-august-5-questioning-enforcement-directorate-sebi-report-findings-2764568-2025-08-01",
      "headline": "Why has ED summoned Anil Ambani on August 5Anil Ambani, chairman and managing director of Reliance Group, has been summoned by the Enforcement Directorate (ED) for questioning on August 5. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aanand-l-rai-calls-ai-version-of-raanjhanaa-a-betrayal-after-producers-statement-2764569-2025-08-01",
      "headline": "Aanand L Rai calls AI version of Raanjhanaa a betrayal after producers' statementFilmmaker Aanand L Rai stated in a long note on social media that he neither supports nor approves of the AI-modified version of 'Raanjhanaa', describing it as unauthorised. The film was originally released in 2013.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/housefull-5-ott-when-where-watch-akshay-kumar-comedy-2764657-2025-08-01",
      "headline": "Housefull 5 OTT release: When and where to watch Akshay Kumar's comedy drama 'Housefull 5', starring Akshay Kumar and Riteish Deshmukh, is now out on Prime Video. Set on a cruise, the film is full of comedy, confusion, and lots of drama as three men claim to be the same person."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/top-films-and-shows-to-watch-on-ott-this-weekend-july-28-august-3-2025-2764822-2025-08-01",
      "headline": "Top films and shows to watch on OTT this weekendOTT's new weekend lineup caters to all tastes, featuring a mix of documentaries, anime, dramas, and comedy shows. From thought-provoking political documentaries to thrilling action and heartfelt stories, there is something engaging for every viewer in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/exclusive-my-oxford-year-sofia-carson-corey-mylchreest-chemistry-bollywood-love-language-2764824-2025-08-01",
      "headline": "Exclusive: Sofia Carson, Corey Mylchreest on Bollywood, chemistry, love languageIn an exclusive interaction with India Today, 'My Oxford Year' actors Sofia Carson and Corey Mylchreest spoke about their love for Bollywood and the possibilities of exploring the new sphere. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shikhar-pahariya-praises-janhvi-kapoor-in-pardesiya-song-param-sundari-2764775-2025-08-01",
      "headline": "Shikhar Pahariya gushes over Janhvi Kapoor in Pardesiya: Best song and best girlJanhvi Kapoor and Sidharth Malhotra's romantic track 'Pardesiya' from 'Param Sundari' is winning hearts. Janhvi's boyfriend Shikhar Pahariya shared the song on Instagram and called it the best song and tagged her as his best girl. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahesh-babu-birthday-to-pass-without-ssmb29-teaser-heres-why-ss-rajamouli-priyanka-chopra-2764765-2025-08-01",
      "headline": "Mahesh Babu's birthday to pass without SSMB29 teaser. Here's why!Director SS Rajamouli has chosen not to release any teaser or poster on actor Mahesh Babu's birthday. The filmmaker is focusing on a global scale reveal for the ambitious action film scheduled to release in 2027."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/liam-neeson-naked-gun-reboot-2025-comedy-detective-pamela-anderson-2764778-2025-08-01",
      "headline": "The Naked Gun review: Liam, Pamela's film is ridiculously silly,and it's a good thingRelease Date:Fri Aug 01, 2025Liam Neeson stars as the bumbling detective in The Naked Gun reboot. The film's absurd humour and nostalgic charm bring fresh life to the classic franchise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/kothalavadi-review-oldschool-screenplay-weighs-down-an-interesting-village-drama-2764773-2025-08-01",
      "headline": "Kothalavadi review: Old-school screenplay weighs down interesting village dramaRelease Date:Fri Aug 01, 2025Kothalavadi film review: Debutant Sriraj's Kannada film stars Pruthvi Ambar and Gopalkrishna Deshpande. Produced by Yash's mother Pushpa Arunkumar, 'Kothalavadi' explores a clash between the struggling village folk and the police trying to guide them on the right path."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/disha-patani-sister-khushboo-clarifies-remarks-directed-at-aniruddhacharya-not-premanand-ji-2764712-2025-08-01",
      "headline": "Khushboo Patani clarifies: Remarks directed at Aniruddhacharya, not Premanand JiActor Disha Patani's sister Khusboo Patani clarified that her comments were directed at Aniruddhacharya's misogynistic views and not about spiritual leader Premanand Ji Maharaj. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saiyaara-star-aneet-gets-touching-tribute-from-her-school-still-that-girl-in-uniform-2764760-2025-08-01",
      "headline": "Saiyaara star Aneet gets touching tribute from her school: Still that girl in uniformLong before she lit up the big screen in 'Saiyaara', Aneet Padda was just a girl in a school uniform, dreaming quietly in a classroom in Amritsar. This week, her alma mater reminded her, and the world, where it all began, with a tribute that brought both tears and gratitude."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/kyunki-saas-bhi-kabhi-bahu-thi-episode-3-update-tulsi-finally-gets-her-due-wrinkle-weight-and-husband-who-sees-her-2764745-2025-08-01",
      "headline": "Kyunki Episode 3: Tulsi finally gets her due-wrinkles, weight, husband who sees herKyunki Saas Bhi Kabhi Bahu Thi new episode: In a rare moment of honesty on Indian television, Mihir tells Tulsi that her wrinkles aren't signs of ageing but marks of sacrifice - lines etched by years of holding her family together. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aamir-khan-visit-lagaans-kunariya-village-after-25-years-sitaare-zameen-par-screening-2764750-2025-08-01",
      "headline": "Aamir Khan to visit Lagaan's Kunariya village after 25 years for Sitaare screeningAamir Khan is set to visit the 'Lagaan' village near Bhuj for the special screening of his film 'Sitaare Zameen Par.' The film released in theatres on June 20. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aamir-khan-sitaare-zameen-par-premieres-on-youtube-pay-per-view-model-what-it-means-for-the-industry-2764746-2025-08-01",
      "headline": "What Sitaare Zameen Par's pay-per-view release on YouTube means for the industryAamir Khan has taken a bold step by releasing his film 'Sitaare Zameen Par' on YouTube via pay-per-view for Rs 100, marking a fresh attempt to revive TVOD in India. This move challenges traditional theatrical norms and aims to leverage YouTube's massive reach. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/my-oxford-year-review-sofia-carson-corey-mylchreest-love-loss-2764731-2025-08-01",
      "headline": "My Oxford Year review: An imperfect yet effective slow-burn anchored by Sofia, CoreyRelease Date:Fri Aug 01, 2025'My Oxford Year' movie review: 'My Oxford Year' is a reflective romantic drama about love's true meaning and impermanence. The film invites viewers to cherish moments of love beyond grand gestures and melodrama."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/kingdom-box-office-vijay-deverakonda-film-breaks-record-earns-rs-15-crore-2764718-2025-08-01",
      "headline": "Kingdom box office Day 1: Vijay Deverakonda's film breaks record, earns Rs 15 croreVijay Deverakonda broke a record with his latest release 'Kingdom'. The film witnessed an impressive opening as it earned Rs 15 crore on the first day. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/whats-wrong-with-secretary-kim-perfect-starter-k-drama-beginners-2764667-2025-08-01",
      "headline": "Why What's Wrong with Secretary Kim is the perfect starter K-drama for newbiesLooking to start your K-drama journey? In this week's K-fix we will discuss why 'What's Wrong with Secretary Kim' is the perfect beginner-friendly Korean drama packed with romance, comedy, and classic tropes that will leave you hooked."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/happy-gilmore-2-review-adam-sandler-returns-with-a-swing-and-a-hole-lot-of-heart-2764649-2025-08-01",
      "headline": "Happy Gilmore 2 review: Adam Sandler returns with a swing and a hole lot of heartRelease Date:Fri Jul 25, 2025Happy Gilmore 2 movie review: 'Happy Gilmore 2' sees Adam Sandler return with his trademark humour. The film balances comedy, family drama, and nostalgia, making it a heartfelt and entertaining watch for audiences across"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/ali-fazal-meets-pedro-pascal-on-flight-and-the-internet-is-loving-it-2764679-2025-08-01",
      "headline": "Ali Fazal bumps into Pedro Pascal on flight, and the internet is loving itBollywood actor Ali Fazal has sparked curiosity among fans by sharing a mysterious photo with Hollywood star Pedro Pascal during a flight. The encounter has ignited excitement and speculation across. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/video/exclusive-sofia-carson-corey-mylchreest-on-my-oxford-year-bollywood-love-language-india-today-2764663-2025-08-01",
      "headline": "Exclusive: Sofia Carson, Corey Mylchreest on My Oxford Year, Bollywood, love language | India TodayIn an exclusive chat with India Today's Bhavna Agarwal, Sofia Carson and Corey Mylchreest open up about their simmering chemistry in My Oxford Year, what's their love language, and a possible Bollywood project!"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/no-compromise-on-agriculture-dairy-farmers-interest-government-sources-on-us-tariff-2764724-2025-08-01",
      "headline": "Indian interests top priority, no chance of compromising due to US tariffs: SourcesAn official said that the government is closely watching the developments but sees no reason for alarm after the US imposed a 25% tariff on India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/taken-note-of-trumps-25-tariffs-on-india-studying-them-says-new-delhi-2764827-2025-08-01",
      "headline": "Nothing to say: India on Trump's 'dead economy' remark, reviews 25% tariff impactStanding by its decision to purchase oil from Russia, India stated that its choices are guided by the prevailing global scenario and the best available deals in the market to secure the country's energy needs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/prajwal-revanna-former-jds-mp-convicted-for-rape-breaks-down-in-court-2764732-2025-08-01",
      "headline": "Ex-JDS MP Prajwal Revanna convicted for rape, verdict came in just 14 monthsA Karnataka special court has convicted former JDS MP Prajwal Revanna in a rape case filed by a domestic worker. The verdict came just 14 months after a case was filed against him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-5th-test-london-weather-day-2-live-score-updates-2764717-2025-08-01",
      "headline": "5th Test, Day 2 Live: Duckett, Crawley off to a rapid startIndia (IND) vs England (ENG), 5th Test, Day 2 Live Score and Weather Updates: Ben Duckett and Zak Crawley are off to a rapid start at The Oval. They have made the best use of the conditions and have dominated the Indian bowlers with some aggressive intent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aamir-khan-sitaare-zameen-par-premieres-on-youtube-pay-per-view-model-what-it-means-for-the-industry-2764746-2025-08-01",
      "headline": "What Sitaare Zameen Par's pay-per-view release on YouTube means for the industryAamir Khan has taken a bold step by releasing his film 'Sitaare Zameen Par' on YouTube via pay-per-view for Rs 100, marking a fresh attempt to revive TVOD in India. This move challenges traditional theatrical norms and aims to leverage YouTube's massive reach. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/odisha-peon-gives-urine-instead-of-water-to-senior-officer-arrested-gajapati-2764793-2025-08-01",
      "headline": "Peon gives urine to senior when asked for water in Odisha, arrestedA peon in Odisha was arrested for allegedly handing a bottle of urine to his senior officer instead of drinking water, leading to the officer's hospitalisation. The incident occurred in Gajapati district."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/election-commission-rebuts-rahul-gandhi-vote-theft-charge-bihar-roll-revision-sir-2764771-2025-08-01",
      "headline": "Don't pay heed: Poll body rebuts Rahul Gandhi's 'vote theft' chargeThe Election Commission dismissed Rahul Gandhi's allegations of vote theft as baseless and urged officials to ignore such \"irresponsible statements.\" Gandhi accused the poll body of aiding the BJP and called their actions \"no less than treason.\"\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/we-look-up-each-time-a-plane-takes-off-inside-ground-zero-of-air-india-crash-2764211-2025-07-31",
      "headline": "'We look up each time a plane takes off': Inside Ground Zero of Air India crashHow students and faculty at Ahmedabad's Byramjee Jeejeebhoy Medical College are coping with the trauma"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/video-20-minute-long-lightning-spectacle-seen-from-fight-to-india-2764723-2025-08-01",
      "headline": "Video: 20-minute-long lightning spectacle seen from flight to IndiaEyewitnesses aboard the flight reported seeing near-continuous flashes of lightning outside their windows for more than 20 minutes as the plane navigated the weather system. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/flipkart-freedom-sale-tablets-get-their-biggest-price-drop-of-the-year-2764360-2025-07-31",
      "headline": "Flipkart Freedom Sale: Tablets Get Their Biggest Price Drop of the YearFor buyers looking to invest in a new device, this could be the best chance before the festive season arrives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/history-of-it/story/air-india-dreamliner-crash-investigation-transat-236-a330-emergency-landing-glide-portugal-midair-engine-failure-2764467-2025-08-01",
      "headline": "Engines dead, pilots glided plane for 120km over ocean, saved 306 livesWhen both engines of Transat Flight 236 from Canada to Portugal died out midair over the Atlantic Ocean in 2001 due to a fuel leak, it was still 120km short of an airstrip. The pilots glided the plane to safety, creating a world record and saving 306 people onboard, in what is now known as the Miracle on the Azores."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/shashi-tharoor-rebuts-donald-trumps-dead-economy-jibe-after-congrsss-rahul-gandhis-endorsement-2764737-2025-08-01",
      "headline": "Not the case: Shashi Tharoor differs with Rahul Gandhi's stance on Trump remarksCongress MP Shashi Tharoor rejected US President Donald Trump's remark calling India a \"dead economy,\" apparently countering fellow Congress leader Rahul Gandhi who had supported the statement a day earlier."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/pain-behind-kishore-kumar-madness-the-real-anand-2764603-2025-08-01",
      "headline": "The Real Anand: The Pain Behind Kishore Kumar's MadnessKishore Kumar's eccentricities revealed a paradoxical genius whose soulful voice illuminated millions, masking a life of solitude and inner turmoil."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/story/israel-gaza-palestine-attack-family-food-truck-firing-killed-satellite-image-2764676-2025-08-01",
      "headline": "Gaza's haunting reality: Satellite image shows crowd swarming aid trucksScores of Palestinians, including women and children, were killed in the pas few weeks as they queued for food trucks in Gaza, which is facing a worst-case scenario of man-made famine."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/denied-accused-vindicated-nisar-launched-for-the-world-redemption-for-nambi-2764632-2025-08-01",
      "headline": "Denied, accused, vindicated: Nisar for the world, redemption for NambiDespite the fallout, blockades, and accusations, Isro did not give up, and neither did Nambi stop fighting the battle for justice. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-jasprit-bumrah-released-india-squad-final-test-the-oval-2764801-2025-08-01",
      "headline": "Jasprit Bumrah released from India squad during final Test at The OvalIndia's pace spearhead Jasprit Bumrah has been officially released from the squad for the fifth and final Test of the Anderson-Tendulkar Trophy against England at The Oval, as part of a pre-determined workload management plan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/reviews/story/liam-neeson-naked-gun-reboot-2025-comedy-detective-pamela-anderson-2764778-2025-08-01",
      "headline": "The Naked Gun review: Liam, Pamela's film is ridiculously silly,and it's a good thingRelease Date:Fri Aug 01, 2025Liam Neeson stars as the bumbling detective in The Naked Gun reboot. The film's absurd humour and nostalgic charm bring fresh life to the classic franchise."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/cbse-english-vs-icse-english-differences-syllabus-style-assessment-india-2764767-2025-08-01",
      "headline": "ICSE vs CBSE: How English is taught differently in India's top school boardsThe English curriculum and exam style differ significantly between CBSE and ICSE boards in India. These differences influence students' language skills and future academic choices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/ktaka-lokayukta-seizes-rs-30-crore-assets-from-kridl-ex-clerk-earning-rs-15000-salary-2764578-2025-08-01",
      "headline": "Raids on ex-Karnataka clerk unearth Rs 30 crore in assets, including 24 housesA former clerk at Karnataka Rural Infrastructure Development Limited is under investigation after a Lokayukta raid revealed massive wealth, including houses, land and jewellery, worth over Rs 30 crore. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/where-is-lieutenant-colonel-purohit-now-key-accused-acquitted-in-malegaon-blasts-2008-nia-acquitted-saffron-terror-2764339-2025-08-01",
      "headline": "Where is Lt Col Purohit after fighting Malegaon blast taint for 17 years?Lt Col Prasad Shrikant Purohit has been acquitted by an NIA court in the Malegaon blast case, along with 6 others. The only serving Army officer to stand trial, Purohit was at the centre of a case framed as part of \"saffron terror\". This is the story of a soldier's 17-year battle in a case that upturned his and his family's lives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/happy-gilmore-2-review-adam-sandler-returns-with-a-swing-and-a-hole-lot-of-heart-2764649-2025-08-01",
      "headline": "Happy Gilmore 2 review: Adam Sandler returns with a swing and a hole lot of heartRelease Date:Fri Jul 25, 2025Happy Gilmore 2 movie review: 'Happy Gilmore 2' sees Adam Sandler return with his trademark humour. The film balances comedy, family drama, and nostalgia, making it a heartfelt and entertaining watch for audiences across"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/photo-essay/world-lung-cancer-day-one-puff-many-scars-a-journey-inside-smoker-lungs-280-01-08-2025",
      "headline": "One puff, many scars: A journey inside smoker's lungsYou can't rewind lung damage, but you can stop fast-forwarding it. Start with awareness, and let knowledge be your breath of fresh air."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/isro-begins-10-day-analogue-mission-in-ladakh-to-simulate-life-in-space-2764804-2025-08-01",
      "headline": "Isro begins 10-day Hope mission in Ladakh, simulate life in spaceIndia plans to launch astronauts to the Moon by the year 2040 as its space program soars. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/what-online-shopping-says-about-your-mind-2764162-2025-08-01",
      "headline": "What online shopping says about your mindDoes adding to cart feel more satisfying than walking through a mall and browsing stores? This habit might say more about your mental health than you think. While it could just be about convenience, for some, it may reflect deeper needs like comfort, control, or a way to avoid social situations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/aanand-l-rai-calls-ai-version-of-raanjhanaa-a-betrayal-after-producers-statement-2764569-2025-08-01",
      "headline": "Aanand L Rai calls AI version of Raanjhanaa a betrayal after producers' statementFilmmaker Aanand L Rai stated in a long note on social media that he neither supports nor approves of the AI-modified version of 'Raanjhanaa', describing it as unauthorised. The film was originally released in 2013.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/exclusive-my-oxford-year-sofia-carson-corey-mylchreest-chemistry-bollywood-love-language-2764824-2025-08-01",
      "headline": "Exclusive: Sofia Carson, Corey Mylchreest on Bollywood, chemistry, love languageIn an exclusive interaction with India Today, 'My Oxford Year' actors Sofia Carson and Corey Mylchreest spoke about their love for Bollywood and the possibilities of exploring the new sphere. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shikhar-pahariya-praises-janhvi-kapoor-in-pardesiya-song-param-sundari-2764775-2025-08-01",
      "headline": "Shikhar Pahariya gushes over Janhvi Kapoor in Pardesiya: Best song and best girlJanhvi Kapoor and Sidharth Malhotra's romantic track 'Pardesiya' from 'Param Sundari' is winning hearts. Janhvi's boyfriend Shikhar Pahariya shared the song on Instagram and called it the best song and tagged her as his best girl. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mahesh-babu-birthday-to-pass-without-ssmb29-teaser-heres-why-ss-rajamouli-priyanka-chopra-2764765-2025-08-01",
      "headline": "Mahesh Babu's birthday to pass without SSMB29 teaser. Here's why!Director SS Rajamouli has chosen not to release any teaser or poster on actor Mahesh Babu's birthday. The filmmaker is focusing on a global scale reveal for the ambitious action film scheduled to release in 2027."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-224-batting-collapse-atkinson-5-wickets-day-2-oval-test-2764810-2025-08-01",
      "headline": "34 balls, 6 runs, 4 wickets: India's lower-order blown away on Day 2 morningEngland needed just 34 balls to dismantle the remaining four Indian wickets on a lively second morning at The Oval, bundling the visitors out for a modest 224 — the lowest first-innings total of the series so far."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-jasprit-bumrah-released-india-squad-final-test-the-oval-2764801-2025-08-01",
      "headline": "Jasprit Bumrah released from India squad during final Test at The OvalIndia's pace spearhead Jasprit Bumrah has been officially released from the squad for the fifth and final Test of the Anderson-Tendulkar Trophy against England at The Oval, as part of a pre-determined workload management plan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pujara-rahane-dropped-west-zone-duleep-trophy-bcci-zonal-format-2764789-2025-08-01",
      "headline": "End of the road for Pujara, Rahane: Legends left out of Duleep Trophy squadVeteran Indian cricketers Cheteshwar Pujara and Ajinkya Rahane have been left out of the West Zone Duleep Trophy squad. This decision could turn out to be a big hit on their Test careers."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-eng-5th-test-chris-woakes-injury-update-ruled-out-2764755-2025-08-01",
      "headline": "Seamer Chris Woakes ruled out of the final Test due to shoulder injuryIndia vs England: England pacer Chris Woakes will play no further part in the 5th Test match, the team announced at the start of Day 2 of the final Test match. Woakes was injured while fielding on Day 1 at The Oval."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-5th-test-london-weather-day-2-live-score-updates-2764717-2025-08-01",
      "headline": "5th Test, Day 2 Live: Duckett, Crawley off to a rapid startIndia (IND) vs England (ENG), 5th Test, Day 2 Live Score and Weather Updates: Ben Duckett and Zak Crawley are off to a rapid start at The Oval. They have made the best use of the conditions and have dominated the Indian bowlers with some aggressive intent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/who-is-khalid-jamil-indian-men-football-team-new-head-coach-2764709-2025-08-01",
      "headline": "Who is Khalid Jamil? The man trusted to lead Indian football's revivalKhalid Jamil has been appointed head coach of the Indian men's national football team, the first Indian in the role in over ten years. His task is to revive Indian football and steer the team to better performances in upcoming tournaments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-india-assistant-coach-reaction-shubman-gill-run-out-2764703-2025-08-01",
      "headline": "India assistant coach reacts to Shubman Gill's unfortunate run outShubman Gill came under fire from fans for a careless run-out on Day 1 of the final Test, with India's assistant coach Ryan ten Doeschate also highlighting the recklessness of the dismissal during the post-match media interaction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/india-football-men-team-new-coach-khalid-jamil-2764669-2025-08-01",
      "headline": "Khalid Jamil announced as new head coach of Indian football teamFormer East Bengal and Mohun Bagan manager Khalid Jamil has been announced as new head coach of Indian football team. Jamil joins the Indian team after the exit of Manolo Marquez."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-run-out-game-changer-oval-test-aakash-chopra-2764643-2025-08-01",
      "headline": "Shubman Gill's suicidal run-out was game-changer in Oval Test: Aakash ChopraAakash Chopra has weighed in on Shubman Gill's run-out on Day 1 of the fifth Test between India and England at The Oval, describing it as a game-changing moment that could potentially alter the course of the match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-5th-test-oval-london-weather-conditions-2764651-2025-08-01",
      "headline": "Oval Test weather report: Will rain affect playing conditions on Day 2?India vs England: The weather played a massive role on Day 1 of the final Test match at The Oval. 6 wickets fell as India struggled to cope up with the movement in overcast conditions.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/who-is-khalid-jamil-indian-men-football-team-new-head-coach-2764709-2025-08-01",
      "headline": "Who is Khalid Jamil? The man trusted to lead Indian football's revivalKhalid Jamil has been appointed head coach of the Indian men's national football team, the first Indian in the role in over ten years. His task is to revive Indian football and steer the team to better performances in upcoming tournaments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/eng-vs-ind-india-assistant-coach-reaction-shubman-gill-run-out-2764703-2025-08-01",
      "headline": "India assistant coach reacts to Shubman Gill's unfortunate run outShubman Gill came under fire from fans for a careless run-out on Day 1 of the final Test, with India's assistant coach Ryan ten Doeschate also highlighting the recklessness of the dismissal during the post-match media interaction."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/india-football-men-team-new-coach-khalid-jamil-2764669-2025-08-01",
      "headline": "Khalid Jamil announced as new head coach of Indian football teamFormer East Bengal and Mohun Bagan manager Khalid Jamil has been announced as new head coach of Indian football team. Jamil joins the Indian team after the exit of Manolo Marquez."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/shubman-gill-run-out-game-changer-oval-test-aakash-chopra-2764643-2025-08-01",
      "headline": "Shubman Gill's suicidal run-out was game-changer in Oval Test: Aakash ChopraAakash Chopra has weighed in on Shubman Gill's run-out on Day 1 of the fifth Test between India and England at The Oval, describing it as a game-changing moment that could potentially alter the course of the match."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-england-5th-test-oval-london-weather-conditions-2764651-2025-08-01",
      "headline": "Oval Test weather report: Will rain affect playing conditions on Day 2?India vs England: The weather played a massive role on Day 1 of the final Test match at The Oval. 6 wickets fell as India struggled to cope up with the movement in overcast conditions.\r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}