{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-history-from-opium-wars-to-boardroom-battles-the-making-of-an-indian-empire-2799916-2025-10-08",
      "headline": "Tata history: From opium wars to boardroom battles, the making of an Indian empireThe history of Tata Group, caught in a boardroom war, is a remarkable tale of ambition, daring ventures, and resilience. This three-part series will explore how a humble family business evolved into India's largest industrial conglomerate, navigating fortunes made from the opium trade and wartime cotton booms, and the enduring challenges that defined its legacy.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sebi-aims-to-strengthen-markets-with-easier-share-lending-and-borrowing-report-2799835-2025-10-08",
      "headline": "Sebi aims to strengthen markets with easier share lending and borrowing: ReportSebi is holding consultations with market participants to improve the Securities Lending and Borrowing (SLB) mechanism, thereby allowing investors to lend or borrow shares for a fee, helping traders take short positions and aiding in better price discovery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-slip-as-investors-book-profits-titan-it-stocks-shine-2799831-2025-10-08",
      "headline": "Sensex, Nifty slip as investors book profits; Titan, IT stocks shineThe S&P BSE Sensex fell over 150 points to close below the 82,000 mark, while the Nifty50 slipped more than 60 points to settle just above 25,000. Broader market indices also ended lower, reflecting heightened volatility throughout the day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/dalal-street-ipo-rush-subscribe-or-skip-stock-market-news-2799811-2025-10-08",
      "headline": "Subscribe or skip: Should you ride the ongoing IPO wave on Dalal Street?The IPO rush is exciting, but are investors chasing glitter or real growth? With many listings already below issue price, will patience and selectivity matter more than speed this year?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indigo-fined-rs-20-lakh-by-aviation-regulator-for-pilot-simulator-training-lapse-2799810-2025-10-08",
      "headline": "IndiGo fined Rs 20 lakh by aviation regulator for pilot simulator training lapseThe penalty, imposed on September 26, pertains to the use of non-qualified simulators for training pilots operating at high-risk airports such as Calicut, Leh, and Kathmandu. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-trusts-issue-centre-of-action-noel-mehli-mistry-pramit-jhaveri-jehangir-darius-khambata-2799761-2025-10-08",
      "headline": "Tata Group rift: Which trustees are at the heart of the recent tussle for control?With Home Minister Amit Shah and Finance Minister Nirmala Sitharaman stepping in to mediate, all eyes are on the people behind the row. Who are these four trustees challenging Noel Tata's leadership, and how did their differences push one of India's most trusted business families into rare public turbulence?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/are-real-estate-stocks-a-good-bet-right-now-experts-answer-2799788-2025-10-08",
      "headline": "Are real estate stocks a good bet right now? Experts answerGaurang Shah of Geojit Financial Services, the real estate sector has seen a visible turnaround in the last few years, with developers showing financial discipline and faster project execution. However, he added a word of caution for investors."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/how-rs-80k-grew-to-rs-19-lakh-savings-through-simple-habits-expert-explains-2799742-2025-10-08",
      "headline": "How Rs 80K grew to Rs 1.9 lakh savings through simple habits, expert explainsYou don't always need a higher salary to grow your wealth. According to an expert, small, intentional changes in spending and saving helped a client turn his Rs 80,000 salary into Rs 1.9 lakh savings in half a year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/government-urges-tata-group-to-resolve-dispute-and-restore-stability-report-2799731-2025-10-08",
      "headline": "Government urges Tata Group to resolve dispute and restore stability: ReportThe government has urged the Tata Group to restore stability in Tata Trusts following internal disputes that risk affecting Tata Sons, India's largest conglomerate, according to The Economic Times. The conflict involves four trustees within Tata Trusts, who are said to have acted as a \"super board,\" challenging Chairman Noel Tata's authority."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/tata-capitals-175-billion-ipo-fully-subscribed-after-strong-institutional-backing-2799707-2025-10-08",
      "headline": "Tata Capital's $1.75 billion IPO fully subscribed after strong institutional backingTata Capital has successfully completed its $1.75 billion IPO, fully subscribed thanks to robust demand from qualified institutional buyers, setting the stage for its stock market debut on October 13."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-groups-trusts-boardroom-battle-infighting-corporate-governance-explained-2799680-2025-10-08",
      "headline": "Another boardroom battle at Tata Group?The current crisis arises from a power tussle within Tata Trusts, the philanthropic arm that holds a controlling stake in Tata Sons, the holding company that runs the operations of the Tata Group. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/hdfc-bank-cuts-lending-rates-will-your-emis-drop-2799671-2025-10-08",
      "headline": "HDFC Bank cuts lending rates. Will your EMIs drop?HDFC Bank has announced a reduction in its Marginal Cost of Funds-based Lending Rate (MCLR), raising hopes for borrowers. The cut could translate into lower EMIs for many customers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gold-hits-record-rs-122-lakh-per-10-grams-what-should-investors-do-now-gold-prices-2799637-2025-10-08",
      "headline": "Gold hits record Rs 1.22 lakh per 10 grams. What should investors do now?Gold prices surged past Rs 1.22 lakh per 10 grams on Wednesday, driven by global uncertainty, a weak dollar, and expectations of US interest rate cuts. Investors are now wondering whether to buy, sell, or stay put."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zerodha-nithin-kamath-calls-for-smarter-ways-to-unlock-indias-3-trillion-gold-treasure-2799599-2025-10-08",
      "headline": "Nithin Kamath calls for smarter ways to unlock India's $3 trillion gold treasureIndia's homes hold an estimated $3 trillion worth of gold, a treasure that mostly lies untouched. Zerodha's Nithin Kamath believes it's time to put this idle wealth to work through smarter financial ideas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/titan-shares-jump-over-4-percent-today-key-factors-behind-the-rally-2799594-2025-10-08",
      "headline": "Titan shares jump over 4% today: What's driving the rally?At around 11:02 am, Titan's stock was trading 4.26% higher at Rs 3,562 on the Bombay Stock Exchange (BSE). The rally came after the company announced that its domestic jewellery segment grew 19% year-on-year during the July–September quarter."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/tata-trust-news-government-asks-restore-stability-amit-shah-meeting-noel-tata-report-2799554-2025-10-08",
      "headline": "Trouble in Tata Group? Government asks leadership to restore stability, says reportThe meeting was aimed at maintaining calm within the Tata Trusts, which holds a controlling stake in Tata Sons, the holding company of India's largest conglomerate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/google-to-invest-10-billion-in-visakhapatnam-data-hub-its-biggest-bet-on-india-yet-2799552-2025-10-08",
      "headline": "Google to invest $10 billion in Visakhapatnam data hub: ReportThe project will include the construction of three high-capacity submarine cables, dedicated cable landing stations, metro fibre networks, and advanced telecommunications infrastructure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-nifty-gain-for-5th-straight-session-tata-group-shares-in-focus-2799549-2025-10-08",
      "headline": "Sensex, Nifty rally for 5th straight session; Tata Group shares in focusThe S&P BSE Sensex opened firm and was trading 159.69 points higher at 82,086.44 around 9:22 am, while the NSE Nifty50 advanced 39.15 points to 25,147.45. Broader market indices also mirrored the positive sentiment, with most trading in the green."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/tata-capital-ipo-closes-today-tata-group-past-listings-profit-multibagger-allotment-2799544-2025-10-08",
      "headline": "Tata Capital IPO: Will it reward investors like other Tata Group listings?While Tata Capital enjoys strong brand credibility and steady growth, early subscription data and grey market trends indicate a modest response so far for the public listing. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/noel-tata-chandrasekaran-meeting-amit-shah-sitharaman-trust-governance-issue-vijay-singh-2799527-2025-10-08",
      "headline": "Noel Tata, Chandrasekaran meet Amit Shah amid Tata Trust governance row: ReportNoel Tata was joined by Venu Srinivasan, chairman emeritus of TVS Motor Company, and senior lawyer Darius Khambata for the meeting, which took place at Amit Shah's residence. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/from-k-pop-idol-to-fashion-show-star-bts-v-is-paris-favourite-2800149-2025-10-09",
      "headline": "From K-pop idol to fashion show star: BTS' V is Paris' favourite Kim Taehyung aka BTS member V once again stole the spotlight at Paris Fashion Week with his impeccable style and magnetic presence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-episode-46-abhishek-takes-over-kitchen-malti-forms-new-gang-2800103-2025-10-08",
      "headline": "Bigg Boss 19 episode 46: Abhishek takes over kitchen, Malti forms new gang The latest episode of 'Bigg Boss 19' saw Abhishek Bajaj taking over the kitchen duty after Neelam Giri backed out. Farrhana Bhatt, who is the captain, clashed with Neelam and Amaal Mallik over the matter. The episode also saw Malti Chahar forming a new group.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/travis-kelce-celebrates-taylor-swift-the-life-of-a-showgirl-music-album-2800070-2025-10-08",
      "headline": "Travis Kelce celebrates Taylor Swift's The Life of a Showgirl: I'm a lucky man NFL star Travis Kelce expressed pride as pop star Taylor Swift's new album 'The Life of a Showgirl' took the Internet by storm. He denied being the main creative muse behind the album. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mohit-suri-karan-johar-thanked-south-directors-praised-saiyaara-ahaan-panday-aneet-padda-2800036-2025-10-08",
      "headline": "Mohit Suri says Karan Johar thanked, South directors called to praise Saiyaara Director Mohit Suri opened up about how the film industry reacted to Ahaan Panday and Aneet Padda starrer 'Saiyaara' at FICCI Frames on Wednesday. Yash Raj Films CEO Akshaye Wadhwani, who was also present, shared why the lead pair maintained a low profile before the film's release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/ekta-kapoor-kyunki-saas-bhi-kabhi-bahu-thi-25-years-smriti-irani-bond-changed-2800023-2025-10-08",
      "headline": "Ekta admits bringing Kyunki... was damn scary, Smriti admits their bond changed Producer Ekta Kapoor spoke about the thrill and challenges associated with bringing 'Kyunki Saas Bhi Kabhi Bahu Thi' after 25 years at FICCI Frames on Wednesday. Actor Smriti Irani, on the other hand, reflected on how their bond has evolved over the years."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/pawan-singh-wife-jyoti-singh-claims-singer-gave-her-abortion-pills-25-sleeping-pills-he-tortured-me-so-much-2799969-2025-10-08",
      "headline": "Pawan Singh's wife claims singer gave her abortion pills: He tortured me so much Bhojpuri actor Pawan Singh and wife Jyoti Singh are in a public spat, with serious allegations of mistreatment and abortion pills making headlines, as both offer conflicting accounts amid ongoing legal battles."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/twice-billboard-record-album-victorias-secret-fashion-show-2025-world-tour-2799963-2025-10-08",
      "headline": "TWICE to lead 2025 Victoria's Secret Show as group marks 10 years K-pop girl band TWICE achieves personal best on Billboard 200 with album 'THIS IS FOR'. The group set to headline the 2025 Victoria's Secret Fashion Show in New York."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/gauri-khan-birthday-farah-khan-maheep-kapoor-bhavana-pandey-namrata-shirodkar-extend-wishes-2799960-2025-10-08",
      "headline": "Gauri Khan turns 55: Farah Khan, Bhavana Pandey and Maheep Kapoor extend wishes Several celebrities, including Farah Khan, Maheep Kapoor and Bhavana Pandey, sent birthday wishes to Gauri Khan on her 55th birthday. Actor Mahesh Babu's wife, Namrata Shirodkar, also shared a note of love and blessings for Gauri Khan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/vijay-deverakonda-rowdy-janardhana-to-go-on-floors-this-october-in-mumbai-report-2799955-2025-10-08",
      "headline": "Vijay Deverakonda' Rowdy Janardhana to go on floors this October in Mumbai: Report After the setback of 'Kingdom', Vijay Deverakonda is gearing up for a major comeback with 'Rowdy Janardhana', a rural action entertainer that could mark a turning point for both the actor and producer Dil Raju."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/venkatesh-joins-trivikram-srinivass-next-naga-vamsi-hails-them-as-ogs-2799958-2025-10-08",
      "headline": "Venkatesh joins Trivikram Srinivas's next, Naga Vamsi hails them as 'OGs' Veteran Telugu actor Venkatesh joined hands with director Trivikram Srinivas for his upcoming project. The yet-to-be titled film will mark Trivikram's return after 'Guntur Kaaram'. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/ballad-of-a-small-player-trailer-colin-farrell-is-a-gambler-hoping-for-miracle-2799899-2025-10-08",
      "headline": "Ballad Of A Small Player trailer: Colin Farrell is a gambler hoping for miracle The trailer of Edward Berger's psychological-thriller 'Ballad of a Small Player' based on Lawrence Osborne's novel of the same name was recently released. The upcoming Netflix film features actor Colin Farrell in the lead role."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/arbaaz-khan-and-sshura-khan-introduce-newborn-daughter-sipaara-with-quranic-name-2799938-2025-10-08",
      "headline": "Sipaara Khan: Arbaaz-Sshura reveal daughter's name. Here's what it means Arbaaz Khan and wife Sshura Khan have named their baby girl Sipaara. Married in December 2023, the couple is embracing parenthood and revealing the meaningful religious significance behind their daughter's name."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/were-hritik-roshan-and-jason-mamoa-first-choice-for-baahubali-producer-clarifies-2799847-2025-10-08",
      "headline": "Were Hritik Roshan and Jason Mamoa first choice for Baahubali? Producer clarifies As 'Baahubali: The Epic' nears release, producer Shobu Yarlagadda busts long-standing casting rumours around Hrithik Roshan and Jason Momoa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/krish-pathak-marries-sara-khan-highlighting-ramayan-legacy-2799931-2025-10-08",
      "headline": "Who is Krish Pathak, Sara Khan's husband and what's his Ramayan connection? Actor-producer Krish Pathak married popular television actor Sara Khan on Monday. His family's connection to the Ramayan has intrigued fans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/rowan-atkinsons-netflix-comedy-man-vs-baby-announced-set-for-december-release-2799912-2025-10-08",
      "headline": "Rowan Atkinson's Netflix comedy Man vs Baby announced, set for December release Rowan Atkinson is back with Netflix's 'Man vs Baby', premiering December 11, 2025, delivering festive laughs as he navigates Christmas chaos while caring for a baby in London."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/tamil-film-dude-gets-big-telugu-release-but-i-dont-get-same-love-kiran-abbavaram-2799906-2025-10-08",
      "headline": "Tamil film Dude gets big Telugu release, but I don't get same love: Kiran Abbavaram Telugu actor Kiran Abbavaram opened up about the long-standing debate over Telugu films getting a fair release in Tamil Nadu, sharing his disappointment over experiences and the uncertainty of 'K-Ramp' reaching Tamil audiences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/lokah-chapter-1-chandra-crosses-300-crore-highest-grossing-malayalam-film-2799888-2025-10-08",
      "headline": "Kalyani Priyadarshan's Lokah enters Rs 300 crore club, a first for Malayalam cinema Kalyani Priyadarshan's 'Lokah: Chapter 1 - Chandra' rewrote Malayalam box office history by becoming the first film to cross the Rs 300 crore mark worldwide. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/how-kantara-chapter-1-avatar-celebrate-nature-reclamation-2799808-2025-10-08",
      "headline": "How Kantara Chapter 1, Avatar celebrate nature's reclamation Rishab Shetty's 'Kantara Chapter 1' depicts the ancient Bhoota Kola ritual, while symbolising nature as the ultimate inheritor, reclaiming all from human ambition. Films like 'Avatar' and 'Bhediya' also highlight the cultural and ecological power of storytelling. IndiaToday.in shares insights on the impact of Man vs Nature themes in cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/hi-nayanthara-kavin-tamil-rom-com-gets-title-see-new-poster-2799905-2025-10-08",
      "headline": "Nayanthara and Kavin's Tamil rom-com, titled Hi, announced with new posters It's a big 'Hi' from Nayanthara and Kavin! The actors' upcoming romantic drama just got a playful title reveal, accompanied by a charming new poster unveiled on Wednesday, October 8. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/your-actions-strained-relation-with-india-take-immediate-steps-to-repair-ties-19-us-lawmakers-write-to-trump-2800029-2025-10-08",
      "headline": "Repair strained ties with India immediately: 19 US lawmakers write to TrumpIn a letter to President Trump, the US lawmakers said the recent increase in tariffs on Indian goods has damaged bilateral relations and hurt both American consumers and manufacturers."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/ensure-proper-testing-of-cough-syrup-batches-drug-regulator-in-fresh-letter-to-states-uts-after-20-child-dea-2799981-2025-10-08",
      "headline": "Ensure testing of cough syrups: Drug regulator to states, UTs after 20 deathsThe drug regulator emphasised that manufacturers must comply with the Drugs Rules, conduct thorough batch testing of both raw materials and finished products, and source ingredients only from approved vendors."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/6-injured-after-explosion-in-scooter-in-kanpur-forensics-team-at-the-spot-2800025-2025-10-08",
      "headline": "Kanpur scooter blast caused by illegal firecrackers, says top cop; 8 injuredA low-intensity explosion in two parked scooters in Kanpur's Mishri Bazaar injured eight people, including a seriously hurt female waste collector. Police investigations reveal the blast was caused by illegally stored firecrackers, possibly under the protection of some officers. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/exclusive-tmc-workers-said-they-were-didis-men-wanted-to-kill-me-bjps-khagen-murmu-recalls-bengal-attack-2800022-2025-10-08",
      "headline": "Workers were Didi's men, came to kill me: BJP MP on Bengal flood-trip attackSpeaking to India Today TV from his hospital bed despite a fracture below his left eye, Murmu said the attackers openly told him BJP leaders would not be allowed in the area and that they intended to kill him."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/mount-everest-visible-from-bihar-jainagar-town-thanks-to-clear-skies-clean-air-2799863-2025-10-08",
      "headline": "Rare sight: Mount Everest visible from Bihar town thanks to clear skies, clean airLocated on the banks of the Kamla River, which originates from a glacier in Nepal along the India-Nepal border, Jaynagar is a culturally vibrant town where the world's highest peak appears directly in line on the map."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/video-indian-student-gujarat-morbi-reveals-why-he-fought-for-russia-ukraine-war-surrendered-drugs-2799859-2025-10-08",
      "headline": "Watch: Indian student fought for Russia to escape jail, surrendered in 3 daysA 22-year-old student from Gujarat, who went to Russia for higher studies, joined the Russian Army to avoid jail over drug charges. After just three days on the battlefield, he surrendered to Ukrainian forces, saying he'd rather stay imprisoned in Ukraine than return to Russia."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/haryana-ips-suicide-y-puran-kumar-names-multiple-ias-ips-officers-in-9-page-suicide-note-2799933-2025-10-08",
      "headline": "Top Haryana cop who shot himself dead named 12 officers in 9-page suicide noteIn Haryana, IPS officer Y Puran Kumar left a nine-page suicide note naming multiple IAS and IPS officers, including both serving and retired officials. The note was shared with a few close IPS friends and his wife. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/yash-raj-films-to-shoot-three-major-projects-in-uk-from-2026-uk-pm-keir-starmer-2799798-2025-10-08",
      "headline": "Yash Raj Films to shoot 3 major projects in UK from 2026: Keir StarmerPrime Minister Keir Starmer announced Yash Raj Films will shoot three major projects in the UK starting 2026. The move is set to create thousands of jobs and deepen UK-India creative industry ties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/opinion/story/chennai-is-missing-two-lions-bjp-is-desperately-seducing-one-of-them-vijay-rally-karur-stampede-2799714-2025-10-08",
      "headline": "Chennai is missing two lions. BJP is desperately seducing one of themActor Vijay, who used to refer to himself as a lion, disappeared from public view even as the Karur stampede was unfolding. Forty-one fans, including children and women, died that deadly September night. Instead of calling out the lion king for abandoning his fans, the BJP is openly courting him. Should the party with a difference not show some deference to the people of Tamil Nadu?"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/beth-mooney-alana-king-australia-win-pakistan-womens-world-cup-colombo-2800026-2025-10-08",
      "headline": "Beth Mooney's rescue act powers Australia to dominant win against PakistanWomen's World Cup, AUS vs PAK: Australia hammered Pakistan by 107 runs on Wednesday, October 8 to reclaim the top spot in the table. Beth Mooney starred for them with a hundred while Kim Garth picked up three wickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/amit-shah-switches-zoho-mail-announces-email-id-donald-trump-style-2799826-2025-10-08",
      "headline": "Amit Shah goes desi with Zoho mail, reveals in Trump-styleAmit Shah is the latest minister to embrace Zoho-based platforms amid the government's 'swadeshi' push on the backdrop of US tariffs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/gandhinagar-vande-bharat-special-gurgaon-reroute-longer-route-high-ohe-pantograph-double-stack-freight-indian-railways-2799634-2025-10-08",
      "headline": "How a blunder created a Vande Bharat recordSemi-high-speed Vande Bharat trains have a tall acclaim, but for once they fell short, not in stature but in height. The Sabarmati–Gurgaon Vande Bharat Special had to be sent on a longer route recently after the Indian Railways found that the train's pantograph couldn't reach the overhead wires. A record was created because of a blunder."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/zoho-sridhar-vembu-government-support-arattai-criticism-india-self-reliance-trump-tariffs-2799657-2025-10-08",
      "headline": "Zoho has government backing. So what's the problem?Zoho is back in the spotlight after several ministers endorsed the desi tech company amid a 'swadeshi' push fuelled by rising US tariff tensions. However, fault-finding against Zoho has already begun. India need not look further than China and see how it built its own internet ecosystem."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-senate-confirms-sergio-gor-as-india-envoy-paul-kapur-to-lead-south-asia-office-glbs-2800151-2025-10-09",
      "headline": "US Senate confirms Sergio Gor as India envoy, Paul Kapur to lead South Asia officeThe Senate confirmed both Sergio Gor and Paul Kapur in a single vote -- 51 in favour and 47 against -- among 107 nominees, even as the US government remained in partial shutdown."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-inaugurates-phase-1-of-the-navi-mumbai-international-airport-2799777-2025-10-08",
      "headline": "Mumbai gets its second wind as PM inaugurates Navi Mumbai airportPM Modi inaugurated Phase 1 of the Navi Mumbai International Airport on Wednesday. The new airport is expected to ease the heavy traffic burden on Mumbai's existing Chhatrapati Shivaji Maharaj International Airport."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/uk-news/story/tory-mp-shadow-justice-secretary-brands-multicultural-soho-road-dominated-by-indian-pakistani-origin-slum-birmingham-uk-2799646-2025-10-08",
      "headline": "Like a slum in UK: MP brands area with Indian, Pakistani residents, sparks rowBritish MP and shadow minister Robert Jenrick labelled Birmingham's multicultural Soho Road, home to Indian and Pakistani communities, a \"slum\" and \"one of the worst integrated places\" in the UK. His remarks triggered a backlash with locals, business leaders, and politicians fiercely defending the area."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pat-cummins-travis-head-reject-10-million-ipl-team-deal-to-quit-australian-cricket-2799852-2025-10-08",
      "headline": "Cummins, Head reject Rs 58 crore deal from IPL team to quit Australian cricketPat Cummins and Travis Head have turned down lucrative offers worth AUD 10 million (Rs 58.46 crore) per year from an IPL team group to quit international cricket and play in T20 leagues across the globe. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-the-bihar-polls-feel-different-this-time-2799860-2025-10-08",
      "headline": "How the Bihar polls feel different this timeWith its timeline reduced to two phases, from six in 2010, the assembly election promises sharper drama and a likely triangular contest after years.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/tata-history-from-opium-wars-to-boardroom-battles-the-making-of-an-indian-empire-2799916-2025-10-08",
      "headline": "Tata history: From opium wars to boardroom battles, the making of an Indian empireThe history of Tata Group, caught in a boardroom war, is a remarkable tale of ambition, daring ventures, and resilience. This three-part series will explore how a humble family business evolved into India's largest industrial conglomerate, navigating fortunes made from the opium trade and wartime cotton booms, and the enduring challenges that defined its legacy.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/eli-lilly-mounjaro-second-highest-selling-drug-india-diabetes-obesity-treatment-whats-driving-its-rise-2799644-2025-10-08",
      "headline": "Mounjaro becomes India's second-highest selling drug: What's driving its rise?Mounjaro clocked in Rs 80 crore in sales in September, becoming India's second-highest selling drug within six months of launch. Its rise highlights growing demand amid the country's obesity and diabetes challenges."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/story/deposit-money-first-court-to-shilpa-shetty-for-foreign-work-trip-2799751-2025-10-08",
      "headline": "Deposit money first: Court to Shilpa Shetty for foreign work tripThe Bombay High Court stipulated that if Shilpa Shetty and her husband Raj Kundra intend to travel overseas for work purposes, she must deposit Rs 60 crore as a precondition."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-the-raebareli-dalit-lynching-is-a-political-flashpoint-2799801-2025-10-08",
      "headline": "Why the Raebareli Dalit lynching is a political flashpointAlleged references to Rahul Gandhi and Yogi Adityanath, caught on camera during the killing of a Dalit by a mob that falsely accused him of being a thief, make the incident potentially explosive.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/navi-mumbai-airport-inauguration-noida-jhewar-airport-opening-india-twin-airport-cities-help-india-join-big-league-2799804-2025-10-08",
      "headline": "How India is junking an age-old rule with Navi Mumbai, Jewar airportsThe inauguration of Navi Mumbai International Airport by PM Narendra Modi, along with the opening of the Noida International Airport later this month, heralds a new era for India's aviation. Indian cities, for the first time, are joining the big league of cities with multiple airports, like London and New York. This is why it's a game-changer. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/assam-cop-sandipan-garg-zubeen-gargs-cousin-arrested-in-connection-with-singers-death-2799617-2025-10-08",
      "headline": "Zubeen Garg's cop cousin arrested, was at Singapore yacht party where singer diedZubeen Garg's cousin Sandipan Garg, who is an Assam Police Services officer, has been arrested in connection with the singer's mysterious death."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-ind-vs-sa-jemimah-rodrigues-indias-top-order-woes-2800147-2025-10-09",
      "headline": "Jemimah confident but India's misfiring top-order faces litmus test vs SA India may be unbeaten, but their much-vaunted top order has failed to fire against less-fancied opponents in the home Women's World Cup. While Jemimah Rodrigues has downplayed concerns around the top order, India must address these batting concerns quickly to avoid any costly slips."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-south-africa-womens-world-cup-vizag-2025-redemption-clash-2799997-2025-10-09",
      "headline": "Parking aside 2022 no-ball nightmare, India eye redemption heist against South Africa Back in 2022, India's Women's World Cup campaign ended in heartbreak after a loss to South Africa in Christchurch. This time, they will be aiming for redemption on Thursday in Vizag.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravichandran-ashwin-respect-senior-indian-cricketers-rohit-sharma-virat-kohli-leadership-changes-bcci-2800077-2025-10-09",
      "headline": "Treat Rohit and Virat with respect and sensitivity, not doubt: Ashwin tells BCCI Former India spinner Ravichandran Ashwin calls for greater respect and clearer communication for senior players Rohit Sharma and Virat Kohli. He emphasises the importance of handling leadership changes with sensitivity and ensuring knowledge transfer to younger cricketers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-wi-delhi-test-sai-sudharsan-confident-modest-returns-2800117-2025-10-08",
      "headline": "IND vs WI: India confident Sudharsan can crack the Test code despite modest returns India remains confident in Sai Sudharsan's Test potential despite early inconsistency. The team believes his domestic form and backing will help him succeed amid tough competition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-to-retain-same-xi-second-test-west-indies-nitish-kumar-reddy-2800108-2025-10-08",
      "headline": "India to remain unchanged for Delhi Test, Nitish to get another go: Assistant coach India are set to field the same playing XI for the second Test against West Indies at Arun Jaitley Stadium. The team management aims to develop Nitish Kumar Reddy as a seam-bowling all-rounder by providing him more game time, revealed assistant coach Ryan Ten Doeschate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-world-cup-comeback-against-india-early-wickets-spin-attack-2800091-2025-10-08",
      "headline": "South Africa over England collapse, confident ahead of India clash: Nadine de Klerk Nadine de Klerk believes that South Africa have moved past their poor showing in the tournament-opener and fancy their chances of taking on the hosts, India on Thursday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/tharun-mannepalli-stuns-popov-arctic-open-badminton-comeback-win-2800085-2025-10-08",
      "headline": "Tharun Mannepalli upsets Toma Junior Popov as Lakshya Sen suffers another early exit Unseeded Tharun Mannepalli produced a stunning comeback to defeat world No 14 Toma Popov at the Arctic Open. His victory keeps India's men's singles hopes alive amid other early exits by Indian shuttlers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/going-to-back-ourselves-to-keep-smriti-mandhana-under-pressure-nadine-de-klerk-2800080-2025-10-08",
      "headline": "Going to back ourselves to keep Smriti Mandhana under pressure: Nadine de Klerk Women's World Cup 2025: South Africa's Nadine de Klerk remains confident in the side's chances against the tournament-hosts India and will be backing themselves to come up with plans to take down Smriti Mandhana in their highly anticipated encounter. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ind-vs-wi-team-india-shubman-gill-gautam-gambhirs-dinner-party-ahead-of-2nd-test-2800068-2025-10-08",
      "headline": "Gill makes fashion statement as Team India arrive at Gambhir's dinner party The Indian men's cricket team arrived at head coach Gautam Gambhir's residence in Delhi for dinner ahead of the 2nd Test against the West Indies scheduled to be played at the Arun Jaitley Stadium from October 10–14."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/beth-mooney-alana-king-australia-win-pakistan-womens-world-cup-colombo-2800026-2025-10-08",
      "headline": "Beth Mooney's rescue act powers Australia to dominant win against Pakistan Women's World Cup, AUS vs PAK: Australia hammered Pakistan by 107 runs on Wednesday, October 8 to reclaim the top spot in the table. Beth Mooney starred for them with a hundred while Kim Garth picked up three wickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/joe-root-snaps-back-at-australian-critics-ashes-2025-26-century-2799950-2025-10-08",
      "headline": "Joe Root snaps back at Australian critics: This Ashes is not about me Joe Root, England's senior batter, has responded to the ongoing scrutiny about his absence of a Test hundred on Australian soil, saying that the upcoming Ashes is about the squad's performance, not his personal milestones."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/tharun-mannepalli-stuns-popov-arctic-open-badminton-comeback-win-2800085-2025-10-08",
      "headline": "Tharun Mannepalli upsets Toma Junior Popov as Lakshya Sen suffers another early exit Unseeded Tharun Mannepalli produced a stunning comeback to defeat world No 14 Toma Popov at the Arctic Open. His victory keeps India's men's singles hopes alive amid other early exits by Indian shuttlers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/going-to-back-ourselves-to-keep-smriti-mandhana-under-pressure-nadine-de-klerk-2800080-2025-10-08",
      "headline": "Going to back ourselves to keep Smriti Mandhana under pressure: Nadine de Klerk Women's World Cup 2025: South Africa's Nadine de Klerk remains confident in the side's chances against the tournament-hosts India and will be backing themselves to come up with plans to take down Smriti Mandhana in their highly anticipated encounter. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/ind-vs-wi-team-india-shubman-gill-gautam-gambhirs-dinner-party-ahead-of-2nd-test-2800068-2025-10-08",
      "headline": "Gill makes fashion statement as Team India arrive at Gambhir's dinner party The Indian men's cricket team arrived at head coach Gautam Gambhir's residence in Delhi for dinner ahead of the 2nd Test against the West Indies scheduled to be played at the Arun Jaitley Stadium from October 10–14."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/beth-mooney-alana-king-australia-win-pakistan-womens-world-cup-colombo-2800026-2025-10-08",
      "headline": "Beth Mooney's rescue act powers Australia to dominant win against Pakistan Women's World Cup, AUS vs PAK: Australia hammered Pakistan by 107 runs on Wednesday, October 8 to reclaim the top spot in the table. Beth Mooney starred for them with a hundred while Kim Garth picked up three wickets. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/joe-root-snaps-back-at-australian-critics-ashes-2025-26-century-2799950-2025-10-08",
      "headline": "Joe Root snaps back at Australian critics: This Ashes is not about me Joe Root, England's senior batter, has responded to the ongoing scrutiny about his absence of a Test hundred on Australian soil, saying that the upcoming Ashes is about the squad's performance, not his personal milestones."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/womens-world-cup-2025-ind-vs-sa-jemimah-rodrigues-full-pre-match-press-conference-2800001-2025-10-08",
      "headline": "Scary for opponents that we're winning without playing a perfect match: JemimahIndia batter Jemimah Rodrigues has said that it must be scary for opponents that they're winning despite not playing a perfect match in the tournament so far. The Women in Blue will next take on South Africa in their third fixture of the ICC Women's Cricket World Cup 2025 after beating Sri Lanka and Pakistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jemimah-rodrigues-addresses-form-concerns-ind-vs-sa-womens-world-cup-2025-2799990-2025-10-08",
      "headline": "Jemimah Rodrigues addresses form concerns: Not thinking about individual scoresJemimah Rodrigues remains optimistic despite a slow start in the Women's World Cup 2025. The right-handed batter has registered scores of 0 and 32 in the two innings so far in the tournament."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/cristiano-ronaldo-first-footballer-billionaire-al-nassr-contract-2799984-2025-10-08",
      "headline": "Cristiano Ronaldo hits historic feat, becomes first billionaire footballer: ReportCristiano Ronaldo achieves billionaire status, setting new financial records with his latest Al-Nassr contract and joining a select group of athlete billionaires."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/alana-king-half-century-boosts-australia-womens-world-cup-innings-against-pakistan-2799954-2025-10-08",
      "headline": "King makes Pakistan pay as Australia flaunt batting depthWomen's World Cup: Alana King's unbeaten 51 and a record 106-run stand with Beth Mooney rescued Australia from collapse to 221 for nine, showcasing their trademark batting depth against Pakistan in Colombo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-2nd-test-mohammed-siraj-jasprit-bumrah-team-selection-2799934-2025-10-08",
      "headline": "Will India rest Mohammed Siraj in Delhi Test vs West Indies?India vs West Indies: Former India wicketkeeper-batter Parthiv Patel has said India might rest Mohammed Siraj instead of Jasprit Bumrah for the second and final Test of the series, starting October 10 in New Delhi. Siraj has been picked in the ODI squad for a three-match series in Australia, starting October 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-india-vs-south-africa-jemimah-rodrigues-harmanpreet-kaur-training-2799894-2025-10-08",
      "headline": "Determined Jemimah trains hard in rain-hit nets before South Africa clashJemimah Rodrigues sweated it out hard for nearly an hour at the rain-delayed nets, while skipper Harmanpreet Kaur first went through catching drills before having a light 20-minute batting session on the eve of India's Women's World Cup clash against South Africa.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravindra-jadeja-worlds-best-all-rounder-ben-stokes-parthiv-patel-2799898-2025-10-08",
      "headline": "Jadeja is World No 1 all-rounder, far better than Stokes and Cummins: ParthivFormer India cricketer Parthiv Patel has declared Ravindra Jadeja as the best all-rounder in the world, ahead of Ben Stokes, Pat Cummins and Shakib al Hasan. Jadeja scored a magnificent 104* and picked up 4/54 in the first Test against West Indies to set up a comprehensive win by an innings and 140 runs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/indian-football-afc-asian-cup-qualifier-india-singapore-key-players-return-2799887-2025-10-08",
      "headline": "Indian football aims for crucial win against Singapore in Asian Cup qualifierThe Indian football team faces Singapore in a decisive AFC Asian Cup qualifier. The match outcome could significantly impact India's hopes of a third consecutive Asian Cup appearance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-2nd-test-mohammed-siraj-jasprit-bumrah-team-selection-2799934-2025-10-08",
      "headline": "Will India rest Mohammed Siraj in Delhi Test vs West Indies?India vs West Indies: Former India wicketkeeper-batter Parthiv Patel has said India might rest Mohammed Siraj instead of Jasprit Bumrah for the second and final Test of the series, starting October 10 in New Delhi. Siraj has been picked in the ODI squad for a three-match series in Australia, starting October 19. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/womens-world-cup-india-vs-south-africa-jemimah-rodrigues-harmanpreet-kaur-training-2799894-2025-10-08",
      "headline": "Determined Jemimah trains hard in rain-hit nets before South Africa clashJemimah Rodrigues sweated it out hard for nearly an hour at the rain-delayed nets, while skipper Harmanpreet Kaur first went through catching drills before having a light 20-minute batting session on the eve of India's Women's World Cup clash against South Africa.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravindra-jadeja-worlds-best-all-rounder-ben-stokes-parthiv-patel-2799898-2025-10-08",
      "headline": "Jadeja is World No 1 all-rounder, far better than Stokes and Cummins: ParthivFormer India cricketer Parthiv Patel has declared Ravindra Jadeja as the best all-rounder in the world, ahead of Ben Stokes, Pat Cummins and Shakib al Hasan. Jadeja scored a magnificent 104* and picked up 4/54 in the first Test against West Indies to set up a comprehensive win by an innings and 140 runs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/indian-football-afc-asian-cup-qualifier-india-singapore-key-players-return-2799887-2025-10-08",
      "headline": "Indian football aims for crucial win against Singapore in Asian Cup qualifierThe Indian football team faces Singapore in a decisive AFC Asian Cup qualifier. The match outcome could significantly impact India's hopes of a third consecutive Asian Cup appearance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/aus-vs-ind-india-odi-squad-travel-batches-october-15-australia-series-2799878-2025-10-08",
      "headline": "Virat Kohli, Rohit Sharma to reach New Delhi before flying to Australia: ReportThe Indian ODI squad will depart for Australia in two batches starting October 15. Shubman Gill takes over as captain, signalling a new leadership phase amid Rohit Sharma and Virat Kohli's continued presence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pat-cummins-travis-head-reject-10-million-ipl-team-deal-to-quit-australian-cricket-2799852-2025-10-08",
      "headline": "Cummins, Head reject Rs 58 crore deal from IPL team to quit Australian cricketPat Cummins and Travis Head have turned down lucrative offers worth AUD 10 million (Rs 58.46 crore) per year from an IPL team group to quit international cricket and play in T20 leagues across the globe. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/steven-gerrard-criticises-england-2000s-team-culture-and-seeks-new-managerial-challenges-2799823-2025-10-08",
      "headline": "We were egotistical losers: Steven Gerrard on why England's golden era failedSteven Gerrard offers a candid assessment of England's 'golden generation,' addressing cultural issues, missed connections, and his ongoing aspirations in football management."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/aryna-sabalenka-wuhan-open-unbeaten-streak-extends-comeback-win-2799816-2025-10-08",
      "headline": "Returning after US Open, Aryna Sabalenka makes shaky start in WuhanWorld No. 1 Aryna Sabalenka made a winning return at the 2025 Wuhan Open, defeating Rebecca Sramkova 4-6, 6-3, 6-1 to extend her unbeaten record at the tournament to 18-0."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-wi-darren-sammy-west-indies-test-cancer-decline-2799815-2025-10-08",
      "headline": "It's a cancer in the system: Darren Sammy on causes of West Indies' prolonged declineIND vs WI: Darren Sammy believes that the West Indies' decline in cricket is a result of deep-rooted issues within their system"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-india-tour-2025-26-world-test-championship-new-zealand-lessons-2799789-2025-10-08",
      "headline": "Temba Bavuma's warning: Inspired by New Zealand, South Africa hope to conquer IndiaTemba Bavuma urged South Africa to take inspiration from New Zealand's successful India tour, citing their smart use of spin. The Proteas will tour India in November and December. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/jordi-alba-retirement-sergio-ramos-tribute-barcelona-mls-2799768-2025-10-08",
      "headline": "Once bitter rival, Ramos pens heartfelt letter on Alba's retirementJordi Alba is set to retire from professional football at the end of this season. His longtime rival, Sergio Ramos paid a touching tribute to the former Barcelona player."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    }
  ]
}