{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-slashes-import-duty-on-bourbon-whiskey-to-50-per-cent-pm-modi-donald-trump-talks-2680358-2025-02-15",
      "headline": "India slashes import duty on bourbon whisky to 100% after Trump's criticismThe reduction in customs duty on bourbon whisky was notified on February 13 just ahead of Prime Minister Narendra Modi's talks with US President Donald Trump."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/what-is-digital-lending-5-key-benefits-you-should-know-2680169-2025-02-14",
      "headline": "What is digital lending? 5 key benefits you should know Digital lending platforms make use of advanced technology, thereby making the loan process faster, simpler and more efficient."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-has-it-really-been-simplified-for-taxpayers-2680087-2025-02-14",
      "headline": "New Income Tax bill: Has it really been simplified for taxpayers?The proposed income tax bill seeks to simplify and revamp the Income Tax Act of 1961, which has often been criticised for its complexity, making it challenging for ordinary taxpayers to navigate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/upi-transactions-changes-from-february-15-all-you-need-to-know-2680055-2025-02-14",
      "headline": "New UPI transaction rule: All you need to know about auto chargeback processThe changes are primarily regarding auto acceptance and rejection of chargebacks, thereby making the system more efficient."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-nifty-end-lower-fiis-continue-to-exit-dalal-street-2680072-2025-02-14",
      "headline": "Sensex, Nifty end lower as FIIs continue to exit Dalal StreetThe S&P BSE Sensex lost 199.76 points to end at 75,939.21, while the NSE Nifty50 lost 102.15 points to close at 22,929.25. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/vodafone-idea-stock-price-tumbles-6-today-what-triggered-the-slide-2680054-2025-02-14",
      "headline": "Explained: Why Vodafone Idea share price tumbled nearly 6%VI shares were down 5.09% to Rs 8.22 at around 3:15 pm. Earlier during the trading session, shares of the telecom operator fell as much as 6%. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ambanis-top-asias-rich-list-here-are-other-indians-who-made-it-mistry-birla-bajaj-hinduja-2680007-2025-02-14",
      "headline": "Ambani family richest in Asia. Check which Indian families made the top 20The Ambani family tops Bloomberg's list of Asia's 20 richest families. The family's flagship company, Reliance Industries, is presently headed by Mukesh Ambani, son of late industrialist Dhirubhai Ambani. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rbi-curbs-on-new-india-co-operative-bank-how-does-it-impact-customers-what-to-do-2680031-2025-02-14",
      "headline": "RBI curbs on New India Co-operative Bank: How does it impact customers?New India Co-operative Bank has been struggling with financial losses in recent years. According to its annual report, the bank recorded a loss of Rs 22.78 crore in the financial year ending March 2024, following a loss of Rs 30.75 crore in the previous year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/new-india-co-operative-banks-financial-operations-halted-after-notice-from-rbi-2680025-2025-02-14",
      "headline": "New India Co-operative Bank's financial operations halted after notice from RBIThe Reserve Bank of India (RBI) has restricted Mumbai-based New India Co-operative Bank from issuing loans, accepting deposits, or permitting withdrawals for six months. The move comes amid concerns over the bank's financial health and liquidity."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/not-trump-tariffs-but-this-is-whats-making-stock-market-investors-anxious-fii-selling-stock-market-fall-2680000-2025-02-14",
      "headline": "Not Trump's tariffs, but this is what's making stock market investors anxiousThe stock market jitters have occurred despite government measures, including tax relief and the Reserve Bank of India's (RBI) decision to reduce the repo rate by 25 basis points."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/rbi-issues-notice-to-halt-all-financial-operations-of-new-india-co-operative-bank-2679968-2025-02-14",
      "headline": "RBI issues notice to halt all financial operations of New India Co-operative BankRBI's move comes after what it called 'recent material developments' at the bank. Although the central bank did not provide specific details, it stated that these directions were issued to protect depositors' interests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-all-your-questions-answered-2679917-2025-02-14",
      "headline": "New income tax bill: All you questions answeredThe new income tax bill, compared to the Income Tax Act, 1961, is nearly half the size, containing 259,676 words, 23 chapters, 536 sections, 57 tables and 46 formulae."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/stock-market-crash-sensex-down-500-points-nifty-falls-3-things-you-need-to-know-2679965-2025-02-14",
      "headline": "Sensex tanks over 600 points: Why is the stock market down today?The Sensex and Nifty fell sharply after rising in early trade. Here are three things you need to know about today's stock market weakness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/explained-why-senco-gold-share-price-crashed-20-percent-after-q3-results-2679889-2025-02-14",
      "headline": "Explained: Why Senco Gold shares crashed 20% after Q3 results Senco Gold share price: In the third quarter, Senco Gold reported a nearly 70% drop in consolidated net profit to Rs 33 crore, compared to Rs 109 crore in the same period last year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/jiocinema-disney-hotstar-merge-to-launch-jiohotstar-what-it-means-for-you-subscription-plans-ott-2679869-2025-02-14",
      "headline": "JioCinema, Disney+ Hotstar merge to launch JioHotstar: What it means for youReliance Industries and Walt Disney's India business finalised their merger in November 2024, creating a joint venture with Viacom18 Media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-opening-bell-sensex-nifty-gain-as-us-india-trade-talks-show-positive-signs-2679851-2025-02-14",
      "headline": "Sensex, Nifty gain as US-India trade talks show positive signsThe S&P BSE Sensex was up 86.75 points to 76,225.72, while the NSE Nifty50 added 12.50 points to 23,043.90 as of 9:46 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-stock-market-nasdaq-rises-1-percent-on-inflation-relief-tesla-soars-6-nvidia-up-4-2679839-2025-02-14",
      "headline": "Nasdaq rises over 1% on inflation relief; Tesla soars 6%, Nvidia up 4%The Nasdaq Composite jumped 1.5%, the S&P 500 gained 1.04%, and the Dow Jones Industrial Average rose 0.77%"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-explained-tabled-parliament-what-is-changing-and-what-is-not-2679826-2025-02-14",
      "headline": "New Income Tax bill explained: What's changing and what's notNew Income Tax bill: It aims to simplify the existing Income Tax Act, 1961, by making it more structured and easier to understand. If passed, the new law will come into effect from April 1, 2026."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/epfo-likely-to-maintain-825-percent-interest-rate-on-pf-depsoits-2679563-2025-02-13",
      "headline": "EPFO likely to maintain 8.25% interest rate on PF deposits EPFO interest rate: In 2024-25, EPFO processed over 50.8 million claims worth Rs 2.05 lakh crore when compared to 44.5 million claims amounting to Rs 1.82 lakh crore settled in the previous year, as per the official data."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/adani-green-energy-exits-sri-lanka-wind-power-deal-stock-down-1-percent-2679469-2025-02-13",
      "headline": "Adani Green Energy exits Sri Lanka wind power deal; stock down 1%Adani Green Energy shares: As per the agreement with Sri Lanka, Adani Green was to construct two wind power projects in Mannar town and Pooneryn village, both located in the northern province of the country. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-erase-gains-to-end-lower-as-it-stocks-weigh-in-adani-enterprises-down-5-percent-2679429-2025-02-13",
      "headline": "Sensex, Nifty erase gains to end lower as IT stocks weigh in on stock marketsThe S&P BSE Sensex was down by 32.11 points to close at 76,138.97, while the NSE Nifty50 lost 13.85 points to end at 23,031.40. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/video/finance-minister-nirmala-sitharaman-introduces-new-income-tax-bill-in-lok-sabha-2679394-2025-02-13",
      "headline": "Finance Minister Nirmala SItharaman introduces new Income Tax Bill in Lok SabhaFinance Minister Nirmala Sitharaman tabled the new Income Tax bill in Lok Sabha amid the huge uproar by the opposition MPs. The bill will now be referred to the Select Committee of Lok Sabha for further review."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/finance-minister-nirmala-sitharaman-introduces-new-income-tax-bill-in-lok-sabha-overhaul-2679363-2025-02-13",
      "headline": "New Income Tax Bill tabled in Lok Sabha, faces select panel reviewThe government, in a bid to simplify the present Income Tax Act, 1961, has introduced a new income tax bill in Parliament today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/explained-why-are-large-cap-mutual-funds-back-in-demand-stock-market-volatility-2679356-2025-02-13",
      "headline": "Explained: Why are large-cap mutual funds back in demandWith small-cap and mid-cap stocks experiencing corrections, investors are moving towards large-cap funds, which are considered safer and more stable in volatile times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/quality-power-ipo-10-things-investors-must-know-before-subscribing-2679309-2025-02-13",
      "headline": "Quality Power IPO: 10 things investors must know before subscribing Quality Power Electrical Equipments Limited offers high-voltage electrical equipment and solutions for grid connectivity and energy transition."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-how-will-it-make-taxpayers-lives-simpler-2679254-2025-02-13",
      "headline": "New Income Tax Bill: How will it make taxpayers' lives simpler?The new income tax bill would be almost half of the current law, as the existing Income Tax Act,1961 contained 880 pages when it came into existence."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-gains-450-points-3-reasons-why-stock-market-is-rising-today-inflation-data-pm-modi-us-visit-2679218-2025-02-13",
      "headline": "Sensex gains 500 points: 3 reasons why stock market is rising todayAs of 10:48 AM, the S&P BSE Sensex was up 47.85 points at 76,644.93, while the NSE Nifty50 gained 137.75 points to 23,183.00."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/opening-bell-sensex-nifty-up-as-cooling-inflation-boosts-market-sentiment-share-market-today-2679189-2025-02-13",
      "headline": "Sensex, Nifty open higher as cooling inflation boosts market sentimentShare Market Today: The S&P BSE Sensex was up 163.21 points to 76,334.39, while the NSE Nifty50 gained 46.25 points to 23,091.50 as of 9:30 AM. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ajax-engineering-ipo-check-allotment-status-online-guide-listing-date-latest-gmp-2679171-2025-02-13",
      "headline": "Ajax Engineering IPO: Check allotment status, listing date and latest GMPAjax Engineering IPO allotment status: The IPO price band was set at Rs 599 to Rs 629 per share. The minimum lot size for the application was 23 shares. For retail investors, the minimum investment required was Rs 13,777."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-2025-to-be-tabled-today-parliament-heres-what-you-can-expect-2679153-2025-02-13",
      "headline": "New Income Tax Bill to be tabled today: Here's what you can expectNew Income Tax Bill is expected to come into effect on April 1, 2026. The bill aims to simplify tax laws, remove outdated provisions, and make compliance easier for taxpayers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/can-a-married-couple-save-more-taxes-using-both-old-and-new-tax-regime-2678890-2025-02-13",
      "headline": "Can a married couple save more taxes using both old and new tax regime?Married couples need to determine which tax regime offers lower tax liability for each spouse considering their income structure and deductions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indias-retail-inflation-dips-to-431-percent-in-january-2678907-2025-02-12",
      "headline": "India's retail inflation dips to 4.31% in January, hits a five-month lowThe country's retail inflation witnessed a drop in January majorly due to declining food prices, according to data released by the National Statistics Office on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-sensex-nifty-dalal-street-2678823-2025-02-12",
      "headline": "Sensex, Nifty recover sharply but end in red; M&M falls 3%The S&P BSE Sensex settled 122.52 points lower at 76,171.08. Earlier in the day, the 30-share index had plunged 850 points. Nifty, too, recovered strongly to end 26.55 points lower at 23,045.25."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/mutual-fund-inflows-see-slight-dip-in-january-heres-why-2678801-2025-02-12",
      "headline": "Mutual fund inflows see slight dip in January. Here's whyThe flows declined 3.6% month-on-month to 396.88 billion rupees ($4.57 billion) from 411.56 billion rupees in December 2024, according to data by the Association of Mutual Funds in India (AMFI)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/new-income-tax-bill-to-be-simpler-and-clearer-likely-to-be-presented-tomorrow-2678762-2025-02-12",
      "headline": "New Income Tax Bill to introduce simpler 'tax year' concept: All you need to knowWhen the Income Tax Act of 1961 came into being it had 880 pages. Over the years, the act contained several amendments introduced in the various budgets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-trading-strategy-what-should-investors-do-key-things-to-know-2678731-2025-02-12",
      "headline": "Stock market bloodbath: Should buy the dip, exit or stay invested? The stock market correction has particularly hit retail investors, many of whom are contemplating selling their holdings at a loss. But is that the right move? "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/after-90-hour-workweek-remark-l-and-t-chief-stirs-wfh-debate-2678704-2025-02-12",
      "headline": "After 90-hour workweek remark, L&T chief stirs work-from-home debateThis is not the first time that the L&T Chairman's remarks have sparked a debate.  Earlier, he advocated a 90-hour workweek, which drew huge criticism. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/will-retail-inflation-cool-down-further-in-january-here-is-all-you-need-to-know-2678656-2025-02-12",
      "headline": "Will retail inflation cool down further in January? Here's all you need to know The RBI mentioned continued reduction in rice prices and sharp corrections in the prices of vegetables, especially in the prices of onions, potatoes and tomatoes, in its January 2025 Bulletin. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/larsen-and-toubro-cmd-sn-subrahmanyan-raises-alarm-over-labour-shortage-blames-welfare-schemes-2678648-2025-02-12",
      "headline": "L&T chief stirs fresh row with remark on labour crisis: Workers unwilling to moveSpeaking at CII's Mystic South Global Linkages Summit 2025 in Chennai, Subrahmanyan spoke about the difficulties faced by the construction industry in hiring and mobilising workers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-down-over-700-points-nifty-falls-4-factors-behind-stock-market-crash-2678623-2025-02-12",
      "headline": "Sensex falls 700 points: 4 reasons why stock market is falling todayStock market crash: The S&P BSE Sensex plunged over 850 points before trimming some losses, trading 748.13 points lower at 75,545.47 by 10:23 am. The NSE Nifty50 also slipped nearly 1%, reflecting weakness across broader markets."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/south-korean-actor-kim-sae-ron-found-dead-at-24-2680949-2025-02-16",
      "headline": "South Korean actor Kim Sae-ron, 24, found deadSouth Korean actor Kim Sae-ron, known for her roles in Bloodhounds and The Man from Nowhere, was found dead at her home in Seoul. She was 24. Authorities are investigating the circumstances of her death, with no signs of foul play reported yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-white-lotus-season-3-review-lisa-parker-posey-and-jason-isaacs-show-is-predictable-but-entertaining-2680925-2025-02-16",
      "headline": "The White Lotus S3 review: Predictable? Yes. Addictive? Also, yesReleased-Mon Feb 17, 2025The White Lotus Season 3 review: The White Lotus returns with a new season set in Thailand, offering a fresh cultural backdrop while retaining its biting satire on the ultra-rich. The series continues to entertain with its dark humour and ensemble cast, though its formula is starting to feel familiar. Read our full review. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/music/story/kanye-west-says-he-fought-5-hours-for-grammy-tickets-amid-guest-list-confusion-2680934-2025-02-16",
      "headline": "Kanye West says he fought 5 hours for Grammy tickets amid guest list confusionRapper Kanye West, in a post on X, revealed that he fought for five hours to secure Grammy tickets amid guest list chaos. This comes amid claims that Kanye arrived at the event uninvited. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/comedian-anubhav-singh-bassi-lucknow-show-cancelled-by-cops-law-and-order-concern-2680788-2025-02-16",
      "headline": "Comedian Anubhav Bassi's Lucknow show cancelled after warning over foul languageThe shows of comedian Anubhav Singh Bassi in Lucknow were cancelled due to concerns over inappropriate content, following a complaint by the UP Women's Commission vice-chairperson. Authorities cited potential law and order issues as reasons for the cancellation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/chum-darang-blushes-karan-veer-mehra-confesses-love-valentine-day-bigg-boss-18-2680773-2025-02-16",
      "headline": "Watch: Chum Darang blushes as Karan Veer confesses love on Valentine's DayKaran Veer Mehra confessed his love for Chum Darang on Valentine's Day. Chum shared a post from their romantic outing on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/ed-sheeran-pauses-delhi-concert-for-fan-wears-team-india-dream-11-jersey-2680728-2025-02-16",
      "headline": "Watch: Ed Sheeran pauses Delhi concert as fan faints, wears Team India jerseyEd Sheeran wrapped up his India tour in Gurugram on February 15. He paused his concert briefly to help a fan who fainted."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/shalin-bhanot-reacts-to-indias-got-latent-row-advocates-self-discipline-2680673-2025-02-16",
      "headline": "Shalin Bhanot reacts to India's Got Latent Row, advocates self-disciplineTV actor Shalin Bhanot has reacted to the controversy surrounding YouTuber Ranveer Allahbadia's comment on India's Got Latent during the FDCI's India Men's Weekend in Jaipur. He emphasised self-discipline and responsibility.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/jay-z-reacts-after-rape-lawsuit-against-him-dropped-2680571-2025-02-15",
      "headline": "Today is a victory: Jay-Z reacts after rape lawsuit against him droppedIn a significant legal victory, rapper Jay-Z has seen a sexual assault lawsuit against him dismissed. The rapper and entrepreneur expressed relief and satisfaction over the court's decision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/mahabharat-actor-saurav-gurjar-threatens-ranveer-allahbadia-samay-raina-controversy-indias-got-latent-stmp-2680542-2025-02-15",
      "headline": "No one can save him: Mahabharat actor threatens Ranveer Allahbadia Actor Saurav Gurjar openly threatened Ranveer Allahbadia over his recent remarks on India's Got Latent. In a video message, the actor requested the government to take strict action against the podcaster. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/drake-releases-new-album-amid-feud-with-kendrick-lamar-fails-to-impress-fans-2680481-2025-02-15",
      "headline": "Drake releases new album amid feud with Kendrick Lamar, fails to impress fansDrake appears to have ended his feud with Kendrick Lamar in his latest album, but fans remain unimpressed. Released on Valentine's Day, the album in collaboration with PartyNextDoor marks his first new work since the Super Bowl halftime show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bharti-singh-supports-samay-raina-indias-got-latent-controversy-ranveer-allahbadia-good-talented-guy-2680407-2025-02-15",
      "headline": "Bharti Singh supports Samay Raina amid India's Got Latent controversyComedian Bharti Singh supported Samay Raina amid the India's Got Latent controversy. The comedian praised Samay and said that he is very sweet, and anyone can become his fan once they get to meet him. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-18-chum-darang-elvish-yadav-racist-remarks-2680401-2025-02-15",
      "headline": "Women's panel summons Elvish Yadav over remarks against Chum Darang on Feb 17YouTuber Elvish Yadav has been summoned by a women's panel following his racist remarks against Chum Darang. Yadav criticised her name and nationality, sparking courage among northeastern citizens. "
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/new-delhi-railway-station-stampede-cops-say-similar-train-names-with-prayagraj-led-to-mayhem-railways-disputes-2680835-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Delhi cops say similar train names caused confusion, led to deadly stampedeThe Delhi Police said that two trains - Prayagraj Express and Prayagraj Special, and the announcement of the latter arriving at platform 16 caused confusion. This is because Prayagraj Express was already standing on platform 14."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-chief-minister-name-legislative-party-meeting-monday-bjp-government-2680929-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Delhi Chief Minister to be finalised tomorrow, oath likely on February 18: SourcesThe BJP is set to finalise its Chief Minister at a legislative party meeting on Monday, with several contenders, including Parvesh Verma, Vijender Gupta, and potential women candidates, under consideration. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-full-schedule-kkr-vs-rcb-opener-final-may-25-2680913-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "IPL schedule: KKR vs RCB in opener on March 22, final in Kolkata on May 25IPL 2025: The BCCI announced the full schedule for the new season. KKR will take on RCB in the opening match on March 22 while the final will be in Kolkata on May 25. A total of 13 venues to host 74 matches in the 2025 season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/yamuna-river-cleaning-delhi-bjp-government-lg-vk-saxena-election-promise-2680906-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Yamuna clean-up begins under Lt Governor's order weeks after BJP win in DelhiDelhi Lieutenant Governor VK Saxena has launched Yamuna River clean-up efforts, deploying machinery and enforcing oversight, despite the absence of a new state government."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/ranveer-allahbadia-indias-got-latent-controversy-samay-raina-profanity-vulgarity-expletives-part-of-indian-culture-bihar-up-2680365-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Our sanskari swear words, profanity paramparaFrom abuses in Gaari Geet and Holi meetings, to profanities hurled at the deity at a temple fest in Kerala and expletives being used as conjunctions in everyday life, Indians need no primer on bawdy jokes and cuss words. And that's culture too. A look at that culture even as Indians outrage over Ranveer Allahbadia and Samay Raina."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/united-states-cancels-21m-funding-for-voter-turnout-in-india-29m-for-bangladesh-2680727-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Elon Musk's DOGE cancels $21 million US funding for voter turnout in IndiaElon Musk's Department of Government Efficiency (DOGE) has announced a decision to cut $723 million in foreign aid funding as part of its broader budget overhaul plans. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/tirumala-laddoo-plot-turns-murkier-inferior-ghee-proxy-firms-fake-gst-slips-2680916-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Tirumala laddoo plot turns murkier: Inferior ghee, proxy firms, fake GST slipsAndhra Pradesh CM Chandrababu Naidu, who made the prasadam scandal public, faces a major challenge of revamping temple administrations in the state\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/us-migrant-flight-illegal-indian-immigrants-deportee-claims-legs-chained-hands-cuffed-military-plane-amrtisar-2680787-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Legs chained, hands cuffed: Indian deportee on 2nd US flight recounts ordealThe US military C-17 aircraft, that landed in Amritsar late Saturday night, carried the second batch of illegal Indian immigrants as part of President Donald Trump's massive crackdown against undocumented aliens in America."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/delhi-railway-station-stampede-lt-governor-saxena-tweet-edit-death-aap-bjp-2680867-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Delhi Lt Governor's edited tweet on stampede sparks row, AAP alleges cover-upDelhi Lt Governor VK Saxena faced political backlash after editing his tweet on the New Delhi Railway Station stampede to remove the mention of deaths. The AAP accused him of downplaying the tragedy, which left 18 dead. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/madhya-pradesh-bhopal-groom-demands-thar-skips-wedding-dowry-case-police-probe-2680856-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Groom seeks Thar in dowry day before wedding, skips event over unmet demandA groom in Bhopal and his family have been charged under the Dowry Prohibition Act after he allegedly demanded a Thar jeep, cash, and jewellery before the wedding and called off the marriage when the bride's family refused the demands."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/lalu-prasad-yadav-maha-kumbh-mela-faltu-meaningless-delhi-stampede-rjd-bihar-controversy-2680846-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "'Faaltu hai Kumbh': Lalu Yadav's remark on Delhi stampede sparks rowLalu Prasad Yadav called the Maha Kumbh meaningless while commenting on the stampede at Delhi Railway Station. The BJP targeted him over the remarks, accusing him of insulting Sanatana Dharma and playing politics over dead bodies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/pakistani-man-dances-to-nimbooda-nimbooda-in-viral-video-2680823-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Pakistani man dances to Nimbooda Nimbooda in viral video. Internet loves his graceA video of a Pakistani man dancing effortlessly to Aishwarya Rai Bachchan's hit song 'Nimbooda Nimbooda' has gone viral on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/south-korean-actor-kim-sae-ron-found-dead-at-24-2680949-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "South Korean actor Kim Sae-ron, 24, found deadSouth Korean actor Kim Sae-ron, known for her roles in Bloodhounds and The Man from Nowhere, was found dead at her home in Seoul. She was 24. Authorities are investigating the circumstances of her death, with no signs of foul play reported yet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/delhi-railway-station-stampede-maha-kumbh-rush-train-cancelled-platform-change-2680875-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "No platform change, no train cancelled: Railways after Delhi stampede kills 18Indian Railways denied train cancellations or platform changes before Saturday's New Delhi station stampede, which killed 18.  Officials attribute the chaos to an unprecedented rush of Maha Kumbh pilgrims."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-pakistan-overhyped-harbhajan-singh-dubai-2680889-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India vs Pakistan is overhyped: Harbhajan sends Champions Trophy warning to fans Champions Trophy 2025: Former India cricketer Harbhajan Singh cautioned fans against expecting a close contest in the India vs Pakistan match, predicting a one-sided victory for Rohit Sharma's side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-white-lotus-season-3-review-lisa-parker-posey-and-jason-isaacs-show-is-predictable-but-entertaining-2680925-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "The White Lotus S3 review: Predictable? Yes. Addictive? Also, yesReleased-Mon Feb 17, 2025The White Lotus Season 3 review: The White Lotus returns with a new season set in Thailand, offering a fresh cultural backdrop while retaining its biting satire on the ultra-rich. The series continues to entertain with its dark humour and ensemble cast, though its formula is starting to feel familiar. Read our full review. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-450-14-02-2025?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/alexei-navalny-death-anniversary-can-russia-ever-break-free-from-putinism-2680834-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "A year without Alexei Navalny: Can Russia ever break free from Putinism?Alexei Navalny, Russia's most prominent Opposition leader for a decade, died on February 16 last year while serving a 19-year prison sentence. Since his death, Russia's Opposition remains fragmented. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/comedian-anubhav-singh-bassi-lucknow-show-cancelled-by-cops-law-and-order-concern-2680788-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Comedian Anubhav Bassi's Lucknow show cancelled after warning over foul languageThe shows of comedian Anubhav Singh Bassi in Lucknow were cancelled due to concerns over inappropriate content, following a complaint by the UP Women's Commission vice-chairperson. Authorities cited potential law and order issues as reasons for the cancellation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-cold-water-is-the-coolest-choice-for-your-skin-2680939-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why cold water is the coolest choice for your skinHot water can strip the skin of natural oils essential for hydration and disrupt the natural lipid layer, leading to dryness, irritation and more sensitivity\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pakistan-cricket-team-haris-fauf-cleared-opening-match-new-zealand-2680890-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Pakistan get big Champions Trophy boost as star pacer cleared for opener: ReportPakistan have received a big boost ahead of their Champions Trophy 2025 opening match against New Zealand as star pacer Haris Rauf has been cleared for the match. Rauf was injured during the recent tri-series. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/elon-musk-reacts-to-x-post-about-ashley-st-clair-claim-of-having-his-13th-child-2680751-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Elon Musk reacts after influencer claims she gave birth to his 13th childElon Musk, a day after influencer Ashley St. Clair claimed she had given birth to his 13th child, has reacted to one of the posts that said St. Clair had been trying to \"ensnare\" the Tesla CEO. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/new-delhi-railway-station-stampede-dead-injured-rush-passengers-police-chaos-2680820-2025-02-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Chaos at Delhi station day after stampede: Unruly passengers, mad rush on trainsA mad rush of passengers continues at the New Delhi railway station, where 18 people were killed in a stampede, with unruly passengers running and shoving others to get inside the compartments of a Bihar-bound train."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/abhishek-bachchan-poses-picture-amy-jackson-ed-westwick-british-asian-trust-gala-2680950-2025-02-16",
      "headline": "Abhishek Bachchan poses for a pic with Amy Jackson-Ed Westwick at British galaActor Abhishek Bachchan, who was among the other stars at At British Asian Trust Gala, posed for a picture with Amy Jackson and Ed Westwick. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/the-white-lotus-season-3-review-lisa-parker-posey-and-jason-isaacs-show-is-predictable-but-entertaining-2680925-2025-02-16",
      "headline": "The White Lotus S3 review: Predictable? Yes. Addictive? Also, yesReleased-Mon Feb 17, 2025The White Lotus Season 3 review: The White Lotus returns with a new season set in Thailand, offering a fresh cultural backdrop while retaining its biting satire on the ultra-rich. The series continues to entertain with its dark humour and ensemble cast, though its formula is starting to feel familiar. Read our full review. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/raha-kapoor-reaction-to-magicians-trick-at-jeh-ali-khan-birthday-party-reminds-fans-of-rishi-kapoor-2680907-2025-02-16",
      "headline": "Watch: Raha's reaction to magician's trick at Jeh's party reminds fans of Rishi KapoorRanbir Kapoor, Alia Bhatt's daughter, Raha's adorable reaction to a magician's trick at Kareena Kapoor's son Jeh's birthday bash has gone viral.  Her reaction reminded the internet of Rishi Kapoor.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/akshay-kumar-touches-amitabh-bachchan-feet-ispl-season-2-cricket-tips-sachin-tendulkar-2680863-2025-02-16",
      "headline": "Akshay Kumar touches Big B's feet, takes cricket tips from Sachin TendulkarAmitabh Bachchan, along with Akshay Kumar and Sachin Tendulkar, attended the ISPL (Indian Street Premier League) Season 2 event in Mumbai. One of the viral videos featured Akshay greeting Amitabh by touching his feet. "
    }
  ],
  "sports": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/story/cricket-ipl-2025-team-wise-full-schedule-csk-schedule-mi-ipl-schedule-rcb-match-list-kkrs-matches-2680946-2025-02-16",
      "headline": "IPL 2025 team-wise full schedule: Key matches of CSK, MI, RCB, KKR and othersThe schedule for the Indian Premier League 2025 (IPL 2025) was unveiled by the BCCI (Board of Control for Cricket in India) on Sunday, February 16. Here's the team-wise schedule of all the IPL teams such as CSK, MI, RCB and KKR amongst others."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/story/ipl-2025-schedule-venues-double-headers-details-dates-2680935-2025-02-16",
      "headline": "IPL 2025 schedule announced: 13 venues, 12 double-headers in new seasonA total of 13 venues will be used for the new season of the IPL in 2025 as the tournament starts on March 22. The 2025 season will see 12 double headers take place as the 10 teams battle it out for the title. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-rishabh-pant-suffers-injury-scare-after-being-hit-on-his-knee-during-practice-2680919-2025-02-16",
      "headline": "Watch: India suffer injury scare as Pant gets hit on his knee during practiceIndia wicketkeeper-batter Rishabh Pant was seen in excruciating pain after being hit on his knee during the team's first practice session in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-full-schedule-kkr-vs-rcb-opener-final-may-25-2680913-2025-02-16",
      "headline": "IPL schedule: KKR vs RCB in opener on March 22, final in Kolkata on May 25IPL 2025: The BCCI announced the full schedule for the new season. KKR will take on RCB in the opening match on March 22 while the final will be in Kolkata on May 25. A total of 13 venues to host 74 matches in the 2025 season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-pakistan-cricket-team-haris-fauf-cleared-opening-match-new-zealand-2680890-2025-02-16",
      "headline": "Pakistan get big Champions Trophy boost as star pacer cleared for opener: ReportPakistan have received a big boost ahead of their Champions Trophy 2025 opening match against New Zealand as star pacer Haris Rauf has been cleared for the match. Rauf was injured during the recent tri-series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-pakistan-overhyped-harbhajan-singh-dubai-2680889-2025-02-16",
      "headline": "India vs Pakistan is overhyped: Harbhajan sends Champions Trophy warning to fans Champions Trophy 2025: Former India cricketer Harbhajan Singh cautioned fans against expecting a close contest in the India vs Pakistan match, predicting a one-sided victory for Rohit Sharma's side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-pakistan-cricket-team-is-like-their-country-both-go-up-and-down-says-aakash-chopra-2680877-2025-02-16",
      "headline": "Pakistan cricket team is like their country, both go up and down: Aakash ChopraFormer India cricketer turned commentator has compared the Pakistan cricket team's inconsistency with their country, mentioning how both have a volatile nature."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-united-amad-diallo-injury-2680853-2025-02-16",
      "headline": "Premier League: Manchester United confirm injury blow for forward Amad DialloManchester United have confirmed that Amad Diallo will be out of action for several weeks after sustaining an ankle injury during training. Amad will miss United's away trip to Tottenham Hotspur on Sunday, February 16, "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-pakistan-match-tickets-online-sold-out-dubai-2680852-2025-02-16",
      "headline": "Extra tickets for India vs Pakistan match in Dubai sold out within hoursChampions Trophy 2025: The ICC announced the sale of additional tickets for India's matches in Dubai on February 16. The India vs Pakistan tickets were gone in hours. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-kane-williamson-wearing-dhoti-karachi-squad-viral-video-2680849-2025-02-16",
      "headline": "Watch: New Zealand's Williamson spotted wearing a dhoti in KarachiKane Williamson delighted fans by embracing local culture in Karachi, donning a traditional dhoti ahead of New Zealand's Champions Trophy opener clash against hosts Pakistan on February 19."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-pakistan-overhyped-harbhajan-singh-dubai-2680889-2025-02-16",
      "headline": "India vs Pakistan is overhyped: Harbhajan sends Champions Trophy warning to fans Champions Trophy 2025: Former India cricketer Harbhajan Singh cautioned fans against expecting a close contest in the India vs Pakistan match, predicting a one-sided victory for Rohit Sharma's side."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-cricket-pakistan-cricket-team-is-like-their-country-both-go-up-and-down-says-aakash-chopra-2680877-2025-02-16",
      "headline": "Pakistan cricket team is like their country, both go up and down: Aakash ChopraFormer India cricketer turned commentator has compared the Pakistan cricket team's inconsistency with their country, mentioning how both have a volatile nature."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-manchester-united-amad-diallo-injury-2680853-2025-02-16",
      "headline": "Premier League: Manchester United confirm injury blow for forward Amad DialloManchester United have confirmed that Amad Diallo will be out of action for several weeks after sustaining an ankle injury during training. Amad will miss United's away trip to Tottenham Hotspur on Sunday, February 16, "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-india-vs-pakistan-match-tickets-online-sold-out-dubai-2680852-2025-02-16",
      "headline": "Extra tickets for India vs Pakistan match in Dubai sold out within hoursChampions Trophy 2025: The ICC announced the sale of additional tickets for India's matches in Dubai on February 16. The India vs Pakistan tickets were gone in hours. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/champions-trophy-kane-williamson-wearing-dhoti-karachi-squad-viral-video-2680849-2025-02-16",
      "headline": "Watch: New Zealand's Williamson spotted wearing a dhoti in KarachiKane Williamson delighted fans by embracing local culture in Karachi, donning a traditional dhoti ahead of New Zealand's Champions Trophy opener clash against hosts Pakistan on February 19."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}