{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-reforms-today-price-changes-everyday-goods-milk-dairy-sin-ultra-luxury-pm-modi-india-tax-2791115-2025-09-22",
      "headline": "GST 2.0 guide: Past benefits, new tax changes you must know The new framework brings in two primary tax rates of 5% and 18%, while ultra-luxury and sin goods will be taxed at 40%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/new-gst-rates-from-september-22-cheaper-costlier-list-of-products-list-2790847-2025-09-21",
      "headline": "GST 2.0 comes into effect: What's cheaper and costlier from todayAs the new rates under GST 2.0 come into effect from Monday, Prime Minister Narendra Modi said the reforms will boost savings for households, farmers, shopkeepers, and businesses."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-refund-delay-under-processin-how-to-check-status-and-what-to-do-next-2790817-2025-09-21",
      "headline": "ITR refund under processing? Here's how to check status and what to do nextIf your refund remains under processing, first ensure your ITR has been e-verified, as refunds cannot be processed without this step. You can also check Form 26AS to verify if the refund has already been credited to your account."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/from-grocery-runs-to-gym-sessions-what-today-homebuyers-really-want-2790798-2025-09-21",
      "headline": "From grocery runs to gym sessions: What today's homebuyers really wantToday's urban buyers want more than a home, they seek a lifestyle where comfort, convenience, and community come together, and daily needs, work, and wellness coexist effortlessly."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/piyush-goyal-leads-indian-delegation-us-trade-talks-september-22-2025-2790679-2025-09-20",
      "headline": "Piyush Goyal to visit US for trade talks on September 22 amid tariff, H-1B tensionsThe minister will visit New York and will be accompanied by special secretary in the ministry Rajesh Agrawal and other officials."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/us-h1b-visa-fee-hike-100000-panic-indian-professionals-travel-disruption-diwali-2790663-2025-09-20",
      "headline": "H-1B visa holders cancel trips to India for weddings, Diwali amid new fee hikeWhile many cancelled plans to travel at the last minute while waiting to board flights to India, several others already in India are scrambling to return amid lack of clarity after Trump on Friday signed a proclamation to raise the H-1B visa fees."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/amul-cuts-prices-of-700-products-ghee-cheaper-by-rs-40-per-litre-from-september-22-mother-dairy-gst-rate-cuts-2790620-2025-09-20",
      "headline": "Amul cuts prices of 700 products, ghee cheaper by Rs 40 per litre from Sept 22Amul, marketed by the Gujarat Cooperative Milk Marketing Federation (GCMMF), on Saturday announced a price reduction for over 700 products, including ghee, butter, ice cream, cheese, and frozen snacks. The move comes after a GST rate cut, with the company passing the benefits to consumers."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nasscom-warns-us-100000-h1b-visa-fee-impact-indian-it-firms-2790579-2025-09-20",
      "headline": "H-1B visa fee hike will disrupt Indian tech ops, 1-day deadline concerning: NasscomNasscom cautioned that Indian nationals employed on H-1B visas will be directly impacted, while technology companies will face disruption in ongoing client projects requiring onshore deployment."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/is-your-itr-refund-delayed-heres-why-the-process-is-taking-longer-this-year-2790516-2025-09-20",
      "headline": "ITR refund delayed? Here's why the process may take longer this yearTax refunds this year are taking longer than usual, leaving many taxpayers waiting and prompting questions about delays, processing times, and what to expect in the weeks ahead."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/insurance-trap-india-mis-selling-policies-irdai-agent-rbm-commissions-bank-targets-financial-illiteracy-2790046-2025-09-20",
      "headline": "Why India's insurance market has become a breeding ground for mis-sellingFrom loans tied to unwanted policies to agents chasing fat commissions, insurance policies that were meant to shield families have instead become a trap for many. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cryptocurrency-a-bigger-challenge-to-dollar-than-brics-currency-says-wef-president-2790312-2025-09-19",
      "headline": "Cryptocurrency a bigger challenge to dollar than BRICS currency, says WEF PresidentSpeaking in an exclusive conversation with India Today TV, Brende said de-dollarisation is unlikely in the near term. He added that cryptocurrency is a bigger challenge to the dollar than a potential BRICS currency."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-powers-18-percent-of-global-growth-wef-president-borge-brende-sees-tariff-row-with-us-easing-soon-2790284-2025-09-19",
      "headline": "India powers 18% of global growth, WEF chief sees tariff row with US easing soonIn an exclusive interaction with India Today TV, WEF President Borge Brende described India's rapid expansion as a source of \"exported prosperity\" to the world. \"Just imagine what it means for global prosperity. So, you are exporting prosperity by growing so fast,\" he said."
    }
  ],
  "entertainment": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pawan-kalyan-wields-katana-sword-at-they-call-him-og-pre-release-event-hyderabad-2791089-2025-09-22",
      "headline": "Pawan Kalyan wields sword at OG event, narrowly misses his bodyguard. WatchPawan Kalyan made a dramatic entry wielding a katana (sword) at the 'They Call Him OG' pre-release event in Hyderabad. The sword narrowly missed his bodyguard."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/atlee-birthday-allu-arjun-rashmika-mandanna-kalyani-priyadarshan-birthday-wishes-2791003-2025-09-21",
      "headline": "Atlee turns 39: Allu Arjun, Rashmika Mandanna and others extend birthday wishesActors Allu Arjun, Rashmika Mandanna, and Kalyani Priyadarshan wished director Atlee on his 39th birthday. His wife, Priya, also shared a heartwarming post on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/zubeen-garg-death-brahmaputra-river-final-rites-old-interview-2790989-2025-09-21",
      "headline": "Zubeen Garg wanted his final rites to be held by Brahmaputra riverAs fans share their condolences, an old interview of late singer Zubeen Garg is going viral in which he expressed how he wanted to spend his final time. The 52-year-old died in Singapore on September 19 during a sea outing. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kareena-kapoor-turns-45-karisma-soha-neetu-extend-wishes-to-ultimate-glam-queen-2790931-2025-09-21",
      "headline": "Kareena Kapoor turns 45, Karisma, Soha, Neetu extend wishes to ultimate glam queenActor Kareena Kapoor Khan celebrated her 45th birthday on September 21, 2025. She received warm birthday wishes from family and friends on her special day."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/varun-dhawan-surprised-as-youtuber-ishowspeeds-dance-video-on-bijuria-goes-viral-2790933-2025-09-21",
      "headline": "Varun Dhawan surprised as YouTuber IShowSpeed's dance video on Bijuria goes viralThe song 'Bijuria, recreated for 'Sunny Sanskari Ki Tulsi Kumari', has caught the attention of popular YouTuber IShowSpeed. Along with fans, the video has also garnered praise from the film's lead actor, Varun Dhawan. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/dulquer-salmaan-dismisses-reports-of-lokah-ott-release-asks-whats-the-hurry-2790925-2025-09-21",
      "headline": "Dulquer Salmaan dismisses reports of Lokah OTT release, asks what's the hurryAs 'Lokah' continues to rule the box office, actor Dulquer Salmaan has shut down reports surrounding its OTT release in the near future. The film has earned over Rs 200 crore worldwide. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-nehal-chudasama-sent-to-secret-room-pic-goes-viral-2790891-2025-09-21",
      "headline": "Bigg Boss 19: Nehal Chudasama sent to secret room? Pic goes viralModel Nehal Chudasama has reportedly become the second contestant of 'Bigg Boss 19' to be sent to the secret room. While there were speculations that she had been evicted, a photo of the contestant from the secret room is going viral."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/aryan-khan-poses-with-samay-raina-in-say-no-to-cruise-tshirt-suhana-reacts-2790863-2025-09-21",
      "headline": "Aryan Khan poses with Samay Raina in Say No to Cruise T-shirt, Suhana reactsDebutant director Aryan Khan posed with comedian Samay Raina at 'The Ba***ds of Bollywood' premiere. However, it was Samay's 'Say No to Cruise' T-shirt that drew the attention of not just social media users but also Aryan's sister Suhana. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-dedicates-dadasaheb-phalke-award-to-malayalam-industry-its-legacy-2790872-2025-09-21",
      "headline": "Mohanlal dedicates Dadasaheb Phalke Award to Malayalam industry and its legacyActor Mohanlal accepted reacted to be named as the recipient of the prestigious Dadasaheb Phalke award with deep humility and gratitude. He dedicated the honour to the Malayalam film industry, highlighting its rich legacy and artistry."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/anurag-kashyap-vetrimaaran-bad-girl-to-release-in-hindi-here-is-what-we-know-2790850-2025-09-21",
      "headline": "Anurag Kashyap, Vetri Maaran's Bad Girl to release in Hindi. Here's what we knowThe Tamil film Bad Girl, acclaimed internationally, will release in Hindi on September 26. The move highlights growing recognition of bold female-centric stories in Indian cinema."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/zubeen-gargs-wife-garima-cries-inconsolably-while-receiving-singers-body-2790811-2025-09-21",
      "headline": "Zubeen Garg's wife Garima cries inconsolably while receiving singer's bodyLate singer Zubeen Garg's wife, Garima, broke down as she received his body at Guwahati airport. She grieved while hugging the casket. Fans and leaders, including Assam chief minister Himanta Biswa Sarma, also paid tribute."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jolly-llb-3-box-office-day-2-akshay-arshad-film-earns-rs-32-crore-in-two-days-2790815-2025-09-21",
      "headline": "Jolly LLB 3 box office Day 2: Akshay, Arshad's film earns Rs 32 crore in two days'Jolly LLB 3', featuring actors Akshay Kumar and Arshad Warsi, collected Rs 32 crore in two days. The comedy-drama has benefitted from word-of-mouth, which is reflected in its second day earnings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-weekend-ka-vaar-gaurav-khanna-criticised-for-inactivity-awez-darbar-neelam-giri-clash-2790797-2025-09-21",
      "headline": "Bigg Boss 19 Weekend Ka Vaar: Gaurav criticised for inactivity, Awez-Neelam clashActor Salman Khan confronted 'Bigg Boss 19' contestant Gaurav Khanna over his laidback approach on 'Weekend Ka Vaar'. This criticism came after Gaurav was also called out by housemates during the 'Thumbnail' task. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/zubeen-gargs-body-reaches-guwahati-fans-bid-farewell-to-singer-2790764-2025-09-21",
      "headline": "Zubeen Garg's body reaches Guwahati, fans bid farewell to singerSinger Zubin Garg has passed away following a swimming accident in Singapore. His mortal remains have reached Guwahati, after being received in Delhi by Assam Chief Minister Himanta Biswa Sarma. Large crowds of fans have gathered at the singer's residence, with many waiting overnight to pay their respects. A reporter at the scene stated, \"the entire Guwahati as well as Assam has shut down itself to pay tribute to the legend Dubinderg.\" The widespread public grief is being compared to that seen after the death of Bhupen Hazarika in 2011. Garg's body will be taken from his residence to Sorosadhai Stadium in Guwahati, where the public can pay their final tributes. Prime Minister Narendra Modi and other artists have also expressed their condolences."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/idli-kadai-trailer-dhanush-returns-to-his-roots-to-save-family-legacy-2790804-2025-09-21",
      "headline": "Idli Kadai trailer: Dhanush returns to his roots to save family legacyThe trailer of actor-director Dhanush's 'Idli Kadai' depicts a son's struggle to protect his family legacy. The film explores tradition versus modernity amid personal betrayal and reconciliation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/amitabh-bachchan-honours-helmet-man-of-india-on-kbc-17-praises-his-selfless-work-2790781-2025-09-21",
      "headline": "Amitabh Bachchan honours Helmet Man of India on KBC 17, praises his selfless workActor Amitabh Bachchan honoured Raghvendra Kumar, known as the Helmet Man of India, for his selfless efforts in promoting helmet safety among bike riders. The veteran praised Kumar for his contribution towards social awareness."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/zubeen-garg-body-kept-at-guwahati-stadium-himanta-biswa-sarma-pays-tribute-2790762-2025-09-21",
      "headline": "Zubeen Garg's body kept at Guwahati stadium, Himanta Biswa Sarma pays tributeThe body of Assamese singer Zubeen Garg is placed at Sarusajai Stadium in Guwahati. The state mourns his tragic death and pays tribute to the cultural icon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/vicky-kaushal-honoured-as-aamir-khan-picks-him-as-bhuvan-for-lagaan-remake-2790718-2025-09-21",
      "headline": "Vicky Kaushal honoured as Aamir Khan picks him as Bhuvan for Lagaan remakeActor Vicky Kaushal reacted to Aamir Khan calling him Bhuvan if 'Lagaan' was remade today. The 'Chhaava' actor expressed gratitude to Khan for the comparison."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mammooty-khushboo-sundar-celebs-congratulate-mohanlal-dadasaheb-phalke-award-2790627-2025-09-20",
      "headline": "Mammootty to Khushboo, celebs congratulate Mohanlal for Dadasaheb Phalke AwardActors Mammootty and Khushboo Sundar, amongst others, extended their best wishes to Mohanlal. On Saturday, it was announced that the actor will be honoured with the Dadasaheb Phalke Award at the 71st National Film Awards. \r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/gst-reforms-today-price-changes-everyday-goods-milk-dairy-sin-ultra-luxury-pm-modi-india-tax-2791115-2025-09-22",
      "headline": "GST 2.0 guide: Past benefits, new tax changes you must know The new framework brings in two primary tax rates of 5% and 18%, while ultra-luxury and sin goods will be taxed at 40%."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-pak-asia-cup-you-talk-we-win-super-4-volatile-analysis-2791084-2025-09-22",
      "headline": "You talk, we win: India deliver, Pakistan flop in volatile Super 4 clashAsia Cup, IND vs PAK: The Super 4 clash was loaded with drama and theatrics, but India let their cricket do the talking. Pakistan's posturing fizzled against Abhishek Sharma and Shubman Gill, who led a ruthless chase, before captain Suryakumar added insult to injury."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-and-musk-reunite-at-charlies-funeral-shake-hands-seen-chatting-glbs-2791078-2025-09-22",
      "headline": "Trump, Elon Musk reunite at Charlie Kirk memorial months after public falloutMonths after a public fallout, President Donald Trump and Tesla CEO Elon Musk reunited at the memorial for conservative activist Charlie Kirk on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/featurephilia/story/trump-h1b-visa-fee-hike-drives-stem-talent-china-k-visa-tech-race-2791052-2025-09-22",
      "headline": "In Trump's H-1B harakiri, China seizes its moment. Once againTrump's sudden USD 100,000 H-1B visa fee is pushing global STEM talent towards China. This shift threatens America's technological leadership and offers China a strategic advantage in the global tech race."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-pakistan-asia-cup-fiery-chase-verbal-exchanges-dubai-2791049-2025-09-21",
      "headline": "Go fetch the ball: Shubman Gill, Abhishek in verbal battle vs Pakistan pacersAsia Cup 2025, IND vs PAK Super 4: Shubman Gill and Abhishek Sharma did not hold back when provoked as they gave it back to Pakistan pacers Shaheen Afridi and Haris Rauf. The two Indian batters added 100 runs in 8.4 overs for the opening partnership on Sunday, September 21."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/savings-festival-swadeshi-pm-modi-tweet-gst-20-reforms-tax-cuts-whats-cheaper-2791091-2025-09-22",
      "headline": "Savings and swadeshi: PM Modi's post as GST 2.0 tax cuts kick inPrime Minister Narendra Modi hailed the launch of the government's sweeping GST 2.0 reforms, calling it both a savings drive and a push for swadeshi, or Made in India products."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-vs-pakistan-rivalry-suryakumar-yadav-press-conference-reporter-2791070-2025-09-22",
      "headline": "Ind-Pak not a rivalry anymore: Suryakumar Yadav rubs salt into Pakistan's woundsAsia Cup 2025, IND vs PAK Super 4: Suryakumar Yadav rubbed salt into Pakistan's wounds with a pointed comment on the India–Pakistan rivalry. The India captain urged journalists not to overhype the contest, highlighting how one-sided it has been in recent times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/why-sebi-order-on-hindenburg-charges-is-big-relief-for-adani-2790852-2025-09-21",
      "headline": "Why Sebi order on Hindenburg charges is big relief for AdaniMarket regulator Sebi says its investigation found no evidence that the Adani Group had routed funds through related parties to inflate share prices of its listed entities"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-pak-asia-cup-sahibzada-farhan-pakistan-batter-gun-shot-celebration-reaction-2791073-2025-09-22",
      "headline": "Pakistan batter Sahibzada Farhan's gun-shot celebration causes uproarAsia Cup 2025 IND vs PAK: Sahibzada Farhan's 58-run innings should have been the highlight, but his provocative gun gesture overshadowed his batting heroics. Coupled with Haris Rauf's fighter-jet salute, Sunday's clash once again blurred the line between cricket and politics, turning a high-stakes match into a flashpoint for controversy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/ed-raids-in-himachal-delhi-uncovers-benami-foreign-assets-linked-to-imperial-group-2790831-2025-09-21",
      "headline": "Chopper, Thailand villa: ED busts Delhi businessman's Rs 80 crore foreign stashThe Enforcement Directorate conducted raids on six sites in Himachal Pradesh and Delhi, revealing more than Rs 80 crore in undisclosed overseas assets linked to Imperial Group's chairman Manvinder Singh and associates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/university-of-bath-school-of-management-where-careers-begin-with-confidence-2788009-2025-09-16",
      "headline": "University of Bath School of Management: Where Careers Begin With ConfidenceWith students from over 160 countries and a strong alumni network spanning 130 nations, the School creates a community that feels global in reach yet personal in experience. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/no-handshakes-pakistan-captain-presentation-ceremony-appearance-vs-india-2791065-2025-09-22",
      "headline": "No handshakes again but Pakistan captain makes presentation ceremony u-turnAsia Cup 2025: There was no customary post-match handshake between the two teams following India's six-wicket win over Pakistan. However, in a surprising twist, Pakistan captain Salman Ali Agha reversed his earlier stance and attended the post-match ceremony."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/in-pics-partial-solar-eclipse-turns-sun-into-crescent-over-pacific-skies-glbs-2791087-2025-09-22",
      "headline": "In pics: Partial solar eclipse turns Sun into crescent over Pacific skiesOn September 21, a deep partial solar eclipse darkened skies over the Pacific, with Antarctica, New Zealand and Australia witnessing the best views as the sun appeared transformed into a radiant crescent."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/china-to-launch-k-visa-to-invite-foreign-talent-from-october-1-amid-h1-b-visa-chaos-2791026-2025-09-21",
      "headline": "Amid H-1B chaos, China bets on new K Visa to woo global talent from October 1The K visa, which observers are calling China's version of the US H-1B, is designed to draw highly skilled talent."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/kanpur-dowry-dispute-snake-bite-attack-woman-seven-family-members-charged-2791105-2025-09-22",
      "headline": "Woman locked in room by in-laws after dowry dispute, they let snake loose on herA woman in Kanpur was reportedly confined to a room by her in-laws and bitten by a snake allegedly released due to unmet dowry demands. Police have registered a case against seven people, and an investigation is ongoing."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/external-affairs-minister-s-jaishankar-meet-us-secretary-of-state-marco-rubio-washington-50-tariff-hike-2791088-2025-09-22",
      "headline": "S Jaishankar to meet Marco Rubio in US today, first after 50% tariffs on IndiaThe Jaishankar-Rubio meeting also coincides with the ongoing India-US trade talks which are currently underway in Washington, with Union Commerce Minister Piyush Goyal leading the discussions which resumed after Trump marked a shift in tone, and announced that his team was continuing negotiations to address trade barriers with New Delhi."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-pakistan-asia-cup-haris-rauf-fighter-jet-gesture-kohli-chants-2791071-2025-09-22",
      "headline": "Watch: Haris Rauf reacts to Kohli chants with provocative fighter jet gesturePakistan fast bowler Haris Rauf ignited controversy during the Super 4 clash against India in Dubai, responding to the crowd's chants of Virat Kohli's name with a provocative fighter-jet celebration, drawing widespread attention and debate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kanpur-police-arrest-live-in-partner-friend-for-womans-murder-throwing-body-in-yamuna-river-2791029-2025-09-21",
      "headline": "UP man kills live-in partner after second girlfriend objects to their relationKanpur police have cracked a two-month-old murder case in which a man strangled his 20-year-old live-in partner, Akanksha alias Mahi, after pressure from another girlfriend. With a friend's help, he dumped her body in the Yamuna near Banda."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/ulips-mutual-funds-why-you-need-both-for-a-balanced-portfolio-2789465-2025-09-19",
      "headline": "ULIPs & Mutual Funds: Why you need both for a balanced portfolioULIPs give you protection and discipline for the long haul, while mutual funds give you liquidity and flexibility for the near term."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/lucknow-accident-thar-rams-e-rickshaw-accused-arrested-2791055-2025-09-21",
      "headline": "Two dead, six injured after Thar rams e-rickshaw in Lucknow, accused arrestedThe accused, identified as Akshay Pratap Singh alias Ani, was taken into custody from his flat in Sushant Golf City on Saturday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/information/story/navratri-2025-best-time-to-visit-cr-park-for-durga-puja-celebration-2790988-2025-09-22",
      "headline": "Navratri 2025: Best time to visit CR Park for Durga Puja celebrationPlanning to visit CR Park for Durga Puja 2025? Here's the best time to experience Sandhya Aarti, Bhog, cultural shows, Anondo Mela, and Visarjan at Delhi's 'Mini Kolkata'.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/studying-abroad-breaks-us-uk-shackle-the-top-nations-attracting-indians-2790717-2025-09-21",
      "headline": "Studying abroad breaks US-UK shackle: The top nations attracting IndiansFor Indian students, the international study journey is no longer about following the herd but strategically making futuristic choices"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/tamil-nadu/story/tamil-nadu-cm-stalin-prophet-muhammad-teachings-included-syllabus-dmk-support-muslim-rights-2791054-2025-09-21",
      "headline": "Prophet Muhammad already in school syllabus: Stalin's Muslim outreach ahead of pollsM K Stalin assured that the party will always stand with the Muslim community and remain committed to protecting and securing their rights."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/indian-h1b-visa-holders-panic-trump-immigration-100000-us-dollars-visa-fee-big-tech-return-2790836-2025-09-21",
      "headline": "Wedding called off, mother in tears: Trump H-1B move spells mayhem for IndiansIt was only later that the White House clarified that employers wouldn't be required to pay the exorbitant amount for H-1B holders upon re-entry to the US, bringing relief to many. But by then, the damage was already done."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-vs-pakistan-salman-ali-agha-fakhar-zaman-dismissal-umpires-mistake-2791112-2025-09-22",
      "headline": "Salman Agha's subtly protests Fakhar Zaman's India dismissal: Umpires can make mistakesPakistan skipper Salman Agha questioned Fakhar Zaman's early dismissal against India in the Asia Cup Super 4. While acknowledging umpiring mistakes happen, he stressed the wicket could have shifted momentum in Pakistan's favor."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-vs-pakistan-abhishek-sharma-man-of-the-match-mom-sister-reaction-2791086-2025-09-22",
      "headline": "Abhishek Sharma's mom and sister elated after Pakistan demolition: Waiting for his 100Abhishek Sharma lit up Dubai with a blistering 74 as India humbled Pakistan once again in the Asia Cup. While his batting thrilled fans, his mother and sister stole hearts with their emotional, pride-filled reactions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-pak-asia-cup-you-talk-we-win-super-4-volatile-analysis-2791084-2025-09-22",
      "headline": "You talk, we win: India deliver, Pakistan flop in volatile Super 4 clashAsia Cup, IND vs PAK: The Super 4 clash was loaded with drama and theatrics, but India let their cricket do the talking. Pakistan's posturing fizzled against Abhishek Sharma and Shubman Gill, who led a ruthless chase, before captain Suryakumar added insult to injury."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-abhishek-sharma-batting-2791074-2025-09-22",
      "headline": "Abhishek Sharma's blazing 74 leads India to Asia Cup win over PakistanYoung India opener Abhishek Sharma ripped apart Pakistan in the Super 4 of the Asia Cup. India captain Suryakumar Yadav reacted to Abhishek's incredible rise has said that for someone who works as hard as Abhishek, God has special plans."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/india-vs-pakistan-abhishek-sharma-sunil-gavaskar-interview-2791075-2025-09-22",
      "headline": "When Abhishek is on song, India will not just win, but dance to victory: GavaskarAsia Cup 2025, IND vs PAK: Abhishek Sharma scored 74 runs off 34 balls and helped India beat Pakistan in their Super Four clash. Former Indian cricketer Sunil Gavaskar heaped praise on the youngster for the stupendous knock. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-vs-pak-asia-cup-sahibzada-farhan-pakistan-batter-gun-shot-celebration-reaction-2791073-2025-09-22",
      "headline": "Pakistan batter Sahibzada Farhan's gun-shot celebration causes uproarAsia Cup 2025 IND vs PAK: Sahibzada Farhan's 58-run innings should have been the highlight, but his provocative gun gesture overshadowed his batting heroics. Coupled with Haris Rauf's fighter-jet salute, Sunday's clash once again blurred the line between cricket and politics, turning a high-stakes match into a flashpoint for controversy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-pakistan-asia-cup-haris-rauf-fighter-jet-gesture-kohli-chants-2791071-2025-09-22",
      "headline": "Watch: Haris Rauf reacts to Kohli chants with provocative fighter jet gesturePakistan fast bowler Haris Rauf ignited controversy during the Super 4 clash against India in Dubai, responding to the crowd's chants of Virat Kohli's name with a provocative fighter-jet celebration, drawing widespread attention and debate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-vs-pakistan-rivalry-suryakumar-yadav-press-conference-reporter-2791070-2025-09-22",
      "headline": "Ind-Pak not a rivalry anymore: Suryakumar Yadav rubs salt into Pakistan's woundsAsia Cup 2025, IND vs PAK Super 4: Suryakumar Yadav rubbed salt into Pakistan's wounds with a pointed comment on the India–Pakistan rivalry. The India captain urged journalists not to overhype the contest, highlighting how one-sided it has been in recent times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhishek-sharma-sledging-verbal-exchange-asia-cup-2025-india-pakistan-2791066-2025-09-22",
      "headline": "Abhishek Sharma on verbal spat with Pakistan pacers: Didn't like them coming at usAbhishek Sharma explained his verbal exchange with Pakistan bowlers during the Asia Cup Super Four match. His response came after India beat Pakistan by six wickets in Dubai on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/no-handshakes-pakistan-captain-presentation-ceremony-appearance-vs-india-2791065-2025-09-22",
      "headline": "No handshakes again but Pakistan captain makes presentation ceremony u-turnAsia Cup 2025: There was no customary post-match handshake between the two teams following India's six-wicket win over Pakistan. However, in a surprising twist, Pakistan captain Salman Ali Agha reversed his earlier stance and attended the post-match ceremony."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-asia-cup-score-super-4-abhishek-sharma-shubman-gill-2791058-2025-09-22",
      "headline": "Repeat dose: India flaunt batting firepower to humble Pakistan once againAsia Cup India vs Pakistan, Super 4: Abhishek Sharma and Shubman Gill fired in unison as India flaunted their batting firepower, chasing 172 in just 18.5 overs. Despite having an off-day on the field, India coasted to another comfortable victory on Sunday, September 21 in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-pakistan-asia-cup-haris-rauf-fighter-jet-gesture-kohli-chants-2791071-2025-09-22",
      "headline": "Watch: Haris Rauf reacts to Kohli chants with provocative fighter jet gesturePakistan fast bowler Haris Rauf ignited controversy during the Super 4 clash against India in Dubai, responding to the crowd's chants of Virat Kohli's name with a provocative fighter-jet celebration, drawing widespread attention and debate."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-vs-pakistan-rivalry-suryakumar-yadav-press-conference-reporter-2791070-2025-09-22",
      "headline": "Ind-Pak not a rivalry anymore: Suryakumar Yadav rubs salt into Pakistan's woundsAsia Cup 2025, IND vs PAK Super 4: Suryakumar Yadav rubbed salt into Pakistan's wounds with a pointed comment on the India–Pakistan rivalry. The India captain urged journalists not to overhype the contest, highlighting how one-sided it has been in recent times."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/abhishek-sharma-sledging-verbal-exchange-asia-cup-2025-india-pakistan-2791066-2025-09-22",
      "headline": "Abhishek Sharma on verbal spat with Pakistan pacers: Didn't like them coming at usAbhishek Sharma explained his verbal exchange with Pakistan bowlers during the Asia Cup Super Four match. His response came after India beat Pakistan by six wickets in Dubai on Sunday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/no-handshakes-pakistan-captain-presentation-ceremony-appearance-vs-india-2791065-2025-09-22",
      "headline": "No handshakes again but Pakistan captain makes presentation ceremony u-turnAsia Cup 2025: There was no customary post-match handshake between the two teams following India's six-wicket win over Pakistan. However, in a surprising twist, Pakistan captain Salman Ali Agha reversed his earlier stance and attended the post-match ceremony."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-pakistan-asia-cup-score-super-4-abhishek-sharma-shubman-gill-2791058-2025-09-22",
      "headline": "Repeat dose: India flaunt batting firepower to humble Pakistan once againAsia Cup India vs Pakistan, Super 4: Abhishek Sharma and Shubman Gill fired in unison as India flaunted their batting firepower, chasing 172 in just 18.5 overs. Despite having an off-day on the field, India coasted to another comfortable victory on Sunday, September 21 in Dubai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/video/asia-cup-pak-players-gun-celebration-vs-india-sparks-controversy-ytvd-2791044-2025-09-21",
      "headline": "Ind vs Pak Asia Cup: Pak opener Sahibzada Farhan's gun celebration sparks rowIn the Asia Cup match between India and Pakistan, a celebration by Pakistani player Sahibzada Farhan has sparked a major controversy. After reaching his half-century, Farhan performed a 'gun celebration', a gesture considered inappropriate by many due to the political tensions between the two nations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-pakistan-asia-cup-fiery-chase-verbal-exchanges-dubai-2791049-2025-09-21",
      "headline": "Go fetch the ball: Shubman Gill, Abhishek in verbal battle vs Pakistan pacersAsia Cup 2025, IND vs PAK Super 4: Shubman Gill and Abhishek Sharma did not hold back when provoked as they gave it back to Pakistan pacers Shaheen Afridi and Haris Rauf. The two Indian batters added 100 runs in 8.4 overs for the opening partnership on Sunday, September 21."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/salman-agha-struggles-bat-india-dominate-asia-cup-2025-reactions-2791048-2025-09-21",
      "headline": "Pakistan fans tear into Salman Agha for slow knock in India clashPakistan captain Salman Agha played a scratchy knock of 17 off 13 balls against India in the Asia Cup 2025, managing just one six off Kuldeep Yadav. His inability to find fluency or accelerate left fans frustrated as Pakistan posted 171 for 5.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-ind-vs-pak-jasprit-bumrah-expensive-spell-powerplay-2791025-2025-09-21",
      "headline": "Jasprit Bumrah expensive vs Pakistan, fans question if he's fully fitAsia Cup 2025 IND vs PAK: Jasprit Bumrah conceded 34 runs in three overs in the powerplay as Pakistan scored 55 runs. Despite losing Fakhar Zaman, Pakistan got off to a good start in their Super 4 match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-poor-fielding-pakistan-strong-start-asia-cup-2025-super-4-2791030-2025-09-21",
      "headline": "Horror fielding show? India drop 3 catches against Pakistan in Super 4 clashIndia's poor fielding allowed Pakistan to get a strong start in the Asia Cup Super 4 clash at Dubai. The fielding lapses put India under pressure and drew criticism from fans on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/fakhar-zaman-dismissed-third-umpire-asia-cup-2025-india-pakistan-2791015-2025-09-21",
      "headline": "Fakhar Zaman shocked after tight Sanju Samson catch in Super 4Fakhar Zaman was left stunned after scoring 15 off nine balls before being dismissed by Hardik Pandya in India's Asia Cup 2025 Super 4 clash. The wicket, confirmed by the third umpire after an uncertain catch by Sanju Samson, left both Fakhar and Pakistan coach Mike Hesson visibly frustrated."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-athletics-championships-shelly-ann-fraser-pryce-melissa-jefferson-wooden-2791002-2025-09-21",
      "headline": "Japan bids teary farewell as Fraser-Pryce passes the baton to Jefferson-WoodenJapan gave a heartfelt farewell to sprint queen Shelly-Ann Fraser-Pryce as she ran the final race of her career. She passed the symbolic baton to USA's Melissa Jefferson-Wooden who swept the sprint triple."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-poor-fielding-pakistan-strong-start-asia-cup-2025-super-4-2791030-2025-09-21",
      "headline": "Horror fielding show? India drop 3 catches against Pakistan in Super 4 clashIndia's poor fielding allowed Pakistan to get a strong start in the Asia Cup Super 4 clash at Dubai. The fielding lapses put India under pressure and drew criticism from fans on social media."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/fakhar-zaman-dismissed-third-umpire-asia-cup-2025-india-pakistan-2791015-2025-09-21",
      "headline": "Fakhar Zaman shocked after tight Sanju Samson catch in Super 4Fakhar Zaman was left stunned after scoring 15 off nine balls before being dismissed by Hardik Pandya in India's Asia Cup 2025 Super 4 clash. The wicket, confirmed by the third umpire after an uncertain catch by Sanju Samson, left both Fakhar and Pakistan coach Mike Hesson visibly frustrated."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/world-athletics-championships-shelly-ann-fraser-pryce-melissa-jefferson-wooden-2791002-2025-09-21",
      "headline": "Japan bids teary farewell as Fraser-Pryce passes the baton to Jefferson-WoodenJapan gave a heartfelt farewell to sprint queen Shelly-Ann Fraser-Pryce as she ran the final race of her career. She passed the symbolic baton to USA's Melissa Jefferson-Wooden who swept the sprint triple."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-varun-chakravarthy-return-india-pakistan-asia-cup-2025-super-4-clash-2791006-2025-09-21",
      "headline": "No Arshdeep Singh as India bring back Jasprit Bumrah and Varun ChakravarthyIndia have fielded Jasprit Bumrah and Varun Chakravarthy for their Asia Cup 2025 Super 4 clash against Pakistan, replacing Arshdeep Singh and Harshit Rana. The two sides previously met in the group stage, where India dominated Pakistan by seven wickets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/pakistan-asia-cup-team-changes-super-4-clash-india-dubai-2025-2791005-2025-09-21",
      "headline": "Pakistan retain Haris Rauf for Super 4 clash against India in DubaiPakistan made two changes to their playing XI for the Asia Cup Super 4 clash against India. They dropped batter Hasan Nawaz and all-rounder Khushdil Shah from the playing XI."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/asia-cup-india-vs-pakistan-suryakumar-yadav-no-handshake-salman-agha-again-2791004-2025-09-21",
      "headline": "Suryakumar Yadav avoids handshake with Pakistan captain againAsia Cup: Indian captain Suryakumar Yadav stuck to his side's no-handshake policy with Pakistan skipper Salman Ali Agha during the toss of the Super Four clash in Dubai on Sunday.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/italy-billie-jean-king-cup-2025-win-usa-jasmine-paolini-2791001-2025-09-21",
      "headline": "Jasmine Paolini shines as Italy beat United States to retain titleItaly successfully defended its Billie Jean King Cup title with a 2-0 win over the United States in Shenzhen, becoming the first nation since 2016 to win back-to-back championships. Jasmine Paolini and Elisabetta Cocciaretto delivered decisive singles victories."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/us-wins-relay-double-world-athletics-championships-tokyo-2023-2790999-2025-09-21",
      "headline": "World Champs: Noah Lyles anchors USA to 4x100 gold, Botswana script history in 4x400The United States closed the World Athletics Championships with a relay double. Noah Lyles anchored USA to 4x100m men's gold. Botswana caused a major upset by winning the men's 4x400 relay, adding drama to the meet on the final day in Tokyo."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/divyam-cricket-awards-2025-disabled-cricketers-jaipur-india-england-series-2790986-2025-09-21",
      "headline": "Divyam Cricket Awards organised to honour differently-abled cricketersThe Differently Abled Cricket Council of India hosted the inaugural Divyam Cricket Awards in Jaipur. This event marks a historic step towards better recognition and support for disabled cricketers in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/haris-rauf-6-0-shout-controversy-india-pakistan-asia-cup-2025-2790991-2025-09-21",
      "headline": "Haris Rauf heard screaming 6-0 during practice ahead of Super 4 matchPakistan fast bowler Haris Rauf was heard shouting 6-0 during practice ahead of the Asia Cup 2025 clash with India. India and Pakistan are set to clash again in the Asia Cup 2025 on September 21. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/bcci-aca-tribute-to-zubeen-garg-at-womens-odi-world-cup-2025-opening-ceremony-guwahati-2790983-2025-09-21",
      "headline": "ACA to pay tribute to late Zubeen Garg during Women's World Cup Opening CeremonyBCCI and Assam Cricket Association will honour late singer Zubeen Garg during the Women's ODI World Cup 2025 opening ceremony. Zubeen recently died in a tragic scuba diving accident in Singapore."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/athletics/story/noah-lyles-athlete-after-party-tokyo-200m-world-championship-usd-20-2790970-2025-09-21",
      "headline": "Noah Lyles to host athletes' after-party at Tokyo World Champs, entry USD 20Noah Lyles will celebrate his fourth successive 200m world title by hosting an official athletes' after-party in Tokyo, with entry for credential holders set at JP¥3,000 (approximately USD 20)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/iga-swiatek-korea-open-win-boosts-wta-ranking-chase-2025-2790969-2025-09-21",
      "headline": "Swiatek clinches Korea Open for third title of 2025, gets closer to No.1 rankingIga Swiatek clinched the Korea Open title with a three-set win over Ekaterina Alexandrova, securing her third trophy of 2025 and 25th career crown. The victory moves her closer to Aryna Sabalenka in the WTA rankings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/irfan-pathan-suggests-arshdeep-singh-india-pakistan-asia-cup-2025-2790944-2025-09-21",
      "headline": "Can Hardik bowl six yorkers? Pathan suggests playing Arshdeep against PakistanFormer India all-rounder Irfan Pathan has urged including Arshdeep Singh in the playing XI for the Asia Cup Super 4 clash against Pakistan. Arshdeep played against Oman but leaked 37 runs from four overs and scalped one wicket."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}