{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/succession-battle-rupert-murdoch-fight-for-power-future-of-fox-news-lachlan-james-elisabeth-prudence-2604240-2024-09-22",
      "headline": "Succession Wars: Inside Murdoch family's fight for power and control of Fox NewsThe Murdoch family, one of the most powerful media dynasties in the world, is currently engaged in a bitter battle for control of their media empire."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/nps-vatsalya-9705-minors-sign-up-on-day-1-how-to-open-account-online-offline-documents-2603579-2024-09-20",
      "headline": "NPS Vatsalya: 9,705 minors sign up on Day 1. Here's how to invest for your child?The scheme, overseen by the Pension Fund Regulatory and Development Authority (PFRDA), is part of the National Pension System (NPS) and aims to help parents and guardians begin retirement savings for their children from an early age"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/pm-modi-scans-paytm-qr-at-vishwakarma-exhibition-highlights-fintechs-role-for-small-merchants-2603537-2024-09-20",
      "headline": "PM Modi scans Paytm QR at Vishwakarma exhibition, highlights fintech's role for small merchantsPM Modi bought an artefact of Bhagwan Jagannath and paid via Paytm QR, showcasing not only the significance of the crafts but also the role of fintech in empowering small merchants and fostering increased trust in mobile payments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/study-shows-people-us-need-to-work-5-days-to-buy-iphone-16-how-long-do-indians-need-2603531-2024-09-20",
      "headline": "Study shows people in US work 5 days to buy iPhone 16; how long do Indians need?A recent study reveals how long people in different countries need to work in order to afford the iPhone 16, with citizens in Switzerland requiring the least number of days. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/no-work-no-pay-termination-samsung-warns-workers-on-strike-in-chennai-report-2603462-2024-09-20",
      "headline": "No work, no pay: Samsung warns workers on strike in Chennai The strike, which began on September 9, 2024, involves hundreds of workers at Samsung's home appliances factory near Chennai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-ends-1400-points-higher-nifty-above-25800-icici-bank-jumps-5-2603442-2024-09-20",
      "headline": "Sensex ends 1,400 points higher, Nifty above 25,800; ICICI Bank jumps 5%At the closing bell, the S&P BSE Sensex was up 1,381.99 points to 84,566.79, while the NSE Nifty50 gained 375.15 points to settle at 25,790.95."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ashneer-grover-shares-reason-behind-his-one-day-exit-from-ey-rs-1-crore-package-check-here-2603418-2024-09-20",
      "headline": "Ashneer Grover shares why he quit EY in a day despite Rs 1 crore salaryIn an old video, Grover shares why he left Ernst & Young (EY) on his very first day despite being offered a Rs 1 crore salary."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/should-you-buy-vodafone-idea-shares-after-20-percent-fall-ubs-nomura-novuma-new-target-price-2603391-2024-09-20",
      "headline": "Should you buy Vodafone Idea shares after 20% fall? UBS shares new target priceVodafone Idea shares fell 20% after the Supreme Court on Thursday dismissed the company's curative petition, which sought a re-computation of Adjusted Gross Revenue (AGR) dues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/explained-why-iifl-finance-shares-surged-13-percent-today-2603356-2024-09-20",
      "headline": "Explained: Why IIFL Finance shares surged 13% todayIIFL Finance stock climbed to a high of Rs 560.60, marking its peak since late February, before settling to trade 9.31% higher as of 2:06 pm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/cochin-shipyard-shares-jump-10-percent-today-ftse-all-world-index-inclusion-2603280-2024-09-20",
      "headline": "Explained: Why Cochin Shipyard shares soared 10% todayAt around 12:25 pm, shares of the company were up 9.45% at Rs 1,837.30 on the Bombay Stock Exchange (BSE)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/western-carriers-ipo-allotment-step-by-step-guide-to-check-status-latest-gmp-2603255-2024-09-20",
      "headline": " Western Carriers IPO allotment: Step-by-step guide to check statusWestern Carriers IPO allotment: Investors can check their allotment status online via the BSE website or through Link Intime India Private Ltd."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/iphone-16-in-10-minutes-quick-commerce-blinkit-steals-spotlight-from-e-commerce-giants-2603215-2024-09-20",
      "headline": "iPhone 16 in 10 minutes: Quick commerce firms bring fight to Amazon, FlipkartiPhone 16 sales: Quick commerce platforms like Blinkit, BigBasket and Zepto have started delivering the latest iPhone 16 in minutes, challenging traditional e-commerce giants Amazon and Flipkart.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-all-time-high-sensex-84000-nifty-sharp-rise-us-fed-rate-cut-small-and-midcap-stocks-2603213-2024-09-20",
      "headline": "Sensex jumps over 1,276 points to cross 84,400, Nifty nears 25,800The S&P BSE Sensex was up 1275.45 points to 84,460.25 at 12:49 pm, while the NSE Nifty50 gained 368.70 points to trade at 25,784.50."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/northern-arc-ipo-allotment-latest-gmp-step-by-step-guide-to-check-status-2603206-2024-09-20",
      "headline": "Northern Arc IPO allotment: Latest GMP, step-by-step guide to check statusNorthern Arc IPO allotment: To check their share allocation, investors should visit the IPO registrar's portal or the BSE and NSE websites."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rites-share-price-up-over-7-percent-railway-psu-stock-ex-bonus-dividend-2603180-2024-09-20",
      "headline": "RITES shares rise 8% but why railway PSU stock may be showing 48% slideDespite this positive momentum, many investors were caught off guard, seeing what appeared to be a 48% slide in the stock price on their trading apps."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/from-intern-to-ceo-elliott-hill-32-year-journey-at-nike-linkendin-profile-goes-viral-2603178-2024-09-20",
      "headline": "Elliott Hill's 32-year journey at Nike from intern to CEO goes viralElliott Hill, who has spent over 32 years at Nike, started his journey as an intern and will now be leading the iconic company. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-surges-500-points-nifty-gains-momentum-rites-jumps-over-7-2603164-2024-09-20",
      "headline": "Sensex surges 500 points, Nifty gains momentum; JSW Steel jumps 3%The S&P BSE Sensex was up 415.45 points at 83,600.25 at 10:16 am, while the NSE Nifty50 gained 135.80 points to trade at 25,550.90."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/arkade-developers-ipo-allotment-check-status-latest-subscription-gmp-listing-gains-2603115-2024-09-20",
      "headline": "Arkade Developers IPO allotment: Check status, GMP, subscription Arkade Developers IPO allotment: Investors can check their allotment status by logging into the BSE website or the Bigshare Services Pvt Ltd website, the issue's registrar."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/northern-arc-capital-ipo-allotment-tomorrow-check-latest-subscription-listing-gain-gmp-2602821-2024-09-19",
      "headline": "Northern Arc Capital IPO allotment tomorrow: Check latest subscription, GMPNorthern Arc Capital Limited, founded in 2009, provides retail loans to underserved households and businesses across India. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.\r\n\r\nHowever, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.\r\n\r\nWhile Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.\r\n\r\nTemple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. \r\n\r\nOn the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.\r\n\r\nDeepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan.\r\n\r\n"
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pm-modi-us-visit-president-joe-biden-quad-summit-bilateral-talks-defence-semiconductor-plant-discussions-2604269-2024-09-22",
      "headline": "PM Modi, Biden firm up drone deal, setting up of semiconductor plant in IndiaPrime Minister Narendra Modi and US President Joe Biden held bilateral talks on the sidelines of Quad Summit at Biden's residence in Delaware. They discussed several topics, including the MQ-9B Predator drone deal and the setting up of a semiconductor plant in Kolkata."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/arvind-kejriwal-pm-modi-conspired-corruption-delhi-liquor-policy-case-2604378-2024-09-22",
      "headline": "PM conspired to prove me corrupt: Arvind Kejriwal's big chargePM conspired to prove me corrupt: Arvind Kejriwal's big charge"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/bookmyshow-app-site-crash-before-coldplay-concert-tickets-go-live-2604368-2024-09-22",
      "headline": "BookMyShow app, site crash before Coldplay concert tickets go liveBookMyShow's website and app crashed, delaying Coldplay concert ticket sales in India. The iconic British Band is set to perform in Mumbai on January 18 and 19, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/lebanon-hezbollah-pager-israel-beeper-blasts-four-operation-in-one-details-explained-petn-explosive-2603565-2024-09-22",
      "headline": "How Israel's pager blasts were four operations rolled into oneThe synchronised detonation of 3,000 pagers and dozens of walkie-talkies across Lebanon might appear to be one big covert operation. On decoding Operation Grim Beeper, it can be found that it was, in fact, four operations rolled into one."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sunday-special/story/kathavachaks-anirudhacharya-jaya-kishori-abhinav-arora-acharya-shantanu-kumar-vishwas-social-media-2604014-2024-09-22",
      "headline": "Kathavachak's story gets a social media twistThe practice of kathavachan, the religious storytelling of Hindu texts, has been around for centuries. The kathavachaks, or spiritual orators, have been revered. Social media, however, is changing the game. If it is boosting the reach of the new-age kathavachaks, it is also subjecting them to intense scrutiny."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/joe-biden-quad-summit-pm-modi-us-china-sovereignty-claims-south-china-2604251-2024-09-22",
      "headline": "China testing us all, Joe Biden tells Quad leaders in hot mic blunderAt the Quad summit, US President Joe Biden was caught on a hot mic telling leaders from India, Australia and Japan that China was continuing to \"behave aggressively\" and \"testing us all\" amid concerns over Beijing's sovereignty claims in the South China Sea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-mass-shooting-alabama-state-deaths-injuries-2604358-2024-09-22",
      "headline": "4 killed, dozens injured during mass shooting in US's Alabama stateThe shooting happened in the Five Points South area in Alabama's Birmingham at around 11 pm (local time) on Saturday, ABC News reported."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-kanpur-test-squad-bcci-announces-jasprit-bumrah-2604373-2024-09-22",
      "headline": "IND v BAN: Jasprit Bumrah not rested as India retain same squad for Kanpur TestIndia vs Bangladesh: Minutes after India won the Test series opener in Chennai on Sunday, the BCCI announced an unchanged squad for the 2nd test, starting September 27 in Kanpur. Jasprit Bumrah, contrary to speculation, was not rested for the second match. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/world/us-news/story/watch-joe-biden-forgets-introduce-pm-modi-quad-summit-delaware-cancer-moonshot-2604372-2024-09-22",
      "headline": "Watch: Joe Biden forgets to introduce PM Modi on stage, asks 'Who's next?'US President Joe Biden had another forgetful episode as he looked visibly confused while introducing PM Modi on stage during a Quad event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/lpg-cylinder-found-on-railway-tracks-kanpur-another-train-derailment-bid-2604331-2024-09-22",
      "headline": "LPG cylinder found on railway tracks in Kanpur in another train derailment bidA major train accident was averted in Kanpur when an LPG cylinder was found on the tracks, marking the fourth such derailment attempt in September. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-modi-gifts-silver-delhi-delaware-train-to-joe-biden-pashmina-shawl-for-first-lady-jill-biden-2604312-2024-09-22",
      "headline": "PM gifts silver 'Delhi-Delaware' train to Biden, Pashmina shawl to First LadyDuring his three-day US visit, Prime Minister Narendra Modi gifted President Joe Biden a rare, antique silver hand-engraved train model crafted by Maharashtra artisans and also presented a Pashmina shawl in a papier-mâché box to First Lady Jill Biden.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-chennai-test-score-r-ashwin-280-win-ravindra-jadeja-pant-2604339-2024-09-22",
      "headline": "Chennai Test: Ruthless India hammer Bangladesh to extend 12-year home streakIndia vs Bangladesh: Led by R Ashwin's all-round heroics, India hammered Bangladesh by 280 runs in the first of a two-Test series in Chennai. Ashwin and Ravindra Jadeja took 9 wickets between them to bundle Bangladesh out for 234 on Sunday morning. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/elon-musk-slams-indian-american-billionaire-vinod-khosla-for-no-plebs-allowed-sign-on-beach-near-us-property-2604327-2024-09-22",
      "headline": "Elon Musk slams billionaire for 'no plebs allowed' sign on beach near US propertyElon Musk slammed Indian-American billionaire Vinod Khosla for reportedly blocking public access to a beach near his California property."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/pm-us-visit-quad-summit-modi-biden-meeting-greenville-global-issues-2604218-2024-09-22",
      "headline": "World surrounded by conflicts, Quad important for humanity: PM Modi in USPM Modi, giving his opening remarks at the summit, added that the Quad alliance is \"not against anyone\" but an alliance which supports \"rules-based international order, respect for sovereignty and territorial integrity, and peaceful resolution of all issues.\""
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/coldplay-india-tour-2025-when-and-where-to-book-tickets-dates-and-other-details-2604322-2024-09-22",
      "headline": "Coldplay India Tour 2025: When and where to book tickets, dates and other detailsColdplay recently announced its India tour, held on January 18 and 19, 2025. Here's all the details about when and where to book their tickets, ticket prices and other details. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/israel-bombardment-in-lebanon-290-hezbollah-targets-struck-2604340-2024-09-22",
      "headline": "Israel conducts intense bombardment in Lebanon, hits 290 Hezbollah targetsIsrael said it struck around 290 targets, including thousands of Hezbollah rocket launcher barrels. Hezbollah, however, claimed that it struck an Israeli airbase due to \"repeated Israeli attacks on Lebanon\". "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/wellness/story/how-food-allergies-found-a-miracle-fix-in-an-asthma-medicine-2602636-2024-09-22",
      "headline": "How food allergies found a miracle fix in an asthma medicineDo you ever crave something you're allergic to? You might be able to eat it soon without worrying about a rash. A medicine that was originally made for asthma might also help treat food allergies."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/interactive/quiz/entertainment/weekly-news-quiz-politics-business-sports-entertainment-422-21-09-2024",
      "headline": "Question Time: Weekly News QuizThink you read the headlines this week? Let's test that!"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/white-house-journalists-body-media-access-joe-biden-quad-bilateral-meets-2604313-2024-09-22",
      "headline": "White House journalists' body slams limited media access at Biden's Quad meetingsWhite House correspondents were not allowed to cover President Joe Biden's bilateral meetings at the Quad summit and slammed the move, calling it \"unacceptable\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/succession-battle-rupert-murdoch-fight-for-power-future-of-fox-news-lachlan-james-elisabeth-prudence-2604240-2024-09-22",
      "headline": "Succession Wars: Inside Murdoch family's fight for power and control of Fox NewsThe Murdoch family, one of the most powerful media dynasties in the world, is currently engaged in a bitter battle for control of their media empire."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/praggnanandhaa-gukesh-guide-india-to-first-ever-gold-in-chess-olympiad-2604201-2024-09-22",
      "headline": "Chess Olympiad: D Gukesh shines as India on cusp of historic gold medalD Gukesh pulled off a big win against Fabiano Caruana to help India all but clinch their first-ever gold medal in the Open Section of the Chess Olympiad on Saturday, September 21 in Budapest. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/sri-lanka-marxist-leader-anura-dissanayake-early-lead-presidential-polls-2604280-2024-09-22",
      "headline": "Sri Lankan Marxist leader Dissanayake takes early lead in presidential voteThe Marxist leader secured 53% of a million votes counted so far in the election. Opposition leader Sajith Premadasa was second at 22%, ahead of President Ranil Wickremesinghe in third place."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-r-ashwin-37-test-5-wicket-haul-equal-shane-warne-chennai-2604323-2024-09-22",
      "headline": "R Ashwin equals Shane Warne with 37th five-wicket haul in TestsIndia vs Bangladesh, 1st Test: R Ashwin equaled Shane Warne's record with his 37th five-wicket haul in Test cricket. Ashwin orchestrated Bangladesh's batting collapse in Chennai.\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/woman-body-cut-into-multiple-pieces-found-inside-fridge-in-bengaluru-2604173-2024-09-22",
      "headline": "Chopped pieces of Bengaluru woman's body found in fridge at her homeThe police said it appears that the body parts have been kept inside the refrigerator for around 2-3 days. The area near the crime scene has been sealed and further investigation is underway. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/celebrity/video/the-penguin-the-batman-director-matt-reeves-lauren-le-franc-on-spin-off-robert-pattinson-cameo-2604350-2024-09-22",
      "headline": "Matt Reeves on The Batman soin-off The Penguin, Lauren on Robert Pattinson cameoIn an exclusive chat with India Today's Bhavna Agarwal, Matt Reeves And Lauren LeFranc spoke about The Batman Spin off, Colin Farrell, The Penguin and more. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/music/story/bookmyshow-app-site-crash-before-coldplay-concert-tickets-go-live-2604368-2024-09-22",
      "headline": "BookMyShow app, site crash before Coldplay concert tickets go liveBookMyShow's website and app crashed, delaying Coldplay concert ticket sales in India. The iconic British Band is set to perform in Mumbai on January 18 and 19, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/celebrity/video/the-penguin-india-exclusive-cristin-milioti-on-visiting-india-hangman-spin-off-the-batman-2604346-2024-09-22",
      "headline": "The Penguin: Cristin Milioti on visiting India, Hangman spin-off, The BatmanIn an exclusive chat with India Today's Bhavna Agarwal, Cristin Milioti spoke about visiting India being on her wish list, the possibility of a Hangman spin-off, and the resource material she resorted to preparing for the role. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/television/celebrity/video/the-penguin-india-exclusive-colin-farrell-on-his-makeup-the-batman-spin-off-and-being-nervous-2604343-2024-09-22",
      "headline": "The Penguin: Colin Farrell on his makeup, The Batman spin-off and being nervousIn an exclusive chat with India Today's Bhavna Agarwal, Colin Farrell spoke about his makeup prosthetics and looking at himself for the first time as a scarred face Oz, being nervous about the spin-off and why he thought a spin-off on The Penguin would be a great idea. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-beautiful-chennai-pitch-bangladesh-test-win-2604377-2024-09-22",
      "headline": "Rohit Sharma lauds beautiful Chennai pitch after Bangladesh winIndia vs Bangladesh, Chennai Test: India captain Rohit Sharma praised the challenging red soil pitch in Chennai following their 280-run victory over Bangladesh. R Ashwin's six-wicket haul and a century were pivotal in India's 1-0 series lead."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-kanpur-test-squad-bcci-announces-jasprit-bumrah-2604373-2024-09-22",
      "headline": "IND v BAN: Jasprit Bumrah not rested as India retain same squad for Kanpur TestIndia vs Bangladesh: Minutes after India won the Test series opener in Chennai on Sunday, the BCCI announced an unchanged squad for the 2nd test, starting September 27 in Kanpur. Jasprit Bumrah, contrary to speculation, was not rested for the second match. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ravichandran-ashwin-chennai-test-prithi-ashwin-shane-warne-courtney-walsh-ind-vs-ban-2604363-2024-09-22",
      "headline": "R Ashwin's family applaud his historic 37th five-wicket haul in ChennaiStar India off-spinner Ravichandran Ashwin's family was seen applauding him for his 37th five wicket haul on Day 4 of the first Test against Bangladesh in Chennai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-beat-bangladesh-chennai-test-rishabh-pant-comeback-hundred-2604352-2024-09-22",
      "headline": "Rishabh Pant recalls emotional Chennai hundred celebration on Test returnIndia vs Bangladesh, Chennai Test: Rishabh Pant explained his emotional celebration after a superb hundred on his Test comeback in India's thumping victory over Bangladesh in the first Test."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-chennai-test-score-r-ashwin-280-win-ravindra-jadeja-pant-2604339-2024-09-22",
      "headline": "Chennai Test: Ruthless India hammer Bangladesh to extend 12-year home streakIndia vs Bangladesh: Led by R Ashwin's all-round heroics, India hammered Bangladesh by 280 runs in the first of a two-Test series in Chennai. Ashwin and Ravindra Jadeja took 9 wickets between them to bundle Bangladesh out for 234 on Sunday morning. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/chennai-test-1986-dean-jones-ravi-shastri-v-vikramraju-india-vs-australia-2604330-2024-09-22",
      "headline": "OTD 1986: India and Australia play historic tied Test in ChennaiIndia and Australia played a historic tied Test at MA Chidambaram Stadium in Chennai on September 22, 1986. The match is among the second tied Test in history of the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-erik-ten-hag-reaction-marcus-rashford-speculation-manchester-united-2604325-2024-09-22",
      "headline": "It's crazy: Erik Ten Hag unhappy with pundits over Marcus Rashford speculationsPremier League: Manchester United manager Erik Ten Hag hit out at pundits for unwarranted speculation about his relationship with Marcus Rushford after the star forward was benched for their 0-0 draw at Crystal Palace on Saturday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-r-ashwin-37-test-5-wicket-haul-equal-shane-warne-chennai-2604323-2024-09-22",
      "headline": "R Ashwin equals Shane Warne with 37th five-wicket haul in TestsIndia vs Bangladesh, 1st Test: R Ashwin equaled Shane Warne's record with his 37th five-wicket haul in Test cricket. Ashwin orchestrated Bangladesh's batting collapse in Chennai.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/boxing-daniel-dubois-knocks-out-anthony-joshua-to-retain-ibf-heavyweight-championship-2604295-2024-09-22",
      "headline": "Dubois knocks out Anthony Joshua to retain IBF heavyweight championshipDaniel Dubois delivered a crushing blow to Anthony Joshua's aspirations, securing a fifth-round knockout to retain his IBF heavyweight title. The bout, held at a packed Wembley Stadium, saw Joshua struggle against Dubois' relentless assault."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jp-duminy-afg-vs-sa-afghanistan-vs-south-africa-rashid-khan-2604290-2024-09-22",
      "headline": "JP Duminy on South Africa's series loss against Afghanistan: 'We were below par'South Africa batting coach JP Duminy admitted that his team has been below par after maiden series loss against Afghanistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-erik-ten-hag-reaction-marcus-rashford-speculation-manchester-united-2604325-2024-09-22",
      "headline": "It's crazy: Erik Ten Hag unhappy with pundits over Marcus Rashford speculationsPremier League: Manchester United manager Erik Ten Hag hit out at pundits for unwarranted speculation about his relationship with Marcus Rushford after the star forward was benched for their 0-0 draw at Crystal Palace on Saturday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-r-ashwin-37-test-5-wicket-haul-equal-shane-warne-chennai-2604323-2024-09-22",
      "headline": "R Ashwin equals Shane Warne with 37th five-wicket haul in TestsIndia vs Bangladesh, 1st Test: R Ashwin equaled Shane Warne's record with his 37th five-wicket haul in Test cricket. Ashwin orchestrated Bangladesh's batting collapse in Chennai.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/boxing-daniel-dubois-knocks-out-anthony-joshua-to-retain-ibf-heavyweight-championship-2604295-2024-09-22",
      "headline": "Dubois knocks out Anthony Joshua to retain IBF heavyweight championshipDaniel Dubois delivered a crushing blow to Anthony Joshua's aspirations, securing a fifth-round knockout to retain his IBF heavyweight title. The bout, held at a packed Wembley Stadium, saw Joshua struggle against Dubois' relentless assault."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jp-duminy-afg-vs-sa-afghanistan-vs-south-africa-rashid-khan-2604290-2024-09-22",
      "headline": "JP Duminy on South Africa's series loss against Afghanistan: 'We were below par'South Africa batting coach JP Duminy admitted that his team has been below par after maiden series loss against Afghanistan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-bangladesh-chennai-test-rishabh-pant-gabba-knock-devender-sharma-2604287-2024-09-22",
      "headline": "Rishabh Pant's Chennai Test hundred as special as Gabba knock: Childhood coachIndia vs Bangladesh, 1st Test: Rishabh Pant hit an entertaining second innings hundred, seamlessly returning to the longest format of the game, in Chennai. Pant was at his fluent best during the record-equalling knock. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/2007-t20-world-cup-yuvraj-singh-70-india-vs-australia-2604282-2024-09-22",
      "headline": "Yuvraj Singh 70 helps India beat Australia to reach T20 World Cup finalYuvraj Singh's explosive 70 off just 30 balls, combined with disciplined bowling, powered India into the final with a thrilling 15-run victory over Australia in the 2007 ICC Men's T20 World Cup semi-final."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rishabh-pant-vs-ms-dhoni-in-tests-dinesh-karthik-ind-vs-ban-2604276-2024-09-22",
      "headline": "Rishabh Pant better than MS Dhoni in Tests? Dinesh Karthik settles the debateFormer India wicketkeeper batter Dinesh Karthik has given his take on the debate around who's better between MS Dhoni and Rishabh Pant as a wicketkeeper batter for India in Tests."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/carlo-ancelotti-reaction-real-madrid-comeback-win-over-espanyol-2604260-2024-09-22",
      "headline": "Carlo Ancelotti happy with Real Madrid's comeback win over EspanyolReal Madrid manager Carlo Ancelotti praised his team's resilience and attacking prowess following their 4-1 comeback victory against Espanyol. Despite an early setback, Madrid's dominant performance secured the win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harry-brook-mitchell-marsh-alex-carey-eng-vs-aus-2604258-2024-09-22",
      "headline": "Harry Brook blames team's inexperience after second ODI loss against Australia Harry Brook blamed his team's inexperience after losing the second ODI against Australia by 68 runs at Headingley, Leeds. England failed to chase down 271 and got all out for 202 runs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/laver-cup-team-world-take-8-4-lead-vs-europe-ruud-tsitsipas-lose-2604254-2024-09-22",
      "headline": "Team World takes 8-4 lead over Team Europe as Ruud, Tsitsipas fall in doublesLaver Cup: Ben Shelton and Alejandro Tabilo defeated Stefanos Tsitsipas and Casper Ruud 6-1, 6-2 on Saturday, giving Team World an 8-4 lead over Team Europe after day two of the Laver Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/praggnanandhaa-gukesh-guide-india-to-first-ever-gold-in-chess-olympiad-2604201-2024-09-22",
      "headline": "Chess Olympiad: D Gukesh shines as India on cusp of historic gold medalD Gukesh pulled off a big win against Fabiano Caruana to help India all but clinch their first-ever gold medal in the Open Section of the Chess Olympiad on Saturday, September 21 in Budapest. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/carlo-ancelotti-reaction-real-madrid-comeback-win-over-espanyol-2604260-2024-09-22",
      "headline": "Carlo Ancelotti happy with Real Madrid's comeback win over EspanyolReal Madrid manager Carlo Ancelotti praised his team's resilience and attacking prowess following their 4-1 comeback victory against Espanyol. Despite an early setback, Madrid's dominant performance secured the win."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harry-brook-mitchell-marsh-alex-carey-eng-vs-aus-2604258-2024-09-22",
      "headline": "Harry Brook blames team's inexperience after second ODI loss against Australia Harry Brook blamed his team's inexperience after losing the second ODI against Australia by 68 runs at Headingley, Leeds. England failed to chase down 271 and got all out for 202 runs."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/laver-cup-team-world-take-8-4-lead-vs-europe-ruud-tsitsipas-lose-2604254-2024-09-22",
      "headline": "Team World takes 8-4 lead over Team Europe as Ruud, Tsitsipas fall in doublesLaver Cup: Ben Shelton and Alejandro Tabilo defeated Stefanos Tsitsipas and Casper Ruud 6-1, 6-2 on Saturday, giving Team World an 8-4 lead over Team Europe after day two of the Laver Cup."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/praggnanandhaa-gukesh-guide-india-to-first-ever-gold-in-chess-olympiad-2604201-2024-09-22",
      "headline": "Chess Olympiad: D Gukesh shines as India on cusp of historic gold medalD Gukesh pulled off a big win against Fabiano Caruana to help India all but clinch their first-ever gold medal in the Open Section of the Chess Olympiad on Saturday, September 21 in Budapest. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-australia-harry-brook-powerplay-reaction-2nd-odi-2604199-2024-09-21",
      "headline": "Early wickets killed us: England's Harry Brook rues poor powerplayENG vs AUS: Harry Brook said that England lost their way in the run-chase against Australia in Leeds after losing five wickets inside the powerplay. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/harry-brook-is-facing-baptism-by-fire-morgan-after-2nd-odi-loss-vs-australia-2604198-2024-09-21",
      "headline": "Harry Brook is facing baptism by fire: Eoin MorganFormer England captain Eoin Morgan has said that Harry Brook has been baptised by fire in the first two matches agianst Australia. Brook, who is standing in for Jos Buttler has lost the first two games of the 5-match series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/isl-jamshedpur-fc-eke-out-win-vs-mumbai-city-mohammedan-register-first-point-2604193-2024-09-21",
      "headline": "ISL: Jamshedpur eke out win vs Mumbai, Mohammedan register first pointISL: Jamshedpur FC held off a resilient Mumbai City to eke out a hardfought 3-2 win on Saturday, September 21. In the other match debutants Mohammedan FC registered their first points with a 1-1 draw against FC Goa."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-australia-2nd-odi-harry-brook-alex-carey-report-2604187-2024-09-21",
      "headline": "Australia go 2-0 up after England batting falters in 2nd ODIENG vs AUS: Alex Carey's 74-run knock and Mitchell Starc's three wickets helped Australia beat England by 68 runs on Saturday at the Headingley in Leeds. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}