{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/tesla-to-enter-saudi-arabia-as-elon-musk-mends-rift-with-kingdom-glbs-2699679-2025-03-26",
      "headline": "Tesla to enter Saudi Arabia as Elon Musk mends rift with kingdomAmerican EV giant Tesla announced its entry into the Saudi Arabian market after company CEO Elon Musk's relations with the Kingdom improved in recent months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/upi-down-payments-glitch-hits-several-paytm-google-pay-phonepe-users-across-india-npci-technical-glitch-resolved-2699609-2025-03-26",
      "headline": "UPI outage hits several users across India, NPCI says issue resolvedThe National Payments Corporation of India (NPCI) acknowledged the issue, stating that it was caused by intermittent technical difficulties, resulting in partial transaction failures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/wall-street-is-drifting-again-after-getting-whipsawed-for-weeks-glbs-2699577-2025-03-26",
      "headline": "Wall Street is drifting again after getting whipsawed for weeksThe New York Stock Exchange saw a steady opening on Wednesday with marginal drops for S&P 500 and the Nasdaq composite."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/cancer-diabetes-antibiotics-medicine-controlled-government-to-get-costlier-2699576-2025-03-26",
      "headline": "Cancer, diabetes drugs under government price control to get costlier: SourcesGovernment-controlled medicines, including that of cancer, diabetes, heart-related concerns and other antibiotics, are set to become more expensive by 1.7 per cent, government sources told India Today TV's sister publication, Business Today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-top-gainers-losers-bse-nse-sensex-nifty-shares-2699443-2025-03-26",
      "headline": "Stock market closing: Top gainers and losers on Sensex, NiftyBenchmark indices snapped their seven-day winning streak, as investors turned cautious ahead of the monthly expiry. The S&P BSE Sensex dropped 728.69 points to close at 77,288.50, while the NSE Nifty50 fell 181.80 points, ending the session at 23,486.85."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/india-may-lower-duties-on-harley-davidson-bikes-bourbon-whiskey-sources-2699423-2025-03-26",
      "headline": "India may lower duties on Harley-Davidson bikes, bourbon whiskey: SourcesIndia may further reduce import duties on Harley-Davidson motorcycles, US wines, and bourbon whiskey as part of ongoing India-US trade talks, according to sources. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stock-market-closing-bell-sensex-tumbles-over-700-points-nifty-settles-below-23500-indusind-bank-jumps-3-percent-2699400-2025-03-26",
      "headline": "Sensex tumbles over 700 points, Nifty settles below 23,500; IndusInd Bank up 3%Stock market closing bell: The S&P BSE Sensex ended 728.69 points lower to 77,288.50,  while the NSE Nifty50 declined 181.80 points to settle at 23,486.85."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/india-united-states-trade-talks-tariff-harley-davidson-bikes-bourbon-whiskey-californian-wine-reciprocal-donald-trump-2699388-2025-03-26",
      "headline": "India may cut duties on Harley bikes, bourbon whiskey amid US talks: SourcesThe government had earlier reduced import duties on Harley-Davidson motorcycles from 50% to 40%. Similarly, import duty on Bourbon whisky was reduced from 150% to 100% in the past. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/star-health-claim-settlement-practices-irdai-scanner-report-insurance-sector-news-personal-finance-2699329-2025-03-26",
      "headline": "Insurance regulator flags concerns over Star Health's claim settlements: ReportAccording to IRDAI's handbook of insurance statistics, Star Health's incurred claim ratio stood at 66.47% for the financial year 2023-24. This ratio indicates the percentage of premium income that an insurance company pays out in claims."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/indusind-bank-raises-2-billion-dollar-via-market-deposits-in-march-amid-accounting-lapses-2699313-2025-03-26",
      "headline": "IndusInd Bank raised $2 billion via market deposits in March: ReportThe country's fifth-largest private sector bank flagged earlier in the month a $175 million hole in its balance sheet, citing accounting discrepancies in its derivatives portfolio."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-drops-over-300-points-why-is-stock-market-down-falling-despite-fii-buying-strong-gdp-growth-2699289-2025-03-26",
      "headline": "Sensex down 700 points: Why is stock market down despite FII buying, GDP growth?Stock market today: The S&P BSE Sensex was down 755.50 points to 77,261.69, while the NSE Nifty50 lost 178.80 points to 23,489.85 as of 2:56 pm.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/zomato-swiggy-stock-price-food-delivery-giant-check-price-target-key-reasons-analysts-recommendations-2699285-2025-03-26",
      "headline": "Why are Zomato, Swiggy shares falling today? Check key reasons, price targetsZomato, Swiggy stock price: Today's drop in Zomato and Swiggy's share price comes after a media report suggested that brokerage firm BofA Securities downgraded them. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/marvel-studios-confirms-avengers-doomsday-cast-as-production-begins-2699689-2025-03-26",
      "headline": "Marvel Studios confirms Avengers Doomsday cast as production beginsMarvel Studios has kicked off production for Avengers Doomsday, revealing an impressive lineup of returning and new cast members. The film is set to hit theatres in May 2026, promising a thrilling addition to the MCU."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khans-film-with-atlee-delayed-due-to-budget-constraints-2699666-2025-03-26",
      "headline": "Salman Khan's film with Atlee delayed due to budget constraintsSalman Khan's collaboration with Atlee has been postponed as the film's budget undergoes reassessment. The actor confirmed the delay during a recent press meet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/lady-gagas-mayhem-ball-tour-2025-dates-cities-ticket-sales-information-glbs-2699636-2025-03-26",
      "headline": "Lady Gaga's Mayhem Ball tour 2025: Dates, cities & ticket sales informationLady Gaga announces her Mayhem Ball tour, hitting North America, Europe, and the UK in 2025. The highly anticipated arena tour promises an intimate, theatrical experience, with tickets selling fast.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/fka-twigs-cancels-tour-dates-in-us-and-canada-due-to-visa-complications-glbs-2699632-2025-03-26",
      "headline": "FKA Twigs cancels tour dates in US and Canada due to visa complicationsFKA Twigs cancels her US and Canada tour due to visa issues but plans to reschedule. Fans express support as her tour continues with scheduled performances in Mexico and major festivals.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-confirms-reunion-with-sanjay-dutt-for-upcoming-film-2699629-2025-03-26",
      "headline": "Salman Khan confirms reunion with Sanjay Dutt for upcoming filmBollywood superstars Salman Khan and Sanjay Dutt are set to reunite on screen, as confirmed by Salman Khan during a recent group chat. The announcement has thrilled fans, though project details remain a mystery."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/bazooka-trailer-out-mammootty-gautham-vasudev-menon-deeno-dennis-directorial-debut-2699611-2025-03-26",
      "headline": "Bazooka trailer: Mammootty is a classy businessman as he tracks down serial killerThe trailer for Bazooka, featuring Malayalam icon Mammootty and Gautham Vasudev Menon, was released today, March 26. The film will release on April 10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/adolescence-star-owen-cooper-to-star-with-margot-robbie-in-his-next-2699581-2025-03-26",
      "headline": "Adolescence star Owen Cooper to star with Margot Robbie in his nextAdolescence star Owen Cooper will reportedly be sharing screen space with Oscar-nominated Margot Robbie in his next project.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/chiranjeevi-shankar-vara-prasad-anil-ravipudi-film-script-locked-2699537-2025-03-26",
      "headline": "Chiranjeevi to play Shankar Vara Prasad in Anil Ravipudi's film, script lockedDirector Anil Ravipudi has confirmed that the script for his much-anticipated film with Megastar Chiranjeevi is finalised. The project is set for a grand launch soon, with a Sankranthi 2026 release planned."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/nick-frost-in-talks-to-play-hagrid-in-hbos-harry-potter-series-report-2699493-2025-03-26",
      "headline": "Nick Frost in talks to play Hagrid in HBO's Harry Potter series: ReportNick Frost is reportedly in talks to join HBO's upcoming Harry Potter series as Rubeus Hagrid. The actor would join a cast featuring John Lithgow, Janet McTeer, and Paapa Essiedu."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/kill-dill-ott-release-when-and-where-to-watch-anushka-sens-romantic-thriller-2699531-2025-03-26",
      "headline": "Kill Dill OTT Release: When and where to watch Anushka Sen's romantic thrillerAnushka Sen is back with a mystery thriller, Kill Dill. The series is set to premiere on 28 March and will be available for free on Amazon MX Player."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/pedro-pascal-and-bella-ramsey-reveal-tough-moments-filming-the-last-of-us-season-2-glbs-2699568-2025-03-26",
      "headline": "Pedro Pascal and Bella Ramsey reveal tough moments filming 'The Last of Us Season 2'Pedro Pascal and Bella Ramsey struggled emotionally while filming The Last of Us Season 2. Newcomers Kaitlyn Dever, Isabela Merced, and Young Mazino join the cast as dark themes intensify the highly anticipated season.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/kaiju-no-8-mission-recon-trailer-april-11-release-date-india-2699567-2025-03-26",
      "headline": "Kaiju No 8 Mission Recon: English subbed trailer out, film to release in AprilThe English-subbed trailer for Kaiju No 8: Mission Recon was released. with the film set to premiere in India on April 11, 2025. The movie offers a recap of Season One and introduces a new episode along with a fresh ending theme song by OneRepublic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-lucifer-story-explained-and-what-to-expect-from-its-sequel-empuraan-2699463-2025-03-26",
      "headline": "Mohanlal's Lucifer story explained and what to expect from its sequel EmpuraanMalayalam superstar Mohanlal's L2: Empuraan is hardly a day away from release. Ahead of the release, here is everything you need to know about the prequel, Lucifer, which will prepare you for Empuraan. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aishwarya-rai-car-hit-by-a-bus-in-mumbai-here-the-truth-2699560-2025-03-26",
      "headline": "Aishwarya Rai Bachchan safe, was not in the car: Sources deny accident reportsVarious reports suggested that actor Aishwarya Rai Bachchan's car was hit by a bus in Mumbai. India Today confirmed that the actor was not present in the car when the incident took place. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/are-shailene-woodley-and-lucas-bravo-dating-fans-speculate-after-paris-stroll-glbs-2699557-2025-03-26",
      "headline": "Are Shailene Woodley and Lucas Bravo dating? Fans speculate after Paris strollShailene Woodley and Lucas Bravo sparked dating rumors after a cozy stroll in Paris. They held hands and hugged, but their reps remain silent, leaving fans speculating about a possible romance.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rajendra-prasad-apologises-david-warner-backlash-pushpa-remarks-2699502-2025-03-26",
      "headline": "Actor Rajendra Prasad apologises to David Warner after backlash: He's like my sonTelugu actor Rajendra Prasad apologised to David Warner after his comments sparked backlash online. This came after the actor playfully mocked the cricketer for recreating Pushpa steps. \r\n \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/adolescence-actor-owen-cooper-star-making-audition-2699487-2025-03-26",
      "headline": "Watch Adolescence actor Owen Cooper's star-making auditionAdolescence star Owen Cooper has become a household name after his hit-making turn in the Netflix series. The British actor's audition for the series was shared by director Philip Barantini on social media. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/story/chainsaw-man-the-movie-reze-arc-release-date-teaser-plot-details-2699481-2025-03-26",
      "headline": "Chainsaw Man The Movie Reze Arc: Check out release date, story and other detailsThe Chainsaw Man movie focusing on the Reze Arc is set to release in Japan on September 19, but release dates for the US and India remain unconfirmed. Read more details about the film here."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/netflixs-adolescence-becomes-most-watched-limited-series-in-two-weeks-2699456-2025-03-26",
      "headline": "Netflix's Adolescence becomes most-watched limited series in two weeksThe British drama Adolescence has taken Netflix by storm, setting a new record for the most-watched limited series within two weeks. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trump-announces-25-tariffs-on-foreign-made-cars-going-to-be-permanent-2699720-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump announces 25% tariffs on foreign made cars: Going to be permanentThe auto tariffs are set to take effect on April 2, with collection beginning on April 3, Donald Trump said on Wednesday while speaking to reporters. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/cancer-diabetes-antibiotics-medicine-controlled-government-to-get-costlier-2699576-2025-03-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Cancer, diabetes drugs under government price control to get costlier: SourcesGovernment-controlled medicines, including that of cancer, diabetes, heart-related concerns and other antibiotics, are set to become more expensive by 1.7 per cent, government sources told India Today TV's sister publication, Business Today."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/the-atlantic-publishes-us-attack-plan-shared-on-signal-group-chat-glbs-2699565-2025-03-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "The Atlantic publishes US's Yemen attack plans leaked on 19-member Signal groupThe chats, detailed in Jeffrey Goldberg's article on The Atlantic, reveal internal discussions, including Vice President Vance debating the merits of an airstrike on Houthi targets in Yemen."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/concern-for-indian-students-trump-demands-name-nationality-of-campus-protestors-columbia-deport-immigration-colleges-2699432-2025-03-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Concern for Indian students? Trump demands name, nationality of campus protestorsThe Trump administration's demand for student names and nationalities has sparked fears of a crackdown on international students, including those from India. Legal experts warn that the Trump administration's demand for student names could result in monitoring of these students, arrest or even deportation. Some Indians have already faced the fury of the Trump administration."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/society/story/why-a-slow-morning-is-the-best-way-to-start-your-day-2699468-2025-03-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Why a slow morning is the best way to start your dayA slow morning is about starting the day at a relaxed pace, without the stress of rushing. It involves taking time to wake up, enjoying a mindful routine, and easing into the day with calmness. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-kkr-quinton-de-kock-moeen-ali-varun-chakravarthy-guwahati-2699676-2025-03-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "De Kock and spinners get KKR off the mark as RR stumble at Riyan's homeIPL 2025, RR vs KKR: Quinton de Kock's unbeaten 97 and a spin-bowling masterclass from Varun Chakravarthy and Moeen Ali helped Kolkata Knight Riders outclass Rajasthan Royals by eight wickets. Rajasthan, playing in Riyan Parag's hometown, suffered their second successive defeat of the season. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-police-arrest-thief-who-used-to-poop-his-pants-to-escape-capture-2699684-2025-03-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Poop and run: How Delhi Police thwarted serial burglars' stinky escape streakWhenever Deepak sensed trouble or feared getting caught, he would defecate on himself, creating an unbearable stench that forced people, including the police, to back off."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kunal-kamra-t-series-says-satire-video-visibility-blocked-eknath-shinde-controversy-habitat-mumbai-2699490-2025-03-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Stop being a stooge: Kunal Kamra claims his video got T-Series copyrightComedian Kunal Kamra has hit back at music company T-Series after it allegedly blocked the visibility of his stand-up special on YouTube, citing copyright issues. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/doubling-ac-efficiency-can-prevent-power-crisis-save-india-26-billion-study-2699716-2025-03-27#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Doubling AC efficiency can prevent power crisis, save India $26 billion: StudyAs India faces another scorching summer, a study by the India Energy and Climate Centre (IECC) at UC Berkeley finds that doubling AC efficiency could prevent severe power shortages and save consumers up to Rs 2.2 lakh crore (USD 26 billion) over the next decade. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/up-man-marriage-wife-lover-sant-kabir-nagar-children-court-temple-wedding-vows-2699618-2025-03-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "UP man gets wife married to her lover: I'll take care of our childrenA man in Uttar Pradesh's Sant Kabir Nagar district decided to marry off his wife to her lover after getting to know about their affair. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/mohanlal-lucifer-story-explained-and-what-to-expect-from-its-sequel-empuraan-2699463-2025-03-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Mohanlal's Lucifer story explained and what to expect from its sequel EmpuraanMalayalam superstar Mohanlal's L2: Empuraan is hardly a day away from release. Ahead of the release, here is everything you need to know about the prequel, Lucifer, which will prepare you for Empuraan. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/marvel-studios-confirms-avengers-doomsday-cast-as-production-begins-2699689-2025-03-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Marvel Studios confirms Avengers Doomsday cast as production beginsMarvel Studios has kicked off production for Avengers Doomsday, revealing an impressive lineup of returning and new cast members. The film is set to hit theatres in May 2026, promising a thrilling addition to the MCU."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/indian-family-sells-nearly-everything-to-live-full-time-on-sailboat-watch-videos-2699459-2025-03-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Life on a boat: Indian family 'sells nearly everything' to sail full-time. Watch videosCapt. Gaurav Gautam (Retd.) and his wife Vaidehi decided to quit their well-paying jobs in 2022, homeschool their teenage daughter Kaeya, and shift base to their 42-foot sailboat, Reeva.\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/delhi-weather-hottest-day-imd-forecast-summer-season-rain-2699631-2025-03-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "At 40.1°C, Delhi sees hottest day of the year todaySafdarjung, which is Delhi's official weather station, recorded a maximum temperature of 38.9 degrees Celsius, 7.4 degrees above normal, also the hottest day of the season so far."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/upi-down-payments-glitch-hits-several-paytm-google-pay-phonepe-users-across-india-npci-technical-glitch-resolved-2699609-2025-03-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "UPI outage hits several users across India, NPCI says issue resolvedThe National Payments Corporation of India (NPCI) acknowledged the issue, stating that it was caused by intermittent technical difficulties, resulting in partial transaction failures."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/dri-arrests-key-suspect-sahil-jain-for-disposing-gold-in-ranya-rao-smuggling-case-2699608-2025-03-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ranya Rao smuggling case: Revenue officials arrest suspect for disposing of goldThe Directorate of Revenue Intelligence (DRI) arrested a key suspect in the Ranya Rao smuggling case for allegedly disposing of smuggled gold. They got custody of him for four days to probe the wider network.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/critics-choice-awards-2025-diljit-dosanjh-all-we-imagine-win-top-honours-2699336-2025-03-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Critics' Choice Awards: Diljit Dosanjh wins Best Actor, All We Imagine as Light shinesDiljit Dosanjh, All We Imagine as Light among others, won big at the Critics' Choice Awards 2025. Take a look at the winner list here. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/india-us-religious-freedom-panel-designated-entity-of-concern-biased-politically-motivated-2699439-2025-03-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "India calls US religious freedom panel 'entity of concern', rejects its reportThe Ministry of External Affairs rejected USCIRF's 2025 report that suggested minorities were facing deteriorating treatment in India. The US panel also recommended sanctions against RAW."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/yogi-adityanath-plane-emergency-landing-agra-airport-technical-glitch-2699572-2025-03-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Yogi Adityanath's plane makes emergency landing at Agra airport after snagUttar Pradesh Chief Minister Yogi Adityanath's plane made an emergency landing at the Agra airport after the pilot discovered an issue with the brakes. Adityanath was travelling to Lucknow at the time of the incident."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/three-days-in-indian-courts-a-tale-of-corruption-misogyny-and-privilege-2699257-2025-03-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Three days in Indian courts: A tale of 'corruption', misogyny and privilegeAn allegedly cash-hoarding judge, a ruling trivialising sexual assault and selective leniency for the privileged underline the dire need for transparency and accountability reforms\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india-today-insight/story/how-to-raise-children-to-be-gender-sensitive-2699405-2025-03-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How to raise children to be gender sensitiveTo make our young learners healthy, informed and empowered, the curriculum must talk about comprehensive sexuality education\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/unboxing-saugat-e-modi-eid-kits-bjp-muslims-bihar-elections-opposition-appeasement-explained-2699450-2025-03-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "What BJP is trying to gain with Saugat-e-Modi to MuslimsThe BJP is distributing Saugat-e-Modi kits to help 32 lakh poor Muslims celebrate Eid. Is it plain outreach by the BJP after bitter election campaigns and opposition over the Waqf Bill, or is it timed with the Bihar polls? Most importantly, why is it called Saugat-e-Modi, and not Saugat-e-BJP? Unboxing the BJP's kit here."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/punjab-aap-mla-devinderjeet-singh-dhose-living-in-pakistan-moga-health-facilities-2699480-2025-03-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Feel like living in Pak: Punjab MLA slams own government over health facilitiesAAP MLA Devinderjeet Singh Dhose's outburst came during the Budget session in the Assembly after the Health Minister announced no new project for Moga."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/aishwarya-rai-car-hit-by-a-bus-in-mumbai-here-the-truth-2699560-2025-03-26#?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Aishwarya Rai Bachchan safe, was not in the car: Sources deny accident reportsVarious reports suggested that actor Aishwarya Rai Bachchan's car was hit by a bus in Mumbai. India Today confirmed that the actor was not present in the car when the incident took place. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/marvel-studios-confirms-avengers-doomsday-cast-as-production-begins-2699689-2025-03-26",
      "headline": "Marvel Studios confirms Avengers Doomsday cast as production beginsMarvel Studios has kicked off production for Avengers Doomsday, revealing an impressive lineup of returning and new cast members. The film is set to hit theatres in May 2026, promising a thrilling addition to the MCU."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khans-film-with-atlee-delayed-due-to-budget-constraints-2699666-2025-03-26",
      "headline": "Salman Khan's film with Atlee delayed due to budget constraintsSalman Khan's collaboration with Atlee has been postponed as the film's budget undergoes reassessment. The actor confirmed the delay during a recent press meet."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/lady-gagas-mayhem-ball-tour-2025-dates-cities-ticket-sales-information-glbs-2699636-2025-03-26",
      "headline": "Lady Gaga's Mayhem Ball tour 2025: Dates, cities & ticket sales informationLady Gaga announces her Mayhem Ball tour, hitting North America, Europe, and the UK in 2025. The highly anticipated arena tour promises an intimate, theatrical experience, with tickets selling fast.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/fka-twigs-cancels-tour-dates-in-us-and-canada-due-to-visa-complications-glbs-2699632-2025-03-26",
      "headline": "FKA Twigs cancels tour dates in US and Canada due to visa complicationsFKA Twigs cancels her US and Canada tour due to visa issues but plans to reschedule. Fans express support as her tour continues with scheduled performances in Mexico and major festivals.\r\n"
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-points-table-today-rr-vs-kkr-guwahati-orange-purple-cap-2699712-2025-03-27",
      "headline": "Points Table, March 26: Kolkata Knight Riders climb standings after Guwahati winIPL Points Table Update, March 26: Kolkata Knight Riders jumped to the sixth spot after a good boost to their Net Run Rate following their 8-wicket win over Rajasthan Royals on Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-stephen-a-smith-is-on-a-taylor-swift-tour-run-right-now-says-lebron-james-over-bronny-controversy-glbs-2699704-2025-03-27",
      "headline": "NBA: Stephen A. Smith is on a Taylor Swift tour run right now, says LeBron James over Bronny controversyLos Angeles Lakers superstar LeBron James reignited the fight with ESPN's Stephen A. Smith, taking a sharp jab at the sports commentator during an appearance on The Pat McAfee Show on Wednesday, March 26. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-kkr-second-ball-rule-used-first-time-2699700-2025-03-26",
      "headline": "IPL 2025: Second ball rule applied for the  first time in RR vs KKRRajasthan Royals became the first IPL team to use the second ball rule in 2025, but it was not enough to prevent an eight-wicket defeat to Kolkata Knight Riders, led by Quinton de Kock's unbeaten 97 on a slow Guwahati pitch."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-kkr-quinton-de-kock-player-of-match-reaction-2699695-2025-03-26",
      "headline": "Quinton de Kock downplays retirement impact after record 97 for KKR vs RRIPL 2025, RR vs KKR: Quinton de Kock showed glimpses of vintage form with a record-breaking 97 off just 61 balls. On a sluggish pitch, the South African veteran stood out, helping KKR comfortably chase down 152 in Guwahati on Wednesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-kkr-moeen-ali-steps-up-sunil-narine-absence-2699694-2025-03-26",
      "headline": "No Sunil Narine, no problem for KKR: Moeen Ali steps up vs RRMoeen Ali stepped up in Sunil Narine's absence, producing a brilliant 2/23 spell as KKR defeated Rajasthan Royals by eight wickets to claim their first IPL 2025 victory, with Quinton de Kock's unbeaten 97 sealing the win in Guwahati."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-kkr-quinton-de-kock-moeen-ali-varun-chakravarthy-guwahati-2699676-2025-03-26",
      "headline": "De Kock and spinners get KKR off the mark as RR stumble at Riyan's homeIPL 2025, RR vs KKR: Quinton de Kock's unbeaten 97 and a spin-bowling masterclass from Varun Chakravarthy and Moeen Ali helped Kolkata Knight Riders outclass Rajasthan Royals by eight wickets. Rajasthan, playing in Riyan Parag's hometown, suffered their second successive defeat of the season. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-kkr-riyan-parag-fan-pitch-invader-touches-feet-2699663-2025-03-26",
      "headline": "Watch: Riyan Parag fan invades pitch in Guwahati, touches RR star's feetIPL 2025, RR vs KKR: A fan breached security and invaded the pitch to catch a glimpse of Riyan Parag, who was leading Rajasthan Royals in his hometown, Guwahati. However, Rajasthan put on a disappointing display."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-lsg-mitchell-marsh-new-par-score-high-scores-2699660-2025-03-26",
      "headline": "230 is the new par score in IPL: LSG's Mitchell Marsh ahead of SRH clashMitchell Marsh remains confident in LSG's plans despite Sunrisers Hyderabad's explosive batting form. With 230 now considered a par score in IPL 2025, Marsh urges his team to embrace the challenge and focus on their own approach rather than SRH's dominance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-trade-rumours-lakers-target-key-trade-to-end-losing-streak-glbs-2699655-2025-03-26",
      "headline": "NBA trade rumours: Lakers target key trade to end losing streakThe Los Angeles Lakers, after suffering their third straight defeat at the hands of the Orlando Magic.The Lakers are looking to shake things up."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-lsg-harshal-patel-bowling-hyderabad-james-franklin-2699651-2025-03-26",
      "headline": "Why Harshal Patel could prove to be SunRisers' trump card in high-scoring HyderabadIPL 2025: SunRisers Hyderabad bowling coach James Franklin, speaking to the press before their home game against Lucknow Super Giants on Thursday, talked up Harshal Patel's ability to make an impact in high-scoring venues. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-kkr-varun-chakravarthy-fastest-ball-quinton-de-kock-helmet-2699606-2025-03-26",
      "headline": "Watch: Varun Chakravarthy bowls 113 kph, Quinton de Kock throws helmet before catchIPL 2025, RR vs KKR in Guwahati: Varun Chakravarthy bowled 113 kph delivery to induce a top-edge from Riyan Parag. Quinton de Kock displayed excellent game awareness, removing his helmet before taking the catch. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-kkr-riyan-parag-fan-pitch-invader-touches-feet-2699663-2025-03-26",
      "headline": "Watch: Riyan Parag fan invades pitch in Guwahati, touches RR star's feetIPL 2025, RR vs KKR: A fan breached security and invaded the pitch to catch a glimpse of Riyan Parag, who was leading Rajasthan Royals in his hometown, Guwahati. However, Rajasthan put on a disappointing display."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-lsg-mitchell-marsh-new-par-score-high-scores-2699660-2025-03-26",
      "headline": "230 is the new par score in IPL: LSG's Mitchell Marsh ahead of SRH clashMitchell Marsh remains confident in LSG's plans despite Sunrisers Hyderabad's explosive batting form. With 230 now considered a par score in IPL 2025, Marsh urges his team to embrace the challenge and focus on their own approach rather than SRH's dominance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-trade-rumours-lakers-target-key-trade-to-end-losing-streak-glbs-2699655-2025-03-26",
      "headline": "NBA trade rumours: Lakers target key trade to end losing streakThe Los Angeles Lakers, after suffering their third straight defeat at the hands of the Orlando Magic.The Lakers are looking to shake things up."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-srh-vs-lsg-harshal-patel-bowling-hyderabad-james-franklin-2699651-2025-03-26",
      "headline": "Why Harshal Patel could prove to be SunRisers' trump card in high-scoring HyderabadIPL 2025: SunRisers Hyderabad bowling coach James Franklin, speaking to the press before their home game against Lucknow Super Giants on Thursday, talked up Harshal Patel's ability to make an impact in high-scoring venues. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-kkr-varun-chakravarthy-fastest-ball-quinton-de-kock-helmet-2699606-2025-03-26",
      "headline": "Watch: Varun Chakravarthy bowls 113 kph, Quinton de Kock throws helmet before catchIPL 2025, RR vs KKR in Guwahati: Varun Chakravarthy bowled 113 kph delivery to induce a top-edge from Riyan Parag. Quinton de Kock displayed excellent game awareness, removing his helmet before taking the catch. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-lebron-james-makes-bold-claim-about-giannis-dominating-the-1970s-glbs-2699603-2025-03-26",
      "headline": "NBA: LeBron James makes bold claim about Giannis dominating the 1970sThe Los Angeles forward LeBron James is set to appear on the Pat McAfee Show, and a preview of the conversation has already sparked debates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/hockey/story/sultan-azlan-shah-cup-pakistan-team-malaysia-hockey-federation-2699591-2025-03-26",
      "headline": "Pakistan not invited for Sultan Azlan Shah Cup due to 'outstanding debt'The Malyasia Hockey Federation has decided not to invite Pakistan for the upcoming Sultan Azlan Shah Cup owing to an outstanding debt. Pakistan were runners-up in the tournament last year. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-vs-pakistan-odi-squad-haris-rauf-selection-u-turn-2699585-2025-03-26",
      "headline": "NZ vs PAK: Pakistan make selection U-turn, include Haris Rauf in ODI squadNew Zealand vs Pakistan: Haris Rauf, who performed well in the T20I series in New Zealand, has been added to the ODI squad, according to news agency PTI. The fast bowler was initially overlooked for the ODI series, starting Saturday, March 29. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-r-ashwin-bowlers-pitches-personal-physchologists-impact-player-2699556-2025-03-26",
      "headline": "IPL bowlers may soon need psychologists, some pitches are unplayable: R AshwinIPL 2025: Off-spinner R Ashwin highlighted the increasing dip in balance between bat and ball, lamenting the overdose of batter-friendly pitches in T20 cricket. Ashwin cheekily said full-tosses have become the best option to keep batters quiet. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-kkr-sunil-narine-absent-moeen-ali-debut-guwahati-2699575-2025-03-26",
      "headline": "RR vs KKR: Sunil Narine misses KKR match for the first time since 2021KKR suffered a big blow ahead of their clash against RR as star man Sunil Narine will miss the contest in Guwahati on Wednesday, March 26. Narine has been replaced by Moeen Ali in the lineup by Kolkata. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-standings-playoff-predictions-and-play-in-tournament-glbs-2699562-2025-03-26",
      "headline": "NBA Standings: Playoff, predictions and play-in tournamentAs the NBA playoffs are just around the corner, beginning from April 19, teams are battling to clinch a spot and every game matters. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-michael-vaughan-on-shreyas-iyer-indian-t20i-teamgt-vs-pbks-2699553-2025-03-26",
      "headline": "Keep scratching my head thinking Shreyas Iyer's not in Indian T20I team: VaughanFormer England captain Michael Vaughan said that Shreyas Iyer's absence in the Indian T20I team leaves him baffled. Iyer scored a breathtaking 97* (42) in Punjab Kings' opening game of the Indian Premier League 2025 (IPL 2025) vs Gujarat Titans (GT)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-vs-pakistan-5th-t20i-salman-ali-agha-reaction-odis-2699543-2025-03-26",
      "headline": "NZ vs PAK: After T20I series loss, Salman Agha expects ODIs to be 'different'Pakistan T20I captain Salman Ali Agha expects the ODI series against New Zealand to be a different one. Pakistan lost the T20I series 1-4 against New Zealand. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-rr-vs-kkr-sunil-narine-absent-moeen-ali-debut-guwahati-2699575-2025-03-26",
      "headline": "RR vs KKR: Sunil Narine misses KKR match for the first time since 2021KKR suffered a big blow ahead of their clash against RR as star man Sunil Narine will miss the contest in Guwahati on Wednesday, March 26. Narine has been replaced by Moeen Ali in the lineup by Kolkata. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-standings-playoff-predictions-and-play-in-tournament-glbs-2699562-2025-03-26",
      "headline": "NBA Standings: Playoff, predictions and play-in tournamentAs the NBA playoffs are just around the corner, beginning from April 19, teams are battling to clinch a spot and every game matters. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-michael-vaughan-on-shreyas-iyer-indian-t20i-teamgt-vs-pbks-2699553-2025-03-26",
      "headline": "Keep scratching my head thinking Shreyas Iyer's not in Indian T20I team: VaughanFormer England captain Michael Vaughan said that Shreyas Iyer's absence in the Indian T20I team leaves him baffled. Iyer scored a breathtaking 97* (42) in Punjab Kings' opening game of the Indian Premier League 2025 (IPL 2025) vs Gujarat Titans (GT)."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/new-zealand-vs-pakistan-5th-t20i-salman-ali-agha-reaction-odis-2699543-2025-03-26",
      "headline": "NZ vs PAK: After T20I series loss, Salman Agha expects ODIs to be 'different'Pakistan T20I captain Salman Ali Agha expects the ODI series against New Zealand to be a different one. Pakistan lost the T20I series 1-4 against New Zealand. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/nba-we-just-cant-risk-it-says-steve-kerr-as-warriors-struggle-without-stephen-curry-glbs-2699528-2025-03-26",
      "headline": "NBA: We just can't risk it, says Steve Kerr as Warriors struggle without Stephen CurryThe Golden State Warriors suffered a defeat yet again against the Miami Heat in a thrilling 112-86 on Tuesday, March 25, as the Warriors are barely holding onto the sixth spot in the Western Conference. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rr-vs-kkr-live-score-updates-ipl-2025-rajasthan-royals-vs-kolkata-knight-riders-riyan-parag-ajinkya-rahane-2699519-2025-03-26",
      "headline": "RR vs KKR Highlights: Kolkata beat Rajasthan by 8 wickets after QDK specialRajasthan Royals (RR) vs Kolkata Knight Riders (KKR), IPL 2025 Highlights: Kolkata Knight Riders beat Rajasthan Royals by 8 wickets, credit to what was a brilliant batting display from Quinton de Kock in his 97-run knock, which was supported with composure from Angkrish Raghuvanshi. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-20-25-gt-vs-pbks-arshdeep-singh-mastermind-vijaykumar-vyshak-impact-sub-2699486-2025-03-26",
      "headline": "GT vs PBKS: Viral video shows how Arshdeep masterminded Vyshak Impact SubArshdeep Singh's tactical brilliance helped Punjab Kings seal a thrilling win over Gujarat Titans, as his timely suggestion led to Impact Sub Vyshak Vijaykumar's match-winning performance in the death overs. Punjab's bowling strategy proved decisive in stalling Gujarat's chase."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/india-vs-bangladesh-manolo-marques-very-poor-performance-afc-asian-qualifiers-2699472-2025-03-26",
      "headline": "Manolo rues injury-hit India's \"very, very poor\" draw vs BangladeshManolo Marquez blasted India's \"very, very poor\" display against Bangladesh, admitting his side was lucky to escape with a draw. With midfield creativity lacking, India's predictable attacking patterns continue to limit their goal-scoring potential."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/football/story/world-cup-qualifier-argentina-vs-brazil-marquinhos-apologises-to-fans-2699453-2025-03-26",
      "headline": "Brazil captain Marquinhos issues apology to fans after Argentina thrashingBrazil captain Marquinhos has apologised to the fans after they were humbled by Argentina in the World Cup Qualifier on Tuesday, March 25. Argentina beat Brazil 4-1 in the match, piling on more misery on the Selecao. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-proves-doubters-wrong-adjusts-his-game-to-teams-needs-sanjay-bangar-2699425-2025-03-26",
      "headline": "Virat Kohli proves doubters wrong, adjusts his game to team's needs: Sanjay BangarFormer India cricketer turned commentator Sanjay Bangar praised Virat Kohli for his match-winning half-century against Kolkata Knight Riders (KKR) in the opening game of the Indian Premier League 2025 (IPL 2025). "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ipl-2025-marcus-stoinis-virat-kohli-mentor-to-cricket-community-2699429-2025-03-26",
      "headline": "Kohli has been a mentor to the cricket community: PBKS star StoinisVirat Kohli's dedication and fitness set the benchmark for cricketers, as Marcus Stoinis praises the Indian star for inspiring players worldwide with his unwavering commitment and passion for the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/palak-kohli-interview-exclusive-badminton-tumour-paralympics-2699409-2025-03-26",
      "headline": "Stronger and tougher, Palak Kohli focussing on baby steps towards Paralympics dreamsExclusive: In a chat with India Today Digital, India's para-badminton star Palak Kohli spoke about how she recovered from a career-threatening bone tumour to transform into a stronger character. She also talked about her goals for the Los Angeles Paralympics, having also taken part in two editions of the quadrennial event."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/nz-vs-pak-jimmy-neesham-tim-seifert-salman-agha-new-zealand-vs-pakistan-2699385-2025-03-26",
      "headline": "NZ vs PAK: Neesham's 5-for, Seifert's blitz crush Pakistan by 8 wickets in 5th T20INew Zealand beat Pakistan by eight wickets in the fifth and final T20I to seal the series 4-1. James Neesham was awarded Player of the Match for his five-wicket haul."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/novak-djokovic-serena-williams-miami-open-pre-quarterfinal-2699373-2025-03-26",
      "headline": "If she says it's fine, then it's amazing: Djokovic gets the nod from SerenaMiami Open 2025: Novak Djokovic said that she was surprised to see Serena Williams watching him from the stands during the pre-quarterfinal against Lorenzo Musetti on Tuesday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wpl-bcci-teams-arun-dhumal-plans-news-2699351-2025-03-26",
      "headline": "WPL 2026 to have more teams? Arun Dhumal opens up on BCCI's plansWPL committee member Arun Dhumal, who's also the IPL chairman, said that the BCCI doesn't have any immediate plans to increase the number of teams. \r\n"
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}