{
  "business": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/market/story/sensex-ends-386-points-lower-nifty-below-25100-tata-motors-bel-among-top-losers-2792602-2025-09-24",
      "headline": "Sensex, Nifty end lower as profit booking continues; Tata Motors falls over 2%The S&P BSE Sensex fell 386.47 points to 81,715.63, while the NSE Nifty50 lost 112.60 points to close at 25,056.90. Broader market indices also ended lower, with sectoral breadth largely negative, except for pharma stocks, which managed modest gains."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/cashless-health-insurance-claim-rejection-key-reasons-explained-2792600-2025-09-24",
      "headline": "Why your cashless insurance claim isn't always 'cashless'Cashless claims promise convenience, but long delays, unclear policies, and unjust deductions often leave patients stressed. Understanding your rights and navigating the system proactively can prevent financial and medical headaches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/ppf-scss-ssy-are-small-saving-scheme-interest-rates-set-to-change-sukanya-samriddhi-yojana-public-provident-fund-2792534-2025-09-24",
      "headline": "PPF, SCSS, SSY: Are Small Saving Scheme interest rates set to change?As the September 30 announcement approaches, savers are wondering if interest rates on popular small saving schemes like PPF, SCSS, and Sukanya Samriddhi Yojana (SSY) will change. Here's what you need to know."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/how-to-buy-gold-the-right-way-this-festive-season-2792466-2025-09-24",
      "headline": "How to buy gold the right way this festive seasonGold shopping is a festive tradition for many Indian families, but with rising prices and endless options, making the right choice can feel tricky. Here's how you can buy gold the right way this season."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rupee-fall-us-h1b-visa-fee-hike-trump-tariff-remittance-money-send-india-2792464-2025-09-24",
      "headline": "H-1B crackdown cracks the rupee. Know why INR hit an all-time lowEconomists estimate that remittances, the money Indians abroad send back, could drop by around $400 million. For a country that relies on foreign money flowing in, that's significant."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/diwali-around-the-corner-union-cabinet-likely-to-approve-bonus-for-railways-employees-government-sources-2792463-2025-09-24",
      "headline": "Union Cabinet likely to clear bonus for railway staff soon: Government sourcesThe bonus, usually extended to non-gazetted railway employees, is meant to recognise their contribution to the efficiency and performance of one of India's most crucial transport networks. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/income-tax-audit-2025-deadlines-rules-and-penalties-you-must-know-2792436-2025-09-24",
      "headline": "Income tax audit 2025: Deadlines, rules and penalties you must knowThe clock is ticking for taxpayers who fall under the audit bracket. With the income tax audit deadline for FY 2024–25 just around the corner, here's a quick look at key dates, rules, and penalties."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/video/confused-between-swiggy-and-eternal-stock-heres-what-experts-suggest-2792404-2025-09-24",
      "headline": "Confused between Swiggy and Eternal stock? Here's what experts suggestMarket experts say the two companies are in very different positions when it comes to earnings visibility and investor confidence. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/overcharged-after-gst-rate-cut-heres-how-you-can-take-action-2792393-2025-09-24",
      "headline": "Overcharged after GST rate cut? Here's how you can take actionExperts say that raising a complaint not only helps individual consumers reclaim their rightful benefit but also strengthens overall market accountability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sbi-shares-state-bank-of-india-stock-price-rise-hit-record-52-week-high-should-you-buy-2792379-2025-09-24",
      "headline": "SBI shares gain 1% to hit 52-week high. Should you buy?SBI shares have seen an uptick in the past few days. This has been a reaction to the country's largest lender completing the sale of a part of its stake in YES Bank."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sensex-falls-over-200-points-nifty-below-25100-sbi-gains-1-2792371-2025-09-24",
      "headline": "Sensex falls 300 points, Nifty below 25,100 as profit booking continuesAt 9:22 am, the S&P BSE Sensex declined 309 points to 81,792.86, and the NSE Nifty50 slipped 100 points to 25,069.45. Broader market indices also witnessed early losses, led by persistent selling pressure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/epack-prefab-bmw-ventures-jain-resource-recycling-ipo-highest-returns-gmp-listing-gains-2792361-2025-09-24",
      "headline": "Epack Prefab, BMW Ventures, Jain Resource IPOs open today: Where should you bet?Three IPOs will open for bidding today. Epack Prefab Technologies, BMW Ventures, and Jain Resource Recycling begin their public subscriptions today."
    }
  ],
  "entertainment": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/story/demon-slayer-infinity-castle-akaza-anime-backstories-2792169-2025-09-24",
      "headline": "How humanised backstories of demons made Demon Slayer a global hitDemon Slayer: Infinity Castle Part 1 – Akaza Returns' has become a global blockbuster, and one key reason is that it demonstrates not only the Demon Slayers' strength but also how demons reflect human vices."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sholay-restored-version-premiere-in-sydney-with-original-ending-as-centrepiece-2792545-2025-09-24",
      "headline": "Sholay restored version to premiere in Sydney with original ending as centrepieceThe newly restored version of 'Sholay' will be screened as centrepiece at The Indian Film Festival of Sydney. The restoration includes the original ending and involved archival discoveries in London and Mumbai."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/anupam-kher-was-sad-after-saiyaara-fever-wiped-out-tanvi-the-great-2792495-2025-09-24",
      "headline": "Anupam Kher says he was sad after Saiyaara fever wiped out Tanvi: The GreatActor Anupam Kher recently opened up on being heartbroken over his directorial 'Tanvi: The Great' being sidelined by 'Saiyaara'. He revealed how he had to borrow money from friends after the financier backed out of the film at the last moment."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/standpoint/story/sai-pallavi-trolled-for-wearing-swimsuit-because-saree-girl-cant-be-a-beach-babe-2792544-2025-09-24",
      "headline": "Sai Pallavi trolled for wearing swimsuit, because saree girl can't be a beach babeSai Pallavi was trolled for wearing a swimsuit on the beach, with fans unable to see beyond her saree-clad image. The outrage exposes society's hypocrisy, patriarchy, and the fragile idea of culture that refuses women the freedom to just be human."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/samyuktha-hedge-claims-baseer-ali-is-not-a-good-boyfriend-amid-bigg-boss-19-link-ups-2792515-2025-09-24",
      "headline": "Samyuktha Hedge claims Baseer is not a good boyfriend amid Bigg Boss 19 link-upsActor Samyuktha Hegde called her rumoured boyfriend Baseer Ali a bad boyfriend. The Bigg Boss 19 contestant has recently been linked to Nehal Chudasama and Farrhana Bhatt on 'Bigg Boss 19'. However, that doesn't stop Samyuktha from supporting him in the reality show."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/manikandan-kalaimamani-award-tamil-nadu-actor-director-2023-2792529-2025-09-24",
      "headline": "Tamil actor Manikandan on his Kalaimamani win: We artistes work for recognitionTamil actor Manikandan has been awarded the prestigious Kalaimamani award by the Tamil Nadu government. The actor, in an exclusive interview with India Today, expressed happiness and a sense of responsibility upon receiving the honour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/jimmy-kimmel-returns-late-night-tv-after-suspension-addresses-charlie-kirk-remarks-2792438-2025-09-24",
      "headline": "Jimmy Kimmel thanks fellow late night hosts for support during suspensionJimmy Kimmel resumes his late-night show following a week-long suspension over Charlie Kirk comments. Kimmel addresses the controversy, offers clarification and thanks supporters and critics alike. Fellow late-night hosts and public figures express solidarity, with Kimmel reflecting on broader reactions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/mardaani-2-actor-vikram-singh-chauhan-reflects-on-leaving-law-to-pursue-acting-2792527-2025-09-24",
      "headline": "Mardaani 2 actor Vikram Singh Chauhan reflects on leaving law to pursue actingActor Vikram Singh Chauhan recently reflected on his decision to quit law and pursue acting. In an exclusive interview, Chauhan recalled hiding his acting assignments from his parents initially. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/teja-sajja-hrithik-roshan-childhood-superhero-clean-mass-commercial-films-2792480-2025-09-24",
      "headline": "Teja Sajja reveals Hrithik Roshan was his childhood superhero, not Hollywood starsIn an exclusive interview with India Today, Teja Sajja revealed that Hrithik Roshan was his childhood superhero, not Hollywood icons. He was recently seen in the Telugu superhero film, 'Mirai'."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/the-conjuring-last-rites-ed-lorraine-warren-love-story-box-office-success-2792489-2025-09-24",
      "headline": "Exclusive: Orion, Madison on Warrens love, mixed reaction to The Conjuring 5'The Conjuring: Last Rites' stars Orion Smith and Madison Lawler delve into the early relationship of Ed and Lorraine Warren in an exclusive chat. The film's emotional depth and box office success spark mixed fan reactions across India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/bigg-boss-19-episode-31-abhishek-bajaj-captaincy-under-scanner-pranit-more-slams-amaal-mallik-2792435-2025-09-24",
      "headline": "Bigg Boss 19 episode 31: Abhishek's captaincy under scanner, Pranit slams AmaalAbhishek Bajaj was questioned by Baseer Ali for taking house-related issues, including cleanliness, lightly in the latest episode of 'Bigg Boss 19.' The episode also saw Pranit More lashing out at Amaal Mallik for passing mean comments.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rani-mukerji-elated-after-national-award-win-dedicates-it-to-late-father-motherhood-2792474-2025-09-24",
      "headline": "Rani Mukerji elated after National Award win, dedicates it to late father, motherhoodActor Rani Mukerji is overwhelmed to receive her first National Award. In her statement, she dedicated her award to her late father, all the mothers around the world, for their strength and courage. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/shah-rukh-khan-hug-with-mohanlal-becomes-the-moment-of-the-night-fans-call-it-historic-2792462-2025-09-24",
      "headline": "SRK's hug with Mohanlal becomes the highlight of National Film AwardsAt the National Film Awards in Delhi, the warm embrace between Shah Rukh Khan and Mohanlal, with Rani Mukerji smiling beside them, captured the hearts of fans across India. This iconic moment has been widely shared on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kajol-birthday-tribute-mother-tanuja-emotional-instagram-celebrity-wishes-2792449-2025-09-24",
      "headline": "Maa Durga, Maa Kali rolled into one: Kajol's note for mother Tanuja on birthdayActor Kajol celebrated her mother Tanuja's birthday with a special social media post, sharing photos and videos from the celebrations. Her tribute drew warm wishes from several celebrities, like Karan Johar, Renuka Shahane and Farah Khan."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/karan-johar-on-national-award-win-emotional-full-circle-moment-27-years-rocky-aur-rani-kii-prem-kahani-2792443-2025-09-24",
      "headline": "KJo accepts National Award in Rocky Randhawa style, calls it emotional full circleKaran Johar shared a post on Instagram and expressed his gratitude to his team after winning the National Award in the Wholesome Entertainment category. The director even recalled the moment as an emotional full circle. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/anya-singh-rubbishes-claims-of-aryan-khan-not-directing-the-bas-of-bollywood-2792432-2025-09-24",
      "headline": "Anya Singh rubbishes claims of Aryan Khan not directing The Ba***s of BollywoodAcor Anya Singh addressed criticism and rumours around Aryan Khan's directorial debut 'The Ba***s of Bollywood'. She commended Aryan's decision to work with young talent and his steadfast vision. The actor also opened up on the shocking climax of the Netflix series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/jolly-llb-3-box-office-collection-day-5-detailed-report-bigger-tuesday-than-monday-rs-100-crore-doable-2792409-2025-09-24",
      "headline": "Jolly LLB 3 box office Day 5: Bigger Tuesday than Monday, Rs 100 crore doable Akshay Kumar and Arshad Warsi's 'Jolly LLB 3' showed growth of Rs 6.5 crore on Tuesday, taking its total to Rs 65.5 crore. The Subhash Kapoor film is set to cross Rs 100 crore in India soon."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/music/story/assam-government-distributes-zubeen-garg-ashes-online-memorials-kamarkuchi-jorhat-2792358-2025-09-24",
      "headline": "Zubeen Garg's ashes to be distributed via online portal, memorials in AssamThe Assam government plans to provide Zubeen Garg's funeral ashes through a new online portal. Memorials to be established at Kamarkuchi and Jorhat, with site security enhancements."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/alia-bhatt-alpha-first-action-film-online-debate-jigra-heart-of-stone-milan-fashion-2792373-2025-09-24",
      "headline": "Alia calls Alpha her first action film, fans remind her of Jigra, Heart of StoneActor Alia Bhatt recently reoffered to 'Alpha' as her first action film, sparking reactions online. Many Social media users debate her statement, referencing previous films 'Jigra' and 'Heart of Stone'."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/delhi-ashram-swami-chaitanyananda-saraswati-trail-of-abuse-threats-to-fail-obscene-messages-deleted-chats-2792586-2025-09-24",
      "headline": "Threats to fail, obscene messages, deleted chats: Delhi godman's trail of abuseSwami Chaitanyananda Saraswati reportedly summoned girls to his room late at night, threatened to reduce their marks or fail them if they did not comply, and lured some with promises of foreign trips."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/zelensky-ukraine-russia-war-india-donald-trump-address-to-united-nation-general-assembly-china-funding-2792454-2025-09-24",
      "headline": "India with us: Zelenskyy fact-checks Trump on Russia warUkrainian President Volodymyr Zelenskyy said \"India is mostly with Ukraine\", differing with his American counterpart, Donald Trump, who blamed New Delhi for \"funding Russia\". Zelenskyy also called for Europe's stronger ties with India to wean it off Russian energy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-textbook-india-war-operation-sindoor-victory-false-narrative-airbases-destroyed-asim-munir-2792453-2025-09-24",
      "headline": "Delulu 101: Pakistan's new curriculum on four-day war with IndiaAs in past wars with India, Pakistan's establishment is still playing make-believe by trumpeting fake wins, but staying silent on real losses. By baking false narratives into school curriculum, it is ensuring that generations grow up swallowing propaganda as history. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/trumps-alaska-pageantry-didnt-pay-off-relationship-with-putin-meant-nothing-2792481-2025-09-24",
      "headline": "Just not that into you. Putin dashes Trump's hopes of a relationshipEven with his touted rapport with Putin, Trump concedes personal ties offered no leverage. The Russia-Ukraine conflict proved harder than he ever anticipated."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/trump-us-h1b-visa-global-race-indian-talent-uk-europe-canada-reality-check-immigration-2792531-2025-09-24",
      "headline": "Trump's H-1B move a lottery for UK, Europe? A reality check for Indian talentH-1B visa: After Trump's H-1B visa clampdown, several European nations are positioning themselves as a magnet for global talent. A closer look reveals that in many countries, immigration policies are becoming increasingly restrictive.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/medical-student-suicide-maharashtra-academic-pressure-aiims-gorakhpur-2792546-2025-09-24",
      "headline": "A businessman earns as much: Medical student dies by suicide in MaharashtraA 20-year-old medical aspirant from Maharashtra died by suicide just hours before he was set to leave for his MBBS admission at AIIMS Gorakhpur."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/pakistan-donald-trump-us-china-xi-jinping-cpec-balochistan-will-islamabad-trun-into-battlefield-experts-explained-2792093-2025-09-24",
      "headline": "Is Pakistan inviting disaster by two-timing China and US?China's \"iron-brother\" Pakistan's warm embrace of Donald Trump's US, from deals on cryptocurrency, minerals, to nominating him for the Nobel Peace Prize, has made the Chinese wary of Islamabad's calculated posture. China, which has poured billions into Pakistan through the CPEC projects, sees this as a double game. Pakistan might emerge as the next flashpoint in the US-China rivalry, warn experts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/gurugram-founder-reaction-to-colleague-refusing-9pm-work-call-for-household-chores-viral-work-culture-empathy-2792407-2025-09-24",
      "headline": "Gurugram founder's reaction to colleague refusing 9pm work call for chores is viralIn her post, Krittika Marwaha addressed how the relentless drive to build a company often pushes leaders to expect the same level of sacrifice from their teams.   "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/travel/story/silent-retreats-in-india-wellness-tourism-jennifer-aniston-2792116-2025-09-24",
      "headline": "Silent Retreats in India have a new fan: Jennifer AnistonIn Jennifer Aniston's latest interview with India Today, the actress revealed a deep interest in attending a silent retreat and exploring meditation on her next trip to India. If you haven't heard of one, here's your quick loop-in."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/impact-feature/story/ulips-mutual-funds-why-you-need-both-for-a-balanced-portfolio-2789465-2025-09-19",
      "headline": "ULIPs & Mutual Funds: Why you need both for a balanced portfolioULIPs give you protection and discipline for the long haul, while mutual funds give you liquidity and flexibility for the near term."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-squad-announcement-live-dubai-jasprit-bumrah-shubman-gill-2792471-2025-09-24",
      "headline": "IND vs WI Test squad live: Karun Nair, Sai Sudharsan or new number 3?IND vs WI Test squad announcement live updates: India's senior selection committee, led by Ajit Agarkar, will meet on 24 September to pick the squad for the upcoming two-Test series against West Indies, starting in Ahmedabad on 2 October."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/afghan-boy-travelled-two-hours-plane-wheel-well-how-stowaways-survive-at-35000-feet-altitude-low-temperature-oxygen-2792105-2025-09-24",
      "headline": "Afghan boy hides in plane's belly to reach Delhi. How do stowaways survive?An Afghan boy travelled to Delhi from Kabul in a plane's wheel well, surviving sub-zero temperatures and low oxygen supply for 2.5 hours. In 2022, a Kenyan travelled for 11 hours, a record, for an air stowaway. But how do people survive adverse conditions at 35,000 feet, and who has better chances of making it?"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/standpoint/story/sai-pallavi-trolled-for-wearing-swimsuit-because-saree-girl-cant-be-a-beach-babe-2792544-2025-09-24",
      "headline": "Sai Pallavi trolled for wearing swimsuit, because saree girl can't be a beach babeSai Pallavi was trolled for wearing a swimsuit on the beach, with fans unable to see beyond her saree-clad image. The outrage exposes society's hypocrisy, patriarchy, and the fragile idea of culture that refuses women the freedom to just be human."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/cashless-health-insurance-claim-rejection-key-reasons-explained-2792600-2025-09-24",
      "headline": "Why your cashless insurance claim isn't always 'cashless'Cashless claims promise convenience, but long delays, unclear policies, and unjust deductions often leave patients stressed. Understanding your rights and navigating the system proactively can prevent financial and medical headaches."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/in-surprise-shift-us-donald-trump-backs-ukraine-nato-against-good-friend-putin-russia-asks-shoot-down-russian-jets-violate-airspace-2792494-2025-09-24",
      "headline": "In surprise shift, Trump prods Ukraine, Nato to fight RussiaUS President Donald Trump has abruptly shifted his stance on Russia by backing Ukraine and urging Nato nations to shoot down Russian jets violating their airspace. This is the first time that Trump said Ukraine \"can win back all its territory taken over by Russia\" with the help of European allies. Earlier, he had been suggesting that Kyiv needed to cede land for a peace deal with Moscow."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/not-my-intention-to-make-light-of-young-mans-murder-teary-eyed-jimmy-kimmel-returns-to-us-late-night-tv-2792392-2025-09-24",
      "headline": "Jimmy Kimmel returns with emotional monologue: Trump, Charlie Kirk and moreJimmy Kimmel returned to TV after a week-long suspension and in a lengthy monologue, replete with puns and sarcasm, spoke on the shooting of Trump aide Charlie Kirk and Trump himself."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/anya-singh-rubbishes-claims-of-aryan-khan-not-directing-the-bas-of-bollywood-2792432-2025-09-24",
      "headline": "Anya Singh rubbishes claims of Aryan Khan not directing The Ba***s of BollywoodAcor Anya Singh addressed criticism and rumours around Aryan Khan's directorial debut 'The Ba***s of Bollywood'. She commended Aryan's decision to work with young talent and his steadfast vision. The actor also opened up on the shocking climax of the Netflix series. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/how-dare-you-up-mla-loses-cool-after-health-official-tries-to-grab-his-phone-2792560-2025-09-24",
      "headline": "How dare you: UP MLA loses cool after health official tries to 'grab' his phoneThe Superintendent of the Community Health Center (CHC) in Maharajganj district, has been removed from his post following a heated altercation with MLA Prem Sagar Patel during a government-organised health fair."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/story/delhi-ashram-chief-accused-molestation-women-on-the-run-2792394-2025-09-24",
      "headline": "Scandal rocks Delhi ashram, Swami accused of molesting women with help of staffOut of 32 women, 17 alleged abusive language, obscene WhatsApp and text messages, as well as unwanted physical contact by the accused. The ashram has removed him from his post as director due to his \"illegal acts\"."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/personal-finance/story/overcharged-after-gst-rate-cut-heres-how-you-can-take-action-2792393-2025-09-24",
      "headline": "Overcharged after GST rate cut? Here's how you can take actionExperts say that raising a complaint not only helps individual consumers reclaim their rightful benefit but also strengthens overall market accountability."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/trending-news/story/bihar-train-journey-video-recorded-by-woman-shows-ticketless-passengers-crowding-ac-2-coach-2792568-2025-09-24",
      "headline": "Bihar train journey video recorded by woman shows ticketless passengers crowding AC-2Content creator Ayushi Ranjan was travelling alone in an AC-2 coach from Patna to her grandparents' home and it was a rather difficult experience. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india-today-insight/story/durga-puja-dampener-how-rain-battered-kolkata-is-coping-with-the-deluge-2792055-2025-09-23",
      "headline": "Durga Puja dampener? How rain-battered Kolkata is coping with the delugeAfter record-breaking overnight rain, Kolkata woke up to streets turned into lakes, traffic at a standstill and lives upended in the run-up to Durga Puja festivities\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/afghan-boy-first-photo-flew-kabul-to-delhi-hiding-plane-landing-gear-2792564-2025-09-24",
      "headline": "Afghan boy found in plane's landing gear wanted to go to Iran. Here's his 1st picThe 13-year-old boy sneaked into the landing gear of a Kabul-Delhi Kam Air flight as it made its two-hour journey on September 21. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/bangkok-sinkhole-swallows-cars-power-poles-near-hospital-caught-on-cctv-2792467-2025-09-24",
      "headline": "Watch: Massive sinkhole opens near Bangkok hospital, swallows cars, power polesThe incident, which took place in the Thai capital's Samsen Road area, has been linked to the construction of a nearby railway station."
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-womens-world-cup-2025-laura-wolvaardt-south-africa-maiden-title-hopeful-2792608-2025-09-24",
      "headline": "Winning the Women's World Cup is a matter of when, not if: Laura WolvaardtSouth Africa's women's cricket team is gearing up for their first ICC Women's ODI World Cup final. The Proteas are confident and well-prepared to face tough competition from top cricketing nations."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kl-rahul-india-a-vs-australia-a-failure-dhruv-jurel-nitish-kumar-reddy-flop-west-indies-test-squad-announcement-2792579-2025-09-24",
      "headline": "KL Rahul, Jurel falter vs Australia A ahead of India's West Indies Test squad revealKL Rahul and Dhruv Jurel's early dismissals against Australia A in Lucknow have raised questions ahead of India's Test squad announcement for the West Indies series."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/if-you-flop-for-pakistan-media-and-fans-are-after-you-hussain-talat-2792580-2025-09-24",
      "headline": "If you flop for Pakistan, media and fans are after you: Hussain TalatPakistan's Hussain Talat revealed that the players can be under pressure from the media and the public if they do not perform for a couple of games."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/ind-u19-vs-aus-u19-vaibhav-suryavanshi-breaks-unmukt-chands-record-2792575-2025-09-24",
      "headline": "Vaibhav Suryavanshi breaks Unmukt Chand's record on maiden Australia tourVaibhav Suryavanshi smashed his maiden half-century in Australia and broke Unmukt Chand's sixes record in Youth ODIs. He played a brilliant innings of 70 (68) and clobbered five fours and six sixes during his stay at the crease. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/athletics/story/noah-lyles-interview-world-athletics-championships-not-superhero-another-human-2792533-2025-09-24",
      "headline": "The Noah Lyles way: I am not a superhero, just another humanNoah Lyles is one of the fastest men on the planet, but his greatest skill isn't just sprinting. In this interview, following his triumphant Tokyo World Athletics Championships campaign, the American sprinter opens up about handling pressure, being an authentic role model, and the incredible support system that keeps him grounded."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/irfan-pathan-ind-vs-pak-subtle-dig-india-pakistan-t20-dominance-haris-rauf-2792526-2025-09-24",
      "headline": "Irfan Pathan strikes cheeky dig at Pakistan, celebrates India's historic T20 featFormer India all-rounder Irfan Pathan took a playful swipe at Pakistan while celebrating India's landmark performance in T20 cricket, highlighting the team's long-standing dominance over their arch-rivals."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-struggles-batting-position-after-shubman-gill-return-t20is-2792192-2025-09-24",
      "headline": "Sanju Samson battles middle-order blues after Shubman Gill's T20I returnSanju Samson has found it tough to adjust to new batting roles after Shubman Gill's return to the top. The wicketkeeper batter is being made to strive hard to seal his place in the T20I side, despite having proven his worth as an opener in the lead-up to Asia Cup 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-squad-announcement-live-dubai-jasprit-bumrah-shubman-gill-2792471-2025-09-24",
      "headline": "IND vs WI Test squad live: Karun Nair, Sai Sudharsan or new number 3?IND vs WI Test squad announcement live updates: India's senior selection committee, led by Ajit Agarkar, will meet on 24 September to pick the squad for the upcoming two-Test series against West Indies, starting in Ahmedabad on 2 October."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-focus-fitness-ishant-sharma-resilience-cricket-career-2792457-2025-09-24",
      "headline": "Virat Kohli was always focused, nothing affected his game, says Ishant SharmaIshant Sharma reveals how Virat Kohli had laser-like focus when on the field and nothing came in his way, including matters off the field when it came down to performing for the team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/phil-salt-ipl-2025-final-child-birth-wife-decision-royal-challengers-bengaluru-kkr-2792459-2025-09-24",
      "headline": "Phil Salt on becoming a father and playing IPL final: Wife made the decisionPhil Salt returned to play the IPL 2025 Final immediately after becoming a father, thanks to his wife's push. He scored, took a brilliant catch, and helped RCB win their first-ever title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-test-series-squad-announcement-shubman-gill-bumrah-rishabh-pant-2792398-2025-09-24",
      "headline": "India vs West Indies: What to expect from Test squad for season's first home seriesIndia vs West Indies: India's squad for the two-Test series, starting on 2 October, will be announced on Wednesday. While Jasprit Bumrah is expected to make the cut, attention will be on Karun Nair as he bids to retain his place after a subdued comeback in England. It also remains to be seen whether Axar Patel will earn a recall."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sanju-samson-struggles-batting-position-after-shubman-gill-return-t20is-2792192-2025-09-24",
      "headline": "Sanju Samson battles middle-order blues after Shubman Gill's T20I returnSanju Samson has found it tough to adjust to new batting roles after Shubman Gill's return to the top. The wicketkeeper batter is being made to strive hard to seal his place in the T20I side, despite having proven his worth as an opener in the lead-up to Asia Cup 2025. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-squad-announcement-live-dubai-jasprit-bumrah-shubman-gill-2792471-2025-09-24",
      "headline": "IND vs WI Test squad live: Karun Nair, Sai Sudharsan or new number 3?IND vs WI Test squad announcement live updates: India's senior selection committee, led by Ajit Agarkar, will meet on 24 September to pick the squad for the upcoming two-Test series against West Indies, starting in Ahmedabad on 2 October."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/virat-kohli-focus-fitness-ishant-sharma-resilience-cricket-career-2792457-2025-09-24",
      "headline": "Virat Kohli was always focused, nothing affected his game, says Ishant SharmaIshant Sharma reveals how Virat Kohli had laser-like focus when on the field and nothing came in his way, including matters off the field when it came down to performing for the team."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/phil-salt-ipl-2025-final-child-birth-wife-decision-royal-challengers-bengaluru-kkr-2792459-2025-09-24",
      "headline": "Phil Salt on becoming a father and playing IPL final: Wife made the decisionPhil Salt returned to play the IPL 2025 Final immediately after becoming a father, thanks to his wife's push. He scored, took a brilliant catch, and helped RCB win their first-ever title."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/india-vs-west-indies-test-series-squad-announcement-shubman-gill-bumrah-rishabh-pant-2792398-2025-09-24",
      "headline": "India vs West Indies: What to expect from Test squad for season's first home seriesIndia vs West Indies: India's squad for the two-Test series, starting on 2 October, will be announced on Wednesday. While Jasprit Bumrah is expected to make the cut, attention will be on Karun Nair as he bids to retain his place after a subdued comeback in England. It also remains to be seen whether Axar Patel will earn a recall."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}