{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/emirates-signs-deal-to-accept-crypto-payments-report-2753227-2025-07-09",
      "headline": "Emirates signs deal to accept crypto payments for flight bookings: ReportIn recent years, the UAE has grown into a popular place for crypto companies. Many crypto firms have opened offices there or are planning to expand. Today, people in the UAE can already use cryptocurrencies to pay for things like real estate, school fees and even transport services."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/stock-market-closing-bell-sensex-closes-176-points-lower-nifty-below-25500-hcltech-down-2-percent-2753166-2025-07-09",
      "headline": "Sensex closes 176 points lower, Nifty below 25,500; HCLTech down 2%The S&P BSE Sensex was down by 176.43 points to 83,536.08, while the NSE Nifty50 lost 46.40 points to 25,476.10 as of 3:47 pm."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/reliance-jio-ipo-delay-2025-listing-unlikely-report-2753164-2025-07-09",
      "headline": "Reliance Jio IPO hits pause button, 2025 listing unlikely: ReportReliance Industries shares fell sharply after the news and were down 1.8% in afternoon trade, dragging the broader market into negative territory."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/sebi-ban-jane-street-aftermath-effect-dalal-street-stock-market-news-2753149-2025-07-09",
      "headline": "Sebi's ban on Jane Street: Could it rattle Dalal Street?While the ban is focused on a single player, many believe it may have wider effects on liquidity, trading volumes, investor confidence, and even foreign investor behaviour."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/71-percent-indians-fear-ai-scams-during-prime-day-report-2753134-2025-07-09",
      "headline": "71% Indians fear AI scams during Prime Day: ReportPrime Day scams India, AI shopping scams 2025, McAfee Prime Day scam report, Fake Amazon websites India, online shopping scam awareness, AI scam protection tips, Prime Day fake deals warning, Indians fear online scams, cyber fraud Prime Day India, deepfake scams online shopping"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/travel-food-services-ipo-review-latest-gmp-subscribe-skip-allotment-listing-date-2753114-2025-07-09",
      "headline": "Travel Food Services IPO to close soon: Should you subscribe? Check latest GMPThe bidding for the IPO began on July 7 and is set to close soon. Travel Food Services has set the price band for the issue between Rs 1,045 and Rs 1,100 per share. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/personal-finance/story/itr-filing-who-qualifies-for-zero-income-tax-2753102-2025-07-09",
      "headline": "ITR filing: Who qualifies for zero income tax?In her 2025 Budget speech, Finance Minister Nirmala Sitharaman shared big news. Under the new regime, if you earn up to Rs 12 lakh, you will not have to pay any income tax. Salaried taxpayers get an extra benefit too."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/it-q1fy26-preview-infosys-tcs-wipro-gain-momentum-or-soft-quarter-equirus-securities-earnings-preview-2753054-2025-07-09",
      "headline": "Infosys, TCS, Wipro: Will top IT companies gain momentum in Q1FY26?Equirus Securities, in its earnings preview, signals a subdued performance for the sector, where even the heavyweights are struggling to regain momentum. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/market/story/amfi-data-june-2025-mutual-fund-inflows-rise-24-percent-stock-market-news-2753021-2025-07-09",
      "headline": "Mutual fund inflows rise 24% in June to Rs 23,587 crore: AMFI dataAmong the 11 equity mutual fund categories, all except equity-linked savings schemes (ELSS) recorded positive inflows. Flexi cap funds emerged as the most preferred option for investors, bringing in Rs 5,733 crore in June. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/9-countries-where-indians-can-get-citizenship-for-less-than-rs-1-crore-2753019-2025-07-09",
      "headline": "9 countries where Indians can get citizenship for less than Rs 1 croreAcross many countries, it is now fully legal to buy citizenship. With a single payment or donation, Indians can get a fresh passport that offers visa-free access and minimal global taxes."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/icici-prudential-asset-management-files-for-ipo-check-details-2752973-2025-07-09",
      "headline": "ICICI Prudential Asset Management files for IPO. Check offer detailsThe IPO will be an offer for sale of up to 1.77 crore shares, representing 10% of the company's equity share capital. The shares will be sold by Prudential Corporation Holdings Limited (PCHL), a wholly-owned subsidiary of UK-based insurer Prudential."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/ipo/story/crizac-share-price-ipo-listing-14-percent-premium-rs-280-bse-nse-dalal-street-2752968-2025-07-09",
      "headline": "Crizac IPO listing: Shares debut at 14% premium on Dalal StreetCrizac share price: The stock opened at Rs 280 on the Bombay Stock Exchange (BSE) showing a 14.29% premium on its Dalal Street debut. "
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/charlize-theron-the-old-guard-2-trending-on-netflix-top-charts-despite-poor-reviews-2753220-2025-07-09",
      "headline": "All about Charlize Theron's The Old Guard 2, Netflix film trending amid poor reviews'The Old Guard 2', headlined by Charlize Theron, has taken over the top spot on Netflix's global top 10 movies for the week. The film ranked number 1 on Netflix in 74 countries, including India. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/timothee-chalamet-zendaya-dune-3-official-title-confirmed-all-you-need-to-know-about-new-dune-movie-2753177-2025-07-09",
      "headline": "Timothee Chalamet and Zendaya's Dune 3 official title confirmed: ReportsDenis Villeneuve's 'Dune 3' has entered production. The film's official title has been confirmed and, contrary to fans' predictions, it's not 'Dune Messiah'. Find out more details here."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actor-shiva-rajkumar-channels-vintage-spy-look-in-666-operation-dream-theatre-2753226-2025-07-09",
      "headline": "Actor Shiva Rajkumar channels vintage spy look in 666 Operation Dream TheatreThe makers of '666 Operation Dream Theatre' unveiled Shiva Rajkumar's first look. Directed by Hemanth Rao, the film is said to be a spy action thriller. The retro styling and tone hint at a tribute to old-school espionage dramas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/jeetendra-kumar-jaideep-ahlawat-jackson-wang-promise-fun-on-the-great-indian-kapil-sharma-show-2753161-2025-07-09",
      "headline": "Jeetu bhaiya, Jaideep Ahlawat, Jackson Wang promise fun on Kapil's show. WatchActors Jaideep Ahlawat, Pratik Gandhi, Jeetendra Kumar and Vijay Varma will feature in the next episode of 'The Great Indian Kapil Show'. K-Pop singer Jackson Wang would also make an appearance in the episode. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/freedom-movie-review-sasikumar-action-drama-sri-lankan-refugee-lost-opportunity-2753225-2025-07-09",
      "headline": "Freedom review: Sasikumar's action drama, based on true story, is lost opportunityRelease Date:Wed Jul 09, 2025Freedom movie review: Director Sathyasiva's 'Freedom', based on a true incident about Sri Lankan refugees, features Sasikumar, Lijomol Jose and Sudev Nair. The film has a solid story at its core, but is bogged down by sloppy execution. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rajkummar-rao-patralekhaa-announce-pregnancy-2753232-2025-07-09",
      "headline": "Rajkummar Rao-Patralekhaa announce pregnancy, celebs congratulateRajkummar Rao and Patralekhaa announced pregnancy on July 9. The couple shared a joint post on Instagram. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/sai-pallavi-junaid-khans-ek-din-to-release-in-november-report-2753189-2025-07-09",
      "headline": "Sai Pallavi, Junaid Khan's Ek Din to release in November: ReportThe upcoming film, 'Ek Din', starring Junaid Khan and Sai Pallavi, is set for release in November. Directed by Sunil Pandey, it will mark Pallavi's Bollywood debut. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vedika-prakash-shetty-alia-bhatt-ex-assistant-arrested-for-alleged-fraud-2753181-2025-07-09",
      "headline": "Who is Vedika Shetty? Alia Bhatt's ex-assistant arrested for alleged fraudAlia Bhatt's former personal assistant, Vedika Prakash Shetty, has been arrested by Juhu Police following allegations of cheating the actor and her production house of over Rs 76 lakh. Know more about the former assistant. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/television/story/rashami-desais-slams-paps-neha-bhasin-inappropriate-video-no-respect-2753040-2025-07-09",
      "headline": "Rashami Desai slams paps for inappropriate video of Neha Bhasin: You have no respectActor Rashami Desai criticised paparazzi for disrespecting Neha Bhasin in a recent viral video. She expressed disappointment over filming Bhasin from behind, despite her objections."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/story/madhur-bhandarkar-begins-the-wives-shoot-mouni-roy-shares-pics-from-mahurat-2753129-2025-07-09",
      "headline": "Madhur Bhandarkar begins The Wives shoot with Mouni Roy, shares pics from muhuratFilmmaker Madhur Bhandarkar has begun shooting his next film 'The Wives' with Mouni Roy. He shared pictures from the film's mahurat on social media. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/tiger-shroff-wraps-baaghi-4-shoot-expresses-gratitude-in-new-post-2753152-2025-07-09",
      "headline": "Tiger Shroff wraps Baaghi 4 shoot, expresses gratitude in new postActor Tiger Shroff has wrapped the filming of the fourth installment of 'Baaghi'. He shared a post on Wednesday to announce the same. \r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actor-raj-b-shetty-praises-yash-for-the-first-time-we-vow-to-defend-raavana-2753145-2025-07-09",
      "headline": "Actor Raj B Shetty praises Yash: For the first time, we vow to defend RavanaAs the buzz around Nitesh Tiwari's 'Ramayana' grows, Kannada actor Raj B Shetty's poetic tribute to Yash's portrayal of Ravana adds a powerful moment of appreciation, highlighting camaraderie and a fresh lens on one of the mythology's complex figure."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-preps-battle-of-galwan-apoorva-lakhia-bts-action-teaser-2753053-2025-07-09",
      "headline": "Is that Salman Khan? Fans excited as makers share Battle of Galwan BTS action prepDirector Apoorva Lakhia shared the behind-the-scenes teaser hinting at the prep work for 'Battle of Galwan'. The film is based on the 2020 Indo-China clash."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/pankaj-tripathi-for-guru-dutt-biopic-waheeda-rehman-on-his-100th-birth-anniversary-2753035-2025-07-09",
      "headline": "Pankaj Tripathi for Guru Dutt biopic: Waheeda Rehman on his 100th birth anniversaryOn Guru Dutt's 100th birth anniversary, his frequent collaborator Waheeda Rehman shared special memories of working with him on classic films. She also said only mature actors like Pankaj Tripathi or Naseeruddin Shah can do justice to his role in a biopic."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/pawan-kalyan-hari-hara-veera-mallu-not-based-on-folk-hero-its-a-work-of-fiction-2753078-2025-07-09",
      "headline": "Pawan Kalyan's Hari Hara Veera Mallu not based on folk hero, but a work of fictionAmid backlash from the Bahujan community, fresh reports clarify that 'Hari Hara Veera Mallu Part-1' is not based on historical figures but is a fictional spiritual character, reimagined under director AM Jyothi Krishna's vision."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/simone-ashley-joins-meryl-streep-anne-hathaway-emily-blunt-the-devil-wears-prada-2-cast-revealed-2753109-2025-07-09",
      "headline": "Bridgerton's Simone Ashley joins Meryl Streep in The Devil Wears Prada 2'The Devil Wears Prada 2' is in the works with Simone Ashley joining the original cast. Meryl Streep returns as Miranda Priestly, now facing off against Emily Blunt's character in the cut-throat world of advertising. The sequel is set for a summer 2026 release."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/television/story/amitabh-bachchan-starts-kaun-banega-crorepati-season-17-shoot-2753108-2025-07-09",
      "headline": "Amitabh Bachchan starts KBC 17 shoot, silences replacement rumours. PicsAmitabh Bachchan has confirmed his return as the host of 'Kaun Banega Crorepati' by sharing photos from the Season 17 shoot, putting an end to rumours of Salman Khan replacing him. The new season is expected to air on television in August 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/ricky-kej-questions-logic-in-shah-rukh-khan-kajol-dilwale-dulhania-le-jayenge-train-scene-fans-react-2753126-2025-07-09",
      "headline": "Ricky Kej questions logic in Shah Rukh Khan-Kajol's DDLJ train scene, fans reactGrammy-winning musician Ricky Kej sparked a debate after critiquing the famous train scene from 'Dilwale Dulhania Le Jayenge' with a practical perspective. The film released in 1995 and features Shah Rukh Khan and Kajol. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kiara-advani-working-with-hrithik-roshan-unforgettable-war-2-jr-ntr-ayan-mukerji-2753083-2025-07-09",
      "headline": "Kiara Advani says working with Hrithik was unforgettable: Can't wait for all to seeKiara Advani reacted to 'War 2' co-star Hrithik Roshan's heartfelt post as he wrapped the film's shooting. Kiara shared her experience of sharing screen space with Roshan. "
    }
  ],
  "general news": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/cities/delhi/story/rs-60-lakh-tender-for-delhi-cm-rekha-guptas-bungalow-renovation-cancelled-authorities-cite-admin-reasons-2753267-2025-07-09",
      "headline": "Rekha Gupta's bungalow renovation tender cancelled over 'administrative reasons'A Rs 60 lakh tender for Delhi Chief Minister Rekha Gupta's bungalow renovation have been cancelled with authorities citing administrative reasons."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/devendra-fadnavis-slams-sanjay-gaikwad-punch-video-sena-mla-hits-contractor-bjp-maharashtra-2753140-2025-07-09",
      "headline": "Unacceptable: Devendra Fadnavis rebukes Sena MLA for assaulting canteen staffMaharashtra Chief Minister Devendra Fadnavis talked tough after a video of Shiv Sena MLA Sanjay Gaikwad assaulting a canteen operator over the alleged poor quality of food served to him went viral, calling the act \"unacceptable\"."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/vadodara-bridge-collapse-dead-injured-gujarat-vehicles-fall-mahisagar-river-gambhira-2753012-2025-07-09",
      "headline": "Bridge collapses in Gujarat, 9 dead as vehicles plunge, truck hangs by a threadGujarat Bridge Collapse: Preliminary information indicated at least five vehicles had fallen into the river after the bridge collapse. Calling the incident 'deeply saddening,' Chief Minister Bhupendra Patel said that one of the 23 spans of the nearly 900-metre-long bridge had collapsed."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/one-big-beautiful-bill-us-hikes-student-tourist-h1b-visa-charges-with-250-dollar-security-fee-donald-trump-integrity-fee-2753147-2025-07-09",
      "headline": "US hikes student, tourist, H-1B visa charges with $250 security depositNon-immigrant visa applicants, including students, professionals, and tourists, will have to pay a $250 \"Integrity Fee\", along with other travel-related fees, starting in 2026, to enter the US. The fee might be refunded under certain conditions, but will change annually as it is based on inflation rates."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/karnataka-priyank-kharge-young-bjp-mp-operation-sindoor-delegation-us-trump-meeting-2753163-2025-07-09",
      "headline": "Did Centre know? Priyank Kharge flags report of 'young BJP MP' meeting TrumpIn a lengthy post on X, the Karnataka minister asked pointed questions about how the 'young BJP MP' bypassed diplomatic protocols and demanded accountability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-day-10-iga-swiatek-jannik-sinner-novak-djokovic-2753218-2025-07-09",
      "headline": "Day 10 Live Updates: Swiatek ahead in 1st set, Andreeva vs Bencic underwayWimbledon 2025, Day 10 Updates: Iga Swiatek is currently against Russia's Liudmila Samsonova in a bid for a maiden place in the semis at All England Club. Later in the day, Novak Djokovic and Jannik Sinner will play their respective quarterfinal matches. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/plane-crashes-in-rajasthans-churu-pilot-found-dead-2753112-2025-07-09",
      "headline": "2 pilots killed in IAF Jaguar jet crash in Rajasthan, third incident in 5 monthsSources told India Today TV that the aircraft was on a training sortie when it went down. The IAF operates multiple air bases in Rajasthan, with major installations in Jodhpur and Bikaner."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/indian-tourists-detained-russia-moscow-immigration-ordeal-appeal-modi-jaishankar-2753255-2025-07-09",
      "headline": "Treated like criminals: Indian tourist, held in Russia with others, seeks helpAn Indian tourist detained by Moscow immigration authorities with eight others appealed to the Indian embassy and Prime Minister Narendra Modi to intervene."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/gujarat-gambhira-bridge-collapse-vadodara-woman-cry-for-help-son-drowning-2753241-2025-07-09",
      "headline": "My son is drowning: Mother's desperate cry for help after Gujarat bridge collapseAccording to information gathered from the site, the woman had been travelling to Bagdana along with her son, daughter, husband, and son-in-law when the bridge gave way. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/food-inspectors-raid-mla-hostel-canteen-after-sena-leader-assaults-staffer-over-dal-collect-samples-for-tests-2753243-2025-07-09",
      "headline": "Food inspectors raid canteen after Sena MLA assaults staffer, collect samplesFood inspectors raided the Akashwani canteen, from where food is served at the MLA hostel, after Shiv Sena (Eknath Shinde) leader assaulted staffer over dal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rajkummar-rao-patralekhaa-announce-pregnancy-2753232-2025-07-09",
      "headline": "Rajkummar Rao-Patralekhaa announce pregnancy, celebs congratulateRajkummar Rao and Patralekhaa announced pregnancy on July 9. The couple shared a joint post on Instagram. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/cities/bengaluru/story/woman-alleges-gang-rape-extortion-at-friends-house-in-bengalurus-sai-layout-three-detained-2753171-2025-07-09",
      "headline": "Bengaluru woman alleges gang-rape, extortion at friend's house, three detainedA woman in Bengaluru alleged she was gangraped and then blackmailed at her friend's house. She said the accused also stole valuables from her. The police have detained three suspects based on CCTV footage."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/health/story/that-thing-in-the-corner-of-your-room-isnt-a-ghost-its-sleep-paralysis-insomnia-sonakshi-sinha-sleep-disorder-2753256-2025-07-09",
      "headline": "That thing in the corner of your room isn't a ghost; it's sleep paralysis In the shadows, a figure watches you, but you are powerless to scream in your sleep. This isn't just Sonakshi Sinha's ghost story; it could be the terrifying reality of sleep paralysis"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/uae-denies-reports-of-lifetime-golden-visas-warns-against-false-claims-2753208-2025-07-09",
      "headline": "UAE denies reports of lifetime Golden Visas, warns against false claimsSome media reports had claimed that a nomination process has been put in place by the UAE authorities to verify and forward such applications. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/nimisha-priya-execution-yemen-kerala-nurse-overdose-yemeni-national-be-saved-human-rights-activist-samuel-jerome-2753146-2025-07-09",
      "headline": "Can Kerala nurse Nimisha Priya facing execution in Yemen be saved?Nimisha Priya, a Kerala nurse, is set to be executed on July 16 for murdering a Yemeni national in 2017. India Today TV spoke to human rights activist, Samuel Jerome, who has been negotiating with the victim's family since the beginning, to understand if she has any options left."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/cloudy-with-a-chance-of-error-why-imd-is-struggling-to-get-delhis-rain-right-2753197-2025-07-09",
      "headline": "Why IMD's monsoon rain forecasts are missing the mark in DelhiThis monsoon has been overall favourable for India, except Delhi. The country has recorded about 15% more rainfall than the normal levels during the initial 40 days of the season. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/vedika-prakash-shetty-alia-bhatt-ex-assistant-arrested-for-alleged-fraud-2753181-2025-07-09",
      "headline": "Who is Vedika Shetty? Alia Bhatt's ex-assistant arrested for alleged fraudAlia Bhatt's former personal assistant, Vedika Prakash Shetty, has been arrested by Juhu Police following allegations of cheating the actor and her production house of over Rs 76 lakh. Know more about the former assistant. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/70-hour-workweek-memes-flood-x-as-rishi-sunak-joins-goldman-sachs-narayan-murthy-reference-2753234-2025-07-09",
      "headline": "70-hour workweek memes flood X as Rishi Sunak joins Goldman Sachs. You know whyAs Rishi Sunak prepared to return to Goldman Sachs, where he began his career, X users did what they do best: added a dash of humour, asking if he was ready for the 70-hour workweek quota, an idea famously backed by his father-in-law, Narayana Murthy."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/karnataka/story/deputy-cm-dk-shivakumar-moves-into-new-karnataka-bhavan-cm-suite-siddaramaiah-stays-at-old-one-2753175-2025-07-09",
      "headline": "Suite life of DK Shivakumar: Deputy gets a room closer to being Chief Minister?Deputy Chief Minister DK Shivakumar has taken over the Chief Minister's suite at the newly constructed Karnataka Bhavan in Delhi, raising eyebrows in political circles. According to sources, Chief Minister Siddaramaiah had to opt out due to ventilation issues."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/kerala-cargo-ship-arrested-msc-akiteta-msc-elsa-environmental-damage-high-court-vizhinjam-port-admiralty-act-2753135-2025-07-09",
      "headline": "A ship will be arrested in Kerala for its sibling's debts. Here's how and whyThe Kerala High Court has ordered the arrest of the cargo vessel MSC Akiteta II, anchored at Thiruvananthapuram's Vizhinjam Port. The arrest order was prompted by the Kerala government's bid to secure compensation for massive coastal damage caused by the sinking of its loaded sister vessel MSC Elsa III in May."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/ott/story/panchayat-binod-ashok-pathak-recalls-rejection-over-looks-went-to-parlour-got-facial-done-2753067-2025-07-09",
      "headline": "Panchayat's Binod recalls rejection over looks: Went to parlour, got facialPanchayat actor Ashok Pathak, known for playing Binod in the popular series, spoke about being rejected for roles in his initial career because of his looks. The actor shared that he was asked to visit a parlour and get a facial done. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/election-commission-bihar-special-intensive-revision-eci-non-citizens-vote-india-row-aadhaar-card-documents-form-6-2752797-2025-07-09",
      "headline": "Aadhaar isn't proof of citizenship. Then how does it fetch voting rights?The Election Commission is holding an intensive revision of voter rolls across India, beginning with Bihar, to update them and weed out non-citizens. But why did India allow non-citizens to get into the rolls in the first place? Form 6, which people fill to register as voters, doesn't demand proof of citizenship in the first place. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-f1-visas-march-may-issued-indian-students-continue-to-fall-trump-state-department-american-universities-2753150-2025-07-09",
      "headline": "F-1 visas for Indian students dip to lowest March–May level in three yearsThe number of F-1 visas issued to Indian students fell to 9,906 between March and May 2025, the lowest for this period since the Covid-19 pandemic. February also saw a 30% drop. While it may seem a direct link to Donald Trump's return, data shows the downward trend began much earlier."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/trending-news/story/train-in-jharkhand-waits-2-hours-as-elephant-gives-birth-on-tracks-bhupender-yadav-shares-video-2753168-2025-07-09",
      "headline": "Train in Jharkhand waits 2 hours as elephant gives birth on tracks. Watch videoThe incident, caught on camera, shows the elephant and her newborn calf walking off safely after the birth. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/hollywood/story/timothee-chalamet-zendaya-dune-3-official-title-confirmed-all-you-need-to-know-about-new-dune-movie-2753177-2025-07-09",
      "headline": "Timothee Chalamet and Zendaya's Dune 3 official title confirmed: ReportsDenis Villeneuve's 'Dune 3' has entered production. The film's official title has been confirmed and, contrary to fans' predictions, it's not 'Dune Messiah'. Find out more details here."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/actor-shiva-rajkumar-channels-vintage-spy-look-in-666-operation-dream-theatre-2753226-2025-07-09",
      "headline": "Actor Shiva Rajkumar channels vintage spy look in 666 Operation Dream TheatreThe makers of '666 Operation Dream Theatre' unveiled Shiva Rajkumar's first look. Directed by Hemanth Rao, the film is said to be a spy action thriller. The retro styling and tone hint at a tribute to old-school espionage dramas."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/regional-cinema/story/freedom-movie-review-sasikumar-action-drama-sri-lankan-refugee-lost-opportunity-2753225-2025-07-09",
      "headline": "Freedom review: Sasikumar's action drama, based on true story, is lost opportunityRelease Date:Wed Jul 09, 2025Freedom movie review: Director Sathyasiva's 'Freedom', based on a true incident about Sri Lankan refugees, features Sasikumar, Lijomol Jose and Sudev Nair. The film has a solid story at its core, but is bogged down by sloppy execution. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/rajkummar-rao-patralekhaa-announce-pregnancy-2753232-2025-07-09",
      "headline": "Rajkummar Rao-Patralekhaa announce pregnancy, celebs congratulateRajkummar Rao and Patralekhaa announced pregnancy on July 9. The couple shared a joint post on Instagram. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-shubman-gill-honeymoon-period-sourav-ganguly-warning-2753248-2025-07-09",
      "headline": "Shubman Gill's honeymoon period not forever: Ganguly warns India captainShubman Gill has made a strong start as India's Test captain, but with three games left, the real challenge is still to come. Sourav Ganguly says it's easy when things are going well, true leadership is shown when the pressure is on.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/formula-one-lewis-hamilton-ferrari-silverstone-loss-car-weather-2753235-2025-07-09",
      "headline": "Ferrari car balance, dicey weather: Hamilton reasons Silverstone let-downLewis Hamilton finished 4th at his home race at Silverstone. The seven-time world champion admitted that the Ferrari car was tough to drive in the challenging conditions. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/wimbledon-2025-day-10-iga-swiatek-jannik-sinner-novak-djokovic-2753218-2025-07-09",
      "headline": "Day 10 Live Updates: Swiatek ahead in 1st set, Andreeva vs Bencic underwayWimbledon 2025, Day 10 Updates: Iga Swiatek is currently against Russia's Liudmila Samsonova in a bid for a maiden place in the semis at All England Club. Later in the day, Novak Djokovic and Jannik Sinner will play their respective quarterfinal matches. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-lords-test-jofra-archer-return-ben-stokes-2753198-2025-07-09",
      "headline": "Ben Stokes sends India Jofra Archer warning: No fixed bowling plans on returnBen Stokes said that the England squad are excited to have Jofra Archer back in the Test lineup as the pacer makes a return to the longest format of the game for the match against India, starting from July 10. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/wiaan-mulder-400-brain-lara-chris-gayle-slams-zimbabwe-vs-south-africa-2753173-2025-07-09",
      "headline": "Wiaan Mulder should've gone for 400: Chris Gayle slams South Africa batterChris Gayle questioned Wiaan Mulder's bold declaration at 367*, arguing he missed a once-in-a-lifetime shot at Brian Lara's Test record. While South Africa won, Gayle insists greatness comes from chasing iconic milestones when they appear."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-jofra-archer-returns-no-gus-atkinson-lords-test-2753172-2025-07-09",
      "headline": "Jofra Archer returns after 4 years, no Atkinson as England announce Lord's Playing XIJofra Archer is making a return to the England Test side for the first time in four years as the hosts announced their playing XI for the match at Lord's, which will begin on July 10.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/f1-red-bull-racing-sack-christian-horner-sex-scandal-2753153-2025-07-09",
      "headline": "Red Bull sack Christian Horner as team principal, a year after sex texts scandalRed Bull Racing have sacked Christian Horner as the team principal, a year after his sex texts scandal. Horner worked as the team principal of Red Bull for the past 20 years and was in charge of the team during the recent British GP. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kane-williamson-committed-new-zealand-cricket-contract-decline-2025-2753144-2025-07-09",
      "headline": "Kane Williamson committed to New Zealand cricket despite contract declineHead coach Rob Walter has confirmed that star batter Kane Williamson still wants to play international cricket for the Black Caps, despite skipping the upcoming tour of Zimbabwe and turning down a central contract for the 2025 season."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-test-rankings-latest-shubman-gill-top-10-harry-brook-2753142-2025-07-09",
      "headline": "ICC Test Rankings: Shubman Gill breaks into top 10, Harry Brook new No. 1India captain Shubman Gill reached a career-best No 6 in ICC Test rankings after a record-breaking outing against England in Birmingham. Three Indians are now in the top 10 of the batting charts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-dukes-ball-manufacturer-defends-shubman-gill-complaint-2753136-2025-07-09",
      "headline": "After Shubman Gill's complaint, Dukes manufacturer defends ballShubman Gill raised concerns about the Dukes ball going soft too early, and manufacturer Dilip Jajodia responded by saying making it harder could break bats and upset the balance of the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/eng-vs-ind-yuvraj-singh-exclusive-shubman-gill-test-captaincy-2753125-2025-07-09",
      "headline": "Yuvraj Singh credits Gambhir-Agarkar for Shubman Gill's Test formENG vs IND: In an exclusive interaction, former India all-rounder Yuvraj Singh has praised Shubman Gill's Test captaincy and batting form, adding that Ajit Agarkar and Gautam Gambhir deserve credit for the Indian captain's sensational performance."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/formula-one/story/f1-red-bull-racing-sack-christian-horner-sex-scandal-2753153-2025-07-09",
      "headline": "Red Bull sack Christian Horner as team principal, a year after sex texts scandalRed Bull Racing have sacked Christian Horner as the team principal, a year after his sex texts scandal. Horner worked as the team principal of Red Bull for the past 20 years and was in charge of the team during the recent British GP. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/kane-williamson-committed-new-zealand-cricket-contract-decline-2025-2753144-2025-07-09",
      "headline": "Kane Williamson committed to New Zealand cricket despite contract declineHead coach Rob Walter has confirmed that star batter Kane Williamson still wants to play international cricket for the Black Caps, despite skipping the upcoming tour of Zimbabwe and turning down a central contract for the 2025 season."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/icc-test-rankings-latest-shubman-gill-top-10-harry-brook-2753142-2025-07-09",
      "headline": "ICC Test Rankings: Shubman Gill breaks into top 10, Harry Brook new No. 1India captain Shubman Gill reached a career-best No 6 in ICC Test rankings after a record-breaking outing against England in Birmingham. Three Indians are now in the top 10 of the batting charts. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/england-vs-india-dukes-ball-manufacturer-defends-shubman-gill-complaint-2753136-2025-07-09",
      "headline": "After Shubman Gill's complaint, Dukes manufacturer defends ballShubman Gill raised concerns about the Dukes ball going soft too early, and manufacturer Dilip Jajodia responded by saying making it harder could break bats and upset the balance of the game."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/video/eng-vs-ind-yuvraj-singh-exclusive-shubman-gill-test-captaincy-2753125-2025-07-09",
      "headline": "Yuvraj Singh credits Gambhir-Agarkar for Shubman Gill's Test formENG vs IND: In an exclusive interaction, former India all-rounder Yuvraj Singh has praised Shubman Gill's Test captaincy and batting form, adding that Ajit Agarkar and Gautam Gambhir deserve credit for the Indian captain's sensational performance."
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'\r\n\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives.\r\n"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Court to recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination after discrepancies in the declared results.\r\n\r\n"
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    }
  ]
}