{
  "business": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/adani-group-shares-rise-as-hindenburg-research-shuts-down-check-details-2665584-2025-01-16",
      "headline": "Adani Group shares rise as Hindenburg Research shuts down. Details hereIn January 2023, Hindenburg Research published a report alleging financial irregularities within the Adani Group, leading to a massive decline in the conglomerate's market valuation."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/7-last-minute-investment-strategies-to-save-taxes-before-fy-2024-25-ends-2665542-2025-01-16",
      "headline": "7 last-minute investment strategies to save taxes before FY 2024-25 endsTax-saving investments help you save on taxes while securing your financial future."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/rvnl-multibagger-railway-stock-jump-key-reason-behind-todays-gain-explained-stmp-2665533-2025-01-16",
      "headline": "RVNL share price up 9% today. Why did multibagger railway stock gain? RVNL stock price: Shares of the company opened higher at Rs 388 and surged to an intraday high of Rs 406.10 in early trade. At around 11 am, RVNL shares were still trading 7.76% higher at Rs400.75."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/video/us-based-short-seller-hindenburg-shuts-down-2665524-2025-01-16",
      "headline": "US-based short-seller Hindenburg shuts downNate Anderson, the founder of the US-based short-seller Hindenburg Research, announced on Thursday his decision to shut down firm, Hindenburg."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-continue-winning-streak-3-reasons-why-stock-market-gained-today-us-inflation-gaza-ceasefire-2665519-2025-01-16",
      "headline": "Sensex, Nifty continue winning streak: 3 reasons why stock market gained todayThe S&P BSE Sensex was up 308.61 points to77,032.69, while the NSE Nifty50 added 105.75 points to23,318.95 as of 10:25 AM."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hdfc-life-insurance-share-price-climbs-over-10-percent-q3-results-2665515-2025-01-16",
      "headline": "Explained: Why HDFC Life shares climbed nearly 11% after Q3 resultsHDFC Life shares were up 10.28% to Rs 655.35 at around 10:17 am. Earlier, the stock had reached a day's high of Rs 657.80."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/share-market-today-sensex-nifty-open-higher-for-third-consecutive-session-adani-stocks-gain-up-to-6-percent-2665494-2025-01-16",
      "headline": "Sensex, Nifty open higher for 3rd consecutive session; Adani stocks up 6%Share market today: The S&P BSE Sensex surged 419.86 points to 77,143.94, while the NSE Nifty50 gained 127.65 points to 23,340.85 as of 9:30 AM."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hindenburg-research-nate-anderson-to-close-reason-here-why-adani-nikola-2665486-2025-01-16",
      "headline": "Nate Anderson's Hindenburg Research to shut shop. Here's whyNate Anderson, the man behind Hindenburg Research, announced the decision in a detailed post, explaining that the firm's work is complete, and it is time to move on."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/laxmi-dental-ipo-allotment-step-by-step-guide-to-check-status-latest-gmp-listing-date-2665472-2025-01-16",
      "headline": "Laxmi Dental IPO allotment: Step-by-step guide to check status. Check latest GMPLaxmi Dental IPO allotment status: Investors who have bid for the IPO can check their allotment through the websites of Bombay Stock Exchange (BSE) and Link Intime India Private Ltd, the registrar for the issue."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/stocks-to-watch-today-ril-lt-tech-hdfc-life-hero-motocorp-ltimindtree-q3-results-2665466-2025-01-16",
      "headline": "Stocks to watch today: RIL, L&T Tech, HDFC Life, Hero MotoCorp, SwiggyInvestors will closely watch RIL, Infosys, Axis Bank, and LTIMindtree as these companies are scheduled to announce their third-quarter earnings today. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sharechat-to-cut-5-percent-of-its-workforce-amid-performance-reviews-report-2665254-2025-01-15",
      "headline": "ShareChat to cut 5% of its workforce amid performance reviews: ReportShareChat has announced slashing 5% of its headcount to enhance operational efficiency."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/3-must-know-sections-under-old-tax-regime-to-save-money-2665199-2025-01-15",
      "headline": "3 must-know sections under old tax regime to save moneyThe old regime offers several tax-saving opportunities under several sections."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/business/story/how-to-prevent-and-report-credit-card-fraud-a-complete-guide-2665174-2025-01-15",
      "headline": "How to prevent and report credit card fraud: A complete guideCustomers must know how to handle unauthorised credit card transactions."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/market-closing-bell-sensex-nifty-climb-as-it-stocks-shine-ahead-of-us-inflation-data-2665153-2025-01-15",
      "headline": "Sensex, Nifty climb as IT stocks shine ahead of US inflation dataThe S&P BSE Sensex gained 224.45 points to close at 76,724.08, while the NSE Nifty50 added 37.15 points to end at23,213.20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/global-bond-sell-off-whats-going-on-and-will-it-impact-india-2665147-2025-01-15",
      "headline": "Global bond sell-off: What's going on, and will it have any impact on India?As the global bond sell-off continues to accelerate, here's how rising yields and higher borrowing costs may impact the Indian economy and stock markets."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/laxmi-dental-ipo-to-close-for-bidding-day-3-should-you-invest-check-latest-gmp-subscription-allotment-date-2665131-2025-01-15",
      "headline": "Laxmi Dental IPO to close for bidding: Should you invest? Check latest GMPLaxmi Dental IPO is expected to be listed on both the BSE and NSE, with the tentative listing date scheduled for Monday, January 20, 2025."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/epf-withdrawal-why-you-should-link-aadhaar-and-uan-today-2665104-2025-01-15",
      "headline": "EPF withdrawal: Why you should link Aadhaar and UAN todayLinking bank accounts with UAN simplifies EPF management for a seemless experience."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/budget-2025-expectations-for-personal-income-tax-reforms-and-more-2665064-2025-01-15",
      "headline": "Budget 2025: Expectations for personal income tax reforms and moreBudget 2025: The middle-income group is looking forward to personal income tax revisions to ease their financial burden in the upcoming budget."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/budget-2025-stock-market-expectations-capital-gains-tax-ltcg-relief-dalal-street-investors-2665049-2025-01-15",
      "headline": "LTCG tax relief in Budget 2025? What stock market investors are hoping forStock markets are buzzing with anticipation for the upcoming budget, especially after the Finance Minister Nirmala Sitharaman announced key changes to capital gains taxation in her seventh Budget."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/budget/story/union-budget-2025-old-and-new-income-tax-regime-merger-benefits-challenges-explained-2665029-2025-01-15",
      "headline": "Budget 2025: Is merging old and new income tax regimes a good idea?Budget 2025: Will merging the old and new tax regimes offer the best of both worlds for taxpayers? Experts weigh in on whether a unified system could simplify compliance or introduce new challenges."
    }
  ],
  "entertainment": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/newsmo/video/house-of-cards-actor-kevin-spacey-given-bail-what-happens-to-metoo-now-1963920-2022-06-18",
      "headline": "House of cards actor Kevin Spacey given bail, what happens to #metoo now?From American Beauty to House of Cards, one of the most lauded actors of his generation, Kevin Spacey has a tainted reputation. In a new turn, the Oscar-winning actor \"strenuously\" denied allegations of sexual assault against him and got bail. Watch to know more"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/video/images-of-nayantara-with-footwear-inside-tirupati-temple-sparks-outrage-against-newlywed-couple-1961072-2022-06-11",
      "headline": "Images of Nayantara wearing sandals inside Tirupati temple sparks outrage against newlywed coupleAfter the grand wedding between Nayantara and Vignesh, the couple went to the Tirupati temple to offer prayers.However, images of Nayantara wearing footwear inside the temple area has sparked outrage among the devotees against the couple.While Vignesh was spotted walking barefoot, Nayantara was seen wearing sandals, which caused a massive uproar amongst devotees in the area.Temple authorities issued a clarification saying it was permitted for devotees to wear footwear in that area."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/cannes-film-festival-2022-deepika-aishwarya-walk-the-red-carpet-indian-pavilion-inaugurated-1952204-2022-05-21",
      "headline": "Cannes Film Festival 2022: Deepika, Aishwarya walk the red carpet; Indian pavilion inauguratedThe 75th annual Cannes Film Festival began on May 17. Aishwarya Rai Bachchan and Deepika Padukone walked the red carpet on Day 3 of the 10-day film festival. On the second day, May 18, Union Minister for I&B, Youth Affairs & Sports, Anurag Thakur, inaugurated the India Pavilion at the Cannes Film Festival. The special event was also attended by several Indian celebrities, including Deepika Padukone, R. Madhavan, Nawazuddin Siddiqui, Tamannaah Bhatia and others.Deepika Padukone, who is part of the Cannes 2022 jury, talked about Indian films at the event and said that she believes there will be a day when Cannes will be in India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/entertainment/video/watch-disco-king-bappi-lahiri-passes-away-at-1913584-2022-02-16",
      "headline": "Disco king Bappi Lahiri passes away at 69 Singer-composer Bappi Lahiri passed away on Wednesday, February 16, at a Mumbai hospital. He was 69."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/entertainment/story/andheri-court-summons-shilpa-shetty-shamita-shetty-mother-sunanda-1912386-2022-02-12",
      "headline": "Andheri court summons Shilpa Shetty, Shamita, their mother Sunanda The Andheri court has issued summons to Bollywood actress Shilpa Shetty, her sister Shamita and their mother Sunanda over non-repayment of loan."
    }
  ],
  "general news": [
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/saif-ali-khan-attacked-knife-cctv-shows-no-one-going-inside-suspect-insider-job-mumbai-police-statement-2665520-2025-01-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Attack on Saif Ali Khan an inside job? Cops say no one seen on CCTVAccording to the Mumbai Police, the attack on Saif Ali Khan happened at around 2.30 am. The police suspect that the attacker might have been present inside the actor's home, as the CCTV footage did not show any person entering his housing society."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saif-ali-khan-stabbed-knife-attack-bandra-home-2665487-2025-01-16?utm_source=LiveBlog_hp&utm_medium=LiveBlog&utm_campaign=home_LiveBlog",
      "headline": "Saif Ali Khan out of danger; cops questioning construction workers in buildingBollywood actor Saif Ali Khan was attacked at his Bandra home in a burglary attempt. He is currently undergoing surgery at Mumbai's Lilavati Hospital."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saif-ali-khan-attacked-10-questions-about-the-incident-answered-2665543-2025-01-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Saif Ali Khan attacked: 10 key questions answeredActor Saif Ali Khan was attacked at his house in Mumbai by an unidentified person who was reportedly attempting a robbery at his place. The actor underwent two surgeries at Lilavati hospital. Here are a few answers to your questions about the incident. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-bcci-meeting-india-indiscipline-rohit-sharma-match-fees-2665567-2025-01-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Under-fire Gautam Gambhir wants to discipline Indian team: SourcesIndia Today has learnt that the suggestion to curb family time for players on tours came from India men's team head coach Gautam Gambhir. Sources suggest that Gambhir is trying to discipline the Indian team, after two woeful Test series against New Zealand and Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/isro-spadex-satellites-docking-successful-creates-history-spacecraft-2665500-2025-01-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Isro docks satellites in space, India becomes 4th country to achieve featIsro Spadex Mission: The docking experiment, which took place in the wee hours of January 16, 2025, was a meticulous dance between two satellites as the chaser aligned with the target."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/saif-ali-khan-knife-attack-multiple-times-inside-house-hospitalised-2665468-2025-01-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Saif Ali Khan attacked with knife during burglary attempt, undergoes surgery Live UpdatesBollywood actor Saif Ali Khan was injured after an unidentified attacker stabbed him with a knife at his Bandra home in a burglary attempt. After the attack, the actor was admitted to Mumbai'sLilavati Hospital and was reportedly out of danger."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/science/story/jeff-bezos-new-glenn-rocket-launch-maiden-flight-2665588-2025-01-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Jeff Bezos's New Glenn rocket launches on maiden flightThe New Glenn rocket, towering at approximately 320 feet, is designed to compete directly with SpaceX's Falcon 9 by demonstrating reusability."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/bollywood/story/bollywood-actor-saif-ali-khan-knife-attack-salman-khan-home-shots-fired-bandra-safety-concerns-2665513-2025-01-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Attack on Saif Ali Khan, shots fired at Salman Khan's home, is Bandra still safe?Besides Saif Ali Khan and Salman Khan,other prominent actors who live in Bandra are Shah Rukh Khan, Aamir Khan, Ranbir Kapoor, Sanjay Dutt, Rekha, Zeenat Aman, Ananya Panday, Farhan Akhtar and Saira Bano."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/kareena-kapoor-video-after-attack-on-saif-ali-khan-emerges-2665535-2025-01-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Kareena Kapoor seen pacing outside Bandra home after attack on Saif Ali KhanSaif Ali Khan was attacked at his Bandra home during a burglary attempt in which he sustained six stab wounds. In the moments after the attack, Kareena Kapoor was seen pacing outside their home talking to staff members."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-2025-day-5-live-sinner-swiatek-medvedev-fritz-rybakina-2665433-2025-01-15?utm_source=LiveBlog_hp&utm_medium=LiveBlog&utm_campaign=home_LiveBlog",
      "headline": "Day 5 Live Updates: Rune wins 1st set vs Berrettini, Balaji into Round 2Australian Open 2025 Day 5 Live Updates: Holger Rune has fought back from behind to take the opening set in an entertaining match against Matteo Berrettini. N. Sriram Balaji and partner Reyes-Varela are through to Round 2 of the Australian Open. Berretini is all set to take on Holger Rune in a blockbuster clash. Later on in the day, World No.1 Jannik Sinner will be in action. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saif-ali-khan-attacked-kareena-kapoor-team-statement-rest-of-the-family-is-fine-2665490-2025-01-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Saif Ali Khan injured his arm, family fine: Kareena Kapoor issues statementAfter the attack on Saif Ali Khan, actor's wife Kareena Kapoor's team released an official statement. The team said that the rest of the family is fine."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/24-akbar-road-congress-headquarters-change-bjp-national-office-deen-dayal-upadhayay-marg-2665182-2025-01-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Not in IQ or EQ, real story of Congress and BJP is in HQThe evolution of the headquarters of the Congress and BJP tells the story of their organisational journey and priorities. While the BJP swiftly built a modern, tech-savvy central office in less than two years, the Congress clung to an outdated set-up at 24, Akbar Road for five decades. This is what the two HQs reveal."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/salman-khan-dog-toro-dies-iulia-vantur-tribute-stmp-2665560-2025-01-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Salman Khan's dog Toro dies, Iulia Vantur writes, 'with us forever'Superstar Salman Khan has lost his pet dog, Toro, as confirmed by Iulia Vantur on social media. Vantur paid tribute to the pet on her Instagram handle. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/us-news/story/us-president-elect-donald-trump-hires-1000-people-for-his-administration-says-not-anyone-with-trump-derangement-syndrome-2665473-2025-01-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Trump's criteria to join his team: No one linked to 'birdbrain' Nikki HaleyTrump made the announcement in a Truth Social post on Wednesday in which he also said that he would not consider individuals associated with some of his Republican rivals and critics, including his former Vice President Mike Pence and \"birdbrain\" Nikki Haley."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/sensex-nifty-continue-winning-streak-3-reasons-why-stock-market-gained-today-us-inflation-gaza-ceasefire-2665519-2025-01-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Sensex, Nifty continue winning streak: 3 reasons why stock market gained todayThe S&P BSE Sensex was up 308.61 points to77,032.69, while the NSE Nifty50 added 105.75 points to23,318.95 as of 10:25 AM."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/cars/story/meet-the-suv-aiming-to-electrify-marutis-ev-dream-not-brezza-fronx-2665514-2025-01-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Meet the SUV aiming to electrify Maruti's EV dream. Not Brezza, FronxThis electric SUV will take on the likes of the Mahindra BE 6, Hyundai Creta Electric, Tata Curvv.ev and MG ZS EV."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/lifestyle/beauty/story/ravinage-over-retinol-experts-decode-the-better-pick-for-your-skin-2665447-2025-01-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Ravinage over retinol? Experts decode the better pick for your skinThere's a growing buzz online about ravinage, a plant-based alternative to retinol, being better for your skin. But is there any truth to the claims? We turned to experts to help dissect the facts."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/technology/news/story/elon-musk-is-hiring-for-software-engineer-role-says-there-is-no-need-for-a-degree-2665483-2025-01-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Elon Musk is hiring for software engineer role, says there is no need for a degreeElon Musk aims to reshape hiring by prioritising skills over degrees, with the larger goal of transforming X into a unified platform that integrates services like payments, messaging, e-commerce, and multimedia."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saif-ali-khan-knife-attack-fought-intruder-kareena-kapoor-sons-taimur-jeh-at-home-sources-2665480-2025-01-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Saif Ali Khan fought intruder, Kareena, sons were at home during attack: SourcesActor Saif Ali Khan was attacked with a knife at his Bandra home and is currently hospitalised. Kareena Kapoor Khan and the children, Taimur and Jeh, were at home during the attack. Saif faced the intruder head-on to protect the family."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/business/story/hindenburg-research-nate-anderson-to-close-reason-here-why-adani-nikola-2665486-2025-01-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Nate Anderson's Hindenburg Research to shut shop. Here's whyNate Anderson, the man behind Hindenburg Research, announced the decision in a detailed post, explaining that the firm's work is complete, and it is time to move on."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/auto/story/hyundai-creta-ev-review-first-drive-the-second-coming-2665339-2025-01-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Hyundai Creta EV Review, first drive: the second comingHot on the heels of the launch of the new Creta Electric, we take the electrified version of India's best-selling mid-size SUVs for a drive to find out.  "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/world/story/joe-biden-farewell-address-speech-white-house-oval-office-oligarchy-in-america-dangerous-power-wealthy-donald-trump-transition-2665460-2025-01-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Biden warns against 'oligarchy, dangerous concentration of power' in farewell speechJoe Biden is set to leave the White House on January 20, paving the way for his successor Donald Trump to return for a second stint as the US President."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/border-gavaskar-trophy-australia-vs-india-gabba-test-akash-deep-virat-kohli-bat-2665497-2025-01-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "How Virat Kohli gifted Akash Deep his bat that saved Gabba Test for IndiaAkash Deep has revealed the circumstances which led to him getting Virat Kohli's bat. Akash Deep used the bat from Kohli to play a valiant knock that helped India save the Gabba Test during the Border-Gavaskar Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/story/saif-ali-khan-attacked-by-intruder-hospitalised-surgery-statement-actor-team-2665485-2025-01-16?utm_source=Story_hp&utm_medium=Story&utm_campaign=home_Story",
      "headline": "Saif Ali Khan now out of danger: Actor's team issues statementActor Saif Ali Khan was attacked during a burglary attempt at his Bandra home, sustaining six stab wounds. Post-surgery, he is stable. Police are investigating the incident. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/video/actor-saif-ali-khan-stabbed-six-times-in-his-home-during-burglary-attempt-2665527-2025-01-16",
      "headline": "Actor Saif Ali Khan stabbed six times in his home during burglary attemptBollywood actor Saif Ali Khan was stabbed at least six times by an unidentified assailant who broke into his Mumbai residence during a burglary attempt on Thursday. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/movies/celebrities/video/saif-ali-khan-is-stable-recovering-well-hum-tum-director-kunal-kohli-2665578-2025-01-16",
      "headline": "Saif Ali Khan is stable, recovering well: Hum Tum director Kunal KohliDirector Kunal Kohli, who worked with Saif Ali Khan in Hum Tum, spoke exclusively with India Today and said that the actor is now stable. He also "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/video/visuals-of-distressed-kareena-kapoor-emerge-after-attack-on-saif-ali-khan-2665559-2025-01-16",
      "headline": "Visuals of distressed Kareena Kapoor emerge after attack on Saif Ali KhanSaif was stabbed six times at his Bandra home by intruders attempting a burglary. In the video, Kareena Kapoor appeared visibly distressed."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/movies/celebrities/video/saif-ali-khan-stabbed-sara-ibrahim-arrive-at-lilavati-hospital-2665563-2025-01-16",
      "headline": "Saif Ali Khan stabbed: Sara, Ibrahim arrive at Lilavati hospitalSaif Ali Khan's children, Ibrahim Ali Khan and Sara Ali Khan, were seen arriving at the Lilavati Hospital where Saif is currently undergoing cosmetic surgery. Saif was attacked at his Bandra home, sustaining six stab wounds while protecting his family. "
    }
  ],
  "sports": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/arsenal-firmly-in-premier-league-title-race-after-north-london-derby-win-arteta-2665570-2025-01-16",
      "headline": "Arsenal firmly in Premier League title race after North London derby win: ArtetaArsenal boss Mikel Arteta feels that his side is firmly in the title race after their win in the North London derby against Tottenham Hotspur on Wednesday, January 15. Arsenal secured a 2-1 win over their neighbours. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/gautam-gambhir-bcci-meeting-india-indiscipline-rohit-sharma-match-fees-2665567-2025-01-16",
      "headline": "Under-fire Gautam Gambhir wants to discipline Indian team: SourcesIndia Today has learnt that the suggestion to curb family time for players on tours came from India men's team head coach Gautam Gambhir. Sources suggest that Gambhir is trying to discipline the Indian team, after two woeful Test series against New Zealand and Australia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/smriti-mandhana-india-women-team-highest-odi-score-2665538-2025-01-16",
      "headline": "India's record-shattering onslaught on Ireland was planned: Smriti MandhanaThe Indian women's team slammed their way to a 435-run total against Ireland. India captain Smriti Mandhana revealed that the onslaught was pre-planned and India wanted to play their shots."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-2025-results-alex-de-minaur-taylor-fritz-elena-rybakina-melbourne-2665532-2025-01-16",
      "headline": "Australian Open: De Minaur, Fritz into Round 3, Rybakina thrashes Iva JovicAlex De Minaur, Taylor Fritz and Elena Rybakina reached the 3rd round of the Australian Open 2025 with straight set wins on Thursday, January 16. De Minaur saw off Tristan Boyer to make it to the next round in Melbourne. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/viswanathan-anand-chess-pongal-celebration-breakfast-dance-video-2665498-2025-01-16",
      "headline": "Watch: Chess community gathers at Vishy Anand's house for special breakfastViswanathan Anand hosted a hearty breakfast at his home on the day of Pongal. Anand posted a video of the special day out which also celebrated the engagement of Vidit Gujrathi and Nidhi Katia."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/border-gavaskar-trophy-australia-vs-india-gabba-test-akash-deep-virat-kohli-bat-2665497-2025-01-16",
      "headline": "How Virat Kohli gifted Akash Deep his bat that saved Gabba Test for IndiaAkash Deep has revealed the circumstances which led to him getting Virat Kohli's bat. Akash Deep used the bat from Kohli to play a valiant knock that helped India save the Gabba Test during the Border-Gavaskar Trophy. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/brett-lee-reviews-virat-kohlis-border-gavaskar-trophy-delivers-verdict-2665495-2025-01-16",
      "headline": "Brett Lee reviews Virat Kohli's tour of Australia, delivers verdict on battingFormer Australia fast bowler Brett Lee has reviewed Virat Kohli's woeful tour of Australia. Speaking on his batting, Lee said that it was very un-Kohli-like for the batter to edge the ball eight times in his nine innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sa20-dinesh-karthik-pulls-off-one-handed-stunner-for-paarl-royals-vs-mi-cape-town-video-2665489-2025-01-16",
      "headline": "Watch: Dinesh Karthik pulls off one-handed stunner for Paarl Royals in SA20Dinesh Karthik showed why he is still one of the best in the business as the Indian wicketkeeper pulled off a stunning one-handed catch during Paarl Royals' clash against MI Cape Town on Wednesday, January 16. Karthik's catch helped dismiss Azmatullah Omarzai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/barcelona-vs-real-betis-copa-del-rey-result-lamine-yamal-2665482-2025-01-16",
      "headline": "Barcelona thrash Real Betis 5-1 to reach Copa Del Ray quarter-finalsFC Barcelona continued their rediscovered form to storm into the quarter-finals of the Copa Del Rey. Youngster Lamine Yamal starred as Barcelona beat Real Betis 5-1 on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-2025-results-iga-swiatek-emma-raducanu-ons-jabeur-melbourne-2665469-2025-01-16",
      "headline": "Australian Open: Iga Swiatek continues streak, Emma Raducanu beats AnisimovaIga Swiatek thrashed Rebecca Sramkova to continue her unique grand slam streak, while Emma Raducanu secured a hard-fought win over Amanda Anisimova to make it to the 3rd round of the Australian Open for the first time. Both women will now face each other in the next round. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-fan-crashes-his-car-while-trying-to-click-a-selfie-with-sam-konstas-2665437-2025-01-16",
      "headline": "Watch: Fan crashes his car while trying to click a selfie with Sam KonstasA fan crashed his car while trying to click a selfie with rising young Australian cricketer Sam Konstas, who recently made his debut during the Test series against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/brett-lee-reviews-virat-kohlis-border-gavaskar-trophy-delivers-verdict-2665495-2025-01-16",
      "headline": "Brett Lee reviews Virat Kohli's tour of Australia, delivers verdict on battingFormer Australia fast bowler Brett Lee has reviewed Virat Kohli's woeful tour of Australia. Speaking on his batting, Lee said that it was very un-Kohli-like for the batter to edge the ball eight times in his nine innings."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/sa20-dinesh-karthik-pulls-off-one-handed-stunner-for-paarl-royals-vs-mi-cape-town-video-2665489-2025-01-16",
      "headline": "Watch: Dinesh Karthik pulls off one-handed stunner for Paarl Royals in SA20Dinesh Karthik showed why he is still one of the best in the business as the Indian wicketkeeper pulled off a stunning one-handed catch during Paarl Royals' clash against MI Cape Town on Wednesday, January 16. Karthik's catch helped dismiss Azmatullah Omarzai. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/barcelona-vs-real-betis-copa-del-rey-result-lamine-yamal-2665482-2025-01-16",
      "headline": "Barcelona thrash Real Betis 5-1 to reach Copa Del Ray quarter-finalsFC Barcelona continued their rediscovered form to storm into the quarter-finals of the Copa Del Rey. Youngster Lamine Yamal starred as Barcelona beat Real Betis 5-1 on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-2025-results-iga-swiatek-emma-raducanu-ons-jabeur-melbourne-2665469-2025-01-16",
      "headline": "Australian Open: Iga Swiatek continues streak, Emma Raducanu beats AnisimovaIga Swiatek thrashed Rebecca Sramkova to continue her unique grand slam streak, while Emma Raducanu secured a hard-fought win over Amanda Anisimova to make it to the 3rd round of the Australian Open for the first time. Both women will now face each other in the next round. "
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/sports/cricket/story/watch-fan-crashes-his-car-while-trying-to-click-a-selfie-with-sam-konstas-2665437-2025-01-16",
      "headline": "Watch: Fan crashes his car while trying to click a selfie with Sam KonstasA fan crashed his car while trying to click a selfie with rising young Australian cricketer Sam Konstas, who recently made his debut during the Test series against India."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/football/story/premier-league-results-arsenal-vs-tottenham-leandro-trossard-winner-north-london-derby-2665461-2025-01-16",
      "headline": "Trossard the hero as Arsenal win North London derby, Newcastle thrash WolvesLeandro Trossard was the match winner for Arsenal as they got back to winning ways by defeating Tottenham Hotspur 2-1 at the Emirates on Wednesday, January 15. Newcastle United continued their brilliant form, while Crystal Palace and Aston Villa also secured wins. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-2025-day-5-live-sinner-swiatek-medvedev-fritz-rybakina-2665433-2025-01-15",
      "headline": "Day 5 Live Updates: Balaji into Round 2, Rune vs Berretini underwayAustralian Open 2025 Day 5 Live Updates: N. Sriram Balaji and partner Reyes-Varela are through to Round 2 of the Australian Open. Berretini is all set to take on Holger Rune in a blockbuster clash. Later on in the day, World No.1 Jannik Sinner will be in action. "
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/other-sports/story/kho-kho-world-cup-india-men-women-teams-book-quarterfinal-spot-2665429-2025-01-15",
      "headline": "India men and women teams book quarterfinal spots with commanding winsThe Indian men's and women's teams secured quarterfinal berths in the Kho Kho World Cup in New Delhi on Wednesday. While the men's team secured a 70-38 victory over Peru, the women's team registered a 100-16 win against Iran."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/will-miss-playing-in-india-in-future-icc-events-pakistans-fakhar-zaman-2665419-2025-01-15",
      "headline": "Will miss playing in India in future ICC events: Pakistan's Fakhar ZamanStar Pakistan batter Fakhar Zaman recently said that he will miss playing in India in future ICC events. India and Pakistan have reached a consensus to not play in each other's countries during multinational tournaments."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-pacer-anrich-nortje-ruled-out-of-champions-trophy-with-back-injury-2665410-2025-01-15",
      "headline": "South Africa pacer Anrich Nortje ruled out of Champions Trophy with back injurySouth Africa pacer Anrich Nortje will miss the Champions Trophy due to a back injury. Nortje has not played international cricket since the T20 World Cup final in June last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vijay-hazare-trophy-karnataka-beat-haryan-to-reach-final-2665392-2025-01-15",
      "headline": "Vijay Hazare Trophy: Karnataka enter final after comprehensive win over HaryanaKarnataka chased down the 238-run target in 47.2 overs to beat Haryana by 5 wickets and book their spot in the final of the Vijay Hazare Trophy on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-2025-alexander-zverev-relishing-night-matches-in-melbourne-after-second-round-win-2665378-2025-01-15",
      "headline": "Alexander Zverev relishing night matches in Melbourne after second round winAlexander Zverev revealed that he's enjoying playing night matches in the ongoing Australian Open 2025 after his second round victory over Pedro Martinez."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-laughs-off-reports-of-him-being-advised-bed-rest-after-australia-tour-2665384-2025-01-15",
      "headline": "Jasprit Bumrah laughs off reports of him being advised bed rest after Australia tourStar India fast bowler Jasprit Bumrah mocked an X page for spreading fake news about his fitness. Bumrah got injured during the fifth Test vs Australia in Sydney and opted not to bowl from Day 2 onwards."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/south-africa-pacer-anrich-nortje-ruled-out-of-champions-trophy-with-back-injury-2665410-2025-01-15",
      "headline": "South Africa pacer Anrich Nortje ruled out of Champions Trophy with back injurySouth Africa pacer Anrich Nortje will miss the Champions Trophy due to a back injury. Nortje has not played international cricket since the T20 World Cup final in June last year."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/vijay-hazare-trophy-karnataka-beat-haryan-to-reach-final-2665392-2025-01-15",
      "headline": "Vijay Hazare Trophy: Karnataka enter final after comprehensive win over HaryanaKarnataka chased down the 238-run target in 47.2 overs to beat Haryana by 5 wickets and book their spot in the final of the Vijay Hazare Trophy on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/tennis/story/australian-open-2025-alexander-zverev-relishing-night-matches-in-melbourne-after-second-round-win-2665378-2025-01-15",
      "headline": "Alexander Zverev relishing night matches in Melbourne after second round winAlexander Zverev revealed that he's enjoying playing night matches in the ongoing Australian Open 2025 after his second round victory over Pedro Martinez."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/jasprit-bumrah-laughs-off-reports-of-him-being-advised-bed-rest-after-australia-tour-2665384-2025-01-15",
      "headline": "Jasprit Bumrah laughs off reports of him being advised bed rest after Australia tourStar India fast bowler Jasprit Bumrah mocked an X page for spreading fake news about his fitness. Bumrah got injured during the fifth Test vs Australia in Sydney and opted not to bowl from Day 2 onwards."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/india-open-2025-lakshya-prannoy-crash-out-anupama-enters-round-2-2665371-2025-01-15",
      "headline": "Lakshya Sen, HS Prannoy crash out, Anupama enters round 2 Former national champion Anupama Upadhyaya progressed to the second round, but the likes of Lakshya Sen, HS Prannoy and Priyanshu Rajawat failed to go past the opening round on Day 2 of the India Open on Wednesday."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/rohit-sharma-yet-to-confirm-his-availability-for-mumbai-ranji-trophy-report-2665336-2025-01-15",
      "headline": "Rohit Sharma yet to confirm his availability for Mumbai's Ranji clash: ReportIndia captain Rohit Sharma's participation in Mumbai's Ranji Trophy match against Jammu and Kashmir is uncertain. The Mumbai selectors will follow the standard procedure to verify Rohit's availability before announcing the squad on January 20."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/cricket/story/if-scott-boland-had-not-played-india-would-have-won-the-series-vs-australia-r-ashwin-2665332-2025-01-15",
      "headline": "If Boland had not played, India would have won the series vs Australia: R AshwinFormer India spinner Ravichandran Ashwin feels that India would've won the recent Test series against Australia had Scott Boland not played in the rubber."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/sports/badminton/story/pv-sindhu-can-reach-an-even-higher-level-coach-irwansyah-adi-pratama-2665328-2025-01-15",
      "headline": "PV Sindhu can reach an even higher level: New coach Irwansyah Adi PratamaPV Sindhu's new coach, Irwansyah Adi Pratama, is determined to help her reclaim dominance in badminton by enhancing her aggression, speed, and power. "
    }
  ],
  "education": [
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education-today/story/the-role-of-data-analytics-in-modern-advertising-education-2554708-2024-06-18",
      "headline": "The role of data analytics in modern advertising educationThis transformation also exercises a significant impact on the realm of 'advertising education.'"
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/ncert-academic-changes-deletes-azad-pak-chinas-aggression-reference-class-12-political-science-textbook-2554509-2024-06-18",
      "headline": "NCERT deletes Azad Pak, adds China's aggression reference in Class 12 textbookThe NCERT has made final changes to its Class 12 Political Science textbook syllabus for the upcoming academic year, including a revision in reference to India's border situation with China, Azad Pakistan, Article 370 and more."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/neet-ug-paper-leak-case-bihar-police-recover-6-post-dated-cheques-issued-for-question-paper-facilitators-2553988-2024-06-16",
      "headline": "NEET row: Bihar cops find 6 post-dated cheques 'issued for question paper brokers'Six post-dated cheques which were suspected to have been issued in favour of mafia demanding over Rs 30 lakh from each candidate seeking alleged leaked question paper ahead of NEET held last month were recovered by Bihar Police."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/indiatodayineducationgk-and-current-affairsenvironmentforest-fires-surge-tenfold-from-2004-to-2017-causes-impact-and-prevention-2553052-2024-06-14",
      "headline": "Forest fires surge tenfold from 2004 to 2017: Causes, impact and preventionAmidst a relentless surge, intense forest fires are now multiplying tenfold, casting a menacing shadow over our flora and fauna. Year by year, their fiery grip tightens, threatening ecosystems far and wide, now extending their reach to impact human lives."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/law/story/neet-ug-2024-results-exam-controversy-grace-marks-fresh-petition-in-supreme-court-2551262-2024-06-10",
      "headline": "Fresh plea in Supreme Court to recall NEET results, reconduct examsA fresh petition has been filed in the Supreme Courtto recall the National Entrance cum Eligibility Test - Under Graduate (NEET-UG) 2024 results and re-conduct fresh examination afterdiscrepancies in the declared results."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/nta-issues-clarification-after-neet-2024-controversy-cheating-in-exam-high-cut-off-2550063-2024-06-07",
      "headline": "NTA issues clarification after NEET result controversy over toppers, high cut-offIn a detailed statement, the National Testing Agency (NTA) said that the increase in cut-off and number of toppers in the NEET-UG reflect the competitive nature of the exam and maintained that the test's integrity has not been compromised."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/elections/lok-sabha/story/arvind-kejriwal-interview-on-succession-war-bjp-pm-modi-amit-shah-2543356-2024-05-24",
      "headline": "Exclusive: Arvind Kejriwal claims 'BJP succession war, PM backing Amit Shah'Speaking exclusively to India Today TV, Delhi Chief Minister Arvind Kejriwal claimed that there is a \"succession war\" within the BJP. He also claimed that the ruling party is \"not fighting the Lok Sabha elections as a team\"."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/medical-students-appears-as-proxy-candidate-in-neet-in-bihar-arrested-2535929-2024-05-06",
      "headline": "4 medical students arrested in Bihar for appearing as proxies for NEET aspirantsFour MBBS students who appeared in place of NEET aspirants in the medical entrance exam were detained in Bihar's Purnea."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/neet-ug-2024-question-paper-leak-nta-says-claims-baseless-2535867-2024-05-06",
      "headline": "NEET-UG question paper not leaked, claims baseless: National Testing AgencyThe reports claiming question paper leak in the medical entrance exam NEET-UG are \"completely baseless and without any ground\", the National Testing Agency (NTA) has clarified."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-generation-with-answers-tech-savvy-indian-youth-tackling-global-challenges-2520426-2024-03-28",
      "headline": "The generation with answers: Tech-savvy Indian youth tackling global challengesIndia's tech-savvy youth rewriting the global narrative, one solution at a time."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-election-result-left-sweeps-polls-rss-affiliated-abvp-candidates-2519067-2024-03-25",
      "headline": "Left sweeps JNU students' polls, Dhananjay is first Dalit presidentThe Left swept the Jawaharlal Nehru University Students' Union (JNUSU) polls, winning all four posts and trouncing the RSS-affiliated ABVP. The ABVP was leading at one point, but the Left eventually surged ahead and emerged victorious."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/education/story/the-power-of-knowledge-educations-influence-on-real-estate-market-trends-2516316-2024-03-18",
      "headline": "The power of knowledge: Education's influence on real estate market trendsIn a dynamic sector like real estate, investing in continuing education is not simply an option; it is a requirement."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/india/story/jnu-students-body-election-on-march-22-after-4-years-2513140-2024-03-11",
      "headline": "JNU students' body election on March 22 after 4 yearsThe Jawaharlal Nehru University Students' Union (JNUSU) polls will take place on March 22, more than four years after the last elections were held in September 2019."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/india/story/up-12th-board-exam-math-biology-question-papers-leaked-on-whatsapp-uttar-pradesh-2508890-2024-03-01",
      "headline": "UP 12th board exam math, biology papers leaked on WhatsApp, complaint filedThe mathematics and biology question papers for the Uttar Pradesh class 12 board exam were allegedly leaked on a WhatsApp group."
    },
    {
      "sentiment": "negative",
      "url": "https://www.indiatoday.in/education/story/uttar-pradesh-police-constable-recruitment-exam-cancelled-after-paper-leak-re-examination-in-6-months-2506566-2024-02-24",
      "headline": "UP Police Constable recruitment exam cancelled days after paper leakThe Uttar Pradesh Police Constable recruitment exam held on February 17 and 18 was canceled due to a paper leak. The Chief Minister has announced a re-examination within the next six months."
    },
    {
      "sentiment": "positive",
      "url": "https://www.indiatoday.in/magazine/education/story/20110815-indias-best-universities-jawaharlal-nehru-university-747159-2011-08-06",
      "headline": "Jawaharlal Nehru University: Brains trustTeaching and research go hand in hand at the institute which is proud of its activist tradition."
    }
  ]
}